{
    "url": "mailto:?subject=A%20farewell%20from%20Vice-Chancellor%20Professor%20Shearer%20West&body=https://www.nottingham.ac.uk/alumni/a-farewell-from-vice-chancellor-professor-shearer-west",
    "content": [
        {
            "p": "Our monthly bitesize roundup of news, events and other goings on from around the university and into Nottingham. You might need to sit down for the first piece of news - our beloved and legendary nightclub Pryzm (also known as Oceana, Ritzy and the Palais depending on your vintage) has closed down for good! We also check out the activity taking place to mark LGBTQIA+ History Month on campus, which includes our brand new rainbow crossings, there's a moving speech from honorary graduate Samantha Morton as she receives her BAFTA fellowship, the first Varsity fixture of the year and a new study into workplace mindfulness. Few things unite alumni like the memory of a sticky dancefloor and at the beginning of the month the news that iconic Nottingham nightspot Pryzm was to close for good led to an outpouring of grief on our Facebook post above. Variously known as Oceana, Ritzy and the Palais de Danse in previous iterations, it was one of the city's most popular nightclubs since its opening almost exactly a century ago in 1925. The parent group which owns Pryzm nightclubs around the UK had recently called in administrators, with a suggestion that students just aren't visiting nightclubs as much as they used to! Who'd a thunk it? In the course of writing this we discovered a treasure trove of archive photos (below) on a website dedicated to St Ann's Well Road, which meets the location of the building. LGBTQIA+ History Month has been celebrated throughout February at the university every year since 2005 to raise awareness of LGBTQIA+ history, celebrate people within the LGBTQIA+ community and make progress towards a more equitable future. We celebrated this year with a host of film screenings, talks and workshops, opportunities to get hands on and creative as well as giving you the chance to ask questions and learn about LGBTQIA+ identities. Fancy broadening your horizons? Why not check out the LGBTQIA+ reading list, curated by staff and students, which is constantly being updated with new suggestions. And as you can see, our iconic rainbow crossings have all received a glow up for 2024, updating them to display the latest 'Progress Pride Flag' - you can read more about its evolution in this blog from the V&A museum. Renowned actor Samantha Morton paid tribute to her home city in a moving speech at the recent BAFTA awards. Clifton-born Samantha received an honorary degree from the university in 2019 and then like now, was incredibly effusive about the role the Nottingham Television Workshop has played in her incredibly successful career. Revisit Samantha's honorary degree > ICYMI, our very own @UniofNottingham honorary graduate Samantha Morton pays tribute to her Nottingham roots as she receives a hugely well deserved BAFTA fellowship last night. (Yes, like admin you might shed a tear or two, too 🥹) https://t.co/hCTtegIC98 The 2024 Varsity series between the city's two universities began in earnest with a clash on the ice at the Motorpoint Arena earlier this month. Nottingham Trent's team took the spoils in the end, but there's still plenty to play for over the rest of the events. Varsity has been a hugely popular fixture on the sporting calendar since 2001 - you can get tickets to go and watch too! February saw our NUBS team launch a new online Global Alumni Insights webinar series, tapping into the vast network of expertise from their alumni community around the world. The first session, on the topic of fintech, brought expert alumni panelists together to delve into the rapidly growing world of financial technology and its impact on the global economy. Guiding this exciting conversation was Professor Meryem Duygun, founder of the University of Nottingham's INFINITY research hub. Catch up with the webinar below! We asked for your opinion on the support we offer in our annual alumni survey. Catch up with the latest news from around the university in May, including our 1973/74 Golden Reunion and unique running challenge from UNNC! After the Business School appointed a new cohort of Professors of Practice, we spoke to an MBA alumnus returning to campus to share his expertise after 25 years in business One of the most iconic halls on campus, 'Hu Stu' is undergoing a two-year refurb to bring it into the 21st century - take a look at what's planned!"
        }
    ],
    "pdf_files": []
}