{
    "url": "http://www.nottingham.ac.uk/about/facts/league-tables.aspx",
    "content": [
        {
            "p": "At the University of Nottingham, we're not just a place of learning; we're a powerhouse for change. An award-winning university with an international outlook, the University of Nottingham is ranked among the top 20 in the UK and is 108th in the world (QS World University Rankings 2025). A member of the prestigious Russell Group of world-class, research-intensive universities, we deliver teaching excellence and prepare our graduates for the world they will inherit and enable them to make an impact. With a commitment to ground-breaking research and an unparalleled student experience, we're shaping the future on a global scale. Our graduates are not only talented but trailblazers in their fields. (UniCompare 2025) (Research Excellence Framework 2021) (QS World University Rankings 2025) We are delighted to be top 15 in the UK and top 40 globally in the QS World University Rankings: Sustainability 2025 - placing 13 in the UK out of 98 institutions, and 36 out of 1,744 universities worldwide. These rankings highlight the ways in which universities are taking action to tackle the world’s greatest environmental, social and governance challenges. We are proud to be recognised for our unwavering commitment to sustainability, both as a centre of education and research, and as a major employer tackling the operational sustainability challenges of a large organisation. These rankings also highlight the tangible impact our alumni are making to solve climate issues, as well as how our research is advancing the United Nations’ Sustainable Development Goals (SDGs). Read more about our commitment to the SDGs We’re the third most targeted university by top UK employers (The Graduate Market in 2024, High Fliers), and have been top 10 since 2013. We are also proud to rank 66 in the world and 10 in the UK for employability (QS Graduate Employability Rankings 2022). Boost your career potential We are Sports University of the Year 2024 in The Times and The Sunday Times Good University Guide 2024 and the Daily Mail University Guide 2024. It's a crown we've won before in 2021 and 2019, in The Times and The Sunday Times Good University Guide. Be part of the team Nottingham University Business School has solidified its reputation as a global education leader earning top rankings in finance, international trade, and other key disciplines. Discover our business excellence A thriving city with a legendary past, we're proud to call one of the best student cities in the UK our home (51st in the world and 9th of the UK cities featured, QS Best Student Cities 2025). A great place to live Educational excellence and student experience (click on the plus button to discover more) Join the University of Nottingham and be taught by academics who are leaders in their field, while enjoying a student experience that’s rated among the very best in the country. Why students choose us Rankings Results QS Sustainability Rankings 2025 13 36 QS World University Rankings 2025 18 108 QS World University Rankings: Europe 2025 15 24 The Times Higher Education World University Rankings 2024 16 136 The Daily Mail University Guide 2024 32 NA The Complete University Guide 2025 30 The Times and The Sunday Times Good University Guide 2024 The Guardian University Guide 2024 Financial Times Masters in Finance 2024 10 In the 2021 Research Excellence Framework (REF) – the UK's official assessment of the quality of research in UK higher education institutions – we have been placed 7th in the UK for research power, according to analysis by Times Higher Education (THE). 100% of our research is recognised internationally, and 90% is classed as 'world-leading' or 'internationally excellent', according to THE's analysis. Discover our world-changing research In 2003, our leading academic Sir Peter Mansfield was awarded the Nobel Prize in Physiology or Medicine with Paul Lauterbur 'for their discoveries concerning magnetic resonance imaging' (MRI). Today, it is estimated that an MRI scan takes place every 3 seconds, improving outcomes for millions around the world. We are continuing to push the boundaries of MRI and have recently been awarded £29.1 million to establish the UK’s most powerful Magnetic Resonance Imaging (MRI) scanner as a national facility. This scanner will give researchers and doctors unprecedented insights into brain function and the mechanisms of human disease. Learn more about the history of MRI Nottingham Technology Ventures has helped to support a wide range of businesses get off the ground and supported their development. As of June 2024, we have 35 active spin-out companies - technological innovations developed from our research. Bringing business and research together We actively address the complex challenges facing our planet and are committed to making significant contributions to the United Nations Sustainable Development Goals (SDGs). We’re proud to be recognised among the world’s top higher education institutions for our efforts, ranking in the Top 200 in the Times Higher Education Impact Rankings 2024. These global rankings evaluate more than 2,000 universities from 125 countries based on their performance against the United Nations’ 17 Sustainable Development Goals, which set out a blueprint for creating a more sustainable future. Our world-leading research places us within the world’s Top 100 for a number of individual SDG goals: While there is still a long road ahead, these results show our unwavering dedication to the SDGs and our commitment to creating a better future for all through pioneering research and education. This is the place making the sustainable obtainable. Find out more about our commitment to the goals"
        }
    ],
    "pdf_files": []
}