{
    "url": "https://www.nottingham.ac.uk/about/castle-meadow/castle-meadow-campus.aspx",
    "content": [
        {
            "p": "Let’s grow some place extraordinary This is the place where talent, expertise and industry come alive for society to thrive. Where mighty ideas seed, powerful connections take up root, and business blooms. A dynamic hub for innovation and entrepreneurship. A driving force for economic growth and positive change. A vibrant community of academics, students, and industry partners, supported by state-of-the-art facilities in a prime city centre location. Welcome to Castle Meadow Campus. Rooted in the heart of the city, Castle Meadow Campus is the university’s new home of enterprise. A world where teaching, research, and practice will converge For students: This will be a nurturing environment sharing practical skills and real-world experience. CMC is bridging academia and industry, offering valuable insights and opportunities to collaborate. For businesses: an ideal space for partnering and growth. Here co-working areas and innovation labs will foster entrepreneurship and drive economic progress. For the local community: an inclusive space which will help to solve challenges through research projects, community initiatives, and knowledge-sharing events. Enter a space where new ideas and opportunities flourish Here, exploration knows no limits. As a hub for innovative research, we attract opportunities by reaching out to individuals, local community groups and businesses for their expertise and support. These might include research collaborations, industry partnerships, funding opportunities, internships and community engagement initiatives. So much more than just a landlord, we actively seek long-term collaborations with the ever-present aim to uplift society and upskill our community. Meet the people who can bring projects to life in powerful new ways Collaboration is at the heart of everything we do here at Castle Meadow Campus. We believe in the power of diverse partnerships and the strength of interdisciplinary teamwork. Wide-ranging support through health clinics to improve well-being and legal clinics to ensure access to justice – we aim to foster collaborations that make a real-world impact. Our dynamic and agile spaces provide opportunities to engage in hackathons, workshops, skills development and, ultimately, change and growth. Join us in solving society’s most pressing problems Here we drive positive change by addressing urgent issues like sustainability, poverty alleviation, and healthcare access. We do so by embracing problem-solving activities and social innovation projects. Through mentorship and funding, we support aspiring entrepreneurs in turning their ideas into reality. Castle Meadow Campus is the place where hackathons, exhibition spaces and community events come together to create an enriching and collaborative environment. If you’d like to know more about the exciting facilities and opportunities available at Castle Meadow Campus, please email us at Castlemeadowcampus@nottingham.ac.uk Inspiring transformation. Cultivating innovation. Here we grow."
        }
    ],
    "pdf_files": []
}