{
    "url": "https://www.nottingham.edu.my/AboutUs/Management-Board/Index.aspx",
    "content": [
        {
            "p": "Professor David FitzPatrick was recently appointed as Pro-Vice Chancellor at University of Nottingham. He has assumed the role of Interim Provost and CEO at the University of Nottingham Malaysia on 1 June 2024 and in line with formal requirements in Malaysia, this is subject to Ministry of Higher Education approval. He joins us from the Technological University Dublin (TU Dublin), where he served as the inaugural president following its designation as a Technological University on 1 January 2019. Professor FitzPatrick brings a wealth of experience from both industry and academic career perspectives to his management and leadership. Prior to his tenure at TU Dublin, he held prominent positions at University College Dublin (UCD) from 1998 to 2018, including Head of School, Vice Principal for Internationalisation & Development, and contemporaneously, Principal of the College and Dean of Engineering& Architecture. His extensive academic credentials are complemented by considerable executive experience, a significant international profile, and extensive industry experience. He managed product development and research of orthopaedic devices for the international division of a major US medical devices organisation. Professor FitzPatrick holds a bachelor's degree in mechanical engineering from Trinity College Dublin and a doctorate in biomechanics from the University of Oxford. After earning his doctorate, he worked in the orthopaedic industry with Howmedica International Ltd. in Limerick and DePuy International in Leeds. His roles included managing product development, strategy, and research programmes for knee, upper limb, trauma, and spinal product lines. In 1998, Professor FitzPatrick returned to Ireland to join UCD’s Department of Mechanical Engineering. He was promoted to Senior Lecturer in 2005, Associate Professor in 2010, and full Professor in 2012. He served as Head of the School of Electrical, Electronic and Mechanical Engineering from September 2005 to August 2011 and later as Vice Principal for Internationalisation & Development in the College of Engineering and Architecture. In 2012, Professor FitzPatrick was appointed as the inaugural Provost of the Beijing-Dublin International College, where he led the development of Ireland’s largest dual-degree programme initiative in China. He continued in this role while also serving as Principal of UCD’s College of Engineering & Architecture and as a member of UCD’s University Management Team from 2014 to 2018, before becoming President of TU Dublin on 1 January 2019. Professor FitzPatrick’s research primarily focuses on orthopaedic mechanics and medical device design, particularly concerning the knee joint and spine. He has published extensively in peer-reviewed journals and major international conference proceedings. His work has been recognised with prestigious awards, including the International Society of Biomechanics Clinical Biomechanics Award (2003) and the Royal Academy of Medicine in Ireland (RAMI) Haughton Lecture & RAMI Silver Medal (2017). Professor Hazel Melanie Ramos is the Vice Provost (Teaching and Learning) at University of Nottingham Malaysia. Prior to this, she was the Associate Dean for teaching and Learning at the Faculty of Arts and Social Sciences and was Head of School of the Division of Organisational and Applied Psychology. Hazel is also the campus lead for the tri-campus Teaching and Learning Observation College (TLOC). Professor Ramos completed her undergraduate degree in Business Administration from the University of the Philippines Diliman before pursuing an MA in Counseling Psychology at the Ateneo De Manila University in the Philippines. She then completed her PhD in Clinical Psychology also at the Ateneo de Manila University. In 2012, she obtained her Postgraduate Certificate in Higher Education (PGCHE) from the University of Nottingham and is a Senior Fellow of the Advance HE (formerly UK HEA). Professor Ramos joined the University in 2006 as an Assistant Professor in I/O Psychology and became an Associate Professor in 2013. She has also served as Course Director for the school’s PGT and PGR programmes. Professor Ramos’ research covers areas of work psychology such as work-family conflicts, stress and burnout, and psychological ownership in family firms. More recently, she has explored innovative work behaviours and the management of non-family employees. She is one of the founding organisers of the annual Asia Pacific Family Business Symposium. Professor Ir Dr Mohd Shahir Liew assumed the position of Vice Provost of Research and Knowledge Exchange (RKE) in December 2023. In this role, he is dedicated to advancing the institution's research and knowledge exchange strategies which includes spearheading collaborative initiatives and fostering interdisciplinary partnerships. Throughout his career in academia, Prof Shahir has held numerous senior academic and leadership positions in Civil and Environmental Engineering, as well as in Geosciences and Petroleum Engineering. He is registered engineer in the USA, UK and Malaysia, having established his own companies in addition to engineering consultancy before transitioning into academia in 2009. Prof Shahir obtained his BSc and PhD (Structural Dynamics) from Texas Tech University in the United States, focusing on offshore engineering and structural dynamics Professor Law Chung Lim is the Interim Dean of the Faculty of Science and Engineering. He indirectly manages the operational and strategic matters of 11 schools (Chemical and Environmental Engineering; Civil Engineering; Electrical and Electronic Engineering; Mechanical, Materials and Manufacturing Engineering; Mathematical Sciences; Biomedical Sciences; Computer Science; Environmental and Geographical Sciences; Pharmacy and Psychology). In this role, he is responsible for providing leadership, which promotes academic achievements and research excellence within the Faculty and oversees all external and operational matters of the faculty. Professor Law has more than 20 years of experience in Research and Development, especially in the areas of industrial drying, food and bioproduct processing, fluidised bed technology, food and bioproduct processing, food preservation, food quality, and food safety. Furthermore, his research group also focuses on development food processing technology and has developed a number of pilot scale prototypes for the processing of fruits (ciku, chempedak, salak), agricultural products (rough rice, natural rubber), herbal products (Ganoderma Lingzhi, Misai Kuching, Belalai Gajah, Roselle) and edible bird’s nest. Prior to this appointment, he was the Head of Department of Chemical and Environmental Engineering at University of Nottingham Malaysia (UNM) and also the Acting Dean of Faculty of Arts and Social Sciences for seven months. Externally, Professor Law serves as the Associate Director of Engineering Accreditation Department of Engineering Accreditation Council, Malaysia; Leader for the Board of Engineers Malaysia Professional Competency Examination for Chemical Discipline; and Chair of the Institution of Chemical Engineers Malaysian Board. Professor Law holds a doctorate in Chemical and Process Engineering from the National University of Malaysia (UKM), and a master’s degree and a bachelor’s degree in Chemical and Process Engineering from the same university. He also obtained a Post Graduate Certificate of Higher Education (PGCHE) in 2010, a professional recognition in higher education and is now a fellow of the Higher Education Academy UK. He also registered with the Board of Engineers Malaysia as a Professional Engineer with a practising Certificate in the chemical discipline. Additionally, he is registered with the Engineering Council UK as a chartered chemical engineering and Science Council as a chartered scientist. His interests include reading and swimming, He occasionally assists in conducting dharma classes for standard three school students. Dr Jason Pandya-Wood joined the University of Nottingham Malaysia as the Dean of the Faculty of Arts and Social Sciences in June 2020. He is responsible for the strategic and operational leadership of six schools (Business, Economics, Education, English, Media, Languages & Cultures, Politics, History & International Relations), one division (Organisational & Applied Psychology), one centre (English Language and Foundation Education) and one department (General Studies). Jason’s starting point is an unwavering belief that universities must be significant and active civic partners in addressing the most pressing economic, social, political, technological and moral challenges of our time. Universities should therefore be of and not just in their communities and industries, and at the very heart of policy debate. Prior to his appointment, Jason was most recently Director of External Engagement and Strategic Partnerships at Nottingham Trent University. He led the School’s strategy for engagement with local, national and international partners, including an extensive focus on work with Malaysian partners. Jason’s research interests are in the broad discipline of social policy, with a particular interest in applied social policy research and evaluation, and impactful and participatory research projects that link theory, policy and practice. Jason’s research and consultancy work has involved collaboration with, and funding from, a diverse range of bodies including: the Malaysian Anti-Corruption Commission, UK Home Office, Ministry of Justice, Department of Education, NESTA, British Museum and the Cabinet Office. Prior to entering academic life, Jason’s professional background was in youth and community work, helping young people to make successful transitions to adulthood and improving the life chances of people living in some of the most disadvantaged communities. You can follow Jason on twitter Patrick Joseph, the Registrar of the University of Nottingham Malaysia (UNM), serves on the Management Board. In this role, he is responsible for overseeing the efficient delivery of student administrative and support services at UNM. This involves delivering professional services, policy development and managing UNM’s student experience from admissions to alumni. His responsibilities include the student services strategy and related operations, governance and assurance, legal and compliance. In particular, he has leadership and management responsibilities at the Admissions Office, Student Registry Office, Students’ Association Office, Career Advisory Services, Sports Complex, Wellbeing and Learning Support, International Student Support, Governance, as well as for the Hall Wardens and Tutors. He also has responsibility for the overall student experience, widening participation and community engagement at UNM. Patrick was one of the first to join UNM when it began operations in 2000. Having started in student recruitment, he went on to establish the various departments and administrative services such as facilities management, the exams and timetabling office, and the student registry office as part of the growth of the campus. He was appointed Director of Academic Services in 2012 and Registrar in 2020. He was awarded the Lord Dearing Award for Teaching and Learning in recognition of his contributions in providing the administrative and support services in enhancing the learning experience of students at the University in 2015. Patrick chairs the Student Experience Committee, Hardship Fund Panel, the MAD Money Panel, the Colenso Travel fund panel, Alumni Laureate Awards panel, Academic Services Group and co-chairs the COVID-19 Operations Group and the Staff Experience Committee. He also sits on a number of other committees including the Campus Teaching Committee. Kylie Colvin joined in September 2019 as the Chief Strategy and Operations Officer for the University of Nottingham Malaysia (UNM) and is a member of the Management Board. She works with stakeholders across the University to design, deliver and monitor new strategic initiatives. Kylie is also responsible for data analysis and research into UNM's strategic positioning, competitors and benchmarking of performance, as well as transforming key business processes to ensure effective management and governance of strategy. Kylie has recently been appointed as the Chair of the Strategic Working Group for UK5 Universities; working with external stakeholders for advocacy and positioning of quality higher education in Malaysia. Jagdish Singh Malhi (Jag) joined the University of Nottingham Malaysia on 1 June 2021 as the new Director of Student Recruitment and Marketing. In his new role, he is responsible for the University’s student recruitment, marketing and external communications, leading UNM domestic and overseas recruitment teams, corporate marketing, communications, scholarship, and alumni relations teams. Jag has 15 years of experience and core competencies in digital transformation, sales and marketing in the education, media and financial services sectors. His regional work experience spans Asia, Africa and the Middle East with experience in setting up and managing international sales and marketing teams, and managing a revenue responsibility of $20m. In his most recent role with a university, Jag led the marketing and student recruitment department for Swinburne University of Technology Sarawak Campus from 2016-2020 and was a member of the Executive Group responsible for the overall success of the university. During his tenure there, student enrolments grew by double digit percentage points annually through a new commercial strategy, course development, digital transformation and talent development. A business graduate, Jag began his career with Standard Chartered Bank in 2008 as one of five Malaysians accepted into the International Graduate Programme before joining CIMB Group in 2010 as a founding member of the digital marketing team. He then moved into media consulting and was CEO of a media company before joining Swinburne University of Technology Sarawak Campus and most recently, Kolej Tuanku Ja’afar as the Director of Marketing and Admissions. Jag is married with two children and enjoys reading, traveling, and spending time with his family, long drives and barbeques. Director of Human Resource Lizda Rahman believes that HR provides leadership and guidance in ensuring the University acquires quality staff globally and locally; continues to motivate and retain highly talented staff; and develops staff capability through various staff development programmes. This is crucial as a business partner to support the University's Strategic Roadmap, especially in order to sustain excellence. Armed with a Bachelor of Arts in Social Science from University Malaya, and a decade of various roles at one of the nation’s major telcos, she joined the University of Nottingham Malaysia on 25 August 2005 where she held various roles in marketing, strategic planning, corporate affairs, and international business ventures before settling in Human Resource as Assistant Human Resource Manager. In 2009, she was promoted to Human Resource Manager and attained her current position as Director of Human Resource in 2013. Noorulhadi Mohamed is the Director of Financial and Business Services for the University of Nottingham Malaysia. Hadi has worked for Boustead for about 20 years and has vast knowledge and experience both in the University and within the Group. He assumed the responsibility for the financial, legal, procurement and risk management portfolios for the University on 1 January 2019. Having served for the Boustead Group and the University for almost 20 years now, he comes with knowledge and vast experience that is an asset to the University. His key successes include the Groupwide Finance and Payroll System implementation; Finance and GST, Supply Chain Enterprise system rollout, including Supply Chain ERP system and Enterprise Human Capital, Payroll System rollout and e-Leave workflow. He holds a bachelor’s degree in Accounting and Finance from Lancaster University, UK. Hadi’s passion for sports led him to become the Vice President of the Boustead Sports Club. He is also ardent on voluntary services and has been ensuring proper management of funds for a timeshare company. He was previously part of the Support Group Bureau and Communication Bureau of Parents-Teachers Association and he was part of the fund raising committee to build a community school for children. Vivien Yuen joined the University of Nottingham Malaysia in July 2021 as the Finance Director of Special Projects. In her role, she works with the Provost and CEO on projects for strategic delivery and business planning. Vivien’s responsibilities include the implementation of a new budget planning process and forecasting models for UNM’s Strategic Plans and ambitions for the coming years. She is a member of the Management Board. Vivien has previously served as the Group Financial Controller of AirAsia and was the VP of Finance of INTI International University and Colleges. She has also held various senior positions at Antah Schindler and Kellogg’s bringing with her a deep understanding of financial reporting, budgeting and forecasting, finance operations, systems implementation and project management. Vivien holds a Bachelor of Business (Accounting) degree from the RMIT University in Melbourne. She has a keen interest in travelling, music and watching sports, especially tennis and football. Vivi Lim is the Director of Information Services and serves on the Management Board at the University of Nottingham Malaysia (UNM). In this role, she provides strategic leadership and oversight of all IT operations and strategies at UNM. Lim leads the IT Services team to foster a strong service culture, ensure continuity of operations, and drive continual improvement. Her focus is to align the IT function in support of the university's core activities of teaching, research, and enhancing the student experience. Additionally, Lim is responsible for overseeing and implementing new and refreshed policies related to IT provision and service delivery at UNM. Lim's journey at UNM began in 2007 when she joined as an IT Helpdesk Officer. She eventually progressed into a managerial role in 2016 and was subsequently appointed as the Head of IT Services in 2018, before assuming her current position as Director in 2022. Academically, Lim holds a Master's degree in Computer Science from the University of Malaya. She has also acquired several foundational and intermediate ITIL professional certifications. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia THE UNIVERSITY OF NOTTINGHAM IN MALAYSIA SDN. BHD. DULN001(B) (473520-K) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}