{
    "url": "https://www.nottingham.ac.uk/about/government-relations/global-dialogues/global-dialogues.aspx",
    "content": [
        {
            "p": "As part of our core mission as a 'Global Civic University', Nottingham’s response to Brexit has been to launch a number of major initiatives that are aimed at articulating the value of a global perspective to a range of different audiences and stakeholder. In addition to predominantly UK local and national policymaker engagement, the University have launched a series of high-profile 'Global Dialogues' thought-leadership events in priority cities and territories. These events are developed in conjunction with the UK Government and bring together a range of different perspectives from the University, UK overseas agencies and international business. On 22 March 2018 the Institute for Asia and Pacific Studies, in association with the Centre for the Study of Social and Global Justice and the Human Rights Law Centre, hosted a roundtable event on economic and social rights in Bangladesh. Contributors included: In the evening Sara Hossain delivered the annual Tomlinson Memorial Lecture entitled Freedom of Expression in Bangladesh: Space for dissent closes down. Tomlinson memorial lecture Hosted by the House of Commons on 26 October 2016, as part of the Nottingham in Parliament Day initiative, this lunchtime reception brought together leading diplomats and global influencers. Chaired by Professor Robin Grimes, Chief Scientific Adviser for the Foreign and Commonwealth Office, this event featured speakers including Professor Sir David Greenaway, former Vice-Chancellor of the University of Nottingham, and Rt Hon. Lord Willetts, former Minister of State for Universities and Science, Department for Business, Innovation and Skills. The event was organised in partnership with Asia House, the China-Britain Business Council and East Midlands Airport. Hosted by the British-Consulate General Hong Kong on 4 November 2016, this event interrogated the role of universities and international businesses which seek to promote global flows of talent and understanding in the context of a growing trend for the rejection of ‘expertise’ by the public and politicians. Chaired by Michael Lawrence, Chief Executive of Asia House in London, this event featured contributions from Jo Lusby, Managing Director at Penguin Random House North Asia, Professor Andy Hor, Vice-President (Research) Hong Kong University, Chris Birdsong, CEO of Atkins Asia Pacific, and Professor Dame Jessica Corner, Pro-Vice Chancellor for Research and Knowledge Exchange at the University of Nottingham. Image gallery His Excellency Alexander Downer AC, Australian High Commissioner to the UK, visited the Institute of Asia and Pacific Studies (IAPS) in February 2017. The High Commissioner engaged with academics working on the region or with Australian universities. He was keen to facilitate even deeper research and teaching engagement between University of Nottingham academics and Australian universities, and was interested to learn about the new initiative IAPS Dialogue. The High Commissioner also met with Australian students studying here and students who had spent a year aboard at Australian institutions, and concluded his visit by delivering a well-attended lecture on the subject of 'Australia, Brexit and the Rise of Asia.' Organised in partnership with Asia House on 14 March 2017, this event brought together senior business figures, the diplomatic community from Europe and Asia. The main speakers were Professor Sir David Greenaway, former Vice-Chancellor of the University of Nottingham, and Sergei Guriev, Chief Economist of the European Bank for Reconstruction and Development. They helped chart a course for the future of globalisation, addressing questions such as How can globalisation ensure more economic inclusivity in the future? Is total reform needed, or can we introduce policies that tinker around the edges? 65 guests joined Deputy Head of Mission to the US, Patrick Davies OBE at his residence, for an evening hosted together with the former Vice-Chancellor, Professor Sir David Greenaway, on 20 April 2017. During the event guests were treated to an extremely thought provoking panel discussion on one of our five new Research Beacons, Global Slavery, followed by a lively Q&A session. Guests including alumni, students holding offers to study at Nottingham and research partners also had the opportunity to network and find out more exciting news on what is happening at Nottingham from members of our Executive Team. The event on 22 June 2017 marked the 20th Anniversary of The Dearing Report, which fundamentally reshaped the structure and direction of UK higher education, creating the conditions that have, and will continue to underpin the future of Britain’s knowledge economy. Speakers included Professor Sir David Greenaway, former Vice-Chancellor of the University of Nottingham; Montserrat Gomendio, Deputy Director, OECD and former Spanish Secretary of State for Education and Universities; Rt Hon. Lord David Willetts, former UK Minister of State for Universities and Science. Hosted at the Asia House headquarters in London, the reception on 7 September 2017 celebrated the vital role of culture and education in Sino-British relations. The guest speaker was His Excellency Mr Liu Xiaoming, Chinese Ambassador to the United Kingdom since 2009. Guests included University’s many friends and partners from across the worlds of business, government, and higher education, with whom we have worked to build bridges between the UK and China – across which talent, innovation, cultural-exchange and prosperity have flowed. Lew Lukens visited the University of Nottingham on 25 September 2017. After finding out more about the university’s Research Strategy, launched in June this year, he was introduced to key members of the Rights Lab beacon. He then chatted with students and staff from the Department of American and Canadian Studies and the School of Politics and International Relations. Mr Lukens also had a tour of the Ingenuity Lab, in Jubilee Campus, and enjoyed pitches from students before being interviewed by University Radio Nottingham. The previous day he had joined the Robin Hood Marathon. Hosted in the House of Commons on 20 November 2017, this reception was attended by senior alumni and friends of the University of Nottingham from across the worlds of UK and international politics and policy. Dr Tedros Adhanom Ghebreyesus, who has recently become the first African Director-General of the World Health Organisation, graduated from Nottingham with a PhD in Community Health. Dr Tedros is globally recognised as a health scholar, researcher and diplomat with first-hand experience in leadership in emergency responses to epidemics."
        }
    ],
    "pdf_files": []
}