{
    "url": "https://www.nottingham.edu.my/AboutUs/Index.aspx",
    "content": [
        {
            "p": "Welcome to the University of Nottingham Malaysia, an integral branch campus of the esteemed University of Nottingham, UK. As one of the top 100 universities globally and the UK's most prestigious universities with a global reach, the University of Nottingham is committed to providing a world-class education, an enriching student experience and research environment that fosters innovation, creativity, and excellence. The University of Nottingham stands among the UK’s top universities, known as Britain’s first “truly global university” for its unique International Curriculum and diverse student and staff population across its three global campuses. For over a century, the university has been at the forefront of groundbreaking research, attracting and nurturing some of the world’s brightest minds. Guided by a vision of being a university with a global outlook, it continues to foster ambitious, entrepreneurial, and creative minds. Our Malaysia campus, established in 2000, embodies the same commitment to academic quality and student experience that defines our institution worldwide. Located amidst lush greens and stunning vistas in Semenyih, our 48-hectare campus offers a unique multicultural environment where students from around the world come together to learn, grow, and make lasting connections. It is home to over 4,000 students from 74 countries and a global alumni network of over 340,000. At the University of Nottingham Malaysia, we take pride in our diverse community of students, faculty, and staff who are dedicated to pushing the boundaries of knowledge and making a positive impact on society. Our diverse and highly qualified academic staff offer an unparalleled student-centric style of learning that will equip you with the skills and analytical abilities to thrive in today's rapidly changing world. Whether you are a current or prospective student, a parent, a visiting scholar, or a member of the public, we invite you to experience a world-class educational journey with us. We look forward to welcoming you to our campus and sharing the University of Nottingham experience with you. Professor David FitzPatrick Pro-Vice Chancellor, University of Nottingham Interim Provost and CEO, University of Nottingham Malaysia Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia THE UNIVERSITY OF NOTTINGHAM IN MALAYSIA SDN. BHD. DULN001(B) (473520-K) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}