{
    "url": "https://www.nottingham.ac.uk/about/facilities/artandperformance.aspx",
    "content": [
        {
            "p": "Lakeside is The University of Nottingham’s public arts centre and plays an integral and inspiring part in Nottingham's cultural life with its fully-accessible and purpose-built venues. Lakeside aims to appeal to a diverse audience with a year-round wide-ranging programme, including: Located at the South Entrance of University Park and situated by beautiful parkland with lakeside views, the centre is also host to two distinctly different eateries, Café L and Aqua . In 2001 the DH Lawrence Pavilion, home to the Djanogly Theatre, Wallner Gallery and Weston Gallery, was added to the existing Lakeside portfolio of the Djanogly Recital Hall and Djanogly Art Gallery. The development has added to the University's collection of architectural honours with awards for craftsmanship, a Civic Trust Award and a short-listed place for the Royal Institute of British Architects (RIBA) Award for Architecture. The Pavilion is also home to the Visual arts Workshop, the Performing Arts Workshop and an Artist-in-Residence Studio . For further information about DH Lawrence visit The University of Nottingham's DH Lawrence website . Regarded as one of the best in the UK, the superb acoustics in the compact concert hall make it a favourite with the BBC for recording and broadcasting. The Djanogly Recital Hall: The Djanogly Art Gallery is a popular venue, internationally renowned for: The 225 capacity Djanogly Theatre provides a stimulating and broad programme of drama, dance, comedy, jazz and world music, along with literary events. Since 2003 Lakeside has also been developing a name for its own in-house productions . The Weston Gallery presents: The University has a number of student companies, such as the New Theatre , the Gilbert and Sullivan Society and Musicality. New Theatre perform a number of times each year in their own theatre. The Gilbert and Sullivan Society and Musicality perform at venues off campus. The Djanogly Theatre plays an important role in the community and has been active in developing partnerships with local arts agencies and initiatives including: For further information visit the Lakeside Arts Centre website ."
        }
    ],
    "pdf_files": []
}