{
    "url": "https://www.nottingham.edu.my/AboutUs/History/campuses.aspx",
    "content": [
        {
            "p": "Since our beginnings as a civic college in Nottingham, UK, in 1881, The University of Nottingham has continued to grow and have established a number of campuses at home and abroad. In 1970 we established the UK’s first Medical School in the 20th century, and in 1995 the School of Nursing was formed following the merger of the Mid-Trent College of Nursing and Midwifery. In 2003 a new campus was opened in Derby City General Hospital. The £50 million Jubilee Campus development opened in 1999 and subsequently phase two opened in March 2009. The campus has won numerous awards due to its environmentally-friendly features. In March 2005 The University opened the King’s Meadow Campus in the former Carlton Television Studios. The campus is home to many of The University’s administrative and support units, Manuscripts and Special Collections and two television studios. The University of Nottingham officially opened the School of Veterinary Medicine and Science on Sutton Bonington Campus in April 2007, having admitted its first students in September 2006. It was the first purpose- built new veterinary school to be opened in the UK in 50 years. No video playback capabilities detected. Why not try to download the file instead? MP4 (Windows, OSX - 12.6MB), OGG (Linux - 14.8MB) The University opened a campus in Malaysia in 2000, before opening a new purpose-built park campus in September of 2005 in Semenyih, Malaysia. In 2015, it celebrates its 15th year anniversary. In September 2004 a purpose-built campus was opened in the city of Ningbo, China, as part of a joint venture. The University then became the first foreign university to establish an independent campus in China. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia THE UNIVERSITY OF NOTTINGHAM IN MALAYSIA SDN. BHD. DULN001(B) (473520-K) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}