{
    "url": "https://www.nottingham.ac.uk/about/government-relations/asia-house-partnership.aspx",
    "content": [
        {
            "p": "Situated in the centre of London, Asia House is the leading pan-Asian organisation in the UK. Asia House aims to advance economic and political engagement between Europe and Asia by bringing together senior decision-makers, business leaders and opinion formers to engage in high-level discussions that influence business and policy strategies. The Asia House website provides details about upcoming events, summaries of meetings and articles on a variety of Asia-related topics ranging from politics to arts and Japane cuisine. The partnership between the University of Nottingham and Asia House offers a series of opportunities and resources both to academics and researchers, and to professional services staff, including attendance of events in the Asia House Business & Policy programme. More details can be found on Workspace On 24 April 2018 Asia House hosted UK Universities: global connections, local impact, the Going Global Malaysia 2018 London Reception. This event aimed to present a unified UK voice in terms of the value to the UK provided by universities through their global connections, research and education provision. Speakers included: On 12 June 2018 Asia House hosted Re-alignment post-Brexit: Power centres in Asia event to mark the launch of the University of Nottingham Asia Research Institute. The Director of the newly founded Institute, Professor Katharine Adeney, was in conversation with Lord Desai, Emeritus Professor of Economics, and Carrie Gracie, BBC China Editor (2014-2018), on topical issues including The Belt and Road Initiative, China’s rise in the international financial system, India’s position vis-a-vis China and whether the historic links with the UK provided an opportunity post-Brexit. On 7 September 2017 Asia House hosted a reception to celebrate the vital role of culture and education in Sino-British relations. The guest speaker was His Excellency Mr Liu Xiaoming, Chinese Ambassador to the United Kingdom since 2009. Guests included University’s many friends and partners from across the worlds of business, government, and higher education, with whom we have worked to build bridges between the UK and China – across which talent, innovation, cultural-exchange and prosperity have flowed. Asia House was one of the partners for Global Science Diplomacy and the Role of Universities in International Relations, an event held in the House of Commons on 25 October 2016 as part of Nottingham in Parliament Day. Chaired by Professor Robin Grimes, Chief Scientific Adviser for the Foreign and Commonwealth Office, this lunchtime reception featured speakers including Professor Sir David Greenaway, former Vice-Chancellor of The University of Nottingham, and Rt. Hon. Lord Willetts, Minister of State for Universities and Science, Department for Business, Innovation and Skills (2010–2014)."
        }
    ],
    "pdf_files": []
}