{
    "url": "https://www.nottingham.edu.my/AboutUs/Datesandcampusinformation/Calendar/Publicholidays/index.aspx",
    "content": [
        {
            "p": "We understand the significance of public holidays and their impact on students' academic schedules and daily lives. This page aims to provide you with essential information regarding Malaysia public holidays, including a list of significant holidays, their cultural or historical significance, and how they may affect university operations. The University of Nottingham Malaysia Campus will be closed for the following public holidays. * Subject to change Public holidays may have implications for academic deadlines, examinations and other academic-related activities. Thus, it is important to take note of any adjustments or extensions provided by the university to accommodate Malaysian public holidays. We encourage our students to plan their study schedules and manage coursework effectively by accounting for the changes in classes due to public holidays. Please note that when a holiday falls on a Sunday the university will be closed on the day after (Monday). When a public holiday falls on a Saturday, the university will be open as usual on the Monday. Yes, classes are usually cancelled on public holidays. UNM will inform students in advance if there are any adjustments to class schedules. Public holidays may occasionally lead to adjustments in assignment deadlines or exam schedules. Changes or extensions related to academic deadlines and examinations will be communicated to students. Some facilities and services may not be available during university holidays. Students will be notified regarding any closures or modified operating hours for campus facilities. In most cases, online learning platforms and resources will remain accessible during the holidays. We hope to ensure that students still have access to digital resources even during public holidays and semester breaks. These services are usually not available during public holidays. Yes, students are free to stay in their on-campus accommodation during public holidays if they are not travelling or returning to their hometowns. Yes, you can travel during public holidays. In fact, there are usually long weekends when a public holiday coincides with the weekend. Many people in Malaysia travel and go for short breaks during these long weekends. UNM may organise special events or activities during public holidays to celebrate festivals and engage students in the festivities. Information about these events will be communicated in advance. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia THE UNIVERSITY OF NOTTINGHAM IN MALAYSIA SDN. BHD. DULN001(B) (473520-K) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}