{
    "url": "https://www.nottingham.edu.my/AboutUs/Campuses/Malaysia.aspx",
    "content": [
        {
            "p": "The University of Nottingham Malaysia (UNM) opened in September 2000 to become the first campus of a British University in Malaysia and one of the first anywhere in the world - earning the distinction of the Queen's Award for Enterprise 2001 and the Queen's Award for Industry (International Trade) 2006. In September 2005, the Malaysia Campus moved to its new purpose-built campus at Semenyih, 30km south of Kuala Lumpur city centre. A picturesque location spanning across 48-hectare and overlooking green hills, the campus was designed to mirror the attributes of University Park in the UK. As a self-contained and self-sufficient neighbourhood village within a garden environment, it is now home to more than 5000 students. The University confers exactly the same degrees as those in the UK and all courses are taught in English. It combines a high-quality living environment with state-of-the-art learning, teaching and research facilities. Other campus amenities include: Students wishing to go to Kuala Lumpur or the surrounding areas can do so by means of bus or rail, accessible via complimentary shuttle service departing from campus. Further information on maps, directions, transport and travel to the campus. The Kuala Lumpur Teaching Centre (KLTC) is located within the Chulan Tower in the heart of Kuala Lumpur city centre. Certain postgraduate programmes such as International Relations, Management Psychology and our MBA are delivered here. The KLTC comprises several: It is also home to the South East Asia Office of The University of Nottingham International Office. Many evening classes and weekend events take place here, enabling students in full-time employment in the city centre to study with us. Further information on maps, directions, transport and travel to the KLTC. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia THE UNIVERSITY OF NOTTINGHAM IN MALAYSIA SDN. BHD. DULN001(B) (473520-K) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}