{
    "url": "https://www.nottingham.ac.uk/about/campuses/universityhospitalsites.aspx",
    "content": [
        {
            "p": "The Queen's Medical Centre is part of Nottingham University Hospitals NHS Trust and home to the University of Nottingham's Medical School, which is based next to the University Park Campus. Visit the Medical School for more information. The Education Centre at the Royal Derby Hospital is based in one of the biggest hospitals in the East Midlands. It provides state-of-the-art teaching and learning facilities for students and is fully equipped with social and administrative facilities. The centre offers: The Royal Derby Hospital is home to the School of Medicine with over 1200 students on the following courses: This student community provides many opportunities for interprofessional learning. There is also clinical and translational research, spanning molecular mechanisms through to clinical trials. Research is funded by the Biological and Biotechnological Sciences Research Council, British Heart Foundation, Health Technology Assessment, Action Medical Research, Kidney Research UK, amongst others. The University of Nottingham at Derby (UNAD) Committee represents all students at Derby and works hard to ensure the student experience in Derby is the best it can be. That means organising events and activities, but also putting forward any ideas or concerns you might have about life at the Derby Campus. Email: gem@nottingham.ac.uk Set within the vibrant city of Nottingham, Nottingham City Hospital is around four miles from University Park Campus. Your surroundings are key to your success as a student and at this campus your learning will take place within the purpose-built Clinical Sciences Building. Here you will be immersed in expert facilities tailored to highest standard of teaching and learning. There are libraries, dedicated computer rooms and study spaces as well as informal areas to relax and socialise with other students. Nottingham City Hospital is part of Nottingham University Hospitals (NUH) established in 2006 following the merger of Nottingham City Hospital and Queen’s Medical Centre (QMC). These hospitals are at the forefront of research and innovation while delivering services to 2.5 million residents in Nottingham, Nottinghamshire and its surrounding communities. Our specialist services allow us to deliver care to 4.5 million people from across the East Midlands and nationally for a handful of our most in demand services. Nottingham City Hospital is learning in an expert environment. Telephone: +44 (0)115 969 1169"
        }
    ],
    "pdf_files": []
}