{
    "url": "https://www.nottingham.ac.uk/about/vice-chancellor/blog/blog-001.aspx",
    "content": [
        {
            "p": "I am delighted and honoured to be joining you today as your seventh Vice-Chancellor. I feel privileged to have been chosen to build on the outstanding legacy of Professor Sir David Greenaway and to be part of a University known for its global outlook, world-leading research and the exceptional education experienced by our students. I am a strong believer in the value of a comprehensive university like Nottingham. We produce research that provides new discoveries across the full disciplinary spectrum, fosters different ways of thinking and benefits society, the economy and our quality of life; and we offer an education that promotes globally aware, responsible citizens who are prepared for a changing world of work. Nottingham has nurtured Nobel laureates, world leaders, opinion formers and prize-winning authors. This would not be possible without the collective talent, dedication and creativity of staff and students from all our campuses. These are tough times for those of us who work and study in universities. We are facing multiple pressures that show no signs of abating, and we labour under intense public, political and media scrutiny. The public and our political leaders rightly have high expectations of us, but the tone of public debate has become increasingly heated. It is important that we do not ignore these strongly held views and more important than ever to keep our charitable missions in the forefront of all we do. I have every confidence that we can work together to ensure that Nottingham adapts, thrives and retains its reputation for an entrepreneurial spirit and world-changing work, building on Jesse Boot’s foundational principles. As a newcomer to Nottingham, I want to learn about the University as quickly as I can. In order to engage with as many as you as possible, I have created a special email account that will be live until the end of December. Please send your thoughts to vc-engagement@nottingham.ac.uk. Let me know what you are most proud of, what worries you and where you see possibilities for growth, change or innovation. This is a private account, so only I will have access to your ideas. I promise I will acknowledge all emails, and they will inform my thinking in the coming months. I will also be undertaking a series of visits to academic schools and departments, and teams across administrative and professional services in all campuses over the next few months, after which an ongoing programme of engagement will enable me to keep in touch with all parts of the University on a regular basis. Finally, I will be delivering my vision for the University in an inaugural lecture on 7 December, which we will aim to live stream across our campuses in the UK, China and Malaysia. Please join me there either in person or virtually. More information will be sent out in due course. I look forward to working with you in this great University over the coming years. Professor Shearer West Vice-Chancellor 02 October 2017 Email your feedback to the Vice Chancellor"
        }
    ],
    "pdf_files": []
}