{
    "url": "https://www.nottingham.ac.uk/about/visitorinformation/train.aspx",
    "content": [
        {
            "p": "Nottingham is right in the centre of the country and is very well connected to all other major cities by the train network. Regular services operate between Nottingham and London St Pancras (from 1 hours 45 mins), Birmingham (1 hour 15 mins), Leeds (2 hours), Manchester (2 hours), or Sheffield (1 hour). Beeston Station (close to University Park campus) also offers services to London and Birmingham. Be sure to book as far in advance as possible for the cheapest tickets and check out East Midlands Parkway Station – it’s close to Sutton Bonington Campus and often does deals on fares: East Midlands Railway. For train information, tickets and timetables visit the National Rail Enquiries website. Cycle parking is available at Nottingham and Beeston train stations and outside every building at all University campuses. The University Park campus is 2 miles from Nottingham train station, about a 40 min walk or a short journey by public transport. A tram goes directly from Nottingham train station to University Park, with stops at Queen’s Medical Centre, the South Entrance to University Park and adjacent to the Highfields Sports Ground. To travel to University Park by bus, the stops closest to Nottingham train station are on Canal Street (for NCT 34 service) or Broadmarsh bus station (for Trent Barton’s Skylink services). Further buses are available from other stops in the city centre, you can find out more about all the buses which serve University Park Campus on our bus service webpage. The Jubilee campus is 2 miles from Nottingham train station, about a 40 min walk or a short bus ride. For the south side of Jubilee Campus, the bus stop closest to Nottingham train station is on Canal Street (for NCT 34 service). For the north side of Jubilee, you'll need to use the buses that depart from the northern side of the city centre, so you may want to use the tram to get around the city centre. Bus options for the north side of Jubilee include NCT 28 or NCT 30 or Trent Barton's two. You can find out more about all the buses which serve Jubilee Campus on our bus service webpage. University Park campus is between 1-2 miles from Beeston train station which is a 20-40 min walk or you could take a short journey by public transport. Jubilee campus is 3 miles from Beeston train station which is a 60 min walk or a short bus ride. The bus stop closest to Beeston train station is ‘Laburnum Grove’ (on Meadow Road) for CT4N’s 18 service. Alternatively, more frequent bus services go from Beeston Interchange (on Styring Street) - a 5-10 minute walk from Beeston train station. In addition, the tram goes from Beeston Interchange to University Park, with stops at Queen’s Medical Centre, the South Entrance to University Park (University of Nottingham stop) and adjacent to the Highfields Sports Ground (University Boulevard stop). Trent Barton's Skylink Nottingham bus service, which provides a regular connection between East Midlands Airport and Notttingham City Centre, runs via University Boulevard stopping next University Park's south entrance."
        }
    ],
    "pdf_files": []
}