{
    "url": "http://www.nottingham.edu.my/AboutUs/Datesandcampusinformation/Mapsanddirections/MalaysiaCampus.aspx",
    "content": [
        {
            "p": "Download this location map for quick driving directions and the exact location of the campus. The campus is located about 48km from Kuala Lumpur International Airport (KLIA) 1 & 2. If you are driving from the airport, you should take Route 26, followed by ELITE/AH2/E6, then Route 31. If you take a taxi, fares will vary so please confirm on cost before engaging the service. We are 45 minutes from the Kuala Lumpur. The campus is accessible via any of the main highways such as the Cheras-Kajang Highway, North-South Expressway, Kajang-SILK Highway, or SILK Highway towards Sungai Long. Once you reach the town of Semenyih, the campus is located 3km east of the junction of Jalan Broga and Highway 1 in Semenyih, Selangor. From Kuala Lumpur, the toll charges are: Cheras-Kajang Highway: Pay RM1.30 at Batu 9 Toll. North-South Expressway: Pay RM1.80 at Kajang exit. Kajang SILK Highway: Pay RM1.80 at Sg. Ramal Toll and RM1.80 at Bukit Kajang Toll. Jalan Balakong and SILK Highway: Pay RM1.80 at Sg. Long- Semenyih Toll. From MRR2 and Sungai Besi Highway: Pay RM2.00 at Mines Selatan Toll and RM1.80 at Sg. Long-Semenyih Toll. A free bus service is available for students and staff to and from the KTM station in Kajang to the campus. Pick-up and drop-off are only at designated places, and no special requests will be entertained. The journey takes approximately 45 minutes. See the shuttle bus schedule for more information. The nearest bus terminal is located at Semenyih (Semenyih Sentral) where public buses to/from Kajang and Kuala Lumpur are available. A journey from Semenyih to Kajang costs between RM1.00 and RM1.30. Bus service provided by RapidKL is also available from Kajang (Terminal Kajang) to Kuala Lumpur (Pasar Seni) at a cost of RM3.00. The nearest station is in Kajang town (9 km from the campus), where Keretapi Tanah Melayu (KTM), the national rail operates every 15 minutes between 6am and 11pm to and from Kuala Lumpur at a cost of RM4.30 each way. Taxis are readily available off-campus. The fare from Kajang to the campus normally costs not more than RM30 per trip and the taxi fare from Semenyih to the campus is approximately RM10. Please be aware that taxis in Kajang do not operate by meter and you will need to negotiate the cost of the trip before embarking on the journey. Download information on taxi suppliers [pdf]. Public transportation schedule and fares are subject to change without prior notice. Please refer to the respective service providers for the latest information. Download a PDF of the campus map. Map and directions from Kuala Lumpur to campus. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia THE UNIVERSITY OF NOTTINGHAM IN MALAYSIA SDN. BHD. DULN001(B) (473520-K) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/LocationMap.pdf",
        "pdf_files/Taxisuppliers.pdf",
        "pdf_files/Campus-Map-2018updated.pdf",
        "pdf_files/Campus-Map-2018updated.pdf"
    ]
}