{
    "url": "https://www.nottingham.edu.my/AboutUs/Datesandcampusinformation/Mapsanddirections/Shuttlebus.aspx",
    "content": [
        {
            "p": "Students are require to adhere with the Security Office instructions upon board on the shuttle bus prior depart to destination. Please read through the documents to make sure you comply to the guidelines and rules of the university. Shuttle Bus schedule Assigned shuttle bus stopping points Shuttle Buggy Services A free bus service is available for students and staff to and from the KTM station in Kajang to the campus. The buses will only pick up and drop staff and students at designated places. The journey time can vary according to traffic, but is usually between 25-45 minutes. Additional bus journeys If the first trip is full and there are students waiting at TTS4, the bus will make a second trip to the campus. The additional journey will only go through the TTS main road to TTS4 and return to campus using the wooden factory road. If you live in the in TTS4 please wait a little longer to be picked up for the second trip to campus. For enquiries or more information about either bus route please contact: transport@nottingham.edu.my The bus runs from Terminal Bersepadu Selatan (TBS) which is next to Bandar Tasik Selatan LRT station. The journey takes approximately 45 minutes and offers connections to central KL, the airport and buses going south to/from destinations such as Singapore and Melaka. Buses for TBS – campus – TBS are point to point with no stop on the journey. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia THE UNIVERSITY OF NOTTINGHAM IN MALAYSIA SDN. BHD. DULN001(B) (473520-K) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/Shuttle-Bus-Schedule-Academic-Year-2024-2025-Updated-as-at-20th-September-2024.pdf",
        "pdf_files/Assigned-Stopping-Points-Updated-as-at-August-2023.pdf",
        "pdf_files/Shuttle-Buggy-Services-Updated-as-at-20th-September-2022.pdf",
        "pdf_files/Shuttle-Bus-Schedule-Academic-Year-2024-2025-Updated-as-at-20th-September-2024.pdf",
        "pdf_files/Shuttle-Bus-Schedule-Academic-Year-2024-2025-Updated-as-at-20th-September-2024.pdf"
    ]
}