{
    "url": "https://www.nottingham.ac.uk/academicservices/qualitymanual/curriculum/appendixc.aspx",
    "content": [
        {
            "p": "The Quality Manual is a robust quality assurance framework which sets out the regulations, policies and procedures around teaching and learning at the University of Nottingham. It applies equally across the UK, China and Malaysia campuses and for all students and learners. The regulatory force associated with the content of the Quality Manual mean that Schools and students are required to comply. The University of Nottingham has a rigorous and robust quality assurance approach, working in partnership with students at all stages. This includes annual review of programmes, engagement with external examiners, Faculty quality assurance processes and periodic strategic reviews of departments/Schools. It is committed to the maintenance of academic standards of its awards and the continuous enhancement of the quality of student learning opportunities. The Quality Manual sets out the framework that governs all teaching and learning at the University of Nottingham. It forms a central point of reference for all campuses (i.e. UNNC, UNM and UNUK); for staff, students. learners and apprentices. Where there are separate procedures or requirements for particular campuses or groups of students/learners, this is stated within the Quality Manual. It draws together a series of interlinked activities that support quality assurance for programmes, modules, short courses, micro-credentials, and the award of credit from the University of Nottingham. In this way we can enable compliance with all our regulators through a high-quality student experience and successful student outcomes. Its purpose is to: It is the responsibility of all staff and students to be familiar with the Quality Manual and to ensure their compliance. For more information please view the Governance section of the quality manual. The regulatory framework for all undergraduate and postgraduate taught degree programmes Recruitment and admissions procedures, including English Language requirements The design, development and approval of new and changes, closure or suspension of existing programmes and modules The framework for assessment, marking and feedback The framework for personal tutoring, student support and development Our policies for student complaints and appeals How we govern registration, attendance and study; including Fitness to Practise procedures. Regulations and support for research degree programmes Ensuring students are fully involved, represented and engaged in their learning experience. Includes information on the Student Staff Fora (and Learning Community Fora) Recognition of other learning, partnerships, placements and distance learning information Information about governance and oversight of Quality Manual, how to propose changes or cases outside of regulations; as well as information about PACERs, External Examiners, PSRBs and degree outcomes. Our framework for University of Nottingham Online For information about incoming and recently changed Quality Manual pages, please consult the following: Coming soon Recent changes Contingency classification and progression regulations - UK, China and Malaysia campuses Exceptional Regulations: Covid-19 - UK, China and Malaysia campuses (2019/20 and 2020/21) Exceptional Classification and Progression Regulations: UK, China and Malaysia campuses (2021/22) If you have any problems or queries relating to this page, please contact: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}