{
    "url": "https://www.nottingham.ac.uk/academicservices/informationforformerstudents/diplomasupplement.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy RECORD OF ACADEMIC ACHIEVEMENT The Diploma Supplement produced by the University of Nottingham follows the model developed by the European Commission, Council of Europe and UNESCO/CEPES. The purpose of the Supplement is to provide sufficient independent data to improve the international “transparency” and fair academic and professional recognition of qualifications (diplomas, degrees, certificates, etc.). It is designed to provide a description of the nature, level, context, content and status of the studies that were pursued and successfully completed by the individual named on the original qualification to which this supplement is appended. It should be free from any value-judgements, equivalence statements or suggestions about recognition. Information in all eight sections should be provided. Where information is not provided an explanation should give the reason why. The Diploma Supplement is issued in a widely spoken European language and is free of charge to every student upon graduation. The University of Nottingham Diploma Supplement is security printed and embosed on the front side with a bespoke hologram. In some circumstances, for example, where a student has taken a part-time programme of study, the transcript and subsequent information may continue onto an additional page. Students graduating from 2006 onwards are issued with their Diploma Supplement at the same time as they receive their Degree Certificate (normally at a Graduation Ceremony held at the University). Students graduating after July 2002 and before 2006 were issued with a Student Transcript and Degree Certificate at Graduation. Students graduating in 2005 are able to obtain a Diploma Supplement on request (they are not available for students graduating before 2005). Students graduating before July 2002 were issued with a Degree Certificate at Graduation. 1. Information Identifying the Holder of the Qualification Information Identifying the Holder of the Qualification are shown on the Diploma Supplement front page. The Student ID number shown is the unique identification number for a student registered at the University of Nottingham. Also shown in this section is the HESA Reference. This is the unique national identification number from the Higher Education Statistics Agency in the UK. Information Identifying the Qualification The present University of Nottingham started with the establishment of the Adult School in 1798 and the opening of the University College, Nottingham in 1881, with the Charter of Incorporation granted in1903. In 1948 a Royal Charter was awarded establishing the University of Nottingham. The University is recognised by the UK authorities as having the power to award its own degrees. For further information see DFES pages (Further information on the status of universities in the UK appears in Section 8: Information on the National Higher Education Systems). 2. Information Identifying the Qualification Language(s) of instruction/examination The University’s courses are taught and examined in English, except where the nature of the module being studied means that all or part of the teaching and assessment will be in the other language e.g. French Language modules, Inter-Faculty Language modules. 3. Information on the Level of the Qualification Level of qualification is shown on the Diploma Supplement front page. The Level of Qualification refers to the level in the National Qualifications Framework (see Section 8). Information on the University of Nottingham Qualifications Framework (UNQF) can be found in the quality manual. Official length of programme is shown on the Diploma Supplement front page using normal local descriptors e.g. 3 year UG. The minimum requirements for awards are set out in the University of Nottingham Qualifications Framework (UNQF). Access requirement(s) - Information on the minimum qualifications necessary to be considered for entry to a course (including English language requirements, other required skills or experience) is given in the relevant Programme Specification. 4. Information on the Contents and Results Gained A Programme Specification is produced for any course on which a student may be registered. Information on the course structure, assessment criteria, learning outcomes and any other requirements which are in addition to those stated in the University’s study regulations and the University of Nottingham’s Qualifications Framework are given in the relevant Programme Specification. Information on modules taught at the University of Nottingham for the current session is available from the Module Catalogue. For information on modules taught in previous sessions please e-mail module-specifications@nottingham.ac.uk. University policies and procedures as set out in University Regulations and the Quality Manual automatically apply to all courses. The student’s transcript is shown on the Diploma Supplement front page. In some circumstances, for example, where a student has taken a part-time programme of study, the transcript and subsequent information may continue onto a second page. Each individual module has a credit value, which contributes to the academic year. University of Nottingham credit values are translated into ECTS credit values by dividing the Nottingham credit value by two. 10 hours of effort per 1 credit 120 credits per full-time academic year or equivalent Undergraduate Awards 360 credits for award of Honours degree 480 credits for award of Integrated Masters 360 credits for award of Pass degree 300 credits for award of Ordinary degree 240 credits for award of Undergraduate Diploma 120 credits for award of Undergraduate and Foundation Certificates Taught Postgraduate Awards 180 credits per twelve month full-time study 540 credits for award of Practitioner Doctorate 180 credits for award of Masters degree 120 credits for award of Postgraduate Diploma 60 credits for award of Postgraduate Certificate There may be exceptions to the standard credit totals owing to entry at a later stage of the course, or Accredited Prior Learning AP(E)L, or because of a change of course or the need to take a stage of the course for a second time. For the majority of awards, numeric marks are awarded on the scale 0-100. The module pass mark is 40%, except for Masters and Practitioner Doctorates, where it is 50%. is shown on the Diploma Supplement front page. Full information on the methods for classifying undergraduate degrees approved for use in the University of Nottingham is available online. Rounding - The University convention on rounding of numeric marks is available in the quality manual. Use of borderlines - The University convention on the use of borderlines is available in the quality manual. The Examination Board may use the procedure set out in the relevant Programme Specification to determine if the classification of borderline candidates may be raised. Undergraduate Awards - For the majority of classified undergraduate awards, the weighted numerical average is translated into degree classification as follows: I (First class honours) = 70%+ IIi (Upper Second Class Honours) = 60% - 69% IIii (Lower Second Class Honours) = 50% - 59% III (Third Class Honours) = 40% - 49% For the majority of taught postgraduate awards, the weighted numerical average is translated into degree award as follows: With Distinction = 70%+ With Merit = 60% - 69% Pass = 50% - 59% Special Award Candidates may be awarded their qualification with a Special Award e.g. With Distinction in Spoken German, With Merit. If such an award is made, this appears in the Special Award section. For Postgraduate Awards, the degree classification section of the Diploma Supplement is blank. If the award is made with Merit or Distinction, this appears in the Special Award section. 5. Information on the Function of the Qualification Access to further study Subject to attainment of the minimum qualifications necessary to be considered for entry to a course, satisfactory completion of a University of Nottingham award provides access to: Professional status (if applicable) 6. Additional Information Additional information relating to the University of Nottingham, and not covered in these webpages, can be obtained from the University’s website. Further information sources are shown on the Diploma Supplement second page. 7. Information on the National Higher Education System(s) are shown on the Diploma Supplement front page together with the name of signatory. Official stamp or seal All Diploma Supplements are embossed a bespoke 'University of Nottingham' hologram. 8. Information Identifying the Holder of the Qualification Section 8 comprises a description of Higher Education in England, Wales and Northern Ireland together with a diagram of higher education qualification levels in England, Wales and Northern Ireland. Further information is available from the National Recognition Information Centre for the United Kingdom (UK NARIC). Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}