{
    "url": "https://www.nottingham.ac.uk/accommodation/options/broadgate-park-1",
    "content": [
        {
            "p": "Find the accommodation that's right for you Broadgate Park is the place to be for over 2,000 new and current year students! The accommodation is self-catered, where you’ll have the flexibility to cook your own meals alongside the option of a wide variety of room types to suit all budgets, including standard rooms and ensuite cluster flats. Broadgate Park is a collection of over forty student accommodation buildings which collectively form a vibrant student community opposite the University Park campus. If you prefer your own space with the convenience of having all facilities to hand, there is also ensuite studio accommodation available. Join Emma, Bev and the rest of the Broadgate team as you take a tour around Broadgate Park! Accommodation is guaranteed for the first year. See full terms and conditions. Your Residential Experience Team (ResX) is available 7 days a week, from the day you arrive, until the day you leave, to support you to settle and thrive in your new home, and the fantastic community that you will belong to as a student at the University of Nottingham. Helping you make the most of your time in halls we host a range of events from big to small to help you connect with others and enjoy your time in halls. Our events are aimed to help you thrive in halls and develop as a person, learn a new skill or just have some fun. We offer a supportive and non-judgemental wellbeing service for all our hall students. We can help with a wide range of issues and challenges that you are facing. Highlighting the amazing community we are a part of and setting expectations of behaviour across our halls. Broadgate Park has a dedicated and friendly reception team available 24 hours a day, there is also an onsite maintenance and housekeeping team who are available to provide support whenever you need them. Our social spaces, including the Courtyard, Library and The Lounge, have been designed with your studies and social life in mind. A variety of events are hosted most evenings through the ResX social events programme, making them the perfect place to make friends and create lasting memories as you settle into student life. Broadgate Park also has lots of outdoor seating areas, green space and an allotment. It has everything you need for a fun and social living environment. With easy access to all the amenities of University Park, and a 10 minutes’ walk from the lively town of Beeston, you’ll find everything you need close by along with supermarkets, restaurants and local shops. Located in the Upper Court and Lower Court areas, there are 2 bathrooms and 5 students per flat. Close to the main reception. These room types have a recently refurbished kitchen or bathroom, there are 2 bathrooms and 5-7 students per flat. Located in the Upper Court and Lower Court areas, there are 2 bathrooms and 5 students per flat. All large bedrooms have a ¾ bed and additional floor space. : Located in the Turnpike and Upper Court areas, a few minutes walk from the West Entrance. There are 4-8 students per flat. Self-contained studio room with kitchenette and ensuite bathroom facing the University Park campus. For 44 weeks yearly cost: £8,671.06 Self-contained studio room with kitchenette and ensuite bathroom close to the West Entrance of the University Park Campus. Located in the Turnpike and Upper Court areas, a few minutes walk from the West Entrance. There are 4-8 students per flat. All large bedrooms have a ¾ bed and additional floor space. Self-contained studio room with kitchenette and ensuite bathroom close to the West Entrance of the University Park Campus. All large bedrooms have a ¾ bed and additional floor space. Suitable for two friends sharing, with two sets of bedroom and study furniture, kitchen facilities shared between two, and toilet, shower and wash basin shared between two. The University of Nottingham is the place for Sports, being Sports University of the Year 2024. So why not add a Sports and Fitness Membership to your accommodation? Whether you want to gym, swim, climb or join one of our sports clubs - our student sport and fitness membership has got you covered. With so much on offer, we give you the power to shape your own fitness and lifestyle journey. Students can use all three of our facilities at David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington and over 80+ University gyms around the country when they head home. All yours, all on campus. Broadgate Park is well situated within a few minutes walk to the University of Nottingham campus and excellent transport links to the city centre. To finalise your offer you will be required to read and accept a licence/tenancy agreement and terms and conditions from your accommodation provider UPP Broadgate Park. We highly recommend that you read this along with a parent, guardian, carer, or school representative, as this is a legally binding document. You will be accepting liability for the full tenancy length of 44 weeks a year for undergraduates, including vacation periods. Once you have moved in you are liable to pay for the duration of your licence period. The University will take payments only and are not legally able to influence contractual issues. All images used are for illustrative purposes only. Individual features, room sizes, and layouts will vary and these images may not represent wholly the actual fittings and furnishings. Video’s and images are correct at the time of filming, For the latest operational processes and the most up to date information please contact Halls Welcome Point and the Your Arrival Guide."
        }
    ],
    "pdf_files": []
}