{
    "url": "https://www.nottingham.ac.uk/accommodation/options/dagfa-hall",
    "content": [
        {
            "p": "Find the accommodation that's right for you Dagfa House is just a five-minute walk to University Park Campus and a 10-minute walk to the lively town of Beeston. The property has standard and en-suite rooms with shared kitchen and living areas for between five to 12 students, plus self-contained studios with your own kitchen. If you select our standard room option you will share a bathroom with one other student. Join first year student Anna on a tour of Dagfa Hall and its surrounding facilities. The accommodation here ranges from modern, newly built halls to traditional, original buildings. This is the perfect hall for anyone looking for a bit more independence. Accommodation is guaranteed for the first year. For added peace of mind, free cancellations, and no penalties if you do not obtain your grades, defer* your place, or are unable to obtain a visa. See full terms and conditions. Your Residential Experience Team (ResX) is available 7 days a week, from the day you arrive, until the day you leave, to support you to settle and thrive in your new home, and the fantastic community that you will belong to as a student at the University of Nottingham. Helping you make the most of your time in halls we host a range of events from big to small to help you connect with others and enjoy your time in halls. Our events are aimed to help you thrive in halls and develop as a person, learn a new skill or just have some fun. We offer a supportive and non-judgemental wellbeing service for all our hall students. We can help with a wide range of issues and challenges that you are facing. Highlighting the amazing community we are a part of and setting expectations of behaviour across our halls. Every room comes equipped with a bed, large wardrobe, desk, chair, full-length mirror, and plenty of storage. Rooms also have Wi-Fi. Shared kitchens come with induction hobs as standard. Available for undergraduates only. In partnership with UoN Sport and as Sports University of the year 2024, the Active Living package provides exclusive sport, fitness and active events for students living in University halls on University Park and Jubilee campus, plus Dagfa and Varsity. Included within your accommodation, your Active Living package offers some incredible perks. Access our sports and fitness suites across our campuses and across the nation with the BUCS UNIversal scheme. Join in some casual sports with Just Play or get competitive with the Inter-Mural Sports teams. Plus a programme of exclusive sessions and events just for you and your new hall mates! Dagfa House offers self-catered accommodation in a great location in Salthouse Lane, Beeston. To finalise your offer, you will be required to read and accept a licence/tenancy agreement and terms and conditions from your accommodation provider University of Nottingham. We highly recommend that you read this along with a parent, guardian, carer, or school representative, as this is a legally binding document. You will be accepting liability for the full tenancy length of 44 weeks for undergraduates, or 51 weeks for postgraduates. Once you have moved in you are liable to pay for the duration of your licence period. All images used are for illustrative purposes only. Individual features, room sizes, and layouts will vary and these images may not represent wholly the actual fittings and furnishings. Video’s and images are correct at the time of filming, For the latest operational processes and the most up to date information please contact Halls Welcome Point and the Your Arrival Guide."
        }
    ],
    "pdf_files": []
}