{
    "url": "https://www.nottingham.ac.uk/accommodation/current-students/paying-your-fees.aspx",
    "content": [
        {
            "p": "Find the campus that's right for you All your payment instructions can be found within your formal offer, but you can also see them below if you need to! There are various tasks you need to complete before you join us on campus. These will make sure you are ready to start and can access all the systems you need during your first weeks. Your accommodation fee will have been detailed in your accommodation offer. The amount due each term will also show on the Accommodation Portal where you are allocated to Dagfa, Varsity, University Park, Jubilee Campus. £250 Damage Deposit £250 Reservation Fee * If you are reliant on a SFE Maintenance Loan to pay your 2023/24 accommodation fees, please ensure a minimum payment of £250.00 (plus £250.00 damage deposit for students staying at Broadgate Park) is received by 14 September 2023, with the balance of your 1st instalment to be paid by 9 October 2023. * If you are reliant on a SFE Maintenance Loan to pay your 2024/25 accommodation fees, please ensure a minimum payment of £250.00 (plus £250.00 damage deposit for students staying at Broadgate Park) is received by 12 September 2024, with the balance of your 1st instalment to be paid by 7 October 2024. If you need help with your finances, there is lots of support and advice available from the University. Student maintenance loans and grants are paid to you directly by the Student Loans Company into your bank account (as per the details you have provided them). The Student Loans Company will provide you with a Payment Timetable so that you know what amount you will receive into your bank account each term. Your first payment is due prior to arrival and should be paid via the NottinghamHub (University of Nottingham Student Hub). Students who are reliant on a Student Finance England maintenance loan to pay their accommodation fees can make a minimum payment of £250 prior to arrival to secure their room on University Park or Jubilee Campus. The remainder of the 1st instalment is due by 7 October 2024. For payment for UPP Broadgate Park, the minimum £250 payment plus £250 damage deposit should be paid prior to arrival. The £250 minimum payment will then be deducted from your first period instalment. Visit information on how to pay your fees on the Finance website including contact details for the Finance Team if you have any queries. *If you are reliant on a Student Finance Maintenance Loan to pay your accommodation fees, please ensure a minimum payment of £250.00 (plus £250.00 damage deposit for students staying at Broadgate Park). We offer the following alternative payment plans for accommodation fees. If you require an alternative payment plan for your accommodation fees, once fees have been uploaded to your NottinghamHub portal, please email sas@nottingham.ac.uk stating your Student ID number, full name and alternative payment plan required. Reservation fee of £250.00 (all students) PLUS Damage deposit £250.00 (Broadgate Park students ONLY) The balance of all accommodation fees to be split equally into 3 instalments. Reservation fee of £250.00 (all students) PLUS Damage deposit £250.00 (Broadgate Park students ONLY) The balance of all accommodation fees to be split into 9 x monthly instalments (Undergraduate) or 11 x Monthly instalments (Postgraduate) to be paid on the 1st of each month throughout the academic year. Please note Accommodation Services do not deal with the payment of fees. Students who are reliant upon securing a Student route visa should not make any payment for their accommodation until the visa has been granted. If a visa has not been secured by the first payment date, please email Student Account Services The deadline for term one, as detailed in your offer, is due before your contract starts, so you need to make the necessary arrangements to pay before the beginning of term. If you have any worries or problems, particularly if you are dependent upon Student Loan Funding or have not secured your visa, please contact your site provider direct to discuss possible payment plans: Students who are reliant upon securing a Student route visa should not make any payment for their accommodation until the visa has been granted. If a visa has not been secured by the first payment date, please email Student Account Services. If you have any worries or problems making a payment for University managed halls and UPP Broadgate Park, please contact Student Account Services. For third party self-catered accommodation, please speak to your site manager. Our contacts for our self-catered sites are listed in your offer and also on our contacts page."
        }
    ],
    "pdf_files": []
}