{
    "url": "https://www.nottingham.ac.uk/accommodation/options/southwell-hall-1",
    "content": [
        {
            "p": "Find the accommodation that's right for you Southwell Hall is on Jubilee Campus and comprises of 205 rooms. The campus has a sports centre, retail outlets, cafes and restaurants and a library. Accommodation guaranteed for first year. For added peace of mind, free cancellation, no penalties if you do not obtain your grades, defer* your place or are unable to obtain a visa. See full terms and conditions. Your Residential Experience Team (ResX) is available 7 days a week, from the day you arrive, until the day you leave, to support you to settle and thrive in your new home, and the fantastic community that you will belong to as a student at the University of Nottingham. Helping you make the most of your time in halls we host a range of events from big to small to help you connect with others and enjoy your time in halls. Our events are aimed to help you thrive in halls and develop as a person, learn a new skill or just have some fun. We offer a supportive and non-judgemental wellbeing service for all our hall students. We can help with a wide range of issues and challenges that you are facing. Highlighting the amazing community we are a part of and setting expectations of behaviour across our halls. Every room comes equipped with a bed, wardrobe, desk, chair, bookshelves, noticeboard, desk lamp, personal door lock, coat hooks, mirror, and four power sockets. Rooms also have Wi-Fi. Living room with area providing food heating facilities Southwell Hall is a self-catered hall on our Jubilee Campus. Community kitchens can be found on every corridor, these kitchens include, a sink, toaster, kettle, shared cupboard space, a refrigerator, air fryers, microwave oven and rice cooker. _____________________________________________________________________________________________________________ Want to add catering to your accommodation package? find out what is included below. Our catered Meal Plans offer healthy, tasty, freshly cooked food for diverse dietary requirements. We use sustainable and quality-assured ingredients like free-range eggs, Red Tractor-assured meat and sustainably farmed fish. Halls with 39-week contracts get 35 weeks of catering, and 31-week contracts receive 31 weeks of catering. Both include 12 meals per week. Your Meal Plan includes: You can find all of our meal times across the year here. *Please note no catering is provided over the winter vacation period and limited on-campus retail stores are open during this time. In partnership with UoN Sport and as Sports University of the year 2024, the Active Living package provides exclusive sport, fitness and active events for students living in University halls on University Park and Jubilee campus, plus Dagfa and Varsity. Included within your accommodation, your Active Living package offers some incredible perks. Access our sports and fitness suites across our campuses and across the nation with the BUCS UNIversal scheme. Join in some casual sports with Just Play or get competitive with the Inter-Mural Sports teams. Plus a programme of exclusive sessions and events just for you and your new hall mates! Close to bus stops for the on campus University Hopper bus to University Park, close to bus stops and for access to the city centre. To finalise your offer, you will be required to read and accept a licence/tenancy agreement and terms and conditions from your accommodation provider. We highly recommend that you read this along with a parent, guardian, carer or school representative, as this is a legally binding document. You will be accepting liability for the full tenancy length of 39 weeks. Once you have moved in you are liable to pay for the duration of your licence period. All images used are for illustrative purposes only. Individual features, room sizes, and layouts will vary and these images may not represent wholly the actual fittings and furnishings. Video’s and images are correct at the time of filming, For the latest operational processes and the most up to date information please contact Halls Welcome Point and the Your Arrival Guide."
        }
    ],
    "pdf_files": []
}