{
    "url": "https://www.nottingham.ac.uk/accommodation/options/madison-gardens",
    "content": [
        {
            "p": "Find the accommodation that's right for you Our standard apartment at Madison Gardens is great for Nottingham students looking to get the most out of their studies. Our Standard accommodation is a 6-bedroom cluster with a double bed, wardrobe, chest of drawers and an area to study in each room. It’s also complete with a pinboard to display course dates or photos from home. Each cluster includes 2 shared bathrooms, shared cooking/dining areas and a space to relax with sofas and a TV. Being a part of the Almero community affords you access to our exclusive student events. Our annual calendar includes free celebrations with your other Almero students such as Christmas parties, Halloween nights, Holi, Lunar New Year and more. Our local student team and brilliant student ambassadors are on hand to support you and ensure you have an amazing experience at Almero Student. We are located close to the University of Nottingham’s Jubilee Campus to make getting between your studies and accommodation easy. Living at Madison Gardens, you also have access to Almero’s communal areas, another great opportunity to meet others living here. Accommodation is guaranteed for the first year. See full terms and conditions. Your Residential Experience Team (ResX) is available 7 days a week, from the day you arrive, until the day you leave, to support you to settle and thrive in your new home, and the fantastic community that you will belong to as a student at the University of Nottingham. We offer a supportive and non-judgemental wellbeing service for all our hall students. We can help with a wide range of issues and challenges that you are facing. Highlighting the amazing community we are a part of and setting expectations of behaviour across our halls. 45 Week - £6,615.00 45 Week - £6,705.00 45 Week - £6,390.00 51 Week - £7,242.00 45 Weeks - £6,435.00 51 Weeks - £7,293.00 The University of Nottingham is the place for Sports, being Sports University of the Year 2024. So why not add a Sports and Fitness Membership to your accommodation? Whether you want to gym, swim, climb or join one of our sports clubs - our student sport and fitness membership has got you covered. With so much on offer, we give you the power to shape your own fitness and lifestyle journey. Students can use all three of our facilities at David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington and over 80+ University gyms around the country when they head home. All yours, all on campus. To finalise your offer, you will be required to read and accept a licence/tenancy agreement and terms and conditions from your accommodation provider Almero Students. We highly recommend that you read this along with a parent, guardian, carer, or school representative, as this is a legally binding document. You will be accepting liability for the full tenancy length of 44 weeks a year for undergraduates, or 51 weeks for postgraduates, including vacation periods. Once you have moved in you are liable to pay for the duration of your licence period. All images used are for illustrative purposes only. Individual features, room sizes, and layouts will vary and these images may not represent wholly the actual fittings and furnishings. Video’s and images are correct at the time of filming, For the latest operational processes and the most up to date information please contact Halls Welcome Point and the Your Arrival Guide."
        }
    ],
    "pdf_files": []
}