{
    "url": "https://www.nottingham.ac.uk/accommodation/options/st-peters-court-1",
    "content": [
        {
            "p": "Find the accommodation that's right for you St Peters Court is located close to Jubilee Campus. It has its own gym and offers en-suite rooms throughout. Accommodation is guaranteed for the first year. See full terms and conditions. Your Residential Experience Team (ResX) is available 7 days a week, from the day you arrive, until the day you leave, to support you to settle and thrive in your new home, and the fantastic community that you will belong to as a student at the University of Nottingham. Helping you make the most of your time in halls we host a range of events from big to small to help you connect with others and enjoy your time in halls. Our events are aimed to help you thrive in halls and develop as a person, learn a new skill or just have some fun. We offer a supportive and non-judgemental wellbeing service for all our hall students. We can help with a wide range of issues and challenges that you are facing. Highlighting the amazing community we are a part of and setting expectations of behaviour across our halls. The University of Nottingham is the place for Sports, being Sports University of the Year 2024. So why not add a Sports and Fitness Membership to your accommodation? Whether you want to gym, swim, climb or join one of our sports clubs - our student sport and fitness membership has got you covered. With so much on offer, we give you the power to shape your own fitness and lifestyle journey. Students can use all three of our facilities at David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington and over 80+ University gyms around the country when they head home. All yours, all on campus. St Peter’s Court is in a vibrant area of the city popular with students thanks to its great range of bars and cafes, and its proximity to the city centre and university campuses. To finalise your offer, you will be required to read and accept a licence/tenancy agreement and terms and conditions from your accommodation provider Unite. We highly recommend that you read this along with a parent, guardian, carer, or school representative, as this is a legally binding document. You will be accepting liability for the full tenancy length of 44 weeks for undergraduates, or 51 weeks for postgraduates, including vacation periods. There is a £250 advance rent payment due within 48 hours of accepting the contract. Once you have moved in you are liable to pay for the duration of your licence period. Fees at St Peter's Court also include gym membership and free bus travel. All images used are for illustrative purposes only. Individual features, room sizes, and layouts will vary and these images may not represent wholly the actual fittings and furnishings. Video’s and images are correct at the time of filming, For the latest operational processes and the most up to date information please contact Halls Welcome Point and the Your Arrival Guide."
        }
    ],
    "pdf_files": []
}