{
    "url": "https://www.nottingham.ac.uk/accommodation/options/study-inn-triumph-house",
    "content": [
        {
            "p": "Find the accommodation that's right for you Triumph House, built in 2022, provides a variety of stunning studios and en-suite serviced apartments with hotel-like services located close to Jubilee Campus, the Queens Medical Centre, and only a 15 minute walk to University Park. Included is an in-house wellness spa, gym and entertainment area. Accommodation is guaranteed for the first year. See full terms and conditions. Your Residential Experience Team (ResX) is available 7 days a week, from the day you arrive, until the day you leave, to support you to settle and thrive in your new home, and the fantastic community that you will belong to as a student at the University of Nottingham. We offer a supportive and non-judgemental wellbeing service for all our hall students. We can help with a wide range of issues and challenges that you are facing. Highlighting the amazing community we are a part of and setting expectations of behaviour across our halls. Study Inn’s en-suite serviced student accommodation provides shared kitchens with all appliances and utensils including private fridge/freezer and storage, dishwasher, Nutribullet blender, wine chiller, rice cooker, and breakfast table/bar. Your living area provides comfy sofas, coffee table, large 55-inch smart TV and games console including games. The University of Nottingham is the place for Sports, being Sports University of the Year 2024. So why not add a Sports and Fitness Membership to your accommodation? Whether you want to gym, swim, climb or join one of our sports clubs - our student sport and fitness membership has got you covered. With so much on offer, we give you the power to shape your own fitness and lifestyle journey. Students can use all three of our facilities at David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington and over 80+ University gyms around the country when they head home. All yours, all on campus. To finalise your offer you will be required to read and accept a licence/tenancy agreement and terms and conditions from your accommodation provider Study Inn. We highly recommend that you read this along with a parent, guardian, carer, or school representative, as this is a legally binding document. You will be accepting liability for the full tenancy length of 44 or 51 weeks a year including vacation periods. Once you have moved in you are liable to pay for the duration of your licence period. All images used are for illustrative purposes only. Individual features, room sizes, and layouts will vary and these images may not represent wholly the actual fittings and furnishings. Video’s and images are correct at the time of filming, For the latest operational processes and the most up to date information please contact Halls Welcome Point and the Your Arrival Guide."
        }
    ],
    "pdf_files": []
}