{
    "url": "https://www.nottingham.ac.uk/accommodation/before-you-arrive/residential-experience.aspx",
    "content": [
        {
            "p": "Connect, Grow, Thrive. Community Events Wellbeing Support Growth Moving to University, and perhaps a new city, or even a new country, is such an exciting experience, full of amazing opportunities! It is common to feel overwhelmed or anxious at times, when going through such a big change in your life. Your Residential Experience Team (ResX) is available 7 days a week, from the day you arrive, until the day you leave, to support you to settle and thrive in your new home, and the fantastic community that you will belong to as a student at the University of Nottingham. Telephone: 0115 748 7600 Email: resx@nottingham.ac.uk ResX Events Calendar Residential Ambassadors are a diverse team of students who support our communty with peer to peer support and hosting amazing events and activites. They not only complement students' academic studies but also provide them with the opportunity to connect, grow as individuals, and truly thrive in their student experience. ResX offer a supportive and non-judgemental wellbeing service for all our hall students. We can help with a wide range of issues and challenges that you are facing. This could include a chat with one of our team about feeling homesick, friendship challenges or worries about money. We can also signpost you to University professional support including Counselling, Disability and Financial Services Teams. To help you make the most of your halls experience, and to facilitate all of the support, opportunities and experiences the ResX Team has to offer you, the team delivers a range of events and activities all throughout the year, catering to a variety of interests and underpinned by the values of inclusivity and accessibility. ResX events and activities are a great way to connect with new people, learn and develop skills, try out a new experience, chat to the team, or just get out of your room to have a break from studying and a change of scenery. The ResX Team promotes positive community values, helping you to find your sense of belonging, and experience the benefits of living in such a vibrant and diverse community. ResX highlights the expectations of respectful community behaviours as well as community issues and causes, giving you opportunities to give back to the wider community and positively impact those around you. We are here to help you navigate any difficulties that you face adjusting to communal independent living. We host an event or activity in our halls every night, helping bring you together as a community. From creative crafts to delicious food, we have a range of activites for everyone to enjoy. Have a look through some of the events that the ResX team puts together for students ever year. Why not check out our Instagram where we post about all of our great events and activities and how you can get involved. \"Last year, ResX ran over 1000 events and activities, recording over 40,000 attendees! If you’re looking to meet new people, or just for something to do, come along to a ResX event or activity. We can’t wait to see you there!\" — Chris Hoskins, Senior Residential Experience Manager"
        }
    ],
    "pdf_files": []
}