{
    "url": "https://www.nottingham.ac.uk/accommodation/",
    "content": [
        {
            "p": "We bring our students together in a friendly, safe and vibrant community that creates a sociable and enriching living experience - and we can't wait for you to join us. Each of our halls and accommodation sites has their own identity, character and community – they are the perfect base for exploring your new life in Nottingham. Planning to stay with us again next year? With our ‘Next Year’s Room, This Year’s Price’ offer, as a returning student you can secure your preferred accommodation at this year’s rates. Booking now also means you will get your choice of accommodation while ensuring everything is arranged well in advance. Take this opportunity to plan ahead and enjoy a seamless transition into your next year at university. A warm welcome Catered halls Self-catered halls Easy travel Accessible Helping you to settle in and get the best out of your accommodation is what we do. You can find helpful guides for living in halls, and the support we provide for our students. Do you additional needs and require extra support, find out how we can help. Discover all of the details you need to live in halls. Find out how we can support you as a Care Experienced or Estranged Student. Leaving home can be daunting, so we make sure that the university can assist you in making the transition as smooth as possible for you and your family. Discover the facilities we offer prospective and current students to help them in settling in to start their new lives. Get involved with your halls and access support where you need it. Before you move into your new accommodation at Nottingham there's a few things you need to know. Residential Experience is the core of your time in halls. Find out how we support you in halls and the events we run to make your time special. When living off campus you are still part of our community. Find out how to be a good neighbour and support your community. At Nottingham we are porud to provide high quality accommodation for our students. In our pursuit of excellence we have won a variety of industry standard awards, Where you live is a big part of your university experience and for your protection we are accredited by the Universities UK/Guild HE Code of Practice for the Management of Student Housing. Accommodation at the University of Nottingham is supported by both university managed halls and privately managed halls. As such we adhere to both the UUK (Code for university managed halls) and ANUK (Code for privately managed halls) codes. If you want to know who is managing your site look for this logo on our Halls Webpages."
        }
    ],
    "pdf_files": []
}