{
    "url": "https://www.nottingham.ac.uk/accommodation/options/lincoln-medical-school-students",
    "content": [
        {
            "p": "Find the accommodation that's right for you We offer a variety of accommodation for our University of Nottingham Medicine BMBS and Medicine with a Foundation Year BMBS students based at the Lincoln Medical School, most of which is on, or a short walk from, the Lincoln city centre campus. The University of Lincoln offers a wide range of accommodation, across six University-managed residences. Key Details What is included? Rooms are equipped with white goods including a mattress, desk chair, and bin. Each room has its own personal lock. Communal spaces have fridge-freezers, kettles, microwaves, ovens, and hobs. Cleaning equipment is also provided. Wi-Fi and Utilities are also included, with Contents Insurance of up to £5,000. 24/7 on-campus security and CCTV as well as on-campus maintenance. What happens next? Upon firming your place to study at the university, you will receive an email from Accommodation Services with a link to the Booking Portal. Here you can apply for accommodation, you will need to apply for four room types, in preference order. First year student accommodation. 40-week contract. Studio apartments are available in 179 High Street but are limited, please email accommodation@lincoln.ac.uk for more information. 44-week contract Studio apartments are available in 179 High Street and Viking House but are limited, please email accommodation@lincoln.ac.uk for more information. Rooms in Lincoln Courts have single beds with the option of an en-suite or a shared bathroom. 46-week contract The majority of the halls of residence are based on or a short walk from the University of Lincoln city centre campus. All images used are for illustrative purposes only. Individual features, room sizes, and layouts will vary and these images may not represent wholly the actual fittings and furnishings. Video’s and images are correct at the time of filming, For the latest operational processes and the most up to date information please contact Halls Welcome Point and the Your Arrival Guide."
        }
    ],
    "pdf_files": []
}