{
    "url": "https://www.nottingham.ac.uk/accommodation/options/cloister-house",
    "content": [
        {
            "p": "Find the accommodation that's right for you Cloister House is situated on a quiet residential street in the popular area of Dunkirk. This self-catered accommodation is perfect for Postgraduate students who want a healthy balance between their social life and quiet study. Cloister House is a short walk from the Queens Medical Centre and ideal for students studying medical related courses, the city centre is also a short bus ride away. Parking is available at this hall and is free of charge to all residents. Accommodation is guaranteed for the first year. See full terms and conditions. Your Residential Experience Team (ResX) is available 7 days a week, from the day you arrive, until the day you leave, to support you to settle and thrive in your new home, and the fantastic community that you will belong to as a student at the University of Nottingham. Helping you make the most of your time in halls we host a range of events from big to small to help you connect with others and enjoy your time in halls. Our events are aimed to help you thrive in halls and develop as a person, learn a new skill or just have some fun. We offer a supportive and non-judgemental wellbeing service for all our hall students. We can help with a wide range of issues and challenges that you are facing. Highlighting the amazing community we are a part of and setting expectations of behaviour across our halls. The University of Nottingham is the place for Sports, being Sports University of the Year 2024. So why not add a Sports and Fitness Membership to your accommodation? Whether you want to gym, swim, climb or join one of our sports clubs - our student sport and fitness membership has got you covered. With so much on offer, we give you the power to shape your own fitness and lifestyle journey. Students can use all three of our facilities at David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington and over 80+ University gyms around the country when they head home. All yours, all on campus. Cloister House is located in Dunkirk which is in close proximity to the Queen's Medical Centre and just a short walk away from University Park Campus. Your first payment is due prior to arrival and should be paid via the University of Nottingham Student Hub. Undergraduate students who are reliant on a Student Finance England maintenance loan to pay their accommodation fees will be able to make a minimum payment of £250 payment plus £250 damage deposit prior to arrival. The £250 minimum payment will then be deducted from your first period instalment with the balance due on 7 October 2024.. Student maintenance loans and grants are paid to you directly by the Student Loans Company into your bank account (as per the details you have provided them). The Student Loans Company will provide you with a Payment Timetable so that you know what amount you will receive into your bank account each term. Further details on how to pay your accommodation fees for term one can be found on the finance website. Please also see their Paying Student Fees information. If you will require a payment plan because you wish to amend your instalments to three equal amounts or you are self-funding and wish to pay by monthly instalment, you will need to email Student Account Services on sas@nottingham.ac.uk All images used are for illustrative purposes only. Individual features, room sizes, and layouts will vary and these images may not represent wholly the actual fittings and furnishings. Video’s and images are correct at the time of filming, For the latest operational processes and the most up to date information please contact Halls Welcome Point and the Your Arrival Guide."
        }
    ],
    "pdf_files": []
}