{
    "url": "https://www.nottingham.ac.uk/accommodation/options/nottingham-two",
    "content": [
        {
            "p": "Find the accommodation that's right for you Nottingham Two is situated adjacent Deakins Place, forming Student Roost's Nottingham Student Quarter. It is a five-minute walk to the Jubilee Campus, close to the city centre and Lenton. The property is made up of a mix of en-suites, which share a kitchen and living area with two to four other students, and self-contained studios which offer a private kitchen and living area. All residents have access to Deakins Place gym and a common room which features study pods and games tables. Accommodation is guaranteed for the first year. See full terms and conditions. Your Residential Experience Team (ResX) is available 7 days a week, from the day you arrive, until the day you leave, to support you to settle and thrive in your new home, and the fantastic community that you will belong to as a student at the University of Nottingham. We offer a supportive and non-judgemental wellbeing service for all our hall students. We can help with a wide range of issues and challenges that you are facing. Highlighting the amazing community we are a part of and setting expectations of behaviour across our halls. Every room comes equipped with a bed with underbed storage, wardrobe, chest of drawers, desk, chair and full-length mirror. Rooms also have free Wi-Fi. The University of Nottingham is the place for Sports, being Sports University of the Year 2024. So why not add a Sports and Fitness Membership to your accommodation? Whether you want to gym, swim, climb or join one of our sports clubs - our student sport and fitness membership has got you covered. With so much on offer, we give you the power to shape your own fitness and lifestyle journey. Students can use all three of our facilities at David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington and over 80+ University gyms around the country when they head home. All yours, all on campus. Nottingham Two is perfectly located as it’s just a short walk away from Jubilee Campus and a short bus journey away from the city centre. Access to Hopper Bus to University Park from Jubilee Campus, To finalise your offer, you will be required to read and accept a licence/tenancy agreement and terms and conditions from your accommodation provider Student Roost. We highly recommend that you read this along with a parent, guardian, carer, or school representative, as this is a legally binding document. You will be accepting liability for the full tenancy length of 45 weeks for undergraduates, or 51 weeks for postgraduates, including vacation periods. A £250 deposit is required to secure your booking, this will be refundable after the end of your tenancy as long as you have no additional charges on your room. Student Roost offer annual, monthly or termly payment plans. If you have any questions regarding your payment plans you will be able to discuss arrangements direct with Student Roost. All images used are for illustrative purposes only. Individual features, room sizes, and layouts will vary and these images may not represent wholly the actual fittings and furnishings. Video’s and images are correct at the time of filming, For the latest operational processes and the most up to date information please contact Halls Welcome Point and the Your Arrival Guide."
        }
    ],
    "pdf_files": []
}