{
    "url": "https://www.nottingham.ac.uk/adac/expertise/expertise.aspx",
    "content": [
        {
            "p": "Our areas of expertise is broad, and some examples of research conducted are listed below. Osteosarcoma is an aggressive malignant neoplasm in dogs, being common in larger breeds. In contrast, human osteosarcoma is rare and more commonly occurs in children where it is invariably lethal. The question of researcher Dr Nigel Mongan (School of Veterinary Medicine and Science) was \"can we exploit the unique genetic advantages of dogs as a model species to advance our understanding of the human disease?\" Freely available data was collected for over 500 canine and human sarcoma tumours from micoarray \"chips\". ADAC analysts combined the data, identified statistical differences associated with the tumour and mapped expression differences to a global map of protein interactions. This allowed the identification of conserved \"orthologous\" dog:human genes which differed significantly in expression as compared to non malignant specimens. Dr Mongan said, \"Working with ADAC allowed a thorough investigation of currently available data. We were able to identify candidates to explain species differences to what is presumed to be the \"same\" Cancer. Furthermore the study exploited the unique genetic characteristics of dogs which has enabled the identification of novel cancer associated genes with important relevance to human cancer. These genes represent novel potential therapeutic targets for human patients with osteosarcoma. The rapid turnaround of ADAC analysis has provided a fascinating avenue for ongoing novel research. The study would have been impossible without the expertise and enthusiasm of the ADAC team\". The explosion of data from so called 'omics' technologies has provided the researcher with an unprecedented amount of data. However, without the local skills to analyse and interpret these data, the problem of too much data and not enough information rears it's head. Professor Graham Seymour (School of Biosciences) approached ADAC to bring together the genomics, epigenomics and transcriptomics data produced by both the international tomato genome sequencing consortium and his own group to answer specific questions related to fruit texture. Prof Seymour said, \"having the local expertise to discuss our experimental aims and interpret our data has sped our research and will allow Nottingham to continue to lead on an internationally important research area\". Breast cancer is the most common cancer and cause of cancer death in women in England. In 2003, 36,500 new cases of breast cancer were diagnosed, representing 32% of all cancers in women. Out of these, 10,500 women died, a rate of 29 deaths per 100,000 women. Breast cancer is a heterogeneous group of diseases, with complex and distinctive underlying molecular pathogenesis.To address the breast cancer disease heterogeneity, clustering approaches have become more and more popular, especially for discovering profiles in cancer with respect to high-throughput genomic data. In literature, protein biomarker panels have been applied, with known relevance to breast cancer, to large numbers of cases using tissue microarrays, exploring the existence and clinical significance of distinct breast cancer classes through clustering approaches. However, since different clustering algorithms result in different clusters, particularly when large multi-dimensional data sets are considered, consensus clustering methodologies have been used in recent studies. ADAC analysts have applied different clustering algorithms to a large panel of patients presented at Nottingham City Hospitals with primary operable breast cancer, and, through a consensus clustering approach, have identified possible novel cancer subtypes. These subtypes have been subsequently refined by the ADAC centre by developing artificial intelligence techniques for biomedical decision support. In particular, fuzzy logic has been used to model the imprecision and uncertainty inherent in medical knowledge representation and decision making. The resulting seven groups of the breast cancer disease now need external clinical validation, but this research contributed to the creation of the so-called NPI+, a new clinical tool which modifies the original NPI by including modern 'genetic' markers. By doing so, the (proven) power of the original NPI is refined and enhanced to provide personalised advice to patients. Does the voice of your children sounds similar to yours? An interdisciplinary group of scientists from the University of Nottingham have set out to investigate which parameters of the human voice are heritable. Contrary to most research methods in the science of heritability which takes place behind lab’s close doors, the scientists has developed a novel research method called MOPE (for Massive Online Public Engagement) which will use the widespread diffusion of computers, smartphones, and tablets in the society to allow the public to take an essential part in the research. To take part in this study, only an Internet connection to the website, a microphone, and a voice sample spoken in English from both parents and at least one children are required. With enough people participating, the scientists hope to determine which voice parameters are heritable and build a predictive model, which could then be used by parents to determine which voice their future child is likely to possess. The MOPE method is a great opportunity for scientists and society to work together on a project which will provide information relevant to everybody. This type of approach is really important in our current society where scientific literacy is critical for future prosperity. A greater integration of the society in the scientific endeavors will become more and more necessary as the resolution of modern problems require a deeper involvement of the population. With the democratization of technological devices, we are likely to see more methods such as MOPE and if in exchange of a contribution, we are able to hear our children voice before their birth, it might be tempting. To visit the project’s website, please visit: https://voice.nottingham.ac.uk ADAC was a joint initiative between the School of Computer Science and the School of Veterinary Medicine and Science. We have since grown and became known as Digital Research Service, part of DTS. Please see our Contact Us page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}