{
    "url": "https://www.nottingham.ac.uk/adac/celebrating-10-years/celebrating-10-years-of-excellence-in-digital-research.aspx",
    "content": [
        {
            "p": "The Digital Research Service, formerly known as ADAC, had its 10th anniversary in 2022. On 21st & 22nd July 2022, a two-day conference was held to celebrate this milestone. It was a testimony to the achievements, collaborations and fruitful connections that have blossomed over this period. Our team has grown consistently and our expertise in the fields of Bioinformatics, Software Engineering and Data Science have led to several multi-million pound projects and cross disciplinary collaboration across the University of Nottingham and beyond. If you missed our event this year, rest assured that it will now be an annual fixture. The themes explored at this year’s event revolved around health data science and its implications in many people’s day-to-day lives. But the work we do encompasses Engineering, Geography, Business and Mathematics. At the very core of Digital Research, as a field of work, is problem-solving with high-end technologies. Due to this, much of the language used and the expertise required can sound jargony and intimidating, but our ethos and core goal is to empower all to become researchers, have access to information, and a better quality of life as a result. That might sound ambitious - and in fairness, it is - but ambition is our drive. And that is what we are good at. By developing systems like Trusted Research Environments (TREs), while simultaneously building infrastructures like HUTCH that allows for sensitive datasets that have been anonymised to be available as an open source resource, we are at the forefront of democratising research. Our strive for FAIR (Findable, Accessible, Interoperable and Reusable) data is responsible and each project we lead has Data Governance Standards at its core. We will never allow individuals in datasets to be traced or found, and there are many measures in place to ensure all are protected. The work we do has a real impact on people’s everyday lives because it is respected by the research community, and in turn influences policymaking. If you would like to find out more about our current projects and how the Digital Research Service could take your research goals to the next level, please get in touch. We look forward to hearing from you and seeing you at our upcoming annual event due to take place in June 2023. Here is a snapshot of the individuals we heard from during the two-day conference and the projects we have enabled: Day One All attendees were then invited to a dinner at the East Midlands Conference Centre. Day Two ADAC was a joint initiative between the School of Computer Science and the School of Veterinary Medicine and Science. We have since grown and became known as Digital Research Service, part of DTS. Please see our Contact Us page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}