{
    "url": "https://www.nottingham.ac.uk/alumni/share-your-university-wisdom-ahead-of-nottingham-ambition-giving-day",
    "content": [
        {
            "p": "This is the place where generosity thrives. This is the place where lives are transformed. This is the place where dreams become reality. On 1-2 November, Nottingham Ambition Giving Day returns. Together, thanks to over 500 donors and 50 ambassadors, we raised over £100,000 last year to make our first Giving Day a success. Join us this year as we unite to empower students, ignite their ambitions, and shape a future rooted in knowledge and enlightenment. Get involved and become a vital force in shaping the lives of future leaders, thinkers and trailblazers. Together, we can transform lives and pass on Nottingham's wisdom to future generations of students. Visit ambition.nottingham.ac.uk > We're taking a trip down memory lane as we build on the theme of this year's Nottingham Ambition Giving Day, based on the university's motto: Sapientia urbs conditur, \"A city is built on wisdom\". So we're looking for the best piece of wisdom that you took from your time studying at Nottingham. We'll be sharing these with students and with the rest of the alumni community online. \"If you’re planning to do an all-nighter in the libraries, I recommend Hallward. The beanbags are decently comfy for a power nap (stack two together)!\" Clarissa Anne Teo (International Media and Communication Studies, 2017) \"Choose your friends wisely – the people you meet at university could be in your life for a long time to come!” Chloe Eyre (Psychology, 2015) \"Always be bold if wearing the green and gold.\" Martin Cooper (Education, 1983) \"When times get tough, remember how you got here. Persistence, hard work, dedication. Nobody gave it to you. You earned it. And you have a great community around you to grow and become the great person you’re destined to be.\" Octavio Hernandez (PhD Operations Research, 1998) \"In the front of one of my psychology lab books, I wrote “Nihil ex nihilo fit” – nothing comes from nothing. I have found it to be true in life: something always leads up to events. You can read it the other way round too: do nowt and you get nowhere!\" Hal Westhead (Psychology and Mathematics, 1974) This year's Nottingham Ambition Giving Day is inspired by our university motto, \"A city is built on wisdom\". So, we're holding a quiz! Taking place on 2 November at the Trent Building and online, you can register a team of up to six players, or register yourself to join one of our assembled-on-the-night teams. We hope to see you there! Register for University & Alumni Challenge > We're looking for Giving Day Ambassadors! You can simply share our stories and updates on the day with your friends, or contribute content and give feedback on ideas we have. Find out more about Giving Day and join us as an Ambassador > How we use your information We are committed to protecting your personal information and being transparent about what we do with it. You can find out more in our privacy notice. 100 years ago, W. H. Revis left a gift in his will that’s still impacting students today. We found out a little bit more about the man and how his generosity is still helping those in need. In June 2022, supporters took part in the very first Nottingham Ambition Giving Day and the response was astonishing. Terry Baines (Chemistry, 1963) and peers from Hugh Stu recently celebrated 60 (and a bit) years since graduating from Nottingham. He shares their story. Uncovering unusual treasures at the University of Nottingham."
        }
    ],
    "pdf_files": []
}