{
    "url": "https://www.nottingham.ac.uk/alumni/shop-our-exclusive-paul-smith-for-the-university-of-nottingham-collection",
    "content": [
        {
            "p": "Earlier this month a VIP group descended on the Nottingham Paul Smith store for the official launch of an exciting new partnership between our two iconic Nottingham institutions. The collaboration between the University of Nottingham and the city's home-grown fashion designer Paul Smith will capitalise on the international reputation of both organisations to fly the flag for the city overseas. The two are joining forces to form a unique international partnership designed to support the city’s business growth, investment, and global profile. The two partners have particular influence in Asia, where the university has campuses in Malaysia and China, and Paul Smith has significant presence including a number of stores across China, Hong Kong and Malaysia. To mark the start of the partnership, Paul Smith has launched an exclusive limited-edition collection of University of Nottingham merchandise which pays tribute to his connection to his hometown and features the company’s striped design alongside a stylised depiction of the university’s iconic Trent Building - it's the perfect way to show off your university connection! Ideal for gifting, Paul Smith for the University of Nottingham range features wallets, socks, cufflinks, hoodie, scarf and silk tie, among others. The collection is available to shop online and the company is offering free international shipping, making it easily accessible to the university’s global community of 320,000 Nottingham graduates from more than 150 countries. Paul Smith is an invited member of the university’s Business Partnership Programme, which is designed to help its key industry partners to collaborate with the university and to work together on shared objectives. The partnership, which is tailored to each business, offers access to the university’s eco-system of innovation, talent and connections. Opportunities on offer through the programme include the chance to develop collaborative bids for UK Research and Innovation funded projects; preferential updates on intellectual property including technology for license and spin-out companies looking for investment; and access to experts for academic consultancy and our cutting-edge facilities and equipment. See the full range > Images © University of Notitngham/Andrew Hallsworth Photography Catch up with the latest news from around the university in May, including our 1973/74 Golden Reunion and unique running challenge from UNNC! Five things you need to know from around the university - and beyond - during February. This month, Pryzm is no more! Five things you need to know from around the university during December and January, including tributes to Professor Brian Tuck, who worked at the university for over 30 years and passed away in December. As she hands the baton over to Jane Norman, Professor Shearer West reflects on her seven years as Vice-Chancellor at Nottingham."
        }
    ],
    "pdf_files": []
}