{
    "url": "https://www.nottingham.ac.uk/alumni/seeing-beyond-the-remarkable-evolution-of-mri",
    "content": [
        {
            "p": "Each day, visitors to University Park Campus will pass through the main car park, yet few will notice the modest building sat at one end. Adjacent to the impressive Grade II-listed Cripps Hall, it is easy to overlook. But this is no ordinary building. A glance at the signage offers a clue to just what a truly remarkable place this is – where great minds from days past created and refined a technology that has helped save the lives of millions of people. At the Sir Peter Mansfield Imaging Centre, dedicated researchers today are continuing to develop and evolve this pioneering work to tackle new challenges. Professor Richard Bowtell (PhD Physics, 1988) is Head of the Sir Peter Mansfield Imaging Centre (SPMIC). He is also a former student of Sir Peter, who won the Nobel Prize in Physiology or Medicine alongside esteemed chemist Paul Lauterbur in 2003, for his work at Nottingham developing Magnetic Resonance Imaging (MRI). Sir Peter pioneered the use of nuclear magnetic resonance (NMR) to create cross-sectional images of living tissue by using gradients to spatially localise NMR signals. This was described in a landmark paper first published 50 years ago. Though these early images were coarse, this breakthrough soon revolutionised medical diagnosis and changed how the human brain and body is studied. \"50 years ago, what started as experiments in the physics department looking at tiny samples, developed into taking the first human images of a hand and then the whole body,\" explains Professor Bowtell. \"Today MRI scanners are commonplace in many hospitals, and we estimate that there are over 60 million, if not many more, MRI scans performed annually around the world – all helping clinicians and researchers to diagnose and treat a plethora of different conditions and diseases in people of all ages.\" Many of us will either have personally experienced an MRI scan or know someone who has. MRI offers doctors a safe, non-invasive way to see inside the body, imaging a 'slice' of an organism in spectacular detail, and opening a window into the brain and other organs of the human body. In doing so, this technology has helped millions go on to lead longer and healthier lives. Nottingham's progression within MRI has been a journey of ongoing discovery and refinement – with the next generation of Nottingham scientists and researchers now leading the way in pioneering new projects. \"Developments in Nottingham have all combined to underpin the improvement in MRI technology over the years,\" explains Professor Bowtell. \"As we've worked to overcome some of the challenges and limitations with the technique, we've also discovered new avenues for research.\" It's certainly an exciting time at the SPMIC, with the recent announcement of a £29.1m grant to establish a new 11.7T MRI scanner at a national research facility at the Centre here in Nottingham. A thousand times more powerful than the first scanners developed by Sir Peter, this ultra-high field scanner will enable the university to attract and collaborate with researchers around the world, helping to improve our understanding of neurodegenerative diseases such as Alzheimer's and Parkinson's, plus neurodevelopmental disorders including autism among many others. \"The 11.7T scanner will allow us to look in very fine detail at the anatomy,\" continues Professor Bowtell. \"We can look at function at the level of structures in the brain that are more relevant for the way it operates. These are just becoming visible with our current 7T scanners, but are not very robustly accessible. This more detailed imaging opens up so many new neuroscience possibilities. \"For example, because there is lots of water in the body, we normally image using hydrogen nuclei because there are lots of these available for us to get a signal from. However, inside our bodies there are many other nuclei, like deuterium, but these exist in miniscule quantities, so their signals are hard to distinguish from all the 'noise'. This new scanner gives us the chance to measure signals that rise well above the 'noise'. \"Deuterium is very exciting because it can help us learn more about metabolism. If a patient ingests glucose, that is labelled with deuterium, we can track the chemicals that are produced when it is metabolised. We already know that glucose metabolism changes in tumours, so this provides a new way of mapping metabolism in the brain that has not been possible before now. It's opening up another technique that is complementary to existing cancer diagnostics, positron emission tomography.\" Left to right: Professor Richard Bowtell, Head of the Sir Peter Mansfield Imaging Centre; Professor Matt Brookes, Professor of Physics; Professor Sir Peter Mansfield, when he joined the university as a lecturer, image: University of Nottingham Manuscripts and Special Collections UMP/10/14/5/57 But this isn't the only area of development. An innovative research team led by Professor Matt Brookes (Physics with Medical Physics, 2002; PhD, 2005) has recently developed the world's first wearable magnetoencephalography (MEG) system, which could be a game-changer for researchers both as a neuroscientific and diagnostic tool. \"MEG works by measuring the weak magnetic fields produced outside the skull by current flow inside the neurons in the brain,\" explains Professor Bowtell. \"While traditional scanners need the patient to lie completely still inside a large, claustrophobic machine, what my colleagues Matt and others have done, is to develop new technologies to create a lightweight helmet that delivers astounding images of the working brain. This technology can be adapted for a baby or child, offering a much less frightening experience for the patient without compromising data quality. \"Even more excitingly, by integrating OPM sensors, this team have created a scanner that works while the wearer is mobile. This innovation, which exploits magnetic coil designs that were originally used in MRI, is creating so many new possibilities – we can start to answer questions like: why do we fall more as we get older and what happens in the brains of infants as they grow?\" It is imperative that the university continues to build on the exceptional foundations that started at Nottingham. Working across teams is one of the strengths of the university that enables progress to continue. \"Everything we do at the SPMIC is inter-disciplinary, drawing in colleagues from different departments and specialisms,\" continues Professor Bowtell. \"Our centre is relatively unique in that it has stayed strongly connected to the School of Physics and Astronomy, fostering excellent connections to many other departments. Professor Penny Gowland from the School of Physics and Astronomy has pulled together a team of medics, physicists, engineers and mathematicians to investigate how the placenta works by using advanced MRI techniques, while colleagues in the School of Computer Science are looking at how we can get enhanced information from images using Artificial Intelligence (AI). How we use AI to acquire images is another area for development, yet attracting and retaining talent is a challenge that all academic institutions face. It's one of the reasons why funding and support, especially for PhD students, is so important. \"We're a very collegiate centre and when we go to conferences, we see many people who have come through Nottingham who are now leading research departments all over the world. We've had a reputation as an excellent place to study and train right from the early days, and it carried on now. \"MRI is such a rich technique, there are always new things that come along. There's an element of serendipity – when something unexpected turns up in the signals that we didn't predict – and good science is being able to spot that opportunity and see where it takes us.\" MRI is helping unveil the mysteries of the human body in ways unimaginable 50 years ago, propelling us towards a future where the unseen becomes visible. With open eyes and focused minds – like Sir Peter all those years beforehand – we remain ready to explore the next wave of opportunities that lie ahead. 1964: Professor Sir Peter Mansfield first joins the university as a lecturer. 1970: University researchers, led by Sir Peter, start to explore how Nuclear Magnetic Resonance (NMR) could form the basis of a new medical imaging technique. 1973: Sir Peter published his landmark paper showing how radio signals from nuclear magnetisation can be mathematically analysed to produce useful images. 1974: Sir Peter takes the first MRI scan of a human body part – research student Dr Andrew Maudsley's finger – revealing bone, nerves and arteries. 1978: Sir Peter becomes the first whole-body volunteer – despite warnings that the magnetic gradient might be strong enough to induce cardiac fibrillation – creating the images of a human torso. 1991: The Magnetic Resonance Centre was opened, focusing on dynamic imaging using echo-planar imaging (EPI), NMR microscopy and neurospectroscopy. 1993: The development of the world's first 3T magnet led to applications in functional MRI (fMRI), including some of the first ever event related studies. 2003: Professor Sir Peter Mansfield is awarded the Nobel Prize in Physiology or Medicine alongside collaborator Paul Lauterbur. 2004: The Centre is expanded and renamed the Sir Peter Mansfield MR Centre (SPMMRC). 2005: The UK's first 7T scanner is developed at the Centre. A 275-channel magnetoencephalography (MEG) scanner was added in 2007. 2018: The first wearable MEG system becomes operational. 2023: We celebrate 50 years of MRI research and innovation. Millions of people all over the world benefit from this journey of research and discovery. Words: Victoria Hodson and Alex Kuster I Photography: Marcus Holdsworth and Lisa Gilligan-Lee Four of our outstanding research fellows share their inspiration and give a little insight into what makes them tick! Incorporating sustainability into teaching across the curriculum at Nottingham is helping today's students protect the future of the planet. We find out how learning is being transformed."
        }
    ],
    "pdf_files": []
}