{
    "url": "https://www.nottingham.ac.uk/alumni/my-office-katie-moncur",
    "content": [
        {
            "p": "Our latest My Office is the perfect juxtaposition of history and modernity as Katie Moncur (English, 2020) shares what it's like to be the Social Media Officer for Historic Royal Palaces. An independent charity, it is responsible for the upkeep of six of the most iconic palaces in the UK, including Hampton Court and the Tower of London. Katie's role sees her producing content for 2.6 million followers across 15 social media channels and her office is literally a stone's throw away from the Crown Jewels! Let's find out more... I am currently a Social Media Officer, videographer and photographer, spending my days creating content for our 2.6 million followers across 15 channels, including TikTok which we launched last year. In an average week, you’ll find me hopping between our palaces on many a weird and wonderful film shoot but my permanent office is the Tower of London - my desk is a stone's throw from where the Crown Jewels are kept! It is a bit of a strange feeling walking in every day, staring up at the iconic White Tower, saying hello to our seven resident ravens (we must have six or else the Tower and London will fall apparently, but we always have one spare...) and trying not to think about what the walls around me have seen over the centuries (yes, filming here after dark is pretty scary.) And if I make a mistake at work, I am worryingly close to the ‘Torture at the Tower’ exhibition so that keeps me in check. A significant moment for me was when I accepted my first job in the media/PR world, choosing a lower-paid four-month contract for a charity I loved over a permanent, higher-paid role for an online publication that I wasn’t so sure about. I was lucky enough to be living with my parents so I was able to take the chance and, even though it was only for a few months, working for the national PR team at the Royal National Lifeboat Institution (RNLI) kickstarted my entire career and gave me invaluable experience in the charity sector which secured me my current job! I remember during my last week working for the RNLI, I was on the phone with someone who was saved by RNLI lifeguards, checking in with them after they had done a media interview for us, and she was asking about my new role. I was telling her about how sad I was to leave the RNLI but how excited I was to start my job at the Tower of London, and she paused and said ‘That is so strange, I am currently stood in my kitchen looking at a photograph of the Tower of London on my wall and it reminds me that some things are just meant to be’ and that really made me believe I was on the right track. Creative, personable, flexible, good at multi-tasking and good with words! Our social media feeds are saturated with content so a big part of the job is finding creative ways to share organisational stories to cut through the noise and being able to condense quite complicated subject matter into an accessible 30 second video which instantly engages people with witty copy or enticing visuals. The world of social media is constantly evolving so you need to be willing to adapt and change your ways of working as you go along, learning from every piece of content you create and post and doing so while juggling lots of different projects. A lot of my job is also cultivating relationships with different teams across the organisation, staying in the know about new discoveries and projects and working with colleagues to build their confidence on camera and gain their trust so that they actually say yes when you wander over to their desk for the tenth time and ask them to do a trend for you. Not wanting to sound like I was digging for compliments, I reluctantly asked my colleagues this question and they came back with: creative, witty, imaginative, pun-tastic (I am a sucker for a good pun and our social media followers give me far too much positive reinforcement for me to ever stop.) My manager very kindly described me as ‘A positive and sunny presence in the team, full of ideas, energy and good vibes’. Wowzers, what a nice pat on the back… There are so many things I love about my office! The Tower of London is the gift that keeps on giving as it’s an incredibly aesthetic backdrop with lots of secret nooks and crannies to explore (including an on-site pub for the Yeoman Warders) and there’s even a Tower of London cat! But on the less glamorous side, my office is basically an old brick building that is freezing in the winter and boiling hot in the summer as William the Conqueror really didn’t consider my social media needs when building the Tower in the 1070s – so selfish! There are also a lot of tourists (as you’d expect for a UNESCO World Heritage Site) so fighting through crowds to get out of the fortress on my lunch break leaves a lot to be desired. I couldn’t live without my toy raven who sits by my desk phone and answers calls for me while giving me moral support throughout the day. But really, I couldn’t live without our desk drawer full of earplugs – these are an absolute necessity when filming a gun salute at the Tower of London as you’re standing near to a firing cannon trying not to jump out of your skin. This is such a hard question to answer but one of the most unexpected moments was finding out on the day that I was going to be photographing Alessia Russo from The Lionesses on her visit to the Tower of London! I even got to hold the football boots she was wearing when she scored that iconic back-heel goal in the Euros. Who would have thought?! I’ve learned to love wandering around our palaces in the dark but Halloween filming at the Tower of London (and Hampton Court Palace) is always a memorable experience… I’ve had two ghostly encounters in my three years of being here and I want to keep it that way please – one of these occurred when I was filming ‘witch marks’ in an old prison cell and the experience left my manager and I in hysterics! If you have an exciting, creative idea (no matter how crazy you think it is), don’t be afraid to share it! From my time working on Impact Magazine to working now for Historic Royal Palaces, one of the ways I have forged meaningful connections and created opportunities which have kickstarted other pursuits is through sharing wacky ideas, suggesting new lines of thinking and being up for experimenting. No matter the role you’re looking for, people are generally looking for new and better ways of doing things and I was later told that my enthusiasm and the ideas I gave in my interview are a big part of why I got the job. Oat milk, no sugar and it has to be in the biggest vessel you can find (my colleagues have nicknamed my work mug ‘The Tank’). We're always on the lookout for alumni with quirky, unusual and interesting jobs to share their offices with us. Sound like a job for you? Contact the team > In the second of our series, we meet Emily Seto (Clinical Microbiology, 2016), a Planetary Protection Engineer at NASA's Jet Propulsion Laboratory. Dana Hamzah (Industrial Economics and Insurance, 2008) works for the International Monetary Fund (IMF) in Washington DC, the organisation responsible for generating sustainable growth and prosperity for all of its 190 member countries. She gives us an insight into what it's like working at one of the most high profile organisations in the world. The title of British Ambassador is one which might evoke thoughts of exotic far-flung destinations, intrigue and glamorous dinners. But is it the reality? John Pearson (Geography, 1990) gives us an insight into his job as British Ambassador to Laos. For our latest My Office we're in the thick of the newsroom with journalist James Bovill (History, 2004) and sub-editor Rebecca Harty (History and Politics, 2018)."
        }
    ],
    "pdf_files": []
}