{
    "url": "https://www.nottingham.ac.uk/alumni/women-in-business-challenges-aspirations-successes",
    "content": [
        {
            "p": "The Ingenuity Lab, situated in the Haydn Green Institute, is a place where students and alumni of the University of Nottingham can explore their business ideas and start their own enterprises. It was established in 2013 thanks to a generous donation from the Haydn Green Foundation. The Lab offers a friendly and uplifting environment to help students and alumni to make their dreams of entrepreneurial success a reality. As well as business advice, student and alumni entrepreneurs can receive mentoring, desk hire and networking opportunities, giving them the business tools they need to thrive. The Haydn Green Institute Terri Holloway, who manages the Lab, says: “Now more than ever before, it’s imperative that female entrepreneurs are acknowledged for their overwhelming contribution to women in business. The Ingenuity Lab is integral in providing support to launch women’s businesses, which puts career choices back into the hands of women, allowing them to realise their true aspirations. We strive to create more opportunities for women to thrive in business.” ChangeXtra is a business where women with lived experience support conversations about menopause. I participated in the Ingenuity Impact scheme in 2020. Throughout my year as a student, I was on the Ingenuity training pathway to develop my business plan with the support of some inspirational resources and speakers. ChangeXtra aims to break down the stigma around menopause. Our goal is to educate, empathise and evaluate to build more understanding and awareness of menopause. If you think you have a good idea that you want to grow, the Ingenuity Lab is a wonderful supportive environment that gives you access to all the expertise and support anyone could need to start in business. Women need support to manage through the menopause and thanks to donations towards the Ingenuity Lab and the volunteer business mentors, I can help women during this time. Without supporters like you, the Haydn Green Institute and the Ingenuity Lab, ChangeXtra would not exist. Thank you for helping to change my life and for enabling me to help others and change their lives for the better too! I live on my family’s dairy farm in Derbyshire and milk the pedigree herd of Locklan Holsteins. The National Farmers Union have set a target for all British farmers to be carbon net zero by 2040. We decided to adopt a regenerative approach to help reach this sooner. We use a strip-grazing system for our cows to reduce waste on our farm and better utilise our resources. Our sustainable efforts resulted in me winning the Countryfile Young Countryside Champion Award in 2021. Agriculture used to be a maledominated industry, but there is becoming more and more of a female presence. Pitching to the Ingenuity Lab is an opportunity to secure funding for your business or just to get experience of talking in front of a group of people. I’d like to say thank you to the donors that helped me. I’ve gained so many different skills and met so many innovative and talented individuals. I’ve broadened my knowledge and achieved many things I didn’t believe I could. Thank you for your support! Third Culture Nellie is an online platform that aims to make long term travel and language learning more accessible and encouraging others to step outside their comfort zones. I research how to study and work abroad, paid opportunities for travel, debunk country stereotypes and share the adventures I have had with strangers I've met on my journeys. Entrepreneurship, however, can be a lonely experience. Accessing courses and tools as a member of the Ingenuity Lab helped me meet other like-minded individuals. In the future, I’d like to work with causes I care about and support those who do not have the freedoms to travel and those resettling in new homes. Thank you so much to the donors who have given to make my business dream a reality. Third Culture Nellie has benefitted greatly from the Ingenuity Lab. It’s been a blessing during the pandemic. I hope I can visit the Lab soon now things are slowly returning and give back to help other entrepreneurs facing similar challenges. Kohl Kreatives is a British start-up which launched in 2015 and changed the market with its collection of makeup brushes for customers affected by motor function issues. Kohl Kreatives’ industry-broadening mission extends to anyone for whom makeup is a self-esteem booster. Through our charity Kohl Kares, we provide free cosmetic technique workshops to people undergoing gender transitions and receiving chemotherapy as well as with trichotillomania, alopecia, vitiligo and port wine birthmarks. We are the first beauty brand to incorporate Braille as a part of our process. Our mission is to help everyone empower themselves through the power of makeup. The Lab works in partnership with the University of Nottingham’s Visa and Immigration team to offer a set number of endorsements for start-up visas for Overseas students each year. I was fortunate to be a part of the Ingenuity Lab, and have my visa be sponsored via the university to trade my business. Being a part of the Lab has been a wonderful opportunity to stay on the pulse of new graduates and concepts. We really feel as though we’re a part of the university’s community. These incredible ideas have been made possible thanks to your donations. Thank you. If you’d like to volunteer your time by becoming a mentor or a guest speaker, please get in touch on supportus@nottingham.ac.uk Nottingham has an established tradition of elite athletes choosing to study with us. This year, you helped support a record number of student athletes to compete at the highest level during their studies. As part of our spring focus on digital technologies in Connect: Business we speak to Tatenda Furusa (MSc Business and Management, 2017). We speak to the MBA alumna who recently became the first woman to hold the top job at the African bank For one Nottingham sports scholar, your support is giving him the opportunity to set his sights on competing at the Paris 2024 Paralympic Games."
        }
    ],
    "pdf_files": []
}