{
    "url": "https://www.nottingham.ac.uk/alumni/my-office-madeline-pizzoni",
    "content": [
        {
            "p": "We’re taking you behind-the-scenes in our new series, My Office, exploring the working spaces of alumni around the world to give you the inside view into what careers are really like – and hopefully provide some inspiration along the way! In the first of our series, we meet Captain Madeline Pizzoni (Nursing, 2013), Army Air Corps Wildcat pilot. Name: Maddie Pizzoni Job: Front-line Wildcat pilot with 659 Squadron Army Air Corps Office: 15m long, 3m high and usually found at about 500ft above ground level! Hi Maddie! So tell us, how did you come to work in your current office? “After finishing school, armed with my A-Levels, I applied to the University of Nottingham to study nursing. I definitely knew that I wanted a job where I’d be able to make a difference to peoples’ lives, no matter how small that difference may be. “I had an absolute ball at University! I loved being in Nottingham, both on campus and in Lenton from second year. The long hours as student nurses was a little tough as a Fresher but the relationships we made with patients and the lives that we could be a part of made those early mornings all the more rewarding. “I joined the East Midlands University Officers’ Training Corps (affectionately named EMU) in my first year. I had always been intrigued by the Army but honestly thought it was something I wasn’t really cut out for – I wasn’t particularly fit, I had no military experience and I was under-confident in my abilities. But I joined up with a couple of friends and never look back – I loved it! My experience in EMU completely shaped my decision to change careers and join the Army full time. It was while I was there that someone floated the idea of flying within the Military. I thought I had absolutely no chance of passing the selection tests, as I didn’t have a background in maths or engineering, but after a bit of encouragement from friends I went along to the selection to see what it was all about. “Passing the selection tests for the Army Pilots’ Course was the turning point for me. I did the tests while I was still at Nottingham so that I knew I definitely had a place on the course before making the leap from nursing to the Army. I really didn’t think I would pass the tests, so when I did I knew it was an opportunity that I had to take.” What would you say are the key characteristics of someone who does your job? “Remaining calm while under pressure, good hand-eye co-ordination, flexibility and a sense of humour.” What’s the one thing about your office which most love or hate? “Love: Low flying along the coast-line or in the mountains on a crisp, bright day. Hate: All of the administration that needs to be done before actually getting in the air (does anyone like paper work?)\" And is there anything you could not live without in your office? “My VAMPS. These are made-to-measure earplugs that go underneath our helmets. They allow us to hear the radios and other crew members but block out the background noise and vibrations. I’m sure my ears will thank me for them in 20 years’ time!” What’s been the best moment working in your office? “Finishing the course after four long years and finally being able to tell people you’re qualified!” And the toughest? “I suffered a big knee injury about 2/3 into my training. I needed surgery and there was a high chance I wouldn’t be allowed to fly again. The Army took fantastic care of me and I had access to daily physiotherapy to get me back to fighting fit, but I wasn’t given the go ahead to fly again until 12 months later. It was difficult to stay motivated for those 12 months, not knowing whether I would have a job at the end of them, but it made me realise how important the job was to me and made me appreciate it even more once I was reinstated.” Life is very different for all of us right now with the coronavirus pandemic, how has this affected the Army? “Throughout the coronavirus crisis, we have been deployed on Operation Rescript as part of the Covid Support Force, providing help to the emergency services and on standby to assist with the movement of life-saving equipment across the country as well as transporting patients in harder to reach areas. A large part of our day-to-day flying has also been maintaining essential currency: skills such as low flying, night flying and flying in formation are perishable and we have to ensure that we routinely carry out these types of trips to keep competent. “I was absolutely delighted to be asked to be involved in a training trip with our sister aircraft, the Apache, that would culminate in a surprise birthday fly-past for Sir Tom Moore. Not only is he an incredible inspiration in his achievement of reaching 100 years old, but he has also been a beacon of hope and positive amid the uncertainty of the last few months – a true example of overcoming and adapting in a difficult situation. Led by the Apache, we were able to fly directly over the top of his house and give him a birthday wave and salute. My crewman, leaning out of the back door, assure me that he was waving back at us! It was a real privilege to be able to show our appreciation of all the money Sir Tom has raised by taking part in his birthday celebrations.” How would your work colleagues describe you? “The small, smiley one.” Do you have one piece of advice for someone who wants to work in an office like yours? “Don’t let your inner demon win – if you want something enough and are prepared to work hard for it then there’s no reason why you shouldn’t succeed.” And finally, how do you take your tea? “Make it a coffee!” Get involved in My Office – share your space with us by emailing alumni-enquiries@nottingham.ac.uk Richard Munang shares a typical day in his life as Deputy Director of the United Nations Environment Programme (UNEP) in Africa. Almost 1,000 of you generously shared your time and expertise as volunteers over the last academic year. We're celebrating this Volunteers' Week – and see some of our upcoming opportunities. We meet Levison Wood (History, 2004), best-selling travel writer, explorer and photographer, to find out about the ‘best job in the world’. There comes a point in any job when you feel ready for the next challenge. So how can you take action to ensure progression? Our resident jobs expert Sue Mason, from the NUBS Postgraduate Careers team, shares her advice with five steps you can take to advance your career."
        }
    ],
    "pdf_files": []
}