{
    "url": "https://www.nottingham.ac.uk/alumni/vice-chancellors-lecture-net-zero-in-a-volatile-world",
    "content": [
        {
            "p": "How do we achieve clean growth without increasing global inequalities? Can we solve the climate crisis for everyone rather than just the few? Our latest Vice-Chancellor's Lecture at Lakeside Arts saw our panel of experts in geopolitics, energy infrastructure and sustainability explore the path to energy freedom and a sustainable future for all. Professor Lucelia Rodrigues Professor Lucelia Rodrigues is Chair in Sustainable and Resilient Cities at the University of Nottingham, Head of the Department of Architecture and Built Environment and Deputy Director of the Energy Institute. Sir John Sawers Sir John Sawers (Physics and Philosophy, 1976) has spent his career in international affairs. He worked as a diplomat in Africa, the Middle East and the United States before becoming the UK Ambassador to the United Nations where he was closely involved in the debate on climate, both mitigating its effects and how to adapt to unavoidable change. Steve Holliday Steve Holliday (Mining Engineering, 1978) is the former Chief Executive of National Grid plc. He is currently Chairman of Cityfibre, Chairman of Zenobe, and recently finished serving as the President of the Energy Institute. Steve also holds honorary doctorates from Nottingham and Strathclyde universities. Professor Jane Norman (Facilitator) Professor Jane Norman is Provost and Deputy Vice-Chancellor at the University of Nottingham. Jane graduated in Medicine from the University of Edinburgh in 1986 and was awarded an MD by the University of Edinburgh in 1992 before training in clinical and academic medicine in Edinburgh and Glasgow. Need a crash course on this year's Oscar favourites? The university's Professor of Film Industries, Gianluca Sergi shares his five to watch. Find out what the future holds for ChatGPT, the AI bot that has been the talk of the office ths year, as the university's resident machine learning expert Jeremie Clos gives us the lowdown. Find out how to stand out, deciding on your specialism and the best way to get into the green sector. Share your passion and expertise for sustainability by volunteering for new UK-wide Climate Ambassador Scheme!"
        }
    ],
    "pdf_files": []
}