{
    "url": "https://www.nottingham.edu.my/Alumni/Funds/make-a-difference-money-fund.aspx",
    "content": [
        {
            "p": "The fund has been established to provide financial support for student projects which have a positive impact on the wellbeing of others locally, regionally and globally. These projects may be academic, pastoral or extracurricular, or enhance student outreach or community activities. We are inviting friends and alumni of the University of Nottingham to donate to MAD Money Fund. The MAD Money Fund is established by Malaysia Campus to provide financial support to student initiatives that : This provides RM500 to RM5,000 for each projects. The University is allocating annual seed money of RM20,000 and 2% contribution from UNM cash card sales to support the fund. The MAD (Make A Difference) Money Fund Autumn semester is now open. The Fund provides RM500 to RM5000 for each project, with an expectation that most awards will be for RM2000 or less. The MAD Money Fund application form, agreement and guiding document are enclosed. Interested applicants are strongly recommended to go through the following documents. Guiding document Application form Agreement Applications should be submitted before midnight on the following dates and will be reviewed within two weeks of receipt. Closing date: Intake 2 : Monday, 30 March 2020 For further inquiries, you may contact MAD Money Fund Guideline: The Project Approver (Section 5 in the Application Form) is responsible for the budget and execution of the project. Those seeking Project Approval from SA’s Office is to ensure that proposals are submitted one week before the closing date for project review. Upon receipt of SA’s Office approval, email a copy to MAD@Nottingham.edu.my. We look forward to your application! telephone: +6 (03) 8924 8373 fax: +6 (03) 8924 8657 email: alumnirelations@nottingham.edu.my"
        }
    ],
    "pdf_files": [
        "pdf_files/MAD-Money-Fund-Guiding-Document-edited.pdf",
        "pdf_files/MAD-Money-Fund-Application-Form-002.pdf",
        "pdf_files/MAD-Money-Agreement.pdf",
        "pdf_files/MAD-Money-Agreement.pdf"
    ]
}