{
    "url": "https://www.nottingham.ac.uk/alumni/james-digva-sauce-shop",
    "content": [
        {
            "p": "A pivotal decision to switch degrees set Sauce Shop co-founder James Digva (Food Science, 2007) on a path to creating one of the UK's fastest-growing sauce brands. We spoke to James to hear about his journey from cooking sauces in his kitchen after work, to being stocked in every major supermarket in the UK - offering candid insights into retail relationships, marketing strategy, and the realities of scaling a consumer brand. Not everyone can pinpoint a moment that changed the trajectory of their lives. For Sauce Shop co-founder James Digva, however, it was probably when, halfway through his first year at Nottingham, he decided to switch a degree in Computer Science for Food Science. “I had a moment where I was just like, ‘I don’t think this is me. I don’t think this is my future.’ And I pretty much just got up and left,” he says. A reassessment of his passions and priorities led him to Sutton Bonington campus, where he enrolled on the BSc Food Science course. “I was already really into food, and it just seemed the right thing to do,” he explains. “Some of the most interesting parts for me were projects that were around developing a food product - they were the bits that I absolutely loved. It definitely set me off on a particular path that's led me to here.” After graduation, James got a place on a graduate programme in the corporate food industry, where he met his wife and co-founder, Pam. The pair worked in product development roles in the industry for a number of years before starting Sauce Shop as a side project in 2014, selling their homemade sauces at West Bridgford farmer’s market. What began as a small experiment quickly turned into something much bigger, as customers continued to flock to their market stall. By Christmas of that first year, bigger orders were coming in from delicatessens and shops wanting to stock their sauces, as the pair scrambled to keep up with demand while juggling full-time corporate roles. “We started it on the side really just as a bit of fun,” James explains. “Then we got to a crossroads where it's kind of like: what's going on here? Because this this bit of fun has now taken over our lives and it's more demanding than our jobs.” James working from his home kitchen HQ in the early days of Sauce Shop Within two years, the couple had left their jobs to pursue Sauce Shop full time. Running a business, as James quickly learned, is a constant cycle of problem-solving: from scaling production to handling relationships with major retailers, each stage of the journey has presented its own unique set of challenges, with profits continually reinvested in expanding capacity. In the early days, this meant upgrading their 5kg pan to a 15kg one – today it looks like 1000-litre cookers and an industrial bottling machine for their factory in Nottingham. “We're always trying to grow because with growth comes stability - but that also means we're constantly dealing with new challenges. Running a business is basically just bouncing from one problem to the next, trying to find solutions... hoping nothing is catastrophic enough to kill you or the business,” he laughs. A pivotal moment came when they secured a listing with a national garden centre chain - their biggest order to date. However, with slow sales, James quickly learned that securing a listing wasn't the endgame. \"When you're early on in the journey of a business, you think the listing is the Holy Grail. Like 'Wow, we've got this listing. We're onto something big now.' Actually, the easy part is the listing. Getting it back off the shelves in customers' baskets is what really counts.\" Fast forward to 2024, and James and Pam’s sauces are a feature of supermarket condiment aisles across the UK. It’s been a constant process of learning and evolving maintain the highly sought-after shelf space. “Once you've secured some shelf space, the onus is on us to make sure it’s working as hard as possible for them,” he explains. “We’re always trying to think about what the retailer needs, and how we can support that. If you’re not managing those relationships well, even great products can get lost on the shelf.” In a market where ketchup giants spend millions, it's a constant battle to raise awareness of the brand. Outside of traditional retail promotions, Sauce Shop uses organic and paid social media to build awareness and direct people to their website, while influencer marketing has become a vital part of their strategy, with recipe collaborations and affiliate programmes allowing content creators to earn commission by referring customers. For aspiring entrepreneurs, James emphasises the value of hands-on experience before launching a venture. “I’d recommend joining a young business with potential to scale,” he says. “You’ll learn a hell of a lot because you won’t just have one job—you’ll be doing all sorts. That would be a really good way to get a taste of what it's like to run a business, because it’s pretty horrible at times. It’s really stressful!” His most emphatic advice centres on financial management. \"If there's one thing I wish I knew when starting out, it's the importance of being absolutely obsessed with the financial side of things,\" he reflects. \"We could have scaled with profit much earlier if we'd had a better handle on our numbers. In the early stages, you need someone in the team who lives and breathes the financials - businesses are run on numbers, not just good products.\" From starting small and scaling thoughtfully, to staying resilient in the face of challenges and keeping on top of the spreadsheets, James’ experience is a testament to the hard work and persistence required to build a successful business: be prepared for the journey of continuous improvement, and never stop learning. If you're interested in hearing more insights from alumni business owners, join us on Tuesday 19 November for our upcoming webinar, Building an entrepreneurial mindset for everyday success. To mark Global Entrepreneurship week, we're bringing together two expert panels of alumni founders who will discuss how an entrepreneurial mindset can help drive innovation and creativity, generate fresh ideas and new ways of problem solving. Chaired by Dr Terri Holloway, Head of the Ingenuity Lab, this isn't one to miss! Book your place Nottingham’s career placements programme gives aspiring graduates the opportunity to gain valuable experience in the workplace. We caught up with alumni Paul Gurney to hear how he applied his background in sustainability to build a business with a strong social purpose, BecomingX's approach to social responsibility, and his journey as an entrepreneur committed to making a positive impact. Managing Director of renowned advertising agency adam&eveDDB, James Rowe (Geography, 2009) shares the secrets of Christmas TV adverts! Two of last year’s five national Ingenuity Programme winners were University of Nottingham alumni – Climate Champions, Pipeline Organics – a team of Nottingham-based biochemists and engineers – and Food Sciences alumnus Jared Spencer, who won UoN Impact Entrepreneur of the Year for his business Riddim Snacks."
        }
    ],
    "pdf_files": []
}