{
    "url": "https://www.nottingham.ac.uk/alumni/a-guiding-light-to-ghana-1",
    "content": [
        {
            "p": "As a young man growing up in Ghana, Dr Eric Gyan (Cancer Immunology and Biotechnology, 2011) had a dream to become a physician. But only thanks to the university’s international scholarship programme and the generosity of alumni donors was this dream able to become a reality. One of the university’s driving ambitions is to ensure our education is accessible to the brightest and most talented, regardless of their background. Thanks to our international scholarship programme we’re able to offer hundreds of students across the world the opportunity to study at Nottingham who otherwise may not be able to do so. Words: Chris Hickman Commonwealth Scholarships are given to talented individuals from selected Commonwealth countries who demonstrate the potential to make a positive impact on the world. The University has been partner in the programme for a number of years and welcomed students from a range of countries including Sierra Leone, Zambia and Sri Lanka. One of which includes Dr Eric Gyan “Even as a young man with very humble beginnings, I always wanted to help save lives, impart knowledge on the younger generation and undertake cutting edge research to advance medical knowledge. However, my ambition to become a physician was only ever likely a dream due to lack of financial support. “So studying cancer immunology and biotechnology at the University of Nottingham on the prestigious Commonwealth Scholarship became a life-changing experience. Having the opportunity to study outside my home country, Ghana, for the first time was an exciting moment. Living and studying in the UK, with the best educational and research facilities and world-renowned lecturers, was a humbling experience.” One of the reasons that gifted and determined people like Eric can benefit from a scholarship is thanks to the generosity of alumni like you. Which brings us to Professor Christine Humfrey MBE (Education, 1979). Not only did Christine study here but she then furthered her association by working at the university as founding Director of the International Office, her affinity clear for all to see. Christine sadly passed away in 2020, but not before she committed the generous act of pledging to leave a legacy to Nottingham in her Will. Christine’s legacy will soon be furthering our international scholarship programme, guiding gifted students like Eric and helping spread the light of learning. Something which her husband Michael knows would mean a great deal to her. Selfless pledges like Christine’s really do change the lives of so many talented students, demonstrated by the further success and continued determination of Eric to learn, save lives and be a guiding light to the next generation as a lecturer himself. “On returning to my home country after my masters degree I qualified as a doctor, but realising the increasing trend of breast cancer deaths in Ghana, I knew I had to do more. I founded Med Cancer Care Foundation, an NGO which educates and screens for breast and cervical cancer for free. Through this, I have been able to impact the lives of many less privileged individuals in Ghana. “It is without question that my ambition of becoming a physician would not have materialised without the two Commonwealth Scholarships I was privileged to be a recipient of.” If your affection for Nottingham matches that of Christine, please consider leaving a Gift in your Will and become a Guiding Light to others. Find out more > Like many of our gifted sports stars, History student and University of Nottingham men’s rugby player, James Cherry, has boundless energy and talent. James explains how your donations towards sport are helping him to go the extra mile. After receiving Cascade funding, Aerospace Engineering student Ben Payne is aiming to open the aviation industry to a more diverse audience. As well as business advice, student and alumni entrepreneurs can receive mentoring, desk hire and networking opportunities, giving them the business tools they need to thrive. This year's Nottingham Ambition Giving Day on November 1-2 is inspired by our university motto 'A city is built on wisdom'. So we're looking for the best piece of wisdom you learned while at Nottingham!"
        }
    ],
    "pdf_files": []
}