{
    "url": "https://www.nottingham.ac.uk/alumni/the-second-quarter-century-india",
    "content": [
        {
            "p": "This year marks the 25th anniversary of Nottingham University Business School. To celebrate, we’re hosting a series of events around the world, looking forward to the next 25 years in business and finance. Starting off in New Delhi and Mumbai, the Second Quarter Century events will bring leading thinkers from the school and alumni community together to discuss the challenges and opportunities for the years ahead, hosted by Dean of NUBS UK, Professor David Park. With India's recent Chandrayaan-3 mission safely landing on an unexplored part of the Moon and New Delhi playing host to the G20 summit in September, there is a real sense of optimism about the future for India. We spoke to experts in the Business School, as well as two alumni panelists for the upcoming events, about the challenges and opportunities for the coming years in the country. “With the third generation of e-entrepreneurs already marking their footprints, much of India is swarming with unbridled optimism for transformative change in every major walk of life. After demonstrating to the world her capabilities in maintaining, managing, and plumbing the digital infrastructure of the West, the country is now ready to embark on a highly ambitious plan to spread this acquired knowledge over three decades for the betterment of her more than one billion souls. This game-changing plan is the on-going task of a mammoth public and private enterprise. Known as The India Stack, the project stands on three pillars: Data, Identity, and payments. The mission digitally connects these three markers of millions with seamless portability between operable interfaces, which has enabled tens of millions of Indians to connect and communicate daily in areas of health, banking, education, and many other spheres. The final result of this Herculean project already shows up in numbers. Thanks to instantaneous digital access, the percentage of Indian bank accounts increased from 18% in 2008 to 81% in 2023. While this is a commendable achievement made possible by the tireless efforts of young e-entrepreneurs working with the State in their private capacity, other stiff challenges surface in developing similar institutions in primary and secondary education, health, and literacy to overhaul the system to ensure the inclusiveness for many more.” \"Empowering women entrepreneurs is a big challenge for India in the next 25 years. Despite rapid economic growth in the past few decades, the relative gender gap in entrepreneurial activity in India of 30% is one of the lowest in the world. Besides low levels of enterprise skills training, some of the reasons for marginalisation of rural women include lack of access to finance, lack of mobility and social norms that confine women to their familial responsibilities. Women are often engaged in low productive sectors such as agriculture or informal cottage industry, and most women owned businesses are microenterprises. However, there are several successful social enterprises in India that aim to empower rural women by providing them with self-employment opportunities in sectors ranging from agriculture, affordable energy, and handicrafts. For instance, women account for 55% of the 580,000 livelihoods created by Aavishkaar Capital, a social venture capitalist in India. Rangsutra Crafts India, a handicraft based social enterprise that is owned by over 2000 artisans (of which over 70% are women) from remote communities in India from Rajasthan, Uttar Pradesh, Maharashtra, Chhattisgarh, Manipur and Kashmir. Thus, social entrepreneurship provides a means to contribute to sustainable economic development and creating positive social change that empowers more rural women to engage in entrepreneurial initiatives.\" Soumya Gupta studied Industrial and Organisational Psychology at the Business School before setting up her own Organisational Psychology firm in New Delhi, FriendsSquare. Drawing on her expertise gained in Nottingham, she diagnoses complex problems and designs effective interventions that improve individual and team performance, job satisfaction, and overall organisational success. She will be a part of the event at the British Embassy in New Delhi on Thursday 23 November. \"I foresee India emerging as a Global Growth Engine over the next 25 years, particularly in sectors such as education, healthcare, technology, and manufacturing. The nation's stable government, dedicated to implementing sustainable policy measures, is poised to facilitate robust growth, job creation, and an elevation in living standards. India's economic foundation rests on a consumption-driven model - the intrinsic drivers of its growth are self-sustaining, propelled by increasing demand, burgeoning aspirations, a growing middle class, rapid urbanisation, and a flourishing spirit of entrepreneurship. There is substantial untapped potential in financial services, signifying a vast avenue for growth. However, in the face of swiftly evolving workplace dynamics and the integration of a hybrid cultural landscape, one of the primary challenges anticipated for India over the next 25 years lies in navigating the intricacies of managing a multi-generational workforce and addressing associated generational differences. As workplace structures transform, the diversity of age groups within organisations becomes increasingly pronounced. Effectively managing the expectations, motivations, and work styles of different generations poses a nuanced challenge that demands thoughtful consideration. Bridging generational gaps is integral not only for harmonious collaboration but also for harnessing the unique strengths each generation brings to the table. That is why, to bridge this gap, my company focuses on addressing these challenges with a holistic and humanistic perspective. Through FriendsSquare, one can navigate the complexities of managing a diverse, multi-generational workforce while fostering a workplace culture that inspires purpose and engagement.\" Nottingham alumna Medha Tadpatrikar is a panelist for the Mumbai event. After studying her MBA at Nottingham, she went on to found Rudra Environmental Solutions, tackling the issue of plastic waste India. Medha pioneered the Thermo Catalytic Depolymerization Process, which converts thin and traditionally non-recyclable end of life plastic into usable liquid fuel. She has been named one of the Top 30 Women Transforming India, and has helped collect more than 3.6 million kg of plastic waste in the country. “I loved Nottingham - the atmosphere in the University and the help I received from my teachers and support staff, which helped me become more confident. My MBA gave me a different outlook on life and paved the way for my career in environmental solutions. “India is one of the fastest growing economies in the world and with the rapid growth of urbanisation, the waste management and infrastructure sectors will need to continue to expand to keep pace with the growth of the country. Though India faces many challenges – such as lack of healthcare and sanitation infrastructure, water scarcity, and gender inequality - our under 30 population, which is highly educated, will be one of the reasons India will do well in the next 25 years.” Register your free place at one of our upcoming Second Quarter Century events: 23 November - New Delhi 25 November - Mumbai 29 November - Hong Kong 17 December - Shanghai Details for Nottingham, London, Malaysia, New York and Lagos events in 2024 will be announced in the coming months. This article originally appeared in the Connect Business newsletter. Subscribe today to get the latest updates from our leading Business School every quarter. We speak to Dan Warne (History, 2007) for his unique insight into establishing a business during a pandemic. The former Managing Director at Deliveroo left in late 2019 to establish his own start up in the hospitality sector. As we mark 25 years of Nottingham University Business School, join us this academic year to look ahead to the next quarter century in business. From India to China, Lagos to London, we've been celebrating 25 years of the Business School with our international alumni community. Managing Director of renowned advertising agency adam&eveDDB, James Rowe (Geography, 2009) shares the secrets of Christmas TV adverts!"
        }
    ],
    "pdf_files": []
}