{
    "url": "https://www.nottingham.ac.uk/alumni/ocean-life-1",
    "content": [
        {
            "p": "Discovering a passion for wildlife from long days spent exploring Hong Kong’s nature reserves and reservoirs as a child, Dr Andy Cornish (Zoology, 1992) has focused dedicated his recent career in international marine conservation to saving critically endangered populations of sharks worldwide. Today, Andy leads WWF’s Global Shark and Ray Conservation Programme, and is committed to protecting these ancient ocean species from extinction. His interest in conservation, and in particular sharks and rays, was first sparked on a post-Nottingham backpacking adventure. “After completing my degree, I went backpacking in Central America for three months with a friend,” recalls Andy. “We learned to scuba dive in the world-famous Bay Islands in Honduras, which is when I first saw and became fascinated with sharks. The qualification later made me eligible for a PhD at a university in Hong Kong, studying reef fishes. It was quickly evident that overfishing had removed all of the big fish – and that sharks were almost totally gone from the ecosystem – which was when my interest shifted to conservation.” Despite popular misconceptions about their reputation – more people die every year from taking selfies than shark attacks, says Andy – sharks and rays are indispensable to ensuring the health of the ocean ecosystem. From coral reef lagoons to the depths of the high seas, the ecological roles sharks and rays play are diverse, from helping to buffer climate change and supporting marine food systems, to engineering micro-habitats for other marine creatures. “Widespread overfishing resulting in the ongoing loss of sharks and rays is akin to playing a risky game of Jenga,” says Andy. “Future removals may trigger ecosystem collapses, with disastrous consequences. Sharks and rays are in crisis, around 37% of more than 1,100 species are threatened with extinction. We urgently need to reduce overfishing in the coming decade or a swathe of species will likely disappear forever, which would be a huge loss for our oceans and humankind.” Through his work at WWF, Andy is playing a key role in advocating for change both regionally and internationally, and uniting a wide range of partners to work together to find solutions – something which his Nottingham degree helped inspire. “My degree was undoubtedly the foundation that my career has been built on,” reflects Andy, “from the scientific underpinning to confirming my enthusiasm for working in the field. My role at WWF is multi-dimensional, requiring everything from representing my organisation when speaking with governments, business and the media, to fundraising, and providing scientific advice. The most important skills are probably strategic planning to advocate for better management of sharks and rays at national and international levels, and soft skills to encourage others within my large organisation to work more effectively together to conserve these ancient predators.” While serious risks to sharks and rays persist, and the battle to conserve them is far from over, the solutions to save them do exist and there is hope that we can restore the balance. “The shark conservation movement is definitely growing and there are an increasing number of successes,” says Andy. “The biggest programme that I’ve been working on in recent years is the Shark and Ray Recovery Initiative (SARRI), a collaborative effort between several organisations and some of the best experts in the business to scale-up efforts to recover some of the most threatened species, in some of their last remaining refuges. The good news is that most of the solutions are known and we now need to work together to get the solutions in place.” Words: Faye Haslam (History, 2012) We speak to the MBA alumna who recently became the first woman to hold the top job at the African bank Through his beautifully intricate hand-drawn maps, Taiwan-based artist Tom Rook (Geography, 2010) offers a unique perspective on our urban environments. With a new series hitting TV screens over the summer, what better time to catch up with explorer, writer and photographer Levison Wood (History, 2004)? Steve Cliffe (Electrical Engineering, 1985) explains how his career has helped advance the advent of touchless technologies."
        }
    ],
    "pdf_files": []
}