{
    "url": "https://www.nottingham.ac.uk/alumni/support-us/support-us/support-cascade.aspx",
    "content": [
        {
            "p": "You can help our students excel outside the classroom. Nottingham students have inspirational and potentially world-changing ideas to help communities at home and around the globe. You can be the catalyst that makes their fledging projects a reality through our Cascade grants programme. From treating the pets of local homeless people to bringing clean water to communities in Borneo, your support can help our students gain valuable skills outside the classroom. Make a donation and help Nottingham students change lives in worlds beyond their own. Projects typically fall into one of three categories: Volunteering or outreach work benefiting local or global communities Enabling Students’ Union societies to provide life-changing experiences for Nottingham students Allowing students to undertake work which adds significant value to their academic experience Through Cascade, Nottingham students develop their skills, social awareness and employability while making a significant impact on communities at home and around the world. Nottingham students can apply to Cascade for a grant to deliver projects that develop their skills and benefit local and international communities. Every penny you give will go directly towards turning great ideas into reality, allowing students to develop their skills and make a positive social impact on local and international communities. Donate to Cascade I decided to study architecture because I believe the built environment can make a real difference to people’s lives. Seeing the project through from beginning to end has been so rewarding - meeting the children is a memory that will stay with me for a long time. Thank you to everyone who supported our project. Your gifts will not only help the school children of Lephapane now, but future generations of children will grow up in the school you’ve helped us to build. This project is just the beginning for them. Rachel Levy, architecture student, who helped build a new nursery for the community in Lephepane, South Africa. Your belief and backing gives Nottingham students the chance to use their skills to tackle issues affecting commmunities in need. Support a student project today"
        }
    ],
    "pdf_files": []
}