{
    "url": "https://www.nottingham.ac.uk/alumni/infinity-fintech-hub",
    "content": [
        {
            "p": "The University of Nottingham’s Centre for Inclusive Financial Technology (INFINITY) has been awarded a new £1.4 million grant from Research England to develop a fintech hub in the heart of the city. Situated on the university’s new Castle Meadow Campus, the INFINITY hub will be located alongside Nottingham University Business School and leading businesses in the financial sector, including KPMG, who are relocating their Nottingham office to the new campus in the city centre. Nottingham is fast establishing itself as a thriving centre for financial services, with Experian, Capital One, KPMG, Equifax and Blenheim Chalcot all having a strong presence in the city. The new hub will contribute to the sector’s growth by supporting the commercialisation of fintech research. “This initiative is set to revolutionise the financial technology landscape in the East Midlands”, said Professor Meryem Duygun. “It's an incredible opportunity to leverage our research and expertise to drive innovation, and create a vibrant ecosystem for collaboration between students, academics, and local businesses.” Founded in 2022 by Professor Duygun, INFINITY collaborates with industry, policymakers and the third sector to undertake research that seeks to harness the power of financial technologies to promote inclusive innovation and culture. Bringing together an existing ecosystem of three leading Midlands universities with Fintech expertise – Nottingham, Warwick and Birmingham – the Hub will contribute to developing the next generation of fintech start-ups and firms in the area, and address the challenges faced by start-up and scale-up ventures in UK universities to realise the full potential of financial technology research. It hopes to create a pathway for university-inspired research to give rise to early-stage commercialisation ventures in financial services, as well as providing training and support for academics at an early stage in the commercialisation journey, overcoming the barriers to engagement. While the initial grant will serve to support university researchers, future funding will look to support longer-term activities, increasing the capacity to work with students and alumni. “This grant is not just about funding; it's about building a dynamic environment where creativity and innovation thrive. We are committed to supporting academics in their journey to bring research-inspired ideas to life and create the next generation of financial services.” “We look forward to working closely with our partners and the broader community to make this vision a reality and usher in a new era of fintech innovation in Nottingham. Together, we can shape the future of finance.” If you want to learn more about inclusive fintech, or are interested in collaborating with the Hub, get in touch via the INFINITY website. As part of our spring focus on digital technologies in Connect: Business we speak to Tatenda Furusa (MSc Business and Management, 2017). A brand new eight-week programme led by NUBS experts gives you the chance to unleash the full potential of every member of staff in your organisation. Phoenix Zhang (MBA 2016) has spent over two decades driving change in corporate social responsibility (CSR) and sustainability. As the Founder and Managing Director of CSR Solutions Limited, a social enterprise based in Shenzhen, her mission has been to create fairer, more ethical business environments around the world. Networking can feel a bit daunting at times, but it’s one of the best ways to uncover hidden job opportunities and grow your career. In this article, our resident careers expert Sue Mason shares ten simple yet powerful tips to help you network like a pro."
        }
    ],
    "pdf_files": []
}