{
    "url": "https://www.nottingham.ac.uk/alumni/my-office-levison-wood",
    "content": [
        {
            "p": "In our My Office series, we take you behind-the-scenes to explore the working spaces of alumni around the world to give you the inside view into what careers are really like – and hopefully provide some inspiration along the way! We meet Levison Wood (History, 2004), best-selling travel writer, explorer and photographer, to find out about the ‘best job in the world’. Name: Levison Wood Job: Travel writer, explorer and photographer Office: Wherever my feet take me! Hi Levison! Can you tell us a little about how you started your career in travel? “I graduated from Nottingham in 2004, having studied history, with my dissertation on the Grand Tour and travel writing, which was appropriate. I decided that I wanted to go on my own Grand Tour when I graduated, so I hitchhiked from Nottingham to India and then travelled through Europe, Russia, Afghanistan, Iran, lots of places. That kind of set the tone for me to learn about the world. I then joined the army, I went to Sandhurst in 2005, and spent five years in the parachute regiment where I served in Afghanistan in 2008. I left the army in 2010, and then volunteered for a charity in Africa for 12 months where I drove ambulances from Nottingham down to Malawi. That inspired me to not get a normal job, so I used my skills from the army and decided to combine my passions of writing and photography to start a career in travel writing. “I set up an expedition company, taking people to remote parts of the world, and used that as a platform to do travel writing and photography. I always wanted to write a book, but it’s obviously difficult to get into, so I knew I needed to do something that was unique and unusual. That led me on to Walking the Nile in 2013, which I wrote a book about, my first published book, and filmed for a Channel 4 series, which also launched my film career. Since then, I’ve published eight books and made six TV series (including Nile) about my long-distance expeditions; Walking the Himalayas, Walking the Americas, From Russia to Iran, Arabia and most recently Walking with Elephants in Botswana.” What is your job now and where’s your ‘office’? “I suppose my office is wherever my feet take me really! Obviously, it’s been limited this year because of coronavirus, but I’ve still got lots of ideas. I’m doing a lot of writing, I’ve just had a photography book published, Encounters, I’ve got another two books on the way and I’m working on my first novel. This year, as I’ve been focusing on my writing and photography, my office has been in my library at home.” Was there one career-defining moment which enabled you to pursue your career? “It probably goes back to my history degree at Nottingham! When I first started the course, I was very interested in military and political history, and that’s what most of my modules were on. It was Professor Ross Balzaretti who convinced me to do a social history module on the Grand Tour, it was called ‘English Travellers in Rome in the 18th Century’. That really changed my perspective because it was such a fascinating topic. It’s when I really got interested in travel writing, and it kind of set me on the trajectory I’m on now because it encouraged me to read other people’s diaries and inspired me to want to do my own Grand Tour.” What would you say are the key characteristics of someone who does your job? “You’ve got to be curious, of course. You’ve got to be adaptable, as there is no such thing as a routine in my job. You’ve also got to be quite resilient, because there’s a lot of rejection when you’re pitching ideas, particularly in the first few years. I spent three years being told no, and I got my book turned down by dozens, if not hundreds, of publishers. You’ve got to not take no for an answer, and ensure you’re doing it because you love it, you can’t be in it for anything else than really enjoying it. You’ve got to hope for the best that it will come good, and I was very lucky that it did.” How would your colleagues describe you? “Probably quite dogged and pig-headed. I’m determined and tenacious, whenever I say I’m going to do something I always follow through.” What’s the one thing about your office which you most love or hate? “I most love the fact that I can work from anywhere. I do have my physical office here at home, but it’s only really this year that I’ve spent any time in it. In the last seven years, my office has always been wherever the wind has taken me. I take my laptop, and I’ve written books from pubs, cafes, beaches, hotels all around the world, and that’s the beauty of it. That is the privilege of this job, I can do it anywhere I want to. “There’s nothing that I don’t like about my ‘office’. I’ve got nothing to complain about, I’ve got the best job in the world.” And is there anything you could not live without in your office? “I take my camera everywhere. I’m lucky to be an ambassador for Leica so I’ve got a very nice camera that comes with me everywhere. It’s how I document my trips, it’s through my photos that I remember what I’ve done, and that helps me when I’m writing. I do keep a journal, but it’s just bullet points really. It’s the photographs that bring it to life, so that’s what I take with me on my journeys and it’s what reminds me of what people look like, what places are like and where I was.” What’s been the best moment working in your office? “I don’t have one standout moment, but if I was to choose one particular trip that was very formative and memorable, it would be back in 2010 when I’d just left the army and was trying to figure out how to make the dream of becoming a travel writer a reality. I volunteered for a charity, and basically orchestrated this project where I ended up buying two land cruisers off eBay, turned them into ambulances and then drove them with a bunch of my best mates through 27 countries, 10,000 miles to Malawi. It was just the most amazing roadtrip. I told all of my friends, ‘whatever you are doing, wherever you are in life, just drop it for the next two months and come on the best roadtrip of your life’. To my astonishment, 15 of them did! It was such good fun, and that really helped me to decide that was what I wanted to do with my life.” And the toughest? “The toughest day at the office was when journalist Matthew Power died on my Nile journey. Back in March 2014, Matt flew to Uganda and came to write about my Nile journey, but he died on the journey from heat exhaustion. I tried to rescue him, but he sadly passed away. That was a really tough day.” Do you have one piece of advice for someone who wants to work in an office like yours? “You’ve got to be prepared to make sacrifices, it’s not a normal job. You have to be prepared to live out of a bag for many years, to sacrifice any stability and therefore relationships at home, it isn’t the sort of job where you can have a stable life at home. So you’ve got to be prepared to be in it for the long haul, do what it takes and be on the road for a long time. I’ve been travelling, in one way or another, since I graduated from University in 2004. It’s amazing, but it’s got its ups and downs.” Your photography book, Encounters, has just been published. What inspired you to release a photography book and has it been a different experience to work on than your other books? “It’s been very different. Most of my books have been about journeys that I’ve undertaken, whereas this is a compilation of the past 10, 15 years. I’ve always been passionate about photography, but it’s mainly been there in the sidelines as more of a hobby really. This is a book I’m very proud of because it’s given me an opportunity to go through and select about 150 images from somewhere in the region of 50,000. It was a tough job to choose those images and curate the book, but it’s been really rewarding to see all of my images in one place.” How have the travel restrictions in place this year due to the pandemic affected your work? “It’s been a very strange year! This has been the longest time I’ve spent in one place for my entire adult life really, which is very weird. Working on my photography book has helped because it’s given me an excuse to go through all of those images and concentrate on a project. I’ve been working on my novel too, which hopefully I’ll get done by the end of the year, it’s travel-focused but fiction. And I got a dog, which has got me out of the house and doing long walks! And finally, how do you take your tea? “Earl Grey, dash of milk and no sugar.” Levison's latest book Encounters: A Photographic Journey is available to buy now, and you can catch his latest TV series Walking with Elephants on Channel 4 On Demand. Learn how to improve your resilience by reimagining failure with insight from our latest Live talk speaker Alexander McLean (Law, 2007). Networking can feel a bit daunting at times, but it’s one of the best ways to uncover hidden job opportunities and grow your career. In this article, our resident careers expert Sue Mason shares ten simple yet powerful tips to help you network like a pro. There comes a point in any job when you feel ready for the next challenge. So how can you take action to ensure progression? Our resident jobs expert Sue Mason, from the NUBS Postgraduate Careers team, shares her advice with five steps you can take to advance your career. Find out how to boost your career confidence from our expert Julie Littlewood (Biomedical Sciences, 1999)."
        }
    ],
    "pdf_files": []
}