{
    "url": "https://www.nottingham.ac.uk/alumni/why-im-leaving-a-gift-in-my-will-to-nottingham",
    "content": [
        {
            "p": "To ensure future generations can unlock their potential, Jacky Hughes (Industrial Economics, 1965) has pledged to leave a gift in her will to Nottingham. Her support will give talented students the same life-changing opportunities she had at university and help them overcome financial hurdles. Since the age of 12, Jacky knew that she wanted to attend university, having decided that higher education was her way out of a narrow lifestyle and she was determined to achieve her aim. “I think only 1% of women went to university when I was younger, so it was very special to be one of those women,” explained Jacky. “Two of us from the same school wanted to come to Nottingham to read Industrial Economics and we didn’t think both of us would be accepted. Thankfully though, Don Varley, the admissions tutor, was keen to offer places to people he thought would make a contribution to Nottingham life, as well as those who he believed would be academically successful. So we were both accepted.” With her dream of studying at university achieved, Jacky threw herself into Nottingham life; playing tennis, becoming president of the Junior Common Room in Florence Boot and serving on University Council. She fondly remembered organising and enjoying the ‘After Eight Ball’ in Florence Boot at the end of her term of office and speaking to successfully propose the next President of the Nottingham Union of Students. “I am enormously proud of realising my dream to come to Nottingham. I was the first in my family to go to university which made it even more special,” added Jacky. “It was such a formative experience. Not just the studying, although that was fascinating, but all the friendships and connections that I made here. It has been the foundation for a really fulfilling life and career.” While at Nottingham it was a £50 grant (equivalent to around £1,000 now) from the Elizabeth and J.D. Marsden fund that gave Jacky the foundations on which to build a 40-year career in human resources, coaching and leadership development. Thanks to the fund, Jacky was able to travel to Australia with the English-Speaking Union and had two months working in human resources roles, valuable experience for finding a job on her return. Having receiving this support, Jacky knows the difference gifts from alumni can make to current students. “I've given quite a lot over the years, always to help students who probably couldn't afford to come under their own steam. I'm so grateful for all the openings Nottingham gave me that I want to help others to benefit in the same way.” With that mind, Jacky has pledged to leave a gift in her will to help those students who, like her, want to broaden their horizons at Nottingham and to build firm foundations for their futures. “I’ve chosen to give to student scholarships because university experience was so transformational in my life and opened the door to many amazing opportunities. I want as many people as possible to enjoy similar possibilities, even if they haven't got the funds to do so.” Did you know you can write your will for free? The University of Nottingham is delighted to be able to offer you a free will writing service, with our partner Octopus Legacy. You can make your will online today, over the phone or in person for free. Find out more. Thanks to your donations to Cascade, University of Nottingham students are experiencing a global view of education and making a difference to others along the way. When Dr Cormac O’Shea applied for a Cascade grant to buy and house a flock of hens, nobody quite eggs-pected what a fantastic impact it would have. Thank you for supporting the University of Nottingham in 2024 and helping to change lives. Miss Berry's generous donation to the Department of Music will help to inspire the next generation of musicians."
        }
    ],
    "pdf_files": []
}