{
    "url": "https://www.nottingham.ac.uk/alumni/september-take-five",
    "content": [
        {
            "p": "If you're old enough to have seen the Broadmarsh in its prime then you'll be in for a surprise this month as we reveal the new 'Green Heart' which has taken its place in the footprint of the former shopping centre. We also have news about Nottingham's place in the latest Times and Sunday Times University Guide, your annual reminder about the Goose Fair and a celebration of Paralympic success. Yes, Broad Marsh and not Broadmarsh - the area which was once home to one of the city's two shopping centres has undergone the first stage of its reimagination in 2024. Nottingham city council opened a new green space, known as the 'Green Heart', which gives visitors to the city centre a new place to relax and enjoy nature. This is part of the wider regeneration of the southern part of the city centre, which includes the new Broad Marsh car park and shiny, new Central Library. We also heard in December that the council has been awarded £3.4m to finish demolition of the remaining Broadmarsh shopping centre structure - watch this space for further developments! Find out more > Photo credit: Nottingham City Council The 2024 Paralympics have recently concluded after twelve days of engrossing competition. The action from Paris has seen a number of notable moments for university alumni and former students. Not to be satisfied with just the one medal, our own Sophie Unwin, above left, (Classical Civilisation, 2015) rode her way to an incredible four medals with her pilot Jenny Holl across the paracycling; two golds, one silver and one bronze. Joining Sophie in Paralympic success were University of Nottingham Ningbo campus graduate Zhao Shuai, representing China in his fourth games and former University of Nottingham student and shooting para-athlete Tim Jeffery above right. Competing in both the men’s and mixed doubles, Shuai and his partner Mao Jingdian made history as they were crowned the first-ever mixed doubles Paralympic champions after winning an all Chinese class 17 final. He also claimed a bronze medal the same day alongside partner Lian Hao in the class 18 men’s doubles, before rounding out his incredible Paris campaign by completing the achievement of standing on every step of the podium by adding silver after facing Ukrainian Viktor Didukh in the class 8 men’s singles final. Jeffery entered the Mixed 50m Rifle Prone SH2 on 4 September and shot a total of 227.8 to claim bronze - his first ever Paralympic medal at the third attempt, having competed in the Rio and Tokyo games. One of the most rewarding opportunities you can get involved in as a university graduate is mentoring a current student; giving them the chance to benefit from your experience, insight and networks. Here at Nottingham, we're excited to let you know about 'Future Ready', which is our new and improved career mentoring programme. It supports students from underrepresented backgrounds in particular, helping them boost and build their confidence to allow them to develop their career path. The programme is open for registration until Sunday 20 October. Find out more and apply > The University of Nottingham continues to make strides in collaborative work with industry professionals and the public sector, demonstrated in this year’s Knowledge Exchange Framework (KEF) rankings. Conducted by Research England, KEF provides an overview of the knowledge exchange activities and performance of English universities, across seven broad perspectives including public engagement and local growth. This year’s results show the University of Nottingham is outshining its Russell Group peers in four of the seven areas: ‘Local Growth and Regeneration’, ‘Public and Community Engagement’, ‘Working with Business’ and ‘Working with the public and third sector’. Nottingham increased the levels of relative income across the board by a total of £5.7m and improved position within the Russell Group ranking in a number of areas, most notably collaborative research, regeneration revenue, regeneration capital and facilities and equipment. It's that time of year again, the Goose Fair is underway at the Forest Rec until Sunday 6 October. If you're still local, or just fancy a trip back to Nottingham for the day you can enjoy 350 rides and attractions, and the traditional fairground food favourites like mushy peas and 'Cocks-on-Sticks' (yes they are really a thing). Goose Fair is one of the largest travelling funfairs in Europe and has been staged annually in Nottingham since at least 1284. Find out more > Photo credit: Tracey Whitefoot Photography Equality, Diversity and Inclusion (EDI) can be a term misunderstood by many, but it is integral to the university's effective functioning, both for staff and students alike. It's also where alumni who are willing to share their lived experiences can play a valuable role too A new collaboration between the University of Nottingham and Nottingham’s home-grown fashion designer Paul Smith, is set to capitalise on the international reputation of both organisations to fly the flag for the city overseas. We were delighted to welcome Caucher Birkar (Mathematics PhD, 2004) back to campus this winter to award him a richly deserved honorary degree. Graduates from the University of Nottingham continue to be among the most sought-after by the UK’s top employers, a new study has found."
        }
    ],
    "pdf_files": []
}