{
    "url": "https://www.nottingham.ac.uk/alumni/double-your-price-with-prof-david-falzani",
    "content": [
        {
            "p": "David Falzani, Professor of Practice at Nottingham University Business School, was recently awarded the Sales and Marketing Business Book Award 2024 for his book ‘Double Your Price: The Strategy and Tactics of Smart Pricing’ at the Business Book Awards 2024. Drawing from his award-winning book, he shares his top tips for avoiding the #1 mistake businesses make when it comes to pricing. Pricing can make or break a business, especially for entrepreneurial enterprises. One of the most frequent, and damaging, mistakes companies make is under-pricing their products or services. While low prices might seem like a way to attract more customers, it can hurt your profitability and hold your business back from investing in long-term growth. Here are five top tips to help you avoid this costly pricing mistake: The most common reason companies underprice is a lack of confidence in their value proposition. Your value proposition is what makes your product or service stand out and why customers should pay for it. To avoid under-pricing, clearly define what sets you apart - whether it’s superior quality, personalized service, or unique features. If you don’t believe in the value you offer, customers won’t either. Under-pricing often attracts price-sensitive customers who are less loyal and harder to satisfy. These \"bottom feeders\" are constantly looking for the cheapest deal and are quick to leave when a better offer comes along. Instead of catering to them, focus on attracting premium customers who appreciate the value you provide and are willing to pay for it. One of the biggest pricing errors companies make is setting prices once and never revisiting them. Your business costs, market conditions, and customer preferences evolve, and so should your pricing. Make it a habit to review your prices regularly – I suggest it’s a standing agenda item at board meetings. Or, more frequently if you’re in a fast-moving market. Regular adjustments ensure you stay profitable and competitive. If you’re unsure how customers will react to a price increase, test it first. Run small safe market experiments by raising prices for a specific product or in a particular region. These low-risk tests help you gauge customer response and fine-tune your pricing strategy. Many companies are surprised to find that a modest price hike has little impact on sales volume but boosts profits significantly. Don’t fall into the trap of thinking that lower prices will guarantee more business. Competing on price alone is a race to the bottom. Instead, focus on providing superior value and service, and position your business as a premium provider in your industry. Customers are willing to pay more when they see the value you offer. By following these tips, you can avoid the trap of under-pricing, protect your profit margins, and position your business for long-term growth and success. Professor David Falzani MBE has trained over 2,000 growth companies, leveraging his experiences as an entrepreneur, business consultant and Professor at Nottingham University Business School. His book, “Double Your Price: The Strategy and Tactics of Smart Pricing”, won the 2024 Business Book Awards, Sales and Marketing category. Nottingham’s career placements programme gives aspiring graduates the opportunity to gain valuable experience in the workplace. Mike Popesku (Marketing, 2008) took his 'passion for unravelling the chaos and complexity of consumer behaviour' to its logical conclusion by establishing his own startup, Qudo, in 2020. He shares his insights into AI and data-driven marketing. We’re here to glean the top tips from a man who has seen it all, done it all, sold the t-shirt. Michael Skok (Production Management and Production Engineering, 1982) shares his insights, gained over 40 years as an entrepreneur. Learn how an entrepreneurial mindset can lead to better outcomes, potentially greater profitability and more rewarding workplace relationships."
        }
    ],
    "pdf_files": []
}