{
    "url": "https://www.nottingham.ac.uk/alumni/my-office-dana-hamzah",
    "content": [
        {
            "p": "In our My Office series, we explore the working spaces of alumni around the world to give you the inside view into what careers are really like – and hopefully provide some inspiration along the way. In our latest interview Dana Hamzah (Industrial Economics and Insurance, 2008) gives us an insight into what it's like working for the International Monetary Fund (IMF) in Washington DC - one of the most high profile organisations in the world! Name: Dana Hamzah Job: Advisor to the Executive Director representing the Arab States and the Maldives Office: International Monetary Fund, Washington DC Hi Dana! Can you tell us a little about how you began your career journey? I am the holder of a MSc in Finance and Economic Policy from SOAS, the University of London and a BA in Industrial Economics with Insurance from the University of Nottingham. I started off my career as a Risk Officer at an Islamic Retail/Investment Bank in Bahrain and then moved to the Financial Stability Directorate at the Central Bank of Bahrain. What is your job now and where’s your ‘office’? I currently work at the International Monetary Fund (IMF) in Washington DC as an Advisor to the Executive Director representing the Arab States and the Maldives at the IMF’s Executive Board. Before joining the IMF, I was the Head of Economic Research at the Central Bank of Bahrain. Was there one career-defining moment which enabled you to pursue your career? Working in the field of international development has always been my dream ever since I was in high school. I knew that someday I would like to be working at the IMF and was constantly trying to achieve this goal one step at a time, starting with a strong educational degree and educational background. Starting off my career at a challenging time during the height of the Global Financial Crisis in 2008 also made me more aware of the vulnerabilities and challenges facing the global economy and the importance of addressing financial stability gaps. Therefore, my educational background in economics and my work experience in the banking sector gave me the right mix when I joined the Central Bank of Bahrain’s Financial Stability Directorate in 2013. In 2014, I decided to do my Master’s in Finance and Economic Policy from SOAS, the University of London and in 2016 I was selected to take part in the Hubert Humphrey Fellowship Program funded by the US Department of State representing Bahrain as an outstanding mid-career professional in the field of Finance, Banking and Economic Development. During the Fellowship year, I worked at the Michigan Department of Treasury in Lansing, MI and at the IMF in Washington, DC. This was one of the highlights of my career which helped me further fulfil my passion for international development and reach where I am today. What would you say are the key character traits of someone who does your job? In my opinion, working in this field requires you to be passionate about international development and have strong leadership and communication skills. You should be able to strike the right balance between having strong technical skills and being able to see the bigger picture. How would your colleagues describe you? My colleagues tell me that I always see the positive side in every situation and take up challenges with a smile on my face! What’s the one thing about your office which you most love or hate? I love that the IMF is a melting pot of people from different cultures and backgrounds. This diversity gives us the opportunity to learn more about country related issues and reminds us that we live in an interconnected world. Do you have one piece of advice for someone who wants to work in an office like yours? My advice is to keep investing in yourself and in your education, this is a constant curve that will help prepare you in every step of your career. And finally, how do you take your tea? Earl Grey with steamed milk on the side 😊 If you have an unusual or interesting office we would love to hear about it. Drop us an email to tell us more. Dana Hamzah For our first Questions for leaders topic, you asked us to line up alumni leaders from the creative, finance, technology and entrepreneurship sectors, happy to answer your questions on Progressing your career. In the past, many people would choose a career and stay with it until retirement. These days, however, it is much more common to change direction one or more times. Our resident Careers expert, Sue Mason, provides us with some expert advice on securing the next move in your career Active professional networking is vital to career growth and having an online presence is seen as essential now at whatever stage you are in your career journey. Almost 1,000 of you generously shared your time and expertise as volunteers over the last academic year. We're celebrating this Volunteers' Week – and see some of our upcoming opportunities."
        }
    ],
    "pdf_files": []
}