{
    "url": "https://www.nottingham.ac.uk/alumni/times-rankings-2024",
    "content": [
        {
            "p": "The Times and Sunday Times Good University Guide 2025 has been published and we're delighted to share the news that over 20 of our degree courses have been recognised in the Top 10 in the UK! The 24 UK Top 10 ranked subjects are: Nottingham has also risen two places in the overall league table and associated guide, which provides prospective students and their families with essential information for making informed higher education choices, evaluating aspects from teaching quality and student experience to degree completion rates and graduate employment prospects. In its graduate outcomes analysis, Nottingham secures a top 20 result, based on 83.3 per cent being in highly skilled jobs or further study within 15 months, and is ranked 22nd for research quality based on the latest Research Excellence Framework (REF 2021) and its strong reputation in research areas such as MRI and its work to establish a new £29.1 million national facility housing the UK’s most powerful MRI scanner which will give researchers and doctors unprecedented insights into brain function. From pioneering research to outstanding student experience, we're proud to offer world-class education across a wide range of disciplines. A fully searchable website with 70 subject tables, full interactive tables and additional features is now online. For 35 years we have been teaching our MBAs cutting-edge business knowledge and contemporary management skills. Thousands of you across our global community answered, sharing your thoughts about what you would like your alumni community to offer you. Catch up with the best of the news from your university, the alumni community and Nottingham during the course of 2024. This year marks the 50th anniversary of the opening of the university's Arts and Social Sciences library, Hallward. Find out more about its history and enter our competition!"
        }
    ],
    "pdf_files": []
}