{
    "url": "https://www.nottingham.ac.uk/alumni/support-us/volunteer/volunteer-awards.aspx",
    "content": [
        {
            "p": "Our awards celebrate volunteers who have made outstanding contributions to the university and its community, showing exceptional dedication, creativity, innovation or leadership. Our annual Volunteer Awards, which we first celebrated in 2016, recognise volunteers from across our campuses in the UK, China and Malaysia. The awards celebrate people who have made outstanding contributions to the university and its community, showing exceptional dedication, creativity, innovation or leadership. Julia has been a huge advocate for the university, volunteering on 'Where are they Now' panels, as a member of the Industrial Advisory Board for Chemical Engineering, a speaker as part of the Inspiring Women in STEM programme, a speaker as part of Engineer your Future, part of Connect for Success, TEDx speaker and a speaker at Graduation. Julia is an award-winning, chartered engineer with a commitment to driving low-carbon initiatives in the energy sector. She is currently Senior Project Manager at Queequeg Renewables. Julia is a huge advocate for Women in Engineering – both to our student body and within her professional life. She is the founder of FLISS (Female Leaders in STEM Subjects) which operates as a dynamic professional network and charity leveraging mentorship to enhance women's representation in engineering and science. Their goal is to inspire individuals to pursue their aspirations, fostering diversity in workplaces. Peter is a graduate of Nottingham University Business School and has volunteered as a mentor on our Black Industry Connections and Empowerment Programme (BICEP), has been a guest speaker for NUBS as well as supported the Ingenuity Lab. Peter has been incredibly generous with his time inspiring our current students and budding entrepreneurs. This year he will be running a Company Consulting Challenge for Business School MSc students, with his own Fashion business, Kente Master. Peter is an active member of the Ingenuity Lab, the university’s hub which helps students, alumni, and staff to launch and scale their businesses. Peter is an inspiring and passionate volunteer - we are very grateful for his positivity and kindness. Tobi has been instrumental in setting up and leading our Lagos, Nigeria alumni chapter. Tobi has delivered five alumni events, with over 400 alumni attending. Tobi has also consistently supported recruitment activity in Lagos, supporting at recruitment fairs, Chevening events, supporting staff when they are in-country and connecting with prospective students. Our Lagos chapter is the most advanced and engaged chapter and this is down to Tobi's initiative, vision and relationship building skills with her fellow alumni. Tobi has gone above and beyond to support and advocate for the University of Nottingham with both an online presence and in-person. Tobi has also led on our NUBS 25 event in Lagos for March 2024, where more than 100 alumni registered. Tobi secured four high profile alumni speakers, sourced the venue, created marketing material, and rallied alumni to attend. Without Tobi, our alumni presence in Lagos would be nowhere near where it is now. This group is a collection of local women who have been working with staff in our Manuscripts and Special Collections Department to establish a feminist archive for the University of Nottingham. The Feminist Archive (East Midlands) is an important record of the achievements of local women activists who fought to improve the lives of women everywhere. Whilst feminist authors have remained in print and influential in academia especially, the activist originators of social change remain unknown and at risk of being forgotten. Their campaigning, however, improved our society in ways that have been normalised and often taken for granted. In preserving these living histories, future generations are armed with the knowledge of their struggle. Aware that time was running out to collect the life stories of local activists as some were succumbing to age-related ill health, the Group set about recording interviews. They also wanted to find a permanent home for the papers, photographs, and memorabilia collected by the women involved. They then volunteered their time to catalogue the material they collected, researching its context, and explaining its significance. They have advocated on behalf of the collection, holding stalls at events, presenting papers at conferences and to national networks. Manuscripts and Special Collections are indebted to Val Wood, Tina Pamplin, Margaret Davies, Lee Harrison, Barbara Hewitt, Jayne Muir and Linda Shaw - the Nottingham Feminist Archive Group. Julian has been the driving force behind the Old Kingstonian Association, often known as the OKA. The OKA is the alumni organisation for former students of Sutton Bonington Campus – affectionately known by all as “SB”. Now home to the world leading University of Nottingham's School of Biosciences and School of Veterinary Medicine and Science, the campus has seen many changes during its history. The OKA plays a very important role in campus life distributes generous donations from alumni to projects that enhance life for current staff and students at Sutton Bonington. In the past this has included funding for the entertainment marquee, the SB Bake off and assisting the start up of the very popular Sutton Bonington Farmers' Market. Alongside donations, the OKA is an active community – with regular reunions and events. Professor Wiseman was appointed Honorary Treasurer in 1980 and has served in many roles supporting the OKA including Membership Secretary, Reunion Secretary (still active – there are at least two being planned) and AGRIMAG Editor. Julian will be very well-known to SB first-degree, master's and PhD alumni having contributed directly to the education and shaping of our graduates’ futures throughout the last five decades. He really has been the driving force behind the OKA for many years with huge amounts of energy and enthusiasm in ensuring that the network and community continues and has support from the University of Nottingham. Julian’s long-standing editorship of AGRIMAG, in particular, has not only kept alumni up to date with all things “SB” over the years, but he has also personally organised and supported alumni groups of all ages to reunion events, hosting many events to ensure their success. Inspired by our winners? If you're not already a volunteer, why not register your interest to receive our tri-annual email newsletter? Alumni Volunteer of the Year: Keith Burgess (Production Engineering, 1987) International Volunteer of the Year: Surya (Nila) Nilasari (Education, 2020) Community Volunteer of the Year: Patient Cafe Volunteers Alumni Volunteer of the Year: Tobi Ruth Adebekun (French and International Media with Communications, 2014) Highly commended: Erin Connelly (Medieval English, 2008) Community Volunteer of the Year: Marko Voẞ Highly commended: Paul Dunnery (Summer Placement Host), John Birkill (Manager for Phoenix Aspirational Learning) Longstanding Volunteer awards: Abigail Seager • Adebowale Dairo AKA Hakeem • Alastair Perry • Amanda Ferguson • Amanda Riddle • Amanda Howard-Sneyd (Horton Mastin) • Amy Prosser • Anastasia Makeeva • Andrew McNaughton • Anju Okhandiar • Carl Mundy • Carmen B Swanwick-Roa • Charles Pollard • Choong Hiong D Lee • Christopher Yim • Ciara Deall • Corinne Leighton • Craig Coulson • Dale Gilbert • David Clarke • Donna Omovbude • Eleri Davies • Elizabeth Tallett Wavle • Fernando De Barros Smye Frances O'Donnell • Giles Woodhouse • Gordon Lindsay • Graham Kill • Ian Sadler • Imran Rahman-Jones • James Hewlett • Jennifer Evans • Jerome Fielder • Jing Tang • Jingyi Fu • Jo McPhail • Jonathan Hughes • Karen Schrader • Karrish Devan • Keith Bound • Keith Spriggs • Kiri Madhani • Marianna Laviola • Martin Cooper • Martin Wolf • Matthew Lawson • Michael Harriott • Mohamed Hameed Sadurdeen AKA Ismail • Paul Kitchen • Peter Johnstone • Philip Pickard • Robert Clift • Roy Chambers • Rupert Hough • Sameen Barabhuiya • Samuel Uziel Rivero Prado • Sara Holland • Siaka Suma • Stephanie Dizon • Sudipta Mohanty • Thomas Lansdowne • Tim Calderhead • Ursula Edgington Alumni Volunteer of the Year: Michael Olatokun (Law, 2014) Exceptional Contribution Award: Yinka Adegbenle (Industiral Economics, 2001) Individual Community Volunteer of the Year: Paul Corcoran Group Community Volunteer of the Year: PROTECT-CH Trial, Val Leyland and Maureen Godfrey Longstanding Volunteer Award: Volunteer Co-ordinator of the Year (Careers and Employability): Alex Owusu Volunteer Co-ordinator of the Year (Engineering): Vince Pizzoni Alumni Volunteer of the Year: Emily Seto (Clinical Microbiology, 2016) Community Volunteers of the Year Group Award: The Music and Memories Choir Community Volunteer of the Year: Valentine Nkoyo Special Recognition Award: Emily Smith Longstanding Volunteer Awards: Volunteer Co-ordinator of the Year: Martha Jones Alumni Volunteer of the Year: Hugh Jaques (Chemistry, 2000) Exceptional Contribution Award: Lisa Johnson Community Volunteer of the Year: John Charles-Jones UK Alumni Volunteer of the Year: Dr Amy Prosser International Alumni Volunteer of the Year: Jingyi Fu Exceptional Contribution Award: Paul Barrett and Steve Wright – Lifecycle Superheroes Alumni Volunteer of the Year: Mark Bullock Staff Volunteer of the Year: Drew Shearsmith Community Volunteer of the Year: Pam and Mike White Longstanding Volunteer Awards:"
        }
    ],
    "pdf_files": []
}