{
    "url": "https://www.nottingham.ac.uk/alumni/grow-your-workplace-versatility",
    "content": [
        {
            "p": "Many people have had to adapt to new ways of working over the last two years, with the pandemic accelerating the transition to a ‘virtual workplace’. It is said that this has improved the work-life balance for many – but has this come at the cost of a traditional office culture and the ability to build connections between colleagues? In this webinar, our panel explore this topic and discuss how to grow your workplace versatility. Helen Day, Chief Operating Officer at the Digital Workplace Group (Geography, 1990) Helen is responsible for the management and development of Digital Workplace Group (DWG) businesses. She also has overall responsibility for service delivery, team development and core functions. Helen loves working in the flexible digital workplace – mostly from her loft in Nottingham, UK – and liaising with colleagues and DWG clients worldwide. She is a proud member of the well-respected UK Institute of Directors and an active member of the Management Consultancies Association. When not working, Helen spends much of her time experimenting with new technology at home to make life easier or more fun, and learning how to best use all the food her orchard garden produces. Denis Lelin, Senior Audit Officer at Deloitte (Politics and International Relations, 2020) In his time at university Denis was involved in a wide range of societies and volunteering projects which led him onto his current career path. Straight after graduation he spent a year working in the Students’ Union as Activities Officer. Later he joined Unseen UK, a charity supporting survivors of modern slavery and human trafficking, as a community fundraiser, before starting a graduate scheme at Deloitte last December, where he works as Senior Audit Associate. Dr Judith Grant, Freelance workplace wellbeing consultant and coach (Workplace Health and Wellbeing, 2013) Dr Judith Grant has 20 years of experience in public, community and corporate health, working with organisations and individuals to understand both personal and organisational health and wellbeing. Previously held roles include Director of Health and Wellbeing at Mace Group and Head of Health and Wellbeing Royal Mail Group where Judith delivered occupational health and wellbeing programmes at scale. Ben Buckton, Chief Marketing and People Officer at Ampa Working closely with the board, Ben is a key driver for the group’s growth strategy and positive culture - ensuring the right investments are made to develop its people, brands, clients, markets and innovations that unlock potential. Ben previously led marketing strategies at household names such as Axa, UNiDAYS and Experian and is now a leadership fellow at the Society of Leadership Fellows, governor at the University of East London and mentor at the Managing Partners’ Forum. Speakers: Helen Day (Geography, 1990), Denis Lelin (Politics and International Relations, 2020), Dr Judith Grant (Workplace Health and Wellbeing, 2013), Ben Buckton In the digital age, companies need to be prepared for constant change. Read our top 6 tips to stay ahead of the curve. Over his 36-year career, Sir John Sawers (Physics and Philosophy, 1976) held many of the most senior positions in the foreign affairs, diplomatic relations and national security fields, culminating in five years as the Chief of MI6. He explains how he has taken his career in new directions and how he uses his expertise in his roles today. Gain invaluable insights into overcoming imposter syndrome with high performance coach Anna Mosley (Management and French, 2005). Fast-track your career with IJ Samuel's top tips."
        }
    ],
    "pdf_files": []
}