{
    "url": "https://www.nottingham.ac.uk/alumni/jlr-consultancy-competition",
    "content": [
        {
            "p": "For a number of years, the Business School's MSc Consultancy Competition has provided valuable real-world experience for postgraduate students. The challenge pairs businesses at a local and national level with student teams who work intensively over a two to three-week summer period to tackle real business challenges. This year, among those setting challenges for the students was University of Nottingham alumna Hazel Mann (Biochemistry, 2017), Procurement Business Manager at Jaguar Land Rover, who partnered with the Business School this year to present students with a forward-thinking challenge focused on the future of procurement. \"We asked the students to look at what capabilities would be required for Procurement organisations in future, taking into account geopolitics, technology development, trends etc.,\" Hazel explained. \"We also asked them to consider how they would measure these capabilities and provide upskilling for colleagues.\" Hazel and colleagues speaking to students at Jubilee Campus For Hazel, a Biochemistry graduate, participating in the challenge represented an opportunity to give back to her alma mater. \"Nottingham gave me so many opportunities when I was a student, to build skills, meet new people, do cool things and I felt that this was a great opportunity to give something back to the university too.\" \"We had one very engaged group who visited our head office and asked lots of insightful questions,\" says Hazel. \"There were some very useful insights from a Gen Z point of view!\" The Consultancy Competition continues to be a cornerstone of the Business School's commitment to providing practical, real-world experience for its postgraduate students. Teams are formed from across all MSc programmes, allowing students to combine their diverse expertise and areas of interest to develop comprehensive proposals and recommendations. “This challenge had a profound impact on me both professionally and personally,” said MSc Financial Technology student Umer Farid Shaikh. “It was incredibly exciting, allowing us to delve into Jaguar Land Rover's history, its vision for electrification and sustainability, and explore various models to address challenges in modern procurement – and as a car enthusiast, visiting the British Motor Museum and witnessing the history and evolution of iconic vehicles was a dream come true.” For any alumni considering participation in next year's challenge, Hazel's advice is straightforward: \"You've got nothing to lose, go for it and get involved! You will meet new people and gain new insights.\" If you’re interested about participating in the Consultancy Competition, please contact our Faculty Alumni Volunteering Manager for Nottingham University Business School, Emma Winter, at emma.winter@nottingham.ac.uk."
        }
    ],
    "pdf_files": []
}