{
    "url": "https://www.nottingham.ac.uk/alumni/powering-up-our-new-40m-research-facility",
    "content": [
        {
            "p": "June saw the opening of our state-of-the-art Power Electronics and Machines Centre (PEMC) on Jubilee Campus. This new £40 million research facility will drive forward advances in powerful, clean electrification technology and pave the way towards a new generation of low-carbon, sustainable electric vehicles, power and propulsion − all helping support Nottingham's aim of becoming a net zero carbon city by 2028. Take a look behind the scenes of the facility with us. The PEMC offers purpose-built laboratories for the university's Power Electronics, Machines and Control research group - the largest such group of researchers in the world - and sits at the heart of our commitment to establishing Nottingham and the East Midlands as a hub for the translation of net zero technologies from research bench to real world solutions. The group of 170 researchers is internationally leading across many application and research areas relating to high performance electrical machines and power electronics, with over 720 papers in top journals over the last five years and more grants from Europe’s Green Transport research programme than any other EU or UK based university. With around 80% of research funds related to or directly from industry, aerospace applications make up the largest proportion of research, for example on high power density motors and power electronics. And the group is leading the development of electrification standards as well as technology roadmaps for zero-emissions flight for regional aircraft. The new facility will now enable researchers to put their technology through rigorous test regimes and work with industry from automotive, rail, marine and aerospace to realise the products of the future. The building is also home to the Government-funded Driving the Electric Revolution Industrialisation Centre - Midlands, which is developing innovative technology and manufacturing processes for advanced electrical machines and drives to support the UK’s net zero ambitions, and houses the 20MW UK Electrification of Aerospace Propulsion Facility, which offers industry testing at a scale unrivalled by any other research centre in the world. The facility is funded by UK Research Partnership Investment Fund, Wolfson Foundation, DER, D2N2 and industry partners. The PEMC building lies at the heart of the university’s plans to develop research and innovation clusters over the next five years, a key pillar of the government’s innovation strategy, which will generate significant regional economic benefit while addressing strategic challenges faced by the UK. A key focus will be its cluster for zero carbon innovation. Nottingham is among the top five institutions globally for translation of zero carbon research and its partnerships with government and industry will widen the real-world impact of that research in key areas such as electrification for transport, technologies for net zero aviation, developing green fuels and low energy solutions for the built environment. Read more of the latest news and research from our world-leading team. Written by: Chris Hickman One of the most iconic halls on campus, 'Hu Stu' is undergoing a two-year refurb to bring it into the 21st century - take a look at what's planned! Catch up with our series of events in India during October, as our Alumni Volunteering team hosted gatherings in Pune, Delhi, Mumbai and Bangalore. Join us for a whistle-stop tour of news around campus and in Nottingham this month - it's graduation season! We asked for your opinion on the support we offer in our annual alumni survey."
        }
    ],
    "pdf_files": []
}