{
    "url": "https://www.nottingham.ac.uk/alumni/learn/learn.aspx?category=all&pageIndex=1",
    "content": [
        {
            "p": "Whether you're looking for professional skills and insights or personal motivation and inspiration, we have a great range of alumni activities to help you grow who and what you know. Develop your skills and hear unique insights from our community and industry speakers on a wide range of topics selected by alumni. Fast-track your career with IJ Samuel's top tips. Find out how to stand out, deciding on your specialism and the best way to get into the green sector. Michael Skok shares his insights, gained over 40 years as an entrepreneur. Build your personal brand and position yourself to achieve your goals. Our panel share how they found their way through difficult situations. Top tips on how to move your career forwards during changing times. For our first Questions for leaders topic, you asked us to line up alumni leaders from the creative, finance, technology and entrepreneurship sectors, happy to answer your questions on Progressing your career. The tools you need to overcome challenges and succeed. When is the right time to take the leap of faith into entrepreneurship? Make decisions able to withstand whatever happens next Bring the right people together and achieve a favourable outcome. Five steps to starting and growing your network. Our latest webinar series, Grow, features alumni from a wide range of sectors who share their top tips to help you to develop your professional skills and build your personal attributes. Could screwing up be the secret ingredient to your success? Explore the benefits and challenges of different working styles. View more Our alumni programme is here to help you to grow and thrive professionally and personally. There’s so much more to come – here are some of the highlights of our upcoming programme. Our seminars promote the latest in research and thinking from Nottingham University Business School. Hear from our inspirational speakers, with unique insights you won't find anywhere else. Learn a new skill with our immersive masterclasses, hosted by experts in their field."
        }
    ],
    "pdf_files": []
}