{
    "url": "https://www.nottingham.ac.uk/alumni/oar-inspiring-1",
    "content": [
        {
            "p": "When Peter had a conversation with his new digs-mate on arrival at Nottingham as a fresher in 1955, little did he know it would spark a passion that has lasted more than 60 years (he still rows three times a week on the Thames at Henley) and is now being shared by a new generation of students. Peter went on to join the Boat Club and rowed throughout his six years at Nottingham, only stopping for a few months before his final exams. \"Before I started at the university\", explains Peter, \"I had in mind that I wanted to do some sport but wasn’t sure what I wanted to do. I hated running and didn’t fancy football or rugby. \"A digs-mate joined the rowing club and clearly enjoyed it, on and off the water, so I went along and thought it was a lot of fun. The rest, as they say, is history.\" “I didn’t row from Christmas until after my final exam in June,” says Peter. “But the day after the last exam, I was out onto the river again.” Now, more than 60 years on since Peter first rowed on the River Trent, he’s been able to leave a lasting legacy for the University of Nottingham Boat Club by generously donating his much-loved Stämpfli Pair/ Double Racing Boat, ‘Loddon Lily’. To commemorate this special occasion, Peter joined members of the current Nottingham senior squad during a practice outing and relived his fond memories of earlier times spent on the river. Despite the age difference – Peter is now 86 – he spent the afternoon rowing with the squad and reminiscing about his university experience in the late 1950s and early 1960s. “I have a lot of fond memories of my time with the Nottingham University Boat Club,” says Peter, “particularly when we entered the Thomas Cup at Henley Royal Regatta in 1958. It was the first time the University of Nottingham had entered a boat at Henley.” Peter hopes his boat will play an important part in the future success of the Boat Club. “Of course, I would love to see the students today enter a race in ‘Loddon Lily’ and win, but if that’s not possible, I hope they will find it useful when training.” Ethan Page-Mason, president of the Boat Club, is certainly anticipating that Peter’s boat will help train current and future members. “When Peter approached us with his offer of donating his pair/double we were absolutely delighted,” explains Ethan. “The boat is being put to good use with our senior squad, allowing us a greater degree of training variety and improvement. The boat will be cherished for training and racing by the Boat Club for years to come.” The squad also enjoyed spending time with Peter on the day and hearing about the university in the 1950s. “It was a real inspiration for our athletes to talk with Peter and hear his stories about rowing at the Boat Club in the 1950s, while training out of the very same boathouse we use today. Seeing Peter back in a university eight, fitting in perfectly with our senior men was a real treat and he left asking when he can come back!” Words: Rob Burman | Photography: Tom Hills and Alex Kuster Find out how the generosity of one couple, who met at Nottingham, is helping students with autism prepare for life on campus. This year we asked you to share your formative gig-going experiences, both on and off campus – here’s a selection of the best! All the latest news from around the university and in Nottingham over the last month. Richard Munang shares a typical day in his life as Deputy Director of the United Nations Environment Programme (UNEP) in Africa."
        }
    ],
    "pdf_files": []
}