{
    "url": "https://www.nottingham.ac.uk/alumni/community/your-nottingham-alumni-awards-winners.aspx",
    "content": [
        {
            "p": "Our awards celebrate your amazing contributions and share the stories of how you carry Nottingham's values into the world. Nottingham is more than a place. It shapes who we are and the people we become. It's a way of thinking and of being. Your Nottingham Alumni Awards celebrate you – our alumni community – and share the stories of how you carry Nottingham's values into the world. No two paths or experiences are the same; that's what makes our community so special. Our awards are designed to reflect this rich diversity and the amazing contributions being made in so many different ways. The awards actively seek nominations of alumni from all communities, particularly those within often underrepresented groups. Meet our 2023 winners and discover what receiving an award means to one of the recipients, Jonelle Awomoyi. \"I have so much respect for the University of Nottingham – the time I spent studying, living and learning there has helped mould me into a well-rounded person. Being recognised for this award is tremendous honour. It's given me a chance to show gratitude to those who have given me a chance over the years during my education, career and personal endeavours. I was very excited to return to campus. There's something so special about University Park – perhaps it's the strong sense of togetherness and community. Many of my closest friends, ones I would consider family, I met for the first time on this campus. It was at the University of Nottingham where I decided to become a storyteller and focus on journalism as a profession. I work as a news journalist at BBC News and produce social media reports for some of the biggest news stories of our time. \"Recognition is motivation. It inspires me to work harder and carry on and perhaps lets me know that I'm on the right track. From a young age, I've always wanted to help make positive change. I've been lucky to have been given a world-class education and access to information and tools – so it's my and our duty to help make the world a more equal place. I hope to work on more impactful solution-based journalism that helps create positive change in the world. I want to continue to be a force that helps change the nature of storytelling, so that everyone can feel like it's easy and simple to learn about our beautiful world.\" Shivansh is the founder of City One Initiative, an Indian educational organisation focused on enhancing contemporary skills. The learning gap in modern skills and need for innovative curricula led to the commencement of his venture, and he has successfully curated over 80 upskilling simulations in leading academic institutions, benefitting thousands of students across various educational boards and backgrounds. As an educator and entrepreneur, Shivansh has a keen interest in the public speaking and leadership development arena. Romy is a fervent advocate of development in her home country Madagascar and also has at heart a passion for global sustainable development. Romy has three master’s degrees: Marketing and International Business, Diplomatic and Strategic Studies from the Centre D'étude Stratégique et diplomatique, and International Trade. She also holds an MBA in Sustainable Development. Meshach is a Clinical Chemistry Fellow at the University of Toronto, an expert in gynaecologic cancer diagnosis and therapeutics at The Ottawa Hospital and a part-time Professor at the University of Ottawa. He is a recipient of the TOH Worton award for his cutting-edge discoveries in ovarian cancer and community leadership, and is the author of the book The ABCs of Cancer. He graduated from Nottingham as a Commonwealth Shared Scholar and best student in his class, in addition to receiving a gold certificate award and roles as class representative and Faculty of Medicine and Health Sciences library representative. Jonelle is a journalist at BBC News, anchoring for BBC Three’s The Catch Up and presenting impactful social media news content. Her investigation into social media fraud during the pandemic influenced app improvements to protect consumers, while her exposé on the £500 million Youth Investment Fund failure led to its reinstatement. Recognised for her immense community contributions, she received a hand-painted mural in London and was nominated for the Woman of the Year Award in 2021. Sakshi is the recipient of the Diana Award (2022) and is the world’s first UNESCO Kindness Leader. She is the founder of Project LEAP, a social service project committed to Sustainable Development Goal 4, and an Occupational Psychologist working in the environmental, social and governance (ESG) and sustainability space. Currently based in the UK, she is originally from India and often uses concepts from Indian psychology to facilitate change sessions. She advises multiple AI-based start-ups following three years of her start-up experience, and is a passionate solo traveller. Nigel is the founder of charities Mission Direct and Home Leone. Mission Direct enables thousands of volunteers to use their holidays for good in the world’s poorest nations with an approach of joining people in what they are doing well and mobilising resources to transform lives, building homes, schools, clinics and more. Home Leone’s “Destiny” Village is a holistic, sustainable solution to slums in Sierra Leone, providing low-cost affordable homes, growing businesses, education, healthcare and utilities, all supporting skills development. In 2022, Nigel was awarded an MBE for services to international charitable work. Richard is the United Nations Environment Programme’s Deputy Regional Director and Africa Regional Climate Change Coordinator, driving Africa’s climate resilience, fostering capacity building and stakeholder engagement. He pioneered the Africa Adaptation Gap Report series, providing localised data for policymakers to bridge climate resilience gaps, and developed the first-ever framework, the Ecosystems-Based Adaptation for Food Security Assembly, to mobilise state and non-state actors for climate action in Africa. Richard has developed a mentorship tool called “Innovative Volunteerism”, which has empowered over three million unemployed youth to create profitable enterprises through climate action. Richard’s dedication to environmental leadership earned him the UNEP Baobab Programme Innovation Award in 2016. Andrew founded the children’s charity SicKids, and works clinically between the UK and Cambodia. His work in medicine and expertise in safeguarding children and protecting children’s rights have been recognised internationally. He has been awarded a Fellowship and the Pol Roger Prize by The Churchill Fellowship; The Association Medal by the British Medical Association in recognition of his distinguished service to the Association and contribution to medicine; and The Gold Decoration of Honour by the European Union of Medical Specialists to recognise his dedicated work for European Medical Specialists. In 2023, Andrew was appointed as Officer for Child Protection at the Royal College of Paediatrics and Child Health. Frances is a political journalist, author and broadcaster. For the last decade, she has been a columnist and feature writer for The Guardian, focusing on the impact of government policies on low income and disabled people. Her work has featured on the front pages of The New York Times, The Guardian and British Vogue. She has twice been highly commended at The National Press Awards, as well as shortlisted for the Orwell Prize and Paul Foot award. She is the author of Crippled (2019), which was made into the short drama Hen Night for the BBC, and the upcoming Who Wants Normal? (2025). Medha is an entrepreneur, writer, TEDx speaker and #ChiefPlasticWarrior. She initially never thought of working in the waste management sector and describes her journey as “an accidental environmentalist”. Medha is the co-innovator and pioneer of the Thermo Catalytic Depolymerization Process in India, which converts thin and traditionally non-recyclable end of life plastic into usable liquid fuel. She has been named one of the Top 30 “Women Transforming India”, and has helped collect more than 3.6 million kg of plastic waste and inspired more than 200,000 people to join this movement."
        }
    ],
    "pdf_files": []
}