{
    "url": "https://www.nottingham.ac.uk/alumni/shes-a-jolly-good-fellow-1",
    "content": [
        {
            "p": "Nottingham is home to some of the world’s finest academic minds – but have you ever wondered what makes them tick? We met four of our research fellows – outstanding postdoctoral researchers at the early stage of their academic careers – to find out. My research project is centred around a foundational problem in the philosophy of parenthood and reproductive ethics: How do we acquire parental rights? What makes my child ‘mine’? With so many shifts in family-making practices in recent decades my aim is to figure out the morally and socially relevant distinctions at play here. Bad at summarising! Translating my scribbled down middle of-the-night brainwaves into reasonably articulate philosophy. Little treats. Like a grumpy toddler, my brain responds pretty well to the promise of a coffee/chocolate/early lunch break ‘if we just manage one more hour of this.’ I’ve known I wanted to go into philosophy since I took philosophy A-level, but I don’t think I saw it as a career option at that point. It was only when I was doing a PhD that I realised I might be lucky enough to keep doing philosophy forever, and that actually this was the real world too. My Fellowship aims to challenge and redefine how we think about women’s health and safety at work, and lead to global change in the way we protect the wellbeing of millions of women around the world working in the garment and footwear manufacturing industries. Informed, engaged and passionate. Perseverance. You can have a lot of doors slammed in your face as a researcher – on fieldwork, sometimes literally – so you need to be ready to try new ideas when your best laid plans go awry. I know there are millions of people across the UK and worldwide who have unfairly landed a far tougher day than me – and I want to change that. After my PhD, I was commissioned to do a short piece of research on women activists in Cambodia’s labour movement by a local NGO. Their unrelenting wit, grit and determination in the face of intersecting forms of violence and oppression blew me away. I had to get involved! Results from the 2021 Research Excellence Framework (REF), the key barometer of university research, placed Nottingham 7th in the UK out of 157 institutions for the strength of our research power. Published this year, they consider a combination of the quality of our research, its international impact, critical mass and sustainability. Our REF submission recognised the contributions of 1,800 researchers, with over 135 case studies demonstrating the global impact of our research. Vice-Chancellor Professor Shearer West said: “Nottingham has often been recognised for the breadth of its research: to achieve quality across the range of disciplines submitted reflects the talent, imagination, and dedication of colleagues across the institution. “I am especially proud of the positive impact that our research has had on people in the UK and throughout the world, which is testament to the determination of our researchers to make a difference to people’s lives.” Discover our transformative research I am an observational astronomer studying the intricate structure of distant galaxies and vast clusters of galaxies. My research explores the impact of the most energetic events in the lives of these galaxies – powerful jetted outbursts from their central supermassive black hole and massive collisions between huge clusters of galaxies. Enthusiastic, meticulous, practical. Although my husband has just read this over my shoulder and suggested ‘obsessive’. Attention to detail. I spend much of my time extracting real signals from noise and artefacts in telescope detectors by carefully applying advanced optimisation and calibration routines. I find it incredibly exciting to watch the secrets of distant supermassive black holes, and the intricately coupled hot plasma that surrounds them, emerge as I work through each problem. Usually chocolate, but if I’ve run out, the addition of numerous exclamation marks to my lab book notes. Who or what inspired your career in research? I was a Nottingham physics undergraduate student and inspired to pursue astronomy research by great mentors in the department, including Professor Meghan Gray, who also held an Anne McLaren Fellowship at the time. I study how scar tissue is involved in diseases like cancer. By taking 3D pictures of the protein fibres in a scar, I can engineer miniature versions of them in the lab. This helps us study processes like cancer metastasis and organ failure and find new ways to treat them. Interdisciplinary creative perfectionist! Bringing together different research fields to make something new. My current work with scar tissue brings together research ideas from areas as far apart as dentistry, geology and food technology! My support network of mentors and colleagues. I know they will always be there to help me navigate the tricky moments, give me a boost when I need it, or just catch up and recharge over a coffee. Learning about biological materials like spider silk and bone absolutely fascinated me, right from my first year as an undergraduate student. I eventually learned how these materials could be used to study diseases and help find new treatments for patients suffering from diseases like cancer. Knowing that my research now has real potential to make a positive impact on patients’ lives is a huge inspiration to me every day. Words: Chris Hickman | Photography: Marcus Holdsworth Incorporating sustainability into teaching across the curriculum at Nottingham is helping today's students protect the future of the planet. We find out how learning is being transformed. At the Sir Peter Mansfield Imaging Centre, dedicated researchers today are continuing to develop and evolve this pioneering work to tackle new challenges."
        }
    ],
    "pdf_files": []
}