{
    "url": "https://www.nottingham.ac.uk/alumni/marie-ashby-headline-news",
    "content": [
        {
            "p": "A staple of the East Midlands news scene for more than 30 years, award-winning journalist Marie Ashby has covered many of the region’s highest profile stories during her career at both the BBC and ITV. We caught up with Marie as she received her honorary degree in December for her insights into the profession and to discuss how the industry has changed. Marie Ashby’s own story over the last couple of years is every bit as newsworthy as many of those she covered during her extensive, award-winning career: “I can't say it was easy to find out on a Zoom call that regional BBC current affairs teams were being axed during the first wave of the pandemic. “I wasn't very well either. I lost my voice post-Covid, which required speech therapy for months and some pretty horrible tests to eliminate cancer. So that was pretty grim.” Marie joined BBC Radio Nottingham in 1987 when she covered the General Election and secured an infamous interview with Nottingham Forest manager Brian Clough in her first week. 35 years later she was starting afresh; something which could be daunting for anyone who has spent their whole career in one profession, but Marie has found it liberating. Last winter, Marie joined the NHS Covid Workforce as a vaccinator and also worked alongside qualified nurses in an admin role. With her hair tied up and her face mask securely in place, most people were completely unaware that they were being looked after by a well-known newsreader and local personality and Marie admits she liked it like that. “Part of the job is to put people at ease, and I always ask myself how would I want to be treated?” “When I finished working at the BBC I just thought I’ll use this opportunity to do something else. I did all the NHS training online to become a vaccinator and it was really important for me to pay back for all the health service has done for me and my family. My eldest son is a doctor now and my youngest was studying Medicine at the time.” Among other experiences including lugging heavy bags of peat around a garden centre, selling plants and working in a shop that sells artisan coffee and teas, Marie has also completed a prestigious writing course. “I kind of like the idea of reinventing myself a little bit each time, using my people skills and gaining some new ones.” “I just felt like I wasn't ready to stop. I had an amazing career in journalism. I'm very grateful for that. I loved it. I'll always look back at it really fondly. I had some amazing opportunities, and I interviewed some incredible people.” “Many have been ordinary people, who have achieved extraordinary things, the occasional Prime Minister and some incredibly brave people desperate to have their story heard.\" Marie also made a documentary with fellow honorary graduate and Nottingham actor Vicky McClure, about her nana Iris’s dementia. It was a prequel to the hugely successful “Our Dementia Choir”, filmed in the city. “Vicky described it at the time as the most important film she'd made. I felt incredibly privileged to be part of such a personal story.” For someone looking to follow in Marie’s footsteps, does she think the journalistic landscape has changed since she was a cub reporter? “Journalism is still a great career. You have to work hard. There are many more pressures on TV journalists these days, not just doing the interviews, but shooting the film and editing the footage. “But the same principles still apply; ask the difficult questions, be tenacious, look for those opportunities to get better at your career. Get help from people who are more experienced than you are. They’ll be willing to help you if you ask them. “I remember thinking I wanted to change the world. I wanted to tell people’s stories and I wanted to be part of that change. And I think that's probably still why a lot of people come into journalism.” Our conversation takes place not long after it was announced that the BBC was planning further cutbacks to its regional news output, something reflected across the industry. According to the Press Gazette in 2020 over 250 local newspapers had closed since 2005 alone. “I wish that local journalism was as strong as it was when I first started. Unfortunately, it isn’t. And a lot of newspapers have gone, along with the TV and radio cutbacks still to come in the BBC. “That's a real shame because the strength of the media in the regions and in Nottingham, for example, is that those journalists are based here, and they have the knowledge to be able to cover those stories because they're a part of the community. I think it will also be devastating for local democracy, if it deteriorates further.” “Clearly people get their journalism in all sorts of ways today. My sons are in their twenties, and they don't sit down every night to watch the news the way that we used to. There's a lot of stuff about fake news, the main channels get criticised, and a lot of people don't trust media the way they used to. And that's sad. It is really sad.” But let’s not forget, we’re here to celebrate. So to end on a more positive note, what did Marie make of the reception when receiving her Doctor of Letters? “Going up on a stage and talking in front of people has always been one of my big dreads, but it was made much easier by all the incredible students in front of me who'd done such amazing things. I just felt so honoured to be among these people who've got incredible talents and will go on to have amazing careers.” And whether at the beginning of your career, or changing direction along the way, Marie’s last piece of advice rings true: “Surround yourself with people who will be positive and will support you.” Amen to that. A world squash champion and a film director, DJ and musician also received honorary degrees from the University of Nottingham at this year’s winter graduation ceremonies. Meet them > Dr Andy Cornish shares why shark and ray conservation is vital for our ocean ecosystems. For many of us, the thrill of the stage is keenly anticipated as we await the return of our most beloved cultural stars to the wings of the theatre – but what has it been like for those who work in the arts? We were delighted to welcome Caucher Birkar (Mathematics PhD, 2004) back to campus this winter to award him a richly deserved honorary degree. In conversation with alumni Preet Grewal (Production Engineering, 1988), Roy Twite (Production Engineering, 1988) and first-year Chemical Engineering student, Rene-Ioic Betek."
        }
    ],
    "pdf_files": []
}