{
    "url": "https://www.nottingham.ac.uk/alumni/vice-chancellors-comment-2022-1",
    "content": [
        {
            "p": "A message for alumni from Professor Shearer West, our Vice-Chancellor and President. The University of Nottingham always aims to make a positive difference and this edition of Connect celebrates the contribution made by our researchers and alumni around the world. The university celebrated success in the 2021 Research Excellence Framework for the contribution made to society by its research and according to Times Higher Education is now placed 7th in the UK for its research power. I am especially proud of the positive impact that our research in healthcare, industry, business, culture and public policy has had on people’s lives. To extend this contribution, we will continue to develop the Castle Meadow Campus site, providing a city centre home for our work to support jobs, investment and growth across the city, and provide a living laboratory for collaboration with local business, industry and SMEs. The new £40 million Power Electronics and Machines Centre will drive advances in powerful, clean electrification technology and pave the way towards a new generation of low-carbon, sustainable electric vehicles, power and propulsion, underpinning our standing as one of the top five institutions globally for the translation of zero carbon research. The building lies at the heart of our plans to develop research and innovation clusters over the next five years, a key pillar of the government’s innovation strategy, which will generate significant regional economic benefit while addressing strategic challenges faced by the UK. I do hope you enjoy the inspiring stories in this edition and take a little time to reflect positively on your own contribution to our world as part of our alumni community. Written from the Vice-Chancellor's Office in September 2022. You can view all the latest updates and opinions from Professor Shearer West on her blog. Read the Vice-Chancellor's blogs > Words: Professor Shearer West, Vice-Chancellor and President Thanks to the generous ongoing support of alumni and entertainment executive Peter Rice, eight determined scholarship students are heading to Hollywood for summer internships."
        }
    ],
    "pdf_files": []
}