{
    "url": "https://www.nottingham.edu.my/Alumni/index.aspx",
    "content": [
        {
            "p": "Discover the benefits and impact of UNM’s alumni network As a graduate of the University of Nottingham Malaysia (UNM), you join a global community of over 340,000 accomplished Nottingham alumni. Our diverse network spans industries, generations, and continents, united by a shared Nottingham spirit. Tap into a world of connections, resources, and lifelong support to elevate your personal and professional aspirations. MEng (Hons) in Chemical Engineering with Environmental Engineering 2015 graduate Co-Founder and Director at Zero Waste Malaysia I am immensely grateful for the serene and nature-centric environment of UNM, nestled in the suburbs. It perfectly aligned with the study environment I had envisioned as a student. The experience of living on campus played a pivotal role in shaping me into a more independent individual. It taught me self-reliance, responsibility, and the importance of making decisions. UNM's tranquil setting provided the ideal backdrop for personal growth and self-discovery BSc (Hons) in Economics 2018 graduate Vice President at HSBC Global Banking UNM offers a dynamic student community with numerous events, clubs, and societies that allow us to develop and apply interpersonal and management skills in our daily lives. These experiences have strengthened my interpersonal skills, benefiting both my personal life and career. UNM has exceeded my expectations with its high-quality education and supportive learning environment, ensuring a fulfilling academic journey. BSc (Hons) Finance, Accounting and Management 2018 graduate CEO of Graze Market One of the best things I love about UNM is that it's so diverse, both in culture and the people we meet. It's a chance for us to grow our network, not just to study. We get to meet people from diverse backgrounds and different nationalities without having to travel outside of Malaysia, and that is an extremely good thing. Alumni Network General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}