{
    "url": "https://www.nottingham.ac.uk/alumni/news-and-events/news.aspx?category=all&pageIndex=9",
    "content": [
        {
            "p": "Keep up to date with your alumni community. How Max Thorpe overcame disaster in the Atlantic Ocean to claim a World Record in the toughest row on Earth. A 50 year-old photo of the university football team has rekindled friendships for one Nottingham alumnus This year we asked you to share your formative gig-going experiences, both on and off campus – here’s a selection of the best! The race to meet global climate change targets is being run by some of the university's leading researchers. Through his beautifully intricate hand-drawn maps, Taiwan-based artist Tom Rook (Geography, 2010) offers a unique perspective on our urban environments. Alumnus Julian Hadden (Chemistry, 1990) was behind the camera lens for three years between 1987 and 1990 for the student newspaper Impact - he shares some his most memorable photos. Karl Warner (Politics, 2001) is currently sister channel E4’s Controller and Head of Youth & Digital. He shares his insights on the battle with streaming giants. Steve Cliffe (Electrical Engineering, 1985) explains how his career has helped advance the advent of touchless technologies. Whether staff, fellow alumni, or just friends made during university days, we have been asking alumni who have been generous enough to indicate that they are intending to leave a Gift who their guiding lights were. This month's Memory Lane comes from Alan Williams (Industrial Economics, 1964) We speak to Dan Warne (History, 2007) for his unique insight into establishing a business during a pandemic. The former Managing Director at Deliveroo left in late 2019 to establish his own start up in the hospitality sector. We meet Anna Wallace (English, 2018) to find out what it’s like to work behind-the-scenes of one of the most exciting series on TV. Peter Roper (Agriculture/Horticulture, 1971) shares his memories of how he helped establish the theatre in its current location. The Henley Regatta is perhaps one of England's most revered and iconic sporting occasions, dating all the way back to 1839. This month we share a Memory Lane story from Michael Jeanes (Civil Engineering 1960) who told us: \"I found your magazine feature on a night out in Nottingham and prices of food and drink in various eras, most entertaining. I wonder if you would be interested in printing and maybe reviving a few memories, my day out in Beeston c1960?\" We meet Anmarie Spaziano (Sociology, 2002), founder of Annie’s Burger Shack, to find out about her journey from a small pub kitchen to owner of one of Nottingham’s most popular restaurants."
        }
    ],
    "pdf_files": []
}