{
    "url": "https://www.nottingham.edu.my/Alumni/Yayasan-UNMC/Yayasan-UNMC.aspx",
    "content": [
        {
            "p": "The University of Nottingham Malaysia has established a Foundation to support its charitable and outreach work. The University staff and students engage in a variety outreach, volunteering and research activities to improve the well-being of society as a whole and specifically help disadvantaged communities. The establishment of the Foundation will provide a clearer focus towards philanthropy. It will highlight to our stakeholders the importance of giving back to society. To support advancement through education with a particular focus on supporting disadvantaged individuals to realise their potential through education. This may encompass outreach programmes as well as scholarship support for marginalised local students (Orang Asli, parents listed with the Welfare unit and those below poverty line) as well as students from developing countries and those impacted by natural and man-made disasters who would return home for \"nation building\". To support research, education and raise awareness on environment and its sustainability. To promote activities that will help ensure a sustainable future, protect biodiversity and reduce the negative impact of human actions on the environment. To create initiatives that encourage the growth of arts and cultural activities within and beyond the University for the benefit of a broader community locally and nationally, including support for performing arts and visual arts projects. To support and promote education and research that relates to health and wellbeing, including encouraging participation in sports. To support physical infrastructure developments that will have a positive impact on student experience, research developments and knowledge transfer, while contributing to the long term sustainability agenda at the University. For any inquiries and more information, please contact us: Tel: 03 8924 8373 Email: UNMCFoundation@nottingham.edu.my telephone: +6 (03) 8924 8373 fax: +6 (03) 8924 8657 email: alumnirelations@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}