{
    "url": "https://www.nottingham.ac.uk/alumni/formula-for-success-1",
    "content": [
        {
            "p": "Dr Marie-Claire Peakman (Pharmacy, 1990; PhD Physiology and Pharmacology, 1994) is Executive Director, Emerging Science and Innovation, and Principal at Pfizer Ventures in Groton, Connecticut. At the forefront of innovation and discovery throughout her career, she shares her approach to embracing new opportunities and developing an innovative mindset. What does innovation mean to you? \"To me, innovation is seeing a gap and being open minded about how to fill it. First, it requires the ability to assess the environment and recognise there is a challenge or improvement that can be made. Second, it requires an unbiased consideration of possible options to address the need. Continuous improvement of any process or task becomes second nature and a real spark of innovation comes when an improvement made in one area can be brought to bear in a new field. “Innovation has been paramount throughout my career at Pfizer. Overcoming the challenges of designing and delivering novel medicines to patients that are safe and effective has required that we understand the reasons for our failures in the clinic and adjust to overcome them. We continually stay abreast of evolving science, applying new learnings and emerging techniques at the right place in the discovery and development pipeline to answer critical questions along the path.” How do you stay motivated? “The desire to make a difference has probably been the driving force in my life. My personal vision statement includes the phrase “I do what matters and it matters what I do.” I always wanted to make a positive difference by showing up for the people and communities that matter to me. Sometimes I’m in danger of over- extending myself or not being as perfect at everything as I would like. I accept that maybe, in fact, all I can do at that moment is ‘show up’. The aspiration to make a difference is always what keeps me going and what makes me get up after a failure to try again.” How do you inspire others as a leader? “I think you need to believe in what you are doing and you need to believe in the people that you are doing it with. Be a champion for your team members, individually and as a group, and for both their personal and professional growth. Communicate a vision that stands the test of time. Celebrate their successes (that means you have to understand when they have been successful, and sometimes you have to highlight successes that they don’t see) and in tough times, help to remove obstacles from their path and encourage them to keep going.” How would you encourage others to foster an innovative mindset? “Be curious, speak your thoughts and listen to others. Talk about what you do and why, ask others about what they do and why. When I do that, I recognise where I don’t really understand something, and it leads me to ask more questions. Over time the questions get better, more relevant and the perspectives from others help me to think differently, to be more open- minded about solutions. Other people’s experiences also give me new options to consider in my own situations.” How do you spot opportunities and pursue them? “I love to dance, so this quote has always resonated with me: “Opportunity dances with those already on the floor”. In my mind, this means that you need to be engaged with what’s going on around you and communicating well with others. If you provide a sounding board for your colleagues, you’ll hear about what’s going well and what challenges they are facing. You’ll be able to spot when successes in one area of the organisation can be applied to another and you can become a nexus bringing people together. “If in return, you share your successes, your challenges and are open about your personal growth goals, leaders will be able to select you for new opportunities as they arise. If you create relationships built on trust, you desire to help others succeed and you build a reputation for delivery then people will want to work with you and will turn to you for help with new challenges and opportunities.” What is the most valuable lesson you've learned during your career? “Be true to yourself and be as authentic as you can. Take time to assess what truly motivates you and builds up your energy and, conversely, recognise what drains you and when you are trying to ‘fake it’. Be honest about your strengths and weaknesses. Be willing to step outside your personal comfort zone and grow. Don’t rely on a definition of success that comes from your organisation or the people around you. Work out what success in your life means to you.” Edited: Faye Haslam (History, 2012) We take a moment to explore our campuses and discover iconic locations and hidden gems. Discover how to solve problems and influence change across organisational boundaries. The workplace changes introduced in response to Covid-19 have provided the opportunity to reset team dynamics. In this session learn more about NUBS's unique new programme to help businesses prepare for a digital future from Dr Andrew Callaghan."
        }
    ],
    "pdf_files": []
}