{
    "url": "https://www.nottingham.ac.uk/alumni/celebrating-the-50th-anniversary-of-the-hallward-library",
    "content": [
        {
            "p": "Our iconic brutalist masterpiece, setting for numerous late night cramming sessions, the Hallward Library, turns 50 this year. The team from University of Nottingham Libraries is looking back over its history over the coming weeks and we're sure, as alumni, many of you will have plenty of fond(?) memories to share. Find out how you can win some exclusive and limited edition Hallward Library anniversary merchandise too! Over the last 50 years a great deal has changed in the library to reflect the changing needs of students, including the introduction of more flexible and interactive spaces including a screening room, but the library’s distinctive Brutalist exterior and wood panelled interior remain. Over the coming weeks, colleagues from University of Nottingham Libraries will be sharing a series of posts about the history of the library from idea to official opening and beyond, featuring photographs and other items from the university’s archival collections. You can read the first instalment on the Manuscripts and Special Collections blog now and keep up with the rest of the anniversary celebrations on the library team's 50th anniversary webpage. In the meantime, they have three Hallward Library 50th Anniversary tote bag and notebook sets to give away! To be in with your chance to win, simply answer the team's easy history question and complete your details on this form by 15 September 2023. From hosting a princess to helping pop royalty, celebrating Hallward's half century and more. Here's a recap of 2023 news highlights. One of our oldest and most loved halls, take a look round Florence Boot after its year-long refurbishment. We're looking for alumni with a passion for sport to volunteer for a unique opportunity to help us achieve our Vision for Sport. A 50 year-old photo of the university football team has rekindled friendships for one Nottingham alumnus"
        }
    ],
    "pdf_files": []
}