{
    "url": "https://www.nottingham.ac.uk/alumni/believe-in-you-1",
    "content": [
        {
            "p": "Sakshi Bansal (Work and Organisational Psychology, 2019) is a Senior Consultant at ARUP in London, the founder of Project LEAP and the world’s first UNESCO Kindness Leader. She is a recipient of the Diana Award, a prestigious accolade which recognises young leaders for their social action and humanitarian work. She shares the values which guide her career. Learn what it means to self-reflect. A lot of people tell us to reflect, pause, think and do some soul searching. Very few, however, tell us how to do that. My way of doing it is three-fold: 1. Make the time – the walk back home, bus journey alone, quiet time before bed are all excellent pockets of time to reflect. 2. Quiz myself – I ask myself a lot of questions during this reflection on why I liked or disliked something, what about it speaks to me, what I would do differently. 3. Act on it or let it go – don’t fall into the trap of too much reflection and too little action or vice-versa. Study something new. Once in a while, study something that has nothing to do with your profession or degree. It will open your mind to new ideas, perceptions, skills and conversations. Talk to people who have very different educational and professional backgrounds to yours – be open to listening to their perspectives, ideas and take on challenges. This is the best place to spark creativity and collaborative ideas. Stay naïve. A lot of us are open to taking risks when we are younger – we have less to lose and a lot to explore. As we grow older, we become less and less open to risks. We no longer believe we have all the answers. Constantly push yourself to bring that element of childhood naivety. Make sure you are open to taking risks and believing in yourself. De-personalise feedback and personalise purpose. When receiving feedback, remember that it is not feedback about you or your personality but simply feedback on how to achieve the goal in the best way possible. Your reasons to achieve that goal and to take on that journey, however, should be very personal. Don’t just put a generalised vision or purpose statement on your profile or website – share a truly personal story on why it matters to you. This will make your brand and help you sustain in a very competitive world. Nurture your network. To connect with a lot of people is a skill, but to nurture and grow your network is an investment. Bring value to your networks, connect people who you think will work brilliantly together and listen closely to what they say about your work and about their field. Then, bring this richness of information to your work and that is true worth. Know when to move on. You might be truly passionate, curious and excited about some things in life. But midway in the journey your preferences change. You become curious about other things, want to explore different pastures. If you aren’t truly curious about what you’re doing anymore – move on. But make sure you move on with a plan. Maybe you handover what you created to the next leader and find yourself the next chapter. Or maybe you pack up shop and start fresh. Make a plan and stick to it. Depth v breadth. You can either go deep into a field or topic and be an expert at it. Or you can get breadth across various fields and synthesise the information. Observe in yourself whether you are a depth or a breadth person, and offer your skills, time and energy accordingly. Be kind. Make kinder choices. Remember, just like happiness, being kind is a choice that must be made every day. Before you act, think about the kinder alternative, and try to make as many kinder choices as you can in your day. An advanced step here would be to find out how you can use your education, expertise and experience to build something that creates a social impact. Sakshi shares more advice to help you find inspiration in your career, along with fellow alumni speakers, in our Webinar series. Words: Sakshi Bansal (Work and Organisational Psychology, 2019) | Edited: Faye Haslam (History, 2012) Build confidence and provide practical tools to utilise now and in the future. Hear top tips for career success from Emma Vites Patel (Psychology and Sociology, 2003), Senior Account Director at LinkedIn. With over two decades of HR experience in multiple industries, Rebecca Khor Ying Ying (Executive MBA, 2020) is the perfect person to share what makes a great HR leader! We take a moment to explore our campuses and discover iconic locations and hidden gems."
        }
    ],
    "pdf_files": []
}