{
    "url": "https://www.nottingham.ac.uk/alumni/a-farewell-from-vice-chancellor-professor-shearer-west",
    "content": [
        {
            "p": "As she hands the baton over to Professor Jane Norman, Professor Shearer West reflects on her seven years as Vice-Chancellor at Nottingham. \"I am sad to be saying goodbye to this wonderful university after an incredibly happy seven years here. \"In many ways, these years have been the most difficult in history for both the University of Nottingham and the UK higher education sector as a whole. It is hard to believe that when I arrived in October 2017, the biggest challenge facing us was Brexit. Although the problems the country has faced since leaving the European Union have not gone away, we have endured many others, including a pandemic, the impact of war in both Europe and the Middle East on our community, and, latterly, the financial challenges that we share with other UK universities. \"However, I would like to focus my final words on some of the things I love about the University of Nottingham, that I am proud of, and that I will miss when I leave. \"First, the university is outstanding at what matters to society: research impact and graduate employability. There are few competitors who have a comparable track record with employers, and our performance in the Knowledge Exchange Framework and the impact assessment of the Research Excellence Framework (REF) demonstrates that we are outward-facing and focused on making the world a better place. Our Zero Carbon Cluster, Rights Lab, Food Futures Institute and Biodiscovery Institute are just a few examples of how well we work across disciplinary boundaries and with industry and the public sector. Given the university’s distinguished history of discovery research and technological advancement, I am immensely proud that the university received its largest ever funding award in 2022 to host the UK’s most powerful MRI scanner as a national facility. \"When I gave my inaugural lecture in 2017, I talked about a vision for Nottingham as a ‘university without borders’. Part of that was about reaching out to the world in the ways I have just mentioned. But I also felt that we had a unique opportunity to expand our influence and impact both civically and globally. I am proud of our special relationship with Nottingham Trent University and local stakeholders through the ‘Universities for Nottingham’ programme, which has yielded many outcomes from the Research England funded Collaboratory to the Green Rewards App and the Student Living Strategy—the last being cited throughout the country as a model for local collaboration for the benefit of students. \"However, in addition to enhancing our outwardly-facing civic role, Nottingham continues to have an exceptional influence internationally - not least through our overseas campuses in China and Malaysia. Both UNNC and UNM have distinctive characters and cultures, but they share the exceptional commitment of their staff and the ambition and pride of their students. It is always a tonic to visit the campuses. \"I was especially pleased to be at UNNC for its 20th anniversary earlier this year, and I am sorry I will be missing Malaysia’s 25th anniversary in 2025. Most recently, the university has been seen as a thought leader in promoting the concept of knowledge diplomacy and the convening role universities can play within an increasingly divisive and turbulent geopolitical climate. I was privileged to chair the Universitas 21 network which is an outstanding collaboration of top research-intensive universities globally. Our alumni throughout the world have always been an inspiration to me, and it is notable how many of them have brothers, sisters, children and grandchildren who are also Nottingham students or alumni. \"In terms of what I will miss the most, I have strong and abiding memories of all 40 mentees, from academic and professional and technical services, who participated in my VC mentoring programme, which was designed to support people with protected characteristics who sought leadership roles. I learned as much from my mentees as they did from me, and I have been impressed by their self-reflections, observations and achievements over the years. As everyone will be aware, I remain a strong advocate for EDI, and I lament the fact that initiatives to remove barriers and enable everyone to succeed have been disparaged by national culture wars arguments. Nevertheless, achieving the first Gold Athena Swan in the country, and being one of the few universities with a Bronze Race Equality Charter are to be celebrated as examples of our enabling and inclusive culture. \"Finally, I will miss the way this university comes together as a community in times of trouble. There is no equivalent I have seen in my career to the spirit of collaboration and partnership that colleagues demonstrated during the pandemic, and the compassion, care and mutual support shown when our students, Grace and Barney, were murdered. I still think of them every day and feel for the pain that their families are going through. \"I would like to thank our incoming Vice-Chancellor, Professor Jane Norman, for her professionalism, commitment and support during the handover period. The university is in excellent hands as it looks to the future. I wish her the best in her new role as interim VC. \"It has been an absolute privilege to work alongside such brilliant colleagues and students and to lead this great university. Through Future Nottingham, there are clear ambitions to build on the university’s strengths. I firmly believe the future of the University of Nottingham is very bright, and I look forward to watching your progress from Leeds.\" Professor Shearer West One of our oldest and most loved halls, take a look round Florence Boot after its year-long refurbishment. Catch up with the best of the news from your university, the alumni community and Nottingham during the course of 2024. Join us for a whistle-stop tour of news around campus and in Nottingham this month - it's graduation season! Catch up with the latest news from around the university in May, including our 1973/74 Golden Reunion and unique running challenge from UNNC!"
        }
    ],
    "pdf_files": []
}