{
    "url": "https://www.nottingham.ac.uk/alumni/introducing-our-legacy-wall",
    "content": [
        {
            "p": "Thanks to a legacy left to the university, the Walled Garden on University Park has undergone a radical transformation over recent months, giving it a well deserved spruce up. It now also includes a new dedicated ‘Legacy Wall’. The wall features plaques that acknowledge supporters’ contributions towards Nottingham and their wider impact on the community, should they wish to be recognised, once they’ve passed away. The garden, located between the New Theatre and Highfield House, is a special place to many, so the nature of the improvements has been subtle and in keeping with the garden’s character. These include improving accessibility, new plants, relocating existing features and seating, creating new seating and refurbishing the wall at the northern end of the garden to create the Legacy Wall. The garden will continue to provide a peaceful, secular space that can be used for contemplation and reflection by the wider university community to support the mindfulness and wellbeing of our students, staff and alumni, while also celebrating the life-changing impact of legacy giving. Every year, October marks Free Wills Month in the UK and if you haven't got around to writing your will yet then we can help. Thanks to our partner, Octopus Legacy, you can write your will online entirely for free. Perhaps you might consider remembering Nottingham in your will? Find out more > A fund originally set up to remember her son, formed the inspiration for alumna Cathleen Bromwich to leave a gift in her will. A love for the East Midlands led a former resident to leave a gift in his Will to Nottingham. Project Period is a scheme that aims to provide free menstruation products for students and staff across the university. Gifts in wills have the power to help talented students unlock their potential by relieving financial burdens and allowing them to concentrate on their academic success."
        }
    ],
    "pdf_files": []
}