{
    "url": "https://www.nottingham.ac.uk/alumni/new-manuscripts-halls-archive",
    "content": [
        {
            "p": "If there's one intrinsic element to the heart of our university it's the halls of residence - many of the buildings are decades old, some even centuries. They have been captured on camera countless times and if there is one thing we know, it's how much you enjoy looking at and reminiscing over them. Thanks to an exciting new project which the team at Manuscripts and Special Collections have been beavering away on, you can now view an entire digital archive of images and documents spanning over 70 years. We caught up with Nicholas Blake to find our more about the archive and also how you can submit your own photos and ephemera to the collection too. Above: Lenton (now Hugh Stewart) Hall in the 1930s. Image reference: MS 854/4/6/2 \"Students develop such an attachment to their halls of residence. It's often their first home from home, and the first time they are independent, living as adults alongside their peers, while still being within a protected environment. \"Each hall has a unique identity, based on its architecture, facilities, location, and even the reputation of its cohort! Within our collections of archives and publications relating to the University of Nottingham we hold material relating to the history of the halls; not just the design and construction of the buildings themselves, but about the staff and students who inhabited them. \"This material came from various sources, including the Estates Department, official photographs, papers gathered from the halls themselves, and donations from alumni. Together it creates snapshots of life within the halls over many decades. Below: The first residents in Nightingale Hall in 1951. Image reference: UMP/4/4/2/5 Check out the photos > \"You can see how culture and society changes for students living in halls over the years. Early group photographs from the 1930s and 40s depict rows of smartly dressed students in suits and ties, which by the 1970s has changed to students in jeans and t-shirts, fancy dress, or sometimes no clothing at all! \"In the 1950s new technology, such as television sets, start being installed in the common rooms (and occasionally stolen). Performances by jazz and folk groups within the halls are superseded by rock bands. Students in the women's halls fight for the right to come and go as they please without question. Eventually mixed-sex halls are introduced, initially as an experiment in 1970, with the final few (including Cripps) not changing until the turn of the millennium. Above: Willoughby Hall in 1964. Image reference: UMP/1/23/28 \"Our new digital galleries, available via NUsearch, aim to give a flavour of the type of material we hold at Manuscripts and Special Collections, digitised and made available for everyone to see. The galleries, one for each hall on University Park, include images of the buildings' construction, promotional photographs from the time, examples of halls publications, and selected articles from the student newspaper 'Gongster' and its successors, 'Bias' and 'Impact'. \"We hope to add and expand to our galleries, though this depends on acquiring more material. We would love to hear from alumni who have digital or physical photographs, publications, ephemera, or memories of their time at the University of Nottingham that they are willing to share with us. In particular we are keen to hear from more recent graduates from a wider range of campuses, to preserve current memories for the researchers of the future.\" Anyone with material they wish to donate, or who would like to visit our Reading Room at King's Meadow Campus, can contact the team via mss-library@nottingham.ac.uk. Nicholas Blake From India to China, Lagos to London, we've been celebrating 25 years of the Business School with our international alumni community. After the Business School appointed a new cohort of Professors of Practice, we spoke to an MBA alumnus returning to campus to share his expertise after 25 years in business Graduates from the University of Nottingham continue to be among the most sought-after by the UK’s top employers, a new study has found. Terry Baines (Chemistry, 1963) and peers from Hugh Stu recently celebrated 60 (and a bit) years since graduating from Nottingham. He shares their story."
        }
    ],
    "pdf_files": []
}