{
    "url": "https://www.nottingham.ac.uk/alumni/alumni-volunteering-on-tour-india",
    "content": [
        {
            "p": "Our autumn networking events kicked off in style with four Nottingham Business Connections events in India during October. Hannah and Emma from our Alumni Volunteering team hosted events in Pune, Mumbai, Delhi and Bangalore, welcoming over 125 of you in total. The events are the perfect opportunity to build your networks, hear from inspiring alumni speakers and catch up with the latest news from Nottingham. We'll be hosting upcoming events across Asia, Africa and North America, so keep an eye on our events listing for the latest updates. Night one saw Hannah and Emma land in Bangalore, with 42 guests joining them. Our speaker was Mayank B Nagori (Food Production Management, 2017), Co-Founder of Gud Gum, India's first 100% plastic-free and natural chewing gum. Mayank shared the highlights and challenges of his start-up journey, including securing a deal on Shark Tank India. The second event was held in Pune, with nine alumni joining staff from Nottingham University Business School for a small dinner. It also gave us a chance to thank our two fabulous International Alumni Ambassadors Shruti Jagdale and Hrishikesh Sherikar (Crop Biotechnology & Entrepreneurship, 2012) - Hrishikesh is celebrating the release of his first book: 'Chronicles of Blooms and Growth,' a fascinating account of the world of plants. Our third event was in Mumbai, where 27 alumni attended. Our guest speaker was Your Nottingham Alumni Award winner Dr Medha Tadpritakar (MBA, 1990), who spoke about her journey as an entrepreneur, developing plastic-to-fuel processes by experimenting with a pressure cooker in her kitchen, just because she wondered if she could! Medha is a TEDx speaker, writer, and entrepreneur, passionate about raising awareness of segregation and the collection of plastic waste. Her efforts have helped collect more than 3.6m kilogrammes of plastic waste across India, converting it into fuel. One guest travelled all the way from Hyderabad (over 700km away!) to reunite with a friend who graduated from Nottingham in the same year. We heard great stories from alumni at the event, including Rahul Rajpurohit (International Commercial Law, 2009) who has written a book: “Introduction to Marine Laws: An Indian Perspective,” which was published by Bloomsbury in February 2023. He spent almost every weekend working on it over the previous 11 years and said the idea came to him when he was studying in Hallward Library. It was then at Nottingham that he started gathering material for the book. Our final event was in Delhi, with 40 alumni joining Emma and Hannah. Our guest speaker was Rajat Shubhro Mukherjee (Public Administration, 2018), a climate action and finance professional. He currently works as a Climate Finance Specialist with London-based development organisation, C40 Cities, where he works with industry to decarbonise logistics - he shared his experiences working remotely for an organisation based outside of India. Another fascinating story from the event came from Mayank Jain (Business Administration and Management 2003), owner of Surabhi International, a jewellery business that Mayank started from a small shop in Beeston and then took back to India! Meet out network of International Alumni Ambassadors across the world and see what events we have coming up near you. Get on your travels > From India to China, Lagos to London, we've been celebrating 25 years of the Business School with our international alumni community. This year marks the 50th anniversary of the opening of the university's Arts and Social Sciences library, Hallward. Find out more about its history and enter our competition! Graduates from the University of Nottingham continue to be among the most sought-after by the UK’s top employers, a new study has found. As she hands the baton over to Jane Norman, Professor Shearer West reflects on her seven years as Vice-Chancellor at Nottingham."
        }
    ],
    "pdf_files": []
}