{
    "url": "https://www.nottingham.ac.uk/alumni/how-we-use-your-information.aspx",
    "content": [
        {
            "p": "Return to our central privacy information You, our alumni, supporters and friends, are extremely important to us. Whether supporting our students from all backgrounds to achieve extraordinary things or contributing to our life-changing research to fight diseases, tackle global challenges and change society, your help makes the incredible happen. We value our relationship with you and would like to send you relevant communications, offering beneficial services, thanking you for your support and sharing future opportunities for providing support which may be of interest to you. To do so, we need to process your personal information. We are committed to protecting your personal information and being transparent about what we do with it. This Privacy Notice sets out how we, University of Nottingham of University Park, Nottingham NG7 2RD (the “University”), telephone number: +44 (0) 115 951 5151 process the personal data we collect for alumni and supporter engagement activities, including volunteering, fundraising and advocacy. We are the data controller for personal data relating to you that we process. We hold a range of personal data about you, the vast majority of which we obtain from you. Depending on your relationship with us, examples of categories of personal data which we may hold are: We may occasionally process special categories of personal data (as defined under article 9 of UK GDPR). We will only do so with the consent of the data subject, or where the data is manifestly public. The data is used for clearly defined purposes (such as recording dietary or access requirements for event attendance). Special categories data will only be retained in the context for which it was originally collected (for example data collected as part of an event response will only be used for that event). If you are a former student, your record will have been created when you graduated (or earlier if you have benefitted from or supported our work). If you are a supporter or friend, your record will have been created when you became involved in our work. As our relationship develops, much of the data we hold is provided by you. For example, when you provide us with updated contact details, change your communication preferences, take advantage of our services, register for an event or support us by making a donation or volunteering. We pay attention to how you interact with us and will record this information. For example, whether you open or click on our emails, your interactions with University-operated social media accounts, and what you visit on our websites. We sometimes obtain information about you from publicly available sources. For example social networking sites, company websites, dedicated business websites (for example Companies House) or publications and articles in the media (for example the Queen’s Honours List), and may use trusted external companies to do this on our behalf. We may analyse the above to create additional information about you. For example, to assess your level of engagement, your likelihood and capacity to donate or volunteer and potential areas of interest for future communications. In general terms, we process your personal data for the purposes of alumni and supporter engagement activities, including volunteering, fundraising and advocacy. We only process data for specified purposes and if it is justified in accordance with data protection law. We use your data to: The HESA survey is a statutory task of HESA to complete and we are required to share information with HESA for the purposes of undertaking the survey. The University also relies on its legitimate interest in contacting students to invite them to participte in the survey to allow us to understand how students are experiencing their learning and teaching and to benchmark ourselves against other institutions to consider via league tables whether the experiences and patterns reported nationally are reflective of our own students’ experience. This processing activity is important for the University as it provides a way of obtaining feedback on programmes, courses, teaching and facilities from a large sample of students. Legitimate interest in providing a robust infrastructure to support the disbursal of Cascade funding (as a related student experience programme). Contractual necessity for successful applicants / projects. The legal basis for processing your personal data in the context of our relationship with alumni and supporters is that it is necessary for the pursuit of our legitimate interests to support our vision to deliver an outstanding student experience, world changing research and a mutually beneficial alumni and supporter community. In addition, there are some tasks which are carried out in the public interest or in the exercise of our official authority, for example the completion of Destinations of Leavers from Higher Education/Graduate Outcomes survey. Within the University, your data is available only to staff who have received appropriate training and have a genuine reason for accessing this information. Staff may include current students who are employed as callers in our telephone campaigns. If you donate and agree to add Gift Aid to your donation, we will share donation details with HMRC necessary to process this claim. We share data with companies processing data on our behalf (for example a mailing house to send our alumni and supporter magazines, or software providers). These companies are carefully vetted and appropriate agreements are put in place to ensure the security of your data. We are required to disclose some personal data of graduates to the Higher Education Statistics Agency (HESA) for the purpose of a survey of new graduates. We may disclose some personal data of graduates to other external agencies for the purposes of participating in recognised benchmarking exercises, including but not limited to the Financial Times' Business Education Rankings or the Economist's MBA rankings. Sometimes to achieve the purposes for which we are processing your personal data we may need to share your personal data with other organisations based outside the European Union. If this is necessary, we will ensure that there are appropriate safeguards in place to protect your personal data. We will never sell your data to other companies or charities. The University of Nottingham also works with suppliers and partners who may make use of Cloud and/or hosted technologies. We undertake data security due diligence on our partners, ensure that suitable contracts are in place and that these partners conform to appropriate accreditations. Wherever these transfers take place, the University will have an appropriate contract in place and there are strict rules regarding the confidentiality and security of your information in place to safeguard it. We will retain your data indefinitely in support of your lifelong relationship with the University or until there is no longer a legal basis for holding it or you object to use of your data for direct marketing purposes. If you have any questions about this notice, please contact the alumni relations team. We will keep this privacy notice under regular review and we will place any updates on this web page."
        }
    ],
    "pdf_files": []
}