{
    "url": "https://www.nottingham.ac.uk/alumni/jordan-buck-the-future-of-fintech",
    "content": [
        {
            "p": "Financial technology is changing the way we handle money - from mobile banking and trading apps, to digital credit and blockchain. Nottingham alumnus Jordan Buck shared his insights as a fintech founder on what the future holds for the sector in our latest Alumni Insights seminar. Fintech companies have attracted $500 billion in funding in the last decade, and the UK has been a major player in the sector. Led by neo-banks like Monzo, Starling and Revolut there are now over 1,600 fintech firms across the country, a number that is projected to double by 2030. The University of Nottingham is playing its part in the sector, too, with a new £1.4m grant awarded by Research England to establish a fintech hub on the university’s new Castle Meadow Campus. Nottingham alumnus Jordan Buck is one of many fintech entrepreneurs in the UK, with his firm Cadro, providing wealth management services for 21st century investors. After cutting his teeth on the KPMG graduate scheme and spending a decade working in private equity in the United States and London, Jordan saw a gap in the market for a modern, digital-first investment firm. “I saw that the industry was doing good things for people – but the other thing I noticed is that it hasn’t really changed in a hundred years. It’s really quite archaic. There’s a younger generation of wealthy people that cannot relate to the traditional wealth managers and want something more digital.\" Jordan co-founded Cadro in 2022, and feels the UK is the perfect environment for setting up a fintech business. “The UK has been very good at Fintech, kind of at the forefront. We've got advantages like the strength of us as a traditional financial services hub; we were excellent at bringing open banking; and the big one this year was the Financial Services and Markets Act, which tries to improve our access to IPO markets and make us an attractive place to regulate crypto. We’ve also got the British Business Bank and tax incentives to promote investment in startups.” And while valuations of fintech companies have gone down in the last 12 months, the sheer potential for scale and innovation in global finance gives him reason for optimism. “Since 2019, a fifth of all venture capital outlay has gone into fintech. Though we're seeing valuations drop significantly, there are obvious economic reasons for that - primarily the end of this low interest rate environment. The whole venture capital industry was, in the main, funded by low interest rates for such a long time, and it meant that you could invest in growth at all costs. So all of a sudden, instead of projects created just to attract users at all costs, we've seen this massive pivot in the fintech market towards sustainable growth and a rush to profitability. We're in this sort of Darwinian state here where the best will survive. But I believe this is actually just a short blip in a long term growth story for fintech, with so much space to disrupt in financial services.” There is huge scope for growth in the sector, especially in emerging markets throughout the world. The rapid growth of mobile payments in China, for example, has seen Alibaba’s fintech arm, Ant Group, come to be worth more than Goldman Sachs. “We've got billions of unbanked or underbanked people in emerging markets, without fairly basic access to financial services, which we all take for granted. So, it’s a hugely attractive industry to go into and to try and disrupt and take market share to. There's lots of fintechs coming up that are looking to be mobile-first, improving financial inclusion, providing micro loans in Africa – there’s lots going on and it’ll be fascinating to see whether the emerging markets will end up being dominated by local champions, by increasingly multinational fintechs, or whether Big Tech will step in and do it for everyone.” With start-ups always looking for fresh talent, Jordan says the sector could prove fruitful for new graduates looking for their professional niche in the financial services industry. “Unlike applying to a massive bank grad scheme at KPMG, I think there's much more scope with fintech startups - at Cadro we are certainly much more open to hiring people from different professional backgrounds. We don't want to just hire a load of people with the same training, same degree, same work experience. So my advice would be: take an interest, do your research and just start messaging founders. You know, message them on LinkedIn - because if they’re potentially early-stage companies, they won't have all of the processes of a big firm, and they want to find new talent.\" Watch Jordan's Alumni Insights seminar in full to hear more on the Future of Fintech, or watch more interesting and engaging webinars via our online Learn Library. If you're interested in hearing more updates and insights from our leading Business School, you can now subscribe to our Connect Business alumni newsletter. Catch up as Kevin (Industrial Economics, 1984), Alliance Senior Partner, PwC UK & Middle East, shares his insights on how to cultivate lifelong learning in our latest Vice-Chancellor's Public Lecture. Covid-19 has introduced new forms of economic risk not experienced by major global economies in living history – risks to production, business continuity and most crucially, supply chains. In May, Jubilee Campus was host to the home leg of our global 25-year anniversary event series. The event brought together leading voices from the Business School community, each providing expert insights on AI, sustainability, and the future of business. Find out they had to say. Marketing graduate and business owner Olivia Swift recently launched a guerrilla marketing campaign challenging the status quo on women's health in the workplace"
        }
    ],
    "pdf_files": []
}