{
    "url": "https://www.nottingham.ac.uk/alumni/day-in-the-life-of-richard-munang-1",
    "content": [
        {
            "p": "Dr Richard Munang (PhD Environmental Change and Policy, 2008) is Deputy Director of the United Nations Environment Programme (UNEP) Africa Office in Nairobi. He shares what a typical day looks like for him. 6.15am: Arrive in the office, review and respond to emails, update my calendar, send final reminders for the day’s activities, and compile notes on key issues that need to be discussed with my team for the day. 7am: Chair the first meeting of the day with my team. Discuss our strategy to provide technical support in getting investment and implementing Nationally Determined Contributions (plans to reduce emissions/build resilience) in pilot countries across Africa. If we share the lessons learned, it will catalyse the development of similar tools across the continent and beyond to unlock employment and wealth opportunities for young people! 7.30am: Head to the café for breakfast. Ideally, herbal tea with egg and a local pastry called 'mandazi'. 7.40am: Get back to the office and push email responses, undertake online and face-to-face meetings with colleagues, state actors, corporates and UN partners across Africa and globally. Work until 2pm before breaking for a light lunch. 2.30pm: Field visits to engage ground actors, especially youth, that are taking up climate and environmental science in an enterprising way and generating empirical data on key success factors to inform policy prioritisation. 4pm: Back to the office, debrief with my team and review the day, and outstanding aspects to be prioritised. Of course, more emails, including responding to the UNEP representative for Africa asking me to foster partnerships with one of the largest telecoms companies in Africa for collaborations to lower their carbon footprint and invest in greening their supply chain. This calls for a clear demonstration of economic value and I’m glad they’re excited to work with us! Finish at 5.45pm. 6.15–9pm: Personal moments: play some basketball with my daughter, do some dancing, prepare supper, retire to bed. Richard shares more advice on careers in the green sector, along with fellow alumni leaders, in our Questions for leaders series. Edited: Lily Fairless Learn how to improve your resilience by reimagining failure with insight from our latest Live talk speaker Alexander McLean (Law, 2007). We meet Anmarie Spaziano (Sociology, 2002), founder of Annie’s Burger Shack, to find out about her journey from a small pub kitchen to owner of one of Nottingham’s most popular restaurants. In conversation with alumni Preet Grewal (Production Engineering, 1988), Roy Twite (Production Engineering, 1988) and first-year Chemical Engineering student, Rene-Ioic Betek. There comes a point in any job when you feel ready for the next challenge. So how can you take action to ensure progression? Our resident jobs expert Sue Mason, from the NUBS Postgraduate Careers team, shares her advice with five steps you can take to advance your career."
        }
    ],
    "pdf_files": []
}