{
    "url": "https://www.nottingham.ac.uk/alumni/closing-the-csr-gap-with-phoenix-zhang",
    "content": [
        {
            "p": "Phoenix Zhang (MBA 2016) has spent over two decades driving change in corporate social responsibility (CSR) and sustainability. As the Founder and Managing Director of CSR Solutions Limited, a social enterprise based in Shenzhen, her mission has been to create fairer, more ethical business environments around the world. CSR Solutions offers a range of services, including sustainability reporting, carbon footprint assessments, and supply chain management, helping businesses make real, long-term changes towards a better, more sustainable future. “As members of the global community, businesses must embrace their role in creating a sustainable future for people and planet alike,” says Phoenix. “People often think sustainability is costly, but when integrated properly, it’s an investment in the company’s future.” This holistic approach has seen CSR Solutions help companies like Volkswagen, BMW, and Walmart create more ethical and resilient supply chains. Phoenix’s interest in CSR began in the early 2000s, when she worked at an electronics factory in China and saw the harsh conditions workers faced. But her journey as a social entrepreneur really began after studyingher MBA at Nottingham University Business School. With a strong CSR focus, the MBA programme provided her with not only business acumen but also a deeper understanding of how to integrate sustainability into core business strategies. \"Going to university was the best choice I have made to upgrade my qualifications and experience,\" she says. \"There are so many heartwarming memories: the courses, professors, classmates, school life, and the freedom to explore new experiences.\" “Studying at the University of Nottingham opened the door to so many opportunities for me in Europe and the US. The connections and relationships I made have led me to designing sustainability strategies for brands in Europe and the US, and working alongside universities in the UK on sustainable supply chain workshops.” Having worked extensively in both Europe and Asia, Phoenix understands the different approaches to CSR in these regions. \"There’s still a big gap in CSR practices between Europe and Asia,” she explains. “Europe has been developing its economy since the Industrial Revolution, while many Asian countries are still in the developing process, making the same mistakes Europe made in the past. Although some parts of people are awakening, it has a long way to go – most businesses in Asia are still focussed on survival, not implementing sustainability practices.” Her work involves helping these companies bridge the gap by developing practical, region-specific solutions that align with global CSR expectations while addressing local challenges. Phoenix is passionate about showing that sustainability can drive innovation and long-term growth, and has delivered keynote speeches on the subject at the recent Green Supply Chain Summit in Shenzhen, as well as at international institutions like Copenhagen Business School and the University of Southampton. Looking ahead, Phoenix sees several trends reshaping CSR. “Mandatory sustainability reporting is becoming the norm, and businesses need to be transparent,” she says. She also highlights the growing importance of climate action plans and carbon neutrality targets as governments and consumers demand greater accountability. “With rising awareness in the younger generations especially, businesses that don’t take sustainability seriously will struggle to stay competitive in the coming years,” Phoenix warns. “The demand for sustainable investment and cleantech will be a big focus of the future of business.” And it’s the younger generation that Phoenix says will shape the future – just like they always have. She encourages aspiring CSR professionals to join relevant groups or associations, attend workshops on the subject, and seek out volunteer opportunities to gain experience and build their networks. “Young people, particularly university students, have been a driving force behind the CSR and sustainability movement for decades. Students were among the first groups to engage with ethical codes of conduct during that time. If I were to offer advice to current students or recent graduates looking to get involved in a career in CSR, it would be this: do it, follow your heart, and make your voice heard.” A brand new eight-week programme led by NUBS experts gives you the chance to unleash the full potential of every member of staff in your organisation. We were delighted to welcome Caucher Birkar (Mathematics PhD, 2004) back to campus this winter to award him a richly deserved honorary degree. Drawing from his award-winning book, 'Double Your Price', Prof. David Falzani shares his top tips for avoiding the #1 mistake budding entrepreneurs make when it comes to pricing. Financial technology is changing the way we handle money - from mobile banking and trading apps, to digital credit and blockchain. Nottingham alumnus Jordan Buck shares his insights as a fintech founder on what the future holds for the sector."
        }
    ],
    "pdf_files": []
}