{
    "url": "https://www.nottingham.ac.uk/alumni/support-us/volunteer/work-placements-and-internships.aspx",
    "content": [
        {
            "p": "Offer a work placement to a Nottingham student and bring benefits to your organisation. As one of the UK's most targeted universities by graduate employers, our students have become renowned for their creativity, tenacity and can-do attitude. We're connecting with a variety of employers and organisations to provide our students with a range of work experience, all of which can bring benefits to your business. Enhance your organisation with new ideas, fresh enthusiasm and up-to-date technical skills. Complete projects that may have been postponed due to a lack of resource. Raise your profile in graduate recruitment networks. Source potential future recruits, with the work experience period acting as an extended interview. Take a look at our schemes, hear from previous employer partners and consult our FAQs to find out more. If you can offer in-person or virtual placements to current undergraduate or postgraduate social sciences students, complete the form below and we'll be in touch for a scoping conversation. Sectors: Students on this scheme are particularly interested in gaining experience in: We offer placements which form both part of a specific taught module, or more extra-curricular options. Register your placement by emailing the Faculty of Arts Placements Manager, Hayley Revill on the button below. We caught up with provider Matthew Lax (Music, 2003) and student beneficiary Ken Zheng, who undertook a 60 hour placement module in early 2024 at Matthew's workplace Synfonia Viva, the Orchestra for the East Midlands. Read more > What is the minimum/maximum duration of a placement/internship? At the university we offer placements of varying durations, including short 35-hour work experiences and projects, two to eight week internships, as well as placement years. The placement year is a minimum of nine months in duration, typically up to 12 months, and is full-time. The shorter duration projects and internships can be full-time during vacation time, or part-time with a view to students undertaking these alongside their studies. Please contact us via the forms above to discuss your ideas for a placement/internship and we can check which opportunity would fit best with what you would like to offer. Do I need to pay a salary/hourly rate? Yes, ideally you will pay a salary/hourly rate to the student working with you. However, there are instances where this would not be required, for example if the work experience or project is linked to an academic or Nottingham Advantage Award module offered by the university, or where the university provides a bursary through one of our employability schemes. We can discuss this further with you. Charitable and volunteering organisations can also be exempted and can offer volunteering-only opportunities. Are there any costs for advertising for interns? No. This is cost-free, other than the time invested to write your placement vacancy advertising copy. You can advertise on the university vacancy portal for free. Once you've registered your details above, your placement contact at the university can provide more information. Do I need employer liability insurance? Yes. You should treat the placement student the same as one of your employees or volunteering staff so all legislation concerning insurance and health and safety at work needs to be in place for the work experience/placement. Does the placement/internship need to be in-person or working from home? The placement or internship can be in-person, fully remote-working or a hybrid/dynamic approach. Wherever possible we would recommend that at least some time is spent in the office/on site so the student can experience the working environment. What supervisory responsibilities will I/my company need to provide? Your placement student will require a named contact to act as their supervisor throughout the placement. This person should be responsible for the student’s induction, and be a point of contact for any questions they may have as their placement progresses. The supervisor does not necessarily have to be the student’s line manager/overseeing their work. Do I need to complete a risk assessment? Yes, for most of our placements we will ask you to support us in completing a risk assessment and check of the placement student’s health, safety and well-being on the placement. What type of projects could the student work on? This can be very wide-ranging. In the past, students have worked on consultancy-type projects (working on real-life issues employers would like support with) or have undertaken specific roles within a named department in the business – for example in fundraising, research, event management, special project work or marketing. Students in the Faculties of Arts and Social Sciences have a wide array of transferable skills which means they can take on a broad range of tasks. Many of our students also possess specialist skills such as language skills, archiving, film-work and digital media, GIS skills, legal training, mentoring and counselling, quantitative data research and analysis to name but a few. Do the students receive any induction or training from the university prior to starting their placement? As a placement host, you can specify any essential or desirable criteria for the student you wish to ‘hire’ and we recommend you discuss specific skills/experience or languages during interviews, where applicable. If your student is to be allocated by us, we will do our best to match your requirements. Most schools will provide students with a pre-placement workshop, in which they will cover general placement skills and behaviour – such as communication, professionalism, troubleshooting, confidence building and confidentiality. The university will also check-in with students during their placements for safeguarding purposes and to pre-empt any issues. Can we ask interns to sign confidentiality agreements/NDAs? Yes, this is customary practice from many of our placement partners. What training will I need to provide to the student? Your placement student will need an induction to the company, and basic training and guidance to ensure they can complete the tasks they have been given. Naturally, this does not have to be to the same extent you would train a new permanent employee, but it is useful for students to understand that much of their future professional development is likely to be ‘on the job’ and for them to feel confident they can complete their tasks to expected standards. What do I do if an intern/placement student is not working out? In the first instance we always recommend that placement providers speak openly to the student and provide constructive feedback. Many issues can be fixed quickly and simply via open dialogue. If the issue at hand does not improve, please reach out to your placement contact at the university for advice. If the problem is ultimately not solvable you are entitled to give notice and terminate the placement, but this is always considered a last resort and is extremely rare."
        }
    ],
    "pdf_files": []
}