{
    "url": "https://www.nottingham.ac.uk/alumni/careers-networking",
    "content": [
        {
            "p": "Networking can feel a bit daunting at times, but it’s one of the best ways to uncover hidden job opportunities and grow your career. In this article, our resident careers expert Sue Mason shares ten simple yet powerful tips to help you network like a pro. Whether you’re chatting with friends, attending industry events, or diving into online communities, these tips will help you build valuable connections and maybe even land your next big role. We all know that networking is the process of interacting with others to exchange information and develop professional or social contacts. Have you used networking for jobs? Advertising jobs takes up a lot of time and money for employers, so many jobs are filled by networking. It is also a great way to find out about a particular career and whether you might like it. You can network with anyone. You could start by talking to people you already know about their jobs and who they know. Once you start, you will be surprised at how quickly the list of people you know will grow. A good way to network for jobs is to: When asking your network for help, ask them in person, if possible, but if not, send an email or message. Start with a friendly greeting, then explain clearly what it is you are asking for, giving them a brief context, and any specific information they may need. The easier you make it for them to help you, the more likely they are to do it. Say if it is time-critical and always offer to help them in return. If you do approach someone for a speculative job and it doesn’t work, don’t worry, everyone gets knocked back at some stage. They may be pushed for time or not hiring at the moment. Thank them for their time and ask if they can recommend anyone else who might be able to help. Think about how you can learn from the experience and improve your approach for future opportunities. Don’t worry that you need to be a very outgoing person, you can continue to be yourself, but make sure you are enthusiastic and interested in any career you are finding out about. You never know when a contact could come in handy. You may find someone you know on your next interview panel, or they may have heard of your good reputation in the industry. If you would like some help with networking, or any other careers-focused advice, the Business School Postgraduate Careers Team is here to help! You can contact us on: businesspcs@nottingham.ac.uk. And we're delighted to have partnered with CareerSet to give you access to a brilliant new careers tool, free of charge. Tailor your CV and cover letter for each job and optimise your LinkedIn profile with CareerSet. Don't forget the university's Careers & Employability Service is available at all stages of your career too. Sue Mason, Post-Graduation Careers Consultant, Nottingham University Business School Managing Director of renowned advertising agency adam&eveDDB, James Rowe (Geography, 2009) shares the secrets of Christmas TV adverts! There comes a point in any job when you feel ready for the next challenge. So how can you take action to ensure progression? Our resident jobs expert Sue Mason, from the NUBS Postgraduate Careers team, shares her advice with five steps you can take to advance your career. MSc Marketing alumna Vanja Ljevar volunteered as a project sponsor for the Business School's Company Consultancy Challenge this summer. A brand new eight-week programme led by NUBS experts gives you the chance to unleash the full potential of every member of staff in your organisation."
        }
    ],
    "pdf_files": []
}