{
    "url": "https://www.nottingham.ac.uk/alumni/newsandevents/index.aspx",
    "content": [
        {
            "p": "Keep up to date with your alumni community. Catch up with the best of the news from your university, the alumni community and Nottingham during the course of 2024. Managing Director of renowned advertising agency adam&eveDDB, James Rowe (Geography, 2009) shares the secrets of Christmas TV adverts! Our Alumni Volunteering team have been busy bees this month, with a host of alumni volunteers sharing their time too. Nottingham is the top-ranked university for graduate careers according to Graduate Outcomes provider, HESA. A brand new eight-week programme led by NUBS experts gives you the chance to unleash the full potential of every member of staff in your organisation. Share your passion and expertise for sustainability by volunteering for new UK-wide Climate Ambassador Scheme! Our Professor of Political Science, Dr Todd Landman shares the story of how Donald Trump has become only the second US president to be re-elected As she hands the baton over to Jane Norman, Professor Shearer West reflects on her seven years as Vice-Chancellor at Nottingham. Catch up with our series of events in India during October, as our Alumni Volunteering team hosted gatherings in Pune, Delhi, Mumbai and Bangalore. Take a trip back in time with a brand new archive of halls photography from the Manuscripts and Special Collections team. Phoenix Zhang (MBA 2016) has spent over two decades driving change in corporate social responsibility (CSR) and sustainability. As the Founder and Managing Director of CSR Solutions Limited, a social enterprise based in Shenzhen, her mission has been to create fairer, more ethical business environments around the world. Join Katie Moncur (English, 2020) as she shares the secrets of her role as Social Media Officer for Historic Royal Palaces. Hazel Mann, Biosciences alumna and Procurement Manager at JLR talks about working with Business School students over the summer. Sauce Shop co-founder James Digva (Food Science, 2007) shares his journey from market stall to supermarket aisle. Learn how to improve your resilience by reimagining failure with insight from our latest Live talk speaker Alexander McLean (Law, 2007). Networking can feel a bit daunting at times, but it’s one of the best ways to uncover hidden job opportunities and grow your career. In this article, our resident careers expert Sue Mason shares ten simple yet powerful tips to help you network like a pro."
        }
    ],
    "pdf_files": []
}