{
    "url": "https://www.nottingham.ac.uk/alumni/building-your-professional-brand-with-emma-vites-patel",
    "content": [
        {
            "p": "Since leaving the University of Nottingham, Emma Vites Patel (Psychology and Sociology, 2003) has dedicated her career to helping young people and graduates develop their personal and professional lives and find their dream jobs. She is the author of The Graduate Bible and founder of The Apprentice Project, both designed to teach young people and graduates about how to succeed in the ever-competitive jobs market. She currently works as a Senior Acount Director at LinkedIn, where she has worked for over a decade in their London, San Francisco, and New York offices, where she now resides. We asked her for her top tips for professional success, on Linkedin and beyond. Developing a strong personal and professional brand is critical in today's competitive job market. So how do you do it? First, you've got to start with the end in mind, and you've got to get clear on what it is that you actually want, and how you can add value. To do that you've got to ask yourself a series of questions - I write about this in my book, The Graduate Bible - but really it means getting very clear on what it is that you're good at, what your strengths are. A great way to do this is to write down what you believe your strengths are, and also to ask people that know you what they think your strengths are, as well. And then you can fill in the gaps with learning. Then after you've done that you've got to set out some goals for your career - what do you actually want to achieve five years from now, ten years from now? Again start back, start with the end in mind from that and then also get clear on your values. What do you value and why? And then you can start your LinkedIn page, and start building your professional network, and connect with everyone you meet. So start with friends, family and then go to your university or your college and really start linking in with your peers and your lecturers and people that you did clubs with and extracurricular activities. And you're going to network, network, network - even the person that you meet on the plane, add them to your profile, stay in touch. And that's how you get started! Some of the most common mistakes that I see graduates and young people make on LinkedIn is that they don't fill out their profile properly. So you must make sure that you fill out every single section on LinkedIn. Number two, they use a very unprofessional looking profile picture. And with now with AI, it's so easy to have a really good photo with a white background - so make sure you use it. And number three, they're not showcasing their skills. 75% of employers have said that they're moving to skills-based hiring, so you must make sure that all of your skill sections are completed on LinkedIn - and that’s soft skills and hard skills. The top three soft skills that you need are communication skills, emotional intelligence and adaptability. So how can you improve all of them? With communication skills, I advise you to really practice active listening and asking open ended questions, and really to do as much public speaking as you possibly can. And then with emotional intelligence, I write a whole chapter on this amazing tool called IMA, which stands for Identify, Modify and Adapt - so make sure you read The Graduate Bible and complete the questionnaire to learn all about it. And the third one, adaptability: you've really got to be curious and have a growth mindset and a passion for learning to succeed in today's rapid world and pace of change. So interestingly, not all skills are developed from work experience, so think about other things that you've done in your life that have contributed to different skills. Whether that's problem solving, or leadership, or communication. It could be internships that you've been involved in, or projects that you run at university or college, or volunteering - even helping that older couple that needed your help during Covid. So what you were doing was you would developing skills during all of these different times, and then you get to add them to your LinkedIn profile, and you're going to showcase your projects and your work, and you're going to add images and links and when you're ready, complete your profile as much as you possibly can. And then you're also going to seek out learning - there's lots of free resources out there that you can use, like LinkedIn Learning, and gain certifications that you can add to your profile. In the second of our series, we meet Emily Seto (Clinical Microbiology, 2016), a Planetary Protection Engineer at NASA's Jet Propulsion Laboratory. In conversation with alumni Preet Grewal (Production Engineering, 1988), Roy Twite (Production Engineering, 1988) and first-year Chemical Engineering student, Rene-Ioic Betek. We caught up with Marie as she received her honorary degree in December for her insights into the profession and to discuss how the industry has changed. Almost 1,000 of you generously shared your time and expertise as volunteers over the last academic year. We're celebrating this Volunteers' Week – and see some of our upcoming opportunities."
        }
    ],
    "pdf_files": []
}