{
    "url": "https://www.nottingham.ac.uk/alumni/careers-in-the-green-sector-your-questions-answered",
    "content": [
        {
            "p": "Thank you for submitting your questions for our alumni leaders working in the green sector with experience spanning digital marketing, policy, sustainability, climate change and social enterprise. Read on below to find out how to stand out in the recruitment process, deciding on your specialism, growth markets in the sector and the best way to get into the sector itself. Dr. Richard Munang (PhD Environmental Change and Policy, 2008) - Africa Regional Climate Change Coordinator, UN Environment Programme (UNEP) Connect with Richard on LinkedIn From my experience, standing out in recruitment comes down to 4 key aspects – competence, versatility, innovativeness, and passion. These attributes draw from one core fundamental – clarity of vision. What vision do you have of the career and, more specifically, the job you are eyeing? What change do you want to see? How will that change you desire to see provide benefit to humanity? How will it be delivered in an enterprising dimension or a way that generates economic value? Once you have the above figured out, you will come out as genuine and bring value to the table of whoever you will be interviewing for. So take the job you are applying for as a personal business and look to offer value and achieve a vision, don’t look at what you are getting back. I grew up seeing crop failure and the devastation it caused us as a family. Over time, community, province, country and later the entire continent and how to resolve this was the source of passion. I never envisaged working for the UN. I, however, had a clear vision of what I was passionate to do – devising solutions to productivity in key sectors of economies – in this case, the agro-value chain, which cuts across nearly all sectors of economies. And climate change was what stood at the door as both the risk multiplier and an opportunity for solutions. I came across an online advertisement for jobs in this area in the UN. I applied initially for a very short assignment and passionately applied to offer value towards the clear vision I had long before I applied for the job. As far as tips – refer to my answer in point 1. The key is clarity of priorities on both sides. If the environment and inclusive accelerated development are the primary priority, there will be no “dirty” manufacturing to export. If fidelity to the Paris Agreement is the priority, there will be no “dirty” manufacturing to export. Megan Stilwell (Psychology, 2018) - Digital Account Executive, Greenhouse Agency Follow Megan on Twitter or Instagram Hi Milly, thanks for this brilliant question. I’m going to do that annoying thing and say that I don’t think there is ever a right or wrong way to gain experience. If you have the opportunity to focus on something you’re passionate about, like you’re doing in-house, that’s great! If you were to go to an agency, I’m not sure you’d get the right experience to work on CSR strategy specifically, because you’d be focussing on communicating to consumers or businesses as opposed to working on internal comms which is different. If you’re enjoying what you’re doing, stick with it, it’s so important to enjoy your work as it takes up the majority of our time. Hi Adam, it’s lovely to hear from you. I knew that I wanted to work in sustainability, but l honestly had no idea how to work my way into the green space. So I spent many many months searching for an environmental group to join and I attended as many sustainable events as I could, as well as training online too. Basically, I wanted to create a network of people in the green industry who would be able to signpost me to where I needed to go. So at every event, training session, web forum that I got involved in I asked to connect with people on LinkedIn or via email. Eventually someone directed me to a social enterprise, called Catalyse Change, and through their summer camp, I got an internship. My top tip would be to connect with anyone you meet in sustainability and then ask them if they can put you in touch with more people…the snowball effect is brilliant! Hi Scott, thank you for questions. This is quite a complex issue, which I’m not expert on. But to answer your first question. I think that our perception of how much food costs has been skewed by agricultural subsidies, mass production and processing, to the point where we don’t understand the true value of items. This is also evident in the fashion industry. I think the government could tax unsustainable and unhealthy products, to encourage people to purchase more sustainable and healthier products, in a similar way tot the sugary drinks tax. I’d have to see a specific example of legislation having been bypassed by importation to answer this question. However, in terms of importing produce, this can actually be more environmentally sustainable. Take the often used example of the tomato. A tomato grown in the UK off-season, requires a specific temperature-controlled environment that is energy intensive. Whereas, a tomato grown at the same time of year, in a country that is warmer than the UK, wouldn’t need a manufactured environment and would be more energy efficient even after importation. Sabrina Chiaretti (MSc Sustainability, 2016) - Air quality analyst, Department for Environment, Food and Rural Affairs Follow Sabrina on Instagram or connect with her on LinkedIn I stumbled across this very specialised career path. I had always wanted to specialise in the climate change field, but in my past role I was assigned more and more responsibilities that dealt with air quality and transport, and once I learnt about the air pollution crisis, I couldn’t ignore it anymore, and I have now been working in air quality for 3 years. I learnt things on the job, my climate and sustainability degree did prepare me for this environmental role only to some extent. The private and public sector are very different, and so is your role. Finances are among the main drivers in the private sector, in the public sector there is a much bigger purpose beyond every role. My main tips: before applying, think about whether you like the role and the organisation, how they can make you grow personally and professionally. Research your employer and their competitors. Finally, a career in sustainability and climate is a career with a purpose, and those who work in the sector often live and breathe sustainability values in their private life, if so that is definitely and advantage, and something you want to show when you apply for a role. Tabitha Wacera (MSc Sustainable Energy Engineering, 2016) - Founder at Storehouse (formerly Sustainable Water) Connect with Tabitha on LinkedIn I do have international teams based in Kenya with plans to develop others in other countries. The right partners are those you trust. Personally, it has to be someone I have worked with before and can vouch for their work in those countries. Secondly, I like to have a known contact in a country before we engage any company or team. Charities: It depends on your vision. My vision is to solve the water crisis. Consequently, I only work with UK charities that share the same vision and want to solve this problem sustainably in developing countries. When I am looking at growth opportunities, I look at policy as well as general trends in the energy market. Since decarbonization is one of the major shifts, the next two are decentralization and digitisation. We have already gone green and decentralised with the introduction of renewables to the current energy mix. The biggest challenge and opportunity still remains in digitisation of the grid and consequently job opportunities will be there. There's a need for engineers who are both comfortable in the software and the hardware. Learning programming languages which are geared towards solving energy problems will be an asset. That carbon economies are not the only template for development. If developing countries followed the same exact development template that developed countries followed, the global warming temperature will reach 2 degrees in no time. Since the trend in developed countries is decarbonisation of the energy mix, developing countries don't have to make the same mistakes. They can start building green economies from the get go. Building sustainably is foundational, it is not an additive to our marketing because it is the current thing. In conversation with alumni Preet Grewal (Production Engineering, 1988), Roy Twite (Production Engineering, 1988) and first-year Chemical Engineering student, Rene-Ioic Betek. Fast-track your career with IJ Samuel's top tips. Almost 1,000 of you generously shared your time and expertise as volunteers over the last academic year. We're celebrating this Volunteers' Week – and see some of our upcoming opportunities. With over two decades of HR experience in multiple industries, Rebecca Khor Ying Ying (Executive MBA, 2020) is the perfect person to share what makes a great HR leader!"
        }
    ],
    "pdf_files": []
}