{
    "url": "https://www.nottingham.ac.uk/alumni/inclusion-in-the-post-covid-workplace",
    "content": [
        {
            "p": "Working from anywhere has become commonplace globally. The dramatic workplace changes introduced in response to Covid-19 have provided organisations the opportunity to reset team dynamics. This major shift can, and should, also serve as a catalyst to embed more inclusive practices and more effective leadership skills. However, an inclusive work environment does not just happen; it requires sustained effort. In this seminar we discuss how such an inclusive environment can be created, especially in a hybrid mode of working. Dr Andri Georgiadou is an Associate Professor at Nottingham University Business School and the Director of the Equality Inclusion and Diversity Centre. Her research focuses on equality, diversity, and inclusion at work from relational and interdisciplinary perspectives. Dr Georgiadou sits on the Editorial Board of the journal of International Studies of Management & Organization as the Review Editor and is an Associate Editor for Gender Work & Organization. Her work has led to publications in leading peer-reviewed journals, such as Human Resource Management Journal, Gender Work & Organization, and European Management Review among others, and several book chapters. This recording is from our Nottingham University Business Alumni Insight Seminar series. Keep up to date on the latest NUBS alumni events. Speaker: Dr Andri Georgiadou, Associate Professor at Nottingham University Business School NUBS Deans Professor David Park, Professor Kok Wei Khong and Professor David Goodwin reflect on the business environment and how NUBS is looking to the future. If you can innovate, and spread innovation in health care, you can innovate anywhere. Cadro co-founder Jordan Buck (Geography, 2009) discusses his experiences starting a fintech company and shares his thoughts on the latest themes in the sector. In this session learn more about NUBS's unique new programme to help businesses prepare for a digital future from Dr Andrew Callaghan."
        }
    ],
    "pdf_files": []
}