{
    "url": "https://www.nottingham.ac.uk/alumni/january-take-5",
    "content": [
        {
            "p": "In January's Take 5 we have a frozen Highfields Lake, a new theory of evolution, the first in-person event of 2024, news about our half-term swim school at the David Ross Sports Village and tributes are paid to a dedicated university professor who passed away last month. Also, see if you can work out our mystery location on campus, taken in just the two photos. It's been quite the month of weather across the UK and especially in Nottinghamshire. In the first half of January intense rainful meant much of the county was subject to flooding, with the River Trent reaching levels not seen for almost a quarter of a century. Then Winter truly arrived in Nottingham just a week or so later, with temperatures well into the minus figures. It did lead to some beautiful scenery on campus, however, including a frozen Highfields Lake, captured expertly by your alumni team! Do you remember any particularly snowy winters when you were at Nottingham? Why not send us your photos? Tributes have poured in for Professor Brian Tuck, who worked at the University of Nottingham for over 30 years. He died at the age of 83 on Sunday 17 December last year. Professor Tuck joined the university in 1968, and went on to become head of department in 1988. He held the role for ten years before moving to Malaysia to establish the university’s first international campus, where he also headed a department until his retirement. Read more about Professor Tuck > We're already underway with our 2024 alumni event progamme, after touching down in Chile for a special reception with President and Vice-Chancellor Professor Shearer West at The Residence of the British Ambassador to Chile earlier this month. Around 100 guests joined us at the reception, which was held as we develop new and exciting projects with partners in Chile, such as the newly launched Clean Energy Project. What next? We have events across Africa in coming weeks, including in Lagos, Cape Town, Nairobi and Johannesburg. Check out our upcoming events > A groundbreaking university study has found that evolution is not as unpredictable as previously thought, which could allow scientists to explore which genes could be useful to tackle real-world issues such as antibiotic resistance, disease and climate change. The study, which is published in the Proceedings of the National Academy of Sciences (PNAS), challenges the long-standing belief about the unpredictability of evolution, and has found that the evolutionary trajectory of a genome may be influenced by its evolutionary history, rather than determined by numerous factors and historical accidents. Read more > February Half-Term Swim School will run from Monday 12 February to Friday 16 February at our state-of-the-art David Ross Sports Village pool. Once again there will be 1-2-1 or group lessons available to book onto, with opportunities open to the whole family with children's and adult lessons available. Our half-term lessons are the perfect opportunity to improve swimming skills regardless of current swimming ability with options open to varying levels. The flexibility also exists to book a block of lessons or if you'd prefer, book pay-as-you-go sessions. All of our lessons are delivered by our fantastic, knowledgeable swimming instructors within our fantastic swimming complex, providing a fun, friendly and safe learning environment. Find out more > Huge congratulations to our alumni recognised for their achievements in the King's New Year Honours earlier this month. June saw the opening of our state-of-the-art Power Electronics and Machines Centre (PEMC) on Jubilee Campus. After the Business School appointed a new cohort of Professors of Practice, we spoke to an MBA alumnus returning to campus to share his expertise after 25 years in business"
        }
    ],
    "pdf_files": []
}