{
    "url": "https://www.nottingham.ac.uk/alumni/sir-john-sawers-life-after-mi6",
    "content": [
        {
            "p": "Over his 36-year career, Sir John Sawers (Physics and Philosophy, 1976) held many of the most senior positions in the foreign affairs, diplomatic relations and national security fields, culminating in five years as the Chief of MI6. But life after “C” has been far from quiet for John, from establishing his own company, Newbridge Advisory, to board roles, pro-bono work and visiting professorships. As John returned to campus last month to deliver a guest lecture to an audience of students and alumni on security and intelligence in today’s world, we asked him how he has taken his career in new directions and how he uses his expertise in his roles today. \"In my last year at MI6, I was able to talk to a variety of people about what I could and should do next. When you step outside of government service, you’re much more of an individual actor. You can work on things which are important to you personally, with people who inspire you and on issues which you feel you can in some way make a contribution. So that’s what I focused on. \"My experience was in dealing with geopolitics and international security issues, so I couldn’t suddenly switch and became an expert in something completely different. But I feel I have a lot of space to work in the way I want to work and I feel I am still making an impact.\" \"It’s an important question and one which I was concerned about when I left government. In government, I had a plethora of information coming to me, a lot of which was very specific and relevant to the issues that we were dealing with. When I was working in Number 10 during the Kosovo conflict, for example, I felt I knew every village in Kosovo because you needed to understand the dynamics of what was going on. \"When you step outside, people are less interested in that level of detail. When I first left MI6, I was Chairman of Macro Advisory Partners before setting up my own company, and I learned a lot in that time about the different requirements of advising in the private sector compared to being in government. What people look for in business is the broad political risks they may face in a given country or region, and they want to draw on my experience, my feel for issues and my judgement. \"What I find in my present role is that it’s not the same deep dive as before. What I need to identify now are the big picture trends because that’s what my clients or the media are interested in. They want to know about the direction of relationships between states, for example, and how investors and companies fit into that. \"Companies know their business vastly better than I do, but what they want to understand is the geopolitical risk framework is in which they’ll be operating and how that is likely to change. A lot of the investments they’re making are for 10, 15, 20 years so understanding how things might change in that period is important. I’m not a crystal ball reader, but I have some sense of the dynamic of where the tensions are going to come in and where the pressure points might be.\" \"I spend one to two hours first thing in the morning, just reading what’s going on across the various news outlets and online, absorbing a lot of information at the beginning of the day which I can then discuss in more in-depth conversations through networking with others. \"I’m fortunate as it is quite easy to follow developments in international relations. If you’ve got a specific skill set, how do you then keep that up to date? It’s a different sort of challenge, but I think for all of us, you have to invest time on a daily basis, on a monthly basis, on an annual basis, to keep yourself on top of your discipline, of your area of expertise. I find that for me, doing a daily top up is the best way.\" \"Obviously, it’s not as responsible as when I was in government working with ministers on decisions of national importance. I sometimes miss that. But the people I work with now also take my advice seriously and it’s reflected in their business and investment decisions, so I feel a certain responsibility there. It’s rewarding because of the quality of the people I work with – and it is important to me that I am free to choose who I work with. \"The other great thing when working with think tanks and universities is that I have the opportunity to spend time working with the younger generation, who I find much more inspiring than I’m sure I was when I was in the younger generation! I find it very rewarding as well.\" \"One of my highlights undoubtedly was when I was in the embassy in South Africa when Nelson Mandela was released after 27 years in prison. I remember cycling into the centre of Cape Town the evening he was released and listening to his speech in the main square. \"But then the following morning, I got a call from one of my contacts who told me to go to Archbishop Tutu’s residence because Nelson Mandela was speaking to a small group of people there. I rushed round, and there indeed was Nelson Mandela just starting a conversation with around a dozen or so others, and I remember watching in awe. \"As it came to a close, I realised I had a chance to speak to Mandela myself, so I had to quickly invent a message from the British government, the British people. He was so warm and welcoming. I felt I was the only person in the world for him for 20 or 30 seconds. He was such an inspiring figure, and it showed to me the importance of individual leadership and individual qualities.\" If you are inspired by John and are looking for some further advice or practical tips, why not check out our webinar back catalogue? Find out more > We caught up with alumni Paul Gurney to hear how he applied his background in sustainability to build a business with a strong social purpose, BecomingX's approach to social responsibility, and his journey as an entrepreneur committed to making a positive impact. We caught up with Marie as she received her honorary degree in December for her insights into the profession and to discuss how the industry has changed. In conversation with alumni Preet Grewal (Production Engineering, 1988), Roy Twite (Production Engineering, 1988) and first-year Chemical Engineering student, Rene-Ioic Betek. Meet Sally Barton (Maths, 1978), who recently was bestowed the accolade of being the world's oldest professional cricketer at 67 years young!"
        }
    ],
    "pdf_files": []
}