{
    "url": "https://www.nottingham.ac.uk/alumni/community/your-nottingham-alumni-awards-nomination-information.aspx",
    "content": [
        {
            "p": "Our awards celebrate your amazing contributions and share the stories of how you carry Nottingham's values into the world. Find out more about the Awards and take a look at our tips for completing your nomination. The term alumni refers to anyone who studied a term or more at the University of Nottingham. These awards are open to UK campus alumni only. Our UNM and UNNC campuses have their own awards. You can nominate someone else or nominate yourself. Nominees may be informed that they have been nominated. We actively encourage nominations from all communities, particularly those within often underrepresented groups. Alumni from across our community who have demonstrated the university's values since graduating and as a result, have made a big impact on the world around them. University values: Inclusivity: creating or advocating for a community where everyone can contribute and be appreciated for who they are. Ambition: setting the highest standards for themselves, those around them and their work and/or supporting others to be ambitious. Openness: communicating in a straightforward and transparent way with others and the world around them, championing the free exchange of ideas. Fairness: ensuring their decisions and actions are consistent, impartial and ethical, or encouraging others to do the same. Respect: having regard for rights and feelings of others, demonstrating this behaviour and treating those around them with kindness, or encouraging others to do the same. All names, gendered pronouns and details of protected characteristics (such as disability, ethnicity etc.) of nominees will be removed, unless relevant to the reason for nomination, before being shared with a selection panel, who will score each nomination against the criteria below. We are committed to creating an equitable selection process and want applicants to feel able to share personal information where relevant as part of the application process to allow us to determine that the nomination process is capturing a diverse and inclusive representation of University of Nottingham alumni. Please note that the panel's decision will not be influenced by multiple nominations for the same nominee. Selection critieria: These are the questions that our selection panel will be scoring against when considering the nominations: To what extent have they embodied the university value/s? (More than one value demonstrated does not automatically mean a higher score) What is the weight of the impact? (This can be a significant impact on a few people or an impact on many people) To what extent is the impact long-term? To what extent have they inspired others to live according to the value/s that they have demonstrated? How progressive or topical in terms of current affairs is the impact? Providing facts, statistics and timeframe can help to clearly demonstrate the scale and duration of impact (eg. in 2024 the project provided 100 communities with lifelong skills, which enabled them to...). Try to avoid sector-specific language to keep it simple for non-experts to understand. If it is relevant to the nomination, please include any public recognition or awards received by the nominee. Did you know that we have a separate category for recent graduates? So, if someone you know (or you!) has graduated in the last 10 years and done something great, please do submit a nomination. Once you have submitted your nomination, you will be given the opportunity to save a PDF of your completed form. October 2024 – Nominations open 12 January 2025 – Nominations close Early February 2025 – Nominees are informed* Late February 2025 – Selection panel meets Spring/early summer 2025 – Winners are informed and publicly announced July 2025 – Awards are presented at Graduation *Nominees are only informed if possible to do so Fill in our online form to submit your nomination – entries close on 12 January 2025."
        }
    ],
    "pdf_files": []
}