{
    "url": "http://www.nottingham.edu.my/Alumni/Inspiring-Alumni/ALA-Previous-Winners.aspx",
    "content": [
        {
            "p": "Emeritus Professor Malachi Edwin Vethamani Emeritus Professor Malachi Edwin Vethamani is a Malaysian poet, writer, critic, editor and bibliographer. His contributions to teaching in Malaysia have been recognised and lauded by the Malaysian English Language Teaching Association and he was conferred their Special Award and a MELTA Award for creative teachers is named after him. He is a recipient of the Asian Education Leadership Award conferred by the World Education Congress in Mumbai, India, the Fulbright Award and the Chevening Award. He is recognised as a leading researcher and expert in the field of Malaysian Literature in English. Emeritus Professor Malachi Edwin Vethamani was formerly the Head of the School of English at the University of Nottingham Malaysia and was also the Professor of Modern English Literature. In 2019, as a recognition of his contributions, he received the Vice-Chancellor’s Medal. Mathialagan Magendran Mathialagan Magendran is a member of the board of directors at UN Global Compact Network Malaysia & Brunei as well as the Corporate Sustainability Specialist for a pharmaceutical manufacturing public listed company. As an experienced corporate sustainability practitioner, he has a passion for leading sustainability initiatives as well managing local and international sustainability framework related systems in order to move towards a more successful economy whilst still keeping the environment and social pillars at the forefront. He also plays an instrumental role in formulating designated sustainability strategies for corporate companies to meet globally recognised sustainability standards such as the inclusion of FTSE4Good Bursa Malaysia Index. Mathialagan also has made contributions to academic research on the conservation of forestry, with his work being published in the 2020 Journal of Sustainable Forestry. Christopher Leong A prominent lawyer in the field of dispute resolution, Christopher has 29 years of experience in corporate and commercial litigation, shareholders’ disputes, and banking and securities litigation. In addition, he acts as counsel in domestic and international arbitrations, both locally and overseas. Since 2004, Christopher has been named a Leading Individual/Lawyer in Malaysia by The Legal 500 Asia Pacific, a portal that provides insight into the legal marketplace. Most recently, he was named the Dispute Resolution Star in Benchmark Asia-Pacific 2018 and 2019. Dr Ching Lik Hii In 2015, Ching Lik was first invited to involve in volunteering activities organised by UNM BlueSky. Together with a team of volunteers, he then later helped officially co-found UNM BlueSky-Mobile Tutoring Programme for Refugee Children funded by the Cascade grants. The aim of the programme is to support education centres run by non-governmental organisations (implementing partners of UNHCR Malaysia) by providing weekend tuition classes to the refugee children. Currently, the programme is attached to education centres in the Klang Valley (Selayang and Ampang) and volunteers include students and staff of UNM. To date, the programme has helped support more than 200 refugee children from various nationalities. Terk Chern, Gwi TC was a senior business analyst at broadcasting giant Astro with expertise in business strategy, operations and finance. There, he strategically led a few projects, which gained a combined revenue that of more than RM1 billion in cost saving and revenue optimisation. He then left his corporate job to start his own online food subscription platform called Didi Eat (previously named as Dinez-in), in January 2017; and today, he is the Group CEO of Savour Tech Holding which is established in early 2018 and they have incorporated a few other businesses such as branding& marketing, data analysis, event, education & tea leaf companies. He has also been prominently featured in The Asian Entrepreneur magazine, The Edge, The Sun Daily, Oriental Daily, Lite FM, and more. Siti Maslinda Sheikh Othman Siti Maslinda who graduated in the 2004 and introduced Air Asia’s Corporate Social Responsibility Programme; the ‘Donate Loose Change’ when she worked as the Special Assistant to the Group CEO and a Government Relations Specialist. She was also instrumental in KENANGA KARES, a CSR programme in education, community and environment and was part of the transformation team. In November 2012, Siti Maslinda established an accredited early development center Jelly Babies Early Childhood Center which adopted the concept of ‘Learning Through Play’. Currently she is Heading the Corporate Communications Department at Parkway Pantai, Malaysia Operations Division. Shahen Avinesh Amaratunga, MAS Holdings Shahen Avinesh Amaratunga was awarded “Alumnus of the Year 2016” for designing and developing an environmental sustainability standard for Sri Lanka’s MAS Holdings. Read full profile. Yang Amat Mulia Tunku Tan Sri Imran ibni al-Marhum Tuanku Ja’afar al-Haj (DKYR, PSM, SPNS, AMN, PJK) Tunku Muda, of Serting Tunku Imran has received the award in recognition of his enduring and significant commitment to sport on a global stage, including in his current roles as President of the Commonwealth Games Federation and President of the Olympic Council of Malaysia. Read full profile. Yang Arif, Datuk Dr. Prasad Sandosham Abraham, Court of Appeal Judge Datuk Dr Prasad has been recognised for his contributions to the legal profession, including in his current role as a Court of Appeal judge, and achievements throughout his career. Read full profile. Ruth Yeoh of YTL Corporation Ruth is the Executive Director at YTL Singapore and heads the environmental division, where she reports on the organisation’s environmental activities. She is also a director at YTL SV Carbon, the company’s in-house carbon credit and clean development mechanism consultancy. Read full profile. Cheng Pheng Saw The 2015 Alumnus of the Year Award was presented to Cheng Pheng Saw for his contribution to sports in co-founding the PCFreestyle and D Skills Academy, which provides freestyle football workshops and coaching classes, as well as providing opportunities for talented individuals to perform in stage shows, video commercials and at events. Read full profile. Nagulendran Kangayatkarasu Nagulendran has been representing the Government of Malaysia in numerous international conventions and treaties on the environment, negotiating Malaysia’s stand on issues related to biodiversity, access to Benefit Sharing and biosafety. Read full profile. Teoh Wee Kiat and Chin Ren Yi In an unprecedented move, this year, 2 alumni of the University were conferred the Alumnus of the Year 2014 Award for their innovative entrepreneurial efforts, Teoh Wee Kiat and Chin Ren Yi, the co-founders of myBurgerLab and business and engineering graduates of UNM received the award from Professor Sir David Greenaway. myBurgerLab is a fast food outlet that has its customers’ queueing up daily, serving 600 customers within 5 hours of its operations daily. Read full profile. Yang Mulia Tengku Tan Sri Ahmad Rithauddeen Tengku Tan Sri Ahmad Rithauddeen has been the Chairman of The University of Nottingham in Malaysia Berhad since 1999 and has, from the very beginning, played a key role in the University’s move to establish the first campus of any British university in Malaysia. He led the ground breaking ceremony of the the University of Nottingham Malaysia (UNM) on 29 January 2002. Read full profile. Professor Ting Kang Nee Professor Ting Kang Nee, alumnus of the university was awarded Laureate Award for Special Excellence owing to her tireless contribution as a volunteer, initiator and leadership of UNM’s campus cancer awareness campaign. Read full profile. Molly Fong Molly Fong was presented with Laureate Award for Alumnus of the Year 2013. An MBA graduate of the University of Nottingham Malaysia (UNM) in 2012, Fong was conferred the award for her exceptional business acumen and the championing of her company’s campaigning stance in Malaysia. Read full profile. telephone: +6 (03) 8924 8373 fax: +6 (03) 8924 8657 email: alumnirelations@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}