{
    "url": "https://www.nottingham.ac.uk/alumni/business-briefing",
    "content": [
        {
            "p": "For 25 years Nottingham University Business School (NUBS) has been a global leader in business education, providing a platform for graduates to embark upon successful careers around the world. The only business school in the UK to hold triple accreditation for its operations on every campus – UK, China and Malaysia – from AMBA, AACSB and EQUIS, the school's commitment to outstanding teaching, research and practice is internationally recognised. It's an exciting time for the school as it embarks on new plans to develop its activities further, including expanding operations at the new Castle Meadow Campus in Nottingham city centre from 2026. NUBS Deans Professor David Park, Professor Kok Wei Khong and Professor David Goodwin reflect on the business environment and how NUBS is looking to the future. Our vision at NUBS is to be a global leader in business education, shaping the future of responsible business and management in an interconnected world. We aspire to deliver an unparalleled learning experience that transforms our students into visionary leaders and change-makers. Professor Park: \"The next five years will be a time of transition and evolution as current trends become the new normal. One of the key trends is flexibility and a willingness to change. It's not just the service you deliver as a business but how you operate as a business. There is an expectation that employees, business owners and legislators will respond quicker while developing an ongoing awareness of key enablers such as digital. The majority of us will need to continue to upskill and top up our understanding, and the source of where we get our skills and experience from is going to become broader.\" Professor Khong: \"Some of the opportunities are in technological advancement, sustainability, diversity and inclusion, and social responsibility. Where artificial intelligence (AI) is replacing some functions, social responsibility in particular is a new area of emphasis that can help companies incorporate social and environmental considerations.\" Professor Goodwin: \"We're going to see technological breakthroughs occurring at pace. It's unprecedented. Business is always looking to the latest developments. The crossover between the worlds of science, engineering and business is a particularly exciting opportunity. Does AI mean the traditional role played by business leaders disappears? Probably not. But the growth in business activity is astounding because the world is now integrated due to technology. We're going to have new imbalances created by technological breakthroughs, but as people work around the disruptions and find new solutions, natural patterns will re-emerge.\" Professor Khong: \"There are several key skills that current and future leaders need to have to be successful in a rapidly changing business landscape. Some of the most important are leadership, strategic thinking, digital literacy, innovation, emotional intelligence, financial acumen, and communication.\" Professor Goodwin: \"It's important to simultaneously address both hard skills – such as the ability to navigate the emerging technology landscape – and soft skills –such as communication skills. The growth of hybrid working means being an effective leader may now include managing staff while being physically remote from teams. How do you galvanise innovation and dynamism in the workforce when people are not meeting together as frequently as before? The right answer will vary depending on an individual organisational context. But this challenge to our traditional ways of working is going to allow the formation of new patterns of work which may end up being better.\" Professor Park: \"An effective leader needs to be able to relate to and engage with diverse groups and individuals. The ability to build your own experience and skills, plus building a team around you that can cover some of this, is an important skill. If you are consistently true to who you are and your own values, I think you increase your chance of effectively engaging with others. And that increases the chance that your business, your entity, your enterprise will succeed.\" Professor Park: \"We have three priority areas as a school: teaching and education; research and knowledge exchange; external engagement. I'm genuinely excited to help create the future of business school education and research and by the potential that our co-location with other (non-academic) organisations at the new Castle Meadow Campus will offer to further enhance the value of what we do.\" Professor Goodwin: \"I think we have a great opportunity here at Nottingham to create a model of education which is truly distinctive. That's going to be a combination of technology, curriculum content and effective teaching. The way in which our campuses can share insights with each other is an outstanding feature of the ti-campus model. Our opportunity is to provide an immersive education experience so that when our students graduate, they're already well advance in being prepared for the workplace.\" Professor Khong: \"Business schools can play a critical role in preparing future business leaders by providing a strong foundation in business principles and practices, as well as knowledge of emerging trends and technologies. NUBS can help alumni stay ahead of the curve and be better prepared to succeed in a changing business landscape.\" Professor Goodwin: \"Two-way knowledge exchange with alumni can help to inform us in the business school of the changing trends in their workplaces, playing a role in encouraging us to implement change. We should then support alumni to access the latest trends, which could be through short courses or thought leadership events for example. So it's a combination of listening to the thoughts and insights that everyone brings, and then the role the university plays in communicating the latest trends.\" Professor Park: \"We have a global community and there are absolutely opportunities to engage with our research, our ability to educate, and our external network. I'd like the business school to be increasingly real-world relevant – for example, we've launched a Digital Centre of Excellence to equip students with the skills and qualifications they need for an increasingly digital world. But I'd also like us to be known for our ways of working. That comes down to how we interact with each other, how we teach, the content we produce, the networks we create. If we can do that consistently, we can make a difference to those who engage with us.\" We're celebrating 25 years of Nottingham University Business School (NUBS) with the launch of a new global event series: \"The second quarter century\". NUBS invites you to join us and discuss future challenges and opportunities with leading thinkers from the school and alumni community. New Delhi – 23 November 2023 Mumbai – 25 November 2023 Hong Kong – 29 November 2023 Shanghai – 2 December 2023 London – 5 March 2024 Lagos – March 2024 Kuala Lumpur – March 2024 Nottingham – June 2024 New York – June 2024 Professor David Park (Dean of Nottingham University Business School, UK), Professor Kok Wei Khong (Dean of Nottingham University Business School, China), Professor David Goodwin (Dean of Nottingham University Business School, Malaysia) We take a moment to explore our campuses and discover iconic locations and hidden gems. Discover how to solve problems and influence change across organisational boundaries. Dr Andy Cornish shares why shark and ray conservation is vital for our ocean ecosystems. If you can innovate, and spread innovation in health care, you can innovate anywhere."
        }
    ],
    "pdf_files": []
}