{
    "url": "http://www.nottingham.edu.my/Alumni/How-can-we-help-you/Organise-a-reunion.aspx",
    "content": [
        {
            "p": "Reunions are fantastic fun! It's wonderful to see alumni come back to campus or get together in a new location. Organising a reunion is a great way to reunite alumni who have lost touch with one another, re-ignite old friendships or they can simply be an excuse to hold a celebration for those of you who have stayed in touch over the years! We're here to help alumni organise reunions everyone will enjoy. Read our top tips for getting started below. All you need to organise a great reunion are the right ingredients. Here are the main steps we think you'll need to consider to create your event: Why are you organising the event? What is the reason for getting people together? Are you celebrating a graduation anniversary, wish to revisit old haunts on campus or simply want to reconnect with your classmates? The reason usually shapes the theme of the event. When do you plan on hosting the event? Choosing the right date and time is important and you need to consider which date is suitable for you and your guests. Events during public holidays and in the week can sometimes be troublesome as guests may have other plans. Where would you like the event to take place? Will the event be in the Malaysia, overseas, on campus or in your back garden? Wherever it is going to be held, we'd love to hear about it and give you the support you need. Who would you like to attend the event? Are you in touch with your proposed guests or would you like our support to make contact with a specific group? It's up to you who you'd like to invite - whether it's old class mates, neighbours from halls or friends who started in the same year! Our team are available to help you through the whole process. We can provide support with: When organising your event, we hope you will support us by sharing the names of your classmates, any contact details and photos from the event. This helps us to connect and keep in touch with our alumni, making sure your classmates don't miss out on the latest news and events from around the University. To get in touch with the team, please contact the Alumni and Relations Office. telephone: +6 (03) 8924 8373 fax: +6 (03) 8924 8657 email: alumnirelations@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}