{
    "url": "https://www.nottingham.ac.uk/alumni/sowing-the-seeds-of-sustainability-1",
    "content": [
        {
            "p": "For undergraduate students today, building a more sustainable future has become one of the most pressing issues of our time. Academics from across our five faculties explain how the university is providing the tools to do so, no matter what is being studied. From the introductory modules students take to establish the foundations of knowledge in their degree programmes, to the capstone projects in their final year where they apply their research skills, sustainability is discussed and critically assessed to ensure we use the arts and humanities to face this challenge of the next century. For example, first year students within the Department of Philosophy examine the relationships humans have built with the wider environment within their module, “Philosophy and the Contemporary World”. Similarly, students within English and American and Canadian Studies are provided with survey modules that engage with the literature of the environmental movement from the 19th century to the present day. We also have specific modules that address areas for students to explore in the second year of their programmes, allowing them to build their disciplinary knowledge of the issues of sustainability and prepare them for the opportunity to conduct their own research within dissertations and research projects in their final year. These threads of sustainability throughout our degree programmes ensure all Faculty of Arts students can place this issue as a central part of their degree, and can think creatively about how arts disciplines can help to address issues of sustainability. Professor Ross Wilson – Director of Liberal Arts Engineering is on the frontline of the battle to address the challenges of sustainable development. In the Faculty of Engineering, we are playing our part through cutting-edge research and by equipping future generations of engineering graduates to deliver sustainable engineering solutions. How do we provide our graduates with the knowledge and skills to make a difference? All our programmes have core modules in which students are introduced to the engineering fundamentals and the key skills needed to be sustainable professionals. These equip our students to make sustainable decisions on engineering processes, evaluate lifecycle impacts of design choices and select the most sustainable materials. Engineering design is at the heart of what we do. All departments run design projects that allow our students to develop and demonstrate their knowledge and skills in real world contexts. Students also benefit from working with staff who are active in researching sustainable solutions to global challenges: from transport infrastructure to renewable energy, from advanced manufacturing to delivering clean water. Dr John S Owen – Associate Professor, Department of Civil Engineering The faculty encompasses the Schools of Health Sciences, Life Sciences, Medicine and Veterinary Medicine and Science – all of which have sustainability high on the agenda, linking to the UN’s Sustainable Development Goals (SDGs) where possible too. In teaching asthma in year one of the medicine course, the classic example of metered dose inhalers is introduced in relation to the SDG ‘climate change’. The carbon footprint of a metered dose inhaler is quoted as the equivalent of driving from London to Sheffield, whereas the alternative dry powder inhaler has the same carbon footprint as driving four miles within London. When GPs prescribe asthma medication, they are alerted to the environmental impact of inhalers. In the second year students are invited to estimate their own annual carbon footprint (which is approximately two tons per person less than the UK average) and produce a menu which has a lower carbon footprint than their standard menu. Working in partnership with students is also crucial and helping to support climate anxiety in our students, given the climate crisis unfolding. Professor Michael D Randall – Associate Pro-Vice-Chancellor (Education and Student Experience), Faculty of Medicine and Health UNNC is accelerating the sustainable development towards a zero-carbon and zero-wastecampus. To achieve the goal, all faculties, professional service departments and sustainability clubs are working collaboratively. Highlights include: 1. NUBS China has recently established a Center for Responsible Business and Innovation which responds to the United Nations’ call to promote regional education for sustainable development (ESD). This center aims to empower our students, alumni and local enterprises to advocate for Environmental, Social, and Corporate Governance (ESG) practices, shaping the future of responsible business and management education in an interconnected world. 2. In the past 3 years, UNNC SDGs Journalism Reporting (SDGs JR) research team initiated a serial of courses and events in SDGs JR. This project is co-funded by the Erasmus+ Programme of the European Commission, aiming to empower students and professional journalists with up-to-date knowledge and technologies with best practices. 3. NottinGreen and reUNNC, the student and staff clubs in UNNC focusing on sustainability, are working collaboratively in campus waste management. They initiated several impactful projects including Bring-Your-Own-Container (BYOC), Freecycling and Clean-Your-Plate across the campus. 4. In 2024 March, UNNC is planning to hold our first Environmental Sustainability Carnival (former name: UNNC Environmental Sustainability Week) to create better awareness of sustainability among students and staff members in a more interactive and engaging approach. From chemistry to mathematics and even computer science, the role of sustainability in science is explored in many ways within teaching across the faculty. Natural Sciences students are encouraged to shape their study to meet personal interests, and can choose streams and modules that focus on sustainability and environmental topics. You may wonder how sustainability can be incorporated into the teaching of mathematics; modules taught include game theory, which examines voting systems and their links to inequality, responsible consumption and production, epidemic modelling and many others. Elsewhere in the faculty our pharmacy students are learning how to minimise climate impact as health professionals and the School of Chemistry has been developing an innovative approach to teaching since 2019, which directly incorporates UN Sustainable Development Goals (SDGs), encouraging students to take a wider view of the positive and negative impacts of their chemistry and put their learning into context. Professor Katharine Reid – Associate Pro-Vice-Chancellor (Education and Student Experience), Faculty of Science Our recent Education Showcase in April 2023 was themed Sustainability: Education for the Future. The showcase is a graded component of the Y1 to Y4 BA/BEd programme experience and is run every spring semester. The Tech Enhanced Language Learning elective module offered by the School of Education uses SDG4 and SDG13 as lesson and assessment contexts. Students from the BA/BEd Teaching English to Speakers of Other Languages (TESOL) programmes take this module as an elective. School of Education Bulletin – a monthly bulletin that features a write-up on an individual SDG every issue. School of Education launched the Sustainability and Transformational Education Research Cluster (STERC) Seminar Series. School of Education hosts the Malaysia Office of the UNESCO Chair in International Education and Development. Creating a sustainable future will require an understanding of and engagement with human behaviour, culture, economics, politics and supply chains across different places and locations. Social sciences are therefore fundamental to achieving the UN Sustainable Development Goals (SDGs). Within the Faculty of Social Sciences, sustainability is taught within particular modules, embedded across degree programmes, and encountered by students as part of practical immersive experiences. One example takes place this autumn, with students in the School of Geography and the Nottingham University Business School (NUBS) participating in a new ‘ecoinduction’, comprised of a series of events and interactive experiences to raise their awareness and engagement on sustainability. Students from any school within the faculty can also participate in the Social Sciences Placements Programme alongside their academic studies. These placements give students real-world experience working in sustainability and environment-related Government agencies, NGOs and trusts. Dr Chris Ives – Associate Professor, School of Geography, Faculty of Social Science At the Sir Peter Mansfield Imaging Centre, dedicated researchers today are continuing to develop and evolve this pioneering work to tackle new challenges. Four of our outstanding research fellows share their inspiration and give a little insight into what makes them tick!"
        }
    ],
    "pdf_files": []
}