{
    "url": "https://www.nottingham.ac.uk/alumni",
    "content": [
        {
            "p": "Welcome to the University of Nottingham alumni community. A global community of 340,000 Nottingham graduates, with opportunities for all. An international community Grow your professional and personal networks and connect with alumni and academics around the world. Lifelong learning Whether you're a new graduate or are more established in your field we can help you to continue to fuel your learning. Give your time Volunteering is a great way for you to learn new skills, make professional connections and give back to our students and alumni. Networking Grow your network and connect with your global alumni community of over 340,000 graduates. Grow who and what you know with your alumni programme 'Connected we thrive'. From webinars presented by alumni experts, seminars with leading university academics and in-person networking events around the world, your community is here to support you! Your community Update your details to stay connected to the university and hear about the latest alumni events, opportunities and news. Update your details Catch up with the best of the news from your university, the alumni community and Nottingham during the course of 2024. Managing Director of renowned advertising agency adam&eveDDB, James Rowe (Geography, 2009) shares the secrets of Christmas TV adverts! Our Alumni Volunteering team have been busy bees this month, with a host of alumni volunteers sharing their time too. Nottingham is the top-ranked university for graduate careers according to Graduate Outcomes provider, HESA. View more Learn how an entrepreneurial mindset can lead to better outcomes, potentially greater profitability and more rewarding workplace relationships. Join the Deans of our UK, China and Malaysia campuses for this online event to wrap-up Nottingham University Business School's 25th anniversary celebrations Join university expert Dr Maria Toledo-Rodriguez to learn how to train your brain into a 'growth mindset' and embrace opportunities which come your way. Personal Performance Coach Julie Littlewood (Biomedical Sciences, 1999) explains how to build confidence in your own abilities and take the next step, wherever you are in your career. Discover your next opportunity to make a difference. Give a gift and help make the incredible happen. Make sure you don't miss out on our exciting new Connected we thrive activities, alumni events, university news and opportunities around the world by sharing your contact details with us. Sign up Register your details to keep up to date with all the latest alumni news and events, or speak to one of our team."
        }
    ],
    "pdf_files": []
}