{
    "url": "https://www.nottingham.ac.uk/alumni/business-school-announces-revamped-mba-and-executive-mba-programmes",
    "content": [
        {
            "p": "Nottingham University Business School has unveiled major changes to its Full Time and Executive MBA programmes, enhancing flexibility, relevance, and career support to meet the needs of modern business professionals – and University of Nottingham alumni can benefit from a limited number of £5,000 scholarships towards their fees. Commencing in September 2025, the updates to the MBA programmes reflect the Business School’s commitment to providing an MBA experience that not only addresses the challenges of contemporary business, but also helps students build the skills and network necessary for leadership roles in a wide range of industries. “We’ve made significant strides in updating both the Full Time and Executive MBA programmes,” says Head of MBA Programmes Andrew Corcoran. “The business world is evolving rapidly, and education needs to keep up. We want our MBA to reflect the skills, knowledge, and flexibility that modern leaders need.” One of the standout changes to the Executive MBA programme is its shift to a blended learning format. Students can now take part in a combination of on-campus and online modules, with the offering of four in-person and eight online modules. This flexible approach means students can continue working full-time while studying, making the programme ideal for those who cannot relocate or commit to a traditional, full-time MBA format. This flexible format is especially beneficial for international students or working professionals looking to enhance their business acumen without interrupting their current career trajectory, their family lives, or taking a year off without earning. It offers the same rigorous, high-quality business education that Nottingham is known for, with the added convenience of remote learning. “We recognised that the traditional, in-person-only model wasn’t meeting the needs of professionals who can’t afford to step away from their careers. By offering a flexible format, specialisations, and enhanced career support, we believe we’re equipping our students for real-world success in the most relevant way possible.” The curriculum has also been updated with new, forward-thinking modules that are designed to provide students with the skills that are most in demand in today’s job market. Courses on topics such as digital transformation and change management, financial technologies, and supply chain management ensure that students are equipped with the knowledge they need to navigate the rapidly changing business landscape. In addition to the new modules, Executive MBA students can now choose to specialise in specific areas such as finance, innovation, healthcare, or technology leadership. This new approach offers students the flexibility to tailor their MBA experience according to their career goals. For those who prefer a more wide-ranging programme of study, then the Nottingham MBA offers a choice of eighteen different electives to explore the full spectrum of business management. Another major enhancement to the MBA offering is the introduction of the Accelerator programme, which includes micro-certifications, career development workshops, networking events, and one-on-one career coaching. The programme provides up to 200 hours of additional development opportunities alongside academic studies, and is designed to give students a significant boost on their return to the job market. To further support talented individuals, the University of Nottingham is offering a limited number of £5,000 scholarships to alumni. With limited funding available, we recommend applying as soon as possible - once our funding limits have been met, we will not be able to issue further scholarships. “This is an exciting time for the MBA programmes here at the Business School,” says Andrew. “We’ve designed these updates to ensure our graduates leave with not just a degree, but the confidence, skills, and network to lead in today’s competitive business landscape.” Applications are now open for the September 2025 intake. For more details, visit the Executive MBA or Full-time MBA pages."
        }
    ],
    "pdf_files": []
}