{
    "url": "http://www.nottingham.ac.uk/alumni/giveyourtime/opportunities/index.aspx",
    "content": [
        {
            "p": "Here you can find our current volunteering opportunities and find out more about how you can apply and get involved. Our current opportunities are listed below, along with the information you need to apply or to contact one of our team. As well as viewing our roles here, you can keep updated through our alumni LinkedIn group and register your interest to volunteer and receive our Connect: Volunteering newsletter which includes upcoming volunteering opportunities. Lived experience of disability in the workplace: Are you interested in sharing your lived experience of disability and accessing reasonable adjustments in the workplace to help students in their career progression? We are keen to create insightful and supportive case studies representing all types of disability, including but not limited to physical, sensory and visual impairment, mental health conditions and neurodivergence. If you are interested to support, please register your interest or contact sarah.greaves@nottingham.ac.uk Discussions with Alumni: We are running two online events which aim to encourage roundtable discussions with students around pre-set topics. October 22 – What does EDI in the workplace look like and why is this important? November 26 - What is professional identify in the workplace and why is this important? If you are interested in volunteering for either of these, please register your interest here or email meg.cross@nottingham.ac.uk for further information. Faculty of Sciences Working with Data (Spring): Has your path since graduating led you to work with data and would you be interested in sharing your story? We are running a virtual panel and Q&A in Spring with students. Science in Small Companies (Spring): Have you used your science qualification to work in a small company, we are looking at hosting a virtual panel event which looks at different roles science can play in small companies. Mathematical Sciences Where are they Now? (Spring): Are you a Mathematical Science graduate interested in sharing your career journey and advice with current students. If you are interested in these opportunities, please email gemma.firth@nottingham.ac.uk Solicitor Careers Panel (Early December 2024): Are you a qualified Solicitor looking to share your career journey and advice with current students? We’re running a virtual panel and Q&A in early December with students and staff within the School of Law. If you are interested in joining our alumni panel and presenting your career journey, please email wayne.crawford@nottingham.ac.uk for more information. Solicitor Mentoring Scheme (Spring 2025): Are you a qualified Solicitor looking to support aspiring solicitors within the School of Law at the University of Nottingham? We’re launching a new mentoring scheme in Spring 2025 designed to support students to plan their next steps towards a solicitor career. Register your interest as a mentor and we’ll be in touch ASAP. Economics Alumni Careers Showcase (Spring 2025): Did you graduate from the School of Economics in the past 10 years? We’re inviting alumni from the school to share their career journeys and top tips with current Economics students. Register your interest as a speaker and we’ll be in touch with more information later in the year. Politics and International Relations Alumni Careers Showcase (Spring 2025): Did you graduate from the School of Politics and International Relations within the past ten years? We’re inviting alumni from the school to share their career journeys and top tips with current Economics students. Register your interest as a speaker and we’ll be in touch with more information later in the year. University Radio Nottingham – Were you a member of University Radio Nottingham (URN) during your time at university? We would love to hear from you about your experiences, and we are looking to hold events this academic year to provide opportunities for current URN students to network and learn from you. Spotlight on Film, TV and Radio – We are looking for a panel of alumni who are now working in the Film, TV and Radio industry to speak with our students about getting a job and working in the sector. Spotlight on Heritage Sector – If you are working in the heritage sector, we would love to hear from you about your current role and your experience working in the sector. We are holding a careers event for current students wanting to move into this line of work and we would appreciate your support as part of a panel discussion. Working in the US – Did you go on to work in the US after graduation and are a UK graduate? We are holding an event to support and advise students looking to work in the US and provide advice on the process of finding a job and moving abroad. Please get in touch at laura.repton@nottingham.ac.uk if you are interested in any of the above. Getting into Public Health (Spring): Are you working in the field of Public Health and interested in sharing your career journey and experience with students? We are running a virtual panel and Q&A in Spring. Research Career in Industry and Academia (Spring): If you have a research career in Industry or Academia and are interested in sharing your experiences with students at a virtual panel and Q&A session, we would love to hear from you about your current role. If you are interested in participating in these opportunities, please email sarah.greaves@nottingham.ac.uk Industry Insights: We are looking for alumni from a range of sectors to give a genuine look into their industry and role, to give students a realistic understanding of the world of work. We are particularly looking for volunteers from the following sectors: finance; banking, accounting and audit; consulting; business operations/business development; marketing. This is an in-person opportunity for alumni to deliver a short presentation and network with students, being held at the Jubilee Campus on Wednesday 13th November 13.20 - 16.30pm. If you’re interested in this opportunity, please complete this registration form or email emma.winter@nottingham.ac.uk for further information. We have a range of other opportunities coming up in the 2024/25 academic year, including: Alumni careers panels: If you are interested in talking about your career and sharing sector insights with current students/fellow alumni. (A range of different panel sessions available). Profiles and interviews: Tell us about your time at Nottingham, and how it supported you post-university, via an alumni profile or video. You can also let us know if you'd like to contribute to our wider alumni communications, such as our \"My Office\" feature. Equality, Diversity and Inclusion: Share your personal lived experiences at one of our events or digitally, to provide inspiration and support for students following your path. For more detailed information about opportunities in your faculty you can: Please contact our Alumni Volunteering team to find out more about volunteering at Nottingham. Our Volunteering Policy provides detail on how we support anyone who gives their time to support the University of Nottingham. Please take the time to read through the policy for full information on volunteering with us."
        }
    ],
    "pdf_files": [
        "uk_pdf_files/university-of-nottingham-volunteering-policy-final-september-2022.pdf"
    ]
}