{
    "url": "https://www.nottingham.ac.uk/alumni/marking-35-years-of-the-nubs-mba",
    "content": [
        {
            "p": "For 35 years we have been teaching our MBAs cutting-edge business knowledge and contemporary management skills which have provided many of our students a platform to become successful entrepreneurs and leaders all around the world. The number of alumni of the full-time (FT) MBA has now reached over 2500. The FT MBA programme has taught students from many countries, with alumni representing over 60 different nationalities. The programme continues to attract students from far and wide, with recent students joining us from Asia (Japan, South Korea, China, Vietnam), North and South America, (USA, Chile, Ecuador), Africa and the Middle East (Nigeria, Morocco, Ghana, Sudan, Saudi Arabia, South Africa), Australia, as well as parts of Eastern Europe (Russia and Armenia). Lately, we have had a growing representation from the Indian subcontinent. Despite the country and cultural differences of our cohorts, the common characteristics of all our MBAs is the dynamism, energy, strong business insights and thirst for knowledge they bring into the classroom. The MBA curriculum has evolved over this period and now includes a growing emphasis on the importance of the sustainability and social agendas for organisations and for leaders of business. In June 2019, FT MBA students Mecia Petersen, Badr Elharradi and Abu Nuruzzaman reached the final of the United Nations Principles for Responsible Management Education Innovation Challenge. This is a global competition where teams of MBA students work with a business to build sustainable business solutions addressing the company’s SDGs and corporate social responsibility objectives. Competing against teams from around 30 other MBA programmes the solution put forward by Mecia, Badr and Abu was the winning entry – a fantastic achievement by our team and great kudos for our MBA programme! Working closely with the new centre of digital excellence the MBA programme is now offering increasing opportunities for our MBA students to learn some of the latest digital tools used in business. The FT MBA programme’s partnership with Deloitte that provides training in management consultancy is now in its fifth year and is opening up opportunities for further collaboration, particularly in the digital transformation and business analytics space. Two recent MBA graduates our have joined Deloitte as trainee Management Consultants. The FT MBA programme’s strong performance in the 2021 and 2022 Economist Top 100 Global MBA ranking and our recent AACSB accreditation, placing NUBS in the top 1% of business schools with the “triple crown accreditations”, is helping us attract more high quality students. The FT MBA is in good shape and views the future with a strong air of optimism. Dr Amrit Judge - Full-time MBA Director David Saad (Graduated in 2016) Fintan Sit (1989) Lily Leung (2004) Mouna Mbacke (2020) Linda Hui (1990) Nivashnee Moodley (2021) Obianuju Uchendi(2020) Peter and Ainour Rutherford (nee Bazarbayeva) (2000) Rakesh Sachdeva David: I started my career in 2012 working as a consultant at an NGO in Jordan. I then moved on to work in Account Management at a Printing and Packaging Company. After two years working there, I decided to switch gears and explore new roles and challenges. In 2019, I made a move to the US with my wife and since then, I've been working in e-commerce building/managing brands on Amazon and other online marketplaces. Fintan: With a BSc in Biochemistry and an MBA, I returned to HK in 1989 and gained experience in marketing at reputable FMCG companies. Then before 1997, I decided to move to Sydney to start a new chapter in life. Little did I know that I would immerse myself in a career spanning over 25 years and five countries in the health and wellness industries. Lily: Before studying for the MBA back in 2004, I was working in a financial and legal industries. However, I think the spirit of entrepreneurship was seeded by studying the MBA at NUBSQ Back to Asia, with a view of digital transformation potential, I started \"Nikopicto Limited\", an award wining digital entertainment studio. Lately, I have started up and moved to the web 3.0 business and developing the metaverse platform \"PICTOVERSE\", focus for the \"Creators to Create\". Mouna: Mouna currently works as a Country Director for Technoserve, a leading nonprofit working in agriculture, entrepreneurship and micro retail cross 30 countries. Mouna has a strong interest in women and youth economic empowerment issues and believes that sustainable development for the African continent cannot be achieved without the participation of women and youth. She serves on the board of the first women-focused angel investment club in West Africa (WIC), acting as a communication officer. Linda: Working as Sales Management and Business Development in HK and Taiwan in a diversified industries including information technology in data management, smart cities, security, traffic management as well as financial information, risk consulting and telecommunications. I speak regularly on IT topics concerning security, network infrastructure as well as smart environment. Nivashnee: I have spent the last nine years working in FMCG, specifically in marketing and brand growth. I started my career at McCain Foods South Africa on their graduate program and worked my way to become a Brand Manager. After almost five years, I left to join Mars Inc. where I moved roles from Brand Manager to Portfolio Manager driving the growth of all food brands for Sub Saharan Africa. After taking a year off to do my MBA, I found my way back to Mars UK to gain breadth in the shopper side of marketing. Obianuju: In 2013, I worked as a complaint analyst in a financial organisation. I was promoted few years later to a Business change analyst position, where I left in 2018 for personal reasons. In 2021, I started a new role as an RPA Business Analyst in a management consulting firm. Peter and Ainour: After graduating Ainour went back home to Kazakhstan and worked for several international organisations including the IOM and UNHCR. In 2009 she went to Vienna to work for the OSCE. Meanwhile, Peter started work in the UK before going to Iraq in 2003 where he was involved in a large-scale donor international aid programme, before returning to the UK in 2006. In Oct 2011 Peter and Ainour were married in Vienna, and in 2016 Ainour moved to the UK permanently. In Feb 2019 Peter moved to Frankfurt to take up a new job and a few months later was joined by Ainour. Before doing so though, Ainour managed to complete her citizenship application process and on 25 November 2019 was granted her British citizenship. Since leaving Nottingham Peter and Ainour have travelled extensively across Europe, the US and South East Asia. Rakesh: My career journey was offbeat in the sense that after successfully practising medicine for over 25 years in India, I suddenly decided to take a leap to Nottingham University Business School, Nottingham to do my MBA at the age of 57. Project Management was my most fancied module and that landed me my first job in the UK as a Project Manager in NHS England. Mouna: I did my MBA for a career break and Nottingham was the perfect city for that. It was the perfect size to have fun while being able to focus on studies when one needs to. I loved walking around town: old market square, the deer park, the goose fair, Maid Marian Way and many more. Nivashnee: My favourite spot was the deck at Jubilee Hall - it looked over the lake and onto the buildings of the campus - on a cold or sunny day is was absolutely picturesque. Peter and Ainour: Jubilee Campus (Peter), any and every statue of Robin Hood! (Ainour). Linda: Know more friends, learn more diversified cultures from different people. David: I loved every second of studying and living in Nottingham. I formed great friendships there and met the person who I am married to today. If I could relive my time at Nottingham, I wouldn't change a thing! Nivashee: Be clear about what you want to yourself and be sure to share that with your network that can help you grow and develop and achieve your goals. Don't let what you want be surprise to anyone and don't quit anything without asking for what you truly want. Mouna: Hire people who have a passion for what you do because you can always teach skills but you cannot teach motivation. Rakesh: Your passion and perseverance to achieve your goal will take you to the place you you want to be in. Stick to your 3Ds' - Dream, Determination and Deeds (to achieve your dream). Fintan: Create your own niche. Own a competency that few others have. Linda: Be sincere, treat others like how you would like to be treated. There are some parts of work you do not like but still have to do, but there are some parts of job that you enjoy. Focus on what you enjoy and spend time on this, then, the bad part would be overcome easier. Rakesh: My motto is to work to live. Work is just a part of myself, not me in entirety. I don't forget to smell the roses as I walk along the path of life. Nivashnee: Live to work - 100% believe in a good balance of work and life however work is such a huge part of our lives. I believe that you should enjoy what you do and love it. Mouna: I can hardly separate the two. My work has to be aligned with the values I live by and, because I spend a lot of time at my workplace, my colleagues often end up being my friends. Peter and Ainour: To live to work is to believe in false promises! We are always keen to hear from our MBA graduates on how the programme has impacted your professional lives so please do get in touch with our Volunteer and Advocacy Alumni Manager, Emma Winter and share your news! From hosting a princess to helping pop royalty, celebrating Hallward's half century and more. Here's a recap of 2023 news highlights. We were delighted to welcome Caucher Birkar (Mathematics PhD, 2004) back to campus this winter to award him a richly deserved honorary degree. This year marks the 25th anniversary of Nottingham University Business School. To celebrate, we’re hosting a series of events around the world, looking forward to the next 25 years in business and finance. We spoke to experts in the Business School, as well as two alumni panelists for the upcoming events, about the challenges and opportunities for the coming years in the country. We're looking for alumni with a passion for sport to volunteer for a unique opportunity to help us achieve our Vision for Sport."
        }
    ],
    "pdf_files": []
}