{
    "url": "https://www.nottingham.ac.uk/alumni/then-and-now-professor-sir-jonathan-van-tam",
    "content": [
        {
            "p": "Professor Sir Jonathan Van-Tam (Medicine, 1987) is the second of three generations to study at Nottingham, so there’s always been a sense of belonging and of history in the making. Returning to the university this year as Pro-Vice-Chancellor for the Faculty of Medicine and Health Sciences, following his secondment as Deputy Chief Medical Officer for England, Jonathan reflects on his time at Nottingham as a student and his role today. What are your recollections of your time at Nottingham as a student? What changes have you noticed since you’ve been back on campus? “The emphasis on student welfare and wellbeing is much higher at Nottingham now, which is a huge improvement. When I was a student, there was a personal tutoring system, but it was a bit more sink or swim. “The campuses still have the same feel. They’ve always been beautiful but are now more built up... parking is a nightmare!”, laughs Jonathan. “I always had an academic career in mind. I spoke to a senior lecturer in my third year about returning at some point to pursue a research career. I did my third-year research project in epidemiology and public health (there’s a surprise!) and I managed to publish three scientific papers and attend two conferences and got an absolute buzz for research and publishing findings. “I was a student in Wortley Hall, which was fairly old and dilapidated by then. There were 12 or 13 blokes in an ex-military block, with communal bathrooms... it was a bit like being in the army. But it was fully catered, which was nice! “While at university, I started a couple of hobbies that I’ve maintained. The first is backpacking – trekking long distance in all weathers, finding a piece of grass at night, building a shelter, cooking something simple, packing it all up and moving on. Occasionally turning up in a village to buy gas, food and maybe a pint. Whenever I get the chance, I still get into the mountains. But it’s been difficult for the last few years, let’s face it. I also got into running at Nottingham because my hallmate organised a triathlon in 1983, which I thoroughly enjoyed. These days I run badly but that doesn’t matter – I enjoy it. That’s stayed with me forever.” You’ve spoken previously about the importance of reaching people on their own terms. How does this relate to your role at the university today? “I haven’t studied communication formally, it’s just important to me and it comes naturally. I like explaining why I’ve made a decision, even if it’s an unpopular one and as a PVC, you have to make decisions that are strategically right for the university and they’re not always popular. But what you can do is explain them really clearly. If you can’t explain something rationally, it’s probably not a good decision.” Words: Lily Fairless We were delighted to welcome Caucher Birkar (Mathematics PhD, 2004) back to campus this winter to award him a richly deserved honorary degree. Find out how the generosity of one couple, who met at Nottingham, is helping students with autism prepare for life on campus. Steve Cliffe (Electrical Engineering, 1985) explains how his career has helped advance the advent of touchless technologies. After the Business School appointed a new cohort of Professors of Practice, we spoke to an MBA alumnus returning to campus to share his expertise after 25 years in business"
        }
    ],
    "pdf_files": []
}