{
    "url": "https://www.nottingham.ac.uk/alumni/support-us/volunteer/bicep.aspx",
    "content": [
        {
            "p": "The Black Industry Connections and Empowerment Programme (BICEP) is designed to help students of Black heritage expand their personal and professional networks, meet inspiring Black role models working in a variety of industries and find empowerment and community during university. Applications for our third intake of students for the 2024/25 academic year closed on Friday 25 October. As a participant on BICEP you will have the opportunity to: To apply you must be: Applications are now closed. The Black Industry Connections and Empowerment Programme could not run without the dedicated support of our fantastic programme mentors. Meet them below and see you you might be matched with: Ify Ikhile (PhD Pharmacy Education, 2020) Job Role: Assessment Expert/Consultant, World Health Organization Academy/Education Consultant Commonwealth Pharmacists Association and Associate Professor of Medical Education/Deputy Assessment Director, University of Nottingham Medical School. About Ifunanya Ify is an internationally recognized expert in medical education and assessments. Currently serving as the Deputy Director of Examinations and Assessments and Associate Professor at the University of Nottingham medical school, she has made significant contributions to shaping the future of clinical assessments. As the Clinical and Professional Skills Assessment Lead, she oversees the largest medical school clinical assessments in the UK, driving innovations in examiner training and the reliability of OSCEs (Objective Structured Clinical Examinations). Her global impact extends to her role as an Assessment Consultant for the World Health Organization Academy, where she leads strategies that benefit learners worldwide. She also plays a pivotal role in the Commonwealth Pharmacists Association, where she develops leadership programs for health professionals across Africa. With a PhD in Pharmacy Education, she is a highly regarded researcher, having authored numerous publications in international journals. She has presented at key global conferences and has been honored with awards such as the International Pharmaceutical Federation Highly Commended Academic Award, University of Nottingham Medical School Teaching Contribution Award and a nomination for the World Economic Forum’s Young Global Leaders. Beyond academia, Dr. Ikhile is a passionate advocate for equity, diversity, and inclusion, currently mentoring several young black professionals, hence her interest in BICEP, and representing BAME staff at the University Research Integrity and Ethics Committee. Stephen Johnson (Mechanical Engineering, 2019) Job role: Engineer, Cundall About Stephen Stephen has spent the five years since then working in Birmingham for Cundall, an engineering consultancy - specialising in the design of cooling systems for data centres. Outside of work, he enjoys playing golf, cricket and rugby, and will happily watch nearly any other sport as well. He also fancies himself as a bit of an amateur barista. Why Stephen is supporting the Black Industry Connections and Empowerment Programme I want to mentor and support others from minority backgrounds who face entering industries after university where their heritage and background is often not represented at senior level. Niquita Pilgrim (PhD, Black Studies with Psychology, 2023) Job role: Chartered Psychologist and Co-Director of The Cultural Connection Industry expertise: Health and social care across the public, private, voluntary, community, and social enterprise (VCSE) sectors. About Niquita I am dedicated to creating opportunities for underrepresented communities to thrive, particularly in the areas of education, mental health, and social equity. My career has focused on developing evidence-based interventions that support marginalised groups and advocating for systemic changes that promote inclusion and fairness. Why Niquita is supporting the Black Industry Connections and Empowerment Programme I want to support the BICEP programme because I strongly believe in the power of representation and mentorship. Expanding personal and professional networks can make a world of difference for students of Black heritage, and I am passionate about being a part of that journey. Empowering young people by connecting them with inspiring role models is key to building confidence and creating opportunities, and I am excited to help students find community, inspiration, and a sense of belonging as they navigate their university experience and future careers. Josephine Otuagomah (International Relations and Global Issues, 2012) Job role: Senior Manager, Plenitude Consulting About Josephine Josephine is a Senior Manager at Plenitude Consulting, a London-based firm specializing in financial crime consulting. Josephine holds an MSci in International Relations & Global Issues from the University of Nottingham and an MA in Politics and Public Administration through a Double Masters programme with the University of Konstanz, Germany. In addition to her current role, Josephine led the Diversity, Equity, and Inclusion (DEI) efforts at Plenitude, advocating for an inclusive workplace culture and has been recognised in HR publications for this work. She brings extensive experience from her roles at prominent financial institutions such as Commerzbank, Virgin Money, and Santander, and has consulted for a number of high-profile organizations, including the Financial Conduct Authority. A certified project and change manager, Josephine also holds an ICA diploma in Anti-Money Laundering. Beyond her corporate career, she is a multi-hyphenate professional, content creator, and entrepreneur, passionate about continuous self-improvement, mentoring, and sharing life lessons. Currently, Josephine is enjoying the journey of new motherhood, navigating the rewarding challenges of balancing her career with raising her 5-month-old child. Elizabeth Adeniyi (Mechanical Engineering, 2022) Job role: Assistant MEP Manager, Mace Group About Elizabeth Since leaving Nottingham she has gone on to pursue a career in construction, working at Mace Group for the last two years. Her journey started in consultancy in the rail sector then, later transitioned to the contracting side of the business. Elizabeth is now working as an Assistant MEP Manager on commercial builds. She is also a passionate advocate for the field of engineering. Elizabeth regularly volunteers and is an active alumnus. In her second year of university, she founded “she can engineering”, an initiative focused on inspiring and educating others above about the diverse opportunities within engineering. Committed to fostering inclusivity, she strives to empower young people and encourage them to pursue their passions. Natalie Matanda (Architecture with Collaborative Practice Research, 2021) Job role: Architect, R H Partnership Architects Industry expertise: Architecture and construction Image credit: Richard Fraser About Natalie Natalie has over six years of experience within the construction industry. She has a track record of delivering successful outcomes for minor and major projects across diverse sectors ranging from residential, healthcare, conservation, masterplanning, education and commercial. Having graduated from Nottingham in 2021 after studying Architecture with Collaborative Practice Research, she has gained her title as ‘Architect’ in 2023 after studying for over seven years. As a Black female in architecture, Natalie is passionate about encouraging more black students, particularly girls, to pursue a career in the construction industry. Natalie is a Chartered Architect at the Royal Institute of British Architects (RIBA); a global professional membership body driving excellence in architecture. Why Natalie is supporting the Black Industry Connections and Empowerment Programme Mentoring has always been important for me, especially being a past mentee myself during my time studying architecture as an undergraduate. Throughout my career, I have benefitted tremendously from mentoring and it helped direct and shape my career through the amazing advice I received from my mentor and I would love to offer that same opportunity.I want to help young mentees to develop the necessary skills to succeed; to give back, support students who are ambitious and willing to learn and being able to offer support to give them a head start in their career. Noah Ajanaku (he/him) (MPH (Global Health), 2022) Job role: Population Health Portfolio Manager, LGT NHS Trust Industry expertise: Population/global health About Noah Noah is a doctor with experience in clinical and public health practice, career coaching, mentoring, and supporting professional development. In 2021, Noah was awarded the fully funded Developing Solutions Masters Scholarship at the University of Nottingham, where he earned a master's degree. During his time at the University of Nottingham, he worked as a Student Engagement Associate and later as a project manager within the clinical trials unit. Prior to this, he managed international projects for Save the Children, Action Against Hunger, and Médecins Sans Frontières. Noah currently serves as the Population Health Portfolio Manager at Lewisham and Greenwich NHS Trust in England. In this role, he coordinates requests for health and care insights, manages stakeholder engagement, and oversees project delivery. Jaz Rodney-Bartlette Job role: Industry Skills Manager, Nottingham Trent University Industry expertise: education, workforce development, business consultancy About Jaz I’m Jaz – currently work at Nottingham Trent University (NTU) in the Centre for Academic Development and Quality as an industry Skills Manager /Business coach with a focus on higher-level skills and Apprenticeships; I’ve most recently worked in Careers Leadership at Secondary School level, and previously in NTU as a Graduate Career Coach. I have a long and varied history in public/private sector education, skills, workforce development and business consultancy.A born and bred North Londoner but lived in, Essex, Bedford, and Birmingham with short stints in France, Belgium, and Germany and recently relocated to Nottingham. I have a BA (Hons) in Social Science (Westminster), a PG Dip Careers Education & Training (Reading University), an MA in Ethical Leadership (Kings College London), Level 7 Award in Careers Leadership (Warwick) and am about to start my PhD at Newcastle University Business School in 2024. One or two things I’m particularly proud of - being mentored by the late great Labour Party MP Mo Mowlam whilst undertaking undergraduate research in the House of Commons on the under-representation of women in politics and public life; founder of a Homeless Charity in Bedford in 2016 still in operation to this day, and my amazing son who’s a neurodiverse winner! I’ve co-authored a book, presented on community radio and pre-pandemic could be found treading the boards as a motivational speaker. As a parent, I am passionate about all things that create equality for all, whether young or older and in particular how under-represented groups navigate the murky world of education and work. When not travelling or doing any of the above, I can be found house renovating and flipping properties – which I’ve vowed to do no more… Still, I’m constantly asked ‘Is this it then?’ my answer, er..maybe how long is a piece of string?! Harry Walker (he/him) (Business and Management, 2018) Job role: Commercial Manager, SKY VIP team Industry expertise: Broadcast and telecommunications About Harry Harry has been at Sky for over five years since graduating from Nottingham. Currently working as a Commercial Manager within the Sky VIP team, Harry has gained experience across diverse disciplines, ranging from Finance to Commercial, Propositional Development, and Trading Performance. With a strong focus on driving the commercial agenda, Harry has developed expertise in the TMT sector, with specific knowledge of subscriber-model economics and customer loyalty. Previously, Harry was actively involved in the Finance D&I team as Events Lead, where he hosted in-person events for over 200 colleagues, highlighting unique stories and diverse viewpoints across the organisation. Outside of work, Harry is a passionate record collector and Hip-Hop enthusiast, having amassed over 200 vinyl records, ranging from De La Soul to Kendrick Lamar. Why Harry is supporting the Black Industry Connections and Empowerment Programme I am excited to be a part of this programme to help support talented people looking to understand more about pathways into the Telecoms and Media sector. It’s such an exciting sector to work in, and benefits hugely from diverse perspectives. Darryl Giffts-Walker (he/him) (Environmental Science with industrial year, 2022) Job role: Environmental Compliance Advisor, Valpak Ltd Industry expertise: Environmental services About Darryl I've worked a variety of jobs, from a 5-star Golf course waiting tables for celebrities like Chris Hemsworth and Len Goodman, to switchboard work for Audi and Health and Safety in Automotive Engineering. My role at Valpak means I interact with all members of a business all the way up to Directors. I work with businesses to ensure they're compliant with UK Environmental Regulations and suggest other services that can keep their business compliant. Valpak is the UK's largest compliance scheme, working with over 4000 businesses since 1997 including household names such as Coca-Cola and Tesco. Why Darryl is supporting the Black Industry Connections and Empowerment Programme I want to see more Black talent in leadership positions and further education. You've done the hard work, got into a top university, but when you graduate you find it more and more frustrating to find a job. The careers team at Nottingham are great at preparing you for interviews and applications, but I believe we can take it one step further. Max Williamson (he/him) (Advertising, Marketing & Design, 2014 - University of Leeds) Job role: CRM Manager, Football Association Industry expertise: Sport About Max Max is a results-driven marketing professional with a strong background in Marketing Analytics and CRM. He started his career leading successful lead generation campaigns for IPA agency Rock Kitchen Harris before working at Vision Express, driving sales through CRM, generating over £2.6m in incremental revenue and spearheaded the implementation of a new ESP system. He then worked at the fast-growing start-up company Nourish3d where he grew revenue from email marketing +417% in under a year. Max is currently a CRM Manager at The Football Association where he manages grassroots audience communications, and most recently, launched an exclusive rewards programme with Nike, for all grassroots football players in England. Why Max is supporting the Black Industry Connections and Empowerment Programme I want to give my knowledge, experience and industry insight to students from black heritage so they can see people from their backgrounds can achieve anything they set their minds to. Adaeze Ibeawuchi (she/her) (Biochemistry & Biological Chemistry, 2015) Job role: Business Analyst, HSBC Industry expertise: Finance, data About Adaeze I joined the financial industry after completing a Masters in Business Analytics, my first few years were in commercial banking where we serviced corporate clients with all financial needs from cash management to trade structuring. I then transitioned to the data side of credit and lending where I now work in a team that aims to leverage the bank’s data to improve credit processes and develop new business opportunities. Why Adaeze is supporting the Black Industry Connections and Empowerment Programme I know how valuable it is to speak to people from similar backgrounds that are in the workplace and can share key tips on how to build a successful career therefore I’m keen to provide such opportunities for UoN students. Hakeem Dairo (he/him) (Electrical & Electronics Engineering, 2016) Job role: Product Manager, Clarke Energy Industry expertise: Energy, power, renewables About Hakeem After graduating in 2016, I joined a two-year engineering graduate scheme at an automotive company. After spending several years in the automotive industry developing battery systems for electric vehicles, I moved into the energy sector where I’m now responsible for renewable energy battery projects globally. Why Hakeem is supporting the Black Industry Connections and Empowerment Programme I would like to support the programme because I believe I can offer some insights into what it’s like for BAME individuals to work in the corporate world. When I was a student, I certainly had expectations on what I thought it would be like working in industry and that expectation hasn’t always been met and in fact turned out to be the opposite in certain instances. I would like to support students in whatever way I can to ensure they’re able to integrate more easily into the corporate world, as well as offer guidance on specific industry knowledge for those interested in my field. Peter Akanko (he/him) (Entrepreneurship, Innovation and Management, 2021) Job role: CEO, Kente Master Industry expertise: Fashion, textiles About Peter Peter has eight years’ experience in entrepreneurship from running his own fashion business called Kente Master which he started in Ghana and grew into an international business selling to customers in 16 countries across the world. He is an active member of the Ingenuity Lab, the university’s hub which helps students, alumni and staff to launch and scale their businesses. Peter is also a lecturer at the Nottingham Trent University business school and assistant course leader on the joint honours in Entrepreneurship in charge of first year students. Not only does he teach entrepreneurship modules, he is also actively involved in designing programmes to enhance the experiences of students. Peter is passionate about entrepreneurship and innovation for social impact and looks forward to networking and sharing his experiences with others who have similar interests. Why Peter is supporting the Black Industry Connections and Empowerment Programme I find great pleasure in mentoring youth, especially around career development and the BICEP programme resonates so much with me with its aim being to empower students from black heritage to expand their personal and professional networks. Reflecting on the challenges I have faced myself as an individual of African heritage and some of the hurdles I still encounter in my career an Entrepreneur, I see this as a great opportunity to share my knowledge and experiences with them which I believe will greatly equip them as they navigate their own career paths especially those interested in entrepreneurship. I also look forward to networking with other mentors and key players in the BICEP programme and hopefully forming relationships or partnerships that will be beneficial in creating further impact. Victoria Adekunjo (she/her) (Chemical Engineering, 2017) Job Role: Desinger Engineer, Sabsco Industry expertise: Oil and gas About Victoria Following my graduation from the University of Nottingham and a well-deserved breather, I've been immersed in the engineering realm for the past five years. During this time, I've been deeply involved in the exciting tasks of conceptualising and spearheading projects dedicated to pre-commissioning cleaning, with a global reach that spans Sweden, Ivory Coast, and France. Why Victoria is supporting the Black Industry Connections and Empowerment Programme I wish to use this opportunity to provide guidance to young Black students who may not possess a comprehensive understanding of life beyond the academic realm. My objective is to serve as a resource for their inquiries and to elevate their awareness of potential opportunities they may not be familiar with within and outside the university. About IJ IJ is an accomplished and visionary Director with over 15 years of experience in Programme Management and Leadership. She is a recognised as a trusted advisor to clients on multi-billion-pound projects, programmes, and portfolios, with a track record of delivering successful outcomes for major projects across diverse sectors, including infrastructure, aviation, oil & gas, energy & utilities, and nuclear. As a strategic leader with a strong reputation, IJ is committed to driving innovation, sustainability, and diversity in major projects, consistently enabling the realisation of defined objectives, benefits, and outcomes. She is also a proactive advocate for Equality, Diversity & Inclusion (EDI), driving cultural change and empowering teams to excel. Why IJ is supporting the Black Industry Connections and Empowerment Programme To give back and empower students with insights on how to prepare for the industry and get a head start in their career. Junelle Ayettey (she/her) (Philosophy and International Commercial Law, 2020 and 2021) Job role: IT Infrastructure and Network Engineer, Clifford Chance LLP Industry expertise: IT, technology About Junelle I completed both Secondary School and Sixth Form education at state schools in Croydon with the plan of studying law at university. I went through clearing which led me to the University of Nottingham to study Philosophy for my undergraduate degree and it certainly was the best choice I made. I also pursued my master's in international Commercial Law at Nottingham. After graduating I joined Clifford Chance in February 2021 and started an IT Engineering graduate scheme where I have rotated in different teams such as Systems Engineering, Storage Engineering and I'm currently in the Network Engineering and Security team. Why Junelle is supporting the Black Industry Connections and Empowerment Programme Mentorship is a powerful tool, it connects people who are passionate about helping others and sharing lessons to others and is something I have benefitted greatly from. I was a recipient of the Sir Andrew Witty Scholarship for all three years of my undergraduate degree and it opened my eyes and mind to a range of opportunities after university. It allowed me to network with industry professionals and boosted my confidence. Now that I have started my career I would love to help students on their career journey. Tobi Ruth Adebekun (she/her) (French & International Media with Communication Studies, 2014) Job role: Communications Manager, Netflix Industry expertise: PR, media, entertainment, technology About Tobi Ruth Tobi Ruth has previously volunteered at the university supporting 'Where are they now?' events for the Faculty of Arts, Spotlight on Arts into Tech, Career Mentoring and was a mentor for first Black Industry Connections and Empowerment Programme last year. Her professional career includes roles at a number of high profile institutions in the arts and entertainment world; Netflix, The Barbican and Snap Inc (Snapchat). Why Tobi Ruth is supporting the Black Industry Connections and Empowerment Programme I supported it last year and it was great! Mentoring is really important to me. Edward Adeshina (he/him) (Mathematics and Economics, 2013) Job role: Finance Manager at PwC Industry expertise: Financial advisory About Edward After leaving university, I started a journey in accountancy by joining the Guardian newspaper on its graduate scheme. This was then followed by time working for both a music studio company called Pirate Studios and a television company called Beyond Rights, in their respective finance departments. I am now working for PwC in their Advisory business. Away from work, I play saxophone for events, have a huge interest in theatre and love football! Why Edward is supporting the Black Industry Connections and Empowerment Programme I'd like to support students in preparation for life after university and also share bits of wisdom that will help them get the most out of their university experience. About Alfonce Alfonce is a risk and insurance professional with 10 years experience, currently working as a Risk and Compliance Manager at The Economist Group. He leads on planning, coordinating and monitoring risk assessment processes and compliance activities across the group. Why Alfonce is supporting the Black Industry Connections and Empowerment Programme I am looking to support students to better understand the corporate world and discover new opportunities. About Rosette Rosette is a social media analyst by day, utilising her background in Mathematics & Management Studies to analyse online conversations and social media content, and advise global brands on content strategy. Alongside her day job, she is a second-hand and sustainable fashion content creator with over 10 years' experience in the “thrifting” scene, and the founder of Revival London, a slow fashion brand on a mission to eradicate textile waste by redesigning discarded textiles into contemporary pieces. Why Rosette is supporting the Black Industry Connections and Empowerment Programme I’d love to support young black students who are ambitious and keen to learn from others ahead of them in a career (or life journey). I’d like to give back by sharing my story and experience, and hence help lead them on a great path with their career. About Lukeki Lukeki is an epidemiologist working in public health. Her areas of expertise and interest are infectious disease, healthcare systems strengthening and One Health. She has also previously worked for the NHS and in medical communications. She holds an MSci degree in Biochemistry and Genetics from The University of Nottingham and has fond memories of the George Green library and living in Lenton. As a female scientist Lukeki is passionate about encouraging more girls to pursue STEM. She is passionate about Africa's sustainable social and economic development and has previously been involved in the NGO Diaspora for African Development. She recently completed a MSc Public Health at the London School of Hygiene and Tropical Medicine. Why Lukeki is supporting the Black Industry Connections and Empowerment Programme Throughout my career I have benefitted tremendously from having mentors from different sectors who have not only helped me navigate my career journey but helped me develop the necessary skills to succeed. Representation matters and having a mentor from my background who I could go to for advice and acknowledgement of some of the difficulties that are faced in the workplace by ethnic minorities was an incredible help. Being part of BICEP to support students through what can be an overwhelming time would be a great opportunity to give back and 'pay it forward'. Tolu Falade (Electrical and Electronics Engineering, 2012 - Loughborough University) Job role: Offshore Subsea Operations Specialist at BP Industry expertise: Energy About Tolu Tolu is an award-winning chartered engineer with over 10 years of experience in the energy industry and a demonstrable track record of delivery of high value projects in the energy industry. His extensive subsea experience in global projects, as well as onshore and offshore operations, has given him a strong technical foundation in oil and gas operations, operating discipline, and safety leadership. In his current role as Production Team Leader, he is responsible for leading a team to safely maximise production from one of bp’s largest fields in the UKCS. His strategic and continuous improvement initiatives have unlocked millions in commercial value, with wider reaching impacts on bp projects across the globe. His commitment to excellence has earned him a reputation as a high-performing professional and he is particularly passionate about inspiring the next generation to pursue a career in the energy industry Why Tolu is supporting the Black Industry Connections and Empowerment Programme Continuing on from last year, I am super excited to help provide the next cohort of the BICEP program with any advice and support that could help them in their career. I can only imagine how much I'd have gained from something like this when I was in uni, and I hope to be able to help in some way If you're interested in supporting future BICEP cycles as a mentor, please get in touch with us at BICEP@nottingham.ac.uk."
        }
    ],
    "pdf_files": []
}