{
    "url": "https://www.nottingham.ac.uk/alumni/50-years-of-mri-at-nottingham",
    "content": [
        {
            "p": "This month marks the 50th anniversary of Nottingham's own Professor Sir Peter Mansfield publishing his first research paper on magnetic resonance imaging - known to you and I as MRI – an invention which came to revolutionise medicine, and one that the University of Nottingham continues to advance. Remind yourself of Professor Sir Peter's legacy to the world and see how we're continuing to evolve the uses of MRI in the present day. A classically trained physicist, Professor Sir Peter Mansfield had immersed himself in the field of nuclear magnetic resonance (NMR) for over a decade before his first paper on the topic of Magnetic Resonance Imaging (MRI) was published in the Journal of Physics: C in November 1973. He had realised he could exploit the phenomenon of NMR to create cross-sectional images of living tissue. He developed a safe and non-invasive technique to create images of soft tissue and organs in a 'slice' of the human body in spectacular detail, revolutionising medical diagnosis and changing how the human brain is studied. This research was the start of the development of MRI, which has since changed the face of modern medicine, enabling doctors to see detailed images of the interior of the living body without the potentially harmful effects of radiation or surgery. It culminated in Sir Peter receiving the Nobel Prize in Physiology or Medicine alongside esteemed chemist Paul Lauterbur in 2003, for his work at Nottingham developing MRI. MRI can now detect in great detail the presence of cancer and signs of damage in the body’s bones, tissues and organs. Today, MRI scanners are used in hospitals all over the world and over 60 million investigations with MRI are carried out every year. Appropriately, the Sir Peter Mansfield Imaging Centre (SPMIC) is now the home of MRI at the University of Nottingham, and it has gone from strength to strength since opening in 1991. Academics are exploring the capabilities of MRI to reveal new insights into the human body; from placental blood flow, to how the gut works to digest food, to further understanding the complexities of the brain. It is a particularly exciting time at the SPMIC with the recent announcement of a £29.1m grant to establish a new '11.7T' MRI scanner, creating a national research facility at the centre here in Nottingham. A thousand times more powerful than the first scanners developed by Sir Peter, this ultra-high field scanner will enable the university to attract and collaborate with researchers around the world, helping to improve our understanding of neurodegenerative diseases such as Alzheimer's and Parkinson's, plus neurodevelopmental disorders including autism among many others. Rather aptly, the Director of the SPMIC today is former student of Sir Peter, Professor Richard Bowtell (PhD Physics, 1988). The new funding award, from UK Research and Innovation, is thought to be the largest ever single award received by the University of Nottingham. It is part of a 3-year £481 million injection of funding into the UK’s research and innovation infrastructure, to support ground-breaking research to address global challenges. The University of Nottingham will work with teams across the UK to establish the 11.7T Tesla MRI scanner as a national facility that will underpin the UK’s goal of retaining its position as a world leader in ultra-high field for brain imaging and spectroscopy. Read more about how we're adapting MRI technology for other life-saving treatment in our Connect article or donate to medical research at Nottingham. For our second Nottingham Ambition Giving Day, we’ve found inspiration in our university motto: 'Sapientia Urbs Conditur', 'A city built on wisdom'. But what's in our motto's name? We asked Professor of Classics, Helen Lovatt, to look into the origins of the university's motto and its historical significance. The Henley Regatta is perhaps one of England's most revered and iconic sporting occasions, dating all the way back to 1839. It’s said that university friendships last a lifetime – meet a group of alumni celebrating a golden anniversary who are certainly evidence of it! This year we asked you to share your formative gig-going experiences, both on and off campus – here’s a selection of the best!"
        }
    ],
    "pdf_files": []
}