{
    "url": "https://www.nottingham.ac.uk/alumni/meet-our-2023-volunteer-award-winners",
    "content": [
        {
            "p": "June saw us mark National Volunteers Week with our own 'Celebration of Volunteering' event here on campus at Lakeside Arts. The programme is definitely worthy of celebration with over 1,000 of you giving your time in the last academic year alone! We were also delighted to celebrate three volunteers in particular: our Alumni Volunteer of the Year, International Volunteer of the Year and Community Volunteer of the Year. Our annual Volunteer Awards, which we first celebrated in 2016, recognise volunteers from across our campuses in the UK, China and Malaysia. The awards celebrate people who have made outstanding contributions to the university and its community, showing exceptional dedication, creativity, innovation or leadership. This year we were delighted to celebrate our winners in three categories: Volunteer roles: Entrepreneur in Residence (Ingenuity Lab), Nottingham University Business School speaker, Entrepreneurship and Business Mentor, Career Mentor, Business Alumni Insight Series speaker. \"Keith deserves to win this award for his amazing contribution to our Haydn Green Institute, the Business School and wider university community. He is so generous with his time and has also provided support to the wider university community by introducing members of staff from outside the Business School to his network of contacts.\" \"Keith's long and continuous support to a wide range of calls for support which have included being a guest speaker, mentor, coach and also a co-designer and guest lecturer of executive education courses. \"Keith has given his insight, experience and his valuable time to support whenever asked by the university and to my knowledge has never declined a request. His support over many years is noteworthy especially when faced with requests from many other organisations.\" Volunteer role: International Alumni Ambassador. Surya's nomination: \"Nila is one of our international alumni ambassadors for Indonesia and has been instrumental in keeping the alumni community in Jakarta connected. Since her appointment last year, she has helped the university organise two formal alumni engagement events. \"Nila offered regional intelligence to the International Volunteering & Advocacy Team as to the expectations of local alumni, liaised directly with the venue to negotiate a contract and ensure the room set up fit our requirements, as well as helped us boost registration and attendance numbers by promoting the event amongst her own vast networks. \"Nila encompasses the university values and is a very enthusiastic and driven volunteer. She has been an excellent advocate for her alma mater, effectively helping us increase the university’s brand, reputation, recruitment numbers and alumni community spirit within Indonesia.\" The Pharmacy Patient Café project was established with Cascade funding during the Covid-19 pandemic to improve person-centered care by giving pharmacy students counselling practice and opportunities to interact with patients. The group's nomination: \"Many of our volunteers stepped in at short notice to ensure that students continued to have the opportunity to practise their communication skills with real-life patients. \"Positive feedback from students has led to these sessions now being embedded within the MPharm curriculum, and the commitment to student learning from our volunteer patients has really helped students across all years. \"They are a real asset to the programme and the sessions they provide make a huge difference to the student experience by providing students with real-life opportunities to interact with patients from all walks of life, helping to develop them in to caring, compassionate pharmacists of the future.\" Inspired by our award-winning volunteers? Register your interest in volunteering with us today. Five things you need to know from around the university - and beyond - during February. This month, Pryzm is no more! Graduates from the University of Nottingham continue to be among the most sought-after by the UK’s top employers, a new study has found. The first UK university to establish campuses overseas at the turn of the new Millennium: first in Malaysia and then in China − this month we have been celebrating 20 years of our Ningbo campus."
        }
    ],
    "pdf_files": []
}