{
    "url": "https://www.nottingham.ac.uk/alumni/community/your-nottingham-alumni-awards.aspx",
    "content": [
        {
            "p": "Our awards celebrate your amazing contributions and share the stories of how you carry Nottingham's values into the world. Nottingham is more than a place. It shapes who we are and the people we become. It's a way of thinking and of being. Your Nottingham Alumni Awards celebrate you – our alumni community – and share the stories of how you carry Nottingham's values into the world. No two paths or experiences are the same; that's what makes our community so special. Our awards are designed to reflect this rich diversity and the amazing contributions being made in so many different ways. The awards actively seek nominations of alumni from all communities, particularly those within often underrepresented groups. Nominations for the 2025 Your Nottingham Alumni Awards are now open! We want to hear about alumni whose achievements inspire you and who make a positive difference to those around them. Fill in our online form to submit your nomination – entries close on 12 January 2025. Find out more about the Awards and take a look at our tips for completing your nomination. We are committed to creating an equitable selection process and want applicants to feel able to share personal information where relevant as part of the application process, to allow us to determine that the nomination process is capturing a diverse and inclusive representation of University of Nottingham alumni. The hundreds of nominations we received this year were truly inspiring, spanning many different countries, sectors and achievements and demonstrating impact in such a huge range of spheres and communities. We're proud of the positive impact that our alumni make – meet our 2024 winners. Vincent Egunlae is a multi-award winning change-maker. Vincent is an accomplished public speaker on creating equity, receiving over 1.3m views as part of One Young World, the pre-eminent global programme for future leaders. Vincent also co-founded The Open Private School, a charity which seeks to provide state school educated students with opportunity, directly impacting over 150 students in three years. These immense community contributions saw Vincent named the UK’s ‘Best Young Professional’ by the Black British Business Awards in 2022, receiving acknowledgement from the Prime Minister. Elizabeth Hall MBE (nee Clark) graduated with a BA in psychology in 1990. Her career began in the press office of Action Aid before joining PR company Freud Communications. Fast-moving consumer goods (FMCG) agency marketing roles followed before becoming Marketing Director of The Carbon Neutral Company and teaching yoga at Holloway Prison. In 2018, driven by the belief that no-one should be held back from participating in society because they cannot afford to wash their hair, clothes, brush their teeth, use period products or change their baby’s nappy, she set up The Hygiene Bank. With nearly 600 volunteers and 200 local projects across the UK, 1,539,182kg of basic hygiene products were distributed in 2023 to over 1,000 community partners, including schools, food banks, women’s refuges and homeless shelters. Sarah Hayford is the Founder and CEO of The Land Collective, a social mobility organisation founded when she was a student at the University of Nottingham. The organisation supports young people from underrepresented backgrounds into careers in real estate and the built environment sector by providing employability programmes, career opportunities and educational resources. The Land Collective was listed as one of the Top 100 Social Enterprises in the UK in 2023. Sarah began her career in commercial real estate shortly after graduating and specialised in retail. Credit: Michael White Lauren James is the Carnegie-longlisted British author of many Young Adult novels, including Green Rising, The Reckless Afterlife of Harriet Stoker and The Loneliest Girl in the Universe. They are a RLF Royal Fellow at Aston University and the story consultant on Netflix’s Heartstopper (seasons two and three). Lauren is the founder of the Climate Fiction Writers League, editor of the anthology Future Hopes: Hopeful stories in a time of climate change, and a member of the Society of Authors’ Sustainability Committee. They work as a consultant on climate storytelling for museums, production companies, major brands and publishers, with a focus on optimism and hope. They run a Queer Writers group in Coventry. Trang Chu Minh has devoted her career to leveraging storytelling to drive positive change in underreported social and environmental issues. She has worked on a multitude of high-impact campaigns, from advocating for the first state law banning child marriage in the US, to facilitating the opening of the UK’s first safe house for LGBTQ+ refugees, and campaigning for Indonesia’s first provincial ban against plastic bags. She is currently in charge of sustainability communications and thought leadership for Singapore’s sovereign wealth fund, in addition to serving as a running guide for people with disabilities and volunteering for projects promoting wildlife conservation and disability inclusion. Her contributions earned her the One Young World Campaigner of the Year Award in 2023. Meet last year's winners and discover what receiving an award means to one of the recipients, Jonelle Awomoyi."
        }
    ],
    "pdf_files": []
}