{
    "url": "https://www.nottingham.ac.uk/alumni/the-future-of-fintech",
    "content": [
        {
            "p": "Financial technology is changing the way we handle money - from mobile banking to digital credit and blockchain. With over a decade of experience in financial services, Jordan Buck joined us to explore the latest themes in the fintech sector, including the new rush towards profitability over 'growth at all costs', whether the large banks will ever catch up on innovation, if anywhere can match Silicon Valley, and the prospects of using generative AI in fintech. Jordan is co-founder and president of fintech wealth management firm Cadro. After training as a chartered accountant, he went on to managing roles in investment banking and private equity, gaining recognition as one of the City of London’s Top 40 Under 40 Private Asset Managers in 2020. Jordan graduated from the University of Nottingham with a Sutton Trust scholarship, and is currently a guest lecturer at The London Institute of Banking & Finance (LIBF). This recording is from our Nottingham University Business Alumni Insight Seminar series. Keep up to date on the latest NUBS alumni events. Speaker: Jordan Buck (Cadro) If you can innovate, and spread innovation in health care, you can innovate anywhere. The workplace changes introduced in response to Covid-19 have provided the opportunity to reset team dynamics. The University of Nottingham’s Centre for Inclusive Financial Technology (INFINITY) has been awarded a new £1.4 million grant from Research England to develop a fintech hub in the heart of the city. Situated on the university’s new Castle Meadow Campus, the INFINITY hub will be located alongside Nottingham University Business School and leading businesses in the financial sector, including KPMG, who are relocating their Nottingham office to the new campus in the city centre. Hear from a panel of expert alumni as they delve into the rapidly growing world of financial technology and its impact on the global economy."
        }
    ],
    "pdf_files": []
}