{
    "url": "https://www.nottingham.ac.uk/alumni/a-hybrid-working-nation-how-its-working-out",
    "content": [
        {
            "p": "Over the last three years the way we work, interact and do business has fundamentally changed with the increased prevalence of hybrid and remote working. Between April and September 2022 Fiona Frost and Miguel Munoz, both postgraduate students in the NUBS Organisational Behaviour and Human Resource Management department, carried out a detailed survey to try and quantify the true impact on the workplace. To investigate this change in work setting, in the first stage of the research project, survey data was collected from over 500 hybrid workers in the UK to understand the impact of work settings on employees’ wellbeing, engagement, and performance. Following this, in the second stage of the project, a sample of respondents were interviewed to provide deeper insights into their experiences of the opportunities and challenges associated with hybrid working. We believe this research offers powerful information for organisations, firstly to increase awareness in this fast-developing area, but also to enable the improvement of existing workplace policies to primarily support employee wellbeing, and to ultimately improve job performance. The results from the study indicate that 59% of respondents often or always feel happy, with some respondents noting that working from home has had positive impacts on mental health and wellbeing as it has enabled them to re-address their work-life balance and, more generally their priorities in life. However, these positive sentiments were not shared by the 41% who reported feeling unhappy or depressed most of the time, with personal needs being neglected in favour of work requirements. An important research finding was that the wellbeing of those in the under 20s age category ranked 9.7% lower than the 21-30 age category, and 10% lower than the older age categories (31-40 and 41-50). The qualitative study supported this finding, with potential reasons for lower well-being in the under 20s age category being explained by factors such as early career employees expressing a greater desire for in-person training and learning opportunities, as well as face-to-face interactions to develop their networks and relationships with colleagues. The survey found that 64% of respondents are enthusiastic about their job, 69% feel appreciated at work, and 66% are proud of their work; however, differences between early-career employees and more established employees were noted. Engagement in the under 20s age category ranked 17% lower than the 21-30 age category, 18% lower than the 31-40 and 41-50 age category, and 22% lower than the 51-60 age category. Explanations in the qualitative study for this finding include early career employees preferring to be in close proximity to other colleagues where knowledge sharing and teamwork is encouraged, which in turn increases their motivation and engagement. Technology was seen as an enabler by 64% of the survey respondents, and the same number also indicated that technology is a key factor in terms of their productivity. Overall, hybrid working reduces distractions and commuting time, thereby increasing employees’ flexibility and productivity during their working day. To summarise, the hybrid working nation study has evidenced the pivotal role of enterprises and managers as facilitators of employees being able to properly adapt to a hybrid work setting. The need for a greater emphasis on early-career employees and increased measures to help this group of the working population adapt is highlighted as a key area for future research and workplace policy development. Read the full report Fiona Frost and Miguel Munoz Since graduating in 2017, Junyi Xiao has seen her business grow from an initial idea into a multinational venture, employing 18 staff and providing logistics management services for several large clients based around the world. With offices in Nottingham and Shenzhen, and a Singapore branch on the horizon, Junyi has been able to put her International Business degree into practice from the start. The Charter for Inclusive Entrepreneurship, an initiative by Dr Lorna Treanor, was launched nationally in October at the Shard in London. The Charter aims to minimise barriers to entrepreneurship for underserved and under-represented groups through creation of a more inclusive ecosystem. Gain invaluable insights into overcoming imposter syndrome with high performance coach Anna Mosley (Management and French, 2005). Two of last year’s five national Ingenuity Programme winners were University of Nottingham alumni – Climate Champions, Pipeline Organics – a team of Nottingham-based biochemists and engineers – and Food Sciences alumnus Jared Spencer, who won UoN Impact Entrepreneur of the Year for his business Riddim Snacks."
        }
    ],
    "pdf_files": []
}