{
    "url": "https://www.nottingham.ac.uk/alumni/alexander-mclean-reimagining-failure-1",
    "content": [
        {
            "p": "Alexander McLean (Law, 2007) is Founder and CEO of Justice Defenders, Senior TED Fellow, Ashoka Fellow and UK Young Philanthropist of the Year – and speaker at our recent Live talk here on campus at Lakeside Arts. Alexander detailed how overcoming failure and rejection is inherent to the identity of Justice Defenders, which addresses the global justice gap by equipping justice defenders through legal education, training and practice. Alexander shared his journey from Nottingham to Founder and CEO, tracing the evolution of Justice Defenders from aiding the defenceless at its outset to reforming the system altogether. With our highlights from the event, learn from Alexander how to reimagine failure as a gateway to success, how setbacks can lead to growth and how even a failing system can still propel you to achieve greater things. Alexander began his studies at Nottingham following, \"a really transformative\" gap year, during which he travelled to Uganda. Here he visited prisons and hospices, fundraising to provide better health facilities and educate Ugandan inmates about the law. His experiences in the country drove him to first establishing the 'African Prisons Project' as a student society while here in Nottingham – combining his studies in law with a passion to support those imprisoned who are failed by their justice systems. After graduating from Nottingham, he moved to Kampala where he created a team of local and international staff and volunteers to develop the work of the African Prisons Project. Now called Justice Defenders, Alexander's vision has grown to a charity employing 350 people working across three African countries. If you missed joining us in person or online, our next Live talk will take place in the spring. Make sure your email address is up to date to receive invites to all our relevant events – coming next will be our webinars in November. In conversation with alumni Preet Grewal (Production Engineering, 1988), Roy Twite (Production Engineering, 1988) and first-year Chemical Engineering student, Rene-Ioic Betek. We meet Levison Wood (History, 2004), best-selling travel writer, explorer and photographer, to find out about the ‘best job in the world’. Resilience is defined as the capacity to withstand or recover quickly from difficulties - and it is a key skill which employers value. So, how do you know if you have it? Sue Mason from the NUBS Postgraduate Careers team shares 10 ways in which you can learn to build your resilience. In the past, many people would choose a career and stay with it until retirement. These days, however, it is much more common to change direction one or more times. Our resident Careers expert, Sue Mason, provides us with some expert advice on securing the next move in your career"
        }
    ],
    "pdf_files": []
}