{
    "url": "https://www.nottingham.ac.uk/animalresearch/legislation/legislation.aspx",
    "content": [
        {
            "p": "This Act regulates the use of protected animals in any experimental or other scientific procedure which may cause pain, suffering, distress or lasting harm to the animal. Protected animals under the Act are any living veterbrae other than man and any living cephalopod. It is an underlying principle of the Animal (Scientific Procedures) Act 1986 that animals bred, supplied and used for scientific procedures are cared for in accordance with the best standards of modern animal husbandry. The regulated procedures covered by this Act are controlled using a triple licensing system enforced by the Home Office. Guidance on the operation of the Act can be found on the Home Office website. This Act updates the Protection of Animals 1911 Act. It details (in section 9) the duty to ensure animal welfare and to take all reasonable steps to ensure an animals needs are met to the extent required by good practice. If an individual does not have appropriate licence authorities in place under the Animals (Scientific Procedures) Act 1986, then the provisions of the Animal Welfare Act 2006 may apply. This specifies that only a qualified veterinary surgeon registered with the Royal College of Veterinary Surgeons (RCVS) can carry out acts of veterinary surgery in the UK. This includes diagnosis, medical and surgical treatments, and the performance of surgical operations. Surgical procedures carried out for scientific purposes are not covered by this Act. Anyone wishing to conduct such procedures must have undertaken the appropriate Home Office approved training and have appropriate licence authority under the Animals (Scientific Procedures) Act 1986. Prescription only medicines for the treatment of animals must be controlled by a veterinary surgeon. This also applies to treatment required for animals used in scientific procedures. Full versions of all the acts mentioned above can be found at www.legislation.gov.uk University Park bsu@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}