{
    "url": "https://www.nottingham.ac.uk/animalresearch/policy/policy.aspx",
    "content": [
        {
            "p": "The University of Nottingham conducts world class research that addresses global issues and challenges. This research includes areas of human and veterinary medicine that are of importance to us all. These areas include diseases of the elderly, cancer, obesity, diabetes and infection control. The University is actively engaged in the development of a number of alternative methods such as computer modelling, tissue culture, cell and molecular biology, and research with human subjects. This is reflected in the many different approaches that are involved in the research programmes including the use of in vitro and computer modelling. However, it is also recognised that the complexity of both man and animals cannot always be fully replicated by alternative systems and therefore the use of animals is still required to meet specific research objectives. The University is committed to the principles of the 3Rs of reduction, refinement and replacement. For each project it ensures, as far as is reasonably practicable, that no alternative to the use of animals is possible, that the number of animals used is minimised and that procedures, care routines and husbandry are refined to maximise welfare. This process is undertaken by The University's Animal Welfare and Ethical Review Body (AWERB). This body involves lay representation plus external and internal members. It provides advice on the application of the 3Rs, matters relating to the welfare and care of animals, management and operational processes within facilities and the suitability of project proposals and subsequent review. All work involving vertebrate animals conducted by the University of Nottingham is considered by our AWERB even if this work is below the threshold requiring regulation under the Animals (Scientific Procedures) Act 1986 (ASPA). Where regulated procedures are carried out, ASPA licence authority, issued by the Home Office, is required. The detailed conditions which apply to the programme of work covered in the project licence, the conduct of personal licence holders undertaking procedures and to the standards of accommodation, care and welfare required in the establishment licence must all be adhered to. The welfare of animals is a primary concern of the University. It therefore expects that such work is conducted to the highest standards, meeting or exceeding the legal requirements and associated guidance issued by the Home Office. All involved must undertake appropriate education, training, supervision and competency assessment before undertaking procedures with animals. The importance of our moral and legal obligations underpins our culture of care and compliance. The University expects all its staff and students to follow the ethical behaviours set out in the Nolan Principles. Those are: selflessness, integrity, objectivity, accountability, openness, honesty and leadership. These Principles underlie the University’s Ethical Framework and are incorporated into this policy. The University of Nottingham fully supports and endorses the ARRIVE guidelines developed by the NC3Rs, to improve the design and reporting of studies involving animals. The ARRIVE guidelines are actively promoted by the AWERB for use by licence applicants; during training courses and within research group seminars. The University recognises that high standards of animal welfare contribute to good scientific outcomes and this policy helps ensure that new knowledge acquired will ultimately benefit mankind and, in the case of veterinary research, other animals. University Park bsu@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}