{
    "url": "https://www.nottingham.ac.uk/animalresearch/animal-research-case-studies/animal-research-at-the-university-of-nottingham.aspx",
    "content": [
        {
            "p": "Each year in the UK there are over 66,000 open fractures where the bone has penetrated through the skin with a high risk of infection despite optimal initial surgery. Many of these fractures are associated with bone loss which requires bone grafting. To speed up treatment and minimise bone infection experts in orthopaedics and sports medicine have developed a bone-scaffold material which can be impregnated with a combination of antibiotics and is gradually resorbed as the patient’s bone reforms. The product has prevented infection in a sheep model of bone injury with bacterial contamination and successfully encouraged new bone ingrowth. Dolly the sheep represented a milestone in developmental biology. However, after being diagnosed with osteoarthritis at the age of 5 there were concerns that she might be ageing prematurely. Researchers at Nottingham were presented with an unparalleled opportunity to formally assess healthy ageing in a cohort of aged cloned sheep – 4 dollies and 9 other clones. The team assessed their metabolism, cardiovascular system and musculoskeletal health and their results showed that the sheep were apparently healthy with no age-related, detrimental health effects that could be attributed to cloning. The results were published in Nature Communications in July 2016. Exercise has been shown to improve and prevent both physical and mental diseases and is increasingly being used for the treatment and prevention of mental disorders. Understanding how this happens will help in the development of new treatments to boost or mimic the positive effects of exercise on health. Wild young male mice housed were used to study the molecular changes that take place in the body when exercise takes place. Acute Kidney Injury (AKI) is a rapid deterioration in kidney function. It is a serious condition that occurs in 10 to 20% of patients admitted to hospital. If patients at risk are identified early enough AKI is preventable and can be treated. Working with clinicians at the Nottingham University Hospitals NHS Trust’s Renal and Transplant Unit scientists have established a preclinical model of AKI identifying an early and unique urinary marker of deteriorating kidney function. They have also shown that patients admitted to an ICU or for cardiac surgery and whom subsequently develop AKI, have higher urinary levels of the marker. The team have secured funding from The National Institute for Heath Research, Innovation for Invention to develop a point-of-care-test. University Park bsu@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}