{
    "url": "https://www.nottingham.edu.my/AppliedPsychology/Research/Postgraduate-Research-Students.aspx",
    "content": [
        {
            "p": "There are a number of postgraduate students in the division studying for PhD degrees in various areas of applied psychology. The objective of my thesis research is to explore the relationships among the constructs of negative events related to performance management (PM) system, negative emotions, perception of fairness, acceptance of PM system, work engagement and turnover intention.The first part of this study aims to explore the negative events (related to PM system) which are significant to the general workers of manufacturing factories in Malaysia. The major negative emotions correspond to major negative events were determined from this part of the study as well. In-depth interviews and focus group discussion were organised to obtain insights from participants. In the second part of this study, the major negative emotions identified from the first part of the study were correlated to three work attitudes – acceptance of PM system, work engagement and turnover intention. In these relationships, it was hypothesised that perception of fairness acted as a mediator. Research interests: Performance management, emotions in the work place, organisational justice, training and evaluation, knowledge management in organisations, organisational culture, and applied psychology in factory environment. Supervisor: Dr Hazel Melanie Ramos & Dr Angelli Santos Research topic: Employee Engagement among Gen-Y employees in financial sector of Malaysia. Background of research: To investigate the impact of engagement drivers in fostering employee engagement in the financial sector in Malaysia. The study aim to identify the research gap of generation variances specifically the Generation-Y at workplace in enhancing engagement by looking at three main moderators role; gender, job demand and employee characteristics. By end of the study, it is hope that the research will contribute to the existing body of knowledge by closing the gap of generation variance. Research interests: Talent Management, Human Resources Management, Organisational behaviour, Change Management Supervisor: Dr Hazel Melanie Ramos & Dr Laura Pretto Research topic: Motivation Factors in the Workplace. My research focuses on the workplace experience of the working Malaysian, with a focus on the effects of psychological factors such as Meaning, Recognition, and Autonomy. The current focus is on Malaysian academics, it is hoped that future papers will focus on other fields and job roles in determining how to achieve a more psychologically balanced experience in work and to provide a theoretical framework within which organizations can form and create policies that will contribute to a more enriching work experience and a more psychologically healthy workforce in Malaysia. Research interests: Workplace dynamics, Positive Psychology, Consumer behaviour/Behavioural Economics and Psychology. telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}