{
    "url": "https://www.nottingham.edu.my/AppliedPsychology/People/riskyharisa.haslan",
    "content": [
        {
            "p": "Digital Learning Director (FASS); Deputy Head of School; Director of Teaching and Learning; Assistant Professor in Applied Psychology, Faculty of Medicine & Health Sciences Risky Harisa Haslan is an Assistant Professor in Applied Psychology at the University of Nottingham Malaysia. She's currently the division's Deputy Head, and Faculty of Arts and Social Science's Digital Learning Director. She lectures Selection and Trainings in Organisation at undergraduate level and two postgraduate courses; Strategic Human Resources Management & Managing Diversity and Qualitative Research Methods. Risky was born and raised in Indonesia. She completed her undergraduate degree in Management Studies at the University of Nottingham Malaysia in 2009, and later that year she pursued her MSc in Management Psychology at the University of Nottingham, UK. A year after completing her MSc in 2010, Risky decided to do her PhD in Applied Psychology at the University of Nottingham Malaysia in 2011, where she eventually became a lecturer. Risky mainly concentrates on aspects of management psychology. She is greatly interested in workplace diversity (specifically genders, races, sexual orientations, and psychological conditions), coaching, and occupational health. Throughout her research activities, she has worked with organisations (including Indonesian state-owned enterprises, private enterprises, and family firms) that were interested in understanding further the management psychology aspects of their organisations. In one of her works with a state-owned enterprise (SOE), she developed a mentoring and coaching system that would fit the SOE's cultural context and trained managerial level employees to develop their psychological capital through action learning. She's also interested in raising awareness of well-being at work and what organisations can do to manage their employees' occupational health and to reduce work-related burnout. These days, Risky's research interest includes online gaming and fan-related works. Online streamers, fan artists, and cosplayers have raised in popularity like never before yet not much has been done to create a safe working environment for them. Risky received The Most High-Tech Lecturer in 2016 from the Student Association University of Nottingham Malaysia. She also received a Lord Dearing Award from the University of Nottingham in July 2018 and Excellence in Teaching and Learning Award from the Faculty of Arts and Social Science in 2019 for her outstanding contribution to the development of teaching and student learning. Risky is a Certified Action Learning Coach (CALC) from World Institute of Action Learning (WIAL) and is recognised as a Fellow of Advance HE (Formerly known as UK Higher Education Academy). Risky is currently teaching the following modules: Risky has taught the following modules: Risky generally is interested in management psychology. Her main interest involves generational gaps at work, organisational change, work and fandom/gaming culture, Asian leadership styles, and… read more telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}