{
    "url": "https://www.nottingham.ac.uk/arts/research/visiting-fellows.aspx",
    "content": [
        {
            "p": "We are interested to hear from academics from other universities and independent research institutions in the UK, European Union and globally who wish to come and spend time with us to collaborate on research projects and/or to use our internationally recognised manuscript and book collections and archives. The programme provides outstanding academics based in any country overseas with the opportunity to be based at a UK higher education or other research institution for 3 to 6 months. The programme is open to academics at any postdoctoral career stage, and in any discipline within the humanities and social sciences. The maximum funding available is £33,000. Closing date is November each year. British Academy Visiting Fellowships The Fulbright University of Nottingham Award covers a 3 to12 months project for research or teaching across any research active department at the University of Nottingham. This funding is intended as a contribution towards US-UK travel, institutional fees, accommodation, and general maintenance costs while in the UK. The funding rate is £2,625 per month. Closing date is September each year. Fulbright Scholar Awards These awards enable distinguished academics based overseas to spend between 3 and 12 months inclusive at a UK university, primarily to enhance the skills of academic staff or the student body within the host institution. It is recognised that Visiting Professors may also wish to use the opportunity to further their own academic interests. The over-riding criteria for selection are first the academic standing and achievements of the visitor in terms of research and teaching, and secondly the ability of the receiving institution to benefit from the imported skills and expertise. Priority will be given to new or recent collaborative ventures. Closing dates are May and October each year. Leverhulme Visiting Professorship Scheme If you need help with your funding application contact the Faculty of Arts Research Accelerator team. For course and admissions enquiries see our enquiry page For Faculty contacts see our contacts page"
        }
    ],
    "pdf_files": []
}