{
    "url": "https://www.nottingham.ac.uk/arts/research/postdoctoral-and-independent-fellowships-at-nottingham.aspx",
    "content": [
        {
            "p": "We welcome exceptional candidates with strong research track records to join our world-class, multidisciplinary research environment. Independent fellowships are an excellent way of developing your research reputation and developing your career. There are a range of different types available to support people at different stages in their career, from early career postdoctoral fellowships through to senior researchers at the professorial level. If you wish to apply for a fellowship and join us at Nottingham then please make contact with the disciplinary unit you wish to be a part of, either through an existing academic contact or the listed Head of Department or School. If you need help in understanding how your project might fit with Nottingham then please contact the Faculty of Arts Research Accelerator (FARA) team who will help you identify which discipline or academics to approach and, should you wish to apply, support you with your application. This scheme offers outstanding early career researchers who have not yet held a full-time permanent academic post, the opportunity to strengthen their experience of research and teaching in an academic environment. These 3 year fellowships aim to help develop the award holder’s curriculum vitae and boost their prospects of obtaining a permanent academic post. The primary emphasis is on the completion of a significant piece of publishable research, and the integration of the award holder into the community of established scholars within their field. British Academy Postdoctoral Fellowships This scheme is for early career researchers, with a research record but who have not yet held a full-time permanent academic post, to undertake a significant piece of publishable work to enable them to obtain a permanent academic position. These 3 year fellowships are 50% funded by Leverhulme and 50% funded by the host University. Leverhulme Trust Early Career Fellowships Funding for researchers of any nationality with 2 to 7 years of experience since completion of PhD and a scientific track record showing great promise. Starting Grants may be awarded up to €1.5 million for a period of 5 years. European Research Council Starting Grant These 3 year fellowships are aimed at outstanding postdoctoral researchers who are at the early stage of their academic careers from all academic disciplines represented at the university and link to a permanent academic post, subject to performance. Nottingham Research Fellowships This cross-UK Research and Innovation (UKRI) scheme will support early career researchers and innovators with outstanding potential. These Fellowships support applicants from diverse career paths, including those returning from a career break or following time in other roles. The support offered will be long term and flexible and will provide comprehensive package of support, including the fellow's salary and justified research, staff and training costs, with 7 years of support available on a 4 plus 3 model, with a review in year 4. UK Research and Innovation Future Leader Fellowship This scheme provides funding for early career researchers from any discipline who are ready to develop their research identity. Through innovative projects, they will deliver shifts in understanding that could improve human life, health and wellbeing. By the end of the award, they will be ready to lead their own independent research programme. Wellcome Early Career Awards Supports the mobility of post-doctoral researchers within and beyond Europe - as well as helping to attract the best foreign researchers to work in the European Union. The grant usually covers two years' salary, a mobility allowance, research costs and overheads for the host institution. Individual researchers submit proposals for funding in liaison with their planned host organisation. Marie Sklodowska-Curie Actions: Postdoctoral Fellowship The International Fellowships Programme provides support for outstanding early career researchers to make a first step towards developing an independent research career through gaining experience across international borders. The overarching aim of the scheme is to attract and retain emerging talent in the UK and build a globally connected, mobile research and innovation workforce. This scheme is jointly run by the British Academy and the Royal Society. British Academy International Fellowships This programme provides mid-career to senior scholars with the opportunity to work in the UK for four years. You must be active in any discipline within the social sciences and the humanities and based in any country overseas. Applications must be for new, coherent and cutting-edge projects. The Global Professorships are expected to add significant value to the UK host institutions and vice versa, and thus the projects must be significant, leading to novel and innovative collaborations. British Academy Global Professorships ERC Consolidator Grants are designed to support researchers at the stage at which they are consolidating their own independent research team or programme. The scheme will strengthen independent and excellent new individual research teams that have been recently created. This scheme is for researchers of any nationality with 7 to 12 years of experience since completion of PhD and a scientific track record showing great promise. European Research Council Consolidator Grant Applicants for the ERC Advanced Grants - called Principal Investigators (PI) - are expected to be active researchers who have a track-record of significant research achievements in the last 10 years. They should be exceptional leaders in terms of originality and significance of their research contributions. European Research Council Advanced Grant The British Academy has launched this Researchers at Risk Fellowships Programme and the Council for At-Risk Academics (CARA). The priority of the Programme will be as a response to the Russian invasion of Ukraine, which has exposed Ukrainian-based researchers to direct threat. We wish to open the scheme more widely when possible. The Programme aims to complement and be additional to the work already being done by UK institutions, including through their existing cooperation with CARA as members of CARA Universities Network, enabling them to provide additional two-year fellowships to researchers at risk with funding of circa £37,000 per annum. Researchers and innovators supported through this Programme will be able to take up these temporary fellowships at UK institutions, continue their research, enhance their skills and build long-lasting collaborative links with UK counterparts. British Academy Researchers at Risk Fellowship For course and admissions enquiries see our enquiry page For Faculty contacts see our contacts page"
        }
    ],
    "pdf_files": []
}