{
    "url": "https://www.nottingham.ac.uk/arts/research/civic-partnerships/civic-partnerships.aspx",
    "content": [
        {
            "p": "The University of Nottingham is founded on the vision and philanthropic spirit of Jesse Boot who, in 1928, donated the land that is now University Park. In keeping with this vision we have a long tradition of working in partnership with city organisations for the benefit of the city of Nottingham and the wider region. Established in 2015 when UNESCO designated Nottingham one of a global network of Creative Cities. A charity was set up in response to the designation. They work through local, national and international partnerships to support, animate and develop the UNESCO designation, and engage young audiences in literature. We work in partnership with NuCoL to bring our research and expertise to bear on the development of talent, creativity and literacy across the city. Read more about the Nottingham UNESCO City of Literature We have worked closely with NMGS (part of Nottingham City Council.) to deliver a range of projects from developing the potential of the Players Cigarette marketing collections; supporting international collaborations on exhibitions on diverse topics from lace to dinosaurs; the redevelopment of Nottingham Castle Museum and the rebellion gallery and most recently research to underpin the redevelopment of Newstead Abbey and Wollaton Hall visitor sites. An art gallery that opened in 2009 with support from Arts Council England, Nottingham City Council, East Midlands Development Agency, Greater Nottingham Partnership, Nottingham Trent University and the University of Nottingham. Our ongoing support for Nottingham Contemporary underpins the gallery’s public programme and enables collaborative research relevant to the success of the gallery and its exhibitions. Now part of the commercial archive of the global pharmaceutical company Walgreens Boots Alliance, the Boots Archive holds the records of the original Nottingham-based Boots company and its growth throughout the 19th and 20th centuries. It is an important archive resource documenting the history of retail, reading cultures and the history of penny libraries, history of pharmacy, manufacturing and local work cultures. We have worked closely with the archivists to enable large sections of the historic collections to be made publicly available through a Wellcome Trust Resource award and have a track record of collaborative research and public engagement on different sections of the archive. Explore the Boots Archive A pioneering collaboration, bringing together the combined strength of Nottingham’s two world-class universities for the benefit of our place, people and communities. Working with local partners we aim to improve levels of prosperity, opportunity, sustainability, health and wellbeing for residents and the communities that unite us. Find out more about Universities for Nottingham For more information on our research-led impact see our Engaged Arts content. For course and admissions enquiries see our enquiry page For Faculty contacts see our contacts page"
        }
    ],
    "pdf_files": []
}