{
    "url": "https://www.nottingham.ac.uk/arts/research/virtual-bookcase/virtual-bookcase.aspx",
    "content": [
        {
            "p": "Showcasing the incredibly diverse range of research publications in the Faculty of Arts. Ruth Maxey, Associate Professor, American and Canadian Studies Ruth Maxey edits and introduces the collection, contextualising Mukherjee’s short fiction and the provocative, often prescient political questions it raises. Full details Dr Lynn S Fotheringham, Lecturer in Classics How the recent graphic novel \"Three\" tries to give a more complete view of life in the notorious Greek city-state of Sparta. Onyeka Nubia, Assistant Professor of History We are told that somewhere in history, racist attitudes began, and that is why people have them now. This book challenges the trajectory of this claim and will stimulate debates on issues of difference, identity, theology and race. Olivia Hellewell, Assistant Professor, Peninsular Spanish and Translation Studies Translated into English by Olivia Hellewell, a gripping novel of family and national division that spans three generations, changing borders and the Balkan wars of the 1990s. Hongwei Bao, Associate Professor in Media Studies Examines queer music, photography, theatre and social activism to discern the pivotal role of performance in queer identity and community formation. Graham Thompson, Professor of American Literature How Melville responded innovatively to the demands of magazine writing and reinvented literary traditions to help create the modern short story. Theodora Jim, Associate Professor in Ancient Greek History A compelling analysis of one of the most ubiquitous religious practices in ancient Greece, the offering of ‘first-fruits’ and ‘tithes’. Dr. Zachary Hoskins, Associate Professor Analyses the various kinds of collateral consequences imposed in different legal systems and the important moral challenges they raise. Jean Andrews, Associate Professor Hispanic Studies Looks at the painting of Morales in juxtaposition with other cultural production, religious tensions and the output of other artists. Chris Woodard, Professor of Moral and Political Philosophy Explains how utilitarianism can account for moral rights, for the importance of justice and equality, and for the significance of democracy and legitimacy. Jeremy E. Taylor, Professor of Modern History Explores the visual cultures developed by the Chinese “collaborationist” regime during the Japanese occupation. Michael Stephen Burdett, Associate Professor of Christian Theology A contemporary Christian response to transhumanism based around the themes of possibility and promise. Philip Goodchild, Professor of Religion and Philosophy Reintegrates economics, philosophy and theology within the context of global ecological and economic crisis. Richard A. Gaunt, Associate Professor of History Offering an unrivalled insight into political events from the perspective of a noted ‘Ultra-Tory’. Louise Mullany, Professor Offers new ways of conducting professional communication research with real-world impact. Lucy Jones, Associate Professor Through their language, young people reject stereotypes from within queer culture and strive to be “normal”. Par Kumaraswami, Professor Offers a new way to look at the many ways in which literature functions in post-1959 Cuba and beyond. Spencer Jordan, Associate Professor Explores how we tell stories in the twenty-first century, and how modes and forms of creativity have changed. Mark Pearce, Professor The first archaeological overview of Summer Farms in Europe, from the Black Sea to Spain and Iceland, concentrating on the Alps. Liz Evans, Professor of Screen Cultures What does engagement really mean to those who make and experience screen content? Nicola McLelland, Professor Breaks new ground in the study of language standards and standardization. Nick Baron, Associate Professor Examines the history of child displacement and the experiences of displaced children. Pierre-Alexis Mével, Associate Professor Analyses the French subtitling of African American English in a corpus of films from the United States. Paul Grainge, Professor Explores the small screen intimacy of cars - the way people interact, sing and dwell in the habitat of automobiles. Thomas Legrende, Assistant Professor About an archaeologist who travels back in time and has an affair with his wife - or is it about a musician having an affair with her husband? James Mansell, Professor in Cultural Studies Offers a new perspective on modern Britain, showing that everyday sounds were central to the negotiation of modernity. Joanna Martin, Associate Professor The first critical edition of the thirty-four unique items in the Findern manuscript. Lynda Pratt, Professor The 546 surviving letters written by the controversial ‘Lake Poet’ Robert Southey between 1818-1821. Vivien Miller, Professor How organised crime was entwined with horse racing in Prohibition-era North America. For course and admissions enquiries see our enquiry page For Faculty contacts see our contacts page"
        }
    ],
    "pdf_files": []
}