{
    "url": "https://www.nottingham.ac.uk/arts/news-events/index.aspx",
    "content": [
        {
            "p": "Byron 200’ launches across the city with a programme of exhibitions, events and activities that celebrate the sensational life and legacy of Lord Byron through this year, since he died in April 200 years ago. This forms part of a city-wide collaboration with partner organisations: Nottingham City Council’s Newstead Abbey, University of Nottingham, Nottingham Trent University, Nottingham City of Literature and Visit Nottinghamshire who form part of Marketing Nottingham and Nottinghamshire. Figure 2: Portrait of Byron by Thomas Phillips Photo courtesy of Newstead Abbey, Nottingham City Museums and Galleries in any use Tuesday 21st May 3-5pm - Nottingham Central Library In this talk, Dr Sam Hirst explores Byron's life at Newstead Abbey near Nottingham and how his life there informed his poetry. This talk will look at various poems and how they reflect his fascinating life. Book now Monday 17th June, 2-4pm - Nottingham Central Library Vampires are some of the most familiar and well-loved of monsters. From Dracula to Twilight. we're fascinated with these fanged fiends. This talk, by Dr Sam Hirst, explores the role Lord Byron played in developing the vampire and how we owe the image of the vampire as aristocratic predator extraordinaire to Byron... although not in the way he might have hoped. Wednesday 19th June, 2-4.25pm - Nottingham Central Library Lord Byron kept a bear while he was a student at Trinity College. It was said he purchased the bear in defiance of the rules that banned students from keeping dogs in college. In Italy it is said he lived with ten horses, eight enormous dogs, three monkeys, five cats, an eagle, a crow, and a falcon. What it would it be like to live with a bear, and other animals, as Byron did? Tuesday 2nd July, 11-12.30pm - Nottingham Central Library Lord Byron’s reputation as a political rebel remains alive and well – especially in Nottingham. This talk considers the political context in which Byron operated – years of war, revolution and social tension. Byron is still largely remembered for his maiden speech in the House of Lords, defending Nottinghamshire Luddites. Given his limited engagement with parliamentary politics, how does Byron’s reputation as a political rebel look 200 years after his death? Tuesday 30th July, 11-12.30pm - Nottingham Central Library The talk will describe Ada's relationship with Byron, his influence on her life and her remarkable achievement of escaping his shadow to create her own legacy. Friday 26th July – Monday 5th August - Nottingham Central Library. In July 1824 Byron’s body travelled from the location where he died, Missolonghi in Greece, to London and then to his final resting place in Hucknall churchyard. Did you know that on the way, his body laid in state, or rested, in Nottingham so that people could come and pay their respects? This installation will provide an immersive, interactive audience experience where audiences can see and engage with a hologram of Byron, ask \"him\" questions, hear poetry, and more. This event will be free to access in a dedicated room at the Nottingham Central Library. Find out more information below Visit during library opening times Djanogly Theatre, Lakeside Arts, University Park NG7 2RD Nottingham -Thursday 27th June 2024 (18:00-20:00) This lively panel discussion marks the bicentenary of Lord Byron’s death with six guest speakers sharing their views on the life and legacy of Lord Byron from different perspectives. The event will open with a welcome from Greek-born Councillor Pavlos Kotsonis, Nottingham City Council’s Portfolio Holder for Leisure and Culture. The following discussion will be chaired by Associate Professor Richard Gaunt from University of Nottingham's Department of History and followed by a question-and-answer session at the end. This event is funded and presented by the Institute for Policy and Engagement, University of Nottingham."
        }
    ],
    "pdf_files": []
}