{
    "url": "https://www.nottingham.edu.my/Awards/award-ceremony-2023.aspx",
    "content": [
        {
            "p": "This award is conferred to members of staff who completed 15 years of service. Long Service Award recipients for 2023 The Vice-Chancellor's Medal (VC’s Medal) award was introduced in 2015, as a continuation from the success of the Vice-Chancellor's Achievement Award. The Medal is for the recognition of exceptional achievements by staff or students at the University. The criterion for the award includes exceptional achievement in any arena; notable endeavour which has made a difference to the University; a substantive contribution which has enhanced the reputation of University of Nottingham and activity which has had a noticeably positive impact on students, staff or the local community. Vice-Chancellor's Medal recipients for 2023 Staff Winners Anurita is an Assistant Professor in the Department of Civil Engineering. She is a Graduate Engineer with Board of Engineers Malaysia (BEM), Professional Technologist (Ts) with Malaysian Board of Technologist (MBOT), Affiliate member in Young Scientist Network-Akademi Sains Malaysia (YSN-ASM) and Fellow of Higher Education Academy (HEA, UK). In terms of teaching, Anurita has obtained three teaching grants from UNM T&L fund that uses web-interactive tools for teaching which has given impactful learning experiences for students. First project focused on Nearpod to enhance students’ engagement and participation in class. Second project focused on gamification approach using Kahoot! to boost classroom engagement and interaction. Third project was on interactive teaching and learning using multimedia posters, Glogster during online and blended learning through pandemic. This project received a Gold Award in ICIDE 2022 and a Bronze Award in NALI 2022. She has also received a faculty medal for excellence in teaching in 2022. For research, Anurita got the faculty’s medal for excellent research performance and outstanding publications for the past 5 years. She has supervised several undergraduate and postgraduate students, became internal assessors and chairs for several PhD students. She has published 41 peer-reviewed journal papers, 1 book chapter and 45 conference papers. She maintains as PI and co-investigator in local, international and industry grants. She has been invited for international forums, conferences, webinars, keynote and plenary speakers to promote knowledge exchange among researchers. She also received a Silver Award in ITEX 2023 and Gold Award in InNoW 2022. On the administrative side, Anurita is the STEM Co-lead and organising committee for STEM Carnivals and Merdeka Lectures. She was the co-chair of 6th POCER, 1st ICWES and chair for next POCER in 2024. Also, she is the organizing committee for upcoming conferences, PyroAsia2023 and ICWES2024. Organising conferences has provided a good platform for international collaboration, promoted global research and knowledge exchange. Anurita has been actively involved in professional activities outside of the university where she was invited to give a talk at universities in Indonesia, India and Taiwan. She has contributed as judge for STEM Essay Competition, Infographics Competition and National Science Challenge. Apart from that, Anurita has also organized a Community Cricket Match, a CSR event in the university. She brought together young players from different schools to demonstrate their skills and abilities for a friendly cricket match that was held in UNM Sports Complex, 2022 and 2023. The event made everyone to experience and celebrate cricket as a community concept to impact their lives for the better. Her recent involvement was as a facilitator for UNESCO IHP Malaysia Water Awareness Programme to address local and global water concerns by educating students on the importance of protecting the rivers. She facilitated a module on water pollution and treatment. She was awarded Merit Award 2020 and 2021 for outstanding contribution in the faculty. Anurita is an important staff in the university, and her contribution towards teaching, student welfare, research and administrative duties are invaluable. Thamil Vaani has won 10 prizes/awards in both national and international competitions within the last 4 years. Out of that total, there have been 3 national awards (2 Gold/First and 1 Bronze) and 7 international awards (1 Gold, 3 Silver, 2 Bronze and 1 Special Award). The 3 national awards are as follows: 2020 - Gold at IPEX; 2022 - First place at ENTICE by MBOT and Bronze at PECIPTA. The 7 international awards are: 2021 - Silver at PIID, I-JaMCSIIX and IIMOS and Bronze at VIC21; 2022 - Gold and Special Award at International Innovation and Invention Competition; 2023 - Bronze at ITEX. These prizes/awards demonstrate engagement in high quality research and innovation over a period of recent years with output that has the potential of high impact on society at large. Dr. Too’s volunteerism in The Malaysian Chinese Independent Secondary School (MCISS) Working Committee reflects the values of the University to create an inclusive, ambitious, open, fair, and respectful society. The MCISS Working Committee is a non-governmental educational organisation that aims to preserve mother tongue education in Malaysia (See https://www.dongzong.my/v3/en/about-us/micss-working-committee/info.html). MCISS Working Committee’s mission is to oversee the development of the sixty-three independent Chinese secondary schools with a total population of over fifteen thousand students across Malaysia. Its objectives are first, to promote and develop the cause of Chinese education and culture in Malaysia; second, to promote and develop independent Chinese secondary schools; third, to promote the superiority of mother tongue education in accordance with the MICSS Proposal; and fourth, to raise fund for the educational development of independent Chinese secondary schools. The examination offered by MCISS Working Committee, The Unified Examination Certificate (UEC) is widely accepted by universities around the world, including University of Nottingham. With his expertise in languages and education, Wei Keong’s involvement with the MCISS Working Committee began in 2010 as a Subject Advisor for English language until 2014. Over the years, he has held various portfolios in the organisation, such as Committee of Education Advisory Committee (2014—2016), Director of Unified Curriculum Committee (2016—2018) and recently Committee Member of Unified Examination Committee (2022—2024). Wei Keong has conducted numerous workshops on curriculum and organised briefing for teachers in independent Chinese secondary school with other volunteers and staff in MCISS Working Committee since his involvement with the organisation. His conviction in preserving mother tongue-based education has kept him going until today. Students Winners In the space of five years, Fadhilah's achievements and leadership roles showcase her ambition and notable contributions to the UNM Community. From being the DOAP Class and School Representative (2019-21) to becoming the SA Vice President (2021-22), she has continually strived for personal and professional growth. Her involvement in clubs and societies, SA Postgraduate Network and Teaching Assistant highlights her drive to excel and make a positive impact. Fadhilah has worked closely with the faculty teaching committee and the schools’ senior lecturers to support and enhance not only DOAP students’ learning experiences but also students across the faculties in the middle of pandemic. Fadhilah fostered a safe, inclusive and interactive environment for students to voice their concerns and provided much needed support for students who were struggling during lockdown. She also initiated social gatherings and organised a Career Talk to bridge the gap between DOAP/FASS students, seniors and juniors, alumni and lecturers. Fadhilah has consistently prioritised students' welfare and demonstrated inclusivity in her role as the SA Vice President, a value she continued to espouse in her current role as a committee of the SA Postgraduate Student Network. Fadhilah's friendly and approachable personality fostered strong relationships with students, staff, and colleagues. Her willingness to listen, understand, and be receptive to diverse perspectives demonstrated her openness to different ideas and opinions. This openness has allowed her to effectively advocate for her classmates and all students in the university. In her Postgraduate year, Fadhilah was awarded a FRGS Scholarship which afforded her the opportunity to influence more students in her capacity as a TA. In 2022-23, Fadhilah provided much needed teaching support to two lecturers (Miss Chan Wen Li for Business Ethics and Sustainability (BUSI3157) and Miss Michelle Ngo for Occupational Health Psychology (PSGA3003)). She went above and beyond what is expected of a TA. Her commitment to fairness ensured that students' welfare was not compromised by providing support, advice, and resources. Fadhilah consistently led with empathy and respect for others. She manages issues with sensitivity and understanding, making sure the voices and concerns of students were heard and respected. Her respectful approach has earned her the trust and admiration of her community, including students, staff, and colleagues. Her work ethics and dedication to creating a fair and just environment are commendable. Moreover, Fadhilah worked passionately to enhance the presence of SA Postgraduate Network and help build a sense of community among Postgraduate Taught and Research Students. She collaborated with relevant support units (e.g. Graduate School and Teaching and Learning) to initiate activities that would enhance the experiences of her fellow PG students. One notable example is the organisation of an iftar event with the Vice Provost for Teaching and Learning that paved the way for PGT and PGR students to engage with each other in a social and relaxed setting. Overall, Fadhilah's involvement in the university, her leadership qualities, and her commitment to the community over the years demonstrated her embodiment of the University’s values and should be recognised. Joshua has been an exceptional student and a highly dedicated member of the Institution of Engineers Malaysia (IEM) UNM Student Section serving since 2018. He was offered the role as an apprentice in 2018 also serving the role as the Vice-Finance Director for the Nottingham Charity Run 2018. In the subsequent year, 2019, Joshua embraced the role of Event Manager, the main coordinator for organising events under IEM Student Section. He was able to organise the Engineering Carnival Week, a 1-week event that promoted STEM through interactive activities, which managed to gather the attention of both FOSE and FASS students. Moreover, at the early stages of the COVID-19 pandemic, a visit to the Joy Garden Old Folks Home was arranged and donations were made in forms of food and daily essentials. His contributions to the club led to the “Outstanding IEM Student Section Award 2020” awarded by IEM. The national-level award serves the purpose to recognise exceptional IEM student sections in Malaysia. Joshua was then elected as the Chair of the IEM Student Section for two consecutive years (2020/21-2021/22), his contributions have significantly benefited the organisation and the engineering community in UNM. He initiated collaborations with 5 other engineering clubs in UNM, to organise Discovering Careers in Engineering (DCE), which aim to promote the importance of engineering in the industry and bridge the gap between various industrial players and engineering students for job and internship opportunities. Joshua also continued the IEM Apprenticeship Program to seek for future leaders of the club and serves as a platform for students to join IEM with the benefit of expanding their social networks by meeting professional and practicing engineers which provides further career insights. He also initiated more frequent collaborations with IEM Young Engineers Section (YES), such as the IEM Health and Wellness Event to promote physical and mental wellbeing to the society. In addition, Joshua proposed the construction of the club’s website to better present the student section to the public. Lastly, he established the Human Resource Department to enhance the handling of committee recruitment and manage the Apprenticeship Program. Additionally, he also initiated donation drives in collaboration with Yellowhouse KL and Kechara Soup Kitchen for supporting the community in times of the COVID-19 Pandemic. In the span of 2 years, he led the organization to receive the \"Best Academic Society Award\" by SA (Student Association) and the \"Outstanding IEM Student Section Award 2021\" and \"Outstanding IEM Student Section Award 2022\". The aforementioned events show that Joshua has contributed his efforts in-line with UNM’s Strategic Plan on Student Experience by volunteering on extra-curricular activities and facilitated students in UNM to participate in outside-classroom activities, which can enhance their graduate employability and soft skills. Other than that, the charity events initiated by Joshua aligns with the first two SDG goals, No Poverty and Zero Hunger which promoted inclusiveness of the community and care towards the underprivileged. Nicole’s achievements as the Chief Executive Director of the International Council of Malaysian Scholars (ICMS) 11th Council 2021, and her performance in case competitions and pro-bono consulting engagements were exceptional. During her tenure at ICMS, she spearheaded its expansion to Australia, adding to its existing network in Canada, Hong Kong, Macau, Malaysia, Singapore, the UK and the USA. This remarkable achievement showcases her ability to exceed expectations and deliver exceptional outcomes. The expansion process involved strategic planning, market analysis, and effective networking, all of which contributed to the success of ICMS in providing greater opportunities for Malaysian scholars. Furthermore, she successfully formulated and executed a year-long internal restructuring plan within ICMS, which involved reorganising the leadership and divisional structure. The significant positive impact of this restructuring plan on the organisation's operations and community was substantial. In addition to Nicole’s accomplishments at ICMS, she was honoured as the Global and National Champion of the Unilever Future Leaders League 2021, surpassing 54,000 participants worldwide. In this competition, she devised and presented highly effective marketing and product strategies under the Food and Home Care category. These strategies were presented to the CEO and Global Marketing Directors of Unilever and achieved an impressive ROI of 2.46 and a campaign outreach of 5.8 million. This achievement demonstrates the exceptional standards of achievement, sustained outstanding performance, and ability to deliver results at a global level. Similarly, she championed the Procter & Gamble (P&G) CEO Challenge in the Asia-Pacific (APAC) region. She was tasked to develop a gamification solution via a Metaverse immersion for Hair Care under the Head and Shoulders and achieved a brand share of 7.1% and an ROI of 4.14. This accomplishment showcases her learning agility and creativity in developing impactful strategies to drive business growth. Similarly, as the Regional Champion of the Citi APAC TTS Case Competition 2021, she competed against over 1,000 participants from the Asia-Pacific region. She proposed innovative digital solutions to streamline three key product lines, namely Receivables, Liquidity Management, and Payments. Her solutions resulted in time savings of 7.5 hours per week and higher average yields of 7.5%. This exceptional performance showcases her ability to be an agile learner, applying the case fundamentals from her previous participation to solve complex problems and deliver impactful results, regardless of the topic. Nicole's dedication extends beyond her achievements. As a Pro-Bono Consultant at Skye Renewables, she provided valuable insights on renewable energy for the Asian Infrastructure Investment Bank. She also formulated distance learning strategies for Teach for Malaysia, addressing educational challenges during the pandemic. Her expertise in renewable energy and commitment to education showcased her dedication to sustainable solutions and bridging educational gaps. Recognising Nicole's achievements underscore her exceptional standards, sustained outstanding performance, and impactful results in marketing and strategic planning. These accomplishments have positively impacted organisations, showcasing her ability to contribute to their success and growth. Jasmine’s exceptional achievements and contributions to the field of mental health and addiction prevention through her dedicated volunteer work with Green Crescent Malaysia (GCM) should be recognised. Jasmine's commitment, leadership, and impact on national and international platforms make her an outstanding candidate for this prestigious honour. Since 2019, Jasmine has been an invaluable member of GCM, a non-governmental organization focusing on evidence-based prevention and intervention for mental health and addiction among the younger generation. Her involvement in organizing events, recruiting volunteers, and representing the NGO in national and international activities highlight her dedication to creating positive change in society. Jasmine's notable contributions include her role as a Malaysian delegate at renowned forums, such as the United Nations Office on Drugs and Crime Youth Forum, the United Nations Economic and Social Council Youth Forum, and the Green Crescent Youth Advocacy Forum. Through these platforms, she effectively advocated for mental health and addiction prevention, amplifying the voices of the youth and emphasizing the importance of evidence-based practices in shaping policies and strategies. Moreover, Jasmine has actively raised awareness about mental health and addiction through various initiatives. She has organized impactful exhibitions and volunteer programs at hospitals, substance use rehabilitation centres, juvenile centres, and universities. These efforts have created opportunities for dialogue, education, and support, empowering individuals and communities to address mental health and addiction challenges effectively. Jasmine's exceptional dedication and leadership have earned her recognition as an active youth leader in substance use prevention. She was nominated by the Permanent Mission of Malaysia as a Youth Delegate to the United Nations Office on Drugs and Crime Vienna (UNODC). At UNODC, she initiated \"\"The Butterfly Wings,\"\" a youth magazine on substance use prevention. This innovative publication features articles written by youth from around the globe, sharing their perspectives on scientific knowledge and best practices in substance use prevention and health promotion. Jasmine's belief in the power of youth involvement and evidence-based science is evident in the three magazine issues she has helped published since 2021. She is currently working on the fourth issue, which promises to continue inspiring and promoting positive change. In conclusion, Jasmine's remarkable achievements as a volunteer for Green Crescent Malaysia and her significant contributions to the field of mental health and addiction prevention demonstrate her outstanding leadership, dedication, and commitment to making a positive impact on society. Her work has not only raised awareness but also empowered young individuals worldwide to engage in evidence-based practices for substance use prevention. She is an exceptional candidate who has truly made a difference in the lives of many through her outstanding achievements and unwavering passion. Team Dr. Chong and his research team show exceptional dedication, contributions and achievements in the research work. The team has won an International Invention & Innovative Competition (INIIC) 2022 Award: Gold Award and Best Video Winner (Category: Higher Institution - Science, Engineering & Technology). Further to this, they won a gold medal at the International Conference and Exposition on Inventions by Institutions of Higher Learning (PECIPTA), which is a biannual program organized by the Ministry of Higher Education Malaysia together with its partner institutions of higher learning (IHL) and his research team won the Diamond and Gold awards in the 3rd Virtual Innovation Competition 2022 (VIC22). In total more than 872 participants from local and international organizations, only 13 projects were selected to receive special Diamond awards. The special Diamond award received is under the category of TERTIARY – SCIENCE & TECHNOLOGY. All awards are related to 3D-Printed PEGDA Monolith with Robust Silane Grafted Chitosan for Enhanced Textile Wastewater Treatment research project. Recently, the project was shortlisted as Top 20 out of 876 submissions from 23 countries for 3rd KANS (Knowledge Application and Notions for Society) scientific competition under Mustafa Science and Technology Foundation. They developed a green and sustainable technology known as 3D-CHITOLITH to improve domestic and industrial wastewater's current water quality standards before being discharged into the river. This will reduce the health disease that is harmful to the local community and ecosystem, as well as moving towards a sustainable water management model and improve access to safe and clean water. This research project is also aligned with the current national water innovation roadmap and Sustainable Development Goals (SDGs) to satisfy the community's water needs whilst minimizing the adverse environmental and social impacts. The team has made a tremendous effort to continuously improve the novelty, significance of the work, and its impact on the community. This includes having a collaboration with the environmental consultant and industry players, especially in textile industries, to seek advice and support in meeting the industry's needs and requirements. Currently, the research is at the laboratory stage, and it is expected to be tested on site as a prototype to treat the wastewater. The goal of the research is to provide the local community with clean and safe water needs. In addition, the concept of this work has been proposed and presented in prestigious international youth summit and forum such as Youth Dialogue on Adaptation Action in Delivering the Glasgow Climate Pact 2022 on the topic of the Role of advanced water technology for water reused and recycling for climate change adaptation and at One Young World Summit for the topic Impact of polluted water for health: Ways to mitigate. Overall, this research group has shown determination, high spirit, and excellent teamwork as well as in promoting the top-notch research reputation of UNM. UNM’s Provost Professor Sarah Metcalfe receiving the PS Award 2023 on behalf of Careers Advisory Service Team, from Ms. Jaspal Kaur, Director of Human Resource, UoN Launched in 2022, the Professional Services Award celebrates extraordinary Professional Services Teams in all the three Nottingham campuses. PS Award recipient for 2023 Careers Advisory Service, University of Nottingham Malaysia for Fostering Creativity and Design Careers Advisory Service (CAS) of the University of Nottingham Malaysia has been delighted to form a new partnership with Forage to give students access to free virtual job simulations with Fortune 500 companies including BCG, JPMorgan and Citi. Proudly to say, CAS is the first Malaysian career centre that partner with Forage. It demonstrates CAS's innovative thinking and inspires to enhance students' career readiness. CAS has made enormous efforts in promotional and publicity activities to increase awareness, students’ interest and registrations. The promotional activities, for example, social media advertising with a series of ads, creating hashtags, posters with QR codes, targeted emails and highlighting the Forage programme in career presentation slides etc. To be the first is easy but to sustain growth is challenging. CAS takes extra steps by turning the virtual module to live. CAS works with KPMG Malaysia on the KPMG Forage Data Analytics Virtual Internship programme and brings it into the classroom. Lately, the KPMG Executive Director of the Center of Excellence in Data & Analytics, with support from Dr Myint Coe Chit, conducted the workshop for his students in data analytics class. Students not only understand the content but are also able to see how concepts apply in the world of work. CAS continues to work with other schools on this approach. CAS goes above and beyond in obtaining the Students' Continuing Personal Development (s-CPD) steering committee to recognize and allocate points for Forage programmes in the s-CPD award scheme. Students can now claim up to 6 s-CPD points upon completing the Forage programme. With the recognition, it increases greater awareness and learning opportunities for students. The feedback from 1400 UNM students has been incredible with over 90% of students rating the experience as 5 stars. (Source: Jeremy, Director of Education Partnership Forage, 2022)"
        }
    ],
    "pdf_files": []
}