{
    "url": "https://www.nottingham.ac.uk/bbdtp/magnify/magnify-2024.aspx",
    "content": [
        {
            "p": "Magnify 2024 is a unique experience for up to 10 undergraduate students from underrepresented backgrounds. Participate in a 10-week, fully-funded summer school programme before entering the final year of your undergraduate studies. Build professional networks, get insight into research, gain application and interview experience, and learn more about PhD opportunities. Eligibility To be eligible, candidates must have UK fees status at the time of application. You must be due to enter your final year of undergraduate study in September/October 2024. Additionally, the candidates must also meet at least one of following criteria: 1. Identity as Black, Asian or Minority Ethnic 2. Receive of full amount of student loan 3. Have a declared disability 4. Have spent more than 3 months in local authority care 5. Be a registered carer 6. Have refugee status from the Home Office 7. Studying at or graduated from a non-Russell group university Projects You can explore the projects on offer here. Structure of the Summer School The summer school will comprise of a ½ day induction, 9-week lab rotation, a visit to Rothamsted, and a celebration to mark the end of the program. Project Timeline Activity Timeframe Application Deadline Interviews and Offer Week commencing 6 May & 13 May 2024 Induction day 17 June 2024 10-week lab project 18 June-22 August 2024 Visit to Rothamsted 10 July 2024 End of Summer School Celebration 23 August 2024 (TBC) Reviews & Feedback Week of 28 August 2024 Funding Successful Magnify participants will be paid for ten weeks at the National Living Wage, via Unitemps. Apply All applicants must complete the form. On submission, you will receive a confirmation email with a copy of your answers. Please note that the form cannot be saved and compulsory fields are indicated with a red star. Please contact bbdtp@nottingham.ac.uk to report any technical difficulties. The University of Nottingham University Park Nottingham, NG7 2RD Tel: +44 (0) 115 8466946 Email: bbdtp@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}