{
    "url": "https://www.nottingham.ac.uk/bbdtp/index.aspx",
    "content": [
        {
            "p": "A successful programme to train the next generation of Nottingham bioscientists from the city’s two universities has secured £14 million funding from UK Research and Innovation. (UKRI- BBSRC) The investment will support innovative PhD training in biological sciences for five intakes of students from 2025 from the University of Nottingham and Nottingham Trent University. The funding was part of a UK-wide £500 million investment announced on 13 November. The Nottingham Doctoral Training Partnership has been running since 2012 and has trained over 650 PhD students who have gone on to leading roles in academia, industry, science communication and policy in the UK and internationally. This will be the fourth successful grant to support the programme, and the second time the two universities have delivered the programme together. The Nottingham DLA Partnership will provide cohort-based training in frontier science across priority areas focussed upon three overarching themes: Sustainable Agriculture and Food (SAF), Bioscience for Human Health (BHH) and Biotechnology for Sustainable Growth (BSG). Alongside scientific PhD training and research the programme will provide a breadth of professional development training opportunities to enhance the capabilities of doctoral candidates and develop a world-class, highly skilled workforce the UK needs for its future. During the training each student will undertake a three-month Professional Internship for PhD Students (PIPS) placement to develop their skills further and to explore possible future career directions. The Nottingham BBSRC Doctoral Training Partnership is led by the University of Nottingham in partnership with Nottingham Trent University and the National Biofilms Innovation Centre (NBIC), and offers fully funded, four-year PhD studentships that are aligned to strategic priorities supported by the Biotechnology and Biological Sciences Research Council (BBSRC). About the programme The University of Nottingham University Park Nottingham, NG7 2RD Tel: +44 (0) 115 8466946 Email: bbdtp@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}