{
    "url": "https://www.nottingham.ac.uk/bbdtp/our-research-areas/our-research-areas.aspx",
    "content": [
        {
            "p": "We offer a broad programme of research opportunities The Nottingham DLA Partnership will provide cohort-based training in frontier science across priority areas focussed upon three overarching themes: Sustainable Agriculture and Food (SAF), Bioscience for Human Health (BHH) and Biotechnology for Sustainable Growth (BSG). Students will be recruited to specific cluster priority areas within these three overarching BBSRC priority themes. Each cluster will focus on a key challenge or emerging research priority within its theme. All clusters will include CASE projects and will be open for additional stakeholders and non-HEI partners to develop projects. The first cluster within this research theme will be Heat Resilient Agriculture. Currently over one billion individuals suffer from chronic malnourishment, while nearly 200 million children are severely underweight. Future environmental pressures will require farming to achieve further advances in resource use. Alongside carbon footprint, ‘energy’, ‘nitrogen’, ‘phosphorus’ and ‘water’ footprints may well become the new farming and food currencies. Sustainable farming will rely upon multi-disciplinary approaches underpinned by sound science and the skills to translate novel solutions into practice. Reducing water and resource use, enhancing food and fuel output and quality, delivering ecosystem services and reducing greenhouse gas emissions are some of the pressing issues that will need to be tackled. Sensory science, brewing science/fermentation projects are also included in this research area. Research projects in Sustainable Agriculture and Food Security will focus on studies at the molecular, cellular, whole organism, and population levels to address these issues The first cluster within this research theme will be Biomaterials for Tissue Engineering & Drug Delivery Projects in our Bioscience for Health theme will focus on maintaining health and wellbeing. This will include projects considering the molecular regulation and control of complex processes, including cancer and ageing and the impact of nutrition and physiological changes upon health and disease. The work researchers in this area undertake will help to provide understanding of healthy systems to generate fundamental and applied knowledge regarding stress and diseased states in human and animal systems, and understanding of how this can be manipulated for optimal health. The first cluster within this research theme will be Technologies for Sustainable Protein Synthesis. The future is set for renewable and waste feedstocks to play an increasing role as a source for chemicals and energy production. The DTP offers expertise in bioenergy, biorenewables and sustainable chemistry, and has a strong focus on solving real-world problems using tools from synthetic biology, in partnership with major fuels and chemicals manufacturers and related industries. Stem cell biology and tissue engineering are also emerging disciplines within the field of biotechnology, biofuels and the bioeconomy. There are important challenges to be overcome in the scale up of production of future cell therapies. A new industry is emerging built on the need to understand how cell therapies can be made at an industrial scale. The BBSRC is playing an important role in the study of fundamental cell biology of stem cells and how differentiation can be controlled to create new classes of biotechnology products. Nottingham has expertise in the production of cardiac, nerve and musculoskeletal cells and works closely with the UK and international industrial community to exploit this basic biological science for industrial applications. How to apply The University of Nottingham University Park Nottingham, NG7 2RD Tel: +44 (0) 115 8466946 Email: bbdtp@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}