{
    "url": "https://www.nottingham.edu.my/Biomedsci/Research/Infections-and-Immunity.aspx",
    "content": [
        {
            "p": "Infectious diseases remain a common yet overwhelming threat in both community and hospital settings. The healthcare and economic burden from infections is exacerbated by the rapid emergence and spread of resistant bacteria strains, highlighting the utmost importance to search for new anti-infection strategies. Our research in this theme brings together several complementary areas, including bacterial pathogenesis, host immunity, drug resistance, vaccine development and novel antimicrobial treatment for infections. A prophylactic vaccine remains the most cost effective approach to decisively impact an epidemic or even eradicate a pathogen globally. Most of the tropical infectious diseases mainly affecting populations living in poverty are not yet preventable by vaccination. The understanding of pathogen biology and protective immunity against the same pathogen together with effective vaccine delivery directs successful vaccine design. Vaccine safety is paramount. Over the past two decades, rumours and misinformation about the safety of vaccines have resulted in many parents who refused vaccinations for their children. Electronic Word-of-Mouth (eWOM), especially negative sentiments pertaining to vaccination has implicated further increase of vaccination refusal by parents. As a result, there is a rise in the cases of preventable infectious diseases such as measles. The Malaysia Ministry of Health (MOH) has acknowledged the growing trend in refusal of vaccination decisions. The propagated increase of refusal to vaccinate poses a serious public health risk. Adverse event reports database can be obtained from various databases and this can be used to study the extend of these adverse events. The emergence and spread of antibiotic resistance are becoming a serious menace to the modern societies. Antibiotic resistant bacteria, particularly methicillin resistant Staphylococcus aureus (MRSA), is challenging to treat, resulting in high morbidity and mortality in nosocomial infections. Understanding the molecular basis of infection process will lead to discovery of new treatment, prevention approach and diagnosis method. Microbes continue to find ways to resist the current antibiotic arsenal developed by humans, leading to urgent calls for novel antimicrobial compounds that can prevent the spread of resistance. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}