{
    "url": "https://www.nottingham.edu.my/Biosciences/Research/Biotechnology-research-centre/BiotechnologyResearchCentre.aspx",
    "content": [
        {
            "p": "The University of Nottingham Malaysia Campus (UNMC) has established a strong collaboration with Applied Agricultural Resources Sdn. Bhd. (AAR), an internationally recognised premier centre in plantation crop research. This collaboration has resulted in a new, state-of-the-art Biotechnology Research Centre (BRC) near the UNMC campus which was officially launched on 29th September 2009. The establishment of BRC is in tandem with the efforts of the university and AAR to promote research and development in molecular biotechnology. BRC has a wide range of facilities and equipment to support molecular, proteomic, plant tissue culture, and molecular pharming research which includes the tissue culture rooms, growth chambers, Akta Pure Fast Protein Liquid Chromatography (FPLC) system, fluorescent microscopy, densitometer, vacuum concentrator, standard and real-time thermal cyclers, Bio-Dot microfiltration system, Biolistic system, gel electrophoretic and documentation systems, and others. “One research priority is the genetic improvement of various plant species, particularly oil palm, in order to speed up traditional breeding programmes.“ “The use of plant-based systems for rapid, safe and cost-effective production of foreign proteins such as vaccines, therapeutics and diagnostics and high value metabolites such as flavourings and medicinal compounds, which is referred as molecular pharming, also a key focus.“ The following are some top reasons to be part of our biotechnology research centre. World-class facilities - We are equipped with cutting-edge facilities and equipment vital for groundbreaking research. We aim to offer our research students the perfect environment for research work. Renowned faculty - Our lecturers and professors are at the forefront of biotechnology research. It is our aim not just to educate but to mentor the next generation of biotechnology researchers. Diverse research areas - The research conducted at UNM spans a wide spectrum in the biotechnology domain. This includes oil palm research, plant genetic improvement and modern breeding, plant molecular pharming, plant-based vaccines and drug discovery using peptide-based therapeutics. We aim to be at the forefront of biotechnological advancements to make a significant impact in these fields. The Biotechnology Research Centre is equipped with cutting-edge equipment, empowering our researchers to conduct meaningful and impactful research. Our facilities include: Tissue culture rooms Growth chambers Fluorescent microscopy Densitometer Akta Pure Fast Protein Liquid Chromatography (FPLC) system Vacuum concentrator Standard and real-time thermal cyclers Bio-Dot microfiltration system Biolistic system Gel electrophoretic and documentation systems Be part of UNM’s Biotechnology Research Centre and join us in our quest to make a meaningful impact on agriculture, medicine and the environment. Biotechnology research involves studying and applying biological systems, organisms, or derivatives to develop products, processes, or solutions that will improve aspects of human life and the environment. Biotechnology research aims to address the challenges in healthcare, agriculture, environmental conservation, and other areas through the innovation of biological processes and systems. It encompasses genetic engineering, molecular biology, bioinformatics, the development of biopharmaceuticals, genetically modified organisms (GMOs), and sustainable agriculture practices. Yes, UNM offers scholarships, funding opportunities and grants for students and researchers to support their projects. These financial resources can be used to help cover research expenses, tuition fees and living costs. Yes, we welcome international students to join us. Reach out to us for more information on international student admissions and requirements. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}