{
    "url": "http://www.nottingham.edu.my/Biosciences/People/christina.supramaniam",
    "content": [
        {
            "p": "Associate Professor, Dr Christina Supramaniam obtained her PhD in Molecular Plant Pathology from the University of Nottingham. Her research focuses on the epidemiology, molecular interaction, and biological control of Ganoderma basal stem rot (BSR) disease in oil palm. Dr Christina is an Assistant Professor at the School of Biosciences, and a member of the Centre of Sustainable Palm Oil Research (CESPOR) at the University of Nottingham, Malaysia. Prior to joining the University, Dr Christina was the Head of the Research Division at an International Biotechnology company and was a principle scientist for field trials to determine the efficacy of organic waste compost to improve soil microbial populations in oil palm plantations. She has vast experience working on microbial communities in diverse oil palm fields, soil types and manuring program for the suppression of BSR. Dr Christina has published several papers and has been invited to give keynote addresses on Ganoderma disease of oil palm in both local and international conferences. She has won several awards such as the UNMC- CESPOR- Eureka Synergy Research Award in 2015. She has supervised 40 undergraduate research projects and more than 10 postgraduate students. She has also been nominated as an internal examiner for four PhD candidates. Dr Christina is a reviewer for top scientific journals such as Plant Pathology (Wiley), Fungal Biology (Elsevier) and Crop Protection (Elsevier). She is an Associate Fellow of the Higher Education Agency (HEA) UK and has memberships in the International Society for Plant Pathology and British Society for Plant Pathology. Oil palm- Ganoderma spp. basal stem rot (BSR) disease Molecular signaling for lignin biosynthesis during plant-pathogen interactions Molecular diagnostics using qPCR and Sequencing for plant and crop diseases Bio-formulation of microbial solution for soil and water remediation Field technical advisory for sustainable production of palm oil Methano-bacteria and Biogas production from Palm Oil Mill Effluent (POME) Dr Christina specializes in the teaching and learning of Molecular Plant Pathology, Industrial Biotechnology, Microbiology and Commercialization in Biotechnology. These courses provide knowledge in… read more Principle Investigator: 2016-2019: Fertilizer (FLOF) amended with mix cultures of Trichoderma spp. to control basal stem rot diseases in oil palm (Industrial grant) 2015: Bio-formulation of effective microorganism for the production of oil palm EFB-based biofertiliser (Industrial grant) 2013-2014: Quantitative expression of defence response in oil palm during pathogenesis of Ganoderma boninense, causal agent of basal stem rots disease (BSR) (Faculty Grant) 2011-2012: Development of a novel in vitro infection assay for oil palm-Ganoderma host-pathogen interaction system (Faculty Grant) 2008-2010: Efficacy of chitosan for the suppression of growth and production of ligninolytic enzymes by Ganoderma boninense in vitro (Ministry of Agriculture Science Grant) Co-Investigator 2017-2018: Leaching trial with control release fertiliser for oil palm (Industrial grant) 2015-2017: The role of mussels in Malaysian freshwaters: towards the protection of species and their functions (FRGS, MOE) 2008-2011: Development of novel edible coatings from natural products for enhancing the storage life of tropical fruits (Ministry of Agriculture Science Grant) 2008-2010: The potential of palm oil as a natural penetration enhancer in transdermal therapeutic systems (MOSTI) 2007-2009: Percutaneous permeation of palm oil using human skin (MOSTI) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}