{
    "url": "https://www.nottingham.ac.uk/biosciences/study/cpd/sensory-science.aspx",
    "content": [
        {
            "p": "Develop your knowledge of sensory and consumer science with our structured training. We are currently redeveloping our training courses to provide online offerings. In the meantime, if your company or institution requires training in sensory and consumer science, we offer the following courses that can be altered to your bespoke needs or product category for a minimum of 6 delegates: The course introduces sensory science as a scientific discipline, including: This course is typically delivered online (2 x half days). Please contact us if you require in-person delivery. The IFST foundation level exam in sensory evaluation is offered as part of this course, which can also be taken online. The course builds on the knowledge gained in the foundation level Sensory Evaluation course, providing in-depth knowledge of the following: It is accredited at Intermediate level by the IFST and delegates have the option of taking the IFST examination in Sensory Science. This course is typically delivered online (6 x half days). Please contact us if you require in-person delivery. The IFST intermediate level exam in sensory evaluation is offered as part of this course, which can also be taken online. This introduction to Consumer Methods introduces delegates to the different techniques used to understand consumer behaviour, liking and preference, including: The course is designed to be delivered in 2 x half days online. Please contact us if you require in-person delivery. This course introduces delegates to factors affecting consumer acceptance of food and the application of techniques used to understand them. The course considers the impact of issues such as questionnaire design, expectation and context before reviewing both qualitative methods, e.g. focus groups, and quantitative techniques. We reflect upon emotional response and the methods used to capture this, before moving on to more advanced approaches such as the techniques available in the Preference Mapping toolbox. The course includes the following: This course is typically delivered online (6 x half days). Please contact us if you require in-person delivery. Find us Campus map Room Locations on Campus [pdf file]"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/mapsuttonbonington.pdf",
        "uk_pdf_files/Room-Locations.pdf"
    ]
}