{
    "url": "https://www.nottingham.edu.my/Biosciences/People/Asgar.Ali",
    "content": [
        {
            "p": "Professor and Director of Centre for Postharvest Biotechnology, Currently, a Professor of Sustainable Food Systems at the University of Nottingham Malaysia, Prof Asgar, is the founding director of the 'Centre of Excellence for Postharvest Biotechnology' at the University of Nottingham, a research group deemed for great success in its field and great impact beyond. With a range of postharvest students under his guidance and supervision, Prof. Asgar has set the grounds for pioneering and innovative research in the field of edible coatings and films, bioactive compounds from fresh produce, and the development of postharvest technology. Additionally, he is constantly involved in the progress of science in horticulture, crop production, alternative disease management, and the recovery of protein from food waste. He is also an Associate Editor of the Journal of Horticultural Science and Biotechnology. He has received several awards in teaching, research, and knowledge exchange. Experience spans from knowledge of the production, physiology, and biochemistry of fresh produce to the field of post-harvest technology. The isolation and characterisation of bioactive compounds extracted from fruits and vegetables, as well as their effects on human health and well-being, is a subject of great interest. Additionally, alternative management of diseases of horticultural crops is another area of in-depth understanding. This field also includes a thorough knowledge of postharvest technologies to extend the shelf life of perishable fruits and vegetables, with particular emphasis on modified atmosphere techniques and edible coatings and films. I designed and led three research-informed modules: Agri-food Production Systems, Postharvest preservation, and Advanced Postharvest Technology. I also designed and directed an MSc program for… read more My research focuses on sustainable food systems, with a particular focus on providing solutions for Farm-to-Fork. Working across the science-policy interface, in my career I have acted as an advisor… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}