{
    "url": "https://www.nottingham.ac.uk/biosciences/research/themes/food-and-drink/sensory-science-centre.aspx",
    "content": [
        {
            "p": "Based in the Division of Food Sciences, our focus is on using sensory science and instrumental techniques to understand how we perceive flavour. Current areas of interest include: Dr Rebecca Ford Associate Professor Dr Qian Yang Assistant Professor Dr Margaret Thibodeau Sensory Science Centre Manager Conduct international quality research relating to sensory science, particularly in the areas of: The Centre has state of the art sensory facilities, including a suite of 10 booths designed to ISO Standards (ISO8589:1988), with controlled temperature, lighting and ventilation. A second room provides a flexible evaluation space with 10 further booths and a discussion area. Two additional booths provide the ability to link with additional instrumentation such as the Dynataste delivery system and physiological recording equipment such as Electromyography. All booths are connected by a Local Area network operating Fizz Software. The spacious custom designed kitchen provides for the controlled production of samples and the lounge area creates a comfortable environment for panellists to relax between sessions. Our training room provides ideal facilities for panel briefing, training and profiling sessions. School of Biosciences facilities and equipment We have an external panel of over 25 local men and women who have been rigorously screened for their sensory acuity, discrimination and descriptive ability. The panel has been operational since 1999 and during that time has been trained in numerous sensory methods and scaling techniques e.g. Magnitude Estimation, Time Intensity, Temporal Dominance of Sensations (TDS) and Labelled Magnitude Scale (LMS). Recently a specialist beer tasting panel was recruited which is involved in our research related to Brewing Science. Based at a University we also have access to a wide range of volunteers, from a range of backgrounds, for sensory investigations requiring larger numbers of untrained panellists. As part of the Food Science Division we also have access to world class laboratory facilities including the Flavour Laboratory with access to a range of instrumentation for chemical analysis including GCMS, LCMS, odour port and API_MS (MSNoseTM). The MSNoseTM enables in breath volatiles to be monitored during eating. Coupled with sensory data this has enables us to gain important insights between the relationship between volatile stimuli and flavour perception. The Biomaterials Lab provides an exceptionally well equipped facility for the rheological analysis and characterisation of food materials. The new Food Processing Facility also provides access to a range of pilot industrial and research equipment. Collaboration with colleagues at the Sir Peter Mansfield Magnetic Resonance Centre (SPMMRC) has enabled us to gain a deeper understanding, using functional Magnetic Resonance Imaging (fMRI), of how the brain processes signals from sensory stimuli. Together with colleagues at the Sir Peter Mansfield Magnetic Resonance Imaging Centre, we have developed a protocol that closely mimics real consumption, to enable us to follow flavour processing in the brain. Trained Sensory Scientists are scarce in the UK and we are committed to training individuals at all levels of proficiency. We offer formal qualifications at PhD, Masters and Undergraduate level but also short courses for industry. Sensory Science is a key module across our Undergraduate courses in food science and nutrition and food science. Browse courses An MRes degree (one year full-time or up to four years part-time) provides an excellent alternative to bridge the gap between undergraduate and PhD study, and offers a unique opportunity to gain a taste of research at postgraduate level. Two thirds of your time is spent on a sensory related project and the remainder attending taught modules relevant to your investigation. MRes Sensory Science The Sensory Science Centre is host to several PhD students investigating aspects in Sensory Science. Postgraduate research opportunities Short courses in sensory science If you would like to find out more about what we do and how we might be able to help you achieve your sensory objectives, please contact us: Telephone: 01159516140 Email: qian.yang@nottingham.ac.uk Find us Campus map Room Locations on Campus [pdf file]"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/mapsuttonbonington.pdf",
        "uk_pdf_files/Room-Locations.pdf"
    ]
}