{
    "url": "https://www.nottingham.ac.uk/brand/visual/logos.aspx",
    "content": [
        {
            "p": "Our logo represents our heritage. It gives us an identity and separates us from other institutions. We need to take good care of it – respecting it, protecting it and making sure we use it in just the right way. The master logo is made up of three essential elements: the castle square, logo type and location line: This page covers the topics listed below. Click on the topic to be taken to the relevant information or scroll down to read the guidance in full. Our logo and name are protected trademarks, so must not be altered. For digital assets, the Nottingham Blue logo should be the first choice logo. For printed materials, the gradient version should be the first choice logo. If printing in single colour, use either Nottingham Blue or black. The white out version of the logo should be used when legibility is an issue with either the Nottingham Blue or gradient logo. The black version of the logo should only be used if you are printing in black and white. There are also versions of each colour logo without the location line, for use at small sizes. Specific guidance on when you use the version without this line can be found in logo sizes for print and logo sizes for digital. The brand team will need to approve any other logo format in any other context than the above examples (such as a different version of the logo within a campaign). Logo files are available in JPEG, EPS and PNG formats. All logo files are up to date as of December 2022. View and download our logos Digital Print The logo should primarily be used with the castle filled in, to ensure it is always legible and recognisable. However, in some designs it may be beneficial to punch through the castle and allow image or colour to show through. The following examples show how to do this successfully, but any instance of this must be approved by the brand team before sending to print or posting online. When placing the punched through logo you should ensure there is enough contrast to see the castle, otherwise the full version of the logo (without transparency) should be used. If necessary you could edit the shot behind to ensure there is sufficient contrast. Here are some visual examples of what not to do when using the updated transparent logo. 1. Do ensure there is sufficient contrast between the castle and the background 2. Do ensure there is enough contrast between the overall logo and background 3. Do ensure text is legible 4. Do keep the logo transparent. Don't fill in the castle with any colour, let the background show through The standard logo position is top left, with the exclusion zone applied. The exclusion zone is a minimum zone only and you can increase this if visually it works better with the design. Just one or a few of the sides of the exclusion zone can be increased, if this works better with the design. Any social post that is owned or paid does not require a logo, as social channels (Twitter, Instagram, LinkedIn) all have the favicon/university name, meaning there is always brand visibility. However, if creating a post for a partner channel or creating a post to represent a jointly branded project, the Nottingham logo should feature top left, wherever possible, and follow guidance within the partnerships section to create the correct hierarchy. Video on social should follow the logo guidance within the video section. When aligning text to sit with the logo, use the centre point of the castle square. Use this as guidance only, as aligning the text to the centre point of the castle square will not work for every design. If implementing the alignment makes the design look unbalanced, then the text should be arranged in a way that works within the design. To determine the logo width for a printed asset, divide the longest edge of the printed asset by five. The minimum size for the full logo is 35mm. At less than 35mm, remove the UK, China and Malaysia location line. When the logo is used at under 45px in height, remove the UK, China and Malaysia location line. When using the castle square as a favicon, this should be 32 pixels in height. When applying the logo to a digital ad with multiple frames, this must feature on the first and/or last frame. Video use is the only instance the logo can be used centrally. The logo should always be included in the outro. Sometimes videos are tailored to fit different platforms, and you'll need to adapt the logo's position. When using third-party logos in print and digital (apart from in video), follow the guidance on logo size and position to get the correct set up for the asset and then place the third-party logos in a row along the bottom of the asset. If necessary the logos can be stacked in two or more rows. When using third-party logos in print and digital (apart from in video), follow the guidance on logo size and position to get the correct set up for the asset and then place the third-party logo top right of the asset. When using third-party logos in video when the University of Nottingham is the lead partner, place the other organisations' logos below the university logo. If you need to display more than three third-party logos, fade out the original logos and replace with a new set. Keep the University of Nottingham logo in the same position. When using third-party logos in videos when the University of Nottingham is an equal partner, place the other organisations' logos alongside the university logo in a line or grid."
        }
    ],
    "pdf_files": []
}