{
    "url": "https://www.nottingham.ac.uk/brand/voice-and-tone/index.aspx",
    "content": [
        {
            "p": "Voice and tone is how we sound when we're speaking or writing Our voice is our unique personality. It's how we communicate our world beyond the ordinary and how people recognise us in our content - we should always sound like Nottingham. Whereas our voice stays the same, our tone adapts to the context. It allows us to flex our words to make them appropriate for different situations. This page covers the topics listed below. Click on the topic to be taken to relevant information or scroll down to read the guidance in full. Our voice is inquisitive, warm, refined and spirited. We are... We’re endlessly curious and open-minded. We’re eager and pioneering but not hurried or cavalier. We don’t claim to have all the answers and we don’t preach; we open up space for people to think. We’re inclusive and welcoming to everybody, whoever and wherever they are. We invite people in and encourage conversation and collaboration. We’re respectful and approachable. We have big ideas but we’re human and we speak to others on a human level. We’re proud of our students and our staff; we express this pride by glowing rather than cooing. We’re rigorous and scholarly: we appreciate evidence and precision. We value heritage, but we’re not sticklers for tradition. We strive for simplicity, even when communicating complex ideas. We’re creative and inventive. We’re brave: not afraid to be challenging or to speak out in order to make a difference. We’re dynamic and vibrant, with a passion for our work and our vision. ✔ How do we shape our world? Piece by piece. Step by step. With curious minds. ✔ Who were the people campaigning against apartheid in South Africa? Our historians are hoping to create a new chapter in local history by revealing the stories of activism that took place in and around Nottingham. ✔ Everyone is welcome at Nottingham. We consider all applicants purely on the basis of their merits, abilities and potential, regardless of any other irrelevant distinction. ✔ Calling all final year students… Save the date for this year’s Grad Ball! The curtain rises on Thursday 11 June, so get ready to step into the limelight, add a little ooh-la-la, and say au revoir to Nottingham in sensational style. You've earned it. ✔ Unlock your potential in a place of possibility and opportunity – where teaching excellence goes hand-in-hand with pioneering research ✔ The cocoa market is divided into fine-flavour and bulk cocoa. Fine-flavour cocoa constitutes only 5% of the global market, but is growing all the time as more consumers come to realise how chocolate flavour is influenced by terroir, like fine wine. ✔ Today is the International Day Against Homophobia, Biphobia and Transphobia. We value equity and do not tolerate bigotry of any kind. Our campus rainbow crossings are there to remind everyone of that. And we love them. ✔ Universities have already moved to online lectures. Now’s the chance to really shake up how we deliver education. Our tone has two spectrums: from serious to playful, and from analytical to emotional. Where content sits on these scales depends on the context. Certain types of content will gravitate to a particular point. For example, a scientific research paper will probably sit at the analytical and formal ends of the scales, whereas an Instagram Story about freshers’ week will probably be more playful and emotional. We want everyone in our community to feel welcome and appreciated for who they are. When this is the main aim, our tone should sit near the emotional end of the spectrum and somewhere between serious and playful. How to achieve this Looking after our people and making them feel more confident is one of the ways we can unlock their potential. We want to give them unwavering reassurance and support. The right tone for this is more emotional than analytical, and is serious – but not formal. Taking the time – and the words – to celebrate the people around the world learning, collaborating, enabling, researching and sharing with us is important and we do it as often as we can. Their diverse contributions make the university what it is. We want to make sure they know we're proud. But this isn’t about us – it's about them. When informing people is the name of the game, it's important to convey the message accurately, unambiguously and with the right amount of detail. Content designed to provide practical information tends towards the analytical and serious. We want to motivate people to act in lots of different ways. We never want to be pushy about it. When we're asking people to do something, we want to use a more emotional tone, without going off the scale. How playful or serious we are depends on the context. In this context, we want to own our successes and achievements, but not brag. We want to be serious, but not take ourselves too seriously. We want to be modest, but avoid false modesty. ✔ This is a space to explore the challenges we'll need to tackle and the opportunities we should grasp. It's a place to prompt discussion and debate and to float ideas. We'd love you to join in – your thoughts and contributions are eagerly anticipated. ✖ This is a space for our experts to identify the challenges we will need to tackle and the opportunities we should grasp, as well as to determine important topics for research. It is a place to provoke debate and to dissect arguments. It should be thought-provoking. Why not join the discussion? ✔ Our mental health is just as important as our physical health. That's why we have professional counsellors, who will give you free, confidential psychological support. Whatever you're dealing with. Lots of students experience some form of mental health problem while at university. We're here to help. ✖ Research shows that one in three students will experience mental health problems while they are studying at university. Pro-active information is provided about how students can take care of their own mental health and information is available about specialist services students can access if they feel they are struggling. ✔ Our teachers are some of the brightest minds in their fields. Students often say that they feel lucky to learn from such brilliant people. We love celebrating them at our annual staff Oscars. ✖ The University of Nottingham teaching staff are well qualified and are dedicated to the university. Students benefit from their wealth of experience. Our annual staff Oscars reward the best-performing. ✔ Our list of courses in Clearing for UK and EU students will be published in early August. Sign up to alerts to be the first to see which courses have places. You will be able to make an application from Thursday 13 August ✖ So the envelope didn't contain the results you were hoping for? Don't despair! All is not lost. You still have a chance to apply for a place on an undergraduate course through Clearing. If you have applied via UCAS and are not holding a place, your UCAS Track status will say \"You are in Clearing\" or \"Clearing has started\". Stay calm and follow these simple steps... ✔ Your belief and backing makes a big difference. You help us make scholarships, student-led projects and life-changing medical research a reality at Nottingham. We want to change lives and change the world. And we can't do it on our own. If you can, please donate. We appreciate every pound. ✖ With your help, Nottingham students from all backgrounds can achieve extraordinary things, in and out of the classroom. But talent needs a catalyst. This is your opportunity to give something back. We know you'll want to see future generations succeed. Give a gift and you can help make the incredible happen, every day. ✔ Any student studying at Nottingham can be confident that they will be engaging with staff who are producing internationally excellent and often world-leading research. ✖ Renowned for our unrivalled commitment to teaching and learning, we are routinely ranked in the top 100 of universities internationally. Recognised globally for high quality teaching and acclaimed for our life-changing research, the University of Nottingham truly is the most inspiring place to study and work."
        }
    ],
    "pdf_files": []
}