{
    "url": "https://www.nottingham.ac.uk/brand/visual/",
    "content": [
        {
            "p": "Our look is innovative, inclusive and inspiring. We want to make people think. We want them to see our content and connect those thoughts to the University of Nottingham. Using our logos, colours, fonts and shapes in a consistent way helps to make us instantly recognisable around the world. And with creative illustration and striking photography we can illuminate curious minds and impart our global reach. Click on a topic to be taken to the relevant information, or scroll down to read the guidance in full. Our logo represents our heritage. It gives us an identity and separates us from other institutions. We need to take good care of it - respecting it, protecting it and making sure we use it in just the right way. Logos and how to use them Our coat of arms was officially granted on 15 April 1948 and is a unique symbol and an important part of our history. Using our coat of arms Our colours are an important part of who we are. Used wisely and creatively, they have a positive impact, help people to recognise us and make our content more effective. How to use colour The shape and form of our letters and words moulds people’s perception of who we are. Using fonts consistently strengthens our identity and makes our messages stand out on the page and the screen. Fonts and when to use them Our style of imagery is distinctive to us. It inspires audiences, tells a story or captures a moment, illustrating the ideas at the core of our brand. Simply put – it brings to life a world beyond ordinary. How to use imagery Our illustration style helps us to convey ideas in a clear and inviting way. Illustrations add a human angle to our content and our designs. How to use illustrations We’ve called this section Shapes, but really it’s all about squares. Squares are simple, neat and flexible. They also reflect the castle square of our logo, which helps people to recognise us straight away. How to use shapes Showing complex information in a table or a chart makes it more eye-catching and easier to understand and digest. It can also help people to see patterns and trends. It adds colour to the data, if you will. How to use tables and charts"
        }
    ],
    "pdf_files": []
}