{
    "url": "https://www.nottingham.ac.uk/brand/visual/photography-and-video.aspx",
    "content": [
        {
            "p": "This page suggests points for consideration when selecting photography, video or animation. We follow four principles to ensure our imagery, whether photography, video, animation or illustration, communicates our values and our personality: Global: Reflect the global nature of our community, connections and locations. Look for imagery from around the world, with a mix of colours, textures and stylistic influences to breathe life and energy into our content. Authentic: Tell a real story or capture a moment that shows students, staff and researchers actively engaged in an activity. Dynamic: Show the vibrancy and diversity of life at the university. Find images that convey a sense of wonder, discovery, enjoyment, achievement and passion. Diverse: Celebrate the diverse nature of what we do and the people who study and work here. Choose imagery that shows the depth and breadth of university life, from the beauty and scale of our campuses, to our world-class facilities and the pioneering work of our researchers. Internal users can find further information about photography and video guidelines here. For more information please contact the Traffic Manager at content@nottingham.ac.uk Submit a photography request Please note that student recruitment marketing enquiries will be given priority. This page covers the topics listed below. Click on the topic to be taken to relevant information or scroll down to read the guidance in full. Whether you're capturing students or the campus, try and challenge convention by shooting through objects or from different angles to create more engaging compositions, or capturing movement with a long exposure to communicate excitement. Colour is an important part of who we are. Our palette can have a positive impact, help people to recognise us and make our content more effective. So when shooting or selecting imagery, aim to incorporate one or more of the brand colours. This can be done post production, editing the colour of items of clothing or background elements. Do not change the colour of anything that would not normally be a different colour, such as people’s hair or lab equipment. Give a glimpse and welcome the audience into life at Nottingham with natural, unposed people shots. Create a blurred foreground to create space to hold text, without a need for block colour layering. This can be useful when creating assets where space is limited. It can also be useful on assets such as covers or leaflets. You must ensure colour contrast accessibility requirements are met when layering text, meaning the colour contrast between image and text is high enough. To help identify accessibility issues with web assets and text you can use WAVE, a free chrome extension. Also ensure that if the text can’t remain as live text, that it is either tagged correctly (alt-tags) or that the understanding of the image isn’t diminished, and it’s explained elsewhere. For example, on social media text over an image is fine, so long as it is also explained in the caption. Copy should be limited to a few words, rather than sentences or body copy. Our version of greyscale. A gradient map using Nottingham Blue and Portland Stone can be applied to create a sophisticated, on brand image treatment. This can also help when layering text over imagery as it reduces colour in a shot. This should only be created using a gradient map in Photoshop and not created in any other way as the effect will not be the same. If using within a video, use the effect ‘tint’ to create the style. If using text over a digital image, you should take appropriate actions to ensure this is accessible. See the guidance within the text over image - foreground blur section."
        }
    ],
    "pdf_files": []
}