{
    "url": "https://www.nottingham.ac.uk/brand/visual/fonts.aspx",
    "content": [
        {
            "p": "The shape and form of our letters and words moulds people’s perception of who we are. Using fonts consistently strengthens our identity and makes our messages stand out on the page and the screen. This page covers the topics listed below. Click on the topic to be taken to relevant information or scroll down to read the guidance in full. Our sans serif font is Circular. The range of weights make it a flexible font and allows for more consistency across all assets produced for the university. Contact the brand team to request the font files if you believe you will use the primary font regularly. If a license is available, they’ll get you set up. Or, if you’re a third-party supplier, you will need to buy Circular from lineto.com. For emails, PowerPoint presentations and other Microsoft packages, it’s fine to use our system font substitutes, which you’ll find below. Use HarmonyOS Sans as the Circular equivalent when writing in Chinese. If you need access to HarmonyOS Sans, please contact brand@nottingham.ac.uk for the font files. Our serif font is Lora. Lora is a Google font and can be freely downloaded via Google fonts. Use Source Han Serif as the Lora equivalent when writing in Chinese. It is available to download from Adobe. If there is an instance in that you need to visually recreate handwriting, the font Segoe Script Regular should be used. This should only be used as an illustrative device, in small amounts and never for body copy. If you need access to Segoe, please contact brand@nottingham.ac.uk for the font files. If it’s not possible to get a font licence, or to use Circular or Lora, you can use the following system font substitutes: Arial Bold Arial Bold Italic Arial Regular Arial Italic Georgia Bold Georgia Bold Italic Georgia Regular Georgia Italic Sentence case should be used as default for all text. Uppercase should be avoided in large amounts, as it isn’t particularly accessible. Circular and Lora can be combined in documents, for example Circular can be used for headings and subheadings and Lora for body copy and vice versa. Circular Light works best for headings and subheadings, rather than for body copy. The examples on this page are recommendations, rather than rules."
        }
    ],
    "pdf_files": []
}