{
    "url": "https://www.nottingham.ac.uk/brand/visual/illustration.aspx",
    "content": [
        {
            "p": "Our illustration style helps us to convey ideas in a clear and inviting way. Illustrations add a human angle to our content and our designs. They can help when photography is not appropriate or possible. They’re also useful for representing conceptual ideas. And they add a layer of personality to our identity. The below guidance sets out our illustration principles to help designers create bespoke illustrations for the university. Our illustrative style is clean, simple and sophisticated. Hands can be included to add more personality, a playful edge and inclusive feel, without the need to focus heavily on people. This page covers the topics listed below. Click on the topic to be taken to relevant information or scroll down to read the guidance in full. Use Nottingham Blue and a maximum of three colours from the secondary palette. Colours should be flat, with no gradients or soft shading. As per the main colour guidance, where colour is used within an asset, Nottingham Blue needs to be visually dominant and the supporting palette should be less than half of the make-up of colour within the asset. Please also be aware of and check for colour contrasts and combinations of colours that are suitable for those with Colour Vision Deficiency (otherwise known as colour blindness), before finalising colours to be used. The Colour Blind Awareness website has some useful advice on this. Be playful with scale, exaggerating the size of certain elements of illustrations, where appropriate. Simplicity trumps complexity. Illustrations should be simple, with just enough detail to make the illustration clear. A combination of outlines and solid shapes should be used. When using outlines ensure these are consistent in weight and visually match the examples on this page. If illustrating people, ensure a diverse representation. Diverse skin tones can be represented with either realistic skin tones or tints of the palette. Realistic skin tones can be used in addition to the main three colour restriction. Avoid obviously gendered imagery, to avoid reinforcing gender stereotypes."
        }
    ],
    "pdf_files": []
}