{
    "url": "https://www.nottingham.ac.uk/brand/philosophy/content-principles.aspx",
    "content": [
        {
            "p": "All content should be created for a purpose that meets a business objective – even when the purpose isn't transactional. It should be clear to everyone, including the user, what the purpose is. Before you create content, be clear about who it's for. What problem are you solving, what question are you answering, or what emotional response do you hope to provoke? To put it another way: what does the user need or want? We value innovation and creativity in our work and our content. When appropriate, strive to present your message in a creative and original way that sets us apart from our competition. Take care not to inadvertently exclude groups from your content. Use inclusive language and design to ensure everything you publish is usable for all. Accessibility is not an optional choice – it's a legal requirement and makes all our content better. Remember that any number of factors can impact a user's ability to access and understand your content, from the device they're using to how busy they are. Good content takes time and care to create, but poor content creates a burden of future work to replace it – as well as being bad for our users and reflecting poorly on the institution. Given the option, always do less and do it better. Remember that content doesn't exist in isolation. Have empathy for your user; consider their possible emotional state as they consume your content. Adapt your tone depending on the subject matter just as you would in a face-to-face conversation. Using the same voice, format and design in all our content helps users to become familiar with us, and builds trust based on consistency. But remember that guides are not rule books, and should never eclipse making your content readable or useful. Use common vocabulary over obscure vocabulary, short sentences over long ones and simple constructions rather than complex. Keep your writing as concise as you can without losing meaning. When possible, give precise information along with an opportunity to learn more."
        }
    ],
    "pdf_files": []
}