{
    "url": "https://www.nottingham.ac.uk/brewingscience/study-with-us/study-with-us-brewing-courses.aspx",
    "content": [
        {
            "p": "The International Centre for Brewing Science is a centre of excellence for brewing education. Our courses are delivered by a team of top academics who are internationally recognised experts in brewing. We are supported by a large team of speakers from across the industry who contribute their own specialist knowledge. We have excellent links with industry in both teaching and research and our graduates are highly sought after. Most of our courses are at postgraduate level, so typically applicants should have an undergraduate degree in a relevant field of science or engineering. However, we can admit students without a degree if they have equivalent career experience of brewing and/or professional qualifications, such as the Institute of Brewing & Distilling (IBD) Diploma in Brewing. If you are not sure whether you would be eligible, please email us for advice at brewing.science@nottingham.ac.uk. We can give you access to demonstration course materials (so that you can check their suitability). It is also possible to sign up for most of our courses individually as ‘short courses’ if you want to check that the level is right for you. We partner with the IBD and HIT training to deliver brewing level 4 apprenticeship training to the UK industry. Our Masters qualification is formally recognised by the Institute of Brewing and Distilling and graduates are therefore exempted from the brewing Diploma level examination should they wish to sit the IBD Master level professional qualifications in the future. Use state of the art brewing kit We offer two main options in brewing education: 1. Full-time (1 year) Masters in Brewing Science and Practice targeted at graduate scientists or engineers wishing to pursue a career in brewing. More about the full-time MSc course 2. Part-time continuing professional development courses for brewers which are ideal for those already employed in the industry and are designed to be studied around your work. These typically combine flexible e-learning study with an annual week in residence at the University in the Spring term. More about the part-time courses There is somecrossover between the study programs and hence opportunities for networking between young students wishing to enter the industry and experienced professionals already working in breweries, which vary from craft to regional or large multi-national. Be part of a vibrant and global learning community Individual development courses - specific interest School of Biosciences University of Nottingham Sutton Bonington Campus Loughborough, Leics LE12 5RD Email: brewing.science@nottingham.ac.uk Telephone: Brewing Apprenticeship enquiries: +44 (0)115 9516742 All other Brewing Course enquiries: +44 (0)115 9516191 Brewing Research and General enquiries: +44 (0)115 9516245"
        }
    ],
    "pdf_files": []
}