{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-14Oct2021new.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 13 October 2021 at http://bit.do/nubs-masterclass-14-Oct Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. This session will begin with a discussion on the impact of the changing world of work and the significant demographic, social and technological changes (including digitalisation and impact of Covid-19), on employee wellbeing, innovation and performance. We will discuss the concepts of sustainable work, work organisation, work-related stress and employee engagement and the cost to organisations. This session will give you an overview of the tools and interventions that can be used at the individual and enterprise level to promote wellbeing at work. You will learn how effectively managing the work environment can promote not only wellbeing but also enhance innovative workplace behaviours and performance at work. Dr Aditya Jain is Associate Professor in Human Resource Management and Head of the Organisational Behaviour/HRM Department at Nottingham University Business School, UK. He is a member of BSI and ISO technical committees on Occupational Health and Safety Management, Human Capital and Governance, Finance Director of the European Academy of Occupational Health Psychology and Associate Editor of the journal ‘Safety Science’. His expertise lies in sustainable work and policy, specifically in relation to the role of public and organisational policy for the management of the psychosocial work environment, aimed at promoting mental health at work and well-being. His work has also focused on examining the role of softer forms of policy, such as voluntary standards and social dialogue in the management of working conditions, the promotion of decent work and more recently on the future of work. He has worked as an expert advisor and consultant to the European Commission, the WHO, the ILO, EU-OSHA, and in industry. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}