{
    "url": "https://www.nottingham.edu.my/Business/People/david.goodwin",
    "content": [
        {
            "p": "Dean of Nottingham University Business School Malaysia⁠, Faculty of Social Sciences Professor David Goodwin is Dean of the Nottingham University Business School in Malaysia. David's appointment, from May 2023, accelerates our drive to build a strongly industry-engaged business school, and to deliver transformative business education and research for our region. David brings a highly commercial approach, and an extensive network of business relationships across the Asia Pacific region. He possesses the know-how to build new partnerships that will create ongoing positive industry-relevant opportunities for our students. Before moving into academia, David enjoyed an impressive business career. He spent twelve years in all working directly for CEOs of significant publicly listed corporations, including Singapore's Neptune Orient Lines, then the world's fifth largest container shipping business (2005-10) and BlueScope, the major Asia-Pacific steel business (2000-05). He was Head of Corporate Affairs for both of these corporations, responsible for media relations, community relations and external engagement amongst other functions. His earlier career was with BHP, the world's largest resources company, in corporate legal then government relations roles. David was admitted into legal practice in 1988 and signed the Victorian Bar Roll in 2010. He has a PhD in Law and a Master of Business (Logistics Management) from RMIT University, a Graduate Certificate in International Arbitration from the National University of Singapore, a Diploma in Commercial Law from Monash University and a Bachelor of Laws from the University of Queensland. After commencing a full-time academic career in 2014, David maintained a part-time practice as an Arbitrator/Mediator and commercial Barrister at the Victorian Bar in Melbourne. He is a Fellow of the Chartered Institute of Arbitrators (UK), a Fellow of the Singapore Institute of Arbitrators, a Past President of the Maritime Law Association of Australia and New Zealand and a Titulary Member of the Comite Maritime International. He has particular expertise in trade and shipping law and international business. Prior to joining the University of Nottingham, David was, for four years, Head of Industry and External Engagement for the Business and Law schools of Victoria University in Melbourne, Australia. Before that he was with RMIT University in Melbourne where he was MBA Director (2016-19) and Director of RMIT's postgraduate Juris Doctor program (2015-16). In these roles he gained extensive experience in collaborative curriculum design and delivery. Creating education partnerships; commercial law; sustainability; international business. Currently teaching International Business and Sustainability modules. Past teaching has covered a wide range of areas including international business, commercial law, consulting skills, innovation & entrepreneurship, business governance and ethics. David is an active researcher with cross-disciplinary interests. His research addresses issues that are at the nexus of business and law, exploring their effect on society and their application to… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}