{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-24March2022.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 23 March 2022 at https://tinyurl.com/nubs-masterclass2022-24Mar Should you have any queries, please contact Ms Leong Choy Wan at NUBS.EDP@nottingham.edu.my. This session will look at how strategy actually gets made in an organization. We will look at what we can learn from understanding strategy-making as a messy process of making sense of an organization’s past, present and future. We provoke the idea that “strategy” is not a rational or precise analytical process that many scholars and executives would like it to be, and moreover this rationalization is not especially useful when attempting to respond to change and unpredictability in the competitive environment. Instead, we will draw on scholarship that considers “strategy as narrative”, and look at how best executives can “craft” their own organization’s strategy story, not least to cope with uncertainty, gain wider organizational buy-in and stronger strategic alignment. Dr Holstein is Assistant Professor in Strategic and Public Sector Management, Nottingham University Business School. Her research focuses on strategic change & strategy-making or #strategizing, especially through #openness #participation #inclusion #transparency- so called #openstrategy and where she uses the theoretical lens of #narrative. Jeannie combines an interest in practically relevant topics such as the role of language, openness and participation in strategic change and strategy-making with a theoretical interest in discursive and narrative processes. She has presented her work at a number of leading international academic conferences and has recently published in Strategic Organization and European Management Review and currently has papers at a late stage in review in Organization Studies and Strategic Entrepreneurship Journal. She successfully completed her PhD in 2015 at the University of Nottingham. Her doctoral research was funded by the ESRC and investigated strategy as an intertextual narrative (relationship between policy and strategy) within the pluralistic setting of Higher Education. In addition to her PhD, she has a degree in Modern History from the University of Oxford, and holds a MBA from the University of Nottingham. Prior to her academic career she worked as a business strategist in the ceramics industry, where among other roles, she ran the UK subsidiary of a German plc (AG). She also worked as a management consultant in the Higher Education sector. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}