{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-9July2020.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 6 July 2020 at https://bit.ly/nubs-masterclass9july Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. This Masterclass will discuss the Asian Development Bank’s Outlook for 2020 (and revision), issues pertaining to the immediate disruption of economic activities, impacts on most vulnerable sectors and ASEAN’s responses, forecasting and headroom (cash flow management), working capital and supply chain management, the way forward for investment and stock markets, new financial instruments emerging post COVID-19, and investment strategies in a volatile market. Professor Malick Sy has had over 20 years of experience in financial consulting and advisory, as well as fund management, and academic research. Dr Sy has been the Managing Director and Principal of his Hedge Fund based in Singapore, with offices in Kuala Lumpur and the Middle East. He has been a Principal Consultant and Director of Risk Management of Bursa Malaysia, and a member of the Singapore Exchange (SGX) Corporate Advisory Committee (SGX-DT). Dr Sy has consulted with financial institutions across Europe (e.g. BNP Paribas, Deutsche Bank, ING Bank, Credit Suisse, UBS), Asia (e.g. DBS, UOB, OCBC, Maybank, Affin Bank, AmBank, Thai Farmers Bank, VietinBank, ICBC, Construction Bank of China), and Australia (ANZ and ASX). Dr Sy is a Professor of Finance at RMIT University, in Melbourne, Australia, as well as a Visiting Professor of Finance at the City University of New York (USA). (Moderator: Dr Angelina Yee, Director of Executive Education, Nottingham University Business School Malaysia) Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}