{
    "url": "https://www.nottingham.ac.uk/business/who-we-are/centres-and-institutes/sttar-centre/index.aspx",
    "content": [
        {
            "p": "The Sustainable Travel and Tourism Advanced Research Centre (STTAR Centre) is an international research centre focused on improving the critical thinking and decision-making that underpins sustainable travel and tourism development, management and marketing. Our research, knowledge exchange, consultancy and teaching supports local, national and international organisations and individuals to address travel and tourism challenges and explores responsible and sustainable solutions. STTAR Centre builds on the Nottingham University Business School's 25 years of research, knowledge exchange and pedagogic tradition in travel and tourism. Based on the pillars of interdisciplinarity, internationalisation and impact, STTAR Centre is made up of experts from the University of Nottingham and a network of colleagues from academic, public, private and third sector organisations around the world. We believe that the production of new knowledge, whether theoretical, policy or practice focused should be understood in relation to people and places. Our vision Our vision is to produce world-leading, innovative and impactful research through interdisciplinary approaches that rethink theory, policy and practices in ways that travel an tourism are socially just, economically viable and environmentally sustainable. We do this through qualitative, quantitative, or mixed methodologies, including those which consider the potential for research impact, such as managerial or policy recommendations. STTAR Centre hosts a wide range of leading expertise focused on five key strategic priorities. Expertise in these areas has been consolidated and developed through the pursuit of intellectual excellence underpinned by critical scholarship, which generates new understandings and provides a solid grounding for our research, knowledge exchange and pedagogic practices. We deliver excellence through research, knowledge exchange, consultancy and impact work, as well as through our MSc in International Tourism Management and Marketing, PhD Programme and executive programmes. We are open to collaborations with academic and non-academic stakeholders across the tourism value chain and other directly and indirectly linked fields of enquiry such as agriculture, innovation, entrepreneurship and the creative economy at a local, national and international level. Professor Marina Novelli, STTAR Centre Director: Read Nottingham University Business School news. Our blog features in-depth features, opinion pieces and discussions. Connect with Nottingham University Business School Jubilee Campus Nottingham NG8 1BB"
        }
    ],
    "pdf_files": []
}