{
    "url": "https://www.nottingham.edu.my/Business-and-Academic-Partnerships/CAPE/Index.aspx",
    "content": [
        {
            "p": "The Times Good University Guide in 2015 described the University of Nottingham Malaysia (UNM) as ‘the nearest Britain has to a truly global university, with campuses in China and Malaysia modelled on a headquarters that is among the most attractive in Britain’. The UNM opened in September 2000 and became the first British University to set up a campus outside of the UK and in Malaysia, earning the University of Nottingham the Queen’s Award for Enterprise 2001 and the Queen’s Award for Industry (International Trade) 2006. In December 2017, the Malaysia Campus was awarded a 5-star rating for the quality of its research and innovation, making it among the highest rated international universities in Malaysia in the Malaysia Research Assessment (MyRA). In September 2005, the Malaysia Campus moved to its current purpose-built site in Semenyih, 30km south of Kuala Lumpur. Designed to reflect the University Park Campus in Nottingham, it is a self-contained, vibrant village situated on a beautiful and landscaped 125-acre site. We have about 5,000 students and nearly 700 teaching and administrative staff from 85 countries. The University of Nottingham is placed 82nd in the world and among the top 100 universities by the latest 2019 QS World University Rankings. Foundation, undergraduate and postgraduate taught and research courses at UNM are delivered within 17 schools and departments across the faculties of Arts and Social Sciences, Engineering and Science. Our graduates are highly sought after, with about 90% employed or engaged in further studies six months after graduation—one of the highest graduate employment rates in Malaysia. The UNM is proud of its international reputation for world-changing research, a status which transcends all of our campuses. We were rated the 8th for research power in the latest Research Excellence Framework. Our research has a particular focus on addressing the challenges facing Southeast Asia and countries in the Islamic world. Over the last few years, research capacity has developed rapidly, and an increasing number of research grants have been funded from various sources in Malaysia, the EU and the UK, with research funding totalling RM6 million from the UK’s Newton Fund and the RCUK Global Challenges Research Fund and approximately RM2 million from Yayasan Sime Darby. The Malaysian Qualifications Agency has granted us self-accrediting status, one of only a limited number of universities to be awarded such an accolade. We offer the best of UK education in an Asian setting. Our programmes are identical to those offered at the University of Nottingham in the UK and follow the same quality assurance processes, and students are awarded University of Nottingham degree certificates when they complete their course. We provide excellent opportunities for our students to study abroad at our UK and China Campuses as well as at our many partner universities all over the world, offering inter-campus, international exchange and summer school programmes. Find out more about the University of Nottingham Malaysia. Bangladesh College Education Development Project (BCEDP)-Honours Degree and Masters in Education Sri Lanka Master programmes-Postgraduate Certificate and Diploma in Education, Master of Arts in Education Facebook LinkedIn Twitter Our partnership activities are centrally administered by the Centre for Academic Partnerships and Engagement (CAPE), established in December 2017 to foster educational partnerships between UNM and other organisations to develop and build capacity across the ASEAN region and beyond. Working alongside Schools and other units within the University, we develop teaching and training partnerships and provide bespoke continuing professional programmes with national and international partners. Our flagship programme is a project sponsored by the World Bank and Government of Bangladesh—the College Education Development Project—which offers leadership and teacher training to college principals and teachers with the total capacity of 10,300 participants over five years. Examples of other current partners/collaborators are PSB Academy, Singapore, Panyathip International School, Loa PDR, Ngee Ann Academy, Singapore, Gateway Graduate School, Assumption College Sri Racha, Thailand and Aditya Birla Education Trust, India. CAPE is supported by a diverse and passionate team of academics who are both researchers and consultants in their area of specialisation. These include Leadership, Curriculum Design, Delivery and Assessment, Teacher Training, Quality Assurance, Country-level policy development, among others. While the remit in this area is unrestricted, a focus on transnational and developmental issues is evident, with subjects such as national policy, quality assurance, leadership and curriculum, learning and assessment being the prominent ones. Examples of past projects are the development of Malaysia’s Science Technology and Innovation Master Plan (STIMP) 2020–2030 and the National Qualifications Framework of Bangladesh. Current research is looking at, among other topics, leadership in schools, education policies, graduate employability, fundraising in higher education, the impact of transnational education and how story narratives can be used to boost English competence among indigenous school pupils. Feel free to browse this webpage. Please click on About if you would like to see the CAPE's staff and read the director's message. If you are interested to know about what we offer, please click on Modules. If you wish to contact any member staff directly, you may visit the People page. If you have an enquiry, you may use the Contact page to send us your message. telephone: fax: email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}