{
    "url": "https://www.nottingham.ac.uk/business/who-we-are/accreditations.aspx",
    "content": [
        {
            "p": "Nottingham University Business School is proud to be among an elite group of business schools worldwide to gain ‘triple crown’ accreditation from the three most influential accrediting organisations: AACSB, AMBA, and EQUIS. Nottingham University Business School is an accredited member of AACSB International—The Association to Advance Collegiate Schools of Business (AACSB). This signifies our commitment to strategic management, learner success, thought leadership, and societal impact. For over a century, AACSB accreditation has been synonymous with the highest standards in business education. Accredited schools have successfully undergone a rigorous review process conducted by their peers in the business education community, ensuring that they have the resources, credentials, and commitment needed to provide students with a first-rate, future-focused business education. Accredited by the European Foundation for Management Development (EFMD), EQUIS benchmarks business school activity against international standards. We were first awarded this sought-after accreditation in 2010, covering our UK, China and Malaysia Business Schools. The Association of MBAs (AMBA) accredits MBA programmes globally. In 2020 AMBA awarded accreditation to all Nottingham MBA programmes in the UK and Malaysia. Awarded in 2019 in recognition of our role in working with British enterprise. Nottingham University Business School was one of the first to become a UN PRME (Principles for Responsible Management Education) Champion. We contribute research and action leadership on responsible management education in the context of the United Nations’ sustainable development goals. The School was awarded the Athena SWAN Bronze award in 2020 for our work in advancing gender equality. Nottingham University Business School is proud to be ranked Top 100 in the world for Masters courses in Marketing, Business Analytics, Finance, Management, and Supply Chain Management (QS World Business Masters Rankings 2025), and Top 50 in Europe in the QS Global MBA Rankings 2025. This global recognition highlights our innovative teaching and strong industry connections. Ranked courses are: Our courses are recognised by professional organisations and offer a range of benefits such as work placements and exemptions from examinations. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. These include: This innovative course is aimed at aspiring chartered accountants. One of only four in the UK, the BSc Accountancy Flying Start programme is sponsored by PwC (PricewaterhouseCoopers) and overseen by ICAEW (Institute of Chartered Accountants in England and Wales). Course details This course is accredited by ACCA (The Association of Chartered Certified Accountants) and allows graduates exceptions from certain papers within the ACCA Professional Examination Scheme. Achieved selected CFA University Affiliate status for all Nottingham's campuses in the UK, China and Malaysia and signals to students and employers that the curriculum is closely tied to investment management practice and supports students to sit Chartered Financial Analyst (CFA) exams. Our BSc Management and MSc Marketing hold dual-award status from Chartered Institute of Marketing, offering a seamless route to the CIM Diploma in Professional Marketing Scheme. Our accreditation from the Chartered Institute of Management Accountants helps students gain valuable workplace experience, access to a wide variety of learning resources and certain exemptions from CIMA exams. The Chartered Insurance Institute accredits MSc Risk Management, BSc Finance, Accounting and Management, BSc Industrial Economics, BSc Industrial Economics with Insurance, BSc Management.These courses all have links to CII professional qualifications. The Chartered Institute of Public Finance and Accountancy accredits our BSc Finance, Accounting and Management. Our MSc Banking and Finance holds Chartered Banker Institute Centre of Excellence accreditation - the gold standard for all banking professionals. Our MSc Human Resource Management and Organisation is fully accredited by the Chartered Institute of Personnel and Development giving exemption from their level 7 Advanced Diploma. The MSc Management is accredited by the Chartered Management Institute. Jubilee Campus Nottingham NG8 1BB"
        }
    ],
    "pdf_files": []
}