{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-08Oct2020.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 5 October 2020 at http://bit.ly/nubs-masterclassOct8 Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. Governance and Ethics go hand-in-hand. While governance concerns leadership and directing the organization along the right path, leadership should be associated with morals, values and a culture that drives an organization to success through an ethical framework. Many past and present examples have shown how corporate governance failed as a result of unethical leadership, resulting in financial loss to corporations, taxpayers, shareholders and other stakeholders of an organisation. It is therefore important to re-look at the ethical values of leaders and the tone that is set ‘at the top’, which will then translate into the ethical culture of the organization. This session will take you through the various attributes of ethical leadership through which corporate citizenship can be emphasized. Dr Jaya is an Associate Professor of Accounting at Nottingham University Business School Malaysia. She has had 20 years of experience in academia and seven years of experience as a professional auditor. She is a Fellow Member of the Institute of Chartered Accountants of India and a Chartered Accountant with the Malaysian Institute of Accountants. She has several years of experience in providing corporate training for executives and top management in the areas of accounting and corporate governance. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}