{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-13Aug2020.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 10 August 2020 at https://bit.ly/nubs-masterclass13august Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. Crises such as the Covid-19 pandemic creates challenges for our minds and hearts that impact performance for individuals and organizations. In addressing such psychological crises, we begin by strengthening individuals and teams. In this quick session, learn to Create The Strength Map that will help you move forward through such challenging times. Dr Brendan Gomez is a psychologist who focuses on positive psychology and is passionate in working alongside people and organizations that struggle with everyday life, relationship and emotional issues. This includes working with adults and youth in areas of thriving during challenges, coping with crisis, communication and conflict management, teamwork and collaboration, stress and burn-out management, and dealing with anxiety and depression in the workplace and family. Dr Brendan is a US Fulbrighter with a PhD in Applied Developmental Psychology and an MA in Counselling Psychology (and a First-Class Hons in Genetics, with research on oral cancer). His strength in facilitating success in life and work comes from his 25-years of multicultural and global work experience that includes the United States, Malaysia and New Zealand. He has provided learning, consulting, and collaborative solutions to individuals, small and large groups, universities, government ministries, corporate organizations, NGOs, churches, youth groups, teachers, schools and even zoo keepers. He uses applied psychology tools that include CBT, Risk and Resilience Mapping, and a Positive People Development framework in facilitating learning and change. Dr Brendan has worked in academia in a number of universities. He has spoken in local and international conferences, published in academic journals and has been featured in the printed press, TV and radio. Recently, he has been extensively featured on TV and newspapers in promoting Happiness during the Covid-19 lockdown. His professional membership over the years includes The American Psychological Association, The Australian Psychological Society, The Malaysian Psychological Association, The American Society of Counseling Psychology, and The American Society of Consulting Psychology. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}