{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-29June2021.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 28 June 2021 at http://bit.ly/nubs-masterclass-29Jun2021 Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. Corporate Treasury Management and market volatility are key concerns for today’s Treasurer. Volatility stems from issues such as the unwinding of the Fed’s balance sheet, rising geopolitical tensions and tariffs, and the impact of COVID-19. Liquidity and cash forecasting, and hedging against currency and interest rate volatilities have always been very important issues for Treasury. In today’s increasingly volatile markets, highly variable input prices and regulatory pressures compound their importance. The talk will focus on building up a currency exchange strategy for corporate businesses, the latest currency hedging techniques, and key questions corporates need to answer for better treasury risk mitigation. The speaker will cover: four steps to managing FX risks in the current volatile conditions, the top FX risk management mistakes, what’s in store for Corporate Treasury in 2021, and the top currencies to watch in 2021 in relation to economy outputs and business forecasts. Professor Malick Sy has had over 20 years of experience in financial consulting and advisory, as well as fund management, and academic research. Dr Sy has been the Managing Director and Principal of his Hedge Fund based in Singapore, with offices in Kuala Lumpur and the Middle East. He has been a Principal Consultant and Director of Risk Management of Bursa Malaysia, and a member of the Singapore Exchange (SGX) Corporate Advisory Committee (SGX-DT). Dr Sy has consulted with financial institutions across Europe (e.g. BNP Paribas, Deutsche Bank, ING Bank, Credit Suisse, UBS), Asia (e.g. DBS, UOB, OCBC, Maybank, Affin Bank, AmBank, Thai Farmers Bank, VietinBank, ICBC, Construction Bank of China), and Australia (ANZ and ASX). Dr Sy is a Professor of Finance at RMIT University, in Melbourne, Australia, as well as a Visiting Professor of Finance at the City University of New York (USA). Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}