{
    "url": "https://www.nottingham.ac.uk/business/who-we-are/centres-and-institutes/hgi/resources/resources.aspx",
    "content": [
        {
            "p": "The Haydn Green Institute offers a range of resources for entrepreneurs and those interested in developing their business ideas, from information about the Ingenuity Process, Toolkits and commentaries from some of our business-leaders. The Entrepreneurship at Nottingham blog features guest posts from academics, entrepreneurs in residence and Ingenuity Lab members. This edition of the HGI Impact Report showcases the work of the Institute over the past year. Academics at the Haydn Green Institute have developed a creative problem solving methodology called the Ingenuity Process. It is used by all students entering Nottingham University Business School in the UK and at campuses in China and Malaysia, and is a key part of our Executive Education offering. The Ingenuity Process helps through: In practice, individuals and organisations tend to neglect these critically important activities in order to cut corners. The Ingenuity Process provides a rigorous framework to ensure that the correct problem or root cause is considered, that wide and diverse ranges of potential solutions are generated and that the optimal solution is determined. An online version of the process has been developed and is currently taught to our MBA and MSc students, as well as corporate clients. The My Way team - HGI’s Dr Isobel O’Neil along with local entrepreneurs Alexandra Hardwick and Debbie Clarke - launched a My Business My Way toolkit in January 2019. This is a free-to-access interactive PDF to support the personal development of women who run their own businesses. In April 2019, the team won the Smallwood Trust innovation prize at Ingenuity19. This led to the development and delivery of a toolkit and workshop programme for lower income women exploring self-employment. During the Covid-19 pandemic, the team delivered two My Way Challenges - one via a Facebook group and the other in partnership with Walgreens Boots Alliance’s women in business group. To enable this work to continue, the team has now established an Ingenuity-lab based, social enterprise – The My Way Project CIC and developed their first impact report in November 2020 - which is available to download below. You can download two versions of the toolkit. The first is the original toolkit for those running their own businesses and the second is a toolkit targeted more broadly at people looking to develop in their work roles. Join the conversation: #mybusinessmyway Edited by Dr Thomas Coogan By exploring the economic and social value of disabled people with positive entrepreneurial traits and adaptive skills, this innovative book breaks away from normative entrepreneurial studies to recognise the overlooked value in disabled entrepreneurs. In the study of entrepreneurship, the social tendency to disregard people with disabilities has caused a paucity of knowledge about the successful ventures of disabled people worldwide. Seeking to improve public understanding of disabled entrepreneurs, this pioneering book re-evaluates their identity, value and contribution beyond economic, cultural and geographical contexts. Chapters explore disabled entrepreneurs from non-Western economies and marginalised social segments, with a focus on emphasising the importance of disabled women entrepreneurs from developing economies as agents of change for society and the economy. Exploring the push and pull factors that exist for disabled people in the entrepreneurial ecosystem, chapters disassemble the socially institutionalised barriers to important sources of value creation by disabled entrepreneurs. Jubilee Campus Nottingham NG8 1BB Email: ingenuitylab@nottingham.ac.uk"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/hgi-impact-report-2023-digital.pdf",
        "uk_pdf_files/hgi-impact-report-2023-digital.pdf",
        "uk_pdf_files/ingenuity-in-practice-2nd-edition-final-draft.pdf",
        "uk_pdf_files/the-my-way-project-impact-report-2020.pdf",
        "uk_pdf_files/my-business-my-way.pdf",
        "uk_pdf_files/my-way-toolkit.pdf"
    ]
}