{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-23July2020.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 20 July 2020 at https://bit.ly/nubs-masterclassjuly23 Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. Emerging economy multinational enterprises (EE MNEs) tend to encounter serious and prolonged legitimization challenges in host countries, especially in developed Western countries. Drawing upon and integrating the stakeholder theory and the institution-based view, it seems to be evident that home-host country institutional distances result in stakeholder engagement deficiency and local stereotypical judgments which in turn are detrimental to local legitimacy attainment of EE MNEs. Some intervening strategies are likely effective to alleviate legitimization challenges for EE MNEs. Dr Lei Li is an Associate Professor of international business and strategy at Nottingham University Business School China (NUBS China). He served as Associate Dean of Faculty at NUBS China from 2012 to 2016 and Department Head from 2010 to 2012. Previously he had been a faculty member at University of Portland, Oregon and Pace University, New York, USA. He teaches strategic management, managing multinational enterprises, cross-cultural management and international business environment. His teaching cases are included in the Harvard and Ivey business school case collections. His research focuses on internationalization strategy and international social innovation & sustainable development. He received his PhD from the University of Texas at Dallas, USA. Prior to his academic career, he was a management consultant with Roland Berger Strategy Consultants, a Munich-based international management consulting firm. (Moderator: Dr Angelina Yee, Director of Executive Education, Nottingham University Business School Malaysia) Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}