{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/NUBS-Malaysia-Masterclass-UNSDG-Corporate-Civic-Society-Collaborations.aspx",
    "content": [
        {
            "p": "This event is open to alumni and invited guests, and is complimentary. Please RSVP before 10 July 2019 with Dr Angelina Yee (Director, Executive Education) at Angelina.Yee@nottingham.edu.my Over 150 world leaders expressed their support to the United Nations' 2030 Agenda for Sustainable Development that were formulated into Sustainable Development Goals (UN-SDGs) comprising social, economic and environmental challenges that require global action to make a change and to create a sustainable society. Business organisations are seen as having a major role in the achievement of these UN-SDGs. It has also been acknowledged that achieving the SDGs requires partnership among governments, the private sector, civil society and citizens. The speaker for this Masterclass will share how companies or business organisations can work with non-government organisations in achieving the UN-SDGs along with their business goals. Dr Avvari V Mohan is the Director of Research at Nottingham University Business School Malaysia, and Associate Professor of Strategic Management. He has had more than 20 years of experience in teaching, training and research in the area of Strategy and Innovation, with a special interest in inter-organisational linkages that enable firms to develop Innovation and Sustainable Development. He has served as a Council Member of the Consumer Forum for the Malaysian communications and multimedia industry, as a recourse person in WTA-UNESCO workshops, Innovation Auditor for MIGHT Malaysia and more recently as a UNESCO Expert for entrepreneurship and innovation. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Our masterclasses typically consist of a 50-minute presentation, followed by a Q&A session and a chance to network with other business professionals and academicians in attendance. To find out more, please contact Dr Angelina Yee (Director, Executive Education) at Angelina.Yee@nottingham.edu.my. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}