{
    "url": "https://www.nottingham.ac.uk/business/who-we-are/centres-and-institutes/hgi/about-hgi.aspx",
    "content": [
        {
            "p": "About HGI Supported by the Haydn Green Foundation, the Haydn Green Institute (HGI) is at the forefront of creating a culture of entrepreneurship and innovation at the University of Nottingham. HGI provides a stimulating and supportive experience for the budding entrepreneur. If you are interested in learning how to turn your business ideas into reality, then our entrepreneurship education combines theory and practice - our courses are taught by both academics and business experts, and we are keen to equip our students with \"real-world\" experiences. If you want to set up your own business, then the Ingenuity Lab supports business start-ups and offers not only a fantastic space for businesses to get off the ground, but also a complete support package that includes mentoring from business-leaders, advice on how to grow your business and networking opportunities. Our world-leading research covers entrepreneurship education, innovation, and inclusive and sustainable entrepreneurship. Our researchers are investigating a wide range of topics, such as barriers to women becoming entrepreneurs, empowering farmers in rural China and using social media as an entrepreneurial tool. We also provide lots of opportunities for you to develop your entrepreneurial aspirations further by taking part in competitions such as the Young Entrepreneurs Scheme and the Ingenuity Programme. Find out about our services and resources for business start-ups Learn more about what it's like to study innovation and entrepreneurship here Find out more about entrepreneurial research at HGI At the Haydn Green Institute for Innovation and Entrepreneurship we encourage impact-driven entrepreneurship. We equip our students to address real world challenges posed by business and society, in an effective, profitable and sustainable way. Professor Simon Mosey Director, Haydn Green Institute Jubilee Campus Nottingham NG8 1BB Email: ingenuitylab@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}