{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-18June2020.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 15 June 2020 at https://bit.ly/nubs-masterclass-18june2020 Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. This Masterclass is designed to introduce the concepts of Blue Ocean Strategy. Participants will be inspired to think differently about strategy planning and new product and service development. Participants will be presented with key tools and frameworks of Blue Ocean Strategy, and the ways in which their organisations can systematically pursue innovation. The session will provoke new insights using real-world examples and highlight ways to unlock new opportunities for growth. Examples from public and private sector will be shared during the session. Gowrishankar has over 22 years of global experience advising corporates and public institutions on strategy & innovation consulting, and leadership coaching. He has worked directly under Professor Chan Kim, the founder of Blue Ocean Strategy, and has worked on over 100 Blue Ocean Projects. Some of his work has included advisory work for a government on accelerating economic growth and national development, establishing a corporate innovation centre for a large global airline; and coaching the senior management of a large public organization in the application of Blue Ocean Leadership. He has an MBA from INSEAD, France. (Moderator: Dr Angelina Yee, Director of Executive Education, Nottingham University Business School Malaysia) Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}