{
    "url": "https://www.nottingham.edu.my/Business/Courses/PhD/researchproposal.aspx",
    "content": [
        {
            "p": "Dr Kin Boon TANG Director of PhD Programme email: NUBS.PhD@nottingham.edu.my A typical research proposal will be somewhere between 1,000-2,000 words. While we do not insist on a definite format for admission onto the doctoral programme, we encourage students to keep the following in mind while writing a PhD research proposal: The introduction The proposal should begin by explaining the subject area in which the research is to be located and providing an indication of the key theoretical, policy or empirical debates it plans to address. Review of literature The proposal should then present a brief review of the literature you plan to contribute to in conducting your own research. You need to demonstrate a familiarity with the relevant academic literature and theories relating to your research proposal, and an awareness of the major lines of argument that have been developed in your chosen research field. You then need to discuss the research questions you plan to address. Be as specific and focused as possible Motivation for pursuing the topic Research methods Empirical research Most doctoral work involves empirical research. The successful completion of doctoral work in the time allotted thus often depends on the ability to obtain the data needed. If your proposed research involves empirical work you should provide an indication of how you might collect any relevant data. Feasibility of data collection You should give special attention to the feasibility of data collection. Your proposal may contain interesting and highly relevant research questions, and it may be well grounded in the literature, but it may not be a practical research enterprise. You must balance the scope of your proposal against the practical problems of data gathering. Contributions and practical implications Presentation and writing style Room for change? One of the most common mistakes is not clearly defining the objectives of your research. Your objectives should be specific, measurable, achievable, relevant, and time-bound (SMART). A research proposal without a comprehensive literature review may seem uninformed. The literature review demonstrates your familiarity with existing work in the field and how your research will contribute to it. Your research methodology should be clearly defined and appropriate for your research question. A common mistake is not adequately explaining why the chosen methodology is suitable and how it will be implemented. It's important to ensure that your research proposal is realistic and manageable. A common mistake is proposing a project that is too broad or ambitious for the time and resources available. Research is not just about theory. Your proposal should clearly state the practical implications and potential applications of your research. Even if your research idea is sound, poor spelling, grammar, and formatting can create a negative impression. Be sure to proofread your proposal and adhere to any formatting guidelines. Each institution or funding body has its own guidelines for research proposals. Failing to follow these can lead to your proposal being rejected. Always ensure you understand and adhere to these guidelines. The ideal length of a research proposal can vary depending on the requirements of the specific programme. However, a typical research proposal is usually between 1,000-2,000 words. Changes to the research topic after the proposal has been accepted are generally discouraged as it may affect the scope and direction of your research. However, minor adjustments may be permissible with the approval of your supervisor. At UNM, you are always free to ask for any required guidance from your supervisor, attend workshops or seminars offered by the university, and make use of resources available in the library or online. You may also ask for feedback from peers or academic advisors. Common reasons for a proposal being rejected include a lack of clear objectives, a poorly defined research methodology, unrealistic scope, ignoring ethical considerations, inadequate attention to practical implications, poor presentation, and not following guidelines. The methodology section should ideally be detailed enough to demonstrate that you have a clear and feasible plan for conducting your research. Additionally, it should explain what methods you will use, why these methods are suitable, and how you plan to implement them. If your proposal is not accepted, you will typically receive feedback on why it was rejected. You can use this feedback to improve your proposal and resubmit it. However, do check with your specific programme for policies on resubmission. If you have questions during the proposal writing process, you may want to reach out to your supervisor or advisor. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}