{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-27Nov2021.aspx",
    "content": [
        {
            "p": "Time: 4.30pm - 5.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 24 November 2021 at http://bit.do/nubs-masterclass-27Nov Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. Business organisations can no longer ignore the implications of climate change and are often under pressure to do more. Dr Renard Siew will provide an understanding of climate risks that business organisations should be cognizant of, so that decision makers can develop strategies to overcome these risks and see how these can be opportunities to create value for the organisation. Renard is currently the Head of Sustainability, MRCB. In addition, Renard also is advisor to CENT-GPS where he is responsible for advancing the organisation’s work in the field of climate change and sustainability. He is the Founder of Accelerating Climate Action and has served as Co-Chair of the Climate Change & Disaster Risk Management Working Committee and UNEP-FI’s Collective Commitment on Climate Action. In 2020, he was appointed an SDG Champion-Climate Action by the World Economic Forum (WEF). He is a member of the WEF Expert Network Group, serves on the WEF Global Future Council, a Community Champion for Southeast Asia and a Global Lead for the Global Shapers Climate & Environment Steering Committee. He was accepted into the Forbes Fellowship Programme and attended the inaugural UN Climate Action Summit in New York in 2019. Renard is part of the facilitation team at the Cambridge Institute of Sustainability Leadership (CISL). He has also lectured and been appointed Advisor for various universities. Prior to this, he was involved in the implementation of the sustainability agenda for a number of public-listed corporations (like Sime Darby and CIMB) and was a researcher at the Centre for Energy and Environmental Markets (CEEM) contributing thought leadership in: sustainability/ integrated reporting, ESG integration, socially responsible investment (across different asset classes: equities, infrastructure and property/real estate), climate change and sustainable construction for the building/infrastructure sector. Renard is a graduate of Cambridge University and UNSW. https://www.weforum.org/people/renard-siew Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}