{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-20June2020.aspx",
    "content": [
        {
            "p": "Time: 11.00am - 12.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 17 June 2020 at https://bit.ly/nubs-masterclass20june Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. The COVID-19 pandemic has brought with it a wave of uncertainty and anxiety to organisations across the globe. This webinar will discuss how businesses have been impacted by this crisis and why corporations need to re-innovate their businesses to mitigate the risks and uncertainties that will be experienced post COVID-19. Case studies will be shared on how companies are aligning their businesses to the needs of customers impacted by the pandemic by adopting Fourth Industrial Revolution (IR4.0) technologies, and on how organisations can institute changes in corporate strategy and direction to seize new opportunities in order to create and sustain business resilience. Ts Dr Kelly Wee is an experienced Industry Leader, a Chartered Manager and Fellow of the Chartered Management Institute (UK), a professional marketer and Fellow of the Chartered Institute of Marketing (UK), and a professional technologist with the Malaysia Board of Technologists (MBOT). He has served in global multi-national companies such as Compaq, LogicaCMG, Hewlett-Packard and Huawei in various disciplines and in industry vertical solution domains. He was previously the Chief Information Officer (CIO) of Huawei Malaysia. He has had over 23 years of experience in global project management, consulting, solution sales, marketing, strategic corporate accounts, management and business development and operations. (Moderator: Dr Angelina Yee, Director of Executive Education, Nottingham University Business School Malaysia) Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}