{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-27Aug2020.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 24 August 2020 at https://bit.ly/nubs-masterclass27august Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. What is your greatest fear? What keeps you awake at night? Leaders in organizations often struggle with difficult decisions, now further exacerbated by crisis such as the COVID-19 pandemic. Many employees from small to large firms were thrown into the deep end, and things remain bleak for some of them. How can individuals respond proactively when plagued with fears and hardship? In this session, we shall explore effective coping strategies for individuals and families, and learn from resilient leaders and individuals who harnessed the power to recover, and moved forward despite their adversity. Dr Patricia M. Ang has a PhD in Applied Developmental Psychology (Pennsylvania State University), and postgraduate degrees in Counseling Psychology (De La Salle Uni.). Patricia and her international collaborators are recipients of numerous grants including from the Ministry of Science, Technology and Innovation Malaysia (MOSTI), Asian Institute of Chartered Bankers, and the Ministry of Higher Education. She has presented at conferences locally and internationally, and has published and reviewed for international journals. Her research in psychology, teaching and learning include papers on 'Optimism and employment outlook', 'Curriculum to enhance graduates’ entrepreneurial, psychology, and management skills', and in Positive Youth Development which she first embarked upon as a Prevention Research Fellow at Penn State’s College of Health and Human Development. An Assistant Professor at Nottingham University Business School Malaysia, she supervises postgraduate students, and convenes undergraduate and postgraduate courses in Organizational Psychology, International Human Resource Management, Business Ethics and Sustainability, International Business, and Strategic Management. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}