{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/NUBS-Malaysia-Masterclass-Big-Data-Artificial-Intelligence.aspx",
    "content": [
        {
            "p": "This event is open to alumni and invited guests, at no charge. Please RSVP before 14 April 2019 with Dr Angelina Yee (Director, Executive Education) at Angelina.Yee@nottingham.edu.my In the recent past, the fields of big data and artificial intelligence (AI) have attracted a lot of attention from both academia and industry. Together, they have started to change our business landscape and provide more opportunities for companies to implement innovative business models. Companies such as Alibaba, Google and Facebook have invested heavily on incorporating AI and big data within their business models to create, deliver and capture value. This inaugural masterclass in the NUBS Malaysia Masterclass Series provides an overview of the applications of big data and AI in business together with the sharing of recent research in the area by academicians at the University of Nottingham, to demonstrate how businesses can take advantage of big data and AI in value creation. Professor Alain Chong was born in London but grew up in Malaysia and Indonesia. He was named as one of Ten Outstanding Young Malaysians by Junior Chamber International in 2012. Elsevier named him as one of the most cited scholars in China in 2015, 2016, 2017 and 2018. Alain is also a Ningbo 3315 Foreign Talent Recipient. To date, he has received more than RMB 3 million in funding from the HK General Research Fund, China’s National Natural Science Foundation (NSFC), and the Royal Society (UK). He has published more than 100 articles in journals and conference proceedings. He was also named one of the Top 50 Most Productive Malaysian Computer Science Researchers between 2000-2010 by Web of Science. His current research interests are in the areas of Digital Business Models, E-Commerce, Blockchain Business Models, and Social Media Analytics. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Our masterclasses typically consist of a 50-minute presentation, followed by a Q&A session and a chance to network with other business professionals and academicians in attendance. To find out more, please contact Dr Angelina Yee (Director, Executive Education) at Angelina.Yee@nottingham.edu.my. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}