{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-02July2020.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 29 June 2020 at https://bit.ly/nubs-masterclass2july Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. This webinar will provide a quick overview of the accounting considerations needed for the preparation of financial statements during and post pandemic, and during the consequential economic recession. Topics covered will include the impairment of assets (PPE, inventories, etc.), impairment of financial assets (expected credit loss), government grants, onerous contracts and other provisions, re-assessment and modifications of lease contracts, fair value measurement, other accounting estimates and measurement uncertainties, as well as the issue of going concern. Dr Lau has more than 25 years of practical experience in financial accounting and corporate reporting, corporate finance, banking management, financial management, investments, academic administration, lecturing, corporate training and consultation work. He conducts training, lectures, and seminars for in-house corporate clients as well as public courses in IFRS/MFRS/MPERS/MPSAS, sustainability reporting, financial shenanigans etc. His research papers have been published in journals and presented in national and international conferences. He served as a member of the Issues Committee of the Malaysian Accounting Standards Board from 2008 to 2013. He is currently serving as a member of the ACCA Malaysia Advisory Committee. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}