{
    "url": "http://www.nottingham.edu.my/Business/People/patricia.ang",
    "content": [
        {
            "p": "Assistant Professor, Divisional Director of Leadership, Management and Marketing Division, Faculty of Social Sciences Dr Patricia Ang is an Assistant Professor at the Faculty of Arts & Social Sciences, and the Nottingham University Business School (NUBS). She received her doctorate in Applied Developmental Psychology (Human Development) from the Pennsylvania State University in USA specializing in adolescent positive development and Prevention Sciences. Previously, Dr Patricia was on a Prevention Research Fellowship at the Prevention Research Center for the Promotion of Positive Development. Dr Patricia's professional expertise includes: * Youth Psychological health & Evidence-based Interventions * Counselling & Mental Health Promotion * Cross-cultural Measurement of Psychological Constructs * Work psychology & Sustainability in organizations Dr Patricia currently teaches both undergraduate and postgraduate students at the University of Nottingham Malaysia Campus. These are modules on organizational research methods, qualitative research,… read more Current Research With a background in Developmental and Counselling Psychology, Dr Patricia is an educator, youth practitioner and active researcher. Dr Patricia's research interests include mental health promotion and evidence-based programmes. Recently she was involved in a nationwide study commissioned by the Ministry of Higher Education (MOHE) to investigate infant abandonment, youth pregnancy and pre-marital sex in Malaysia. She is a recipient of grant funding from the Ministry of Science, Technology & Innovation Malaysia (MOSTI) in collaboration with colleagues from the School of Psychology at Nottingham University. Together with two other economists at the Business School, she is looking into the antecedents of consumer debt arising from credit cards and personal loans. She is also currently investigating the link between optimism and future employment prospects among college students. Through another corporate grant from the Asian Institute of Charted Bankers (formally known as the Institute of Bankers Malaysia), Dr Patricia conducts research on sustainability in the banking industry. Of particular interest is the supply and demand for green banking initiatives from the perspective of bankers, corporations, and heads of households. Her collaborators include Dr Rebecca Kim and Dr Pek Chuen-Khee. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}