{
    "url": "http://www.nottingham.edu.my/Business/About/advisory-board.aspx",
    "content": [
        {
            "p": "The Nottingham University Business School Malaysia (NUBS) Industry Advisory Board (IAB) provides strategic advice to support the Business School’s current development and future activities. Board members include distinguished business leaders in the region that help to develop strong links with businesses, organisations and policymakers and to ensure the continuing relevance of the School’s programmes and activities. Several members of our IAB are also part of the NUBS Global Advisory Board which comprises two or three members from each of the IABs of NUBS UK, China and Malaysia respectively, plus up to four co-opted members. Dr. Jasmine Begum, Director of Legal, Corporate & Government Affairs for ASEAN and New Markets. Based in Kuala Lumpur, Jasmine has held this role since 2010, where she oversees corporate affairs, government relations and policy engagement as well as philanthropies for Microsoft businesses in in the ASEAN region. Jasmine joined Microsoft with over 20 years of award-winning experience that uniquely straddles both legal/policy engagement and communications, that included leadership and regional stints at companies such as Dell Malaysia, the United Nations Development Program, the United Nations Executive Office of the Secretary-General in New York as well as having been a corporate litigator. Jasmine has broad educational qualifications, having completed a double degree in law at the International Islamic University in Kuala Lumpur. Jasmine then pursued post-graduate studies in both Law and Communications in the UK and earned her Ph.D. in business and human rights. An excellent problem solver, resourceful and flexible solution provider who thrives on challenges. Passionate to deliver leadership and operational excellence and contribute towards a healthier world to drive efficiencies and effectiveness in the organization. His major strengths are in building organizations, human relations, influencing people, articulate, with strong analytical skills to prescribe strategic initiatives, moving forward. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}