{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/NUBS-Malaysia-Masterclass-Blue-Ocean.aspx",
    "content": [
        {
            "p": "This event is open to alumni and invited guests, and is complimentary. Please RSVP before 30 August 2019 with Dr Angelina Yee (Director, Executive Education) at Angelina.Yee@nottingham.edu.my The Blue Ocean Masterclass is designed to introduce the concepts of Blue Ocean Strategy. Participants will be inspired to think differently about strategy planning and new product and service development. Participants will be presented with key tools and frameworks on Blue Ocean Strategy, and the ways in which organisations can systematically pursue innovation. The session will provoke new insights using real-world examples and highlight ways to unlock new opportunities for growth. Examples from both public and private sectors will be shared during the session. Mr Gowrishankar has over 22 years of global experience advising corporates and public institutions on strategy and innovation consulting, and leadership coaching. He has worked directly under Professor Chan Kim, the founder of Blue Ocean Strategy. His work has included establishing a corporate innovation centre for a large global airline in order to instil a culture of creativity while increasing revenues through new products and services; designing and facilitating implementation of over 100 breakthrough Blue Ocean projects for a national government that accelerated economic growth and national development; and coaching the senior management of a large public organisation in the application of Blue Ocean Leadership. He has an MBA from INSEAD, France. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Our masterclasses typically consist of a 50-minute presentation, followed by a Q&A session and a chance to network with other business professionals and academicians in attendance. To find out more, please contact Dr Angelina Yee (Director, Executive Education) at Angelina.Yee@nottingham.edu.my. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}