{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-15April2021.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 14 April 2021 at http://bit.ly/nubs-masterclass-15Apr2021 Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. The banknote supply chain is an indispensable and integral part of the modern-day financial system by ensuring an adequate supply of bills in circulation to meet market demands. This is accomplished through the detection of counterfeit bills, the destruction of damaged currency and the issue of new notes to replace those which have been destroyed. Yet, conventional models of banknote supply chain, which are governed centrally by a dominant player in the form of the central banking authority of a country, suffer from problems of operational efficiency. The emergence of blockchain as a distributed technological infrastructure has the potential of disrupting how banknote supply chains are configured. Through an in-depth case study of how the banknote supply chain ecosystem in mainland China has evolved from a centralized governance architecture to one that is founded on peer-to-peer collaborations among banking institutions, this study draws on a path dependency perspective to shed light on the inter-organization mechanisms underpinning the reinforcement and cessation of pre-existing paths pursued by entities within the ecosystem as well as the creation of a new path for the collective body. Alain Yee Loong Chong is a Professor in Information Systems and Dean of the Graduate School at University of Nottingham Ningbo China. He obtained his PhDs from the University of Nottingham and Multimedia University Malaysia and was a postdoctoral research fellow at Hong Kong Polytechnic University. His current research interests include technology driven disruptions, social media analytics, digital transformations, and mobile computing. His work has appeared in the Journal of the Association for Information Systems, Information & Management, Decision Support Systems, Transportations Research Part B: Methodological, Annals of Operations Research, International Journal of Operations and Production Management and Information Systems Frontier, among others. He now serves as the Co-Editor-in-Chief of Industrial Management & Data Systems, Senior Editor of Decision Support Systems and Associate Editor of Information & Management. Alain has conducted executive education courses for companies such as the China Railway Rolling Stock Corporation, Huadong Engineering Corporation Limited, Yingzhou Bank China and the Aviation Industry Corporation of China (AVIC). He also works closely with companies such as Alibaba, JingDong (JD.com), People Bank’s of China, Douyu (NASDAQ listed live streaming platform), to name a few in the area of Blockchain and Big Data Social Media research. Alain is listed as one of the Most Cited Researchers in China by Elsevier. He is also the recipient of the 2012 Ten Outstanding Young Malaysian Award and the 2020 Ningbo Camellia Award. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}