{
    "url": "https://www.nottingham.ac.uk/business/study-with-us/index.aspx",
    "content": [
        {
            "p": "We offer a full portfolio of business courses across undergraduate, masters, MBA, executive and doctoral education. At Nottingham University Business School, whatever level of study you choose you will find courses taught by experts in their field, informed by the latest research, and enriched by the involvement of experienced business leaders. Join us and you will be joining a dynamic community, based at our stunning Jubilee campus. Our undergraduate degrees will prepare you for a range of careers and unlock your potential. Our masters courses cover all areas of business. We provide tailor-made programmes to help you and your business evolve. Whatever your goal or ambition, the Nottingham MBA will help you achieve it. Develop your research skills through PhD study. Nottingham University Business School is a vibrant and diverse community. We explore sustainable business, support entrepreneurial activity, and celebrate our global engagement. We develop your digital capabilities through offering industry recognised qualifications alongside your degree studies. Our engaged research means that you will have exposure to world-class academics and opportunities to connect with leading business practitioners. Whether you’re thinking about joining us, or you already have an offer, you can book an informal online appointment to speak to one of our recruitment team to find out more about our courses and competitive scholarship opportunities. Our careers support helps our graduates excel in a global environment and find rewarding and successful career paths. Business School careers and employability We’re based at the University of Nottingham’s award-winning Jubilee Campus, recognised for its innovative architecture and sustainability. The campus is only 10 minutes away from Nottingham city centre. Facilities and campuses Wendy Furness, Scarsdale Vets Executive MBA Transform your future by studying at a world-leading university in the heart of England Online open days Student life Read Nottingham University Business School news. Our blog features in-depth features, opinion pieces and discussions. Connect with Nottingham University Business School Find out more about the School's accreditation and rankings Jubilee Campus Nottingham NG8 1BB"
        }
    ],
    "pdf_files": []
}