{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-23Sept2021new.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 22 September 2021 at https://bit.do/nubs-masterclass-23Sep2021 Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. The current pandemic is changing the way people work and how companies operate. Business schools are forced to respond to these changes and develop new policies and practices, but do these changes make them better? Already, long before the pandemic, business schools have faced criticism related to their role in the society, and on their impact on the natural environment. The current transformation of educational models offers a unique chance to incorporate more responsibility into the teaching curricula and operational practices in place at business schools around the world. In this talk, we discuss potential challenges and opportunities of such a transformation towards building responsible management education, and implications for students as well as their employers. Dr Michal Lemanski is Assistant Professor in International Business at Nottingham University Business School, University of Nottingham Ningbo China (UNNC). He is a Nominated Member of the UNNC Sustainability Committee, and School Representative to the United Nations Champions Group for Responsible Management Education (PRME). He has previously served as the Head of the Department of International Business & Management, Programme Director of MSc International Business, and as Research Ethics Officer. Since 2021 at the forum of the United Nations Principles for Responsible Management Education (PRME), Dr Lemanski is the Lead on a project for integration of Sustainable Development Goals (SDGs) in teaching curricula of business schools. Dr Lemanski's current research focuses on data-driven exploration of responsible leadership and responsible consumption in emerging markets. For his research, he won a major grant from the National Natural Science Foundation of China, has been awarded the prestigious Erste Bank Prize, the City of Vienna Jubilee Funds grant, numerous other research grants and scholarships, and was a finalist for the “Most Promising Scholar” award of the Academy of International Business. His studies have been published in leading journals, books, and presented at international conferences. He currently serves as the Editorial Board Member of an Encyclopedia of Corporate Social Responsibility to be published with Edward Elgar Publishing in 2022. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}