{
    "url": "http://www.nottingham.edu.my/Business/People/anita.chakrabarty",
    "content": [
        {
            "p": "Associate Professor. Director of MBA Programmes., Faculty of Social Sciences Anita Chakrabarty is the Director of the MBA programmes at the Nottingham University Business School (NUBS) in the University of Nottingham - Malaysia (UNMC). Anita, has a PhD. from the University of Nottingham. She also has a background in Economics and Public Administration from the University of Malaya. She has two Master's degrees, one in Public Administration (University of Malaya) and another in Marketing (University of Northumbria at Newcastle). She has previously headed the Nottingham University Foundation Programme, she has been a Deputy Director of Undergraduate programmes and Academic Head of the Strategy and Marketing Division. Her research interests are mainly in the area of Consumer Behaviour and Marketing Services and specifically in customer value. Her current research interests focuses on the co-creation of value with stakeholder networks, responsible businesses and customer engagement, while past research has been on customer value emerging from distribution channels in financial services. In relation to her marketing background she has also been involved in industry funded projects related to Consumer Behaviour and Marketing. She has been involved in developing the Traditional and Complementary Medicine Consumer Guideline funded by the World Health Organisation for the Ministry of Health Malaysia. Additionally, she is also a is a HRDF* Certified training practitioner for Executive training/development programmes . *Human Resources Development Fund, Ministry of Human Resources Malaysia Consumer Behaviour, Marketing Services, Stakeholder Marketing , Co-creation of Value My teaching interests are in the area of Marketing and Consumer Behaviour. I teach Marketing Services, Consumer Behaviour and Marketing Management at undergraduate levels. I teach Marketing for the… read more Current research interests examine co creation of value in networks extending from her work in customer value as well also marketing strategies of responsible businesses. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}