{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-25June2020.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 22 June 2020 at https://bit.ly/nubs-masterclass25june Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. The financial services industry has been significantly impacted by the COVID-19 pandemic. This Masterclass provides a platform to discuss and exchange views on the impacts of COVID-19 on the global and Malaysian economy, with a focus on implications for the financial services industry. This interactive session will also cover the topics of skills and competencies necessary for professionals in financial services and beyond, in order to navigate the new normal. Khairul Nizam is the CEO of FAA, an agency that supports human capital development for the financial services industry in Malaysia. Khairul was previously Deputy Secretary General of the Accounting and Auditing Organisation for Islamic Financial Institutions (AAOIFI), based in Bahrain. Khairul served AAOIFI for over 10 years in various positions. Prior to AAOIFI, Khairul was with Malaysia’s largest financial services group for over 10 years, serving in various areas of the group’s operations, including Islamic finance, corporate banking, auditing, and international banking. Khairul graduated from the University of Nottingham, United Kingdom, and is a Certified Islamic Professional Accountant (CIPA). (Moderator: Dr Angelina Yee, Director of Executive Education, Nottingham University Business School Malaysia) Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}