{
    "url": "https://www.nottingham.ac.uk/business/who-we-are/departments/ob-hrm/index.aspx",
    "content": [
        {
            "p": "In the Organisational Behaviour and Human Resources Management Department, we are working to shape a sustainable future by improving people’s experience of work and by shaping a better, fair and resilient world of work, through the provision of high quality research, innovative teaching and partnerships with external stakeholders. The department is known for its research quality and impact, and also for the thematic breadth and depth of its research in areas relating to the social and economic dimensions of sustainability. We work with employees, employers, managers and HRM professionals, policy makers and a variety of organisations like NGOs, trade unions and charities through our Work, Employment and Organisation (WEORG) research community, the Centre for Health Innovation, Leadership and Learning (CHILL), and the Africa Research Group, to carry out impactful research, co-develop tailored solutions and deliver world-class teaching and learning opportunities. We offer excellent high-quality teaching across the entire spectrum of topics in Organisational Behaviour and Human Resource Management for students from both business and non-business backgrounds as well as professionals looking to develop further expertise or those looking for a career change. We offer a range of innovative programmes at all levels such as the CIPD accredited MSc in Human Resource Management and Organisation. We work with diverse stakeholders to co-produce influential research with practical and theoretical applications. Our high-quality research ensures we can provide interesting, interactive teaching with opportunities to engage with businesses and other organisations. Underlying all our efforts is a commitment to improving people’s working lives, both locally and globally. Jane Nolan, Associate Professor in Human Resource Management and Organisational Behaviour View full profile Connect with Nottingham University Business School Jubilee Campus Nottingham NG8 1BB"
        }
    ],
    "pdf_files": []
}