{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/NUBS-Malaysia-Masterclass-MFRS-16-Leases.aspx",
    "content": [
        {
            "p": "This event is open to alumni and invited guests, at no charge. Please RSVP before 10 June 2019 with Dr Angelina Yee (Director, Executive Education) at Angelina.Yee@nottingham.edu.my MFRS 16 Leases deals with accounting for lease contracts. Lease contracts and the assets, liabilities, income and expenses arising from these contracts could be large in size and significant to a company’s financial performance and position. This new accounting standard is expected to significantly change the way firms account for leases. More importantly, it may affect debt covenants of firms with banks and creditors. This masterclass provides a review of the potential challenges and significant impacts of the transition to and implementation of the Malaysian Accounting Standards Board's new accounting standard for leases, MFRS 16, which took effect from 1 January 2019. Dr Lau Chee Kwong is an Associate Professor of Accounting and Dean of Nottingham University Business School Malaysia. He has more than 25 years of practical experience in financial accounting and corporate reporting, corporate finance, banking management, financial management, investments, academic administration, lecturing, corporate training and consultation work. He conducts training, lectures, and seminars for in-house corporate clients as well as public courses in IFRS/MFRS/MPERS/MPSAS, sustainability reporting, financial shenanigans, and other related areas. His research papers have been published in journals and presented in national as well as international conferences. He served as a member of the Issues Committee of the Malaysian Accounting Standards Board from 2008 to 2013. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Our masterclasses typically consist of a 50-minute presentation, followed by a Q&A session and a chance to network with other business professionals and academicians in attendance. To find out more, please contact Dr Angelina Yee (Director, Executive Education) at Angelina.Yee@nottingham.edu.my. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}