{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-16December2021.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 15 December 2021 at https://tinyurl.com/nubs-masterclass-16Dec Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. Business leaders strive to encourage creativity in the workplace, recognising it as a precursor to innovation, as well as a major factor in business growth, competitive advantage and organisational survival. Yet, many organisations still have significant untapped reserves of employee creativity. Dr Rachael Lamb will explore why employee creativity often goes unvoiced or unrecognised and what organisations can do to encourage it. Dr Rachael Lamb is Assistant Professor in Entrepreneurship and Innovation at the Haydn Green Institute at the University of Nottingham. She teaches on the Nottingham University Business School’s MBA programme. Rachael is a Fellow of Advance Higher Education and holds a Postgraduate Certificate in Higher Education teaching. Her research expertise lies at the intersection of innovation, change management and communication. Her TEDx talk ‘Ever had your ideas rejected? Here’s why’ is based on her research on the evaluation of early stage innovation. Rachael previously worked in industry for 20 years, supporting executive leaders in managing change and innovation. She has worked with many high profile organisations including the National Health Service, Rolls-Royce, Waitrose, and National Grid, as well as with SMEs on unlocking innovation potential for business growth. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}