{
    "url": "https://www.nottingham.edu.my/Business/About/welcome.aspx",
    "content": [
        {
            "p": "Welcome to Nottingham University Business School (NUBS) Malaysia! Established in 2000, NUBS Malaysia is currently home to more than 500 students enrolled in our various undergraduate and postgraduate programmes. The School’s presence in Malaysia provides our students with unique insights into Asian business growth and development whilst reading towards a British degree. Our unique tri-campus offering, delivered by our campuses in Nottingham in the UK, Ningbo in China and Kuala Lumpur in Malaysia, provides students with a truly immersive global education that transforms aspiring business leaders into visionaries and change-makers of the future. NUBS is proud to be among an elite group of business schools worldwide to gain 'triple crown' accreditation from the three most influential accrediting organisations - AACSB, AMBA, and EQUIS. We were among the first business schools to champion the United Nations Principles of Responsible Management Education (UN PRME). NUBS is in its fourth cycle as a UN PRME Champion School. NUBS Malaysia offers a well-rounded and dynamic business education influenced heavily by both research and practical applications delivered by an academic team with diverse expertise and discipline backgrounds. Our approach provides students with the knowledge and skills to succeed in a rapidly changing global business environment. Whenever, as business educators, we ask our industry partners what attributes they are looking for in our graduates, we hear a remarkably consistent message. As well as ‘hard skills’ like financial literacy, quantitative methods and business analytics, they emphasise soft skills. They tell us our programmes must nurture the skill sets, but also the mindsets, that will enable success in a business world where disruption has become the norm. We urge students to focus on developing the ‘seven Cs’, including collaboration, which equips them for the diversity and complexity they will encounter in the global world of work. A business qualification should signify a commitment towards critical thinking, which drives a constant striving for improvement. Modern-day firms’ relentless emphasis on innovation means they expect creative problem-solving by people at all levels of their organisations. These characteristics flourish when they are underpinned by an innate curiosity, a quality which universities must foster, not inhibit. We encourage students to be outstanding communicators by developing superior listening, speaking, and writing skills. It is a given that employers expect business school graduates to exude confidence, but they also want to see that blended with compassion, a vital ingredient of leadership in a rapidly changing world. I invite you to explore the School's website and our social media platforms to find out more about our teaching and research activities as well as our events open to both students and the public throughout the year. Dean, Nottingham University Business School Malaysia telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}