{
    "url": "https://www.nottingham.ac.uk/business/who-we-are/centres-and-institutes/hgi/ingenuity-lab/ingenuity-lab-benefits.aspx",
    "content": [
        {
            "p": "The Ingenuity Lab offers support, services and mentoring by experienced entrepreneurs and specialist consultants. The Lab community brings members together to develop peer-to-peer networks as well as offers a regular timetable of events to challenge perceptions, offer greater understanding, and develop the practice of entrepreneurship. From business advice and mentoring from expert professionals to networking opportunities and desk space, our dynamic community of student and alumni entrepreneurs can get the help they need at the Lab. Here's just some of the benefits to being an Ingenuity Lab member: Our advisory surgeries are run by our team of business advisors - industry professionals who offer confidential advice in areas such as law, accounting, marketing and brand development. Our experienced business mentors provide you with valuable insights on how to kick-start your venture. Our events run throughout the year, and range from seminars led by industry experts, to informal networking opportunities where members can get together and share their experiences. The Ingenuity Lab Ambassador Scheme is for those whose business has developed beyond the start-up stage, and who can inspire and mentor our next generation of Venture members. Benefits include: our advanced business training programme funding opportunities a supportive peer network internships a dedicated mentor a dedicated workspace in the Lab Collaborating with the Small Business Charter the Haydn Green Institute has recruited a number of Entrepreneurs in Residence (EIRs) to support engagement between the University and local SMEs, entrepreneurs and students. The EIRs engage in activities including mentoring Ingenuity Lab businesses and SMEs, delivering business training seminars and aiding academics in their research. With over 50 EIRs registered with us, we are able to call on their wealth of experience to support our Lab's start-up businesses covering important topics such as: If you are from a Nottingham-based SME or are part of a University of Nottingham student or alumni business, and require business advice, please get in touch with us to request a meeting with an EIR. The Ingenuity Lab is a brilliant network of diverse people and ideas who are united by the belief that we can make positive changes happen. Jubilee Campus Nottingham NG8 1BB Email: ingenuitylab@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}