{
    "url": "https://www.nottingham.edu.my/Business/People/shawwarn.too",
    "content": [
        {
            "p": "Assistant Professor of Accounting/Taxation, Faculty of Social Sciences Dr. Too is an Assistant Professor of Accounting at the University of Nottingham Malaysia Campus. She teaches accounting, taxation and auditing modules in the university. Her current research interest focuses on ESG and sustainability reporting, taxation and auditing practices. She holds a Bachelor in Accountancy (Honours) degree, Master of Science degree in Accounting and Doctor of Philosophy (Ph.D.) whereby her doctorate study specializes in the intellectual capital reporting and underpricing for IPO issues. She is a Fellow Member of the Association of Chartered Certified Accountants (FCCA), a Certified Public Accountant of the Malaysian Institute of Certified Public Accountants (MICPA), a Chartered Accountant of the Malaysian Institute of Accountants (MIA). In addition, she is also a Fellow Member of the Higher Education Academy (UK). Her past working experiences, prior to joining the University of Nottingham Malaysia Campus, include: •7 years of industrial exposures encompassed the auditing, accounting and taxation experiences • more than 10 years of teaching experience with institutions of higher learning. Dr. Too currently teaches the undergraduate and postgraduate students at the University of Nottingham Malaysia Campus. She has experience in teaching: Undergraduate modules: Malaysian Taxation 1, Malaysian Taxation 2, Accounting Information Systems, Audit and Assurance Services 1 & Audit and Assurance Services 2. Postgraduate modules: Tax Compliance (ICAEW), Business Planning-Taxation (ICAEW), Case Study (ICAEW) The modules and courses she taught in the past, prior to joining the University of Nottingham Malaysia Campus, include: Undergraduate • Financial Accounting • Malaysian Taxation •Advanced Malaysian Taxation •Principles of Corporate Finance Professional examinations (ACCA) ACCA Taxation, ACCA Advanced Taxation, ACCA Audit & Assurance, ACCA Advanced Audit & Assurance She has also supervised students undertaking master research projects. Dr. Too's research interest focuses on corporate reporting (such as corporate social responsibility, intellectual capital, sustainability, integrated reporting etc.), taxation, corporate governance,… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}