{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-22Jan2021.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP by 19 January 2021 at http://bit.ly/nubs-masterclass-22Jan2021 Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. The idea of capital budgeting is often reliant on the concept of the cost of capital, or in other words, the supply and price of finance. This lecture discusses the capital markets through the elemental lens of macroeconomics and its role in influencing financing decisions and capital markets. To this end, the connections between investments and savings will be discussed. This framework of thinking about finance is useful as it introduces an approach which cuts across asset class boundaries, for example, the segregation of equity and debt capital markets. This broad overview will also explain the role in which FX and commodities are interlinked with the price of finance, even if they may not be conventionally thought of as a source of funding. An applied perspective will be explained in this lecture, discussing practical issues which affect the cost of capital and the discount factor essential to capital budgeting and investment decisions. For example, the supply and price of finance can be influence by both traditional factors such as monetary transmission as well as socio-cultural factors. Dr Ray Choy is the Regional Head of Treasury and Markets Research at an investment bank and heads a team of Fixed Income, Currencies and Commodities (FICC) research professionals across South East Asia. Ray’s experience in the financial markets spans two decades and includes G3 and Asian fixedincome and currency strategy, global bond funds management, regional equities investments, commodities research and credit ratings. Ray has set up both sell-side and buy-side research teams at investment banks and asset management companies. Apart from management duties, he remains actively involved with the formulation of FICC investment strategy. Throughout his career, Ray’s research has been ranked in various regional polls, publications and Bloomberg. His team has also received an award for contributing to fixed income research and development of the Malaysian bond market. In addition, he is a regularly invited conference speaker, corporate trainer and commentator through various media channels, and is a columnist for The Edge Weekly. Ray has published in peer-reviewed journals and authored a book titled Essays in Bond Market Economics. Ray graduated with Bachelors and Masters degrees with distinction, 1st class honours and Merit from Heriot-Watt University, University of London (LSE and SOAS) and completed his PhD focusing on sovereign credit ratings with the University of Nottingham. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}