{
    "url": "https://www.nottingham.edu.my/Business/About/sustainable-business.aspx",
    "content": [
        {
            "p": "Nottingham University Business School has a long history of teaching and research leadership on sustainability in business. The School is committed to educating future business leaders and entrepreneurial aspirants to develop ethical, inclusive and sustainable perspectives on business practices and growth, bringing a distinctive global awareness and perspective to issues of social responsibility and sustainability. Our research and teaching focuses on thought leadership in sustainable and responsible business practices, championing ethics and responsibility as underpinning principles. These are incorporated and reflected in our undergraduate programmes in finance, accounting and management, business economics, management, international business management, marketing, and business analytics, as well as postgraduate programmes including our MBA; together with opportunities to explore these in local national and global contexts as well as to develop the skills to work towards a more sustainable future in business and society. NUBS brings a distinctive global awareness and perspective to issues of social responsibility and sustainability. The School was among the first UK business schools to champion the United Nations Principles of Responsible Management Education (UN PRME), and continues to be in its fourth cycle as a UN-PRME Champion School. NUBS Malaysia is currently the only business school in Southeast Asia/ASEAN to have UN-PRME Champion status. The School's biennial tri-campus PRME reports document our Sustainable Development Goals (SDG) footprint. NUBS PRME Report 2021 NUBS PRME Report 2019 Social Environment Research Group (SERG) Committee The Nottingham MBA is ranked 5th globally and 3rd in the UK for sustainable management education and faculty research, in the 2020 Corporate Knights Better World Top 40 MBA ranking. Corporate Knights, based in Toronto, is the world’s largest circulation magazine that focuses on sustainable business. Its Better World MBA Ranking has an 18-year history of evaluating the extent to which MBA programmes integrate sustainability knowledge and skills into business education. Find out more. Research and Knowledge Exchange (RKE) on Sustainability in Business NUBS Malaysia academic staff conduct research on sustainability in business addressed from a variety of angles, including sustainability in business, good governance, business models and innovation, collaboration between corporate and civil society organisations, new forms of organisations (structures and cultures) for collaboration, sustainable marketing and consumption, and responsible organisations; essentially various ways in which businesses contribute to the United Nations Sustainable Development Goals (UNSDGs). We adopt the definition of sustainability in business organisations as managing the triple bottom line (social, environmental and economic), a process by which companies have to simultaneously manage their environmental, social, and governance (ESG) obligations. Sustainability-oriented business practices are termed as Responsible Business Practices by the Organisation for Economic Co-operation and Development (OECD). Many members of the academic staff in NUBS Malaysia are members of research centres in the University of Nottingham that are affiliated with the School, including the International Centre for Corporate Social Responsibility (ICCSR), founded in 2002, one of the most influential centres of its kind, producing world-class research in the field of Business and Society. NUBS Malaysia and UN Global Compact Malaysia and Brunei (UNGCMYB) signed a Memorandum of Understanding (MoU) on 6 May 2021 to promote sustainability and the United Nations' Sustainable Development Goals (SDG) in business and society, through joint activities related to reseach, executive education and training, hosting of seminars and conferences, and business leaders' sessions in various topics on sustainability. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": [
        "pdf_files/NUBS-PRME-Report-2021.pdf",
        "pdf_files/NUBS-PRME-Report-2021.pdf",
        "pdf_files/NUBS-PRME-Report-2019.pdf",
        "pdf_files/NUBS-PRME-Report-2019.pdf"
    ]
}