{
    "url": "https://www.nottingham.edu.my/Business/Eventsrecords/Masterclass-12Oct2021.aspx",
    "content": [
        {
            "p": "Time: 7.00pm - 8.30pm This event is open to alumni and invited guests, and is complimentary. Please RSVP before 11 October 2021 at https://bit.do/nubs-masterclass-12-Oct Should you have any queries, please contact Ms. Leong Choy Wan at NUBS.EDP@nottingham.edu.my. This masterclass presents a conceptual and practical perspective to managing business sustainability. Ecosystems sustain societies that create economies: this is where businesses play a catalyst role. Business firms invest and create value in the economies, societies, and ecosystems, but also induce uncertainties in them. Such uncertainties created, in circulatory, cascaded back to the firms via the value creation process. A proactive approach is, therefore, for firms to manage these uncertainties at source. Hence, the concept of business sustainability management emerges, that is managing the sustainability matters – risks and opportunities – in the economies, societies, and ecosystems which are relevant to the businesses. In this respect, the stock exchanges around the globe use sustainability reporting requirement to nurture business sustainability management among their listed firms. To have an up-to-expected content and performance for such reporting, listed firms would have to manage their business sustainability –consistent with the adage: what gets measured, gets managed. This reporting requirement is developmental and supportive, which progressively leads firms to manage their business sustainability. With the introduction of Sustainable Development Goals by the United Nations in 2015, firms are also expected to contribute to sustainable development while they manage their business sustainability. Dr Lau has more than 25 years of practical experience in financial accounting and corporate reporting, corporate finance, banking management, financial management, investments, academic administration, lecturing, corporate training and consultation work. He conducts training, lectures, and seminars for in-house corporate clients as well as public courses in IFRS/MFRS/MPERS/MPSAS, sustainability reporting, financial shenanigans etc. His research papers have been published in journals and presented in national and international conferences. He served as a member of the Issues Committee of the Malaysian Accounting Standards Board from 2008 to 2013. He is currently serving as a member of the ACCA Malaysia Advisory Committee. Organised by NUBS Malaysia Executive Education, the NUBS Malaysia Masterclass Series provides a platform to connect the university community, alumni and industry partners in engaging sessions with thought leaders on contemporary business ideas and challenges. Find out more about other Masterclasses in the Series. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}