{
    "url": "https://www.nottingham.edu.my/Business/People/aun.rizvi",
    "content": [
        {
            "p": "Associate Professor of Finance & Director of Research - NUBS, Faculty of Social Sciences Syed Aun R. Rizvi is currently serving as Director of Research at Nottingham University Business School, University of Nottingham Malaysia. He has been at Lahore University of Management Sciences (LUMS) and is also an Associate Member at Centre for Financial Econometrics @ Deakin University (Australia) in addition to being an executive board member of Asia-Pacific Applied Economics Association (APAEA). In his academic career, Aun has been engaged with University of Nottingham Malaysia, Universitat Jaume I (Spain), Universitas Airlangga (Indonesia), Fiji National University (Fiji) and University Kuala Lumpur (Malaysia). He served at Suleman Dawood School of Business at Lahore University of Management Sciences (LUMS) as the Associate Dean (Academics) from August 2019 till January 2023, and as Director Undergraduate Programs from March 2017 till July 2019. Previously he had served University of Nottingham as an Assistant Professor for two years contributing towards establishing the Centre for Islamic Business and Finance Research (CIBFR) at University of Nottingham Malaysia Campus. Aun holds a Ph.D. in Islamic Finance from INCEIF (Malaysia). Aun started his professional career as a Research Analyst with HBL Asset Management Ltd. in 2007, where he was involved in startup of the HBL Asset Management's mutual funds. Later he moved to the trading desk, and served as Trader Equity for two years before moving to academia. Aun's engagement with industry is an ongoing process, and currently he is actively engaged in supporting Fintech startups in Pakistan. He is serving as an Advisor to Muavin, a digital micro-lending platform serving the financial inclusion and empowerment of the unbanked in Pakistan. He is also an advisor for Kalpay, a Shariah aligned Buy Now Pay Later platform. His research interest focuses on financial markets, Islamic finance, and Econophysics. His research particularly focuses on equity markets in emerging and Islamic countries. He has published in leading mainstream journals in the area of finance and economics like, Pacific-Basin Finance Journal, Emerging Markets Review, Economic Modelling, World Economy and Physica A amongst others. His research is widely cited with citations metrics in excess of three thousand. Aun is also a Subject Editor for Emerging Markets Finance and Trade, Editorial Board member of MethodsX, Journal of Islamic Monetary Economics and Finance, Journal of Islamic Economics and Business Studies and Jurnal Ekonomi dan Bisnis Airlangga. He is also currently serving as the series editor of CIBFR Palgrave Studies in Islamic Finance. He has been active in capacity building of academics and regularly conducts research capacity building workshops for multiple universities across Asia and Europe. His research areas are spread over both Economics and finance with core focus on following issues: telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": [
        "pdf_files/v11_n1_article10.pdf"
    ]
}