{
    "url": "http://www.nottingham.edu.my/Business/index.aspx",
    "content": [
        {
            "p": "Nottingham University Business School (NUBS) is proud to be among an elite group of business schools worldwide to gain 'triple crown' accreditation from the three most influential accrediting organisations - AACSB, AMBA, and EQUIS. The School has unrivalled global reach through tri-campus locations in the UK, China and Malaysia, offering unique perspectives and connections to changing business ideas. NUBS Malaysia has had over 20 years of experience in teaching and scholarship in various areas of business, management and finance, providing students with insights into Asian business growth and development whilst reading towards a British degree. NUBS brings a distinctive global awareness and perspective to issues of social responsibility and sustainability. The School was among the first UK business schools to champion the United Nations Principles of Responsible Management Education (UN PRME), and continues to be in its fourth cycle as a UN PRME Champion School. At Nottingham University Business School, our unique tri-campus offering provides students with a truly immersive global education that transforms aspiring business leaders into visionaries and change-makers of the future. We are proud to be among an elite group of 'triple crown' accredited business schools globally. Take a journey through our rich history, remarkable achievements, and the exciting future ahead for NUBS. Join us in Celebrating NUBS 25th Anniversary! Find out more about the School's Rankings and Reputation The length of time it takes to complete a business degree depends on the programme and level of study. An undergraduate degree takes three to four years, a master’s degree one to two years and a PhD can take three to five years. Studying full-time or part-time also affects the duration. Admission requirements vary depending on the university and programmes. Nottingham University Business School undergraduate programmes require candidates to have a minimum of BBB in their A Levels or STPM. There is a wide range of business programmes in this country. For instance, the Nottingham University Business School offers undergraduate degrees, master’s degrees, and PhD programmes in fields such as economics, finance, marketing and business management. Yes, international students are welcome to enrol in business schools in Malaysia. However, they may need to meet additional enrolment requirements and provide proof of English language proficiency. Individuals with a business degree have a wide range of career opportunities. This includes working in sectors such as finance, accounting, marketing, human resources, business administration and management. There are work opportunities in private and public sectors as well as nonprofit organisations. You can work full-time while studying if you’re Malaysian. If you’re an international student, you can work part-time for up to 20 hours per week during the term and full-time during the holidays. However, you may need a work permit and meet certain requirements. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}