{
    "url": "https://www.nottingham.edu.my/Business/People/Hsin-Vonn.Seow",
    "content": [
        {
            "p": "Professor of Analytics and Operations Research, Associate Dean of Research and Knowledge Exchange, Faculty of Arts and Social Sciences, Faculty of Social Sciences Professor Hsin-Vonn SEOW is Professor of Analytics and Operations Research and currently the Associate Dean of Research and Knowledge Exchange for the Faculty of Arts and Social Sciences at the University of Nottingham Malaysia . She received her doctorate from the University Of Southampton UK in 2006. Her Ph.D. study was sponsored by a scholarship which was in part funded by Fair Isaac Inc. and by the School of Management (now known as Southampton Business School) at the University of Southampton. Her thesis was in Acceptance Scoring, an area which was new in Credit Scoring, under the supervision of the late Emeritus Professor Lyn Thomas. Her current research interests include looking at applications of operations research in the many areas of management and multi-disciplinary research. Professor Seow is currently a member of the Operational Research Society UK. She is a reviewer for journals such as the Journal of the Operational Research Society, European Journal of Operational Research, Expert Systems, to name a few. She is also an alumni of the EURO Summer Institute (Optimization and Data Mining, Turkey 2004). Professor Seow was part of the international team of researchers (Germany, Belgium and the UK) that won the Best Paper (Theory and Methodology) in the European Journal of Operational Research (EJORS) in 2017. This prestigious award is presented by the Association of European Operational Research Societies. She continues her research efforts in AI techniques, data analytics, Operational Research and Credit Scoring. My research interests include looking at applications of Analytics and Operational Research techniques (with strong interest in credit scoring and credit control); Data Analytics, AI. I am currently lecturing the following modules: Applications of Operations Research techniques, with a strong interest in credit scoring and credit control; Data Analytics. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}