{
    "url": "https://www.nottingham.ac.uk/careers/students/international/uk-job.aspx",
    "content": [
        {
            "p": "Whether you're an EU or an international student, it's important to be aware that your right to work in the UK will depend on your visa. Getting involved and developing your skills through work experience, volunteering and extracurricular activities is a great way to stand out to potential employers and beat the odds. Read on for more information about securing a job in the UK after you graduate. My journey was driven by a clear vision and unwavering determination. To international students aiming to make a mark in the UK job market, my advice is to stay persistent and proactive. Para Saraiya, MSc Industrial Engineering and Operations Management graduate Read Para's blog Find out about graduate training schemes, direct entry roles and when to apply for graduate jobs. Employees are key to a business’s success, so various recruitment and selection techniques are used to enable them to feel confident they are choosing the right candidate. Employers begin the process by producing two key documents, the job description and the person specification, which are then combined together in the job advertisement. It’s important that you read these documents carefully to understand what the employer is looking for, and how they will be making their decision. This includes all of the tasks and responsibilities required in the role. This gives information about the person they want to recruit, including items such as their qualifications, experience, skills and knowledge. To make a competitive application you need to feel confident that you meet a large proportion of the criteria on the person specification. The process by which an employer will make their decision can vary widely, but typically follow the pattern of an application stage followed by an interview stage. During these activities, the employer will continue to assess you against their criteria, but they are also looking for something ‘extra’. They are looking for motivated individuals who show potential to grow and ‘fit’ in with the culture of the organisation. To succeed at this stage you will need to showcase your skills and knowledge, demonstrate your understanding of the company and its mission and values, as well as the wider industry in which the organisation operates, and also show your personality and enthusiasm for the role. We subscribe to eCareersGrad, which has a course specifically targeted at international students called Target the Right UK Employer, and you can access it free of charge. Did you know that 300 UK employers routinely sponsor the vast majority of international students for UK graduate schemes and job opportunities? The course provides: Register using your UoN email Alumni: email us to access We subscribe to Student Circus so you can access the site free of charge. On Student Circus you will find: You must use your UoN email address when registering. Register with Student Circus On our sources of graduate vacancies page, we list the top graduate vacancy websites across the UK and provide advice on how to use job boards and using a recruitment agency in the UK. The list includes MyCareer, our job board, that recruiters use to target Nottingham students and graduates. In recent years we have seen a rise in the number of external organisations advertising themselves as experts in careers and employability advice, particularly around supporting students from specific countries. They often charge thousands of pounds for their services and we have received feedback that students often feel pressurised to pay for these services in order to secure a job. Prior to entering into any agreement, we would advise you to contact us and check what support and resources are already available to you without charge. If we aren’t providing a resource which you think would be useful, let us know and we will endeavour to provide it or a suitable alternative. If after doing your research you think you are getting something different or better from an external provider, you are free to make the decision to use them. We are happy to discuss any support you are offered from an external provider to help you make an informed decision. Understanding your options can help you to have conversations with employers about their options to hire you on the student visa, graduate route visa, scale-up work visa or skilled worker visa. To help you to do this the university offer briefings from immigration experts during the academic year. You can find out more about these sessions from the Visa and Immigration team. UK Council for International Student Affairs (UKCISA) which is the UK Council for International Student Affairs is also a good source of information to help you understand your options. Dafinah Azman, UoN alumna Assistant Psychologist, Birmingham and Solihull Mental Health NHS Trust I am currently on a graduate visa (introduced in summer 2021). This visa allows you to stay in the UK for up to two years and makes you eligible to work without the need for sponsorship. You have to apply for the graduate visa while you are on your Tier 4 Student Visa, and I would recommend doing this closer to when your Student visa is expiring. I would leave two months’ leeway just in case. Read case studies from UoN international graduates talking about their experiences seeking UK employment. The University of Nottingham's Ingenuity Lab, part of the The Haydn Green Institute for Innovation and Entrepreneurship (HGI), helps undergraduates and postgraduates learn about enterprise and build their entrepreneurial skills. If you have an interest in business, whether it’s a commercial venture or a social enterprise, the Ingenuity Lab there to support you to create products and services that are not only fit for purpose, but also offer a different perspective and approach. Visit our page on self employment for more information about the support available to you during your time at university and after you graduate telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}