{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/medical-education/index.aspx",
    "content": [
        {
            "p": "Medical education is part of the wider field of healthcare professions education, in which the science of learning and the science of instruction are specifically applied in the context of the healthcare professions. Medical education draws on the fields of education, psychology and sociology (among others) and covers a range of areas such as: teaching and learning, assessment, curriculum design, and research. Teaching and training is a huge and important part of healthcare. Medical educators can be teachers, assessors or programme leads in Universities or in clinical settings and they play a vital role in teaching and training the next generation of healthcare professionals. Return to A to Z jobs list Book a careers appointment You might be involved in: Many medical educators are doctors (though not all) and balance their clinical careers with medical education in some way. People from lots of different backgrounds are involved in healthcare professions education, for example: Equally, people from all experience levels can get involved in medical education, from student to senior healthcare professional. Read Leia Boote’s story about how her teaching interests developed during her undergraduate degree and how the experience helped her secure her current role as an anatomy teaching technician at the University. Leia Boote, Anatomy Teaching Technician at the University of Nottingham Ryan Jennings has been an acute medical specialist nurse in the Royal Navy for 14 years, he also oversees the recruitment of new specialist medical roles. Read his tips and advice for pursuing a career in this area. Ryan Jennings, Acute Medical Specialist Nurse, Royal Navy Veterinary surgeon, Professor Kate Cobb, developed her career within academia to get involved with teaching veterinary students. Read about her career path and advice for you. Professor Kate Cobb, Director of Education at the University of Nottingham Several universities offer postgraduate certificates, diplomas and masters in medical education. Some people go on to gain masters or PhDs in the subject and go on to develop leadership or research careers in medical education. You can also undertake shorter online open access courses for example, the Developing Expert Educators for Healthcare Professions offered by the University of Nottingham. For postgraduate doctors, some Foundation and Specialty Training Programmes may offer a medical education component alongside formal clinical training. A formal qualification, such as a postgraduate certificate or masters in medical education, is usually part of this training. Some doctors may also go on to focus their careers in academic medicine, combining clinical practice with research and teaching responsibilities. Courses in medical education may have varying titles depending on the institution, so it’s important to consider this as part of any further study search. When choosing a postgraduate qualification in medical education, you might also want to consider: You can usually start with a postgraduate certificate and decide from there if you want to continue to study for a diploma or masters. Most universities recognise credits gained in another institution should you need to move. You can view courses in medical education at: Postgrad.com FindAMasters.com UCAS It might be important for you to consider that a course has accreditation by Advance HE so that you will be eligible at the end of the course to apply for a Fellowship of the Higher Education Academy. For example, the University of Nottingham’s postgraduate certificate in medical education is accredited by the Higher Education Academy (HEA). You may also wish to consider whether a course has accreditation with the Academy of Medical Educators which exists to promote standards in the practice of medical education. It can help you to develop skills in teaching and learning, assessment, feedback, curriculum design and delivery to name but a few. It’s said there is something for everyone in medical education, so it can be a great opportunity to play to your passions and strengths. It can be a useful addition to your CV, especially if you go on to develop your interests and skills further. Many people involved in medical education may go on to pursue teaching fellow roles and progress their careers to leading and managing the delivery of medical education in universities and professional institutions. A formal qualification is increasingly required for promotion to education leadership roles within Universities and the healthcare professions. Academic medical careers - go to our medicine pages Association for the Study of Medical Education (ASME) On the ASME website you will also find: Health Careers - general information on medical education Medical Education Journal - published by Wiley Medical Teacher Journal - published by AMEE telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}