{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/mechanical.aspx",
    "content": [
        {
            "p": "Mechanical engineering as a subject is valued by employers in many sectors and the University of Nottingham graduates do especially well in securing employment in engineering and technical fields as well as professional roles in non-engineering sectors. 99% of graduates* leaving mechanical engineering courses in the 2016/17 academic year secured work or further study within six months of graduating. Continuing to a higher degree is a popular option and one which can add value in a competitive labour market. Our graduates are very successful in accessing taught and research opportunities, related to their engineering studies and interests. In addition to your subject knowledge, the degree equips you with key employability skills, which are relevant to all sectors, such as: Working towards becoming a chartered engineer can be a good way to demonstrate and accredit your professional competence as an engineer once you start in the workplace. The Institution of Mechanical Engineers (IMechE) requires a masters degree level of knowledge, which may be from a four-year accredited MEng degree, or a bachelor degree plus a masters qualification. Institution of Mechanical Engineers Graduates from Nottingham who have gone on to work as graduate mechanical engineers over the last few years have worked for a range of employers from large multi-national companies to small local employers. High quality graduate roles are available in companies of all sizes and types, so it’s important to think about which type of organisation and opportunity you feel you would be best suited to. Our mechanical engineering graduates secure professional positions across a diverse range of employment sectors, but the key sectors of employment for our graduates are: aviation; automotive; energy; construction; and rail. A sample of the employers who recruited our graduates: Some of the roles undertaken include: Not all engineering graduates become engineers. Many Faculty of Engineering graduates find alternative opportunities where they are able to use their transferable skills such as: Some students will progress into further study at postgraduate level in both engineering and non-engineering related areas. Postgraduate study can be a way to develop a further specialism in a particular area of interest, either through carrying out research or undertaking specialist taught modules. It can also be a way to gain skills and qualifications in areas outside engineering in order to progress into alternative careers. For students doing a BEng qualification, undertaking an accredited MSc will give you the level of qualification necessary to progress on to become a chartered engineer and to meet the entry requirements of some graduate engineering employers who ask for a masters level qualification. For students doing an MEng degree, undertaking an MSc won’t give you a higher level qualification, but it can be a way of specialising in a particular area. Explore your further study options - finding courses, funding and making applications Regardless of whether you are a first year or final year, developing skills outside your degree will enhance your CV and allow you to provide evidence of these in applications and at interviews. We have a wide range of opportunities at the university for you to explore: An industrial placement will enable you to gain industry experience, crucial for your career development. Industrial placements You can broaden your experience and develop your technical and professional skills, by taking part in short term work experience, internships and volunteering activities. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge We advertise part-time, casual and temporary jobs on campus and with local businesses. Created just for you, the advertised vacancies can fit around your studies and other commitments. The vacancies are advertised in two places. On-campus jobs Off-campus jobs Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union MechSoc We offer a range of events to develop your skills and meet employers throughout the year. Check out: Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. FluidJobs - automotive careers More graduate careers Prospects - what can I do with my mechanical engineering degree * UK full-time first degree graduates seeking employment and further study. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}