{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/mental-health/index.aspx",
    "content": [
        {
            "p": "For those interested in working in the field of mental health, there are a wide range of roles available to consider where your interest and skill set lie. We'll outline the settings you could work, the roles on offer, the skills required and how to get into the sector. To put this sector in context, the NHS website states that one in four adults and one in 10 children experience mental health problems. Mental health problems can also have a huge impact on physical health. It is estimated that 70 million working days are lost each year to mental illness resulting in a cost to the UK economy of £100 billion per year (Healthwatch). Return to the A to Z jobs list Book a careers appointment Read our blog: How I Applied to IAPT Training Mental health professionals are employed in a variety of settings. These include healthcare (hospital and community NHS services), social care, education and the charitable or not-for-profit sector. There are also some opportunities within the private sector. For example, a counsellor could set up their own private practice, or a large corporate organisation could employ a mental health specialist for their employees. Other settings could include housing associations and criminal justice. Support could be talking therapy, peer support, advocacy, arts or creative therapies, advice services, online services, traditional, complementary or alternative medicine. There are also crisis teams and services which help individuals in acute need. Thinking about the client group which you would like to help and which setting you would like to work in should help you in your career planning. It is worth remembering that most roles within the mental health sector will involve working in the public or charitable sector. This means that salary and working conditions are heavily influenced by government policy on funding for the NHS, charities and local government. Healthcare settings can include primary, secondary or tertiary treatment. Local authorities often offer practical help and support that might be needed because of mental illness. This type of setting might include residential care, telephone helplines and mental health social worker provision – in short, any local support around mental health. Mental health professionals may work in schools, colleges and universities, supporting young people in their education environments. There are a large number of national and local charities in the mental health sector such as Samaritans, Rethink, Mind and SANE. These offer services to individuals such as counselling, advice and guidance, advocacy as well as research and policy support. Read Jessica Fath's blog about working for Rethink Mental Illness in a prison There are many types of mental health problems and disorders. These include: Mind - for more information on health problems and disorders The Psychological Professional Network's career map for psychological professions provides a useful overview of many of the opportunities in the mental health sector. It is worth noting that opportunities within the mental health area are increasing with new roles emerging all the time. New opportunities to investigate could include: Setting: Mostly NHS, some private practice or charities Offer therapy?: Yes, wide range of therapies can be offered Entry routes: BPS accredited psychology degree plus work experience plus three-year doctoral training Salary: NHS Band 7 on qualification with progression to Band 8. Doctoral training is Band 6 Graduate scheme?: No Experience: Most applicants to the doctorate have a two to three-year career in mental health before successfully applying The British Psychological Society (BPS) - more information on clinical psychologist Setting: Various Offer therapy?: Yes Entry routes BPS accredited psychology degree plus work experience plus three-year doctoral training Salary: Doctoral training is not funded. When qualified the salary is a similar banding to clinical psychologists Experience: Would need some experience of counselling to gain a place on doctorate courses The British Psychological Society (BPS) - more information on counselling psychologist Setting: Mostly NHS Offer therapy?: Yes under supervision of a chartered clinical psychologist Entry routes: Can apply with a BPS accredited degree to a relevant masters level course. Applicants should be currently in a role relevant to mental health. This is a new role and so information may change. Salary: NHS Band 6 Experience: Will need to be currently employed in a relevant role in the NHS and nominated for a masters level study as part of a level 6 apprenticeship scheme Skills for Healthcare - Clinical Associate Psychologist Setting: Mostly NHS and some charity work settings Entry routes: Can apply with a BPS accredited degree although recruitment is highly competitive and most successful applicants will have work experience in mental health Salary: NHS Band 5 Experience: Can apply with a BSc or MSc level qualification. Most successful applicants will have substantial experience in mental health HealthCareers - Assistant Psychologist Setting: IAPT (Improving Access to Psychological Therapy is part of the NHS Offer therapy?: Provide support for low intensity mental health issues through group work, telephone appointments or signposting Entry routes?: Trainee Psychological Wellbeing Practitioner roles (PWP) involves study 1-2 days per week and work Salary?: Trainee PWP is Band 4 and PWP is Band 5 Graduate scheme?: Graduates have successfully applied to trainee PWP roles Experience: Applicants would normally need some relevant experience for trainee roles but this could be voluntary Read Kat Wheatley's, UoN alumna, blog post on applying for IAPT training Prospects - more information on psychological wellbeing practitioner Offer therapy?: Yes, CBT Entry routes: Progression from PWP as well as some other disciplines Salary: Trainee CBT therapist is Band 6 and CBT therapists is Band 6/7 Graduate scheme?: No, although graduates have successfully applied to trainee PWP roles Experience: Graduates would normally need substantial work experience or a career history within a mental health or similar setting. Could be career progression from PWP Prospects - more information on cognitive behavioural therapist Setting: Various - work structure may involve self employment or flexible/portfolio career options Offer therapy?: Yes, talking person-centred therapies Entry routes: BACP (British Association of Counselling and Psychotherapy) accredited course Salary: Training course and supervised sessions will be unpaid. Salary varies depending on sector Graduate scheme? No Experience: Voluntary counselling experience would be useful, for example, Childline or Samaritans Go to our webpage on counselling and psychotherapy Prospects - more information on counselling Setting: Various, may be a good opportunity to get NHS experience Offer therapy? No, more practical support although there may be opportunity to get involved in group sessions, for example Entry routes: Direct entry role. Applicants often need experience but could be from volunteering or temporary work Salary: NHS Band 3 Graduate scheme?: No, not a graduate level role Experience: Applicants often need some experience but could be from volunteering or temporary work Setting: Normally NHS with some community roles Offer therapy?: Could do as a part of their role Entry routes: Mental Health Nursing BSc is three years or two-year course after a first degree for which there is Accreditation of Prior Experiential Learning (APEL). You could also take a two-year postgraduate course Graduate Entry to Nursing (Mental Health) Salary?:Training is unpaid although there is a bursary of £5,000 to £8,000. NHS Band 5 when newly qualified. Can progress to level 6/7 and for very senior roles to level 8. Graduate scheme?: Direct entry after gaining nursing qualification Experience: May need healthcare experience and NHS understanding to gain access to a course Prospects - more information on mental health nursing Setting: Mainly social care, some charity and NHS settings Offer therapy?: Not really. Assessment and review for vulnerable children and adults Entry routes: Undergraduate and masters (two-year) courses or direct entry schemes such as Step Up to Social Work, Think Ahead and Frontline Salary: Training is unpaid. However, Think Ahead and Frontline: Training salary Year 1 is £17,00 to £ 20,000, Year 2: £21,000 to £34,000. Qualified social worker £22,000 to £44,000 Graduate scheme? Think Ahead (Mental Health) and Frontline (Children and Families) Experience: May need social care experience and understanding to gain access to course Prospects - more information on mental health social worker Think Ahead - find out more Frontline - find out more Step up to Social Work - find out more Setting: NHS and other settings including private practice Offer therapy? Yes, and can prescribe medication Entry routes: General medical training or Graduate Entry into Medicine plus up to six years psychiatry training Salary: Initial medical degree is unpaid. Junior doctors start at £26,000. Consultants earn up to £130,000 Graduate scheme?: Medicine degree qualifies you for junior doctor roles. The initial training is general Experience: Would need knowledge and understanding of healthcare to gain entry into medical training Prospects - more information on psychiatrist Go to our webpage on Graduate Entry into Medicine Setting: NHS, social care and some private practice work Offer therapy? Assessment and practical support around rehabilitation. OTs work in many fields not just in mental health and training will be general Entry routes: Three-year degree or two-year masters qualification if you have a related degree, for example psychology, sociology or biology Salary: £5000 per year bursary while you train. Newly qualified NHS band 5. Can progress to Band 7 and possibly 8 Graduate scheme?: Direct entry after gaining your OT qualification Experience: Would need knowledge and experience of healthcare or social care or OT work to access training Prospects - for more information on occupational therapist Setting: Education, but 12 months initial training is NHS-based Offer therapy?: Low intensity interventions such as guided self-help based on CBT. One-to-one support for young people Entry routes: Trainee Education Mental Health Practitioner (12-month trainee position) Salary: Trainee roles are at NHS Band 4 with Qualified roles at Band 5 Graduate scheme?: No, but training year offers direct entry Experience: Experience with helping children and young people to overcome psychological or social problems is required. This could come from voluntary or paid opportunities NHS - information on education mental health practitioner Health Careers - NHS Pay Bands Health Careers - psychological professions Prospects - job profiles For many of these roles the entry point is a trainee role (for example, trainee PWP) and will include undertaking postgraduate qualifications as part of the training. Trainee roles are typically funded by Health Education England (HEE) who also fund the Doctorate in Clinical Psychology training. Planned policy changes from April 2022 mean that you will only be able to access further HEE training two years after your initial training exam boards. It is worth considering that very similar roles are called different things depending on the employer or setting. For example, a simple ‘mental health’ search on Indeed reveals job titles such as: It may be a good idea to think in detail about the setting you are interested in, the client group you would like to support and to then investigate the roles available to you. Think about where the client group you would like to support go for help, therapy or advice and start your research here. Such a huge and diverse sector also needs people to support it and so there are also support roles available such as HR, marketing, finance and data management. Your role within the mental health sector may not be frontline or operational. There are also roles and opportunities within policy making and project management. Read about Amy's career journey and her advice to you Mental health workers are likely to have excellent communication skills and to be able to demonstrate empathy for their patients or clients. They should be able to build positive relationships with individuals who are struggling with mental health. Other skills that could be important are report writing, research skills, psychological understanding, IT skills and problem-solving. The NHS has six values that they expect all staff to have as follows. If you are interested in working in a support role, there may be additional skill sets to think about for example, data management, numerical skills or organisational skills. There are a few graduate roles within the mental health sector. Graduates can often gain experience though volunteering and entry level roles and then use this experience to progress in the sector. There are direct entry roles for medical and nursing professionals, occupational therapists and social workers after completion of degree or masters level training. Much of the information on this page is UK-focused. If you are an international student, you may be thinking about returning to your home country, so it will be necessary to research mental health provision in alternative locations as provision and career pathways could be very different. Gaining a professional qualification in one country may not mean that you can work elsewhere without additional registration. The mental healthcare sector is complex, the roles available are diverse and vary between settings. There is no one website which covers the sector in its entirety. It is useful to use NHS and local government job pages but www.indeed.co.uk is also a great way to explore opportunities. The vast majority of roles within the sector will be working for the public or third or not-for-profit sectors. Many of these organisations will ask you to complete an online application rather than sending a CV and the applications will often ask you to include a personal statement explaining how you meet the essential and desirable criteria for the role. It is good practice when writing this statement to address all of the criteria, providing solid examples for each in the same format as the person specification. Talk to adviser about your plans and making applications telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}