{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/law-enforcement-and-security/armed-forces.aspx",
    "content": [
        {
            "p": "The UK Armed Forces employs over 150,000 people (2021) across the British Army, Royal Navy and Royal Air Force. Offering a huge range of careers, with clear progression routes and fantastic support for training and development they are a strong option for graduates. In 2020 they were featured in the Times Top 50 Employers for Women reflecting the work they’ve done to improve equality, however women and other minority groups are still underrepresented. The British Army, Royal Navy and Royal Air Force take part in combat, peacekeeping and humanitarian missions around the world to defend the country and promote its interests. From soldiers and nurses to medics, chefs and intelligence analysts, there are countless opportunities available, depending on your skills, interests and qualifications. You can expect job rotation and therefore relocation on a fairly regular basis, which may include working overseas. This is an important lifestyle consideration for this sector. Career opportunities are endless, with a lot of support offered to further your skills and a clear promotion structure Each area of the armed forces has its own service categories: The British Army offers over 100 different roles in seven categories: combat; engineering; HR, finance and support; intelligence; logistics and support; medical; music. Find out more about the entry routes available. There are three ranking structures in the Royal Air Force: commissioned officers (the equivalent of managers), airmen and airwomen, and non-commissioned aircrew. Jobs are then split into the following categories: aircrew; air operations; engineering; force protection; hospitality; intelligence; logistics; medical; personnel. There are more than 100 different roles available in the Royal Navy, split into five services: Fleet Air Arm; Royal Fleet Auxiliary; Royal Marines; Submarine Service; Surface Fleet. All three armed forces recruit graduates from any subject as officers, leadership qualities and the suitability for service life are seen as more important than the degree subject you studied. However for operational or combat roles such as flying, weapons and artillery, graduates in science or engineering are encouraged. Take opportunities to build and evidence skills like leadership, team work, organisational skills, initiative and working under pressure, as these are highly valued by the armed forces. Each armed service has its own recruitment website with more information: British Army – You will need to make an initial application online followed by an interview with a local recruitment officer. You’ll then be asked to attend an ‘Army Officer Selection Board’ (AOSB) assessment which includes a 24-hour briefing with physical and practical exercises, followed by a three-and-a-half-day ‘Main Board’ where you'll put your skills into practice. You’ll then start your training. Royal Air Force - There are seven steps in the application process: an RAF aptitude test, selection interviews, health assessment, fitness test, pre-recruit training course, acceptance and then if you are successful you will start your training. Royal Navy - There are several stages you'll need to get through: Naval Service Recruiting Test (NSRT) and informal interview, medical and eye tests, fitness tests, interview, Admiralty Interview Board, and security and reference check, before starting your training. You can gain practice of different types of recruitment processes through our events advertised on MyCareer or by accessing Graduates First and ECareersGrad. Understanding the current issues and challenges facing the Armed Forces is important if this is a career you want to pursue, so: Prospects – Find out specifics about particular armed forces job roles through the job profiles section which includes: logistical support officer; technical officer; operational officer; training and education officer etc. Ministry of Defence and Working for MOD websites offer more information. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}