{
    "url": "https://www.nottingham.ac.uk/careers/employers/sme/employer-case-study.aspx",
    "content": [
        {
            "p": "Protolan works in partnership with food and drink producers to deliver manufacturing excellence, providing innovative solutions to the food industry. With a commitment to providing new solutions, effective results and technical expertise. We constantly seek innovative ways to deliver our services, developing methods to help businesses to reduce costs, manage risks and open up new opportunities to grow their business. For the past 10 years, we have actively participated in the Nottingham Internship Scheme, recognising the value of recruiting interns to support various projects and initiatives within the company. After successful participation in the spring and summer schemes, we also offer year in industry placement opportunities. We recruit interns as part of our commitment to nurturing talent and fostering innovation within the organisation. By engaging with the Nottingham Internship Scheme, we gain access to a pool of enthusiastic and motivated individuals who bring fresh perspectives and ideas to the table. Interns at Protolan have made significant contributions across the business, including research and development, project management, and marketing. Their work has led to the successful implementation of new processes and the improvement of existing systems within the company. Interns bring a wealth of knowledge, energy, and creativity to our business. Their diverse skill sets, and fresh perspectives enable the company to stay ahead of industry trends and remain competitive in the market. As a result of the success experienced with the Nottingham Internship Scheme, we have explored other methods of recruitment, including offering placement years to students. This has allowed us to build long-term relationships with talented individuals and further strengthen our talent pipeline. We promote the wellbeing of our team, implementing various strategies to support their personal and professional development. This includes mentorship programs, training opportunities, and initiatives to promote health and wellbeing. With a supportive and inclusive work environment, we ensure the retention of talented individuals and the continued success of the organisation. telephone: +44 (0) 115 82 32233 fax: +44 (0) 115 951 3679 email: recruiterservices@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}