{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/medicine/foundation.aspx",
    "content": [
        {
            "p": "The Foundation Programme is a structured, supervised workplace-based training programme typically made up of six four-month placements in a range of medical, surgical and community specialties and settings over two years. It aims to give doctors in training competence in basic clinical skills and management of acutely ill patients as well as developing skills such as teamworking and communication. This is in effect your first paid job as a doctor and enables you to put into practice what you’ve learned at medical school while gaining additional skills, knowledge and experience. In order to practise unsupervised as a doctor in the UK, you will need to complete one year of Foundation Training. Upon successful completion of Foundation Year 1 doctors can apply to fully register with the General Medical Council. Completion of the full two-year programme is required to progress to Specialty training in the NHS. Foundation Programme Your career in medicine homepage We support medical students applying for the Specialised Foundation programme sharing tips from previous students and reviewing application forms Book a careers appointment Specialised Foundation Programme doctors have dedicated time set aside for academic activities. The vast majority of academic placements (over 80%) are in research but there are also opportunities in medical education or management and leadership. The programme follows the same curriculum and outcomes as the standard foundation programme. However, it also includes a period (equivalent to one of the six rotations) of academic research usually during the second year (F2). Most placements offer a four-month block (the last of the six rotations) for the specialist activity but some do offer more of a day release model over a longer period of study. About 8% of foundation training posts each year (around 550) are specialised foundation posts. So, if you are considering a career in research, fancy developing innovative cures for diseases, or want to share your knowledge with future trainees as an educator, a SFP will give you first-hand experience of this environment. It is still possible to have a career in academic medicine without having completed an SFP but the early insight gained from the programme may help you decide if this is the path you wish to pursue. You’ll need excellent clinical skills, a strong record of academic achievement and ideally some published research, teaching, or leadership experience. If you’ve been awarded any prizes or other awards at medical school, this will also add value to your application. It is not essential to have completed an intercalated degree during your medical training but students who have completed the Bachelor in Medical Science at the University have the opportunity to demonstrate some experience and understanding of, and passion for, research. It is possible to demonstrate your ability and enthusiasm in other ways. For example, if you have experience in a research environment either through a prior degree or work experience, or by undertaking a summer research project or voluntary clinical audit. Clinically you will need to achieve all the Foundation Programme outcomes in reduced time (as effectively 1/6th of your placements will be on your academic programme) so you need to be confident you have a strong clinical base and be committed to actively managing your learning from day one. Benefits of clinical audit UK Foundation Programme UK Foundation Programme - STP including Academic Compendium Foundation Priority Programmes (FPP) have been developed to support specific areas of the UK that have historically found it difficult to attract and retain trainees through the foundation and specialty recruitment processes. The main aim is to maximise the opportunity for applicants who wish to be located in less popular areas and therefore improve supply for specialty training and beyond. These programmes also offer a range of incentives, which vary depending on the foundation school offering them e.g. additional educational opportunities, digital innovation, international experience, financial incentives, leadership, medical education and enhanced exposure in certain specialties. NHS foundation programme website - FAQs on FPP This programme may suit you if you have an interest in a career in psychiatry as it aims to improve exposure to the speciality during foundation training. It offers doctors access to educational opportunities relevant to psychiatry, for example, funded attendance at relevant conferences, on-line learning and psychiatry journals and psychiatric supervision. The programme intends to provide sufficient exposure to the specialty to enable participants to be in a strong position to confirm psychiatry as their career of choice and to successfully apply to specialty training in this area. Fellows may also choose to be linked to college faculties to provide additional mentoring in a potential sub-specialty (for example, child and adolescent, perinatal and so on). For details of how to apply visit the Royal College of Psychiatrists website From time to time foundation schools offer a locally devised programme within foundation training. An example of this is the Longitudinal Integrated Foundation Training offered by Health Education England Yorkshire and Humber. In this programme instead of trainees receiving one four-month block of general practice training they experience two sessions per week (one day) in general practice throughout their two years of foundation training. This runs alongside four days each week in the traditional four-month hospital block placements, experiencing the six other usual placements across the two-year training programme. For further information visit the Yorkshire and Humber foundational training website If you wish to apply for the Foundation Programme (or Specialised Foundation Programme), you will usually do this in the autumn of your final year at medical school. If your application is successful, you will start the programme the following August. For full details of the annual application process visit the UK Foundation Programme website. For the standard foundation programme you must rank all schools (or Units of Application* as they are known) in order of preference. In recent years almost 95% of all applicants were allocated to one of their top five preferences and almost 80% to their first choice. Some of the factors you may take into account when comparing schools are: If you need to be in a geographical area due to your personal circumstances such as caring responsibilities, health reasons or ongoing educational support, you can apply to the UK Foundation Programme to be considered for pre-allocation to a specific foundation school on the grounds of special circumstances. You can also apply for pre-allocation if your meet the widening participation circumstances criteria, i.e. if you studied on the A108 Foundation Year course. *A Unit of Application comprises of one or more foundation schools that are grouped together for the purposes of processing applications. Once you have completed the application form and ranked each location in Oriel you will be given a computer-generated rank by the Oriel system. From 2024 your rank is no longer informed by your performance at medical school. The Oriel system will then use an algorithm that will work through the list of applications in computer-generated rank order. This preference informed allocation is designed to give as many applicants their first-choice preference as possible. Applicants will receive an email through Oriel in March with the details of their allocation. Following this applications will be invited to preference groups/individual programmes. This process is managed by individual Foundation Schools, but the same computer-generated rank will be used when allocation applicants at the group/programme match stage. For more details on the Preference Informed Allocation visit the UKFPO website and read the latest applicant guidance. Currently the application process for specialised training is run independently by each Foundation School. You will complete an extra section on your online foundation application and shortlisted candidates are invited to interview. Applicants can apply to up to two Units of Application (UoA). The extra section of the applications are up to six ‘White Space Questions’, the requirements will vary dependant on the UoAs you are applying to so do follow their guidance carefully. These questions focus on your career goals and your experience and achievements in the programme area of your choice (i.e. Research, leadership or medical education). Each Foundation School will use slightly different interview processes and scoring systems but all will be looking for candidates to demonstrate a strong academic ability, an understanding of, and passion for the programme and the potential to develop the competencies outlined in the Academic Compendium. For more information on the SFP application process see the latest key documents on the UKFPO webpage Health Careers - Foundation Training Scottish Medical Training Health Education and Improvement Wales Northern Ireland Medical & Dental Training Agency telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}