{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/beyond-few-weeks/development/appraisal.aspx",
    "content": [
        {
            "p": "An appraisal is typically a conversation between an employee and their line manager that focuses on job performance and professional development. Traditionally, this occurs annually as part of a cyclical goal setting and review process, but in recent years, more frequent meetings that encourage regular discussion and a continual flow of feedback are becoming increasingly popular. If you’re undertaking an internship or placement, you may have more regular check-in points to review progress, and these can be a good opportunity to discuss how what you’re learning in the workplace relates to your academic studies. It can be useful to understand how appraisals fit into your organisation’s culture, but asking a bunch of random colleagues can elicit a whole host of unhelpful and often contradictory reactions. You’ve got those that take a sharp intake of breath and adopt a fearful expression, those that roll their eyes and take a dramatic weary sigh, and then there are those that relish the opportunity to spell out their self-proclaimed brilliance! So, think carefully about who you turn to for the inside scoop. Go to a mentor figure, perhaps someone you know well who has provided reliable advice in the past and is respected within the team. Ask them to give you a sense of what to expect, and what you should really focus on. In some places metrics and measurement will be key to success, whereas in others thoughtful reflection is prized. There might well be forms to complete. These are usually designed to offer structure and aid reflection, as well as provide a record of the process, so try to see completing any paperwork as a helpful way of preparing for your appraisal rather than a burdensome activity. Take some time to look back and ask what went well, what could have gone better, and what have I learned? Taking time to reflect and setting a positive mindset early on will help you to engage with the process and get more out of it. Plus, if the system demands it, you might be required to submit any documentation in advance of your meeting and failing to follow instructions perhaps isn’t the best way to start a process that assesses your performance. You might assume that your achievements will speak for themselves. Sometimes this is true, but occasionally your triumph might get lost in amongst everything else that is going on and you may have to be more vocal about sharing success. This doesn’t involve bragging or being boastful. Instead, it means finding an appropriate time (such as during your appraisal) to explain why you’re proud of a particular accomplishment, what strengths you used to bring about the winning outcome, how it’s benefitted the organisation, and what you plan to do next to build on this success. Ask your manager for honest feedback. With any luck plentiful praise will be forthcoming but be prepared to take the rough with the smooth. Home truths are difficult to hear, but they’re also difficult to deliver, so try to receive criticism with good grace and avoid making the situation awkward by becoming defensive or overly emotional. Focus on learning from feedback and take the opportunity to ask for advice. This will demonstrate a growth mindset and may provide an opening to discuss potential training or development opportunities. The best way to show progress is to build on your achievements and ensure that the failures of one month are the achievements of the next. If you are not sure how you can add value, always ask your manager. Siddharth Shyamsundar, UoN alumnus, MSc Work and Organizational Psychology, 2016 Ask for feedback. This is the scary part, no one wants to risk getting criticism. But if you ask you'll get more respect and hear it direct rather than it tripping you up down the line. Plus, the sooner you get feedback the quicker you can adapt and improve and ultimately progress up the career and/or money ladder. Lisa Murkin, UoN alumna, Business Management, 2015 At some organisations, an appraisal might also offer an opportunity to discuss employee rewards, such as a bonus, or to negotiate a pay rise. If this is customary in your workplace its worth doing some research beforehand so you can go into the discussion prepared. As well as reviewing what has happened your appraisal should also be an opportunity to think forward. Go in with some ideas and try to suggest new objectives that align with your strengths, the things you perform well, and find energising. Be sure to agree timeframes, expected outcomes, and any support you might need. This will help you to be clear about your achievements when your next appraisal comes around. Mindtools - Five Rules of Goal Setting: How to set SMART Goals video Paramvir Dhanda, UoN alumna, MEng Chemical Engineering, 2017 telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}