{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/archives.aspx",
    "content": [
        {
            "p": "Return to jobs A to Z Over a period of time, many organisations accumulate books, letters, artefacts, papers, maps, prints, videos, tapes, plans which give a wealth of information about the past. These organisations can be as diverse as the BBC, the government (Houses of Parliament archives), universities, banks, major high street retailers (Boots HQ in Nottingham) and local authorities such as Nottinghamshire County Council. Archivists have been given a boost to their profile via programmes such as ‘Who do you think you are’ where individuals are hunting for information about their ancestors. These kinds of records would typically be found in local authority archives. There is also the national archives which keep information of national significance, and is connected to all the regional local government archives. The heritage sector has many other roles as well as archives with the most prominent being museums. According to the Archive and Records Association (ARA) the role of an archivist is to “preserve and exploit the archival heritage and the information contained within it. This includes assisting users and answering enquiries, promotional work including exhibitions, presentations or media work, digital preservation, as well as the curatorial skills of selecting, arranging and cataloguing archives. In addition, archivists at a more senior level will also carry out management tasks as they take control of budgets, staff and strategy.” The title archivist comes under the umbrella of a records professional, and records management is a related career area. Some of the materials used can be fragile and might need conserving or repairing. See the ARA’s section on specific careers in archive conservation if this specifically appeals to you. You will also be required to handle certain objects or paper with particular care and be trained in ways to do this. Many papers and/or objects need to be stored at a particular temperature so a lot of archive storage can be at a cooler room temperature than you might be used to. Within the profession, you could be a specialist in some of the tasks mentioned here. Check out the Prospects career profile on an archivists for more information As well as the obvious interest in history and the need to preserve information, you will need the following: To become a qualified archivist, you need to undertake a postgraduate course recognised by the Archives and Records Management Association (ARA). 6 universities offer this course and they can be found on the ARA’s website. There is a possibility to do this via distance learning with at least one institution. However, in order to be successful, one of the criteria is some relevant experience in archival work, whether paid or of a voluntary nature. An apprenticeship is a real job with training and can be a first step to a career in archives and records management. The Level 3 Libraries, Information and Archive Services (LIAS) Assistants apprenticeship offers a variety of career paths. A Level 7 (post grad) Archivist and Records Manager apprenticeship is currently under development. Please visit the Institute for Apprenticeships website for further details. Note both of these are only available in England. Experience is vital in order to access this popular profession and is a prerequisite of applying for postgraduate study. Some organisations provide a paid 1-year graduate internship, which tend to be advertised on the ARA website. You can also sign up to get email alerts when they come online. They tend to be advertised in the spring/summer prior to commencement in early autumn. However, these are very competitive so you will probably need to have already undertaken some work experience in an archival setting. This could be via a voluntary project during term time or vacations, or even after you have graduated, possibly around a part time job. Some archives, outside of the 1 year graduate internship, also offer ad hoc paid assistant jobs which you could also look at after graduation. National Archives website - You can search for archives in any area via this search tool Currently, the heritage sector has faced many challenges due to the impact of Covid 19. However, the ARA is still advertising entry-level positions on their website There are a number of ways to gain archival experience whilst here at university. Firstly there is an NAA module Experience Heritage where you get the opportunity to gain experience in a local archive over one semester. This runs in both the autumn and spring semesters. You don’t have to commit to the whole NAA award to take part in this module. You may also like to obtain your own volunteering in a local archive, as a number of local places offer ad hoc volunteering opportunities. During your vacations, you could also look into this if your home is elsewhere as some opportunities can be for as little as one week. You could also think about boosting some of the other skills require to be an archivist, as listed in the section ‘What skills do I need?’ via other routes. If you would like to talk about this in more detail, come and have a chat with us. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}