{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/first-weeks/working-digitally.aspx",
    "content": [
        {
            "p": "Work is increasingly digital. Whether you’re doing an internship or placement or have recently moved into a graduate job, digital practices are likely to be a big part of your day-to-day experience. This might involve using new technology, digital tools, or online platforms to complete tasks. It might mean working in a hybrid way; where you sometimes work in-person in a physical workplace, and at other times you work from home, or another ‘remote’ location. Or, it may require you to develop specific digital skills or adopt new professional approaches and behaviours to be successful in your role. Watch our video to gain an insight into how recent UoN alumni use tools and technology on an everyday basis at work. Whatever your job, you will need to develop digital skills, knowledge, and confidence. This could involve getting familiar with new communication and collaboration platforms, being able to find and evaluate digital information, using digital tools to organise your workload and manage projects, learning how to code, using software to access, analyse or present data, knowing how to create digital content, or learning to use specialist technologies. Start by spending some time thinking about what digital skills and knowledge are most relevant to your career. Then, evaluate what you already know and do well and identify any gaps or areas for development. Once you’ve done that, be proactive and seek out opportunities to learn new skills, prioritising those that you feel will be most relevant and important to your future success. Making a good first impression when you start a new job and then maintaining your professional reputation as you move forward is important. Doing this online can sometimes feel unfamiliar and knowing how best to navigate the digital workplace can take time. You might wonder how to approach virtual meetings, strike the right tone in professional emails, or connect with colleagues via social media. Try our quick quiz to help you consider some common scenarios and to explore how to manage your digital identity at work. Review your digital identity regularly. This might involve auditing your social media profiles, reflecting on how you interact with colleagues online, looking back at any digital documents or assets you’ve created or contributed to, and thinking about how you use technology. Consider whether you are presenting your best digital self, what's working well, and where there may be room for improvement. Watch our video for top tips from recent UoN alumni on how to maintain a professional digital identity at work. Working digitally can offer wellbeing enhancing opportunities, but it can also throw up some challenges. Here we consider a few common questions and identify some strategies that may help you to look after your health and happiness. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}