{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/clinical/farm-animal.aspx",
    "content": [
        {
            "p": "Do you enjoy being outdoors? Does travelling around the countryside to treat sick animals and provide advice on disease prevention and the welfare of animals appeal to you? If so, you might want to explore farm veterinary work in more detail below. Return to the Vets homepage Book a careers appointment Most farm animal vets work in clinical practice, looking after the needs of their client’s livestock. This can range from treatment of sick individual animals to giving advice on herd level approaches to prevent disease and improve welfare, the latter which is becoming a major role required in many farm businesses. Typical main responsibilities might include: Regular visits to farms to assess health and review progress with the farmer form a key part of the working day. Building a relationship with clients and understanding their business is an important part of farm work. Poultry and pig practice tend to be more specialist with the focus on the population level work and less individual animal cases. There are increasing opportunities in the wider livestock agriculture sector either from within a 'traditional' practice job, working in other businesses or in academia. Many farm vets will provide consultancy to large farms and agri-businesses as well as other businesses in the supply chain, for example many supermarkets use vets to inform policies and work with their suppliers. Increasing opportunities also exist to partake in research and teaching both in industry and in academic institutions, with growing interest particularly in farm sustainability and technology sectors. Deciding which farm animals you are most interested in is a good start. Generally farm vets specialise by species rather than discipline - a pig vet or sheep vet, rather than medicine or surgery. Work in clinical farm practice will generally involve travelling to farms and working outside in a variety of conditions so a willingness to travel and work independently and tolerate the weather is useful. With the increasing use of technology and data by farmers, farm vets will also spend time working at a computer analysing data and report writing, so being happy with this aspect of the work is important too. Clinical farm work is inevitably based near livestock dense areas and so while you will not necessarily need to live in a rural location some flexibility in terms of location will be important. There are lots of practical skills in farm animal practice that take time to develop, which is important to remember when setting goals for EMS (rectal palpation or surgical skills for example). Making the most of opportunities through EMS to practice techniques will be beneficial. EMS is also a great opportunity to try and appreciate the variety of work carried out by farm vets and the different types of clinical practice that are available. It can be hard to appreciate in short EMS placements, but trying to get an understanding of how the vet is involved with the farm as a business would be helpful. Ensuring that you spend time with relevant para-professionals can also be useful during earlier stages of the course (foot trimmer, embryo transfer as an example) to help understand how their services fit into the farm business and are relevant to the farm vet. Finally, particularly people with limited animal handling experience, ensuring that both animal husbandry and clinical EMS placements involve a lot of animal handling will be really useful. Timing EMS to ensure that it takes place during the ‘busier’ periods of the farming system you are visiting or farm practice, is really important to ensure that you get the most out of your placement. Examples of this include: More useful information on expectations, planning and health and safety are available on animal husbandry and clinical EMS moodle pages. No additional qualifications are needed for first opinion general practice, although many farm vets commonly work towards additional qualifications whilst in practice, such as a general production animal or cattle, sheep, poultry or camelid certificate in advanced veterinary practice. Both farm animal internships and residencies are available although not essential. Internships typically last 12 months and are offered mainly by veterinary schools, although some larger practices may offer an internship programme. Not all internships are the same, so it is worth clarifying exactly what is required of you and what support and training will be offered. Most are designed for veterinary surgeons who wish to specialise in future within the farm animal sector; a successfully completed internship can form part of the requirement for those wishing to embark upon a European or American College residency. It is important to note that after the first few years in practice, employers will tend to be more interested in what experience and competencies you have rather than whether you completed an internship or not. Some European or American Colleges may also accept several years of veterinary practice in place of an internship, to enable enrolment on a residency programme. There is currently not a well-developed referral model in farm animal practice in the UK. Standard European or American College residencies typically take a minimum of three years to complete and offer an in-depth education in variety of clinical and academic activities within your chosen sector. Currently, bovine, small ruminant, pig and poultry residencies are available via both the European and American Colleges. Completion of a residency enables significant personal development and opens doors to additional career opportunities such as teaching and research in academic institutions, veterinary consultancy and other positions outside of clinical practice. Find out more about internships and residencies In terms of the type of work that is carried out on a day-to-day basis there is unlikely to be much difference in caseload between larger and smaller farm practices. The proportion of larger or smaller corporate owned versus independently owned practices is currently variable depending on location, with an increasing number of smaller, independent ‘start-up’ businesses setting up in livestock dense areas. There is some argument that larger practices might have more structured support and training available as part of a large team of recent graduates, with the counter argument being that smaller practices might provide more personalised support. This will vary from practice to practice and group to group more than a specific model of practice. Routes of progression in corporate and independent owned practice models differ, with entry into business ownership and partnership more straight forward in independent businesses than in corporate owned models. However, senior leadership and clinical leadership roles are present in all practice types. Overall, many of these aspects are practice dependent and vary depending on the team. Asking questions surrounding type of caseload (for example, dairy vs beef, supermarket dairy contracts, pedigree vs commercial sheep flocks), how clients are allocated, team work and support (especially OOH), on call rotas and clinical/professional development such as regular case discussions etc are really important. This will vary from job to job. Practices tend to expect to provide support and training early on and the amount will depend in part on the practice and on your confidence and experience. Because most work is carried out on the farm you will often be expected to work independently quite quickly but support is often and should be provided over the phone if needed, with in-person back up available as required. It is important that on applying for a position that you are clear with what you are confident doing and what you will require support in and to establish the level of support that you can expect. Support programmes for new graduates have become more common place, within both corporate and independent owned veterinary groups. These tend to be centred around regular CPD days covering main topics (emergency medicine, cattle fertility and more) and are not related to practical support during the working day or out of hours. Generally, day to day introduction into practice for a new graduate might start with shadowing more experienced vets in the first weeks to ensure basic skills (such as clinical examination, IV access among others) are present and introduce to existing clients, before new graduates start completing straightforward visits (such as medicine checks) or simple sick animal cases alone to help build confidence. However, this varies hugely between practices and so should be established prior to starting- often speaking to current newer or recent graduates within the practice can be helpful to gauge this. The BCVA have a wealth of wellbeing resources that may also be useful. Career development depends on your own aspirations. Many vets develop clinical interests and do further qualifications. This often enables a degree of specialisation within a practice with vets leading specific areas or launching new initiatives within a practice. These can span from running a farmer discussion group or launching a new service to getting involved in international consultancy. In terms of non-clinical career development, this will depend again on aspirations and the business you work for. Salaries and position in the practice will tend to increase with experience. Opportunities to take on managerial or leadership responsibilities may be available as well as a move into other aspects of the livestock agricultural sector. Additional qualifications such as a Certificate in Advanced Veterinary Practice or European or American College Diploma can help open doors within consultancy or policy making roles in industry or research and teaching opportunities within academic institutions. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}