{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/law-enforcement-and-security/police.aspx",
    "content": [
        {
            "p": "Joining the police offers an exciting career helping to make communities safe. There are three main entry points for graduates. Whichever programme you choose to follow you will be one of 174,000 police officers working across the United Kingdom. Being a police officer does not suit everyone. However, there are numerous civilian roles in the police - take a look at the Nottinghamshire Police website. If you have questions about your plans, talk to a member of our team. Police officers help to keep law and order, investigate and prevent crime. They work with statutory and non-statutory organisations to achieve this aim. Having completed your training and gained experience there are numerous career routes that you could specialise in. Discover the routes you could take If you feel policing is a career for you, please take this quiz which will help you consider your motivations and understanding of what being a police officer involves. There are six main pathways: More information on the main pathways into policing To achieve promotion from constable to inspector, there are a series of examinations you must sit and pass. If you would like to read more about this, please see the National Police Promotion Framework. Several specialist police forces in the United Kingdom have separate recruitment paths: National Crime Agency (NCA) The NCA is a non-ministerial civil service department, operationally independent and accountable to Parliament through the Home Secretary. It is a law enforcement agency focused on disrupting and neutralizing serious and organized crime. Regional Organised Crime Unit (ROCU) The ROCUs were established to manage cross-border serious and organized crime (SOC), where traditional police forces were often hampered by offenders crossing territorial boundaries. The ROCU network works closely with the National Crime Agency, police forces, and other partners to identify, disrupt, and tackle the increasingly complex threat posed by organized crime. National Cyber Security Centre (NCSC) The NCSC, part of GCHQ, works to protect the public, businesses, and the government from cyber threats. GCHQ GCHQ is a world-leading intelligence, cyber, and security agency, tasked by the UK government to keep the UK and its citizens safe. MI5 MI5 works to protect the UK from a range of national security threats. Secret Intelligence Service (MI6) MI6 operates overseas to make the UK a safer and more prosperous place. Border Force Border Force is part of the Home Office, responsible for securing the UK border 24 hours a day, 365 days a year by enforcing immigration and customs regulations. During this webinar, you will hear from a variety of speakers from four police forces. You will learn about the different entry routes into the police, gain honest insights into the highs and lows, and also learn that there are roles to suit anyone from any discipline within the force. Speakers: Login to SharePoint to watch the webinar Gaining experience of working with the public for example volunteering with individuals or groups in the community that is through sports coaching or youth groups, is a skill highly valued by the police and you can do this in many different ways. Find out which forces are recruiting currently here: Who’s recruiting? and sign up for updates from your preferred police force. Other relevant job boards include: Before you apply there are some specific eligibility criteria to be aware of: • Aged 18+ • Be a British citizen, or a foreign national with indefinite leave to remain in the UK, without restrictions. Resident for at least the last three years. • Be in good health: medical, eyesight and fitness tests are compulsory. • Certain criminal convictions/debt problems can exclude you. All recruitment into the police is based around their Competency and Values Framework so becoming familiar with this and working on developing these things is really important. You can find out more from the College of Policing. The recruitment process usually involves some kind of online assessment and assessment centre, including a written assessment, situational judgement tests and competency based questions. You can gain practice of different types of recruitment processes through the events advertised on MyCareer or by accessing Graduates First and ECareersGrad. Understanding the current issues and challenges facing the police is important if this is a career you want to pursue, so: telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}