{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/interviews/resources.aspx",
    "content": [
        {
            "p": "Interviews are your chance to stand out, to show your potential employers the unique skills and qualities you can offer to the role. Effective preparation can be the key to unlocking opportunities and making a lasting impression. Below you will find a collection of resources that you can choose from to help improve your interview confidence and get you ready for that all important interview. Return to the main interview page Book an appointment with an adviser Attend an interview skills workshop Use is the STAR Technique to structure your answers. STAR stands for: Read Alexandra's use of the STAR technique and answering unexpected questions Shortlist.Me is an online platform offering a variety of practice interviews to enhance your interview skills. It will help you to: If you need help logging into MyCareer, please email our team. eCareersGrad have created resources that will help you develop your interview skills whether it's a in-person or online interview. Register using your UoN email Alumni: email us to access Graduates First provides access to a bank of generic practice video interviews. The system uses AI to monitor your facial expressions and provides feedback via an automatically generated report. This is a good place to start if you are preparing for future applications and would like to familiarise yourself with the video interviewing process. Students - register for free access using your UoN email address Alumni - email our team for free access If you are applying for a role in the healthcare sector, use the CAMP technique to structure your answer for motivational questions. If you are applying for a role in the healthcare sector and need to answer questions on ethics, professional dilemmas or difficult situations, use the SPIES technique. Alexandra Ukah, law student Read Alexandra's blog post telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}