{
    "url": "https://www.nottingham.ac.uk/careers/students/work-experience/vacancies.aspx",
    "content": [
        {
            "p": "You've decided that you need to gain some work experience but where do you find vacancies? We've put together a list of places you can start your search so you're not spending hours on Google! In some career areas, work experience can be difficult to find so talk to our advisers and they can help you identify the best places to look. Talk to a careers adviser The internships advertised on MyCareer are from recruiters targeting Nottingham students and graduates. We advertise around 1500 work experience and internship vacancies every year. The internships cover 30+ career areas so login now to explore what's on offer. Log in to MyCareer Subscribe to Jobs by email to receive the latest vacancies every fortnight based on your career preferences direct to your inbox. Subscribe to Jobs by email To find out about all the work experience programmes at the university, visit: What's on offer at Nottingham? Jobs boards are to recruitment what Ebay, Amazon and Etsy are to e-commerce. If you were an employer, would you rely on candidates visiting your careers webpage if you could reach thousands (if not millions) via a third party site? Most jobs boards allow employers to post vacancies for free, but sponsored adverts appear higher in search results. This means that candidates who are prepared to venture beyond the first couple of pages are likely to be rewarded with some hidden gems. Some jobs boards are extremely broad in scope, while others focus narrowly on individual sectors or types of role (for example, graduate schemes and internships). Before diving in, identify up to three jobs boards that fit your job search requirements by visiting their websites and reading user reviews online. Any more than this and your job search will quickly start to feel like a chore. As with all online searching, you get out what you put in. It takes time to find the right combination of search terms. If your initial searches return lots of vacancies: Take some of the stress out of job hunting by allowing vacancies to come to you. Creating a free account with one of the big national jobs boards (for example Indeed, Glassdoor and TARGETjobs) and downloading the app will enable you to view, save and apply for jobs wherever you are. You can also choose to receive daily or weekly alerts which suggest vacancies based on your search activity and application history. The sources below cover roles across a broad spectrum of career areas from advertising to telecommunications and are a great starting point. AllAboutCareers.com – allows you to explore career areas and search for jobs Conservation Careers - environmental jobs Bright Network - internships Employment 4 Students (E4S) – student jobs, internships and graduate roles Enternships – entrepreneurial opportunities Gradcracker – internships for science, maths, engineering and technology students graduate-jobs.com – find internships in a range of sectors across the UK Inspiring Interns – internships in London Prospects – search for work experience RateMyPlacement – includes student reviews Step – short-term placements of six to 12 months targetjobs – graduate jobs, schemes, internships and placements 10,000 Black Interns Programme - internships in investment management for the black community Ambitious about Autism - opportunities for students on the Autistic Spectrum Blind into Business - support for blind or visually impaired students and graduates Change100 - internships for students and graduates with disabilities or long-term mental health conditions Civil Service Diversity Internship Programme - spring and summer internships directed at BAME and economically disadvantaged students Creative Access - helping under-represented communities to enter and thrive in the creative industries Disability Connect - a reverse mentoring scheme providing businesses with a disabled mentor to increase their awareness of disability and disability issues in the workplace EmployAbility - opportunities for disabled and dyslexic students and graduates, and to ease the transition into employment Evenbreak - supporting disabled students and graduates Girls Talk London delivers award-winning programmes that support female students who wish to work in Technology Migrant Leaders - aimed at first and second generation young migrants from lower socioeconomic backgrounds due to the disadvantage migration causes Rare - a programme for students from disadvantaged backgrounds where you can gain access to free coaching, interview advice, news and events SEO - to support students from ethnic minority or low socioeconomic backgrounds secure internships and graduate roles with top employers Stonewall Proud Employers - vacancies with LGBTQ+ inclusive employers Sutton Trust Pathways (Law only) - an undergraduate programme for students from under-represented background that includes a residential, mentoring and work experience The Times Top 50 Employers for Gender Equality 2023 upReach - work experience opportunities to students from disadvantaged backgrounds Windsor Fellowship Programmes - internships and students from BAME backgrounds Not all vacancies are advertised, therefore you may need to approach companies to find out if they are able to offer any opportunities. You can do this by: sending a tailored letter and CV enquiring about a short-term work placement or a few days work shadowing telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}