{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/life-sciences-and-pharmaceuticals/agriculture.aspx",
    "content": [
        {
            "p": "Agriculture in the United Kingdom uses 70% of the country's land area and employs 467,000 people on commercial holdings. The agri-food sector in the United Kingdom accounts for a total estimated Gross Value Added (GVA) of £146.7 billion, according to the UK Government report: Agriculture in the United Kingdom 2023 Within the agriculture sector there are a huge range of opportunities for graduates of all degree disciplines to contribute from farm to fork. Other life science sub-sectors you may wish to explore further are: If you have questions about your plans, talk to a member of our team. Book a careers appointment Those working in the agricultural sector are constantly navigating a changing environment. Here are just a few examples of key topics affecting the sector are: The Transforming food production challenge is providing up to £90 million of funding to help businesses, researchers and industry to transform food production, meet the growing demand and move towards net zero emissions by 2040. Find out more about some of the projects that have already received funding to give you a sense of the possible future of the industry. The Agriculture and Horticulture Development Board's (AHDB) strategy enables British farmers, growers and their supply chains to succeed in a rapidly changing world by: bringing data, insight and analysis together in an easy-to-use format to help farmers, growers and supply chains make better business decisions helping farming and growing businesses reduce their environmental footprint to meet future policy and consumer needs investing in targeted research to tackle current and future pests, weeds and diseases Given these three points alone, there are a range of opportunities within the sector for graduates from all degree disciplines. The Agriculture and Horticulture Development Board National Farmers’ Union Department for environment, food and rural affairs (DEFRA). Farmer’s Weekly BBC latest agriculture news The National Farmers Union website produces and job vacancy database, and a directory of relevant organisations. Various Government departments and bodies focus on different areas of the agri-food industry: Agri-food is a fast-paced industry facing a range of environmental and consumer-related issues that require innovative research solutions. Visit Tasty Careers for a detailed list of job descriptions, both graduate and non-graduate, across the industry. There are also several relevant job profiles in the Environmental and agriculture sector on the Prospects website including: Demand for specialist roles that combine disciplines is growing, for example using bioinformatics to analyse data and programming skills for simulations. Prospects - Graduate opportunities in agriculture While there are specialist degrees available, many of the roles across the agri-food industry will be relevant to those with a biology, chemistry, engineering or healthcare-related degree. You may find that a masters qualification is an advantageous way to build your specialist knowledge, particularly if the role you wish to apply for is a technical one. For research roles, a PhD may be required. Specific skills will vary between different jobs, but a career in this industry is likely to require the following: Large recruiters such as supermarkets or Government departments will have clearly defined and well-advertised graduate recruitment processes, often starting their recruitment in the autumn term, prior to graduation for roles starting the following summer. Smaller organisations such as specialist retailers, research consultancies, agricultural businesses, etc, are more likely to recruit as demand arises. Specialist recruitment agencies and job boards include: Farmers Weekly Jobs section searchable by type of job Agricultural & Farming Jobs One of the sector's specialist jobs boards Jobs.ac.uk Advertises research roles within the agri-food industry More People - recruitment agency covering the fresh food, horticulture, agriculture and garden industry sectors De Lacy – recruitment agency in global agricultural recruitment To identify the most relevant experience for the particular role that interests you, view job descriptions and vacancy details, and talk to recruiters or individuals working in within your chosen part of the industry. Networking can be a valuable way of getting a foot in the door. Start by asking for advice and then build up to exploring opportunities for practical experience. If you are interested in the agricultural production side of the industry, gaining experience on a farm will be beneficial. For those who are considering new product development, experience in market research or a food retail environment will raise your awareness of consumers and their needs. If you want to work in a research environment, finding a vacation placement or internship in a relevant department will enhance your future applications. Approach Nottingham academics who work in the relevant areas of research to ask if there are any summer opportunities. There are also sponsored opportunities and funding for summer research placements, visit: Agrics Farmers Market Food (Sutton Bonington) Student Food Cooperative UoN Agricultural Careers Facebook group - closed group, request to join Industry placements BBSRC Nottingham Doctoral Training Centres Work as part of a multi-disciplinary project team to deliver a real-life project for a business or charity over a six-week period. A great experience especially for those looking at applying for agricultural consultancy roles. Nottingham Consultancy Challenge The Award is the University's free employability scheme that helps you prepare for the job market and formally recognises your extracurricular activities. Nottingham Advantage Award Undertake an internship with a local business or charity during the Easter or summer vacation. Develop relevant skills needed by employers in the agricultural sector. Nottingham Internship Scheme Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}