{
    "url": "https://www.nottingham.ac.uk/careers/students/work-experience/what-can-i-do/placement-year.aspx",
    "content": [
        {
            "p": "Every year hundreds of Nottingham students are successful in securing a placement year in a wide variety of industries. If you want to immerse yourself in a the world of work to gain an insight into a career area, a specific company or industry, a placement year will be right for you. Placement years help students develop a wide range of professional competencies, learn about sectors, job roles and increase your chances of securing employment after university. Book an appointment with an adviser Sometimes known as a sandwich year or year in industry, a placement year is a period of work experience that can last between nine and 13 months. Placement years are typically taken by students after their penultimate year of study. Students can undertake placements aligned to their field of study or in an unrelated field that is linked to an area of career interest. Students can join the university on a degree where this is an ‘integrated’ part of a four or five year course (for example, BSc Management with Placement Year). These degrees are advertised via UCAS. Examples can be found in; Engineering, Computer Science, Physics, Nottingham University Business School. Options exist within these schools for students to transfer on to or off the degree with the placement year. Alternatively, students from other programmes can ‘add in’ a placement year once they have commenced their degree. For example, a student can start a three-year BA English degree and in year 2 after successfully securing a placement transfer to a four-year BA English with Placement Year degree. This initiative is called the Optional Placement Year. Students are responsible for applying to and securing their own placement year. We can support you at all stages of your placement year search whether you have no ideas or a plan in mind. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}