{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/sports-science.aspx",
    "content": [
        {
            "p": "A first degree in sports science or a masters in sport and exercise science can lead to a diverse range of employment and postgraduate study opportunities. We expect the majority of students to commit to careers in the sports and wellbeing sector undertaking roles such as: Others may decide to look at jobs outside of science and enter a diverse range of roles ranging from law, finance, public relations, teaching, and charity work. We invited four professionals to talk to you about their roles in sports and exercise science: Login to SharePoint to watch a recording of this event These are just a few examples of job titles advertised recently. You may decide that a job on graduation is not for you and consider undertaking a masters or PhD in sport science. For some PhDs a masters degree might be preferred. Prospects - for masters courses Jobs.ac.uk - for PhDs, search under studentships To secure employment and remain employable you will need to develop a range of skills while at university. Skills you will have to develop in and outside of the curriculum include: Strength and conditioning is prevalent within the sports sector and in particular professional sport. You might want to consider acquiring UKSCA accreditation – a professional standard of practice that employers use when employing and developing staff. UKSCA state that: Topics they will include: Current jobs at the time of writing included opportunities at: UKSCA website You may also want to acquire coaching qualifications within a particular sport or acquire multi-sport coaching skills. is worth looking at for more information. Alternatively, choose a sport and acquire specific coaching qualifications such as The Football Association coaching programme. UK Coaching Away from sport, you could be active in the community or student societies and make a positive contribution to the communities you live within. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Listed below are some useful sites for you to look at to assess the current job market (including possible internships) and further study opportunities. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}