{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/working-in-sport.aspx",
    "content": [
        {
            "p": "If you want to work in sport, it is worth taking the time to look at the sector and understand who does what, where and when. You will need to consider the organisations and roles that currently exist (and may exist in the future) match them to your values, motivation and skill set and finally put a plan in place to realise your ambition. The examples that follow illustrate the diversity of jobs undertaken in a variety of settings, from the football club, to work in the community and within the media. Return to A to Z jobs list Book a careers appointment We invited four professionals to talk to you about their roles in sports and exercise science: Login to SharePoint to watch a recording of this event events manager sponsorship product licensing mobile and content broadcasting community partnership officer youth engagement tour guide supporters clubs disability officer safety coach strength and conditioning nutritionist sports scientist performance analyst sport therapist physiotherapy doctor psychologist finance marketing legal human resources facilities management From helping to prevent and manage medical conditions to reducing the risk of type 2 diabetes, the benefits of sport and activity on a person's physical wellbeing are profound. Evidence clearly shows that being active improves educational behaviour and attainment, through greater self-esteem, confidence and direct cognitive benefits. Physical activity can reduce stress and anxiety, with the mastering of new skills often increasing confidence and self-esteem. Promoting social trust, reducing isolation, bringing people from diverse backgrounds together, volunteering and social engagement, helping communities to integrate. There are a variety of roles, diverse businesses and organisations that operate in the sports media space. The job examples below are not comprehensive, but an illustration of what is currently operating in this space. These are just some of the many websites you can search for employment in sports and sport related roles. UK Sport Global sports jobs Careers in sport Leisure jobs Media Beans Academic jobs in sport NHS jobs BasRat Sport England British Association of Sport & Exercise Medicine Recognised sports in the UK Careers in sport media Esports Liberty Global Gravity Media Sky Group BBC Media companies such as Liberty Global, Sky, BBC, Sports Revolution and Input Media illustrate the diversity of organisations involved in sport. If you are looking for sport related opportunities in Nottingham the following organisations might be worth investigating further. Active Nottingham Nottingham Forest Community Trust Notts County Foundation Nottinghamshire County Council Sport for all scheme Trent Bridge Community Trust telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}