{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/physician-associate.aspx",
    "content": [
        {
            "p": "Health Education England continues to invest in the growth of the Physician Associate profession, supporting both education and workforce development. Currently, there are over 1000 Physician Associates (PAs) registered on the Physician Associate Managed Voluntary Register (PAMVR). This register, held exclusively by the FPA, allows employers to check whether an employee is a fully qualified and approved physician associate fit to practice within the UK. If you have questions about this course or the role of a physician associate and want to discuss it: According to the Faculty of Physician Associates: Physician associates (PA) are healthcare professionals who work as part of a multidisciplinary team with supervision from a named senior doctor (a General Medical Council registered consultant or general practitioner), providing care to patients in primary, secondary and community care environments Physician associates contribute to increasing the numbers of the medical workforce and increase access to quality care for patients. They act in an enabling role, helping to reduce the healthcare team’s workload, and bring new talent to the NHS, adding to the skill mix within the teams. While trainee doctors and surgeons rotate through different specialties, physician associates offer continuity and stability both for patients and for the team in which they work. Physician associate support also provides cover so that trainee doctors can attend training, clinic or theatre. It is important to recognise, as per the Royal College of Physicians, that physician associates are not doctors, and must not be regarded as substitutes for doctors, but as supplementary members of the multidisciplinary team. Physician associates' ability to work within the medical environment is enabled by collaboration and supportive working relationships with their supervising clinician, meaning that there is always someone who can discuss cases, give advice and attend to patients if necessary. Physician associates can be found working in GP surgeries, accident and emergency departments, and inpatient medical and surgical wards throughout the UK. Physician associates work within a defined scope of practice and limits of competence. They: According to the Faculty of Physician Associates, newly qualified physician associate posts has been evaluated under Agenda for Change at Band 7. Higher level physician associates (usually requiring a minimum of five years’ experience and a relevant Master’s degree) have been banded at 8a. See the pay chart There is currently no structured career pathway, but with experience in this role, there is scope to develop your career further, and move into management, research, teaching, or further specialisation. Health Education England (HEE) is keen to see an increase in the number of physician associates working in primary care. Physician associate examinations are run by the Faculty of Physician Associates, a department of the Royal College of Physicians. There are between 30 and 35 universities offering this programme. Please note that the University of Nottingham does not offer the physician associate course. Entry requirements are: Applicants must apply to each course either directly to the university itself or apply through UCAS. Each course page on the individual university’s website will specify which application route is in place. Course providers There are a small number of degree level apprenticeships starting from September 2023. Please note, you will have to find an employer who is offering the apprenticeship to be able to apply for this pathway. Visit the Health Education England website for further information about becoming a physician associate. The course is a postgraduate diploma (PgDip) or MSc and is a two-year programme. Typical hours are 50-60 hours per week, six days per week, split 50/50 between taught and clinical practice. Tuition fees for the postgraduate diploma course are typically £9,000 per annum. A training grant of £5,000 is available, split over two years. For further details contact your course provider. Faculty of Physician Associates The home of the physician associate NHS Health Careers Information about physician associates in the NHS NHS Health Careers: Video on undertaking a career as a physician associate telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}