{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/clinical/exotic-pets.aspx",
    "content": [
        {
            "p": "Keen on combining your veterinary skills with your love for exotic pets? Read on to explore the career opportunities, requirements and responsibilities within exotics veterinary practices. Return to vets homepage Book a careers appointment Be prepared to realise how little you know. Exotics is the widest discipline in veterinary medicine with the largest number and most diverse species; it's impossible to know everything about everything, but knowing what you don't know, how to apply basic principles, and where to find out information are key. This is a role where you need to be prepared to go out of your comfort zone and potentially work with species and conditions where little is known or has been tested; the prescribing cascade is particularly important, and being able to work with clients to find ways to manage their pets. EMS with exotics pets might be a little less hands-on compared to other EMS placements due to the nature of the animals being treated (they are often delicate or more stressed animals), if this is the case you will still learn a lot from watching and having discussions with the vets and nurses. If you would prefer EMS that is more hands-on, you might want to consider spending time at a wildlife hospital. Although typically wildlife are handled less than domesticated animals, you might find that you are given more opportunity to handle, assist in triage and give medication to birds and hedgehogs in busy wildlife hospitals. Most wildlife hospitals are also rehabilitation centres, however very few wildlife rehabilitation centres are hospitals with their own vet on site (with access to their own diagnostic testing, drugs and surgical theatre), some of these centres might call themselves a wildlife hospital but without their own on-site vet and nursing team you might find these placements are more suited to AHEMS rather than clinical EMS, it is recommended that you visit any wildlife centre for a tour before booking placements to make sure it matches expectations. Try to find a vet who enjoys having students with them; it makes a big difference to how much you'll learn. If you have a particular interest in zoo animals, get in touch with specific zoo vets, but you'll find that basic principles of veterinary medicine go a long way in all species, and even in general small animal work you'll see rabbits and guinea pigs as a minimum. Exotics work can be done at any level; there are lots of vets who do a good level of exotics work without further qualifications, and experience is very important. However, there are a few different qualifications available for advancement. Certificate courses such as the Improve International Exotic Animal Practice Postgraduate Certificate and the RCVS CertAVP in Zoological Medicine allow formalisation of knowledge; these can be completed in general practice. The Improve course includes teaching which is very good for providing a broad knowledge base and also helping to identify what you need to know in this very wide subject area; the RCVS Certificate is self-taught but holders of this qualification may be eligible to apply for RCVS Advanced Practitioner status. Master's degrees are also available, for example the Royal Veterinary College (RVC) and Zoological Society of London (ZSL) MSc in Wild Animal Health. However, unlike clinical work with exotic pets, if you want to become a zoo vet, zoo residencies ae the main route into this in the UK. Internships are very competitive and are useful for gaining a good knowledge base directly from an experienced team, and in many cases will be required for entry into a residency programme to obtain specialist status. Find out more about internships and residencies Many new graduates will aim to find a job within a practice that has an exotics vet working there already, this will give you a mentor to learn from and this can give you a great start to a career with exotics. However, it is important to ask what your role will be, will you have your own exotic caseload and does the vet want to be a mentor to you? Many new graduates join an exotics practice hoping to see a lot of exotics cases of their own but in reality end up working as a dog and cat vet with exposure to exotics through ward patients and observing the other vet from afar, whilst sometimes being left to fend for themselves with all of the exotics cases when the exotics vet is on holiday - this isn’t always the best learning environment. Sometimes working in a small animal practice without an exotics vet will mean that you will have a larger exotics case load of your own, if you are the only vet who wants to see exotics you will see all of them. Adding your interest in exotics to your online practice biography will also help attract new exotics clients. The downside of this is that your practice might now be willing to invest in exotics equipment straight away, and you will not have a mentor within your practice so you will likely rely on calling or emailing more experienced exotics vets for help. Some experienced exotics vets will allow vets from nearby practices shadow or assist them with more advanced exotics surgeries to enable them to gain experience and skill. If you want to become a zoo vet in the future, the best new-graduate job would be in a large or mixed animal practice. Large animal handling skill, drugs and procedures are all incredibly useful for zoo vets. You might struggle to find a zoo residency program that doesn’t require large animal veterinary experience post-graduation. New graduates very commonly get more exposure to exotics than more experienced vets, unless there is a vet at the practice with a particular interest in exotics; so it's an area where new graduates can often gain lots of experience. Having contact with an experienced exotics vet who can help point you in the right direction if you get stuck can be very helpful. Generally, the exotics world is small and very friendly, and lots of exotics vets are happy to receive emails from other vets asking for help. These contacts can be made during EMS and at conferences, as well as online. Look at our page for advice on networking. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}