{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/beyond-few-weeks/people/divide.aspx",
    "content": [
        {
            "p": "Some people like to draw a very distinct line between their private and professional personas, while for others the boundary is a lot more blurred. To a large extent, how much you socialise with colleagues will come down to personal preference and what you feel comfortable with, but it’s worth thinking through the pros and cons of any social activities in relation to your career and professional reputation. It’s Friday, it’s been a hectic week, and all your work mates are off to the pub, so it’s fine to go along, have a drink and let your hair down, right? Yes, if you want to, but proceed with some caution. Socialising after work can be a good way to get to know people in a more relaxed environment, particularly when you’re new to a job, but there are perhaps a few things to keep in mind. Keep your conversation appropriate, avoid anything that could offend, tread carefully with taboo subjects, and try not to overshare if you’re still getting to know people. Limit your alcohol intake, staggering around and talking very loudly is not a good look. And, have fun, but not at anyone else’s expense, beware of what starts as good humoured banter escalating and going sour. I think it can get easy to get overexcited when you start a new job and get on really well with your colleagues, particularly when social events (nights out, after work drinks) crop up. But it's important to remember you work with these people, and while it's normal and okay to make friends, you don't want to get a reputation or say something you might regret, so it's important to take it slow at first during social events. Abi Bennetts, UoN alumna, Psychology, 2018 The Conversation - Why every company needs a Chief Fun Officer Should your tweets be personal or professional? Do you accept a Facebook friend request from someone at work? Should you connect with all your colleagues on LinkedIn? It’s tricky. On one hand, connecting online might aid communication, it can help you to raise your profile, and it seems like the friendly thing to do. On the other hand, anything you post is open to misinterpretation, there’s a risk of oversharing, and people can be judgmental about what they see. So, before you decide, think carefully about why you use each social media platform, consider how appropriate any content or posts are, and whether or not you want to share this space with colleagues. Sport, hobbies, and societies are not just for university. At work, this sort of additional ‘fun’ activity doesn’t have to stop, and it can provide an enjoyable way to develop deeper relationships with colleagues. There are perhaps a few things to avoid. Try not to: I have found that a great way to settle in is to try and get involved in some of the social activities that many employers offer, whether that is sports, book clubs or exercise classes. This will allow you to meet your colleagues outside the usual work environment and start to make friends. If there are colleagues that you strike up rapport with, maybe they are from the same area as you, attended the same school or university. Don't be afraid to ask that colleague if they would want to have a coffee over lunch someday. Not only will it enable you to learn more information about the culture of the firm, it will simultaneously allow you to build a relationship with your colleague which will help you settle in and enjoy your work. Andrew Drylie, UoN alumnus, Law, 2019 Read our blog post - Extracurricular Activities Aren’t Just For University: 5 Ways To Get Involved at Work There is a key difference between away days and most other work/social activities - there is far less opportunity to simply opt out. Attendance is usually expected, if not mandatory. So, even if you don’t relish the idea, you might as well get on board and approach it with positivity. Don't forget, enthusiasm and a willingness to get involved will be appreciated by your manager. Try to think of this as an opportunity to: telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}