{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/medicine/abroad.aspx",
    "content": [
        {
            "p": "At some point in your career you may decide you want to spend time working overseas. Personal motivations are varied; you may wish to literally expand your horizons. Perhaps you want to see medical treatment in developing countries and share knowledge with others or want to work with emerging treatments in the developed world. You may just want a break from the NHS and training, or be unsure of what to do next and need some time to think. This section will give you some ideas and resources to explore before making your decision on undertaking work, travel or training abroad. Your career in medicine homepage Depending on the stage of your career, you can talk to: Talk to our team A career in medicine offers a series of stages where it may be more or less appropriate to take time out. Each stage has its pros and cons and these need to be considered carefully when making a decision. The ideal time for working or studying abroad will differ from person to person. Think about your individual circumstances and the stage of your training. You may also find our page on taking time out of interest to you. As long as you abide by any regulations in place from the GMC or UK Foundation Programme Office, it is possible to take time out between graduating from Medical School and starting your Foundation Programme. It is advisable to let the Medical School know your intentions of taking a gap year so that information transfers between it and your Foundation School happen at a later date. If you’re planning to take time out of your medical career you should also consider how you will keep your knowledge and skills up to date and also refer to Good Medical Practice to guide your decision. A limited number of foundation schools may support an F2 year abroad. After 2024, we believe that only one Foundation Schools may offer this – Severn. It is important to check with individual Foundation Schools what their approach is for the training year which applies to you. It is highly recommended that foundation doctors should discuss their aspirations to take time out with their Foundation School director and review the most up to date guidance. You may also be able to apply for time out of foundation training. Note time out is often only granted between the F1 and beginning of F2 for a period of 12 months to avoid foundation trainees becoming out of phase. This is probably the most popular time for doctors to head overseas for work. They may do so for a year or two and then usually return to the UK for specialty training within three years. In one of their most recent reports, the GMC describe this as now being the norm and highlight that around 85% return to training within three years. Please note: It's important to check the person specification of the specialty as to any prior experience stipulations. At this stage doctors are often seeking a change of scenery and a break from training after the four to six years at medical school and subsequent foundation training. You may also feel like many other doctors at this stage and be uncertain which specialty you wish to pursue. Time out working abroad may help with this decision. It may be possible to secure relevant opportunities abroad during Specialty Training which could count towards accredited training. It is important to research your options and discuss your interests and aspirations with your Training Programme Directors, and relevant Royal College or training Faculty. Explore common options for taking time out If you are considering training in GP, internal medicine, paediatrics or within the acute care common stem programme, the Global Health Fellowship programme allows trainees to apply to take time out of their training (known as Out of Programme for Experience or OOPE), usually after completion of the second year of PG Specialty Training. The process for applying is specific to each of the four UK nations. Global Health Fellowships It is possible to gain employment abroad after Specialty Training which may give you additional experience at senior level. This experience could be a valuable addition to your CV if you decide to apply for senior posts back in the UK. While it is possible to do all your Specialty Training abroad it is imperative you check your eligibility to practice in the UK when or if you return. Your motivations Take some time to consider why you want to work abroad. Will this time add anything to your career? Why abroad and not in the UK? Are you looking to develop personally as well as professionally? Are you trying to test a career idea prior to applying for Specialty Training? Developed versus undeveloped countries Both will present different challenges and opportunities so it’s important to think about what you want to gain from your experience. For example developing countries may expose you to more clinical situations at an earlier stage in your career, whereas developed countries could be a better opportunity for further study or shadowing. Implications of a break Taking time out to work abroad at any point of your career may interrupt your work here in the UK. Depending on when you do it the break could interfere with continuous service in the NHS, pensions, National Insurance and tax payments. You will also need to consider what might change in the UK during your time abroad and how you will keep up to date with developments in the UK. Application timelines and being away from the UK Depending on when you are planning to work abroad you will need to consider how the break will affect your ability to apply to the next stage of your career in the UK. For example, if you decide to take time out immediately after Medical School you will not be able to defer your Foundation place, you would need to understand how to apply to be ready for your return and the process for applying may change while you are away. Similarly if you work abroad before applying to Higher Speciality Training you will need to keep abreast of the application process and should consider how you will attend interviews. It may seem counter-intuitive to be thinking about your return before you’ve even left the country, but having a well-thought-out plan may ensure you don’t get miss deadlines. Some things to consider while you’re away BMA - working in a range of countries NHS Health Careers The Gold Guide American Medical Association Health Professions Council of South Africa South African Medical Association World Medical Association Medicines Sans Frontiers (MSF) Doctors of the World UK-Med - for UK Emergency Medical Team Voluntary Service Overseas (VSO) British Red Cross The British Red Cross do not send volunteers overseas, but there are opportunities to work overseas through affiliated organisations Save the Children Save the Children merged with MERLIN in 2013. Save the Children do not send volunteers overseas, but occasional opportunities may arise. Dive medicine requires qualified physicians who have a keen interest in diving-related injuries. Diving Diseases Research Centre (DDRC) Expedition Medical Officers are individuals responsible for participants’ health and well-being on trips. While not necessarily a full-time role; having an understanding of emergency medicine in the wild can open up new opportunities abroad. World Extreme Medicine Wilderness Medical Training Travel medicine is an interdisciplinary specialty area and basic training can come from a broad range of backgrounds such as primary care, tropical medicine and occupational health. International Society of Travel Medicine London School of Hygiene and Tropical Medicine Adventure Medic telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}