{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/first-day/checklist.aspx",
    "content": [
        {
            "p": "Think of preparing for your first day as both a practical and mental exercise. Getting yourself and your stuff in order will help to avoid any last-minute panics and allow you to tune into the right mindset. You can then go to bed the night before feeling confident you know what you need to know, you’ve prepared what you can, and everything will be in the right place to make things easy tomorrow morning. Make sure you are positive, in an optimistic mood, and enthusiastic. This will make you stand out from other graduates you may be joining with, who may be mostly nervous. Emily P. Seto, UoN alumna, MSci Clinical Microbiology, 2016 Do you know exactly where you’re going and how long it will take at the time of day you’ll make the journey? Arriving dishevelled because you’ve had to sprint the last stretch isn’t ideal, so factor in extra time. Perhaps even allow ten minutes to sit quietly and gather your thoughts at a coffee shop or on a bench close by. This might help you to feel calmer as you approach your new workplace. You’ve probably already curated a workwear wardrobe appropriate to your workplace setting, or you may even have a uniform to wear, but to eliminate any last minute panic it’s worth getting out the garments you intend to put on and ensuring you’ve removed tags (if new) and ironed as necessary. Plus, to avoid getting blisters on day one you might want to wear in any new shoes by doing a few circuits around the house. The Guardian - ‘Don't dress like Ally McBeal’: the new rules of women’s workwear Menswear Style - New Job Style Inspiration You don’t want to be late. Think through your new workday routine, besides getting up and dressed, are there any additional rituals it might be helpful to cultivate? Perhaps build in time to scan the headlines for stories relevant to your field, take some exercise to pump up your energy levels, or simply eat a decent breakfast. Don’t forget any documents, ID, or forms your new manager or human resources (HR) department has asked you to bring. Keep these in a handy folder alongside any other 'onboarding’ paperwork you’ve received and a list of any logistical or administrative questions you need to find answers to. It may seem obvious, but you’ll need to eat. This will help you to maintain energy and focus. Think meals, snacks, and hydration. Perhaps avoid anything with a pungent aroma, or things that are messy to eat. BBC Good Food - lunchbox recipes There will be a lot to take in so capturing this as you go along is a good idea. At the end of each day, it might also be helpful to revisit and organise your notes as a way of processing and beginning to interpret new insight. Feeling a bit nervous is totally normal so packing anything that can provide a ‘mindful moment’ or help you to find an easy breezy upbeat mood might prove useful for your commute or lunch break. You might find listening to music gets you in the right zone, maybe focusing on a puzzle to channel your attention is more your thing so taking a book of sudoku will help, or perhaps you have a special talisman you like to hold and focus on. Whatever works for you. Calming playlists - Elizabeth Coombes, Senior Lecturer in Music Therapy, University of South Wales Read our blog: Mastering day one: Overcoming new job jitters A local employer, Jigsaw24, has created a video to offer advice on starting your first day in a new job or internship. Jigsaw24 is a member of the Digital, Data and Technology Board, which includes a number of employers alongside representatives from the University of Nottingham and Nottingham Trent University, who work towards supporting talent in the local region. Watch this video: Starting your first job telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}