{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/mental-health/case-studies.aspx",
    "content": [
        {
            "p": "Hear from two alumna, Ruby Kellard and Amy Sharpstone, about their career journeys from the University of Nottingham. I'm the project coordinator for the Peer Education Project, Mental Health Foundation. This is a secondary school-based programme that trains older pupils to deliver a mental health curriculum to younger pupils in their school. It involves managing relationships and stewardship of the schools, chatting with school staff to answer any questions they might have on running the project in their school, including adapting any of the materials or creating new resources as extra support for their pupils. Typically, it also includes project development work, which could be; developing and facilitating co-production workshops with school pupils to feed into new resources or lessons; reviewing and developing new modules for the curriculum on topics like sleep, body image, and kindness (this involves creating lesson plans, assembly plans, and 'top-tip' guides for school staff, pupils, and parents/carers). I also work across the Programmes team on several other projects, including an online digital mental health and wellbeing programme for care leavers. After graduating from my BSc in Psychology and Cognitive Neuroscience from Nottingham, I enrolled in a MSc in International Development: Poverty, Conflict and Reconstruction at the University of Manchester. While on this course, we went on a field trip to northern Uganda where I met a small, local peacebuilding and trauma recovery non-governmental organisation (NGO), called Grassroots Reconciliation Group. I applied for an internship with them and was lucky to be offered a place, so I went there after graduating. I worked as programme officer for a year, working with former child soldiers and South Sudanese refugees overseeing the field activities, for example, based in rural regions and a refugee settlement, working with a translator and other psychology professionals to facilitate community workshops on trauma recovery, stigma, conflict resolution, group counselling, reconciliation through drama. This role also involved the operations side of NGOs such as grant proposal writing, report writing, logistics and budgeting. Look out for sponsorship and funding opportunities wherever possible. Unfortunately, unpaid internships and volunteering experience are common but they can turn into jobs. If you are able to, volunteering gets you into really interesting organisations and is a great way to stand out during applications. I volunteered for a lot of organisations including Headway, Nightline, Soup Run Society, and at a local care home, and this was always something that was positively commented on when interviewing for jobs. I am a psychological wellbeing practitioner (PWP) working in the NHS; this means I treat adults with depression and anxiety disorders using low intensity Cognitive Behavioural Therapy (CBT). PWPs work in Improving Access to Psychological Therapies (IAPT) services. The majority of my day is spent doing clinical work, which is why I enjoy this job so much, so I will assess new clients and carry out treatment sessions. The specific treatment we do is different for each problem so my day can be quite varied, but it is all structured and based on CBT. This can be one-to-one treatment or review calls for computerised-CBT. I may also have meetings, such as team meetings, clinical skills or reflective practice, and once a week I will have case management supervision which is an opportunity to discuss treatment plans for any new or existing clients. As an IAPT service goal is to increase access to mental health support, we do a lot of work around outreach and raising awareness, therefore sometimes I run CBT workshops in the community or present webinars online. I graduated from my BSc Psychology in 2019 and then studied my MSc Mental Health: Research & Practice, graduating in 2020, both at Nottingham. While at university I gained experience as a peer support worker for students with autism and had a placement with Harmless as part of my MSc research project. I also volunteered for Nightline and Student Minds, and was on multiple committees (Psychology and Welfare Network). I was very fortunate and went straight into my role as a trainee PWP when I finished my MSc. To qualify as a PWP you need to train for one year, so I studied a PGCert at University of East Anglia (which was funded) while working in my current service. My main advice would be to make the most of opportunities while at university, whether that is paid roles (such as support worker, research assistant and so on) or volunteering. Experience really is key. Volunteering for helplines (such as Nightline and Childline) is a good way to get experience for PWP work as most of the work we do is on the phone, and it teaches you how to manage emotionally distressing situations and portray empathy. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}