{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/medicine/academic.aspx",
    "content": [
        {
            "p": "If you are interested in practising as a doctor while also making a difference to the future of medical science and education, then a career in academic medicine may be for you. Clinical academics are qualified doctors who combine working as a specialist doctor with research and/or teaching responsibilities. Most academics undertake research and teach but some focus more on one of these aspects. You will usually spend half the week practising as a doctor and the other half carrying out academic activities. Clinical academics work in all medical specialties and comprise around 5% of the medical consultant workforce. To be a clinical academic you will need a higher degree at some point; at least a masters degree and in most cases an MD or PhD, before you reach consultant level. Your career in medicine homepage Talk to our team During the Foundation Programme and Specialty Training there are specific programmes which provide opportunities for doctors to spend time in research. The Specialised Foundation Programme (SFP) enables newly qualified doctors to spend up to four months of the two-year programme in academia. Academic Clinical Fellowships (ACFs) enable trainees to spend a quarter of their time during specialty training developing research skills. The ACF is for a maximum of three years (four years for GPs). At the end of the fellowship trainees are supported to apply for a PhD. However, it is not necessary to participate in one of the above programmes to get involved in research or become an academic. It is possible to pursue independent research jobs, teaching posts, or various fellowship schemes, at all career stages alongside your clinical role all of which give you insight and show your interest. Some may lead to a higher degree (MD or PhD) although the latter invariably requires time out of your chosen training programme (known as \"out of programme experience\" or ‘OOPE’ for short). As a medical student there are plenty of opportunities that will hopefully allow you to explore an area of interest and will provide an introduction to research methodology. You may even get the opportunity to present your work at conferences and publish a paper. Some ways you can get involved include: Try to find someone who is actively involved in good quality research, arrange to talk to them and offer to get involved in their work. If they are active researchers, they will probably have several projects in mind and will be grateful for the offer of help. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}