{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/psychology/research.aspx",
    "content": [
        {
            "p": "UoN PhD Researcher What is your current role and what does it involve? How do you use your degree as part of your job? I’m a PhD student in the School of Psychology researching the psychology of driving and cross-cultural differences in visual attention. As you might expect, I use my psychology degree every day in my PhD. This includes knowledge from modules such as cognitive psychology and statistics, as well as the skills I developed in lab classes and my final year project which help my design experiments for my PhD. How did you become a PhD researcher? After my undergraduate degree I went on to do a masters in psychological research methods at Nottingham. This really helped me develop my research skills further and learn about methods I hadn’t considered during my undergraduate degree. My masters also gave me time to learn more about my research area and develop ideas for my PhD proposal. After my masters I went on to work as a research assistant at Loughborough University for a year working on a project looking at fatigue amongst bus drivers. I was fortunate to find a research assistant job on a similar topic to my own interests, but it was still different enough that I had to learn a lot of new skills (such as qualitative research, research outside the lab, working with stakeholders, and research impact). I also got a lot of practice at writing papers and report in this job. I think this job and my masters were both really helpful when going into my PhD. What advice would you give to someone considering a PhD? If you’re going to work as a researcher I’d say that the project doesn’t have to be in the exact area you are interested in, or have previously done research in. Your general research knowledge will be helpful, and you’ll learn really useful skills by working on a different kind of project. If you’re considering a PhD, I’d say it’s important to have a topic that you’re really interested in and excited about. You can talk about this with potential supervisors to come up with ideas and see what’s available. Be open to learning and trying new things, a PhD is a learning process so you will pick up a lot of new skills along the way which you might not even know you need. I’d also suggest talking to current and former PhD students about the process, funding, working with your supervisor, and the general experience of doing a PhD. What is your current role, and what does it involve? How do you use your degree as part of your job? I am currently pursuing my PhD in the Division of Pharmacy Practice and Policy within the School of Pharmacy at the University of Nottingham. My project is in the field of health literacy, and more specifically medication literacy, and involves the development of an education intervention in collaboration with local primary schools. You’ve got to have a passion for the subject area, and enjoy reading other theses, articles, policy documents, journal papers, and many other documents to discover more. My postgraduate degree confirmed for me that I wanted to do further research, and enabled me to hone in on the area of particular interest to me, which is health research. A PhD is a huge commitment, it’s three to five years, so that passion will sustain your learning. I had a passion for research, which I discovered during my third year of undergraduate study, so I progressed onto the MSc Health Psychology. For me, the project I initially applied for was already taken, but I followed up with enquiries about other projects the supervisors were working on, and what other funding was available, and this led to me meeting with my supervisor, discussing our interests, and devising a project idea that incorporated our passions. What advice would you have for someone considering a PhD? My advice when applying for your PhD is to ask lots of questions. A PhD aims to push the existing frontiers of knowledge in the topic area of your choosing, and therefore the answers won’t always be there. Part of the researcher development process lies within making key decisions with the best available evidence, and defending your choices to wider audiences, regardless of whether they are the gold standard or not. It’s okay not to have all the answers, and it’s better to say ‘I don’t know’ instead of pretending you do. Lastly, I think that networking is a pivotal aspect of a career in research, so as a PhD researcher you have to put yourself out there! This might be by collaborating or conversing with other PhD researchers, postdocs, lecturers, clinicians, teachers, and other stakeholders in your research area. Having that network opens up so many opportunities for present and future endeavours, while also giving you that support system that will really help you during the PhD journey. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}