{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/beyond-few-weeks/tasks/meetings.aspx",
    "content": [
        {
            "p": "Time spent in meetings can equate to a large chunk of your time at work so whether you love or loathe them it’s worth trying to make the most of them. If there’s an official agenda, that’s a good place to start. This will outline the purpose of the meeting and the items to be covered. Beyond this, consider your own objectives for the meeting. What can you learn, share, or progress? Check out the diary invite or ask the meeting organiser. If you aren’t familiar with other attendees do some research. This may provide useful background context and help you to make a connection more quickly when you meet. If you do know the other attendees, give some thought to their likely position and perspective. Like you, they may have their own objectives and being clued up on these can help you to anticipate points of agreement or division. Do your homework. You may have been asked to read meeting papers, prepare information, or reflect on an idea. Do all this, and any additional activities that will help you to follow and contribute to the meeting. Read around the subject, talk to colleagues to test your ideas, and note any thoughts or questions to ask. When you think about meetings you might well imagine a group of people sat together around a table in a meeting room, and this is still a very common approach, but it isn’t the only option. You might venture out for a walking meeting, join people for a working lunch, or connect online via video conferencing. Whatever the format it’s worth giving a little thought to how this might frame the meeting and shape how it flows. The Conversation - You should stand in meetings – don’t worry about what others might think The Guardian - Get out of my office: how to switch to ‘walking meetings’ Harvard Business Review - What It Takes to Run a Great Virtual Meeting Meetings can be long, and occasionally tedious, but remaining fully present will help you to get the most out of them. To aid this: The point of coming together is to share ideas, talk something through, and move things forward, so meetings can be a rich source of insight. Bring curiosity and ask perceptive questions. Make it your meeting mission to learn something new or develop your understanding. You’re there because your input is valued, so try to channel a calm, capable, and confident vibe and express your thoughts and ideas. That said, it’s not always easy, particularly in larger meetings or when there’s more dominant colleagues or senior figures in the room. This is where your preparation will come into play, if you’ve thought about things beforehand, you’ll be better placed to add a thoughtful observation and you’re likely to feel more confident chipping ideas in. If you’re interrupted try to avoid becoming flustered or irritated, instead, indicate that you still have something to add, listen to and acknowledge the other person’s input, and then continue. I remember being very nervous when I first had to contribute to meetings, however, it does become much easier with time so persevere! To help, I would set myself a target of trying to speak at least once in every team meeting (where appropriate). This helped me become more compatible and I got better at expressing my thoughts succinctly and clearly. Victoria Rowley, UoN alumna, Law with American Law, 2015 Even if someone is taking minutes it can still be useful to jot down a few notes of your own. Perhaps focus on capturing ideas that come to you while someone else is speaking and note down anything that you feel it would be helpful to research a little further after the meeting. Spend a little time thinking about the meeting itself. How did it go? What sort of interactions occurred? Was there a sense of consensus or conflict, and how did the group manage this? How would you rate your input? Then move on to consider any learning points. What do you know now that you didn’t know before? Make sure you do anything you agreed to do within the timeframe set. Meetings are often as much about relationships as they are progressing a piece of work, so reach out to colleagues afterwards. Express what went well, for example, say it was good to catch up, learn more about their area of work, build shared understanding or progress a collaborative project. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}