{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/gem.aspx",
    "content": [
        {
            "p": "Whether it’s being part of a respected profession, wanting to be of service to your community and save lives, or the intellectual challenge of being a doctor, medicine offers a wide range of varied opportunities. These are mostly within the National Health Service but also within private health services and outside. Most doctors work within hospitals or general practice but others will find work in industry, the armed forces, academic medicine or research. You should want to make a real difference and have a concern for the welfare of others plus good communication and teamwork skills. The training is intellectually and emotionally challenging so you will need a lot of drive and self-motivation. If you have questions about your plans, talk to a member of our team. This practical workshop includes advice on: Watch now Also read this blog post: Top Tips for Applying to Graduate Entry to Medicine There are three options for graduates: For details of which institutions offer medical courses and structure, visit the UCAS website. Find out more about the courses and entry requirements here at Nottingham: There are currently over 40 medical schools in the UK, of which 18 offer a graduate entry shortened programme. See Graduate Entry Medicine - The Medic Portal for more details. Admission requirements Depending on your degree, A level and GCSE subjects some courses may not be open to you. There are also some courses which prefer applicants not to come straight out of university onto the course. Teaching styles Teaching styles vary especially in the first year. GEM courses range from a series of lectures, tutorials and practicals to case-based, problem-solving and patient contact learning in small groups with the emphasis on self-directed learning known as problem-based learning or PBL. Clinical demonstrations and laboratory practicals will always support any learning along with working alongside other health professionals. All clinical learning on GEM courses takes place in hospitals, community trusts and general practices. Think about the way you like to learn so that you choose the right course. Geographical location As this is a lengthy course, think about your support networks and the cost of living. Reputation All medical courses at UK universities are validated by the General Medical Council. There are no league tables for graduate entry courses but the five year courses do appear in The Times and The Guardian league tables. NHS Health Careers - choosing your medical school It’s really helpful to gain experience in a care setting to enable you to decide if medicine is for you and because medical schools will expect applicants to understand what they are applying for and to be able to draw upon their experiences at interview. Experience can be gained in a variety of settings as shown below. Read Eve's blog: Your guide to gaining valuable medical work experience This could be in a paid position or as a volunteer. Support roles include healthcare assistant, care home staff and hospital receptionist. Gaining experience of working with vulnerable people, practical caring experience, mentoring or activities such as first aid. Talk to professionals working in areas that interest you to gain insights into their role, their challenges and successes and advice for the future. Find out more about work shadowing in the East Midlands. This could be through the Students' Union, for example a committee position within a society or sports club, a course rep or through your outside interests. This does not need to be in a healthcare setting. Look for roles that demonstrate the skills admissions tutors are looking for including teamwork, communication and resilience. Brighton and Sussex Medical School - Virtual Work Experience Royal College of General Practitioners - Observe GP - an alternative to work experience For more information, read the Medical Schools Council's - Work experience guidelines for applicants to medicine Remember it’s not just what you do but what you learn from it that is important. Reflect on what you learn about yourself and about a healthcare and/or caring role NHS Jobs website NHS and Care Volunteer Responders Volunteering at QMC Unitemps - our service for part-time roles Students' Union - Student Volunteer Centre Students' Union The funding for the three types of courses differs significantly. In summary, UK graduate students are currently eligible for much more financial support if entering a specific graduate entry programme rather than an undergraduate programme. The information here is a guide only. You should seek up-to-date information relevant to your particular circumstances from the sources listed and check your eligibility against the criteria for bursaries and loans. Undergraduate standard entry course (with or without foundation) *Information based on Student Finance England, please use the links opposite for information in other countries in the UK. NHS bursaries in England NHS Wales Student Awards Unit The Student Awards Agency for Scotland (SAAS) The Department of Health Social Services and Public Safety (NI) Student Finance NI The application process usually consists of an on line application form with personal statement, admissions tests and interviews. Some medical schools require you to take an admissions test before considering your application. There are three main tests: GAMSAT, UCAT and BMAT. You will need to check with each medical school as to which test they require you to sit. These are used to create a level playing field, especially where candidates come from varied backgrounds. They are designed to test aptitude rather than educational achievement. *Visit the Admission Testing website to work out which time is best for you. N.B. There is also a February date but not for UK university admissions. *BMAT is no longer be available for admissions tests from 2024, universities who previously used BMAT may move to UCAT or GAMSAT, or (usually for international students) MCAT or create their own admissions tests. Find out more about the changes. Please see UCAT website for details of fee bursaries offered for those in financial need. The UCAT test is used by the largest number of medical schools. The test lasts for two hours. It is not a test of knowledge but consists of multiple choice questions relating to: UCAT Both the UK Medical School Council and UCAT publish how medical schools use the UCAT scores in the selection process. Results are provided before the UCAS deadline for medical school applications, and you may wish to decide upon your final choice of applications to medical school based on your UCAT score, as some schools place greater importance on UCAT scoring than others. Preparing for the test The UCAT website has plenty of useful information about how best to prepare for the test, including a Candidate Preparation toolkit and practice tests. Familiarise yourself with the style and format of each set of questions. You may find it helpful to practice reading and answering questions under test conditions. We have some online practice psychometric tests from Graduates First available on our website which, while not the same as the UCAT, will help you to practise similar numerical, verbal and logical tests. GAMSAT assesses your capacity to undertake high-level intellectual studies in a medical programme. It GAMSAT If your first degree is in a non-scientific subject you can still be successful at GAMSAT but you are likely to have gained prior knowledge and ability in the biological and physical sciences, perhaps at A level or equivalent. The test consists of three sections which assess performance in the areas of: The GAMSAT test can only be taken on one single date in September or March. The tests lasts all day. The result is valid for two years candidates may apply for admission to medical schools up to two years after the date on which they sit the test. The GAMSAT website provides tips on a preparation strategy. For sections one and two this involves reading widely, practicing the formation of opinions and arguments to apply to their writing. For the last section you could work through A level and first year university chemistry and biology text books and exams questions. The Association of American Medical Colleges (AAMC) use the Medical College Admission Test (MCAT) to evaluate applicant scientific problem solving, critical thinking, and their natural and social science knowledge. Some UK universities accept MCAT for GEM courses. For details of the test see Taking the MCAT Exam and What's on the MCAT Exam? Applications are made through UCAS and the closing date is 15 October each year for courses beginning the following autumn. You choose no more than four courses. The course code for most of the GEM courses is A101. It is possible to have a mix of undergraduate and GEM courses within your choices. You should apply through UCAS as an ‘Individual’. Make sure you allow sufficient time (at least two weeks) for your references to be submitted by the deadline. You should contact your referees to help them provide a relevant reference. Use this statement to demonstrate to an admissions tutor: See The Medic Portal for detailed advice. UCAS has some great advice for how and when to complete your application - Filling in your UCAS undergraduate application If you have specific questions you can't find answers for on the above page try the UCAS Facebook page here you can search for specific questions that have already been asked or send them a message directly. The type of interview structure varies between medical schools. You may experience a traditional panel interview lasting around 30 minutes or a Multi Mini Interview (MMI) format which is being adopted by more and more UK medical schools. You may be interviewed by a panel of academics, clinicians and lay people. You may experience more than one interview and the length of it can vary from 20 minutes to an hour. This format involves a series of stations or rooms in which you will find either a scenario or an interviewer to assess a specific attribute. Each station lasts a very short amount of time (often five minutes). All will expect you to cover your motivation for medicine, your commitment, your previous caring experience and your ability to reason around an ethical/social issue. Some medical schools will ask you to work with other interviewees on a group task as part of the selection process. A range of your personal attributes relevant to studying medicine will be assessed by means of different tasks. Types of tasks Typical attributes being assessed Interview stations will be assessing aspects such as: A good candidate is someone who can present themselves as a well-rounded, caring person. You will have to present yourself as highly motivated for a career as a doctor and aware of the rigours of a medicine degree. Interviews at medical schools Preparing for medical school interviews Graduate Entry Medicine Interviews - The Medic Portal telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}