{
    "url": "https://www.nottingham.ac.uk/careers/students/international/continue-studies.aspx",
    "content": [
        {
            "p": "When considering further study, such as a masters level degree, there is lots to think about. You may already know the subject you wish to study, or require support finding the right course. It is also important to think about your reasons for continuing your studies, and the benefits you hope to gain. You may have queries regarding funding, visas, or the application process. A masters degree is an investment of your time, usually one year, and money, so it is important to make the right choice by thinking carefully about what you want to achieve. You may choose to undertake further study in the same subject area because of your interest in the subject, and you want to have the opportunity to study in more depth. Alternatively, you may choose a masters degree in a different subject area to your undergraduate degree. This could be with a view to broadening your experiences, or to ‘convert’ to a new subject you would like to know more about with a view to a possible future career. While some employers actively target their recruitment at graduates with masters qualifications, many do not, so it is not always the case that a postgraduate qualification will automatically result in a better job. You will also find that many employers are open to recruiting graduates from varied degree disciplines, and do not stipulate that you need qualifications in a particular subject. Research the course options carefully and check it meets with your requirements. Consider how you will make the most of your additional year of study, such as identifying the transferable skills you will gain, and any opportunities for work experience and extra-curricular activities. This varies by employer and sector, so it is important to do your research into employer requirements before choosing to undertake masters level study. In some sectors, for example, pharmaceuticals, a masters degree could be essential for the advanced knowledge you will gain. In other sectors employers may not be actively targeting postgraduates, but may recognise that candidates with a masters degree have extended skills and experience. When choosing to study at masters level you need to be clear about the benefits you hope to gain, and how you will present this to a future employer to demonstrate how your masters makes you a better candidate for a role. Our Why further study? section can help you understand your reasons for choosing postgraduate study. You will require a student visa for the duration of your postgraduate course. To apply for a student visa, you will need a Confirmation of Acceptance for Studies (CAS) from the university you are applying to. If you are progressing from an undergraduate course to a postgraduate course at the University of Nottingham, then you can extend your student visa. You do not need to request a CAS but you must meet the requirements to receive one. More information can be found on our visa and immigration advice page. Applications to masters degrees at UK universities are usually made through the university’s website. Once you have found the course(s) you wish to apply to, check the deadlines to apply and familiarise yourself with the application process. You may need to set up an account to submit an application, and there may be a fee to pay. You will probably need to provide academic references, so talk to your personal tutor or course lecturers to obtain their permission to be your referee. You may need to provide supporting documents, such as copies of your qualifications, a transcript of marks, or samples of work. More information can be found on our Applying for courses page. For further study in other countries, admission requirements and application conventions are likely to be different from those in the UK. Our staff can assist you in researching the practices and expectations there, identifying the skills you gained in Nottingham and presenting them to course providers. Your personal statement is a key element in your application, and you should use the space to explain your reasons for choosing the course you are applying for. Strong personal statements are well-written, ensuring no spelling or grammatical errors, and include: Read the information provided by the university carefully for their advice on what to include, and any instructions about word/character count. Sometimes, rather than a single personal statement, you may be asked a series of questions instead. Read the questions carefully, and read your answers as a whole before submitting your application to check you have not duplicated any content in your answers. Learn more about preparing your personal statement can be found on our Applying for courses page. You can make an appointment to have your application and/or personal statement reviewed by a member of staff. Read the instructions carefully. You may be asked to provide general samples, which demonstrate your academic writing and/or written language skills, or written work on a specific topic linked to the subject area you are applying for. You may choose a piece of work that you have submitted as part of your undergraduate degree, unless told otherwise. Select pieces that you are proud of, and which you have received feedback on. If necessary you can edit your work to meet the specified word count, and you should note that this is an excerpt from a longer essay. If you require advice on selecting relevant samples of work, you are advised to speak with your personal tutor. To apply for a PhD you will either make an application to an advertised position, or submit a research proposal of your own. In the UK, students will typically complete a masters level degree in a relevant subject before progressing to a PhD, although it is possible to progress into a PhD straight from an undergraduate degree (usually in science and engineering). Ensure you check the eligibility criteria carefully before applying, particularly for funded positions. It is strongly recommended that you talk through your ideas with your personal tutor, and contact potential supervisors before beginning work on an application. You can find out more about applying for a PhD on our Thinking about a PhD page. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}