{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/finding-work-abroad/asia.aspx",
    "content": [
        {
            "p": "This page lists selected resources for Asia including sources of vacancies as well as information on living and working in particular countries. It also has dedicated sections on China and Malaysia, where the University of Nottingham has international campuses. While we do not have country-specific expertise, our staff can offer advice on putting together an effective job-hunting strategy to seek work abroad. We subscribe to an international careers information package called GoinGlobal. You can access GoinGlobal free as a UoN student or graduate. GoinGlobal contains: Log in to MyCareer for access to GoinGlobal If you have any problems logging into MyCareer, please email our team. If you are returning home to either of these countries after studying in the UK and feel as though you will need continued support, you can always contact our Careers team for support with CVs, applications and interview technique. Below is a selection of some agency websites advertising graduate roles in Malaysia. Contact our Malaysia Careers team on Facebook News: The top 75 employers in Malaysia you'd love to work for Use additional sources of vacancies and country guides selected by our staff for more information on job markets and opportunities abroad. British Council Opportunities in the Study, Work, Create section Cturtle Job opportunities around the world Foreign and Commonwealth Office (FCO) List of foreign embassies in the UK and information on travel and visas GradLink ASEAN - for students and graduates from Southeast Asia who are studying in the UK GradSingapore Guide to working in Singapore, including graduate jobs and internships Jooble - Job opportunities across the world Prospects Careers resources for China, India, Malaysia and Singapore TARGETjobs Careers resources for China, Hong Kong, India, Japan, Malaysia, Pakistan, Russia, Singapore, South Korea and Sri Lanka The University of Nottingham Malaysia Careers Advisory Service List of selected job portals for Malaysia and Singapore World Chambers Network (WCN) Database of chambers of commerce and boards of trade around the world For information on teaching in international schools worldwide, visit our Teaching page. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}