{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/children.aspx",
    "content": [
        {
            "p": "Working with children is likely to provide a varied and fulfilling career choice. Whether you want to work with early years, children, teenagers, young adults or families there are opportunities in the public, private and third sector. Use this page to explore the opportunities available in this sector and to think about entry routes and the work experience needed. There are a wide variety of roles available which involve working with or supporting children. The organisational landscape, however, is complex and may vary from region to region. Before considering specific roles, it may be useful to think about the settings in which you could work with children. If you have questions about your plans, talk to a member of our team. Book a careers appointment The education setting includes schools, colleges and higher education institutions. These offer a variety of opportunities to work with children. Our pages on teaching and education-related careers give a useful insight. As well as more traditional teaching roles you could also find work in areas such as: Healthcare settings can include primary, secondary or tertiary treatment. Local authorities are responsible for running the services within a defined area. For example; in Nottingham we have Nottingham City Council and Nottinghamshire County Council. Within social care some of the available roles could include: Local authorities are responsible for children’s homes, residential special schools and secure children’s homes. This government report offers a useful understanding of the children’s social care sector in England. There are many charities involved in the areas of childcare, child welfare and child support. These may operate locally, in the UK and internationally. Examples include: if this is an area of work you are interested in it may help to research some of these charities and investigate the different roles they recruit for. Volunteering is a great way to gain experience. Within the private sector there are many children’s nurseries, after-school and holiday clubs, sports clubs and day care centres. However, jobs working with children are available in other, less obvious industries such as law, leisure, sport, tourism and public services and administration. We invited four professionals to talk to you about their roles. Login to SharePoint to watch a recording of this event It is worth considering that very similar roles are called different things depending on the employer, region or setting. For example; a simple ‘children’ search on Indeed reveals job titles such as: It may be a good idea to think in detail about the setting you are interested in, the client group you would like to support and to then investigate the roles available to you. Think about where the client group you would like to support go for help, therapy or advice and start your research here. Such a huge and diverse sector also needs people to support it and so there are also support roles available such as human resources, marketing, finance and data management. Your role within the sector may not be frontline or operational. There are also roles and opportunities within policy making and project management. You will need to: Other skills that could be important are report writing, research skills, psychological understanding, IT skills and problem solving. If you are interested in working in a support role there may be additional skill sets to think about, for example data management, numerical skills or organisational skills. It is important to gain experience of working with children and this can be paid or unpaid. Paid work opportunities could include a summer camp or play scheme setting for example. You can also gain valuable experience through voluntary work, most often in the charitable sector. Gaining relevant voluntary work experience will help you when you are applying for your first paid position in the sector. You could also consider our programmes such as the Nottingham Internship Scheme or year-long placements to gain experience. Also check out the University of Nottingham programmes from mentoring one-to-one and summer schools to working with children in primary and secondary schools. For many voluntary or paid positions, a DBS check will be necessary. It is a good idea to check whether the organisation will fund this or whether you will need to. There are a few graduate roles within the sector. Some roles involve specialist vocational training such as: Training is likely to involve placements and practical, as well as academic, training. Successful completion of the respective programme is likely to lead to registration and employment in that profession. Read Francine's case study about being an paediatric OT Some routes into working with children require substantial experience. Often graduates will start in basic level positions and work to gain experience. Voluntary experience may be enough to help you secure an entry level position. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. The childcare sector is complex, the roles available are diverse and vary between settings. There is no one website which covers the sector in its entirety. It is useful to use NHS and local government job pages but Indeed is also a great way to explore opportunities. Many roles within the sector will be working for the public, third or not-for-profit sectors. These organisations will often ask you to complete an online application rather than sending a CV and you will need to include a personal statement explaining how you meet the essential and desirable criteria for the role. It is good practice when writing this statement to address all the criteria, providing solid examples for each in the same format as the person specification. Go to our making applications webpages for advice Book an appointment with adviser to get your applications reviewed Much of the information on this page is UK focused. If you are an international student, you may be thinking about returning to your home country, so it will be necessary to research opportunities in alternative locations as provision and career pathways could be very different. Gaining a professional qualification in one country may not mean that you can work elsewhere without additional registration. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}