{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/finding-vacancies/networking.aspx",
    "content": [
        {
            "p": "While some people find the prospect of networking daunting, it has huge potential to transform your career search. In fact, the Harvard Business Review explains: “In today’s world, networking is a necessity. A mountain of research shows that professional networks lead to more job and business opportunities, broader and deeper knowledge, improved capacity to innovate, faster advancement, and greater status and authority.” With that in mind, we understand the value of networking – but what exactly is it? How do you go about doing it? And what about LinkedIn? Read on to discover more. Networking is the process of cultivating professional relationships, whether this is in person or online (for example, via email or on LinkedIn). Opportunities to network can arise anywhere; you may be able to reach out to existing contacts or you might need to seek out a new connection. Regardless of who you approach or how you do it, having a strong network of professional contacts can be an invaluable asset from your time as a university student lasting throughout your career. There are numerous benefits to networking, which include: Gaining an insight into the day-to-day activities of a particular job role Exploring more about what roles and opportunities there are within a specific sector Helping you find work experience, a job, or a mentor Preparing for an interview Discovering opportunities for progression or promotion once on the career ladder You may be surprised to discover who is already in your network – and you never know when a particular contact might come in useful for you. It is for this reason that you should always nurture the relationships within your network. Don’t forget that networking is a two-way process so always be open to helping others where appropriate too. Use this list below to evaluate who is already in your network as well as to discover new ways to reach out: Friends Family Friends’ families and friends Alumni Work experience contacts Academic staff Careers events, for example careers fairs, Spotlight On events LinkedIn Networking is a professional skill and therefore is something that can be practised and refined. As you move throughout your career, you will grow in confidence in this area. Here are some tips to get started: Think carefully about who to approach and what you want to get out of the meeting Find out as much as you can about the person you are going to approach using other contacts as well as their organisation's website and LinkedIn page Make a list of the questions you would like to ask Mention how you got their details, particularly if it was from a named contact or someone you have in common Think about how you are going to approach the person by phone, email, LinkedIn or face-to-face such as at a careers event Be brief, professional and flexible e.g. “Can we meet for 20 minutes to talk about…” or 'I can see you are busy; can I talk to you next week?' Write things down and keep a brief record of conversations Ensure you listen as much as you speak and remember this is a two-way conversation If you are networking to enter a competitive sector, keep up-to-date with industry news If you are attending an in-person event or speaking to someone by video call, remember to dress professionally Follow up with anyone who supports you with a thank you email Remember it's a two-way relationship - you're part of their network too! Keep in touch with your contacts – you don’t want to seem as though you only emerge when you need something Go to our LinkedIn and online presence page for tips on where to start, what to add to your profile and how to stand out, as well as information on making sure you are portraying the right image online. Find out more about LinkedIn telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}