{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/medicine/index.aspx",
    "content": [
        {
            "p": "Studying medicine doesn’t mean you have all the answers about your career. In fact, we realise that as a medical student it is not as straightforward as some people would think. You have a number of key decisions to make along the way and finding the right path requires careful thought and planning, as well as accessing accurate, up-to-date information and advice. In this section you will find useful career planning tools, tips and information to help you prepare yourself for a career in medicine and make the right decisions for your future career pathway. So whether you are wondering how to write a medical CV, want to find information about working overseas after graduation, or trying to decide which specialty to choose, we've got you covered. Career planning Even though you've made the choice to study medicine there are still lots of decisions to be made Building your career Activities both inside and outside your course will develop your skills and help with future applications Making the most of the Clinical Phase Watch four videos from two F2 doctors, a student and a consultant about making the most of your experiences. Foundation Training Find out about Foundation Training and how to apply to a Foundation School Specialty Training Find out about choosing a specialty, the specialty training programmes, and how and when to apply Academic medicine Routes into clinical academic medicine and how to get involved in research during medical school Taking time out from training When could you take time out, what you need to think about and who to talk to? Working abroad Ideas and resources if you're thinking about working, travelling or training abroad Alternative career choices If medicine isn't for you, your degree and skills will open doors to numerous career options Medical CVs and portfolio Advice on when you'll need a CV and what to include in it and in your portfolio Events and societies One of the ways to explore your career options is to talk to doctors in the specialties that interest you Careers guidance Helping you to make well-informed, realistic decisions about your future career now and in the future telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}