{
    "url": "https://www.nottingham.edu.my/Careers/Employers/Employers.aspx",
    "content": [
        {
            "p": "We are committed to ensuring our students can access the best employment opportunities across all sectors and will do all we can to facilitate the career activities you have tailor-made for them. In the University of Nottingham Malaysia (UNM), there is a pool of potential graduates who will be able to add real value to your company. Our student profile is diverse and currently includes 1,500 international students who are among the 2,489 undergraduates and 688 postgraduates studying various distinctive courses accredited by professional bodies that are on offer at the University. Log into MyCareer for Employer Find us on LinkedIn “We have engaged with CAS through career talks, Careers Fair, on-campus events and internship postings. We have found the workshops to be the most engaging in terms of our branding on campus, and the students were attentive as well. UNM students are a priority for Teach for Malaysia as UNM students consistently receive the highest number of offers from us compared to other private universities students, which is a good testament to their quality. We always look forward to the Careers Fair and other events at UNM due to the quality of students and intend to keep coming again!” - Teach for Malaysia (TFM) “Dyson invests heavily on its technology and talents. The strong ties that we have built with local universities over the past decade have given us an ample supply of high-quality graduates and UNM played a pivotal role. We have hired more than 10 Engineering Graduates from UNM since 2012 (>70% have postgraduate degrees) and the number just keeps rising year after year. This reflects the employability and quality of Nottingham Malaysia graduates.” - Dyson Malaysia There are many ways we can work together to help you hire our students: Employer recruitment presentations – You can give a presentation on the overview of your company, career opportunities and the application process. A one- to two-hour ‘careers talk’ in our conference room or other lecture rooms will give you a chance to speak to our students directly and obtain a business benefit, at no cost. We are open to developing innovative activities for you to raise company brand awareness on our campus. In the past, we customised speed networking sessions, roadshows, field trips and sector-focused careers days to fit employer requirements. Careers and Internship Fair – The careers fair is held annually in March with over 1,000 attendees that comprises students and graduates. It usually takes place in our Great Hall and presents a chance for local, national and international organisations to attract our students from diverse disciplines and highlight the graduate and internship schemes on offer. On-campus interviews – Looking to recruit graduates with international work exposure or students from other countries for your company? We can provide the interview rooms as well as registration support for your selection process. Kindly contact us at careers@nottingham.edu.my to discuss availability, capacity, refreshments and venue options, depending on your requirements. Experienced hires – We can support your initiative to reach out to our pool of talented postgraduate students - Masters degree or PhD programmes - including our alumni network with whom we still keep in touch with for employment support. Job posting – We are happy to assist you in posting up any work opportunities in your company on our career portal MyCareer, office bulletin board, e-newsletter and e-job bulletin. Additionally, kindly refer to the UNM Vacancy Handling Policy for Employers before the job submission to us. Please get in touch with us at +603 8924 8106 or email careers@nottingham.edu.my on the terms of the advertising. Our international enrolment has welcomed students from over 75 different countries, with most of the students already obtained degrees from institutions in their home countries. Some have even brought with them a great deal of professional work experience and adaptability competency, which can be a huge advantage to your organisation. For further insights into hiring international talent in Malaysia, please check the ESD (Expatriate Services Division) at the Immigration Department of Malaysia. Note that this information may be subject to changes. Internships We encourage students’ participation in work placements to ensure they have a full-rounded experience whilst studying. We work in partnership with graduate recruiters to promote work placements that will expose our students to learning tangible skill sets in areas such as public relations, finance and career planning. At present, our Engineering (MEng) and Biomedical Sciences students are required to engage in a credit-bearing internship or project to complete their programme while other schools highly encourage their students to spend their summer working in a community or in a professional setting outside the University, starting from June until August. If you can offer internships, be sure to get in touch with us at careers@nottingham.edu.my with a clear policy detailing the learning outcomes and finance considerations you can provide. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Vacancy-Handling-Policy-for-Employers.pdf"
    ]
}