{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/information-technology/space.aspx",
    "content": [
        {
            "p": "The space sector is hugely diverse, encompassing everything from asking the big questions about the origins of the universe, to using satellite data for smartphones apps used in daily life. There are some great opportunities in the East Midlands, wider UK and globally for those interested in any aspect of the sector from pure research to commercial operations. Nottingham graduates should consider a career in the space sector if they are looking for a diverse range of career possibilities with lots of cross-disciplinary working and opportunities for progression both in the space, and wider science, engineering and technology sectors. Dr Kierran Shah National Project Manager, National Space Academy Return to jobs list Book a careers appointment This programme is aimed at recent masters graduates or individuals that have had no prior extensive experience in the space sector. Find out more about this programme on our blog: Turn your passion into a career ESA also has a student internship scheme Space technology is woven into all parts of our lives, from weather forecasts to smartphones and satnavs to satellite television, as well as providing essential communications, navigation, monitoring and research technologies for a broad range of industries. The space sector is a wide-ranging and fast-growing in terms of employment and income generated. The sector employs over 47,000 people in the UK, has an annual turnover in excess of £16 billion and is investing heavily in research and development. The sector has nearly trebled in size from the turn of the century, with an of 10% of its Gross Value Added. The number of organisations engaged in space-related activities has increased in the last two years and now account for 1,293 UK-wide with the East and West Midlands seeing a big increase in companies and jobs. A range of developments are currently taking place in the UK such as through LaunchUK, the UK Space Agency and several international agreements such as UK-Australia Space Bridge and US-UK Technology Safeguard agreement. With an interest in space and technology from a very young age, it was always my ambition to pursue a career within the space industry. After graduating from Nottingham in 2021 with a MSci degree in Computer Science with Artificial Intelligence, I joined Surrey Satellite Technology Ltd in January 2022, on the Software Graduate Programme. As a member of the Flight Software team, I’m directly involved with the design, development and testing of embedded software running onboard satellites. In addition to working with other software engineers within the team, I am also involved with hardware engineers and satellite operators. I particularly enjoy testing real satellite hardware in the lab and writing software to operate in the uniquely extreme environment of space. My main advice to anyone aspiring to work in the space industry, is that graduate roles are very competitive, so I’d recommend joining extracurricular programmes that the university offers, to make yourself stand out! I took part in the university’s international summer school programme, studying machine learning and robotics for three weeks in Shanghai between my second and third years. I feel that the experience benefitted me, not just in my application but also academically and personally. In addition to extracurricular activities, consider integrating a space-related topic into your degree studies, if you can. My master’s project was based around the use of machine learning to analyse satellite imagery, which I also felt helped me stand out in my application. I’d finally like to emphasise the variety of roles available in the space industry, for both engineering and non- engineering backgrounds. If you come from an engineering background, there are roles available in aerospace, electronics, software, mechanical, chemical and systems engineering. For non-engineering backgrounds, there are roles available in geospatial analysis, business development, sales and project management. As long as you’re enthusiastic about space, then there’s plenty of opportunities available! The global space economy worth up to around £250 billion, with key players being the United States, the EU, Russia and Japan. It is estimated that it could surge to $1 trillion by 2040 according to Morgan Stanley. As a truly international industry, there are global opportunities, particularly for people with the right level of specialist skills, knowledge and expertise. It is worth being aware, however, that some roles and companies in this sector are linked to national defence and security, and are therefore less likely to employ non-native citizens of nations in which they operate. UK Space Agency European Space Agency The sector in the East Midlands is worth £20 million, the majority of which is accounted for by space manufacturing. Leicester in particular is a hub for space-related research and technology, clustered around the University of Leicester, the emerging National Space Park and the National Space Centre. There is intensive research activity into space at the University of Nottingham. The university is home to the Nottingham Geospatial Institute, and its business engagement unit, the GNSS Research Applications Centre of Excellence (GRACE). A partnership between The University of Leicester and De Montfort University is also set to build a £13 million Institute of Technology dedicated to space science and digital and cyber technologies. Leicester is also investing in a £100 million space park which will focus on analysing data sent down from satellites. Aerospace and technology companies such as Hewlett Packard, Airbus and Amazon have already signed up as tenants. There are a broad range of opportunities, particularly for those with scientific and technical skills, but also for students from non-technical backgrounds. You can use your fundamental understanding of the science behind materials, propulsion, signal propagation and processing, gravitational forces and (space) weather systems to contribute to the design, manufacture and effective use of essential components and instruments required for space technology. If you wish to pursue further academic study and research, you can specialise in areas such as astrophysics and astronomy, or other areas related to the science of space. If you have advanced IT and programming skills, you will be much in demand to create and develop the programmes and applications required by the sector, as will students with mathematical modelling skills and the ability to manage large data sets across a whole range of applications. Geospatial engineers, geographers, geoscientists and environmental engineers are some of the space most-sought-after profiles, due to the increased operations in earth observation. Any graduate with the right skills can progress into commercial areas supporting the space industry, such as law, marketing and PR, sales, finance, project management and insurance. Space law is an emerging area. The public interest in space means that there are opportunities in science outreach and communication for those with enthusiasm, knowledge and good communications skills. Further space-related job profiles can be found on SpaceCareers.uk. You may also be interested in hearing more from the Space Communications Manager at the National Space Centre in a video covering the opportunities out there in science writing and communications (see under Science writing heading). 71% of employers within the sector are small-to-medium enterprises (SMEs). These smaller, more specialist companies can often be found in science and technology parks. Space careers advertise graduate roles and other opportunities in the space sector. You could also try recruitment agencies such as HE Space or Nebula Space. It is worth looking at membership or company directories on sites such as the of the Midlands Aerospace Alliance or UKspace. The below are just a small selection of employers in this sector: Each country will have its own space agency: There are many organisations working in the space sector. Here are some examples to help you start your search. Thales Harwell Science and Innovation Campus in Oxford is a focus location for the UK space sector. There are many start-up organisations in this sector so it is worth doing your own research. It is possible to do masters courses specialising in various aspects of space science and engineering which can help students to develop specialist skills and knowledge to enable them to progress into roles within the sector. If you are interested in a career in space-related research, a PhD will generally be a minimum entry requirement. There are a range of funded PhDs available in areas such as astrophysics, astronomy, cosmology and extragalactic astronomy, as well as materials and engineering-related subjects. For further information, visit the Thinking about a PhD section of our website. If you are a current PhD student, there are a variety of post-doctoral positions, funding and fellowships available through institutions, universities and other organisations. See, for example, information about research opportunities and funding on the STFC website. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}