{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/beyond-few-weeks/people/manager.aspx",
    "content": [
        {
            "p": "Establishing a positive relationship with your manager is crucial. They can help you to achieve great things, provide context and insight, champion your projects, recommend you for rewards, offer training opportunities... and the list goes on. So, investing in this relationship is a smart move. You don’t have to be best friends with your boss (in fact, this may not be wise at all) but taking some time to get to know them on a professional level is helpful. Perhaps use any early meetings to show an interest in their background. Knowing a little bit about their career history will help you to appreciate their experience and tap into their expertise. Getting to grips with their current role and responsibilities will help you to understand their priorities and any pressure points. And having an idea of what they aspire to do next will help you to understand their motivations. Remember though, it isn’t all one way, help your manager to get to know you too by sharing a little bit about yourself, your experience, and your strengths. Figuring out your boss’s management style and their approach to work will help you to deliver what they need in a way that they appreciate. Start by simply trying to observe how they operate on a day-to-day basis. Try to notice how they demonstrate leadership, communicate with colleagues, and approach decision-making, as well as what sort of thing seems to capture their interest, and what behaviours they seem to approve and disapprove of. Then, think about how you can use this intelligence to inform how you perform your role. Try to schedule a regular catch up with your manager. This will help both of you to feel connected and informed. To begin with it might be useful to agree a few standing agenda items. This will help you to prepare effectively and get the most out of your meetings. You might include: Victoria Rowley, UoN alumnus, Law with American Studies, 2015 An obvious, yet important point. It’s essential that your manager feels confident that they can trust you to get on, deliver what you agree, and do it to a high standard. So, this means bringing your best self to work every day and demonstrating your competence and reliability. That said, there may be the odd occasion when something goes wrong, and if that happens the best thing you can do is to keep your manager informed. It’s better they hear it direct from you, and if possible, with some ideas about how to make things better. Handle every assignment as if you were asked to be the CEO. Many of your first assignments will probably be quite basic (sorry) such as running a search on a specific topic, researching some products on the market, putting together a basic Excel file or PowerPoint presentation on your findings. Take these super, super seriously. Throw in all your PowerPoint and Excel magic and go above and beyond. This will show your manager that s/he made the right choice hiring you and the more serious assignments will come soon enough. Janka Reke, UoN alumnus, BA Management with French, 2017 Most managers have an open-door policy and encourage their team to pop in. However, it’s important to remember that while you are important, your manager is likely to have lots of other demands on their time. They may have several direct reports to line manage, projects of their own to deliver, and many additional meetings or tasks. So, do try to keep this in mind and try to avoid being too needy. I once received a text message from a graduate employee at around 5am explaining that they were unwell and would not be coming to work. I promptly began working to arrange cover and adjust plans, only to receive another message from the employee a few hours later to say that 'their mum said he had to go to work, so they would be coming in'. You're not at school, we don't want a note from your mum, demonstrate that you're a grown-up who can look after yourself. Adam Bevis-Knowles, UoN alumnus, BA Creative and Professional Writing 2014 telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}