{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/chemistry/index.aspx",
    "content": [
        {
            "p": "As a chemistry graduate, you will be equipped with a range of scientific, analytical, computational and problem-solving skills that are highly valued by employers and will enable you to progress into a wide range of both scientific and non-scientific careers. Book an appointment or attend a drop-in The skills you will gain include the following. As well as more transferable skills. Due to the wide range of potential career options and sectors open to you as a chemistry student, it is important to start to consider your options early on in your course. Look for opportunities to gain relevant experience and skills within your areas of interest whether this is in a scientific or in a non-scientific sector. By taking out student membership of the RSC (currently free if studying at a UK university) you can build knowledge through webinars and articles and engage in activities such as Special Interest Groups. You can also record your skills in an Undergraduate Skills Record. If you want to work in the scientific sector, it is worth thinking about doing a year in industry if you are not already registered on this course. Talk to your tutor during your first or second year if you would be interested in transferring to the year in industry option. As part of this, it is possible to gain accreditation from the Science Council as a Registered Scientist (RSci) Summer internships are also a great way to gain experience, whether in science or non-science based roles. The Nottingham Internships Scheme, for example, offers a range of local paid internships with companies in Nottingham, and other sources of vacancies are listed on our work experience pages. Find out more about work experience opportunities Summer research placements through the School of Chemistry, as well as other sponsored opportunities and funding for summer research placements through the following organisations: Royal Society of Chemistry Institute of Cancer Research Attend sector specific careers fairs and employer events to find out more about career sectors and employers of interest. Our events programme Get involved in activities including volunteering and societies such as ChemSoc and the STEM Outreach Society. Students' Union The Nottingham Advantage Award offers a range of modules to help you expand, develop and evidence your skills and experience during your time at university. There's a module specifically for you - Career Skills for Chemists. Nottingham Advantage Award In the UK, the most popular job held for chemistry graduates 15 months after graduation is laboratory technician. Three of the top ten jobs are related to chemistry and include chemists, research/development chemists and analytical chemists. Type of work by percentage: Chemistry graduates have the scientific and laboratory skills which are directly required for scientific research, analysis and technician level roles in a range of chemistry-related sectors such as: These roles could involve research and development, analysis, testing and quality assurance of new and existing chemical-based products and materials, as well as computational modelling, data analysis and other IT or technical support for research and development. 85.8% of all University of Nottingham graduates leaving Chemistry courses in the 2018/19 academic year secured high-skilled work or further study within 15 months of graduating. Science careers Chemistry students looking to pursue their education further through a PhD could also progress into academic research and teaching. Chemistry graduates can use their science knowledge outside the lab in areas such as teaching, science communication and writing and patent law. Science beyond the Lab On a more general level, the transferable skills of chemistry students including analytical problem solving, IT, numerical and communication skills, can be well applied to a range of graduate roles in sectors such as: There are also opportunities for enterprise and self-employment, particularly where new scientific techniques, devices, compounds or materials have been discovered and developed. A number of ‘spin-out’ companies have been established as a direct result of university research. Roles entered: Companies: Find out about Nuria's career path Find out about Rebecca's career path Find out about Gemma's career path Find out about Tom's career path Nationally a significant number of chemistry graduates also progress into further study, the majority of which undertake PhDs. Of these, a significant number will progress on into scientific and academic research careers. Around a third of Nottingham chemistry graduates progress onto further study. For scientific research careers, a PhD is often a minimum requirement, or at the very least a significant advantage. PhDs were undertaken in areas such as: In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar A number of chemistry graduates undertook a Postgraduate Certificate in Education (PGCE) in science or chemistry to train as a teacher - a profession for which science students are currently in high demand. Teacher training Further study options and funding Royal Society of Chemistry - careers support pages Chemistry Moodle Careers page Prospects - What can I do with my degree? telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}