{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/animal-health-and-welfare.aspx",
    "content": [
        {
            "p": "Animal health and welfare is concerned with understanding and safeguarding the health needs of animals, promoting and enforcing their protection, and the prevention of diseases that can be carried by animals. Animal health and welfare comes under the umbrella of animal science which is the study of the biology of animals that are under the control or care of humans. Jump to: You may also be interested in a career as a veterinary physiotherapist. Return to jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment Check out our events British Society of Animal Science Employers within this area include the animal feed industry, food manufacturing companies, research laboratories, zoos and conservations, agribusiness companies, universities, government departments and local authorities. There are many national and international animal charities who operate within animal health and welfare. Most charities operate for animal welfare but there is also an increasing number of charities providing animal assisted therapy and specialist support. Charity Choice have produced a comprehensive directory with links to the UK’s leading animal charities. Graduates working in charities go into a variety of different functions including animal behaviour, care and welfare, marketing and communications, campaigns, education, policy, public affairs, data management, events management, project management and fundraising. According to the British and Irish Association of Zoos and Aquariums (BIAZA), there are more than 400 zoos, safari parks, bird gardens and aquaria in the UK which employ around 3,000 people in full-time positions. (Careers in zoos and aquariums, BIAZA, 2022). These include roles such as animal keepers, trainers, behaviourists, veterinary assistants, technicians, conservation officers, wardens, rangers, outreach officers education officers and fundraising officers. BIAZA - zoos in the UK and Ireland World Association of Zoos and Aquariums European Association of Zoos and Aquariums Pharmaceutical companies developing medicines to promote animal health employ approximately 2,000 people in the UK and specifically animal science graduates in a variety of different functions including research & development, toxicology, regulatory affairs, sales and marketing and communications. The National Office of Animal Health represents companies involved in the research, development and manufacture of animal medicines and provides a list of its members which represents 97% of the UK animal medicine market. The animal feed industry is another key employer within animal health. Roles are varied within this broad sector and include: Animal production can involve direct care and management of production animals including cattle, pigs and poultry or providing support to those direct care providers. Within this sector you can be involved in breeding, genetics, pasture management, animal nutrition, disease control, health inspection, quality control, distribution, sales, managing staff and budgets. Government agencies have many roles within animal health and welfare including operational or policy based roles within research, environmental regulation, animal health, animal welfare, disease control, food quality control, meat inspection, livestock marketing and public information. Departments and agencies to explore: Animal nutrition is a broad area and nutritionists can choose to focus their work on agricultural, companion or zoo animals. Nutritionists work in a variety of roles including feed manufacture, product development, sales and marketing, technical nutrition, corporate research, teaching, academia, conservation and freelance consultancy. Examples of employers include: If you have a keen interest in wildlife, conservation, research, and education, this webinar is for you! Staff from Twycross Zoo talk about: Login to SharePoint to watch the webinar Use the Prospects website, National Careers Service and De Lacy Executive websites to read about the following roles and more. Other related roles include: Specific skills requirements will be role dependent, but in general employers will be looking for: Some roles may require further study, for example research roles will usually require a postgraduate qualification, often a PhD. Some animal technology roles may require a Named Animal Care & Welfare Officer (NACWO) licence. The following companies run Introductory NACWO courses which are Accredited by the Institute of Animal Technology. Charles River Education Learning Curve (Development) Ltd Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Many charities who work with animals are supported through volunteers, so they are always happy to hear from people eager to help out. It is worth approaching rescue centres, zoos, kennels, catteries, veterinary practices, riding schools, safaris and animal sanctuaries who have not advertised volunteering opportunities, as many will be grateful for your support and willing to accept applications all year round. You could also consider volunteering to do some dog walking or volunteer to help at stables or a horse show. Charity Choice Prospects Animal Jobs You may also be able to secure a temporary job working with animals. Many kennels and livestock farms hire seasonal workers to help during busy times of the year. For example kennels and catteries seek extra help around summer and Christmas and farms take on staff to assist during the lambing season. NSA If you are interested in going into sales particularly, shadowing an experienced sales rep in the field can give you a real insight into what the job is like and a competitive edge in the recruitment process. Attending conferences and making use of professional networking websites such as LinkedIn are great ways to start connecting with and approaching professionals. LinkedIn Advice on using LinkedIn Some of the bigger pharmaceutical and healthcare companies such as IDEXX, Boehringer Ingelheim and Covance may offer animal related summer internships with well-defined recruitment processes. Some charities, such as Sea Watch Foundation (use the Get Involved tab) also offer work experience opportunities. Some societies and research organisations offer summer opportunities, such as The Fisheries Society of the British Isles which has summer research internships which are funded. If you are interested in working further afield there are many global animal-based opportunities including volunteering on farms or in animal sanctuaries. Projects Abroad GVI Rural Exchange Gap 360 One World 365 Oyster Worldwide As well as the suggestions here, check out the websites of the organisations mentioned in the section above, Where might I work? Large recruiters such as animal feed, pharmaceutical companies or government departments will have clearly defined and well-advertised graduate recruitment processes. They will often start their recruitment in the autumn term, prior to graduation for roles starting the following summer. Smaller organisations such as charities, research consultancies, conservation parks, are more likely to recruit as demand arises. For some roles which require specific scientific knowledge and expertise, the recruitment process may involve a technical interview. Specialist recruitment agencies telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}