{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/careers-with-a-bvmedsci.aspx",
    "content": [
        {
            "p": "Advice on your options if you want to look at alternative careers with your BVMedSci qualification. While the vast majority of students who study veterinary medicine go on to become vets, you may be in a position where you cannot continue your studies past Year 3 or you may decide that practising veterinary medicine isn’t for you. It is likely that you will have had career aspirations to be a vet for many years and so the fact that you will not become a vet, may be a difficult career decision to make. Luckily your vet degree, whether you have completed the three-year BVMedSci or the five-year BVMBVS degree, has equipped you with many transferrable skills that employers are looking for. These skills combined with a positive attitude, can open doors to a great number of career opportunities. Book an appointment with a careers adviser It's important to think carefully about why you do not wish to continue in a traditional veterinary clinical career. This can help you to think about what you may be seeking from an alternative career. You may wish to start by identifying what you like and dislike about your training and EMS placements so far. You may benefit from considering your wider life outside of the course and take into account your broader interests and activities. Take a look at the career planning section on our website and you may also find it helpful to book an appointment with a careers adviser to discuss your thoughts and research alternatives. It is estimated that around two thirds of all graduate-level jobs are open to those from any degree discipline. A veterinary medicine graduate is likely to be held in high regard by many employers due to the demands of your course and the many transferrable skills you will have had the opportunity to develop. It is impossible to provide an exhaustive list of options but we've produced a summary of just some of the alternative careers open to you. You may find it useful to think about how far away from veterinary work in a traditional setting you wish to go. Do you still want to use your knowledge directly, work in a scientific arena or does anything go? If you want to closely use the knowledge and skills you have gained from your veterinary degree, there are veterinary related opportunities in research, policy, academia and business. You may find our pages on career options beyond veterinary practice of interest. Career options beyond veterinary practice Although you may not want to practice as a vet, you may still wish to work directly with animals in an animal care/welfare capacity, for example as a veterinary physiotherapist, animal technician, dog handler, animal behaviourist or wildlife conservation officer. There are many environments where you may find work including zoos and wildlife parks, welfare or conservation organisations and private organisations. You may find our animal health and welfare career pages of interest. Animal health and welfare careers If on reflection you are interested in using your scientific knowledge and skills, you may be interested in roles within the laboratory. Research and development opportunities can be found within industry, academia and government. You may want to use your scientific skills within veterinary public health, pharmaceuticals or animal nutrition to name a few, or you may wish to use your science in a non-animal context. There are also many scientific careers outside the lab that include career areas such as science communications, patent law, regulatory affairs and science policy. In addition to scientific pathways, you may have a particular interest in working in areas such as environmental or agricultural careers. You may decide that you want to leave veterinary and general science behind and pursue a non-scientific pathway. Most graduate jobs are open to applicants from any degree discipline. Your degree knowledge may provide added value if you choose to work within a commercial role within a veterinary-related sector, for example sales, marketing, or an advisory capacity. Our choosing your career webpages will also be a useful place to start thinking about alternative careers. Prospects website can be a good place to start exploring different roles and sectors. Depending on the type of job and sector you wish to go into, the recruitment and selection processes and timelines will differ, so it is worth doing your research early. Some graduate schemes open in the autumn before you are due to start whereas other opportunities will be advertised in the spring and summer months. Many direct entry roles and graduate positions will also be advertised from the summer onwards for an immediate start. Our pages on graduate job opportunities will provide a good overview. What is a graduate job? Includes when to apply and where to look for vacancies Careers with Animals – holds careers events and talks for those keen to work with animals VetRecord has many good articles on alternatives to veterinary practice telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}