{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/pharmaceutical-sciences/case-studies.aspx",
    "content": [
        {
            "p": "Whilst my industrial placement was based in drug product development, I learnt many relevant techniques to analytical chemistry, namely X-ray powder diffractometry and FT-IR spectroscopy. From here, I wanted to develop skills like these further, and was lucky enough to apply and successfully land a role as an analytical chemist at a pharmaceutical contract research organisation (CRO). I support the Process Chemistry department, so my role involves analysing drug substances using a variety of analytical techniques (mainly HPLC, NMR, FT-IR, XRPD, UV/vis, etc.), as well as general \"wet chemistry\", to determine the presence of impurities after each synthetic step, as well as identifying whether the intermediates produced are as expected. Analytical chemistry underpins virtually all practical work in the pharmaceutical research and development (R & D) sector; the techniques mentioned above are employed in every lab, however it is the analytical chemist's job to refine and further develop these analyses. From the MSci Pharmaceutical Sciences course, we learned about many analytical techniques, and frequently use them during our practical sessions. While the practicalities of each instrument are only a focus once you reach industry, I would encourage all current undergraduates to study the theory behind each instrument, to understand each one's capabilities and limitations, in order to become adept at identifying which technique will be most appropriate for your required investigation. Beyond hard technical skills, the skill from the course I find myself relying upon most often is good laboratory notebook and documentation practice. I work in a Good Manufacturing Practice (GMP) environment, so precise and thorough documentation is essential; as most, if not all, substances I work with end up in patients, good record keeping is crucial to ensure the product’s quality is traceable for every step of the manufacturing process. For analytical chemistry, I would encourage you to gain as much hands-on laboratory experience as possible, especially with more complex instrumentation, such as HPLC, NMR, and MS; these three techniques are arguably the “Holy Trinity” of analytical techniques and are also those that take the longest to become proficient with. Similarly, I would advise to maintain a working knowledge of organic chemistry; as I support the work done in process chemistry, a thorough understanding of synthetic mechanisms and molecular properties informs the work I do in analytical chemistry, especially when it comes to method development of analyses for different compounds. And lastly, take every opportunity that comes your way; you never know what will end up being relevant to your role and, even if they are not directly relevant, it is always valuable to be exposed to new concepts and ways of thinking. Likewise, there is never a bad time to review what you want from your career and what jobs can meet those criteria; my last piece of wisdom is to always be as specific as you can be, even down to the seemingly insignificant details (for example, a biochemist and a chemical biologist are different jobs). telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}