{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/information-technology/internet-of-things-iot.aspx",
    "content": [
        {
            "p": "The Internet of Things (IoT) refers to a network of interconnected physical devices, vehicles, appliances, and other objects embedded with sensors, software, and connectivity capabilities that enable them to collect and exchange data over the internet. In simpler terms, IoT is the concept of connecting everyday objects to the internet, allowing them to communicate and interact with each other and with humans. The IoT has been designed to enhance and automate various aspects of our lives by enabling objects to gather and share data, make intelligent decisions, and perform actions without human intervention. This interconnectedness allows for increased efficiency, improved decision-making, and the creation of new services and experiences. Let's look at the career opportuities in this area. Return to the jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment Our everyday lives have been changed by the Internet of Things (IoT) including how we approach transporting information and networking, it continues to solve problems that we hadn’t previously been aware of. Through the data devices such as Amazon Alexa, Google Home or Hive Connected Home can produce, it has automated parts of our lives, making things more convenient. IoT technology works by using built-in sensors, software, and communication hardware to collect and send data generated by their usage and environment. Devices share this data through an IoT gateway or platform or by connecting to another IoT device. Data is then typically sent to the cloud for storage and analysis. This data can also be used to provide analytical insights, and influence marketing or business decision decisions – learning customer behaviour and knowing when to target a product to them. One example of this is the government's analysis of smart meters, monitoring how the country uses supplies, and shaping the way that energy will be supplied and delivered to customers in the future. IoT is an important piece of technology that will continue to improve our daily lives. There are many advantages of having things connected, such as: There is also the IoMT which links medical devices to systems that can track patient data and recovery progress. One example, remote patient monitoring, enables patients with long-term conditions such as diabetes or high blood pressure to submit data directly to their doctor without them having to attend appointments. The monitoring can also flag up where there are problems and trigger the doctor to arrange to speak to the patient. A report from ITjobswatch shows that the number of permanent jobs in IoT has more than doubled in the UK since 2020, with even more expected to become available going forward. Sometimes, the job title includes 'Internet of Things' but sometimes, these roles can fall under job titles where it is not so obvious, such as solutions architect, software engineer or developer. The best way to search for these roles is to start with searching for the ‘internet of things’ and go from there. Small and medium-sized enterprises can provide a wealth of opportunities for those starting in their careers. You may find that the work provided by SMEs is more varied than at larger organisations. You could gain experience and exposure to many business functions and take ownership of more tasks, which significantly boosts your skillset. Alongside more autonomy in your role, you could also experience early promotion opportunities and more frequent access to senior managers. Look for IT specialist agencies as well as searching generic sites. Here's a few to start with: TechNET IT Technojobs - filtered by IoT Rebel Recruiters - local agency in Nottingham STEM Graduates LinkedIn - filtered by IoT Indeed - filtered by IoT Below are just a few examples of large multinational companies that may have job opportunities. IoT internships and graduate roles remain popular choices for many graduates and students. Cisco - IoT IBM - Internet of Things Microsoft - IoT Google - IoT solutions Huawei Intel HewlettPackard McKinsey EY and the IoT Vodaphone - search for IoT jobs By keeping up-to-date with the latest news, you’ll also identify companies that are active in this area. If you find a company that interests you, check out their website for job opportunities and/or contact the HR or personnel team to find out where they advertise roles, and you could ask if there are times during the year that they typically recruit in. You can also keep up-to-date with the latest IoT news and take a look at the list of the top 10 IoT companies of 2022. We invited four arts graduates to talk to you about their technology-based role and their career journey to date. They will also give advice on how to get into these types of roles. Speakers: Login to SharePoint to watch the webinar According to www.techtarget.com, the seven must-have skills needed to boost your career in the IoT area are: There is no prescribed technical background or degree required to work in IoT but computer science, engineering, science, maths, IT and other technology-related backgrounds are highly relevant and sought-after for specialist roles. However, in start-up companies, there are likely to be roles in areas such as marketing, business analysis and design which will not require you to have technical knowledge. If you are interested in further study options, there are some masters courses and PhDs available. It is however, possible to enter this area of work after an undergraduate degree. We have the Nottingham Internship Scheme which provides a range of work experience opportunities exclusively for our students and graduates. All the opportunities are with small to medium-sized enterprises (SMEs), charities or social organisations. They take place throughout the year with schemes during spring and summer. This is an excellent way to build experience. There are a few a IoT meetups in and around Nottingham where you can network and chat with like-minded individuals and companies. Nottingham IoT Hackathons are also a great way to get experience in learning new tech skills and networking with like-minded individuals. HackSoc at UoN CompSoc at UoN Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}