{
    "url": "https://www.nottingham.ac.uk/careers/postgraduate-researchers/work-experience.aspx",
    "content": [
        {
            "p": "Taking on some work experience during your research degree can be a really valuable way to gain skills and confidence ready for the workplace after you graduate. This page outlines the various ways you can gain experience and feel prepared when the time comes. You might be feeling like you don't have enough work experience to demonstrate your skills when looking for a job. This feeling is common if you've gone straight from undergraduate to postgraduate research without working in between or maybe you've worked before your research degree, but that was a free years ago. One thing to keep in mind is that your research degree is a job in itself, and you will have gained a tremendous amount of experience during this time. It's far more than just a course, and once you treat it as a job, it becomes easier to identify and demonstrate the skills you've developed. You may find it useful to reflect on the skills and strengths that you currently have, so that you can have more confidence in your ability, and find weaker areas that you want to develop further. Find out more about strength profiling If you are interested in identifying your strengths and undertaking a strength profiling session, please contact us by email. There are a range of different options for this, and you are likely to find something that works for you and your career aspirations. Careers blog - The balancing act: PhD research and internships Four guest speakers talk about their opportunities for PGRs. Gain tips on finding opportunities that fit into your schedule and enhance your career prospects. Login to SharePoint to watch the webinar Placements can be an excellent way to take on a project outside of your research, and there are many different types available to you. They can be a great way to boost your skillset while earning some extra income. The Researcher Academy organisers a range of placements throughout each year, which tend to be one of the following formats: Although most of the Researcher Academy placements will follow this format, some will differ from this, and you should be able to find something that fits into your studies. The major benefit of these types of placements is that they are run in connection with the university, and they are aware of your study commitments. This means that if you need to swap your hours round one week to attend a conference or meet a deadline, this will be completely acceptable. Researcher Academy Placements We organise several work experience opportunities for current students including postgraduate researchers throughout the year. Some opportunities involve working in a mixed-discipline group working on a real-life problem for a local company or charity and others are individual placements again with local organisations. Explore the following opportunities Find out more about the Careers team's work experience programmes If you're considering a career in academia after your PhD, and want some work experience within your school or department, demonstrating and teaching can be an excellent way to develop relevant skills. Even if you're not considering a career within academia, demonstrating can be a good way to gain work experience in an environment you're already comfortable in, as you may be working with a member of staff you already know, or helping out in the same building you normally work in. Demonstrating roles can vary, and you might be asked to help with a range of activities such as helping deliver material in a seminar, assisting in a practical, and marking an assignment. You will be supported in your work, and the member of staff leading the session will normally provide you with information and context so that you are able to help the students. You will rarely be expected to already be an expert on the topic, so feel free to sign up to sessions which are beyond your area of research. Some specific skills will be required for particular sessions, usually in the context of lab practicals, but these will always be outlined in the role description. Most demonstrating work will be run through Unitemps, so if you're interested in signing up to this type of work you'll need to set up a Unitemps account. Unitemps If you're interested in gaining experience teaching and working with young people, The Brilliant Club is a UK charity which works with the postgraduate community to engage students aged 8-18. The aim of the charity is to support less advantaged students and increase the number of pupils from under-represented backgrounds progressing to the most competitive universities. By working with The Brilliant Club, you would get to share your subject knowledge and enjoyment of learning with younger students. The work you would do is very rewarding, and makes a real difference to the students and their educational prospects. Brilliant Club - find out more Blog post: My experience as a Brilliant Club tutor If you're doing your PhD through a doctoral training partnership (DTP) program, you will usually be required to complete a placement during your second or third year of study. These tend to be between one and three months in length and are encouraged as part of your professional development. You will usually get support from your DTP scheme when looking for a placement, but we are here to help if you need any further guidance. Book an appointment with a careers adviser If a placement doesn't fit into your professional goals, but you'd like to gain some work experience, part time and temporary work could be right for you. There are lots of roles added throughout the academic year, with a large range of jobs available. The listings are so varied that you are likely to find something that matches your professional goals and your availability. Listings include: There will also be a range of working patterns such as working from home, working in person and hybrid. Additionally, some roles will be within the university and others will be with external companies. On-campus jobs Off-campus jobs Careers blog: How to balance a PhD with paid work In recent years, online work experience has become more popular, allowing you to complete internships, placements, or volunteering from home. The work is normally formatted as a structured programme offered by a business, or a shorter module-based programme focusing on a specific set of skills. If you don't feel that you can set aside enough time for other forms of work experience, there are plenty of other ways to develop your skills. The Researcher Academy offers a training hub, which is a collection of courses and training exercises of varying lengths and formats. Some are short courses which can be accessed and completed in your own time and at your own pace. Others are live sessions and webinars which cover a range of training opportunities. There is an abundance of different courses available, including subject specific technique training, managing Excel sheets and large Word documents, science communication, and even interpersonal skill development. Researcher Academy website Careers blog: Gaining employability skills alongside my PhD If you can't find what you're looking for, check your emails from the Researcher Academy for other short courses which may be of interest, or book a meeting with one of our advisers to look at your options. Book an appointment You might have something specific in mind, or haven't found what you want through the Researcher Academy placements. If this is the case, you may be interested in searching for your own placement, or setting one up with a company you're interested in. Placements and internships are frequently advertised on the same platforms as other jobs, so it's possible to find something you're interested in by searching these types of websites. Explore sources of internships and work experience opportunities If there's a specific company that you're interested in gaining experience with, you can get in touch with them to find out if they'd be interested in setting something up. A careers adviser will be able to help you in this process, so book a meeting with us if you'd like to discuss your options further. Not all companies will have the capacity or interest in setting up a placement, so keep trying different companies if you don't succeed straight away. Be flexible about the role you'd like to try out. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}