{
    "url": "https://www.nottingham.ac.uk/careers/postgraduate-researchers/exploring/offer.aspx",
    "content": [
        {
            "p": "The key thing to remember when identifying what you have to offer is to view your research degree as a job. So, in effect you already have at least three years of employment history behind you, and a range of experiences, skills, attributes and behaviours to draw on when approaching new employers. Your challenge is to see yourself as others could see you – a professional researcher with expert knowledge, a wide range of relevant skills and a desirable qualification. Jump to: Book an appointment on MyCareer When considering your skills, attributes and behaviours – the following questions may also provide useful prompts: Vitae, a non-profit organisation dedicated to supporting the professional development of researchers, produced their ‘Employers’ briefing: Targeting the postgraduate and researcher market’' in 2009, in which they outlined for employers the employability skills gained by doctoral level applicants: There are various useful sources of information that will help you to understand what employers are looking for: In member surveys undertaken annually by organisations such as the Confederation of British Industry (CBI), the lists of generic skills employers value commonly include the following: The Economics Employers Survey Creative Skillset (publishing) - skills shortages and gaps Prospects Another way to identify the skills required by a particular sector or role is to review a number of currently advertised job descriptions and person specifications and look for common themes. It’s worth noting, that while job descriptions for academic posts require highly specific knowledge and technical expertise, outside academia the ‘essentials’ are not always set in stone and the successful candidate may not be able to tick every box in a person specification. Having the right mix of skills and experience, or particularly strong skills in a key area, can secure the role. Jobs.ac.uk The Guardian Times Higher Education Unijobs telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}