{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/jobs-in-education/tefl.aspx",
    "content": [
        {
            "p": "Teaching English as a Foreign Language (TEFL) teachers help adults and children to learn and/or improve their English language skills. TEFL can also be known as TESOL (Teaching English to Speakers of Other Languages) or ELT (English Language Teaching). Most work is overseas, providing a great opportunity to immerse yourself in a new culture and lifestyle, but there is some demand for teachers in the UK. If you have questions about your plans, talk to a member of our team. As a TEFL teacher you'll cover the language skills of listening, speaking, reading and writing. You may work in schools, specialist language schools, or further and higher education institutions. TEFL teachers are often employed on fixed-term contracts e.g. for the academic year. You may also choose to be self-employed, or undertake freelance work as a tutor. It’s worth considering the length of time you plan to spend working as a TEFL teacher; some individuals choose short-term work, for example as a gap year, rather than a long-term career. As TEFL becomes increasingly graduate orientated, holding one of the following degrees may help: Most employers will also require a recognised TEFL qualification such as: Certificate in English Language Teaching (CELTA), awarded by Cambridge Assessment English Certificate in Teaching English to Speakers of Other Languages (TESOL), awarded by Trinity College London Trinity College has a guide to Choosing your TEFL/TESOL course which you can download. Courses are available as full- or part-time options. To gain a place on these courses you’ll need A-levels (or the equivalent) and a very high standard of English. You should also evidence your skills in preparing lesson plans, interpersonal skills, and cultural awareness. Work experience, for example as a language tutor, can be useful, although some short-term roles are available to those with limited or no experience. Short courses are available, lasting from a weekend to a few weeks, which are ideal for a gap year, or if you intend to teach overseas only for a short time. Companies such as i-to-i TEFL offer online or classroom courses allowing you to study at your own pace. For more details on the shorter course options available, visit the Prospects English as a Foreign Language Teacher profile. Progression in TEFL is via completing a diploma level course. Diploma in Teaching English to Speakers of Other Languages, Cambridge Assessment English Diploma in Teaching English to Speakers of Other Languages, offered by Trinity College London Alternatively, you can go on to study at masters level, in subjects such as teaching English as a foreign language, or a PGCE. To work in a state school or further education college in the UK, you'll usually need qualified teacher status, and further qualifications and experience to teach in universities. Many of the TEFL roles advertised may be situated outside of the UK. These may be through the British Council or through private language schools, volunteer organisations or other private institutions. There are some links below to look for these overseas opportunities. Use GoinGlobal, an international careers database covering 42 countries, for information about working abroad and job opportunities. Log in to MyCareer to access GoinGlobal. If you want to work in the UK, there may be opportunities in school and education settings such as universities and colleges. You may also find roles in voluntary organisations or community settings, as well as specialist language schools in larger cities. Once experienced you may also be able to become a freelance teacher or specialise in particular opportunities (in business English, for example). telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}