{
    "url": "https://www.nottingham.ac.uk/careers/postgraduate-researchers/applying/vacancies.aspx",
    "content": [
        {
            "p": "You're are ready to start exploring the opportunities available to you after you complete your research. We're highlighted the key websites for jobs within academia and sources of opportunities outside academia depending on your specialism. Networking and using LinkedIn are also key to any successful job search strategy. There are a number of relevant vacancy websites, including: Jobs.ac.uk for UK academic jobs Times Higher Education Jobs FindAPostDoc Academic Careers Online –a global academic job site Euraxess researchers' portal- European jobs Vitae - US jobs Academic Careers Online - jobs in Australia Sources of vacancies will obviously vary depending on the sector(s) of interest to you. There will often be specialist vacancy websites available, but it is also worth looking on employer websites or contacting employers of interest to find out how/where they advertise their vacancies. Graduate jobs - sources of vacancies Types of jobs pages - vacancy sources for a range of sectors MyCareer - our vacancy service for UoN students The Guardian For most PhDs looking for academic roles networking is a key skill. Build and use your network of contacts to explore the opportunities available – your profile and reputation, and those of your close colleagues, will potentially open doors for you. If you have a personal contact with someone in a particular institution that interests you, a conversation followed up with a targeted CV can be productive. Explore relevant courses through your school, faculty, the Researcher Academy and academic or learned societies. What courses??? Read Nkem's blog: A first-timer guide to international conferences If you are looking for a career that will use your expert knowledge in a particular field, networking can be a very valuable approach. Some initial contact with an organisation, followed up with a targeted CV is often well received. Check our events programme to see if any employers of interest are giving talks and attending careers fairs. Employers will often make a note of people they meet and this can be advantageous when they receive your application. Our careers events programme Read Emily's blog post - How I used LinkedIn while job-hunting Many employers would expect to see a candidate on LinkedIn. LinkedIn is a professional networking tool where you can connect with individuals, groups and organisations. More than 25 million professionals in the UK alone have created a personal profile that showcases their experience, knowledge and skills, which they then use to contact others. With more than 31 million organisations on LinkedIn you can: Find out more about how to use LinkedIn and setting up your profile If you are interested in developing your LinkedIn profile and maximising your potential with future employers, this webinar is a fantastic resource. Gemma Foxall, Careers Adviser, talks about: Login to SharePoint to watch this webinar telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}