{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/beyond-vet-practice/sales.aspx",
    "content": [
        {
            "p": "You may be familiar with companies that sell pharmaceutical and medical products to vet practices. Sales representatives are the vital link between vets and drug companies. As a sales representative, you would be the face of the drug manufacturer; providing information, education and selling drugs and medications to veterinary practices and animal hospitals. Find out more about science careers beyond the lab Return to the Vets homepage Book a careers appointment There are two types of sales representatives; inside sales and field sales. Inside sales don't involve much (if any) travel and is mainly done from an office. Field sales positions require frequent travel throughout a designated territory to sell products or conduct product training. A career in veterinary pharmaceutical sales can be enjoyable for those who have strong interpersonal skills combined with a love of animals. You will also need commercial awareness as your customer group will have a strong financial interest in the products they buy and the impact it has on their practice. While the majority of sales are in the pharmaceutical sector, animal food companies also have sales roles. Generally speaking, you would be responsible for selling to a number of veterinary practices, achieving sales targets, building quality relationships, and effectively implementing sales campaigns and events. The clinical knowledge and experience you have as a vet is hugely beneficial, giving you expertise and credibility through your understanding of anatomy, physiology, biology, pharmacology and chemistry. You would not need any further formal qualifications in order to make this career transition, but any steps you can take to acquire confidence in sales, marketing and public speaking would be beneficial. Skills recruiters will look for you to demonstrate are: For a field sales role, you will also need a driving license. Knowing how the pharmaceutical industry works, who the major players are, and what they manufacture will help you in your quest to find employment in this field. You should also understand the relationship between drugs and common diseases. In addition to doing this research online, you could also go to seminars, meetings and conferences that relate to the animal pharmaceutical field and add these to your CV. Your approach to job-hunting will need to incorporate both direct applications to companies advertising posts, and the utilisation of recruitment agencies. For direct advertisements, company websites are a great place to start, and you can also visit sites such as Indeed who will collate many jobs together in a searchable database. Recruitment agencies will also be a major focus of your search. Some useful ones are listed below. Using LinkedIn to network, approach recruiters and allowing yourself to be found by recruiters is also a very useful tool. A valid approach is also to speculatively apply to companies you would be interested in working for to try to 'create' a vacancy. This requires you to research the firm, and the most relevant person to contact, for examples, the sales director, email them your CV and a targeted covering letter. Follow up if they don't respond. The salary package for sales representatives will probably include a base salary, commission, company car, and benefits (pension, holiday days, and so on). The total value of this package may vary widely based on sales volume and your experience. As a rough guide, a senior sales professional managing a team may be paid in the region of £55,000 (plus bonus, company car and other benefits). Without management responsibilities, you could start on around £30,000. As companies tend to be relatively small (10-20 reps), promotion opportunities can be infrequent, but those who are successful can progress quickly up the managerial ladder to manage a team of sales reps. Vetclick Indeed Simply Sales Jobs Nestle Purina Careers Hillsvet Zenopa LinkedIn News Now Vet Futures – Your passport to the future © CoSector, University of London. Used with permission. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}