{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/interpreting.aspx",
    "content": [
        {
            "p": "The words interpreting and translating often get inter-changed, but interpreters convert spoken words from one language to another while translators work with the written word Some professionals are able to do both, but they are regarded as separate roles with distinct skill sets. For both you need to be an excellent linguist with a broad vocabulary in at least one ‘foreign’ language. Read our information on careers in translation. If you have questions about your plans, talk to a member of our team. In this webinar, you will hear from experienced translators and interpreters. They will give you an understanding of their role, the skills needed, and useful advice for getting into this area of work. The speakers are: Login to SharePoint to watch the webinar Interpreters work in a range of settings; the pandemic halted a lot of conference-based activity, as this tends to involve travel and staying in a hotel or conference centre, but this has to a large extent resumed now. However, the pandemic has led to more possibilities to continue to carry out some aspects of interpreting online including court hearings and medical consultations. This is where you are interpreting immediately as the speaker is speaking, usually via a headset. This can be the norm in conferences such as the UN, where you may be in a booth and enabling someone else to understand what is being said. This requires a lot of concentration and agility as you are listening and speaking at the same time. You generally only go from the target(foreign) language into your mother tongue, especially in large conference settings. This is typical in settings such as: medical, legal, police, social care, where you are listening first and then communicating that to the other party and vice versa. You will typically do this both ways (that is, in and out of the target language) You still need a lot of agility and often sensitivity to the situation. The term chuchotage is French for “whispering”. This is a form of interpreting where the linguist stands or sits alongside a small target audience, in many contexts, and whispers a simultaneous interpretation of what’s being said. This is seen as another form of interpreting, and a very important one as it aids people with hearing impairments to understand what is being said. However, the focus of this section is on foreign languages and will not cover signing. The National Careers website has some information on being a sign language interpreter. Unless you are employed as a staff interpreter for an international body, you will almost certainly be self-employed or freelance. This is something to consider if you like the security of regular income as an employee, holiday and sick pay and do not want the added responsibility of doing your own paperwork, tax returns and so on. It is said that it takes two years or more to get established as a self-employed interpreter, so you need to think about how you can make a living whilst building up relevant experience and skills. If you are interested in the public service areas such as health, legal and social care, there are a range of agencies that specialise in this and you can register with them. They would pay you an hourly rate for the work that you do. You would be advised to register with several to maximise your chance of work. They will assess your language skills. There is the opportunity to take on work via the telephone with these agencies. Examples of larger agencies include thebigword. Some have contracts with the NHS or the police. You may find yourself travelling all over the UK, although you do not have to go anywhere that you cannot get to as you would only select the jobs that are realistic for you. To begin with, you may have to be very flexible about the type of assignment in order to build up your experience. When you are more experienced and hopefully get more work coming through, you may be in a situation where you can be more selective about the types of assignments you want to take on. If you are interested in business interpreting, there is no silver bullet. You might want to try contacting businesses and offering your services, and setting up your own website. You will probably already have worked in conference and/or public service interpreting Conference interpreting Conference interpreter positions do come up. You will more than likely need two additional languages to your mother tongue from an approved list. Below are the links to some of the main options - you can find out more about their requirements and how to apply. Also note that they do offer freelance opportunities at these institutions. NATO (North Atlantic Treaty Organisation) Translation Service UN (United Nations) Careers - also includes UNESCO EU Careers - Note: UK nationals can no longer apply because of Brexit In terms of getting started, it is hard to get specific interpreting work experience, but you would be well-advised to enlarge your vocabulary as much as possible. If you can, travelling to places to familiarise yourself with different dialects and local phrases is a real asset. You have many easy opportunities to listen to languages via film, radio, news outlets etc so keep immersing yourself in the non-native language and try to get attuned to any regional dialects Given the settings you may be working in, some experience in one or more of those could be useful, for example in health settings, courts, social care and so on. As mentioned earlier, once you get started, you need experience to then get onto registers to gain more access to potential employers. Some agencies may offer ad hoc work which is outside the scope of legal or police work. To be a conference interpreter, you will require an masters (MA). Check out the courses accredited by the: For public service interpreting, you could study for an MA in Public Service Interpreting. There are also the diplomas in this subject (DPSI) which can be taken flexibly and via distance learning. The Chartered Institute of Linguistics (CIOL) accredits these courses, but the National Register of Public Service Interpreters lists other providers too. For business interpreting, there are no specific courses, although you would have the most credibility with some training in interpreting, and possibly prior experience in another area of interpreting and/or of a business sector. Chartered Institute of Linguists (CIOL) - includes details of their diplomas in interpreting The Institute of Translating and Interpreting International Association of Conference Interpreters (AIIC) Prospects interpreter profile telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}