{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/interviews/types.aspx",
    "content": [
        {
            "p": "Interviews can come in a variety of different formats, understanding what to expect from an interview can really help you to feel prepared. On this page we have outlined several different types of interview that you may be invited to, don’t panic you won’t be asked to do all of these types for just one role. For each interview type we discuss what to expect and some practical tips to help you to prepare Return to the main interview page Book an appointment with an adviser Attend an interview skills workshop Telling a prospective employer any information about a disability(s) is a personal choice. It is up to you if, when and how. If you are unsure at any stage, consider what would be the advantage of sharing at that point. If you decide that you want to, think about what would be most relevant for the employer to know at that specific stage of the recruitment process. Visit our page on applying with a disability You may be interviewed by one person or a panel of three or four people. Your interview may be a stand alone event or be part of an assessment centre. Either way your preparation and performance should be the same. Being in the same room allows you to use your body language and facial expressions to express your personality at the same time as answering the questions fully. A face-to-face interview can involve a variety of question types including competency, strengths-based, behavioural and technical. It is important to research the organisation and the type of interview questions you can expect. Check out eCareersGrad, our online interview resource, for more help with face-to-face interviews. Go to our online interview resources Telephone interviews are used by employers, who have high volumes of applications, to screen candidates using three or four questions. However, with the increased use of Teams and Zoom, it is now more common to have a video call rather than a telephone call for an early stage interview. Usually you will be given a day and approximate time to expect a phone call, although some recruitment agencies do call without setting a pre-arranged time. If it is not convenient for you to talk when they call, let them know and try to arrange a more suitable time. You should try to be in a quiet room with your application form or CV and any relevant information about the organisation in front of you. Preparation for telephone and video interviews should be just as thorough as a face-to-face interview. Prospects website: Find out more about telephone interviews A pre-recorded video interview typically involves you recording video responses to a set of questions via a video interviewing website. The questions may appear as text on the screen or as a recorded audio clip. For some interviews you may be given a limited thinking time when you first see the question and then a limited time within which you can answer the question. You may or may not have the opportunity to retake an answer. Most video interviews give candidates the opportunity to practice on the software before the real interview starts so you can become familiar with the layout and how the platform works. Companies use this format to screen high volumes of candidates, they can watch the recorded answers at a time convenient to them. As well as assessing the content of your answers against the criteria set in the job description, they will be assessing your ability to answer the questions within the time frame given, and hoping that you are able to show energy and enthusiasm for the role despite not talking to someone in real time. We have subscribed to two online interview platforms – Graduates First and eCareersGrad – to help you practise your video interviewing skills. They are all free for you to use. A live video interview will involve meeting the interview panel virtually via software such as MS Teams or Zoom. Unlike the pre-recorded video interviews this will be a live discussion between yourself and the panel. There could be one interviewer or there could be three or four people from different areas of the business asking you questions. Live video interviews are now more common than telephone interviews in earlier stages of the recruitment process. A video interview can involve a variety of question types including competency, strengths-based, behavioural and technical. It is important to research the organisation and the type of interview questions you can expect. As well as preparing your answers to possible questions and researching the company and role fully it is worth practising your video interview technique. It is helpful to familiarise yourself with the software, if your interview will be on Zoom and you’ve not used it very often, ensure you know how it works perhaps by setting up practice calls with friends or family. Look at the camera as you are speaking. This replicates eye-contact with the interviewers. You can use a sticker or post-it note near the camera to remind you or put something just behind your webcam to encourage you to look at the camera Ensure you’re in a quiet space where you won’t be disturbed during the interview Check your internet connection in advance to ensure your wifi is working Use your tone of voice and body language to convey positive energy and enthusiasm about the role Consider how your outfit for the interview helps you to make a good first impression. It is worth presenting yourself in a professional way, even when you are interviewing online We subscribe to two online interview platforms – eCareersGrad and Graduates First – to help you practise your video interviewing skills. They are all free for you to use. These interviews are most common when applying to roles in healthcare or Graduate Entry to Medicine courses. Multi mini interviews usually involve a series of six to eight different stations (or mini interviews), each being facilitated by different interviewers, in different rooms if in-person. As a candidate you will spend approximately eight to 10 minutes on each station before moving on to the next. Each station will focus on a different interview question or scenario. A multi mini interview can involve a variety of question types including competency, strengths-based, behavioural, values based and technical or clinical. It is important to research the organisation and the type of interview questions you can expect. Practice timing your answers to interview questions so you have an idea of how to structure an answer within a six or eight minute time frame. Keep up to date with relevant news items, often one station may ask you about a ‘hot topic’ or recent news article related to the role. Ensure you know how you are getting to the interview, planning your route in advance and allowing extra time for unexpected delays Take a notepad with your research notes and a list of questions you would like to ask during the interview Remember that in a multi mini interview the interviewers don’t know what happened in the previous section, so start each new section without thoughts of what happened in the last one Consider how your outfit for the interview helps you to make a good first impression. There may be advice on what to wear in the instructions from the company for you to follow telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}