{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/civil-service.aspx",
    "content": [
        {
            "p": "The Civil Service employs over 450,000 people across the country and overseas. It touches on all aspects of life in the UK from education and environment, to transport and defence. Civil servants are politically impartial and consistent even when governments change. This means they hold a lot of expertise, advising ministers on policy and delivering front line services which support the work of the government. If you have questions about your plans, talk to a member of our team. Roles range from administration and general management, to specialist roles in the Foreign and Commonwealth Office (FCO) or Government Economic Service (GES). More on the Civil Services vision for the future is available in their ‘A Modern Civil Service’ document. As well as any experience in administration, customer service and research work, skills that are highly valued include: Excellent organisation and administrative skills. The ability to interpret complex information in the form of policies and procedures. A flexible approach to work with the ability to adapt to shifting priorities. Self-motivated and driven to deliver accurate and high-quality work even under pressure. Think about the types of extracurricular things you could get involved in that would allow you to evidence these skills in an application. Watch this webinar to learn more about a career in the Civil Service and in local government. Mahel and Shambavi share their top tips on what you can do now to boost your career prospects, and expand on their current roles and their routes in. Login to SharePoint to watch the webinar The Civil Service is made up of departments, professions and specialist agencies reflecting the range of things the government does. There is a useful Civil Service careers website which also has a helpful ‘career matcher’ quiz to show you areas in the Civil Service that may most match your interests. The work is generally based around standard office hours, however each department functions independently and will have its own employee expectations. When projects are close to completion extra hours are often expected. However they are open to flexible working arrangements. Often graduates will look at possibilities like the Civil Service Fast Stream, a leadership development programme. However, many graduates will also apply for direct entry early career vacancies, for example ‘Civil Service Administrator’ which you can find through the Civil Service job search. These can offer the same long-term opportunities for future career growth. Civil Service Apprenticeships are also another option to explore. Other related job boards include: Local Government jobs board. Jobsgopublic is a job board for local government, charity and education Graduate Forward jobs board for grads interested in public affairs and communications. PubAffairs jobs board for public affairs, government relations, policy and communications vacancies. UK Parliament vacancies. National Centre for Social Research Britain’s largest independent social research organisation. Social Research Association for career opportunities in social research. Salaries can vary across departments and locations. Gaining work experience in local government and community organisations can provide useful insights into what it would be like to work in this area. Look out for these vacancies on the MyCareer and through your school placement programmes. It’s also worth looking at: Many government departments offer summer internships and can be a useful way to see if this type of work is for you. Parliamentors – get mentored by an MP if you see yourself working in politics after graduation W4MP – covers everything you need to know about working for an MP including information on internships Check out our work experience pages. There is a common misconception that all Civil Service jobs are based in London, but actually more than half are based around the country, for example Nottingham is home to the HMRC. This branch of the Civil Service employs around 4,000 staff and graduate opportunities are available as well as internships. More information can be found on the Tax Development Programme as well as the Civil Service jobs website. The recruitment process can be lengthy and include an online application followed by psychometric tests. The interview may include a presentation and situational judgement test in an assessment centre style. More information and ways to practice these can be found on our making application pages. They will be using their Success Profiles to assess your skills, behaviours and attitudes so it is worth making yourself familiar with this. For advice on how to apply to the Civil Service, what recruiters look for in applications, completing a written application plus preparing for interviews, check out the following: The Unofficial Civil Service Guide - sign up to download the guide The Civil Service is proactive around equality and diversity matters within their recruitment practices, and may have specific schemes to target these applicants. Many roles will require criminal background checks. They will require you to have the right to work in the UK and are unlikely to sponsor. Understanding the current issues and challenges facing government is important if this is a career you want to pursue. With the potential of MPs and governments changing fairly regularly this can be an environment that is forever in flux and adapting to differing political influences. Top tips: Follow the Civil service blog Follow government departments, local authorities, charities and community organisations on social media in your area of interest. Network to find relevant people for your area of interest, this can be a good way to find out if there are upcoming opportunities or ways you can get involved. You never know what it will lead to, but it will certainly increase your understanding of the realities of the role and valued skills. It could be useful to look at the work of Political Think Tanks in your area of interest, a list of which can be found on Smart Thinking Many news outlets such as the BBC and newspapers such as the Guardian or Independent offer updates on changes to public policy. Matthew Padgett, PhD Neuroscience graduate Read Matthew's story Civil Service careers Civil Service blog Civil Service Fast Stream Prospects - Civil Service administrator Prospects - Civil Service Fast Stream Civil Service statistics Local government and social research career paths pages telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}