{
    "url": "https://www.nottingham.ac.uk/careers/employers/profile/ambassadors.aspx",
    "content": [
        {
            "p": "Together with the Students’ Union, we want to encourage you and your student brand ambassadors to work closely with us to effectively promote your internship, placement and graduate opportunities to our students. These guidelines aim to help your student brand ambassadors perform their role effectively and encourage collaboration between them, you as their employer, our team and the Students' Union. Working with our team and the Students' Union to raise awareness about the opportunities on offer with your organisation is an excellent way for student brand ambassadors to gain experience in partnership working, develop commercial awareness skills, and planning and delivering events. For those ambassadors registered with us, we will encourage them to take part in the Part-time Work module of the Nottingham Advantage Award, our employability award, to gain additional credits alongside their degree programme. Our Recruiter Services team is ready to answer your questions. +44 (0)115 82 32233 Students' Union team Email Students' Union To fall in line with the university’s environmental and sustainability policy, we advise against handing out printed promotional material on campus. The Sponsorship & Fundraising Team within the Students’ Union offer the facility to help with brand awareness for recruiters through social media promotion. Please contact them for a media pack. Student brand ambassadors should not send out emails relating to their role to fellow students from their university email account. If you want to raise awareness of your brand amongst the University of Nottingham student population, stand space is available in a number of locations across University Park, Jubilee and Sutton Bonington campuses. To book promotional stand space: Please note that this is a chargeable service and you should contact each representative for costings. If you want to hold a recruitment activity, please talk to us about our recruitment fairs or employer presentations programme. Recruitment activity such as a presentation or careers fairs are excellent ways in which to identify potential candidates for internship, placement and graduate opportunities. There is a charge for these services. Please contact our Recruiter Services team for costings. Student brand ambassadors are allowed to post internships and graduate opportunities onto our job board, My Career, free of charge. A company email address will be needed in order to register an employer. To find out more, visit our advertise your vacancies section. August 2022 telephone: +44 (0) 115 82 32233 fax: +44 (0) 115 951 3679 email: recruiterservices@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}