{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/first-weeks/authenticity-at-work.aspx",
    "content": [
        {
            "p": "Being your authentic self at work is important to feel comfortable and enhance your individual well-being, maximise your impact in your work and help others feel comfortable being their authentic selves. This year, we introduced our equality, diversity, and inclusion (EDI) focused 'Authenticity at work' offer, designed to provide you with a platform to engage with professionals across various sectors. Our aim was to address important topics such as coming out at work, navigating microaggressions, allyship, and promoting inclusive practices by engaging with professionals with experiences in these areas. Below you can view interviews with the speakers answering questions on their chosen topics. If you need support regarding any of the topics discussed on this page, please visit the university support page I started within students' unions when I was elected as Vice President Activities and Employability at London South Bank SU after I graduated. I have been fortunate to work at a range of students' unions including Brighton, Warwick and Newman. I am currently the Student Voice Manager at UoNSU. I also run a monthly webinar series with Unitu around student voice and student engagement. I have recently completed my MA in Student Engagement in Higher Education and published articles for Wonkhe around student engagement. With a commitment towards fostering meaningful equality, diversity and inclusion in the workplace, I have had the fortune to work in a number of impactful roles. After graduating with an International Relations BA from the University of Nottingham Malaysia, I began as a Protection Assistant with the UNHCR in Malaysia, where I provided support and counselling to asylum-seekers and refugees, in addition to fostering inclusivity as a member of the Equality, Diversity, and Inclusion Working Group. Moving to the UK, I joined the University of Nottingham as a senior administrator in the Assessments Team, while helping to promote EDI efforts within the RAA Equality, Diversity, and Inclusion Working Group. Currently, as a residential experience officer, I co-ordinate events, offer pastoral care, and help amplify LGBTQIA+ voices as one of the Co-Chairs of the University's LGBTQIA+ Staff Network. By working in tandem with the community, as well as applying my lived experiences as a trans woman from Southeast Asia, I aim to create a university where our LGBTQIA+ community can thrive. I am Meredith Coney, Head of Education and Student Experience in the Faculty of Engineering, leading a team that supports the student journey from admissions to graduate employment. I joined the University of Nottingham in December 2023 after 17 years at Loughborough University. I studied a BA and MSc in Archaeology at the University of Leicester, while studying I had a part-time job in the Distance Learning unit of my department and enjoyed supporting people from all over the world to undertake their studies. When I graduated, I didn't have a clear plan on what I wanted to do, but loved working at the University and applied for a temporary role at Loughborough University while I worked out what I wanted to do. A temporary role quickly became the start of a career in higher education management, not a field I had ever considered before but which I love! I am passionate about equity, diversity and inclusion, in making our university accessible to all, to ensure that our students all feel like they can make the most of their university time and go on to a successful career they are passionate about. I've worked a variety of jobs, from a 5-star golf course waiting tables for celebrities like Chris Hemsworth and Len Goodman, to switchboard work for Audi and health and safety in automotive engineering. My role at Valpak means I interact with all members of a business all the way up to directors. I work with businesses to ensure they›re compliant with UK environmental regulations and suggest other services that can keep their business compliant. Valpak is the UK's largest compliance scheme, working with over 4000 businesses since 1997 including household names such as Coca-Cola and Tesco. I want to see more black talent in leadership positions and further education. I'm passionate about many areas of EDI, from race and religion to disability and sexual orientation. I am a Business Psychologist that currently works as a Global Performance Consultant within the Tech Industry. I have worked in different businesses, but my roles have always been focused around how we can use Psychology to get the most from and for our people - from construction to casinos, people are what make a business what it is. LGBT+, Women and Neurodiversity at work. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}