{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/medicine/career.aspx",
    "content": [
        {
            "p": "It’s important to balance your time spent studying with focusing on your own personal and professional development. A range of activities outside of your course can develop your transferable skills, provide some relaxation time and support future applications. Medicine is increasingly competitive and medical graduates are finding that having excellent academic and clinical skills may not be quite enough to secure the specialty of their choice. You have the opportunity to develop yourself within both your pre-clinical and clinical years, as well as through extracurricular activities. Your career in medicine homepage Book an appointment Pre-clinical years This is an ideal time to explore what's available, get involved with societies and broaden your skills with work experience or summer placements. As you become immersed in clinical practice you will start to get a better idea of the different areas of medicine. You will have opportunities to talk to doctors at all levels to gain an insight into their daily routines and the pros and cons of their specialty. You could offer to undertake an audit to gain further insight into that area of work. During the Clinical Phase of your degree you will have the opportunity to go on placement in a specialty of your choice which may be overseas. You can use this opportunity to gain invaluable and different experience to further develop your skills. Making the most of your Clinical Phase. Hear from two F2 doctors, a fourth-year student and a consultant who offer advice about the importance of the Clinical Phase - how to build your CV, develop your self-awareness, network with colleagues and understand the demands of a specialty. Special Study Module(s) During your Clinical Phase you will undertake a number of Special Study Modules (SSMs). These are a great opportunity to pursue your interests, develop your research and presentation skills, and explore smaller specialties that you might not have encountered in earlier years. Pick from a list of specialties provided by the school ranging from surgery and emergency medicine to modern languages, across multiple sites. Medical student - selected components Final year elective While your final year elective gives you the chance to experience a specialty of your choice, it can also be a great chance to learn more about yourself and where you’d like to be in the future. Wherever you choose to do your elective make the most of the opportunity to develop your skills, knowledge and networks. Choosing elective Clinical Audits Clinical audits help to assess whether patients are getting the best treatment from their service and compare current practice with guidelines for improved practice. Getting involved in an audit can show your interest in a specialty and help build networks with senior colleagues. In applications for Specialty Training (and the Specialised Foundation Programme - SFP) there is an expectation that you will have carried out an audit. Getting involved in clinical audits As you progress through your medical training and career there will be numerous opportunities to compete for medical prizes and awards. Such competitions are generally held by medical research, training, specialty or associated bodies, by charities or by educational institutions with an interest in particular aspects of medicine. Awards and prizes differ in topic and type of award, as well as in the level of work and original research required. Some prizes will be well advertised through the Medical School, others will require more initiative to find. Here is a list of useful links, but do also talk to your tutors when looking for opportunities. Part-time work and summer jobs in any setting (not just healthcare-related) can provide you with opportunities to develop skills such as communication, organisation and leadership. It can also provide a valuable income, but be careful not to over commit yourself during term time. Advice from NHS Health Careers Apply to Unitemps, our recruitment service Volunteering can demonstrate and build a number of skills, as well as provide a feel-good factor during your studies. There are volunteer opportunities in healthcare and non-healthcare settings for a range of different interests and courses. The Student Volunteer Centre have a number of projects, and within MedSoc you may find other opportunities to volunteer your time and knowledge. Taking part in student societies, or undertaking a committee position can develop transferable skills such as time management, leadership and event planning. The Students' Union has more than 200 societies including MedSoc and sports clubs so there's plenty to choose from! Go to our events and medical societies It is important to identify what your out-of-curriculum activities have given you in terms of skills and experience. Capturing what you've gained from your experiences is helpful in building your self awareness which is the first stage of career planning. Being able to provide evidence of your skills and capturing this on paper is key for future training and job applications. Develop your leadership skills - NHS Careers website Personal and professional development - NHS Careers website Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. NHS Professionals (NHSP) employ a wide range of roles including nurses and midwives, doctors, allied health professionals, healthcare scientists, personal social services, and non-clinical. This session will be presented by the Recruitment Coordinators, Helen Brace, and Laura Meyrick, for NHSP. They will: Login to SharePoint to watch a recording of this event telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}