{
    "url": "https://www.nottingham.ac.uk/careers/students/international/uk-experience.aspx",
    "content": [
        {
            "p": "Work experience offers you the opportunity to not only develop your career skills but also experience the UK working culture. Whether you want to secure an internship, explore part-time work or engage with one of our work experience schemes we have the information and advice to help you. Work experience is an umbrella term that can include the following: It is important that you understand what your visa allows you to do so that you can articulate this to an employer. If you are enrolled on a full-time degree (and owning a Tier 4 student visa), you are allowed to work: Never underestimate the importance of your work experience. Any experience is valuable, even if unrelated to the sector or type of role you want to go into. Employers are interested in learning about the transferable skills that you will have developed. Never underestimate the importance of your work experience. Any experience is valuable, even if unrelated to the sector or type of role you want to go into. Employers are interested in learning about the transferable skills that you will have developed in your experiences. Absolutely. Employers are keen to hear about any experience, whether in the UK or outside, as long as you make it relevant to what you are applying for. Having worked abroad may even give you an advantage, focus on your unique skills and experience in the recruitment process! You may want to talk about: If you are struggling to make sense of your experience, book an appointment with one of our advisers. There is no ready-made list of opportunities so it will be up to you to research employers and opportunities. You can explore our website to find out more about sources of vacancies in the UK and where to find work experience for the type of degree you are studying or the type of career you want to go into. You can also explore Student Circus, a job listing service, which we subscribe to and is free to you. Student Circus advertises internships with UK companies that actively recruit international students. Also check out the webinar above about Student Circus to find out more. Login using your University of Nottingham email. Login to Student Circus In recent years we have seen a rise in the number of external organisations advertising themselves as experts in careers and employability advice, particularly around supporting students from specific countries. They often charge thousands of pounds for their services and we have received feedback that students often feel pressurised to pay for these services in order to secure a job. Prior to entering into any agreement, we would advise you to contact us and check what support and resources are already available to you without charge. If we aren’t providing a resource which you think would be useful, let us know and we will endeavour to provide it or a suitable alternative. If after doing your research you think you are getting something different or better from an external provider, you are free to make the decision to use them. We are happy to discuss any support you are offered from an external provider to help you make an informed decision. You don’t need a National Insurance number to look for jobs, but once you are offered a post you must telephone the Contributions Agency on 0845 6000 643 to apply for it. You will be invited to an interview held at your local Jobcentre Plus office. It usually takes about six to 12 weeks for your application to be processed, but you can still work during this time. Inform your employers as soon as you have been notified of your permanent National Insurance number. To find out more, visit the government website telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}