{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/medicine/guidance.aspx",
    "content": [
        {
            "p": "Careers guidance is the process that enables you to make a well-informed, realistic decision about your future career, now and in the future. We work with the School of Medicine to support medical students to achieve their ambitions. Your career in medicine homepage Book an appointment You may find it useful to talk to a careers adviser for a number of reasons. It would be pretty unrealistic to have your whole medical career planned out from your first day of University. However, discussing your career ideas and thoughts around specialties and other options with an impartial careers adviser can help bring some clarity to your path. A career in medicine is, like any other professional career, very competitive. Talking with a careers adviser can help with your planning and preparation for the future and may help you get ahead. The skills necessary to plan your career development in a coherent manner are learned like any other. Your careers adviser can talk you through a variety of different career planning models to help you make an informed decision about your future and how to get there. You can discuss anything career-related in your appointment. Below are just some of the typical topics which are covered. You may be nearing the end of your course and trying to decide which specialty career path to follow. While the earliest you need to make this decision is the second year of your foundation training, a careers adviser can help you determine what’s most important to you and help you explore the range of possibilities open to you. If you need help with your application form or interview for the Academic Foundation Programme (AFP), come and see us. We can help you prepare by reviewing and advising on your written application and provide you with interview practice and tips. There may be times during your course when you question if you have chosen the right programme of study or the right profession. Throughout our lives and careers it is perfectly natural to have doubts or to check the path we are on is the right one. You may find it helpful to talk to one of our careers advisers who can support you during such times. Whether it’s identifying what’s really important to you, exploring your options or helping you make a decision, we will listen and provide advice and guidance. Are you are considering a career outside medicine either before or after completing your BMBS degree? Do you want to explore options for diversifying or are you considering taking a break from medicine? Again, you may find it helpful to discuss your options and explore a strategy for decision-making with a careers adviser. We can point you to a number of resources which will help you put together a great CV. We also offer 15-minute appointments where you can have your CV reviewed by a member of the careers team. Your careers advice appointment is a chance for you to speak with an impartial careers professional about your ideas, concerns or queries. It can be worthwhile doing a little preparation before you attend your appointment so that you get the most out of your time. Think about the reasons you booked the appointment and what you are hoping to achieve. You may want to make some notes to bring to the session to discuss with the careers adviser. Don’t expect a quick fix. You should be prepared to carry out some research and action between guidance sessions. Many careers guidance issues are only sorted out after a period of time and effort on your part. No part of the guidance session will be disclosed to any other party without your prior consent unless there are potential patient safety issues. Appointments are offered at regular times throughout the academic year and can be booked via My Career. All of our advisors are trained professionals with years of experience in Higher Education careers. We are not clinicians. Appointments are held in our careers office in the QMC Medical School and in the Life Sciences Building at University Park. Appointments can also be held at Derby Royal Hospital on request. We can arrange appointment times around your schedule if you are on placement and we offer appointments in person, by video or phone call. Appointments booked through My Career are normally 30 minutes long. This depends on you. Some students find that their needs will be met in one session but you can attend as many guidance sessions as is agreed necessary. Your adviser will be happy to discuss your options in your appointment. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}