{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/assessmentcentres/presentations.aspx",
    "content": [
        {
            "p": "A presentation task is an opportunity to show assessors that you can: It’s possible to prepare, even if the topic won’t be revealed until the day of the assessment centre. Get familiar with the building blocks of a good presentation on this page before heading to the case studies section for specific advice on how to tackle scenario-based presentation tasks. Book an appointment with an adviser Choose an application and interview support slot. Like most skills, presenting gets easier with practise. Hone your skills in front of a supportive audience, with the: Public Speaking Society When our people present technical content to customers, it's important that everyone in the room understands. One purpose of the presentation task at our assessment centre is therefore to test candidates' ability to make the complex accessible. The best presentations that we see demonstrate that candidates have actively engaged with the subject matter and thought about how the knowledge and skills that they’ve gained – both on and off their courses – could be applied to real-world scenarios. Nicola Wild, HR Business Partner at Romax Technology This simple framework can be applied to almost any presentation brief: Expect to be asked questions about the content of your presentation. Assessors want to hear you justify your logic, but be careful not to appear totally inflexible. If new information comes to light, you should be prepared to alter your position. Graduates First has some useful resources to help with your preparations. There are short videos to help you navigate the process of preparing for a presentation exercise including tips and guides. Students - register for free access using your UoN email address Alumni - email our team for free access This isn’t about ‘wowing’ with TED-worthy presentation skills; focus on doing the basics well: Luke Lynch, Employability Education Projects Officer, gives his top tips on how to deliver an effective presentation during the recruitment process. Designing effective visual aids takes time (a scarce resource at assessment centres). If you are using PowerPoint, a flip chart or a whiteboard, here are our top three tips: Use the How To: Analyse, Hone and Rehearse Your PowerPoint presentation from the University's Digital Transformations Hub Watch this video for PowerPoint design inspiration telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}