{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/natural-sciences/index.aspx",
    "content": [
        {
            "p": "Many people pursue a degree in natural sciences as a way of following their broad scientific interests while keeping their options open regarding further specialism of study and eventual employment. It’s certainly true that a natural sciences degree will provide you with a broad ranging scientific education. It will equip you with scientific and technical skills as well as professional skills to find employment in both scientific and non-scientific sectors. The specific skills and knowledge gained during your degree will depend to a large extent on the pathway you choose. However, in general terms, you can expect to gain the following key skills: Due to the wide range of potential career options and sectors open to you as a natural sciences student, it is important to start to consider your options early on in your course. Look for opportunities to gain relevant experience and skills within your areas of interest whether this is in a scientific or in a non-scientific sector. Summer internships are also a great way to gain experience, whether in science or non-science based roles. Find out more on the Natural Sciences' Placements webpage The Nottingham Internships Scheme, for example, offers a range of local paid internships with companies in Nottingham, and other sources of vacancies are listed on our work experience pages. Find out more about the Nottingham Internship Scheme Summer research placements are available through the schools you are connected to. Talk to school staff to find out more. There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, while developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Students in Classrooms You can now undertake an optional placement year as part of your degree at the end of your penultimate year of study. The placement can be aligned to your degree discipline or related to your career aspirations. Speak to a career adviser or your school for more information. Optional Placement Year Get involved in activities including volunteering and societies such as NatSciSoc. Students' Union Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs Nottingham Advantage Award Studying natural science at university lends itself to a wide variety of future career paths, including undertaking further study to specialise in a particular area of interest. According to Graduate Outcomes from 2016 to 2021, natural science graduates have gone into the following industries: Typical employers have ranged from NHS Trusts, Experian, JP Morgan, Sky, AON and BAE Systems. Read about Emma's move into IT Read about Lydia's move into the NHS Further study can be used to develop your understanding of a specialist area or to gain new skills which allow you to supplement your existing knowledge for a specific career. This can include courses like the Postgraduate Certificate in Education graduate entry to medicine, law or veterinary medicine and master's courses. PhDs have been undertaken in biology, physics, math, biochemistry and genetics. In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar Explore the career resources offered by the professional bodies linked to your areas of specialism: British Psychological Society Council for British Archaeology Institute of Mathematics and its Applications Institute of Physics Royal Geographical Society - using your geography degree Royal Society of Biology Royal Society of Chemistry Prospects - what can I do with my degree? Our Career paths pages UoN Natural Sciences Careers telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}