{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/publicsector.aspx",
    "content": [
        {
            "p": "Are you interested in working for the public sector? It is a sector that has a direct impact on people’s lives at a local or national level. The public sector is, in short, organisations that are controlled by the state as opposed to corporate business or the charity sector. This sector is made up of a large number of organisations, from the NHS and Civil Service to the BBC and accounts for just over a sixth of the workforce in the UK. As a result the jobs involved are wide ranging, as are the organisations. Return to jobs list Book an appointment to discuss your thoughts Prospects has produced an overview of the public sector. Within this overview are employers and roles, as well as key issues in the public sector, such as: As the work of the public sector is wide-reaching so are the organisations. The NHS, for example is a very different working environment to the Civil Service. Staff working in the sector often state that wanting to make a difference is a key reason for their choice of organisation. Other advantages of working within this sector include good work-life balance, an often varied workload and opportunities for breadth and scope of roles. However, with budget cuts to the sector and being at the mercy of the elected government; this can be an environment that is also forever changing and adapting to differing political influences. The pay can sometimes be lower than the private sector and there is generally a more hierarchical structure than in some companies. Additional challenges currently facing this sector are changing political landscapes: Brexit, for example, will make for an altered public sector. Keeping abreast of changes relating to Brexit may prove useful for applications and interviews for public sector roles. Many news outlets such as the BBC and newspapers such as the Guardian or Independent offer updates on changes to the wider sector. Updates on individual divisions may be available on dedicated sites such as Times Higher Education (THE) or organisational pages such as www.gov.uk The BBC is the world’s leading public service broadcaster. With coverage of both network and online radio and television there are a range of jobs in broadcasting, journalism and media as well as business roles such as Finance and HR. More information on careers at the BBC. The roles within this are wide-reaching, ranging from teachers to administrators and managers. Often you can specialise in supporting a particular age group or discipline and many roles combine a mixture of front-facing student activity as well as administration and/or management. Explore the sector further: Finance divisions occur in local authorities, government, educational institutions, health services and can shape policy locally and nationally. More details about finance can be found on our Accounting and finance page. CIPFA – The Chartered Institute of Public Finance and Accountancy is a professional body for staff who specialise in public finance. Their qualifications, training and resources support those who want to work in a predominantly public sector service. The roles within government can be varied. Often graduates will look at possibilities like the Civil Service Fast Stream (with 15 specialisms) but many graduates will also apply for jobs directly into the Civil Service. There is a common misconception that all civil service jobs are based in London but actually more than half are based around the country. Roles range from administration and general management, to specialist roles in the FCO (Foreign and Commonwealth Office) or Government Economic Service (GES). There are also many opportunities within local government such as the National Graduate Development Programme (NGDP) for local government, or similarly directly within the local government organisations or funded organisations such as Transport for London. The NHS is a huge employer in the UK – approximately 1.5million people are employed by the service. The roles include patient-facing roles providing healthcare directly to members of the public as well as managerial and operational roles. The NHS website has a huge amount of information including a Find your Career tool and Exploring Roles. There is a separate page for information on the NHS Graduate Scheme. If you’d like to use your technical skills but look for a job that has constantly changing projects and involves adapting to new circumstances, then look at IT roles within the public sector. Education institutions, the NHS, BBC and other public sector providers are keen to attract graduates with technical knowledge and capability. In addition cyber security is a huge issue for the public sector and employers such as GCHQ are often advertising training roles. For more information please also see Target Jobs for IT roles in the public sector as well as the general sites below. As the public sector is so vast internships or work experience may allow you to try different roles or organisations to find what may best suit you. There are lots of opportunities for short or long-term placements and these can be primarily found on organisation’s websites. See below for further details. Some of the organisations have graduate schemes that run between one to three years and offer rotations around different departments and roles. These are listed on organisation’s web pages but include the Civil Service Fast Stream, NHS management graduate scheme and higher education’s Ambitious Futures. See below for more details. There are also a wide range of entry-level graduate positions available. These are often less competitive but can offer valuable experience within the departments and have the benefit of being directly aligned with your own interest and available at shorter notice and at different times of year. If you are looking for more generalist roles there is rarely a specified subject that you will need to have. If you are, for example, looking for a more specialist role such as in finance, then there may be preferred degrees that complement the skills required. Firstly, employers will look for a commitment to the organisation and where possible, an alignment of values. This could be portrayed by previous work experience or volunteering, as well as demonstrating an understanding of the sector. With regards to skills, these are wide-ranging and often dependent on role. Skills that are common to most roles are communication, resilience, empathy, organisation, flexibility, team working and enthusiasm. Often these traits will help support the collaborative working environment that is often found in public sector organisations. Not only will you often be working within a large organisation, but clients could be based in public or private sector organisations or you could have a public-facing role. A highly organised approach to work alongside excellent interpersonal skills will ensure success in this area. There are a lot of public sector roles available in Nottingham and the surrounding areas. NHS: With two large hospitals in Nottingham, including the East Midlands Major Trauma Centre based at QMC, there are numerous roles available. Both frontline healthcare workers and also administration and managerial roles. Additionally there are large hospitals in Derby, Lincoln, Mansfield and Leicester as well, alongside smaller community centres across the East Midlands region. For more information please visit the NHS jobs website. Education The opportunities to work within Education in the surrounding area are numerous. From primary, secondary and academy education through to further and higher education. A number of roles are again available from teaching and research staff through to administrative and managerial. Graduate schemes exist in this area such as Teach First. Other roles may be found on council websites or the host institution. HMRC This branch of the civil service employs around 4,000 staff in Nottingham and graduate opportunities are available as well as internships. More information can be found on the Tax Development Programme as well as the civil service jobs website. Local Government There are numerous local governments in the area with a range of opportunities in areas such as education, housing, environment and administration. Some local councils will also have their own graduate schemes such as Nottingham County Council’s Graduate Development Programme. For more information please check individual council’s websites or national sites such as local government jobs. Police For front-serving police staff there is a national graduate programme, Police Now, that includes Derbyshire Constabulary. For other roles it may be necessary to look at national sites such as Blue Line Jobs or individual forces such as Nottinghamshire Police. Get into teaching TES Teach First Higher education and further education jobs Targetjobs Accounting and finance page The Chartered Institute of Public Finance and Accountancy (CIPFA) Civil Service Fast Stream Civil Service job site National Graduate Development Programme (NGDP) Nottinghamshire County Council’s Graduate Development Programme Transport for London NHS website NHS Graduate Scheme Crown Prosecution Service Law Careers GCHQ - Early Careers Police Now Unlocked - probation service telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}