{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/finding-a-job/choosing.aspx",
    "content": [
        {
            "p": "Taking the time to choose the right role and right employer for you will get your career off to a great start. We have answered some common questions and provided links for further support so everything goes smoothly. Return to the Vets homepage Talk to a member of our team When weighing up your options and deciding whether a practice is right for you it’s worth looking at the whole picture. Salary will be important to you, but in order to improve on your day one competencies you will want to know how a practice will support your development, so look at the CPD package available. It can be tempting to accept the first job that you are offered, but choosing the right job for you is really important so do take time to consider what you’re looking for. Glassdoor - How to handle multiple job offers Make sure you are given a written contract of employment stating the precise conditions of your employment before you accept a job. In the past some veterinary surgeons have not received a written contract and this has left them exposed. BVA - Employment Hub (resources and guides) for veterinary staff The Veterinary Graduate Development Programme, or VetGDP, is the structured programme of support all new graduate vets will participate in once you start your first graduate veterinary role. The programme is designed to provide support from a trained adviser within the practice to help you to develop professionally and build confidence. All vet practices recruiting new graduate vets need to have a trained VetGDP adviser. RCVS - VetGDP Once you are out have graduated and are working in a practice ensuring that you have a good support network will help you to navigate the first few years as a vet. Keep in touch with your peers from Nottingham as they will be going through similar experiences and could be of great support even if you’re no longer in the same location. We will also continue to offer support to you after you graduate, so get in touch. BVA website - Read Jamie's blog: My experience of starting in practice Nottingham alumnus Tom talks about professional development, gaining experience in a number of practices, the breakdown of his work and the importance of taking care of your mental health. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}