{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/natural-sciences/case-studies.aspx",
    "content": [
        {
            "p": "Graduate software developer at Romax Technology I’ve recently started as a graduate software developer at Romax Technology. The software being developed is computer-aided engineering simulation software so I need to apply the core mathematical and scientific principles I learnt over the course of my degree to implement new features in the software. At the moment I’m following a training programme to get up to speed with the programming languages Romax uses and to learn the software development process. Although I can’t contribute to projects just yet, I’m fully involved in the team and attend daily scrum meetings where we provide progress updates and plans for the day. There are also regular sprint planning meetings where we plan what features need to be added or bugs that need to be fixed during the next two weeks. I was always interested in science and maths at school which led me to choose to study natural sciences at the University, specialising in physics and maths. I was introduced to coding in my first year often using Matlab software to solve equations that couldn’t be solved analytically or to interface to instruments in physics experiments. I realised that I really enjoyed being able to use code to simulate the concepts and physical systems I was learning about in my modules so I decided to go into software development involving scientific applications. I didn’t have specific work experience in software development, but I took the opportunity to work for a social enterprise through Enactus Nottingham, which inspires young people to join the technology sector by teaching them to program in Python. Don’t worry if your knowledge and experience doesn’t completely line up with the criteria on the job advert. Having a wide knowledge of different coding languages will be useful but you don’t necessarily have to be proficient in the languages a company uses or the ones they list in the job advert or even the software development process. As long as you can show that you are enthusiastic about coding, the work the company does and most importantly that you have a desire to keep learning. Trainee clinical scientist, NHS Scientist Training Programme I am currently training to be a clinical scientist specialising in cancer genomics through the NHS Scientist Training Programme (STP). The main role of a clinical scientist in genomics is to analyse data from laboratory tests performed on patient samples and report the results back to clinicians. As a trainee, I am learning about a variety of genetic conditions and tests while completing my work-based training portfolio. I also have the opportunity to spend time in other departments to understand the overall role of healthcare science in patient care. As part of the STP, I am also studying part-time for an MSc Clinical Science at university. My natural sciences degree provided me with an essential foundation in molecular biology and genetics, which I am building upon with more specialist cancer genomics knowledge. The analytical skills I developed during my degree are invaluable when analysing genetic test results. The ability to critically evaluate scientific literature is another key skill I use in my role. I graduated from the University of Nottingham with a first class MSci Natural Sciences degree, during which I studied both biological sciences and chemistry. In my fourth year, I completed a research project investigating genes involved in myotonic dystrophy type 1. At university I was president of Revival Gospel Choir and spent a semester abroad in Melbourne, which helped me develop transferable skills such as teamwork, leadership and resilience. After graduating, I contacted a local NHS genetics laboratory and arranged an internship. During my internship, I booked patient samples into the laboratory and checked the concentration of DNA samples. This gave me an insight into the workings of an NHS lab and the types of genetic tests that are performed. Do your research on the programme and the particular specialism you are interested in, as the role of a clinical scientist varies greatly between disciplines. The National School of Healthcare Science (NSHCS) website provides information on the STP and a list of specialisms available ranging from audiology to medical physics. The STP Perspectives blog is a great resource to learn more about the programme from a trainee’s perspective. I would recommend gaining some experience in a clinical laboratory to gain a greater insight into the role and strengthen your application. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}