{
    "url": "https://www.nottingham.ac.uk/careers/employers/sme/index.aspx",
    "content": [
        {
            "p": "Internships and business projects provide small to medium-sized enterprises (SMEs) with the opportunity to bring in additional resource, access new skills and expertise, and create a talent pipeline for future hires. Our expert team will work with you to understand what scheme best suits your business need and to discuss funding options available. Full support is provided for recruitment and selection processes to ensure you bring in an intern(s) or project team that will achieve the desired outcomes for your business. SMEs are companies consisting of fewer than 250 people and with a turnover of less than 50 million euros or an annual balance sheet not exceeding 43 million euros. Please note the Nottingham Internship Scheme will not take place in spring 2025. Nottingham Internship Scheme Nottingham Consultancy Challenge Why not join the hundreds of small medium-sized enterprises (SMEs) that have employed our talented students and graduates through the Nottingham Internship Scheme? The Nottingham Internship Scheme (NIS) is a well-established and popular programme amongst our students and recent graduates. Internships provide them with important work experience, improved employability, and a breadth of new skills. SMEs can make use of the NIS to fill a short-term vacancy or a permanent role following the initial internship period, or to complete a defined piece of work or a project with funding available to support you through the process. As an SME the benefits of taking part include: The NIS takes place twice during the academic year, once in spring and once in the summer. The timelines will differ slightly each academic year. Spring internships are open to current students from widening participation backgrounds and summer internships are open to all current students and recent graduates. We can fully or partially fund the salary of up to two interns per organisation, as long as they are paid at least the National Living Wage. Do you have a business idea, project, or problem that you don’t have the time or resources to work on? Through the Nottingham Consultancy Challenge, you could benefit from free business support from University of Nottingham students. Mary talks about the Nottingham Consultancy Challenge she set a group of our students, the outcomes and the value the students have added. The Challenge is designed to simulate a real business relationship between student consultants and their client: you. Students are guided on how to work with professional clients, and this direct interaction is a key incentive for students volunteering their time. The level of involvement varies to accommodate your availability and interest, but as a minimum a representative from your organisation would be available for: Pre-Challenge During the Challenge We assign each project as a ‘Challenge’ to a small group of students who will work on it and deliver a presentation and report over a six-week period, contributing between six-eight hours each per week (including meetings and university-led skills development activities). Students and organisations will collaborate remotely, using video call and online working tools such as MS Teams. You will need to commit to virtually meet with the students once a week over the six weeks and provide feedback to the student group on how well they responded to your project brief. The Challenge will be concluded with a written report and presentation, which will be delivered to you via video call. Students are supported throughout the Challenge by the University to develop and use skills vital to great consultancy work: customer service, professional communication, group-working and creating and delivering excellent presentations. As the client, your first point of contact will be with your student consultancy group, but the university is on hand to offer support and advice. Complete our form or contact Keaton directly to find out more about the Nottingham Internship Scheme and Nottingham Consultancy Challenge. By phone 07970 106213 or email telephone: +44 (0) 115 82 32233 fax: +44 (0) 115 951 3679 email: recruiterservices@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}