{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/medicine/events.aspx",
    "content": [
        {
            "p": "One of the best ways to explore your career options as a medic is to talk to doctors from the specialties in which you are interested. As well as during your clinical placements there is plenty of opportunity to hear from doctors about their specialism at events organised by Nottingham Medical School’s careers societies. You can find out about the challenges and the rewards of a particular area of work and gain tips about the training pathway and how to best prepare yourself for a career in a specialism. In addition to events organised by the different Medical School societies, you can often find conferences and other relevant activities provided by Royal Colleges. Your career in medicine homepage Notts MedSoc is the umbrella society for students studying medicine. Underneath that umbrella are over 50 different career and sports societies you could join. Getting involved in a society is a way to develop knowledge and skills for future roles and to build your CV for electives and beyond. There are a number of career societies ranging from dermatology to general practice and public health. Each society will put on a variety of different events throughout the academic year. Events might include talks hosted by consultants or trainees in different specialty fields, revision sessions, networking opportunities or other social activities. Attending these events could give you an insight into the area you might pursue in your medical career and also gives you the opportunity to make contact with students with similar interests in different year groups. If there isn't a society you're interested in then you could consider forming a new group under the MedSoc umbrella. To find out more about MedSoc and the affiliated career societies visit the Students' Union's website. Here are some of the career-related societies available: The Academy of Medical Royal Colleges (the Academy) is the coordinating body for the UK and Ireland’s 24 medical royal colleges and faculties. They ensure patients are safely and properly cared for by setting standards for the way doctors are educated, trained and monitored throughout their careers. The royal colleges and faculties have a number of events throughout the year to help medics with their continuing professional development. Some of them will be suitable for students at medical school, while others may be for more experienced professionals. The Royal Colleges Royal Colleges in Scotland and Ireland Faculties telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}