{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/economics.aspx",
    "content": [
        {
            "p": "Studying economics at the University provides you with a firm foundation for your future career. Economics as a subject is valued by employers in many sectors and our graduates do especially well in the economics and financial sector. 94.5% of graduates* leaving economics courses in the 2016/17 academic year secured work or further study within six months of graduating. 16% of economics graduates* from the 2016/17 academic year enrolled in further study within six months of graduating. Our graduates are very successful in accessing taught and research opportunities, especially in aspects of economics, finance and management. *UK full-time first degree graduates seeking employment or further study. Book an appointment or attend a drop-in Check out our careers events In addition to your subject knowledge your economics degree equips you with key skills valued by employers: Economics students graduating in the summer of 2016 faced a very competitive market and a high standard of applications. Approximately one third of large recruiter opportunities are filled by graduates who have already worked for the organisations through internships or placements. Gaining relevant experience during your studies has an increasing impact on success in the recruitment process. Our economics graduates continued to be successful in sourcing professional, well-paid positions in major companies and organisations. Top 10 companies employing our graduates Our economics graduates secure professional positions across a diverse range of employment sectors, but the key sectors of employment for our graduates are: There are many ways that you can develop your skills to support job and course applications in the future. The School of Economics has some excellent opportunities for you to participate in skills sessions, presentations and lectures about a range of opportunities and specialisms. You also have access to Bloomberg terminals if you are interested in Investment Banking options. In addition to attending these sessions or accessing the available Bloomberg terminals you can also develop your employability by participating in some of the following activities. Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Faculty of Social Sciences - Placements Programme Work experience - What, how and when? We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge The Nottingham Advantage Award offers interesting extracurricular modules to develop your employability. With over more than 300 modules across our three campus in the UK, China and Malaysia. As an Economist you will also take an integrated NAA skills module in Year one to get you started. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. For example, Foodprint. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! As an economist you will have membership of the Nottingham Economics and Finance Society (NEFS) and there are many others that may be of interest. Students' Union Undertake an exchange semester in another country and broaden your horizons. Talk to your tutors and find out more about the programmes available from the International Office. Exchange programmes Many graduate recruiters use psychometric tests during the recruitment and selection process. They are common across all sectors and career fields. Practise will really help your performance. Digital skills are essential in many career fields including advertising, publishing, marketing and general commerce. They range from social media to coding and will definitely enhance your employability. Explore work experience in a remote setting through organisations who offer virtual or simulated activities. There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Becoming an economist More graduate careers Royal Economic Society telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}