{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/finding-a-job/options.aspx",
    "content": [
        {
            "p": "Return to the Vets homepage Some smaller practices only recruit a new graduate when a position becomes available. Therefore, many graduate vet roles are advertised from late spring, during the summer and after graduation. So don’t panic if you haven’t got a job lined up before you graduate. Larger organisations have established graduate programmes that can recruit up to 150 graduates per year. Many of these programmes recruit in late winter or early spring but some open as early as December in your fifth year. It is worth investigating the recruitment timelines of employers of interest so that you are ready when applications open. As well as using company websites, recruitment agencies and online jobs boards, remember to make the most of your own contacts. If you have made contacts through conferences, events or other experiences, use these connections to find out who is hiring and to let them know about your situation. If you have spent time in a practice that you would like to work for, use your initiative and contact the practice directly. Pick up the phone or send an email with a copy of your CV to ask about opportunities. Some roles might not be advertised but employers would welcome a new enthusiastic member to their team. Your EMS experience can play a positive role in your job-hunting, but it doesn’t need to limit your options (see below). Please note this is not an exhaustive list of companies. Log in to explore all vets jobs No. We asked several veterinary practices and groups this question and all those who responded said that they are very happy to receive applications from students, or new graduates, who have not seen practice with them previously. You can always ask to spend time in the practice as part of the interview, or even before you accept an offer so that you can be confident that it is the right practice for you. There are, however, some benefits to completing EMS with a practice that you are interested in applying to should it be possible for you. You will get to know the practice, the team and know that you are likely to enjoy working there, and the practice will know you better from that experience than they would a few hours at interview. Matt talks about how the EMS can help student vets decide where they would like to work and what he looks for in applicants during the recruitment process. After your final exams you might want to take some time to recharge your batteries before starting your first graduate role. For some an extended break of a few weeks or months might be needed, while others are keen to start straight away and for a few a much longer career break might be needed. If you are considering taking a break here are a few things to consider. Information on taking time out telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}