{
    "url": "https://www.nottingham.ac.uk/careers/students/work-experience/what-can-i-do/internships.aspx",
    "content": [
        {
            "p": "Internships are one of the most popular ways students look to gain work experience. They usually take place in the spring and summer vacation periods, or after graduation. Internships can last between four and 12 weeks. You may also hear the term 'spring weeks' and these are short periods of work experience typically aimed at first and second year students. Book an appointment with an adviser Read Leonie's Blog: 'Internships: Search, Apply, Interview, Success' Internships are short periods of work experience usually taking place in the spring and summer vacation periods, or after graduation. They can last between four and 12 weeks. Students undertake internships during or after their first year and penultimate year of study. Internships cover a broad range of career areas and are offered by a wide range of companies from small companies and government departments to large multinationals. Graduate internships are usually offered from June onwards. Spring weeks and insight days are short periods of work experience typically designed for first and second year students. These opportunities give students an introduction to a job role, working environment and the culture of an organisation. In many cases employers will be using these schemes to ‘talent-spot’ individuals to join them in the future for summer internships, placement years or graduate roles. Spring weeks are common in industries such as accountancy, banking, consultancy, financial services and technology. Law firms use the term vacation scheme instead. You can expect to be involved in; short term project work, work shadowing, attending presentations, networking events within the organisation, social activities and more. Internships offer a number of benefits, including: Employers offer internships to find out what you're really like and many offer graduate jobs to those that have done well on their placement. Top employers say students are likely to be less successful during the recruitment process if they have had no work experience. If you are classed as a 'worker' while on placement, you should be paid at least the National Minimum Wage (NMW). These may be paid or have expenses covered however this does depend on the length of opportunity and the company. In certain sectors such as advertising and the creative industries there has been a tradition of internships being offered on an unpaid basis. For many students and graduates this can be the only way to get experience of working in their chosen career. Some see this as discriminatory for those who do not have access to the resources to support themselves during an internship period. The university's policy is shown below. Your employments rights and eligibility to receive the National Minimum Wage are determined by your employment status as either a worker, volunteer or employee. Read the University of Nottingham's policy statement Paid and unpaid internships Gov.uk Employment rights and pay for interns Gov.uk National Minimum Wage: work experience and internships Yes, the following schemes targeted at University of Nottingham students and graduates. Nottingham Internship Scheme - spring, summer and graduate internships Research Academy Placements and Internships - for postgraduate students If you want to undertake an internship at the end of your penultimate year of study (or third year if you are on a four-year course), then you need to start researching your options and applying at the beginning of that year. To save you time, we've put together a list of vacancy sources to get you started. Go to our list of vacancy sources Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}