{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/no-ideas.aspx",
    "content": [
        {
            "p": "Tired of people asking, what’s next and not knowing what to say? Does it feel like everyone has a plan apart from you? Don’t feel pressurised into making a rushed decision: even if you’re in your final year there’s time to work it out and you can use our services as a graduate. Don’t worry, you’re not alone - we’re here to help you every step of the way. First things first, to work out what jobs will interest you. You’ll need to know: You can then review job profiles to determine how well different jobs would suit you. Sounds like hard work? Try one or two of them and then come and talk to us. Use this worksheet to structure your thinking. You don’t have to do this activity alone – ask friends and family for their input. Download the worksheet You might be surprised by what they say: they may identify strengths that you hadn’t recognised in yourself or highlight areas that you haven't placed much value on. It's simple and at the end of the questionnaire you'll be matched to one of 16 personality types. 16 personalities Find out more about your 'personality type' - how accurate is it? Does this give you an insight into the type of job that would interest you? Now you need to use this list to explore different jobs to see how well they match? Not sure how to do this? Talk to an adviser and take the next step We've created a 30-minute interactive exercise designed to help you explore and understand why your values, preferences, interests, strengths, motivations are key to making good career decisions (and avoiding bad ones) now and in the future. Go to our self-awareness reflective exercise Once you've completed the exercise, chat through your thoughts with an adviser. Prospects Planner is an online questionnaire that asks about your interests, skills, motivations and desires. It then matches your interests to a wide range of graduate job profiles. The system lets you know how well you’ve matched up to the profiles based on your interests, skills, motivations and desires. Remember this is a guide or a starting point - it is not a definite list of the jobs you should or could do! Prospects Planner Cross off any jobs that don’t interest you and highlight say, five jobs that you’d like to find out about. Use the links to the profiles and explore. Once you’ve done this, are you going to keep them on the list? Not sure why some jobs are on the list? Not sure it's helped? Chat through the results with an adviser. Book an appointment Having a graduate job or career in place when you leave university is not the be all and end all. Read our blog to hear how Anna approached not having a job in place when she graduated. Read our blog: I Don't Have a Grad Job: Now What? We subscribe to Profiling for Success, an online tool to help you understand your abilities, learning styles, personality, motivations and interests. The company behind Profiling for Success is Team Focus. You can take all four questionnaires or take one or two and return later to do the others. You will need to make time to complete these tests - up to one hour. After completing a questionnaire, you will receive a detailed report. Again, these will take some time to read through and digest. Once you’ve read through the reports, why not book an appointment with an adviser to discuss the outcomes and your next step. Students login - use your UoN email address Alumni - email us to gain access Alumni - Business School postgraduate - email us Alongside considering your skills and interests, it's also a good idea to explore a range of career areas to get a sense of what might appeal to you. Using our A to Z of careers and sectors, there maybe some job areas that stand out for you sparking an interest and there may be others that you wouldn't consider at all. Take your time and don't dismiss any area if you're not really sure what it involves as it might just be perfect for you. You can also check out the job profiles on the Prospects website. Lots of students don't know what they want to do after university. This video will help you generate ideas and understand how we can help. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}