{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/finding-work-abroad/africa-and-middle-east.aspx",
    "content": [
        {
            "p": "This page lists selected resources for Africa and the Middle East, including sources of vacancies as well as information on living and working in particular countries. While we do not have country-specific expertise, our staff can offer advice on putting together an effective job-hunting strategy to seek work abroad. We subscribe to an international careers information package called GoinGlobal. You can access GoinGlobal free as a UoN student or graduate. GoinGlobal contains: Log in to MyCareer for access to GoinGlobal If you have any problems logging into MyCareer, please email our team. Use additional sources of vacancies and country guides selected by our staff for more information on job markets and opportunities abroad. Africa Talent Bank Vacancies and information for recent graduates Careers in Africa Vacancies with companies across Africa, Asia and MENA Cturtle Job opportunities around the world Foreign and Commonwealth Office (FCO) Listing foreign embassies and information on travel and visas GradlinkAfrica Job opportunities across the continent, with detailed information on Nigeria, Ghana and Kenya Gradlink GULF - for students and graduates from the Gulf region who are studying in the UK, providing links with employers and jobs in the area Jooble - Job opportunities across the world Prospects Career resources for South Africa and the United Arab Emirates Reconnect Africa Careers information, jobs, events and networking for African professionals TARGETjobs Career resources for Saudi Arabia and the United Arab Emirates Tony Elumelu Foundation Entrepreneurship Programme World Chambers Network (WCN) Database of chambers of commerce and boards of trade around the world For information on teaching in international schools worldwide, visit our Teaching page. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}