{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/museums.aspx",
    "content": [
        {
            "p": "The museum and heritage sector encompasses many elements from heritage sites and historic properties to local and national museums and collections. It covers all regions of the UK from a tiny museum to a huge national site, and archaeological sites. Whilst impacted by the pandemic, with everything now open for business, it is constantly evolving. This can mean evolving roles, for example, to embrace digitisation, creative ways to increase and diversify visitor engagement or bids for additional funding. Please also see our additional section on archives. Return to A to Z jobs list If you have questions about your plans, talk to a member of our team. Sector specific opportunities exist within curatorial, programmes, collections and archives, learning, outreach, visitor services and visitor engagement. In addition to these sector specific roles, you will find marketing, HR, finance and other central business functions within organisations. Job titles and their related job tasks can vary from one organisation to another depending on the size of venue, number of employees and the financial position of the organisation. Many roles that had been distinct jobs have merged and there is increased overlapping between roles; for example, a curator within a small museum may also be involved in front of house activity. In recent years, the arts and cultural sector has experienced cuts in funding; consequently, there are fewer paid positions available and those advertised are highly competitive. Many opportunities are also linked to projects and short-term funding cycles. Prospects provides a good overview of career opportunities within the museum and heritage sector and links to sector related job profiles. The main types of museums and galleries in the UK - national, local, university and independent organisations. National museums and galleries are funded by central government i.e. Natural History Museum whereas regional/local museums can be found across the country and are usually run by local authorities and a range of partners. Many universities are home to museums and galleries and maintain specialist collections for example, University Nottingham Museum. There are a variety of independent self-funded museums that range from small volunteer-run projects that open limited hours to ones that rely on a wide range of funding sources such The National Museum of Justice in Nottingham to large company-sponsored museums for example the Rolls Royce Heritage Trust or the Boots Archive collection. There are also umbrella organisations that are responsible for a number of sites such as the National Trust and English Heritage. The skills and knowledge required for working in the heritage sector will depend on the type of job you undertake, however, most roles require a variety of core skills that can be transferred between different jobs and organisations. The Museum Association identified some of the key skills and attributes required to work in the sector which include: flexibility and adaptable to change, having a customer focus and possessing public service values. Having the passion and enthusiasm to work within the sector was considered the most important attribute for future employees to possess. As with many industries, the museums and heritage sectors are undergoing a digital transformation; transferring exhibitions to online platforms and developing digital resources to increase accessibility. In addition, exhibitions are increasingly using technology to enhance visitor experience and increase engagement and interactivity. Many students interested in a career in the heritage industry choose to undertake postgraduate education in order to further develop their knowledge or skills in the area. In archives, this is considered essential. In other areas, it can add value to your CV and show a commitment to the industry but theoretical knowledge alone does not guarantee your first paid job. Work experience is essential and most graduates in this sector will have undertaken volunteering during their studies or alongside other jobs in order to get their foot in the door and develop a strong network of contacts. Most museums and heritage organisations will have opportunities to volunteer so have a look at individual websites. If you want to become an archivist, you will need to complete an Archives and Records Association (ARA) accredited postgraduate qualification – see our archivist page for further details. Graduate positions do not tend to exist within the sector and the first job for many graduates in the industry will be a direct entry level position, for example a visitors assistant to gain paid experience and provide a stepping stone onto other opportunities within an organisation. Some institutions, for example The Tate gallery, the National History Museum may offer internship opportunities but these tend to be the exception rather than the rule. Progression into management/professional careers may require post-graduate qualifications, however, for every manager who has further qualifications there is one manager who hasn’t. Industry organisations for example the Museums Association offer a range of short Continuing Professional Development (CPD) courses to develop knowledge and skills for those interested in entering the profession or for individuals currently working in the sector. Individuals from non-arts backgrounds are increasingly sought after as museums/heritage organisations try to attract talent from non-traditional backgrounds in order to diversify and meet the future needs of the sector and attract individuals with specific skills i.e. business and technology skills. You will often find employees who have previous working experience within the private sector who have transferred their knowledge and skills to the cultural industries. The current lack of diversity within the sector is an issue that the industry is taking steps to address both in terms of creating a more diverse workforce but also ensuring the services provided are accessible and representative of their local communities and current/future customers. The same is true of roles in conservation. See the career profile on conservation on the Prospects website As mentioned above, there are many opportunities to undertake volunteering positions within museums and places of heritage and most organisations will have a section on volunteering within their websites. Few organisations offer formal summer internship programmes but work experience opportunities do exist. Some larger institutions offer internships at various times throughout dependent on need. At Nottingham, you can also develop useful sector related experience and skills through participating in the Nottingham Advantage Award's Experience Heritage and Experience Arts modules and by getting involved in the Digital Transformations Hub. British Archaeological Jobs Resources (BAJR) – includes information on job vacancies, course listings and an extensive resources section Current Archaeology – includes information on education and careers Council for British Archaeology (CBA) – including fieldwork opportunities, careers information, and details of regional and local archaeological societies telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}