{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/too-many-ideas.aspx",
    "content": [
        {
            "p": "Do you feel like some people are clear on what they want to do and others completely clueless? But do you find yourself in a different situation – your head is full of ideas? It’s fine to eliminate career options as you do your research – in fact it’s advisable otherwise you'll be juggling too many ideas and end up feeling overwhelmed. We can help you narrow down your choices and make the process much more manageable. This 30-minute exercise will help you to narrow down your options or choose between several things. It will also help you to review your decision-making style and identify some of the barriers you may face. Go to the career decision-making exercise Once you've completed this exercise, jump to Step 4. Don't want to do the exercise? Move on to Step 2, 3 and 4. If someone asked you – well, what does an <insert your job idea here> do? If you need to build your understanding of different jobs, depending on which method suits you, here are three options to move forward. Go to: Use our A to Z career paths information written by our advisers Go to the Prospects website and read job profiles 300 employers visit campus to attend our fairs or present at our job and sector events Explore our events programme Organise some work experience, part-time work, volunteering or work-shadowing to get a real insight into the jobs that interest you. Find out more: Work experience and volunteering To decide whether a job should stay on the list of possibilities or be crossed off, you'll need to assess whether each job is a good fit for you? See if you can answer these questions. Have you made progress but need some one-to-one advice? Are you struggling to eliminate jobs from your list? Talking over your situation with an adviser is a good way to review your progress and gain some clarity. Book an appointment with an adviser A 13-minute podcast brought to you by Jen Balloch, Employability Officer. This podcast was recorded with UoN 2020 graduate, Kara Fletcher. Kara talks about how she made a decision between studying for a masters and two different job roles. She also gives her top tips for making the right choice. Whatever your choices, this podcast will give you an insight into how to make a decision about your next step. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}