{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/economist.aspx",
    "content": [
        {
            "p": "An economist is an expert who studies the relationship between a society's resources and it's production or output. The societies studied may range from the smallest of local communities to an entire nation, or even the global economy. Return to the A to Z jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment The role of an economist involves researching, monitoring and analysing economic data and providing associated forecasts, advice and recommendations. The Prospects economist job profile provides a detailed overview of typical responsibilities along with examples of specific work projects, from assessing the economic impact of national sporting events, to analysing the performance of companies before advising fund managers on investments. The Economics Network has produced a useful website about studying economics. The section on After Your Degree: Where Next? includes a number of case studies, links to vacancy websites, and an employability profile that lists the skills an economics degree should have taught you. In 2019, the Economics Network conducted an employer survey about graduate skills. The skills in demand were the: The skills shortage areas were: The World Economic Forum has recently published a list of the 10 biggest global challenges that, if they are to be addressed, will require cooperation from the public and private sectors and a potential increase in relevant roles for economists. They are: Economists work for a wide range of different employers, both in the public and private sectors. The Government Economic Service (GES) is the UK's largest employer of economists, employing more than 1,400 professionals in over 30 departments and agencies. They recruit around 120 economists a year. The Office for National Statistics is currently the fastest growing employer of economists in the UK. The Bank of England has two core purposes – monetary stability and financial stability. It works closely with a range of other organisations to achieve those aims. It offers a range of internships and graduate programmes. A think tank is a group of experts who provide advice and ideas on specific political or economic problems. Consultancy UK has recently listed its top 50 global private sector think tanks and research firms. Academic institutions employ researchers and lecturers who specialise in the field of economics. Visit Jobs.ac.uk to investigate roles being advertised. You can also speak to academic staff at Nottingham for advice. Typically, not-for-profit organisations are charities or other types of public service organisations. The GOV.UK website provides a searchable list of charities registered in the UK. Economic consultancies work with businesses, regulators and policy makers to evaluate and implement strategic decisions. They often specialise in a particular sector or area of economic expertise. Vault has produced a list of 20 top consultancies. The United Nations Development Programme (UNDP) administers the Junior Professional Officer (JPO) programme which provides hands-on experience to young professionals. The World Bank offers a range of programmes and internship programmes. The Prospects economist job profile gives a detailed overview of the responsibilities of an economist alongside a list of specific work project examples. Visit recruitment sites such as Economist Jobs to get an idea of available jobs and their responsibilities. Entry-level roles are often at associate or analyst level, with progression to forecaster or modeller after four to five years. Job titles might include economist, economic researcher, associate economist or analyst. If you're particularly interested in statistical and mathematical analysis, the role of econometrician might suit you. For larger organisations, for example, banks, government agencies, and so on entry is often through a structured graduate training scheme, with application deadlines as early as October or November for opportunities starting the following summer or autumn. For smaller employers such as consultancies or not-for-profit organisations, recruitment will take place as and when needed. Networking here is hugely valuable. Entry is likely to be a highly competitive process so relevant work experience will be beneficial. However, entry is possible with an undergraduate economics degree, usually at 2.1 or above, particularly on graduate training schemes. For example, the GES doesn't require a masters qualification. International organisations such as the Overseas Development Institute run a range of prestigious economics-related programmes and internships. Many of them include a masters or PhD in their entry requirements. A PhD will be a requirement for academic research roles within higher education institutions. A successful economist can extract and analyse data and convey complex ideas in an accessible and productive way. This requires excellent written and oral skills and close attention to detail. Strong IT skills are also important to facilitate the use of analytical and statistical programs. You will work to tight deadlines and prioritise workload, while building productive relationships with a variety of colleagues. Relevant work experience will give you a significant edge in the application process and will be expected by most employers. There are a number of ways to obtain it: If you are interested in economics in the international development sector, volunteering experience with an NGO will be valuable. The Economist Economist Jobs Inomics Join Students' Union societies For example: Economics and Finance Society, Nottingham Entrepreneurs, Business Management and Leadership Society Join the Nottingham Consultancy Challenge - develop analytical and consultancy skills Join the Nottingham Advantage Award Attend School of Economics talks Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Royal Economic Society Society of Professional Economists telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}