{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/jobs-in-education/education-related.aspx",
    "content": [
        {
            "p": "If you’re interested in working with young people in an educational role but don't want to train as a teacher, we've put together some suggested job roles and sectors you could investigate. Questions you might like to think about as you are reading this page: Jump to: If you have questions about your plans, talk to a member of our team. Book a careers appointment For information on related roles: for example teaching, youth work, social work, therapy, counselling and psychology: Return to A to Z jobs list We invited four professionals to talk to you about their roles. Login to SharePoint to watch a recording of this event Schools and colleges have a wide range of learning and pupil support roles which don’t require a teaching qualification although staff may have alternative qualifications or sometimes a teaching qualification. The pay for non-teaching jobs is usually lower than that of teaching staff. Job roles may vary and duties may merge depending on the school or college. HLTAs are learning support staff who work with classroom teachers to support students either individually and/or in groups with their learning. HLTAs are experienced teaching assistants who plan and deliver learning activities under the direction of a teacher and assess, record and report on pupils’ progress and may supervise a class in a teacher's absence. As the name suggests supervise classes during teacher absence, using activities prepared by the class teacher. Roles such as learning mentors and attendance officers work with pupils both one to one and in groups, supporting young people around issues such as educational achievement, attendance, social, emotional and behavioural issues. These positions are more challenging roles where you’d need a good understanding and ability to connect with young people as well as parents and other professionals. Job titles can vary and include pastoral manager. Roles such as learning mentor, progress coaches and careers and employability advisers are also available in the further education (FE) sector. Find out more from Prospects: Job roles in education Schools are managed and run in very different ways which impacts on their ethos and working environment. In Nottinghamshire, as well as other areas, many schools previously under local authority control are now academies and some are part of multi-academy trusts, run independently by their own governing body. Over the last few years, there has been a trend towards employing non-teaching pastoral staff, which frees up teachers from dealing with non-teaching issues. Employing cover supervisors rather than paying for supply teachers to cover lessons has a cost benefit to the school as well as the advantage of having a member of staff who can build relationships with students. Currently, with budget cuts and the formation of academies, recruitment of non-teaching staff appears to be fairly static. In England In Scotland In Wales In Northern Ireland It’s important that you show genuine enthusiasm for the job, are empathetic and understand that the role is not about ‘being a friend’ but being somebody who can motivate the young person you're working with to achieve their best. Experience working with young people, which can be in a voluntary and/or the non-education sector is extremely advantageous. You’d need to be enthusiastic, have a clear understanding of the role you’re applying for and an understanding of safeguarding. A safeguarding question or scenario is often used during the interview process. It is fairly common for people with teaching qualifications to also apply for these types of jobs. Schools volunteering with the Students' Union Nottingham CVS Opportunities at the University through Widening Participation Non-teaching jobs have more applicants than those advertised for qualified teachers, so competition can be fierce. Working in education is attractive to many people not only as it’s seen as a worthwhile, interesting job but also having school holidays. Other than teaching, there is not a specific graduate pathway in this sector and progression pathways can be limited which is reflected in wages paid to non-teaching roles. Graduates interested in teaching often look for a non-teaching role to gain experience or test out whether teaching is for them. college.jobs.ac.uk eteach One of the conditions of universities charging fees is that they need to have an access agreement in place setting out how they intend to safeguard and promote fair access to higher education from under-represented groups. This is called widening participation and universities deliver outreach programmes, services and activities to encourage young people from under-represented groups to consider university as a viable option. Outreach officers within universities deliver widening participation activities. They arrange and deliver group sessions to young people in schools and colleges both on-campus and in schools and colleges. Outreach officers will also work on other projects and events to encourage participation in continuing education.Team structures can varies, with some roles being part of student recruitment teams, while at other organisations there is a specific widening participation team. For example, at the university, 26 people work in the Widening Participation (WP) team and 14 members of that team work directly with schools. The team is sub-divided into those that work with primary and secondary schools and those working within a vocational pathways academic enrichment programme. Depending upon how a team is structured, contact with young people may be through one-off visits rather than regular interactions. Some teams do work with a caseload of schools and many outreach officers work with the same group of young people for a week or two during residential summer schools. Prospects - Community Education Officer A degree is often an essential requirement, as the job is about promoting higher education to young people. Experience working with young people is usually required and those appointed sometimes have a teaching qualification. University students, involved as student ambassadors in outreach work, are becoming more likely to see this pathway as a conscious career choice. Challenges The number of jobs varies depending upon funding and may initially be on short-term contracts. Career progression Progression to higher graded jobs either within the team or within the wider university or at other universities. The university's Widening Participation team has lots of opportunities for you to get involved with young people through a variety of schemes. Please note that many of these schemes have to be applied for at the start of term. There are voluntary and paid opportunities including one-to-one mentoring, summer school ambassadors and Students in Classrooms placements. Explore what's on offer through Widening Participation All these opportunities from Widening Participation can be accredited through the Nottingham Advantage Award (NAA): NAA: Inspiring Young People Module - login to MyCareer to view the module Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Jobs.ac.uk TES jobs - use the search tool to identify non-teaching jobs During this webinar, you will hear from four speakers who work in different roles within higher education. Each speaker shares how they got their role, what they do day-to-day, and the key skills they use. They also spoke about what makes working in higher education unique, including the benefits and challenges. Speakers: Login to SharePoint to watch the webinar This section covers museums, galleries, science centres and heritage, as well as theatre and performance organisations. This sector is keen to provide opportunities to encourage access for young people and on developing education and skills which can complement the school curriculum. Job titles in the sector vary but could include Education Officer, Learning Officer, and Schools Officer. Working in this role, you would to engage and educate young people involving the preparation and delivery of programmes, events and resources for schools and other visitors.Roles and responsibilities vary depending on the size and type of organisation worked for. In some smaller museums, for example, the Learning Officer would be responsible for the full range of ages from under 5s to university age students and both formal and informal learning (families and weekend visitors). They might also be responsible for a volunteer programme working with people of all ages. In larger organisations such as Nottingham City Museums and Galleries the roles tend to be split into officers responsible for volunteers, formal learning with schools and colleges and then informal learning. Sometimes there are freelance opportunities available to deliver education sessions. The level of actual delivery to pupils by education officers also varies greatly. In larger organisations they would co-ordinate a team of other staff or freelancers who actually deliver the education sessions while in smaller organisations they might do all of this themselves. Get into Theatre: theatre education manager Museum education officer Some applicants are from a teaching background, but this is often not a specific requirement and many successful applicants come through different routes. If you are applying for roles that are subject specific, like drama education officer, then a degree in performing arts or drama may be a requirement. Gaining work experience through volunteering is a really good way to get some experience for your CV and most organisations run volunteering programmes. Volunteering with children and young people is ideal but any experience in the type of organisation that interests you is useful. This is a competitive sector which has faced many cuts over recent years. Contracts are frequently offered on a short-term basis and may include freelance work. Large organisations may offer the opportunity to progress through graded posts, for example, from assistant education officer to education officer. Promotion could also be into broader management roles within the sector. Nottingham Lakeside Arts - volunteering opportunities GEM - jobs and training opportunities in the heritage sector Jobs Desk - job vacancies in UK museums and galleries Some charities advertise jobs which involve working with young people to engage or educate them around the aims of their specific charity. Jobs are as diverse as the charities. Perhaps start with a web search for 'educational charities'. Some examples are: supporting young people into employment, working with young carers, delivering financial education programmes and delivering programmes to promote animal welfare. Some large charities such as IntoUniversity, who offer widening participation programmes to young people, have specific graduate employment opportunities. Explore the charity sector, entry routes, roles available, where to look for vacancies and work experience opportunities on our dedicated charity work page: Charity work - entry routes, roles, vacancy sources and work experience telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}