{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/chemical.aspx",
    "content": [
        {
            "p": "Chemical engineering as a subject is valued by employers in many sectors and the University of Nottingham graduates do especially well in securing employment in engineering and technical fields as well as professional roles in non-engineering sectors. Talk to an adviser Check out our events In addition to your professional and technical skills, your chemical or environmental engineering degree will equip you with key employability skills such as: A large proportion of our students go on to work as chemical or environmental engineers, many work towards chartership with the Institute of Chemical Engineers (IChemE) or Institute of Materials, Minerals and Mining (IOM3) as they progress through their careers. Some students choose to use the skills they have gained throughout their degree to move into graduate roles outside of engineering. A degree in chemical or environmental engineering will allow you to apply for roles as a graduate chemical or environmental engineer. The qualification will also provide you with the education base to work towards Incorporated Engineer (BEng) or Chartered Engineer (MEng) status through the Institute of Chemical Engineers (IChemE) or the Institute of Materials, Minerals and Mining (IOM3) which can be a good way of demonstrating and accrediting your professional competence as an engineer once you start in the workplace. Institution of Chemical Engineers - Get Chartered TARGETjobs - Becoming a chartered or incorporated engineer after starting a graduate job As a chemical or environmental engineer, there are a number of employment sectors you could consider. Recent chemical and environmental engineering graduates have joined organisations such as: Other engineering roles Other engineering roles such as process engineering, project engineering, renewable energy engineering can either be progressed into directly with chemical or environmental engineering degrees or following from a more specialised MSc. Non-engineering careers for engineers: Not all engineering graduates become engineers. Many of our graduates find alternative opportunities where they are able to use their transferable skills; problem solving and analysis, project management, high degree of numerical and computer literacy, team working and communication. Explore more graduate careers Examples of non-engineering roles our engineers, Nottingham graduates have entered: Examples of the companies they work for: Some students will progress onto further study at postgraduate level in both engineering and non-engineering related areas. Examples of recent further study destinations of electrical and electronic engineering students include: Postgraduate study can be a way to develop a further specialism in a particular area of interest, either through carrying out research or undertaking specialist taught modules. It can also be a way to gain skills and qualifications in areas outside engineering in order to progress into other professions. For students studying for a BEng qualification undertaking an accredited MSc will give you the level of qualification necessary to become a chartered engineer and to meet the entry requirements of some graduate engineering employers who ask for a masters level qualification. For students studying for an MEng degree, undertaking an MSc won’t give you a higher level qualification, but it can be a way of specialising in an area. Find out more about further study - courses, making applications and funding Regardless of whether you are a first year or final year, developing skills outside your degree will enhance your CV and allow you to provide evidence of these in applications and at interviews. We have a wide range of opportunities at the University for you to explore: An industrial placement will enable you to gain industry experience, crucial for your career development. Industrial placements Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge The Nottingham Advantage Award offers interesting extracurricular modules to develop and reflect on your employability. With over more than 200 modules across our three campus in the UK, China and Malaysia. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union ChemEnv Society We offer a range of events to develop your skills and meet employers throughout the year. Check out: Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Environmental careers All graduate careers TARGETjobs - chemical engineering overview TARGETjobs - chemical and process engineer telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}