{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/clinical/army-vet.aspx",
    "content": [
        {
            "p": "As a veterinary officer in the Royal Army Veterinary Corps (RAVC), you will be an officer first, and a vet second. The RAVC is the one Corps within the Army Medical Services that maintains a combatant role. Return to the Vets homepage Book a careers appointment Capt Alexander Bowman RAVC, Equine Veterinary Officer, Defence Animal Training Regiment The first posting for a veterinary officer after training is usually as a troop commander at the Military Working Dog Regiment (North Luffenham). There is very little clinical work involved. You will be trained how to manage a team of dog handlers and vet technicians along with their dogs to ensure their health and wellbeing is maintained. Most of a veterinary officer’s clinical work is with Military Working Dogs, although there are also equine positions these are far fewer and highly competitive. Occasionally a veterinary officer might see a regimental mascot such as a goat or Shetland pony. The RAVC only has eight purely clinical roles, so if you are considering becoming a veterinary officer you really need to want to manage people and take on other military duties. Veterinary officers have six weeks protected clinical time per year, to ensure they continue to use and hone their clinical skills. When on deployment veterinary officers may have to work in challenging environments and deal with difficult emergency situations. For example, receiving a call in the middle of night due to a wounded dog being airlifted to the camp for emergency treatment. Veterinary officers may also be required while on deployment to provide advice and training to local farmers regarding maintaining healthy livestock. To become a veterinary officer in the Army you will need your BVM BVS degree and membership to the RCVS. You do need to be healthy to join the Army, and your GP will be asked to fill out a form about your health quite early in your application. There are some medical conditions that might stop, or delay, you applying to join the Army. It is worth checking this list before starting your application. The upper age limit for applications is 29 years and 11 months. After graduation veterinary officers undertake a nine-week commissioning course. Following this you complete your 12-month Personal Development Phase (PDP) in a civilian veterinary practice before entering Sandhurst. This will ideally be with a small animal practice or charity. During your training you will be paid by the Army as an Officer. Veterinary officers also undertake a Dog Handling training course so that you can handle all Military Working Dogs, including attack dogs and explosive detection dogs. Veterinary officers can work towards Royal College of Veterinary Surgeons Certificate in Advanced Veterinary Practice (Cert AVP) Veterinary students can receive a bursary from the Army from the third year of your veterinary degree. The bursary is £5,000 per year during your third, fourth and fifth year of your degree (£15,000 in total) followed by a £45,000 lump sum when you commission from Sandhurst. If you are receiving the bursary you don’t owe the Army any time during your degree course, however your minimum commitment to the Army after graduation is four years' service. The bursary cannot be applied for retrospectively so to receive the maximum possible benefit the Army recommends applying for this at the end of your first year of study. The application process can take between nine and 12 months, and by applying early you will be ready to receive the first £5,000 for your third year of study. The final point at which you can apply to receive the bursary is usually at the beginning of your fourth year of study, because of the length of time the recruitment process takes. If you decide you would like to become a veterinary officer, but have not received the bursary you can still apply as a direct entrant. The role and the recruitment process for direct entrants will essentially be the same as students entering via the bursary scheme. You can apply at any point as a direct entrant, and some vets do so after a few years in private practice. On the Army’s website about becoming a veterinary officer you will see the option to be a reservist officer. In reality there are only a couple of positions for a reservist veterinary officer, and these tend to be held by ex-officers who have left the Army to work in private practice, but still wish to maintain military links. Most of the recruitment process is similar to the recruitment process for joining the Army as an officer, however there are a few additional stages specific to the Veterinary officer role. Army - information on the Army Officer recruitment processes Veterinary officers commission as a full lieutenant on a starting salary of approximately £40,000. It usually takes two or three years to be promoted to captain and an additional five years to reach major (based on merit) where the pay will rise to around £50,000 In their third year veterinary officers will decide whether they want to focus more on the clinical side of the role or retain a larger managerial, troop commanding position. However, there are very few fully clinical positions within the RAVC. If you have any questions, email the Army recruitment teams. The specialist recruiters can help with queries about the role, application process and can also put you in touch with a current serving veterinary officer if your questions are more veterinary specific. You can also discuss your career decision with a careers adviser at Sutton Bonington Campus. There are appointments available each week, which are impartial, confidential and a good opportunity to gain support with decision making and career planning. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}