{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/philosophy.aspx",
    "content": [
        {
            "p": "Critical thinking and lucid argument are skills inherent in the study of philosophy and can be successfully applied to a variety of career opportunities. Learn more about your options and how we can support you on your journey. For many students who choose to study philosophy, the decision is not often a vocational one. However, many skills are developed on your degree course and therefore career options are very open-ended. You may be studying philosophy in combination with another subject so be mindful of the skills and knowledge gained from both disciplines. The skills gained from studying philosophy are transferable to a wide range of areas which means that graduates can, and do enter a diverse range of roles and sectors. A philosophy graduate typically will have the ability to: It is important that you can talk about these skills on application forms and in interviews. Philosophy graduates enter an extremely wide range of roles and sectors. Of those going into the workplace, the range of occupations and sectors entered include: Career paths - explore roles and sectors Prospects - for career options and job profiles Around one quarter of philosophy graduates tend to go on to full-time further study and a small number combine study with work. This is to either pursue an academic interest or to gain an essential qualification for a specific career area. Popular areas for further study are law conversion, teacher training, journalism and higher philosophy degrees. Postgraduate study or training can allow you to: It's important to understand your reasons for studying at postgraduate level and to research opportunities and the value of postgraduate study in your sector before applying. Masters funding is available (eligibility criteria exists) in the form of a postgraduate loan, but you can only access this funding once hence the importance of choosing your course carefully. If you'd like to talk this through with an adviser, arrange an appointment to speak to us. Careers blog: Thinking About Postgraduate Study? Find out more about further study The opportunities listed are primarily aimed at current students living in the Nottingham area. If you are well into your final year, graduated or are no longer in Nottingham, you can access work and volunteering options in your home area. Depending on your location and what you want to do, your strategy to develop your skills and experience may vary. You are welcome to have a chat with us, so just arrange an appointment. Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs.</ Nottingham Advantage Award We advertise part-time, casual and temporary jobs on campus and with local businesses. Created just for you, the advertised vacancies can fit around your studies and other commitments. The vacancies are advertised in two places. On-campus jobs Off-campus jobs The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Working with young people Undertake an exchange semester in another country and broaden your horizons. Talk to your tutors and find out more about the programmes available from the International Office. Exchange programmes You can now undertake an optional placement year as part of your degree at the end of your penultimate year of study. The placement can be aligned to your degree discipline or related to your career aspirations. Speak to a career adviser or your school for more information. If you are no longer at Nottingham, you can access work and volunteering opportunities at home. Depending on your location and what you want to do, your strategy may vary so come and speak to us or arrange a telephone appointment. Digital skills are highly valued by employers and essential in many career fields, including advertising, publishing, marketing, and general commerce. They range from social media to coding and will definitely enhance your employability. There are various ways to develop your digital skills whilst at university. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. We can help you with all stages of the application, from reviewing your CV and/or application form to interview coaching and assessment centre practice. Many graduate recruiters also use psychometric tests during the recruitment and selection process. They are common across all sectors and career fields. Practise will really help your performance. Expert advice on making applications Use our example tests Digital skills are essential in many career fields, including advertising, publishing, marketing, and general commerce. They range from social media to coding and will definitely enhance your employability. There are various ways to develop your digital skills whilst at university. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}