{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/beyond-vet-practice/research-and-development.aspx",
    "content": [
        {
            "p": "This area, commonly referred to as 'R&D' may appeal to you if you enjoyed the lab research side of veterinary training and consider yourself to be a scientist at heart, as well as a practitioner. You may already be aware of some of the companies that supply practices with drugs and other medical products. One of the alternative careers for vets is in the research and development process that results in such treatments. Find out more about science careers beyond the lab Return to the Vets homepage Book a careers appointment R&D scientists work within biotechnology and pharmaceutical firms. Distinctions between the two types of firms have traditionally existed, but some think these are becoming less valid as they both work to develop the same kind of products; new drugs, animal health products, livestock feed supplements, vitamins, and a host of other goods. Pharmaceutical companies typically employ \"empirical screening\" to develop drugs – they take natural compounds with a known physiological effect – like blood pressure – and screen for that effect. Biotechnology uses \"genetic engineering\" technology in its research. Biotech was originally based around molecules, called monoclonal antibodies, which mimicked certain proteins or other molecules to target a specific cell area. Biotechnology companies are seen as \"young, entrepreneurial and emerging\", that develop products in the areas of DNA, RNA, etc. A typical day in this area of work may involve designing and conducting experiments, interpreting data, teaching and supervising others, project management, writing reports and scientific papers, and keeping up-to-date with new developments. You would normally be working in a small team with other scientists. The vast majority of roles require you to have completed a PhD as this will develop your scientific knowledge as well as your laboratory research skills. In addition to such technical scientific skills, recruiters often focus on the following transferable qualities: Your veterinary training is advantageous in that it has given you a solid scientific foundation and it is evidence of your passion for wanting to improve the health of animals through evidence-based practice. The research skills needed in R&D significantly surpass what you will have previously experienced, hence why it is a common requirement to have completed a PhD to go into a research and development role. For most R&D vacancies requiring specialist postgraduate skills, relevant scientific magazines and websites such as New Scientist, or a company's own website are great places to start. Local science parks may be a good source of small companies – see the further resources section. Veterinary pharmaceutical companies Internships may be a way to gain further insight before committing to a PhD. Many formal internship schemes will mainly be aimed at students or recent graduates Many commercial scientific organisations also use recruitment agencies. As a starting point, try using veterinary-focused recruitment agencies such as Recruit4Vets. For a more general list of recruitment agencies that provide staffing for biotech and pharmaceutical organisations, visit Agency Central, Scientific Recruitment Group, and MatchTech. If you are entering this field at a junior level without a PhD, you can expect to earn between £18,000 and £25,000. With a PhD and perhaps a couple of years of post-doctoral experience, you may expect to around around £35,000. ABPI Biotechnology Industry Organisation Biotechnology and Biological Sciences Research Council Bioindustry Association - membership directory Clinical Discovery Pharmaceutical Crossing Vet Futures – Your passport to the future New Scientist Nature BioHealthMatics UK Science Parks Association PharmaJobs Cranleigh Scientific Science Magazine Pharmi Web Business, Innovation and Skills Science Oxford © CoSector, University of London. Used with permission. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}