{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/healthcare-scientist.aspx",
    "content": [
        {
            "p": "Healthcare scientists apply their scientific knowledge and skills to the prevention, diagnosis and treatment of disease and the rehabilitation of patients. Use the sections below to explore this area of work, how to apply and gain work experience and hear about the experiences of two trainee healthcare scientists on the NHS Scientist Training Programme (STP). Return to A to Z jobs list If you have questions about your plans, talk to a member of our team. Book an appointment Roles in healthcare science within the NHS are available in the following four areas. For detailed information about all specialisms within healthcare science, please see the Health Careers website. Life scientists are critical in helping diagnose and treat disease. This could involve carrying out tests on various body samples and providing results to help other healthcare professions make decisions for patients, or it could be helping couples with fertility treatment. Work is usually in one of three areas; pathology, genetics or reproductive science and is usually based in either a hospital laboratory, community clinic or in settings such as the NHS Blood and Transplant service and the UK Health Security Agency (formerly Public Health England). More specific specialisms include: analytical toxicology; anatomical pathology; biomedical science; blood sciences; cancer genomics; cellular sciences; clinical biochemistry; clinical immunology; cytopathology; genomic counselling; genomics; haematology; histocompatibility and immunogenetics; histopathology; infection sciences; microbiology; reproductive science and andrology; virology Working in clinical bioinformatics could include developing and improving methods for acquiring, storing, organising and analysing biological data that supports the delivery of patient care. This would involve the use of computer science including software tools that generate useful biological knowledge by manipulating ‘big data’. This could be in three areas; genomics, health informatics or physical sciences. Working in physical sciences or biomechanical engineering could involve developing methods of measuring what is happening in the body and finding new ways to diagnose and treat disease. You would also be responsible for ensuring the equipment is functioning effectively or applying specific techniques. This might involve ultrasound, magnetic resonance imaging (MRI) in order to support diagnosis, monitoring or treatment. Opportunities exist in: Most healthcare science staff in physiological sciences work in hospital clinics and departments, or as part of a surgical team. Some work in the community, visiting patients in their homes or in schools. There are a variety of different roles within this category, including using specialist equipment and advance technologies to analyse body system’s functions as well as helping to diagnose abnormalities. In some cases, you could be responsible for suggesting ways to help manage conditions in the longer term. You could be working in: If you are seeking a career in the NHS it is worth noting that there are differences between a clinical scientist and a biomedical scientist. The NHS describe the healthcare science profession has being uniquely placed to harness the UK’s world class healthcare research base, improve patient outcomes and assist NHS England in its goal to accelerate innovation. Healthcare scientists work in more than 50 specialisms. Detailed information about all specialisms within Healthcare Science can be found on the Health Careers website. According to NHS careers biomedical scientists carry out a range of laboratory and scientific tests to support the diagnosis and treatment of disease. Biomedical scientists investigate a range of medical conditions, including: cancer, diabetes, blood disorders (for example, anaemia), meningitis, hepatitis, AIDS. The work is practical and analytical and you would also perform a key role in screening for diseases, identifying those caused by bacteria and viruses and monitoring the effects of medication. This could be through the use of computers, sophisticated automated equipment, microscopes and other hi-tech laboratory equipment as well as using a wide range of complex modern techniques in your day-to-day work. The work is highly varied, practical and analytical. You would usually specialise in one of three specific areas: infection sciences, blood sciences, cellular sciences. Graduates with a non IBMS-accredited degree, should contact the IBMS to have their degree assessed. You will have to complete top-up modules and gain experience working in an IBMS accredited laboratory (NHS, public health). If you have studied a MSc. which is accredited by the IBMS, you will still need to contact the IBMS as you may require to do top-up modules to meet the academic requirements. The qualifications you need will vary depending on the role you are wish to apply for. For example: Detailed information about study and training within healthcare science can be found on Health Careers and on the National School of Healthcare Science websites. The Scientist Training Programme (STP) is a three-year programme combining work-based and academic learning in hospitals and health services in England. Trainees also complete a part-time master’s degree in their chosen specialism. It is a highly competitive programme; in the latest recruitment round there were around 20 applications for every post. Detailed competition ratios along with ethnic demographic data by specialism can be found on the National School of Healthcare Sciences (NSHCS) website. Broadly speaking, there are two main routes into the STP: Find out about the NHS Scientist Training Programme (STP) Applications to the programme usually open in January each year and close approximately one month later. It is extremely important to refer to the correct person specification for the year you are applying as part of your application – this often only gets published by the National School of Healthcare Sciences (NSHCS) a few weeks prior to applications opening. It’s also common that applicants may be requested to complete an online test or series of tests as part of the application process, the deadline of which will usually tie in closely with the application deadline. Candidates are typically shortlisted throughout March and if successful, can expect to be interviewed from mid-May. Find out more about applying on the NSHCS website. The university usually offers a number of events during the autumn term where you can find out more about healthcare science and the STP. Look out for these on MyCareer. National events and information sessions are also usually offered by the NSHCS each year (for example, check out their Twitter, Facebook, LinkedIn, YouTube channels). Applications to the STP typically involve the following elements but check the NSHCS for the most up-to-date information for each application year. You need to complete an online application form which usually asks a number of questions relating to healthcare science – it’s usual for questions to incur a word limit (such as 125, 150, 250 or 400 words). For example, why you have applied to the programme and your suitability for it. You may also need to show your interest in scientific practice, your understanding of your chosen specialism and your commitment to the NHS values. It’s also common to be asked to show how you demonstrate ‘softer’ skills such as organisation and planning, leadership and teamwork. You may need to complete some online tests as part of the application process (for example, numerical, verbal or logical reasoning or situational judgement tests). The NSHCS will offer more information about what is required in each application year and will usually offer the opportunity to undertake some practice materials to help you prepare. You can also practice similar types of tests using Graduates First. We subscribe to Graduates First so you can access it free of charge. If your application form hits the mark you will be invited to an interview (which may be face-to-face or online). Questions have been set by members of the healthcare science profession, are quality assured and are aligned with the person specification of the programme. Usually the interview is themed. For example, there might be questions or assessments relating to general science, the specific specialism to which you have applied, or to aspects such as leadership and management or your values and behaviours. Here are a few hints and tips about how to prepare for and approach different types of questions or assessments: Values and behaviours - read the NHS Constitution and have examples to demonstrate each value. Your examples do not have to be patient focused; you can use examples from university projects or work experience. For example: 'Improving lives' is one NHS value and innovation is central to improvement. So you could be asked a question such as: \"Tell me about a time when you have found a new way to approach a task or made a suggestion that improved practice?” Make sure you have prepared some examples to evidence each value using the STAR technique to describe them. Find out out about the STAR technique. Finding work experience can be difficult, however there are a number of ways in which you can gain insight into your chosen specialism. Health Careers: Roles in healthcare science National School of Healthcare Science - NHS Scientist Training Programme telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}