{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/leisure-travel-and-tourism.aspx",
    "content": [
        {
            "p": "The leisure, travel and tourism sector is diverse and offers opportunities for graduates across a broad range of roles from hotel management to sports coaching to logistics. In 2019, the UK’s leisure sector as a whole was valued at £111bn. Tourism in the UK is a fast-growing industry, employing 2 million people, and, it is predicted, will be worth over £257 billion by 2025. For more information on sport careers look at our Working in sport page If you have questions about your plans, talk to a member of our team. You may wish to find a hands-on, active role in a customer-facing job, or in business management in ‘head-office’ roles such as marketing, IT, finance or legal departments. Opportunities can be roughly grouped as follows: Sport such as coaching and training, but also providing and/or managing facilities, events and activities. For more information, check out our working in sport page Graduate schemes are available with some larger organisations, for example hotel and restaurant groups, pub and fast-food chains, and top visitor attractions. Employers in the leisure, travel and tourism sector range from small and medium-sized enterprises (SMEs) through to large, nationwide and international corporations. Some examples of large employers include Hilton Worldwide, InterContinental Hotels, Marriott International, Cunard, TUI, David Lloyd Leisure, Virgin Active, Merlin Entertainments, and many more. Most companies in the sector recruit graduates of any degree subject. Employers will be looking for enthusiasm and commercial awareness of the type of industry you are applying for, and work experience can be useful to evidence this. Some specialist roles may require specific degree subjects or further training, for example working in legal or financial roles. The following skills may also be helpful in securing your role: Chartered Institute for the Management of Sport and Physical Activity (CIMSPA) - has a section covering careers and job vacancies Hospitality Jobs – for full and part-time opportunities Leisure Opportunities - useful for job search and training information The Travel Association (ABTA) - provides a careers page telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}