{
    "url": "https://www.nottingham.ac.uk/careers/students/postgraduate-taught-students/index.aspx",
    "content": [
        {
            "p": "We offer individual support to all postgraduate taught students whatever your course, mode of study or future career plans. Our careers advisers are linked to faculties and can give you advice relevant to your area of study and interests. I have accepted the position of research assistant. Thank you for all the hard work you did on my CV and cover letter which helped me lay the foundation for my success. I will not hesitate to recommend you and the Careers team to others. Yueqi Wang, MSc Immunology and Immunotherapeutics (2023) Application timescales for PGTs Postgraduate researchers' website If you're studying an MBA, MSc or PhD, please contact your Postgraduate Careers Team Careers appointments Our team are here to offer you specialist advice on any aspect of your future. Whether you are unclear about your options, already focused on what you want to do or somewhere in between, we're here to help. You can talk to a member of our team on Jubilee, Sutton Bonington and University Park campuses, the Medical School and University hospital sites. We also offer email and Skype appointments for part-time and distance learners. You may need to act quickly at the start of your course to meet the recruitment deadlines for some graduate schemes. They can be as early as October and November. It's the same for some vocational training courses such as teaching, medicine and law. If you're thinking about moving onto a PhD following your masters, you will need to start researching your options towards the end of the autumn term. Graduate job opportunities If you're looking for your first professional role, are you familiar with the different routes into work and where to look for vacancies? If you have previous professional experience, are you looking to continue in that sector or change direction? Explore all your options including opportunities to work abroad, entry routes into careers that interest you, starting your own business and how to research employers to make a great application. International students As an international student you can access the full range of services and resources from us. Whether you are interested in working in the UK, looking to explore opportunities in countries around the world or at home, we can help. Also find out how we can support you if you're considering continuing your studies in the UK or elsewhere. Thinking about a PhD? A masters degree can be a great stepping stone towards a PhD as it helps you develop your independent research skills. A PhD is the highest level of academic qualification in the UK and it involves three to four years of original research on a specific topic. If you're considering taking a PhD, our advice will help you investigate whether or not it is the right option for you, how to apply for research degrees and where to look for funding. Work experience opportunities Alongside the specialist knowledge gained during your masters, undertaking some form of work experience will be important. In some sectors, employers will expect it and in others, it will give you the opportunity to demonstrate your transferable skills. The Research Academy Placements are specifically for postgraduates but also look into other opportunities such as the Nottingham Internship Scheme, Nottingham Consultancy Challenge, and our part-time jobs recruitment service. Events Our events are popular with masters students as they give you the opportunity to meet employers at fairs and presentations, develop your job-hunting skills at workshops, and gain an insight into careers and sectors. The peak times for events on campus and online are the autumn and spring terms. Find out what's taking place on our website and look out for our weekly events newsletter. Book your place in advance as some events have limited availability. Nottingham Postgraduate Advantage Award We have created an Advantage Award route for postgraduate students at the university. The scheme aims to help you showcase your extracurricular activities as well as what it means to be a postgraduate student at Nottingham. The Nottingham Postgraduate Advantage Award (NPAA) allows you to undertake a more postgraduate-focused scheme, which will fit more easily around your timetable telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}