{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/maths/maths-case-studies.aspx",
    "content": [
        {
            "p": "Five maths graduates talk about their current role, their career paths from studying at Nottingham and their advice for you based on their experiences. As a lead data analyst within Forensic Discovery & Analytics (FDA) at EY, I help clients solve complex problems regarding compliance and risk through a data lens. Our projects span across the globe and most industries, often bringing together disentangled data sources for our clients to help understand such problems as regulatory compliance, sanctions, investigations or strategy. My mathematics and statistics degree modules set me up for my current role both directly and indirectly. When working with client data, group theory directly drives how we choose the best data architecture for a project, how structures should interact and how to fine tune the efficiency of our codes. My transition from studying to the working world was made much easier through the various computation focused modules I studied and to this day help me get to grips with the numerous coding languages I come across. Statistical modules have helped me produce analysis, build and tailor models and most crucially be able to explain the “why” behind decisions to a client, who can often be from a non-STEM background. Following my degree at the University of Nottingham, I joined a customer analytics consultancy as a graduate analyst. I predominantly helped clients understand performance of their commercial strategies as well as produced ad-hoc analytics to answer questions such as Christmas performance or product price sensitivity to competitor promotions. After 18 months I made the transition to EY and have now been with the firm for just over three years. Although it was a scary step to take it has been completely worthwhile. Outside of work I love to cook and run, which is always a challenging mix of interests to balance and I am a keen traveller. My main advice to anyone wanting to pursue a career in data science is to remember that this career is about a balance of skills. Having all the skills developed before you begin this career journey is impossible. Being passionate about logical reasoning, effectively communicating complex topics, being an innovator, having a passion for learning, or any combination of these, means you have the building blocks to grow into the role. Just remember, everyone always thinks that the people around them have identical skills to them, but the truth is that all the above are rare individual qualities that already set you up perfectly for a start within data science. A day as a Modo25 junior data analyst mainly revolves around the collection and analysis of marketing data. While the collection of the data is fairly uniform across different clients, the application is where the role really comes into its own. We analyse the data in two ways. The first is to produce reports for clients which helps them review their past digital marketing performance. The second is to produce a digital marketing prediction tool called BOSCO™. Working on the BOSCO™ project is really enjoyable as some of the prediction methods used are similar to tools covered in the Time Series and Forecasting model on the mathematic course at the University of Nottingham. Although I never did an internship directly linked to data in the past, I think a combination of past work experiences helped get me this role. Plus, I was also a PASS leader and I think my dissertation on Non-Linear and Non-Parametric Regression was most likely a key advantage. This allowed me to show an ability to work with code and independently research statistical techniques. I think any student wanting to have a career in data would have a real advantage if they threw themselves into as many coding and stats modules as possible. When you begin to work with data after university, it quite quickly becomes apparent that only knowing R, for example, isn’t going to cover enough bases. Rather than waiting until you start a job in data, I’d really recommend learning extra coding language while you are still at university. For example, knowing how to Python and understanding how to write code in SQL would really help your job application standout. I am currently a product manager at Barclays within their technology organisation. As the product manager for the internal virtualization platform, my role can be very wide-ranging, but primarily includes: How do you use your degree in your role? With my current role, the main areas I use my degree are when I am analysing data or when I am working on the financials. My degree also provided me with an approach to problem-solving which I find useful everyday as the range of tasks which pass my desk can vary. In my second year of studying maths, I knew I wanted to try to secure an internship. I enjoyed the computation-based modules and had dabbled in coding, so I decided to focus on technology roles across a range of industries. I gained a place on the Deutsche Bank Technology Internship, which led to a place on their 2017 graduate scheme once I had completed my final year. There were two sixth-month rotations with different teams (both within technology). During this year, I found a team I liked and a role I enjoyed, so joined that team once my graduate year had finished. I joined as a junior product manager and stayed there for three years. I recently left that team and joined my current team with Barclays. What advice would you give to current students interested in internships or graduate schemes? If I could, I would tell past self to: I currently work as a data scientist for Featurespace. In the Data Science team, we design and build machine learning models to detect financial crime such as card fraud, anti-money laundering, or application fraud. Prior to this job, as a first job, I worked as a data scientist for a small spin-off on the data management platform. My Master's in Statistics was immensely helpful to get my first job since the modules that I had and the skills that I gained, were directly required in my everyday job. If I should pick two it would be programming and machine learning related knowledge that were the most helpful. The support from my supervisor and other lecturers definitely helped me with my first job, not only when I needed references but also when I needed advice. While my career is still at the beginning, it is amazing to be part of this quickly evolving community that combines data, domain knowledge, and computational power to build products and services that we could only dream of a few years ago and to solve important problems. The ability to contribute to society in a positive way has been probably the best part of it. The best advice that I was given with regards to the job search was that not every job will be your dream job or your perfect job. However, in every job, you can learn something and in every job, you can try to make a positive impact. I would also advise you not to be shy and reach out to companies even if they do not have open positions. There is nothing to lose by reaching out and expressing an interest. As for getting into data science, the internet is full of blogs and videos that already touch on this topic. My advice is limited to experience but I would advise you to take it one step at a time. The industry is competitive and full of incredibly talented people. This should not scare you though. It will require some hard work and it might be overwhelming so do not try to learn everything at once because there are people who already know a lot. Make sure you understand the foundation and that you feel reasonably comfortable with programming. Feel free to reach out to people that do the job you would like to do and ask them about it. Be curious and most of all enjoy it. The power of mathematics in formulating solutions for real-life problems has always been my passion. With more than six years experience of teaching mathematics and statistics after my Master's degree, I decided to pursue a Doctorate. Being a postgraduate researcher at the University of Nottingham boosted my confidence and played a key role in my interview for the prestigious MASS Doctoral Prize which I successfully won and became the first prize holder by God’s grace. What I enjoy about my current role is the flexibility to work on research topics which are not only centred on the award’s accepted proposal, but also being an initiator of my own research. This has allowed me to turn the current global uncertainty to my advantage by currently working together with my sponsor, mentor and a researcher outside the UK on a COVID-19 model for Ghana to investigate COVID-19 transmission dynamics. I would encourage students to put their best effort into any challenge or hurdle they face. This may seem daunting, but when you enter the workforce you will realise that those trying moments have toughened you. It may surprise you that the skills and knowledge gained during your hardest moments while pursuing your degree are what you may need to apply the most. My participation in competitions and presentations at conferences and the challenges faced during my PhD have broadened my knowledge and made me very versatile and adaptable to different situations to achieve goals. I will end by saying “knowing who you are” is the greatest key to a successful career because everything depends on it. My current role is a relationship director within Barclays Corporate Bank, focussing on clients in the healthcare sector. The role involves been the main point of contact in the bank for the businesses. A key part of the role is lending these businesses’ money, typically £10m+, to support the success and growth of their business. This involves analysing their performance, both financial and other aspects, to decide what level of funding we as a bank could support. I use numerical analysis, attention to detail and problem-solving skills learnt during my degree as part of this role. Been confident with numbers helps me analyse customer’s financial performance which involves looking at their financial statements/accounts. I completed a summer internship at Barclays between my second and third year of university. At the end of this internship I was offered a place on the Barclays Corporate Banking graduate programme. Following this programme, I was offered a permanent role in the bank and in the four and a half years since this time I have had two promotions. During university I also worked part time at a retail store which gave me really good experience of the workplace and the opportunity to develop different skills such as customer service, time management, teamwork and commercial awareness. This certainly helped me in the interview processes for early roles at the bank and put me in a good position to succeed from the start as I had experience of a workplace environment. I would recommend been open to a career within financial services, for example, in a bank, as there is such a large variety of roles available and lots of career progression opportunities for ambitious individuals who are willing to work hard. The variety of roles is much more than you would expect – client management, product management, product development, finance, legal, human resources (HR), procurement, business management, operations and so on – so there are roles to suit various skill sets and interests. I would recommend internships and graduate programmes as a good chance to explore what a career path is like and a good way to get your foot in the door. I would also recommend attending career fairs and mock assessment centres at university to give you the best chance at understanding the career paths and at succeeding in assessment. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}