{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/psychology/business-context.aspx",
    "content": [
        {
            "p": "Account Management Associate, Gartner I joined Gartner as an account management associate. My primary responsibility is to provide senior human resources (HR) executives with the research insights and resources they need to achieve functional excellence. I initially questioned how well my psychology degree would prepare me for such a role. However, many of the skills gained throughout my degree have been invaluable. For example, when speaking to an executive, it is vital that I use every opportunity to diagnose their issues in order to provide the best support. I had no idea how much a research degree would prepare me for this aspect of the role. I was attracted to Gartner’s graduate programme because research is at the core of its business model. My role has allowed me to keep in touch with science but in a commercial environment where I have been able to influence how FTSE 100 organisations do business, while rapidly developing my business acumen and commercial awareness. If I could offer psychology students one piece of advice, it would be to think outside of the box. I support senior HR executives and my daily conversations cover culture, leadership, employee engagement and motivation to name just a few. It’s truly great that your course is BPS accredited so you can pursue a career in clinical psychology but if that’s not what you want to do, your psychology journey does not have to end there. Data Scientist and Software Developer, Tessella I am a data scientist and software developer at Tessella, based in the Ashby-de-la-Zouch office. Tessella is a leading consultancy that solves complex, real-world problems across a variety of industries in the UK, US and Europe. We use AI, machine learning and bespoke software engineering to improve profitability and performance for our clients, most of whom are global science and engineering organisations. My role is varied and includes collaborating with clients to help them understand the challenges they face, interrogating their data to identify potential solutions, and developing custom software that solves their problems. My degrees at the University of Nottingham helped me to develop a number of skills that were transferable to my job. My undergraduate in psychology gave me useful presentation and communication skills, and an understanding of statistics, experimental methods, and user-centred software design. During my PhD I developed data analysis, programming, collaboration and knowledge-sharing skills, as well as the ability to quickly learn new information and technologies. This final skill has been most important, because each new project requires me to learn new skills. Tessella hires science, mathematics and engineering graduates. I have a BSc, MSc and PhD in psychology (specialising in visual neuroscience), but I’d encourage anyone who has an analytical or numerate degree and an interest in software development, along with a flair for problem solving and a thirst for learning, to consider a job in data science. Working as a consultant means you get to work on lots of different projects for a range of clients and you are continually learning new things. I would advise anyone thinking about a career in data science to consider two things. Firstly, think about the things you enjoyed doing in your studies – does this career allow you keep doing what you love? Secondly, the culture of the company will make a big difference as to how much you will enjoy your job – the lovely people and collaborative environment at Tessella are important factors in determining my happiness at work. Digital PR Strategist My current role is a digital public relations (PR) strategist and involves coming up with, and creating, online campaigns that we send out to journalists and online publications, in order to increase backlinks to a client’s site. This helps with the search engine optimisation (SEO) of a client’s site and (long-term) can help boost their rankings on Google. I use my psychology degree a lot, as part of my day-to-day job involves persuading journalists to cover our campaigns, and you need a lot of social intuition, empathy, and great persuasion skills to do this. We also handle a lot of data, and write a lot of pitches, press releases and copy for journalists, which is where my experience of data handling, and writing lots of essays and lab reports at university really helps. I started as a digital PR intern straight from Nottingham, after emailing an agency to see if they had any work experience. I didn’t know what digital PR was at the time, and started off as a digital marketing intern. My only previous experience going into this role was having been a student blogger, and brand and insights ambassador (both part-time jobs I held at the University), as well as being social media manager for Student Minds Nottingham (a volunteering role at the University). On the recommendation of the Careers team, I had completed the Google Digital Marketing Garage qualification, though was later told that it was my enthusiasm for learning and attitude that landed me the gig, rather than my (little) experience and qualifications. For anyone considering a career in digital PR, I would say go for it! It’s a really exciting industry to be a part of, with the job role having not existed for very long compared to other jobs in digital, but if you love writing, thinking creatively and being kept on your toes, then this would be a great job for you. Practically, any experience you can get within digital marketing, PR or (best case scenario) digital PR would be great - there are not many in-house digital PRs currently, but lots of SEO and digital PR agencies up and down the country, that you can speak to regarding experience opportunities and for advice on entering the world of digital PR. Project Manager, Rolls-Royce Currently, I am a project management graduate at Rolls-Royce. As such, I get the opportunity to work in different parts of the business for two years, before deciding what I would like to work on full time. So far, I have led £3.5m cost reduction projects to optimise the supply chain network, travelled to Turkey to establish supplier relationships and led a £40m cost avoidance program to extend the life of the Trent 1000 Engine’s critical parts. During my time at Nottingham I was involved with a variety of extracurricular activities. Looking back at my achievements, joining the Nottingham Advantage Award was the key enabler for me. After completing my first module, the Save the Children Enterprise Scheme, I secured a summer internship as marketing intern for Newell Brands (London). In my second year I completed the Award by volunteering as a brand intern for a charity in Mansfield and by participating in the Capital One Business Analyst module. Thanks to these work experiences I won the EY Enterprise in the Community Prize 2017 and secured a summer internship at Rolls-Royce. Upon completion, I was offered a place on their graduate scheme. A successful project manager is a leader who can deliver any kind of project on time, within budget and in my case, working with a team of engineering specialists. Variety is key as every project will have a different flavour. Therefore, my advice to you is very simple: while at the University, engage in activities that demonstrate your ability to stretch yourself to adapt to different contexts, for example the third sector, corporate world and so on. This exercise will prepare you to manage ambiguity and become a confident project manager. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}