{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/sport-rehabilitation.aspx",
    "content": [
        {
            "p": "A first degree in sport rehabilitation can lead to a diverse range of employment and postgraduate study opportunities. We expect the majority of students to commit to careers in the sports and wellbeing sector undertaking roles such as: Others may decide to look at jobs outside of science and enter a diverse range of roles ranging from law, finance, public relations, teaching, and charity work. We invited four professionals to talk to you about their roles in sports rehabilitation: Login to SharePoint to watch a recording of this event The British Association of Sport Rehabilitators and Trainers (BASRaT) is the UK regulator for sport rehabilitation states: ‘As the number of people participating in sport and exercise at all levels continues to increase, so too do the diverse demands on healthcare practitioners. Couple this with the nationwide drive to make Britain a healthier place and get people of all ages and physical conditions exercising; there is a definite need for exercise and rehabilitation professionals who can work alongside and complement the existing healthcare practitioners. Sport rehabilitators help people suffering from pain, injury or illness involving the musculoskeletal system. They help people of all ages to maintain their health and fitness, recover from and prevent injury and reduce pain using exercise, movement and manual based therapeutic interventions. The course at the University of Nottingham is accredited with BASRaT which entitles graduates who meet their entry criteria to apply for full graduate membership and bestows the professional title of graduate sport rehabilitator. Find out more about BASRaT As expected, the majority of sport rehabilitation graduates will go on to work in the health and sport sector. Employers can range from the: Opportunities for BASRaT graduates are advertised nationally and will appear under a variety of job titles including: Starting salaries range from £18,000 to £25,000. Please note that further qualifications or accreditation may be required as well as your degree. Professional body membership (such as BASRaT) and suitable insurance coverage is often required for employment. You can also explore the following websites to assess the job market and internships opportunities. BASRaT Jobs in Sport Leisure Jobs Careers in Sport Sporting Opportunities Sport England Joining LinkedIn could be valuable as you can find other sport scientists, track their careers to date, and perhaps make contact with them. Or you could join a specific online community. Advice on LinkedIn profiles and making contacts on the BASRaT website To ensure currency and safety in practice all graduate sport rehabilitators are required to complete continuing professional development (CPD) to compliment, update and further specialise the knowledge gained as part of the BSc (Hons) Sport Rehabilitation programme. Some graduates will choose to complete additional qualifications or short course learning in areas such as Strength and Conditioning with organisations such as the UK Strength and Conditioning Association (UKSCA) or the National Strength and Conditioning Association (NSCA), dry needling and or specialist manual therapy skills with short course providers or further their studies to higher degrees at universities in allied subjects such as Physiotherapy. The UKSCA state that: having a degree does not make you exempt from completing the UKSCA’s accreditation process but of course the knowledge and skills you have obtained should support you in your assessment. Topics they will cover include: Away from sport you could be active in the community or student societies and make a positive contribution to the communities you live within As well as the skills developed on your course, participation in extracurricular and work experience, organisations large and small are also looking for students to have developed a range of attributes such as the following while at university. What employers seek from candidates is evolving all the time and it is important that you keep up to date with recruitment trends in the career areas that interest you. Knowledge and understanding of child protection issues will be required if you apply for jobs with young or vulnerable people. For example, The Football Association may ask you to hold a current FA Safeguarding Children Workshop certificate (or willing to complete a FA Safeguarding Children Workshop certificate). Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. You may decide that a job on graduation is not for you and consider undertaking a masters degree or PhD in sport science. There are a variety of Level 7 MSc qualifications such as Strength and Conditioning, Physiotherapy and Public Health. Short CPD courses are also commonplace within this profession. For some PhDs a masters degree might be preferred. Examples of PhDs include: FindAMasters Prospects - for masters courses FindAPhD Jobs.ac.uk - for PhDs Further study telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}