{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/first-weeks/wins.aspx",
    "content": [
        {
            "p": "A quick win is an improvement or outcome that can be speedily delivered and has immediate benefit. Ideally it will be relatively easy to implement and inexpensive. Delivering a quick win is a good way to make a useful contribution and prove your value. Plus, having something to get stuck into in the early days will give you a sense of purpose and allow you to build practical knowledge, and when you deliver, you’ll also get a confidence boosting sense of achievement into the bargain. Ask your manager what are the first things they would like you to achieve and when they would like you to complete them by. This will give you a clear understanding of their expectations and provide a timeframe to work with. Establishing this level of clarity early on will help you prioritise action and deliver your first quick wins. Look out for everyday issues, perhaps small things that cause mild frustration but have just become widely accepted, and then try to find a fix. Use the critical thinking skills you have developed at university to unpack the problem, look at it from a range of different angles, analyse any available data, and then develop potential solutions. Organisations often take on an intern or placement students or recruit a new graduate because they want people who can offer a fresh perspective and mix things up a bit. Your everyday points of reference are likely to be different to people that have been in work for a while, so you’re well placed to offer a new way of looking at something. Use this to offer constructive contrast and gently challenge the status quo. That said, don’t push it too far. There is a fine line between helpful disruption that spurs collaborative creativity and irritating more experienced colleagues by constantly questioning the way everything is done. Ask questions. Your questions will provide that fresh out of the norm insight that they need to improve what they are doing every day. Always remember, they hired you because they know you can add value in so many different ways, at this stage, questioning will be your way of adding value. Yousif Mohamed, UoN alumnus, Manufacturing Engineering and Management, 2016. Although it’s important to clearly define the overarching aims and eventual desired outcomes of any project you’re asked to work on, it can also be useful to build in a series of smaller, shorter term goals. You can then use these to generate quick wins by delivering positive results at regular intervals. Plus, it will also help you to build momentum and stay on track. Ask colleagues how you can lend a hand. People often have tasks lurking somewhere near the bottom of their ‘to do’ list that they just can’t seem to get around to doing, so offer to take one of these on. It might not turn out to be super exciting but helping someone out will win you brownie points and demonstrate that you’re a team player. One small note of caution though, be careful not to take on more than you can do or become so engaged with other people's work that you lose sight of your own tasks. If you have finished all the work initially assigned to you, don’t be afraid to send out an email or go to a colleague's office and let them know that you have capacity to take on more work. This is a balancing act, you don’t want to take on too much, but showing enthusiasm to help out your team will take you a long way. Andrew Drylie, UoN alumnus, Law 2019 Once you have a couple of quick wins under your belt it’s worth thinking about how to share your success. No one likes a show-off so constantly bragging about all the fantastic things you’ve achieved is likely to irritate people. However, being too modest and allowing your achievements to go unnoticed won’t help you either. Try to find subtle ways to note the positive impact you’ve had, for example, you could include a few details about your successes when catching up with your manager or mention quick wins as part of an activity round up in team meetings. Crucially, when doing this, don’t forget to thank anyone who helped you to achieve your quick wins. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}