{
    "url": "https://www.nottingham.ac.uk/careers/students/furtherstudy/why-further-study.aspx",
    "content": [
        {
            "p": "There are lots of reasons why you may be considering further study. It maybe a requirement of the sector you want to go into, to gain further skills and knowledge that can benefit you in the future or to study a topic you're passionate about. If you’re serious about your future, then you’ll need to carefully consider how it could help you achieve your ambitions. Book a careers appointment For some career areas, further study is a minimum requirement for entry into a profession, such as: teaching, legal careers, and social workers. A PhD is now essential if you want to pursue an academic career. In other career areas, such as journalism, and marketing, a masters – although not essential – can be advantageous. The same is true if you’re looking to become a patent attorney: a PhD is not a requirement but it is desirable. Find out if further study is a requirement of your chosen sector You may be motivated to continue your studies because you have a passion for your subject or want to specialise in a particular area. Depending on your longer-term career direction, a higher-level qualification may be attractive to a future employer – for example, within the scientific or engineering fields. A postgraduate diploma in brewing will lead to opportunities within the food and drink industry and a life science PhD will be attractive to employers in the pharmaceutical sector. You may be unsure what careers will suit you so continuing your studies offers you more time to decide. However, we recommend that you take advantage of the wide range of extracurricular activities available to enhance your personal and professional development alongside your studies. Employers will be interested in hearing about the additional skills gained during your masters or PhD as well as those developed through other activities. There are some opportunities specifically designed for postgraduate students such as Researcher Academy Placements and the the Nottingham Advantage Award. Read Isobel's blog post: Two years ago, I never could have pursued further study Read Priya's blog post: Making the most of my masters year helped me get a UK graduate job Read Rebecca's blog post: Discovering a love for research Read Maya's blog post: Studying for a PhD - challenges and opportunities Image by Džoko Stach from Pixabay telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}