{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/arch-env-engineering.aspx",
    "content": [
        {
            "p": "Architectural environmental engineering graduates are valued by employers in many sectors. Our graduates do well in securing employment in related and non-related sectors of the graduate employment market. Talk to an adviser Check out our Search for vacancies or internships The majority of architectural environmental engineering graduates progress into graduate roles within the architecture and built environment sector, or into further study. Some BEng and MEng graduates will move directly into graduate engineering roles, particularly within building services engineering, and may choose to work towards chartered status through the Chartered Institution of Building Services Engineers (CIBSE). CIBSE Not all engineering graduates choose to go on to become engineers - in addition to your professional and technical skills, your architectural environmental engineering degree will equip you with key transferable employability skills to employers in all sectors such as: Here is a sample of the employers who recruited our architectural graduates over the last few years: Our architectural environmental engineering graduates working in this sector have gone to work for a range of companies including global engineering and construction firms such as Atkins, Arup and Laing O’Rourke to smaller national and regional consultancies such as Pick Everard, Preston Barber and Long & Partners. Explore careers in building services An architectural environmental engineering degree could also lead to other engineering related roles, particularly within the construction, sustainability and environmental sectors. Not all Engineering graduates become engineers. Many of our graduates find alternative opportunities where they are able to use their transferable skills; problem solving and analysis, project management, high degree of numerical and computer literacy, team working and communication. Recent graduates have moved into roles such as: They work for companies such as: Some students will progress into further study at postgraduate level in both engineering and non-engineering related areas. Examples of recent further study destinations of architectural and environmental engineers include: Postgraduate study can be a way to develop a further specialism in a particular area of interest, either through carrying out research or undertaking specialist taught modules. It can also be a way to gain skills and qualifications in areas outside engineering in order to progress into alternative careers. For students doing a BEng qualification, undertaking an accredited MSc could give you the level of qualification necessary to progress on to become a chartered engineer and to meet the entry requirements of some graduate engineering employers who ask for a masters level qualification. For students doing an MEng degree, undertaking an MSc won’t give you a higher level qualification, but it can be a way of specialising in a particular area. Regardless of whether you are a first year or final year, developing skills outside your degree will enhance your CV and allow you to provide evidence of these in applications and at interviews. We have a wide range of opportunities at the University for you to explore: An industrial placement will enable you to gain industry experience, crucial for your career development. Industrial placements Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge The Nottingham Advantage Award offers interesting extracurricular modules to develop and reflect on your employability. With over more than 200 modules across our three campus in the UK, China and Malaysia. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union Architects Lectures We offer a range of events to develop your skills and meet employers throughout the year. Check out: Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. All About Careers - what can I do with my building services engineering degree? Architects Registration Board Building Engineering Services Association Chartered Institution of Building Services Engineers Engineering Council Environmental careers Prospects - building services engineer job profile Prospects - architect job profile Prospects - property and construction sector Royal Institute of British Architects telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}