{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/law.aspx",
    "content": [
        {
            "p": "Whether you want to be a lawyer or not, a law degree gives you plenty of career options to choose from. Many law students choose to pursue a career in law, others do not. It is your choice. As an aspiring lawyer, a career in law offers you an amazing array of opportunities domestically and internationally. Your choice of legal career very much depends on your motivations and values be they your earning potential working for a city firm, being driven by equality and fairness and access to justice, working for the government or other public body, or working in-house? Some students do not pursue the LPC or BPTC and choose an LLM instead. Book an appointment or attend a drop-in Check out our careers events In addition to your subject knowledge your law degree equips you with key skills valued by employers: The graduate labour market is competitive and you need to be prepared to excel in all stages of the recruitment process The legal sector is especially competitive with approximately 5,500 training contracts and 541 pupillages offered each year. Legal employers expected candidates to be commercially aware, have an understanding of the firm as a business (commercial awareness) and have personal qualities such as leadership, teamworking and good communication amongst others. You may not want to pursue a career in law at all, that is fine too. A law degree is valued by private and public sector organisations across the whole of the economy. Whatever your aspirations, law or not law, there are a few questions you need to ask yourself: Our law graduates secured employment across a diverse range of sectors, but the key sectors of employment for our graduates are: Visit the Prospects website for further Information on qualifying as a solicitor and the Solicitors Qualifying Exam (SQE) Find out about qualifying for the bar Some students decide to continue academic study and choose to study an LLM. Find out how to choose an LLM Three law alumni give an insight into their work, their route into the profession and advice if you want to become a solicitor or if you are undecided about which route to take. Speakers: Login to SharePoint to watch the webinar There are lots of things you can do to improve your employability and raise your awareness of jobs and professions. Barrister and solicitor Explore alternative careers with a law degree How to become a solicitor How to become a barrister More graduate careers telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}