{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/physics.aspx",
    "content": [
        {
            "p": "As a physics graduate, you will be equipped with a range of scientific, technical, computational and problem solving skills that are highly valued by employers and which will enable you to progress into a wide range of career areas. The most popular first career destinations for physics graduates nationally are: (Source: HECSU – What Do Graduates Do? 2020/21). In addition to your subject specific knowledge, your physics degree will equip you with a range of transferable skills including: Due to the wide range of potential career options and sectors open to you as a physics student, it is important to start to consider your options early on in your course. Look for opportunities to gain relevant experience and skills within your areas of interest whether this is in a scientific or in a non-scientific sector. Summer internships are a great way to gain experience, whether in science or non-science based roles. The Nottingham Internships Scheme, for example, offers a range of local paid internships with companies in Nottingham, and other sources of vacancies are listed on our work experience pages. Find out more about work experience opportunities for Nottingham students School of Physics and Astronomy - internships White Rose Industrial Physics Academy WRIPA (links with Nottingham) WRIPA - student video case studies Around twelve paid summer scholarships are available to physics undergraduate students. The research projects in the School would take place between the second and third year OR third and fourth year. School of Physics & Astronomy - summer scholarships A Year in Industry placement is a way to acquire invaluable professional skills and gain insights into a profession while you study. It also increases your employability. School of Physics & Astronomy - Industrial experience Get involved in activities including volunteering and societies such as NatSciSoc. Students' Union Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs Nottingham Advantage Award You should have a good grasp of the fundamentals of coding through MATLAB. Coding skills are highly valued by employers in a number of different sectors. If you are interested in this area, look out for opportunities to learn and try out other programming languages either through the university or via online resources such as: Codecademy Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Within the science and technology sectors, physics students are appreciated for their fundamental depth of understanding of scientific principles and their ability to apply these to solve problems as well as their technical and IT skills. These can lead to careers in sectors such as IT, advanced manufacturing, engineering, defence, space, medical science, meteorology, nanotechnology and energy. In the commercial world, physicists’ numerical and problem solving skills are valued and well-utilised and business, finance and data analysis. Physics skills and knowledge can also be applied to a range of other sectors including patent law, science communication and teaching. Roles entered: Technology and Computing Business and Finance Healthcare science Engineering Other areas Companies joined The White Rose Industrial Physics Academy (WRIPA) holds an annual recruitment and placements fair in October. The employers who come to the fair are specifically interested in hiring physics students. It is an excellent chance to explore the breadth of career opportunities, find out about Year in Industry placements, summer internships and research projects in sectors from aerospace engineering and nuclear energy to scientific consultancy and software development. Find out more about the fair Our fair, also in October, hosts employers who are looking to recruit UoN students for graduate roles and internships. You will find companies recruiting in areas directly related to your subject as well as those offering a broader range of graduate and internship opportunities that you might want to consider. Find out more about careers fairs at Nottingham Institute of Physics (IoP) - Where physics could take you: Career paths White Rose Industrial Physics Academy (WRIPA) - Check out the student case studies Scientific careers Science careers beyond the lab Careers with medical physics includes case study videos More graduate careers Bright Recruits - job vacancies (part of IoP) Prospects - what can I do with my degree? School of Physics Community Moodle page A large proportion (around 40%) of Nottingham physics graduates progress into further study. Many choose to build on their undergraduate qualification by undertaking a physics-related masters course or PhD. Examples are shown below: PhDs in Masters courses: Others opt to take a postgraduate qualification which will allow them to pursue a particular career interest such as teaching or finance. In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}