{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/ampr/public-relations.aspx",
    "content": [
        {
            "p": "Public Relations (PR) is about the maintaining and promoting of reputation and goodwill of a brand, business or person through planned and sustained campaigns. A wide range of communication and media channels will be used to achieve this. What is used will depend on who is the target audience. This could vary from another business (B2B) to the general public. Whilst this is related to marketing and advertising, and at times deploying similar approaches, it is seen as a separate role. With the ever-growing use of social media, there are times when there is more blurring of the boundaries, with the increase of communications (‘comms’) agencies which can cover all three areas. See our other sections on marketing and advertising However, there are still many roles and companies with a specific PR remit. Return to the A-Z jobs list Book a careers appointment Find events relevant to this area We invited four speakers to talk to you about their roles. They share details about their career paths and give you top tips on how to crack into this industry and what the essential skills are. It's also your chance to hear about the latest industry trends, and what the emerging skills are for this sector Lucy Faulkner, PR Account Manager, BA English 2018 Katie Moncur, Social Media Officer, BA English 2020 Login to SharePoint to watch a recording of this event Public relations (PR) is all about maintaining a good impression of a company, brand, or individual in the media. PR professionals typically spend their time: Prospects PR officer job profile This is a question often asked here in Careers. While brand reputation and promotion is important in all three areas, there are differences. Marketing is the process of understanding the competitive marketplace, identifying customer requirements, and the strategy and implementation of raising awareness of a product, person, service or organisation. It covers a very wide range of elements from product development and pricing through to promotion and the physical presentation of goods and services. Marketing has various specialist roles such as market researcher, copywriter or content marketer, digital marketing and/or social media executive, SEO specialist, web designer and many more. Advertising and PR are often a strategic element of wider marketing activity. Advertising raises awareness of goods and services, and is usually part of the marketing plan. Typically, a marketing manager will go to an external advertising agency to develop and produce the campaign which could feature TV, radio, posters, the internet, newspapers and magazines, depending on the audience and budget. In today's age of social media, putting an ad out is only the start as subsequent impact on social media is vital. Think of a Christmas advert such as John Lewis' and the social media commentary that follows. Find out about advertising Find out about marketing Public relations roles are typically found either ‘in-house’, which means they are employed by a business or organisation directly, or in a specialist PR agency which has contracts to provide PR services to other businesses, organisations, or individuals. Many large organisations employ their own PR team. The name of the team can vary, but is usually something like 'media relations', 'press office' or 'external affairs'. Most towns and cities in the UK, including Nottingham, have PR agencies. You might be interested in seeing PR Week's list of the Top 150 PR agencies in the UK. PR Moment is another good resource Agencies and consultancies may specialise in one industry sector, or cover several. Sectors that make regular use of PR are: In today's world we all take immediacy of information for granted. The vital challenge for PR professionals is how you integrate PR through all mediums in real time. This requires coordinating all communication channels including social media and news platforms. Video is often used to develop brand awareness and engage with audiences. Print journalism and writing press releases to generate publicity are also part of the toolkit of PR. PR is increasingly about supporting lead generation for marketing and sales. There are many debates about the roles of content marketing whose goal is to increase the demand for a product or service through useful information, and brand journalism which finds and tells the stories that convey a brand's personality. The Chartered Institute of Public Relation’s (CIPR) website is useful to keep up to date with PR news and developments. Job titles you can expect to see depend on the organisation: Many entrants to PR are graduates, and most of these enter after an undergraduate course. While there are degrees in public relations and marketing subjects, PR is open to graduates of any discipline. There are masters degrees in PR available around the UK, but they are certainly not essential to enter the profession. Whatever qualification you have, employers will be looking for evidence of passion for this field, ideally having undertaking some relevant experience. Knowledge of the digital world is very important. You should have a good working knowledge of social media platforms, and be sure to think carefully about your own personal brand and how you present yourself online. Although writing press releases is only part of the job, knowledge of writing for a publication or website would be useful. Many PR companies around the UK offer work experience placement opportunities. A lot of these are never advertised so you will need to do a lot of research and make speculative approaches. Sending a covering letter and CV is the most common method, but bear in mind that a company will often receive numerous approaches so think creatively about how you might make yourself stand out. Another method could be to ring the company and ask them questions about the profession and about any possible work experience opportunities. Charities are a great source of acquiring relevant experience as they often require help with websites, digital newsletters, etc. A great source of experience while at University could be to get involved with University publications – this could be for societies or magazines such as Impact. MyCareer is our online database of vacancies and you can also register for events. Login to My Career to search vacancies Yell.com The Nottingham Internship Scheme offers paid internships with locally-based companies in marketing and PR-related roles. Nottingham Internship Scheme Experience in marketing can be very useful if you're interested in a PR role. The Chartered Institute of Marketing can be a useful source of information, and you may want to read our section on marketing. Taylor Bennett Foundation Exists to encourage black, Asian and minority ethnic graduates to pursue a career in communications through award-winning internship and mentoring programmes. Chartered Institute of Marketing MediaCityUK Read our marketing section Campaign PR Week jobs PR Moment is another useful resource Demonstrate a genuine interest in current affairs Highlight your communication skills Emphasise relevant work experience, whether it was paid or voluntary Link to your social media accounts, including LinkedIn, and any other relevant activities such as blogs/vlogs etc. Ensure your content supports your personal brand you are presenting to the employer. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Attend a Spotlight On or other sectors event during term Apply for the Nottingham Internship Scheme Come and talk to us about your options Think about volunteering telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}