{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/beyond-few-weeks/development/continuous.aspx",
    "content": [
        {
            "p": "Continuous professional development (CPD) is a big deal. It's about: Abi Bennetts, UoN alumna, Psychology, 2018 CPD may be mandatory or optional and takes many different formats. A training course is perhaps the most obvious example of CPD, so we’ll cover how to make the most of these, but any activity from which you learn or develop professionally counts so think creatively. When considering what CPD to undertake it’s worth reflecting on your recent performance and identifying how you would like to further develop, as well as thinking forward to anticipate what’s coming up in order to future-proof your skillset. Imagine this: you book a training course but forget all about it until the day before, rush to the event with your mind on other things and fail to fully engage, and then become immediately consumed by business as usual on your return to the workplace. This is hardly a recipe for maximising learning. Here's our advice to avoid this situation. Even if your organisation is very pro CPD they won’t have an endless staff development budget. Sometimes you will have to make a business case for any learning activities that aren’t seen as standard or essential, particularly if there’s a big financial or time cost. If, having done your research and thought it through carefully, you feel there would be real benefit in you accessing a CPD opportunity, you will need to articulate this convincingly. Highlight how it aligns to a specific project or development goal, what you will be able to do better as a result, and how any key learning points can be shared with your wider team or department. It’s not all about training courses and qualifications. Small everyday CPD activities can really add value too. Try these: As you become more experienced and begin to build professional knowledge try to share this with others. Next time you’re introduced to a new starter offer to help them get to grips with something useful. Not only will this provide a warm fuzzy feeling, but people will often reciprocate so you’re likely to gain extra pearls of wisdom or fresh insight. Additionally, you could give your time to support current University of Nottingham students. Our Alumni Relations team offer a range of short and long-term volunteering opportunities. You might decide to become an alumni mentor, present at an event, or offer words of wisdom in writing. Plus, it’s a great way to pick up extra skills and make professional connections. Victoria Rowley, UoN alumna, Law with American Law, 2015 The CPD Certification Service - a guide to CPD by sector Visit the UoN alumni website to explore a wide range of opportunities for you: telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}