{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/life-sciences-and-pharmaceuticals/food.aspx",
    "content": [
        {
            "p": "The food and drink sector refers to a large and diverse range of businesses that supply the vast majority of food that people consume. While agriculture refers to the production of food, this section focuses on careers in food and drink processing (that is, the process of transforming raw ingredients into food for human consumption) and getting it to customers to buy. Return to jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment Podcast 1: In this podcast Dr. Emma Weston gives an overview of the sector and talks about the wide range of roles on offer and degree disciplines recruited from. Podcast 2: In this podcast Emma shares her knowledge of technical roles within the food sector and offers tips and advice of how to gain the skills to break into the industry. Food and drink is the largest manufacturing sector in the UK, with an annual turnover of £128 billion, according to the Food and Drink Federation’s 2022 ‘Our industry at a glance’ report. It employs around 456,000 people, and invests heavily in research and development, resulting in thousands of new products being introduced every year. Core elements of this sector include food processing, and wholesale and retail activities associated with the food and drink that is produced. There are numerous different roles available, ranging from food quality control analyst or supply chain manager. A framework, developed at the University of Nottingham, to outline key competencies for food graduate careers is available on the Institute for Food Science and Technology website. This is a rapidly changing industry, and the following topics are being identified as key priorities for the future. The National Skills Academy for Food and Drink New Food Magazine The Institute of Food Science and Technology While many larger employers have structured graduate schemes, smaller businesses tend to offer on-the-job training. Typical employers in this sub-sector include: Food Manufacture produce a comprehensive directory of the UK's leading food manufacturers and processers. Food retailers fall into a number of subcategories: Various Government departments and bodies focus on different areas of the food industry: The food industry is fast-paced and faces a range of environmental and consumer-related issues that require innovative research solutions. Knowledge Transfer Partnership (KTP) is a scheme where graduates work with an academic or research organisation to support a UK business on a specific project focused on innovation for 12 – 36 months. Innovate UK list vacancies and have further news and information on their website This includes managing pubs, clubs, restaurants and bars. While the hours are long and pay potentially not as high initially as other areas, there are opportunities to progress quite quickly, including working towards running your own business. Many roles for graduates are either in developing new food products or technical/quality assurance roles, while there are also roles in every part of the product development process such as distribution and warehousing, project management, branding, buying, business development and so on. For example, a food technologist (sometimes called scientist) ensures foods are produced safely, legally and to the quality claimed, being potentially involved in developing both new recipes and manufacturing processes. Jobs in the brewing industry may include training on the technical side of brewing and lead to industry-recognised qualifications in this area. To identify the most relevant experience for the particular role that interests you, view job descriptions and vacancy details, and talk to recruiters or individuals working within your chosen part of the industry. Networking can be a valuable way of getting a foot in the door. Start by asking for advice and then build up to exploring opportunities for practical experience. Get involved at Nottingham and enhance your job prospects. Agrics Dietetics and Nutrition Farmers Market Food (Sutton Bonington) Student Food Cooperative Industry placements Institute of Food Science and Technology Fit for Work Brewing Employability Programme UoN Agricultural Careers Facebook group - closed group, request to join BBSRC Nottingham Doctoral Training Centres Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Recent reports suggest that the food industry struggles to recruit and retain good science graduates. This is largely due to a lack of awareness of the numerous opportunities available. If you think that this industry might be of interest to you, careful research and the development of some relevant experience, for example, working in a supermarket to gain better understanding of consumers, or on a farm so you can familiarise yourself with animals and see the day-to-day issues first-hand, will give you a clear advantage in the application process. While there are specialist degrees available, many of the roles across the food industry will be relevant to those with a biology, chemistry, engineering or healthcare-related degree. You may find that a masters qualification is an advantageous way to build your specialist knowledge, particularly if the role you wish to apply for is a technical one. For research roles, a PhD may be required. Specific skills will vary between different jobs, but a career in this industry is likely to require the following: Large recruiters such as supermarkets or Government departments will have clearly defined and well-advertised graduate recruitment processes, often starting their recruitment in the autumn term, prior to graduation for roles starting the following summer. Smaller organisations such as specialist retailers and research consultancies are more likely to recruit as demand arises. Small and medium enterprises account for over 96% of businesses in the food and drink sector. Specialist recruitment agencies and job boards include: Foodman Jobs - for roles in food manufacturing processes including graduates Jobs.ac.uk - advertises research roles within the agri-food industry Food Careers - agency covering global and the UK food manufacturing sector telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}