{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/nutrition.aspx",
    "content": [
        {
            "p": "A food and nutritional sciences degree from the university is accredited by the Association for Nutrition and offers you the chance to study nutrition alongside animal and plant production, food science and food safety, as well as biochemistry and physiology. The skills you’ll develop during your degree will give you the skills to apply for a variety of jobs. Follow the Biosciences Teams site You will develop your understanding of the science around nutrients and their effects as well as the social factors which influence nutrition. A nutrition degree covers food production, food science, physiology, behaviour, psychosocial issues and legislation. It also develops your skills in: From your degree you will be developing skills such as communication, working effectively with others, digital competency and reflection – skills that are highly valued by employers. You will also develop 12 competencies which have been divided into these four headings: Explore the Biosciences Core Graduate Competencies It is also worth thinking about the skills you are developing outside of your degree such as part-time work, work experience, voluntary or student society involvement. These will be very useful for future job applications. Some larger food companies offer year in industry placements that may be of interest to nutrition students, such as Nestlé and Marks and Spencer. These internships sometimes aren’t as specific as being ‘nutrition internships’ but can be related to your degree and give you a great experience of working in a large corporate food business. For these types of internships you will find that applications will close in November or December for an internship to start the following summer, so do plan to apply early. Summer internships are also a great way to gain experience, whether in science or non-science based roles. Search for roles: My Career - internships from companies targeting Nottingham students Nottingham Internship Scheme Sources of vacancies for internships If you would like to gain experience working in the NHS, you can approach your local hospital. While you are living in Nottingham you can apply for work experience placements in the East Midlands. Unfortunately the hospitals do not have nutrition-specific opportunities, but experience of working with patients on various wards (for example, gastroenterology) could give you valuable experience of working in a hospital environment. Work experience in the East Midlands - Health Education England If you have enjoyed the research elements of your degree so far, you might like to build further research and laboratory experience. This is particularly valuable if you are considering undertaking PhD after graduation. Summer research placements through the School of Biosciences depend on the research being conducted, but it is worth approaching the academic staff working in the area of research that you are interested in as there may be an opportunity for you to work on a research project over the summer. The Nutrition Society - Studentships Royal Society of Biology Studentships Volunteering is an excellent way to gain experience of working with different community groups or caring for others. You can also find experience working with food and cooking via Food Banks and community cafés. Opportunities being ad advertised by the Volunteer Center will vary year-by-year. Keep an eye out for anything related to food, health, or working with people in the local community. Volunteering Nottingham CVS - volunteering at a cafe or food bank You might be considering using your food and nutritional sciences degree to teach the next generation, or you might be interested in working as a Nutritionist for a contract catering company providing healthy school meals. Either way gaining experience in schools will be valuable. There is information on how to gain teaching-related work experience here: Career paths - Teaching Graduate Prospects - volunteering in schools Get into Teaching Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs You might be particularly interested in the STEM Outreach Scheme. Nottingham Advantage Award - find out more and explore the modules on offer Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Food and nutritional sciences students move into a wide variety of jobs after graduation. Jobs that are directly related to your degree include: Jobs where your degree would be useful include: It’s worth bearing in mind that many careers are not degree specific, so you could look into a range of careers open to all graduates, particularly as job openings for nutritionists are limited. Roles open to graduates from all subjects include: management, finance and banking, marketing, retail, public relations, consultancy, sales, recruitment and business in a wide range of sectors. Examples of employers who have recruited our nutrition and food science graduates Some of the jobs secured by our graduates: In this podcast Dr. Emma Weston from the University of Nottingham gives: Over the past few years approximately 20% of food and nutritional sciences graduates have gone into further study after graduation. This could be to complete a Masters degree to further specialise (for example MSc nutrition and exercise science) or it could be to complete a research degree such as an MRes or PhD. Some graduates pursue a career in teaching and study a PGCE after graduation. Find out more information on choosing further study, sources of funding and application support In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar Careers in public health - written by our team Science Careers Beyond the Lab Institute of Food Science and Technology Tasty Careers Healthcare jobs Association for Nutrition - check out the study and careers pages NHS jobs NHS Careers - working as a nutritionist Prospects (Food Science) Prospects (Nutrition) Knowing about the latest developments is important for a couple of reasons: firstly it may spark off your interest in a particular part of the sector and secondly, employers often ask questions about the factors that may be affecting their company at an interview as a way of gauging your interest in their business. The Nutrition Society news NHS News - search for food and drink articles The latest from BBC diet and nutrition telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}