{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/medicine/planning.aspx",
    "content": [
        {
            "p": "You may think that having decided to study medicine your career is mapped out for you. To some extent it is – there is a very structured training pathway and a fixed number of specialties as a doctor. But, add to the mix sub-specialties, choosing where to train and competition for places, or making decisions such as whether to take a career break, undertake some form of academic training, or work part time, and the picture is very different. And from time to time, you may even question if a career in medicine is for you. Your career in medicine homepage While you can formulate a career plan without expert help, it can be more effective if you collaborate with a career professional or with professionals already established in your target career. Book an appointment Health Careers - planning your career Finding the right path requires careful thought and planning, and often some difficult choices along the way. How you respond to changes and opportunities which come along also determines your career direction. The 'perfect career' may not exist and if it does, it will look different to different people. Having a career plan will not guarantee you’ll land the 'perfect career' but it will provide you with a focus and framework to move forward. Many of us spend time planning holidays, birthday and wedding celebrations, or society activities. But how much time have you spent planning your career? Career planning is a structured process for analysing your skills and interests, researching options, formulating goals and devising strategies to achieve them. Among the issues you have to clarify: Career planning in action! Hear from two F2 doctors, a fourth-year student and a consultant about how you can use your Clinical Phase to develop your self-awareness, understand the demands of a specialty and make decisions about your future. Identify your strengths and limitations and work out what makes you tick. Ask yourself what motivates and demotivates you and what you really value. To help raise your self-awareness you can have a go at completing the Profiling for Success questionnaires to identify your preferred learning styles, personality traits, career interests and values. You may also find it useful to seek feedback from peers, tutors and colleagues. This important step is often overlooked, but by identifying what you like and dislike, and what’s important to you it can help you to critically evaluate your options. At this stage you will need to start making some choices. You may choose to take a structured approach to compare your options and reach a decision. Or, you may make decisions more instinctively. If you are struggling to make a decision, it may be that you need to go back to stages one and two and gain more clarity before trying to 'match' what’s important to you and what you have to offer. You may find it useful to talk through your options with a careers adviser at this stage. As part of your thinking it can be helpful to have a plan A, B and even C; certainly to have a contingency plan in case you don’t manage to get into your first choice option. Whatever your decision, you need a plan to bring it to reality. This may be to give you the best possible chance to be successful in applying to your specialty of choice, or if you’ve decided to diversify with your medical degree, it could be to apply to different roles upon graduation. Or, it could be to take some time out after foundation school before starting specialty training. Some general principles apply; think ahead as much as possible and work out what you can do to be successful. This could mean: If, like the vast majority of medical students, you decide to go into Foundation Training and then onto Specialty Training in the UK you can find plenty of information about the schemes, the entry requirements and application processes on the programme dedicated websites. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}