{
    "url": "https://www.nottingham.ac.uk/careers/students/work-experience/on-offer/digital-marketing-academy/index.aspx",
    "content": [
        {
            "p": "Ever wondered how search engines rank websites? Curious how those adverts landed on your feed? If so, digital marketing could be for you. Digital marketing is a fast growing and rapidly changing industry. The Digital Marketing Academy (DMA) will allow you to learn about and develop a wide range of industry-specific skills. Experienced professionals from leading digital agencies will provide insight in to what they do and how they do it. You will have the opportunity to obtain industry recognised qualifications and put your newly acquired skills in to practise. Find out more about the role of a digital marketer The Academy is now closed for enrolment for 2024/25. If you are interested in taking part in the next academic year, please express your interest below. Express your interest The Digital Marketing Academy is open to all University of Nottingham and Nottingham Trent University students, regardless of year group or subject. Recent graduates Nottingham alumni who graduated in December 2023 or later (for example in June 2024) are also eligible to take part. The DMA will begin with an in-person event on Thursday 7 November, held on University Park. We’ll bring the industry to life with presentations from digital marketers, walk you through the Academy programme and answer your questions so you can decide whether you want to join the Academy then and there. *This event will not be recorded. If you don’t attend the launch, you can also enrol in the DMA for a few days following the launch event. Details of how to do so will be published here from 8 November. You’ll need to independently read through the information provided and ensure that you’re familiar with what you need to do to complete the Academy. Graduates: please email dma@nottingham.ac.uk as soon as you know you want to participate in the DMA, including your student ID. This is to ensure that you’re able to access Moodle where the DMA is delivered as a graduate. The Digital Marketing Academy runs between November and January and there are five steps to complete. You can progress through as many steps as you like. Digital Badges will be awarded to certify three levels of engagement: Participant: awarded to participants who complete some stages of the Academy but not all Completer: awarded to participants who complete all stages of the Academy, including or excluding the Launch event. These participants qualify to attend the exclusive insight events. Advanced: awarded to participants who complete all stages of the Academy, including or excluding the Launch event, and attend an insight event. Further details will be provided at the Launch event, and on Moodle to those who enrol on the Academy. Live event (in person) Come to the launch of the DMA, hear from our agency partners and get an introduction into digital marketing and the Academy. You can enrol for the Academy at the event, or for limited period following the launch via this website. Self-Study Begin industry-recognised online accreditations, to complete by a given deadline in January. You will complete Google Fundamentals of Digital Marketing and one other accreditation of your choice from a shortlist Workshops (online) Attend an exclusive series of online, evening workshops hosted by our agency partners. You can select workshops according to your area of interest. Workshops are TBC for 2024-25, but will be based on last year: Come to a friendly and informal networking event where you can introduce yourself to the digital marketers in person, ask follow-up questions on the workshops, and practise your networking skills. Complete industry recognised qualifications and complete the DMA. Exclusive to those who complete all stages of the DMA. Digital marketing agencies host interactive insight events, online or in their workplace. Places are limited and will be offered on a first-come, first-serve basis to participants who qualify Following the Launch event, those who enrol on the Academy will be able to access course materials via the Moodle page. For graduates who will no longer have access to Moodle, it’s important that you email dma@nottingham.ac.uk so that we can set this up for you. You don't need to be set on a career in digital marketing to get involved in the Academy. Whether or not you choose to pursue a career in the industry, the Academy will equip you with the digital skills that employers need such as: If you're keen to break into digital marketing, don’t wait until the end of the Academy to start looking for work experience or graduate jobs. Explore: Graduate schemes in marketing. Nottingham-based digital agencies Impression and Hallam Internet run graduate schemes. Applications for these opportunities usually open during autumn term and close in February, so apply early if you're interested. Application deadlines for most large organisations' graduate schemes fall between November and January. Find out more about graduate vacancies in digital marketing Internships. Check out the Nottingham Internship Scheme to find out if any marketing-related roles are currently being advertised. If you can't see anything relevant at the moment, register your interest. All internships take place during vacation periods and are paid. Discover more ways to get digital marketing work experience These suggestions should help you get started but if you'd prefer to have a chat, you're welcome to book a careers appointment. Got a question? Email us In partnership with telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}