{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/humanresources.aspx",
    "content": [
        {
            "p": "Human resources professionals (HR) are responsible for enabling their organisation to achieve its overall goals and objectives through their employees and people strategy. In practice this means recruiting the best people, retaining and developing the talent within the organisation and overseeing the whole of an employee’s ‘journey’: recruitment; induction; performance; development; and succession. HR professionals are also often responsible for ensuring employment law is adhered to through processes such as; the management of absence, discipline, grievance, flexible working, and redundancy. Current issues within this profession include: equality, diversity and inclusion, health and wellbeing of employees, talent development, apprenticeships, the use of technology and artificial intelligence and its impact on work and employment. Learning and Development (L&D) collaborates with HR to enhance employee skills through training programs. L&D contributes to career development and performance management. Effective L&D fosters talent retention and organisational success. Return to the A to Z jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment We invited five HR professionals to talk to you about a career in HR. Login to SharePoint to watch a recording of this event Graduate training schemes in HR are available, although they often require prior HR experience. When graduate schemes are unavailable, entry into HR typically occurs through roles like HR assistant, HR administrator, or general administration positions. Organisations of all sizes offer these entry-level roles, alongside apprenticeships for school leavers who choose work-study paths over full-time higher education. The Chartered Institute for Personnel and Development (CIPD) serves as the professional body setting standards for HR professionals and accrediting HR-related qualifications. Advancing beyond entry-level roles usually necessitates relevant experience and a CIPD or equivalent qualification. Read the Prospects website for further advice on how to get a job in HR Work experience in an HR setting is valuable. Consider asking family and friends if they have connections to companies offering HR work shadowing opportunities or look at our speculative applications page. Additionally, gaining administration experience through temporary work can be beneficial. Platforms like Unitemps often have admin vacancies. Larger and medium-sized companies may also offer year-long industry placements or summer roles within their HR departments, potentially leading to graduate positions. MyCareer - internships targeted at Nottingham students Prospects Rate My Placement The Nottingham Internship Scheme is also worth considering to gain general administrative and commercial work experience even though it may not necessarily be within human resources. Specialist recruitment agencies like HR Recruit, Ashdown and Nigel Wright have temporary and permanent HR and administrative roles. Vacancies are also advertised on LinkedIn. Graduate training scheme vacancies can be found on the job vacancy websites previously mentioned in the work experience section. Additionally, consider exploring other job search platforms. MyCareer - vacancies targeted at Nottingham students Civil Service Fast Stream - includes a HR scheme Indeed List of sources of graduate vacancies People Management, professional journal of the CIPD, includes HR job listings Personnel Today - job listings as well as news and advice Consider the skills that employers seek based on your specific HR interests. Showcase these skills through your work experience, even if it’s not directly in an HR setting. Key transferable skills include: Additionally, adaptability, problem-solving, and a global mindset are increasingly valuable in today’s HR landscape. Experience gained through student activities is also valued, as is a ‘can do’ type of attitude. International organisations will also be interested in what skills you have gained from a year or semester abroad. It’s important to follow the latest developments in HR and you can do this by reading Personnel Today or People Management. Current issues within this profession include: remote working work strategies, equality, diversity and inclusion, health and wellbeing of employees, talent development, apprenticeships, the use of technology and artificial intelligence and its impact on work and employment. HR Magazine - covers HR issues and latest news People Management, professional journal of the CIPD Personnel Today - for the latest news and advice HR professionals work across various industries and sectors. Typical employers include small, medium, and large private companies in fields like engineering, finance, and retail. Additionally, opportunities exist in the public sector (such as the NHS and local government) and voluntary organisations. Consider gaining work experience in sectors that interest you. The organisation’s size and nature significantly influence the HR professional’s role. For instance, in heavily unionised organizations, HR professionals focus on positive industrial relations. In smaller companies, they handle diverse tasks, including payroll. As their career progresses, HR professionals engage more in strategic planning. The role of an HR professional varies based on organisational size. In smaller organisations, HR professionals often have more generalised roles, known as HR generalists. These roles include: In larger organisations, HR is typically divided into key areas, overseen by HR managers or business partners. These areas include: For more details, refer to the definitions provided by the CIPD and the Prospects website There are a number of schemes and programmes available to you during your time at the University of Nottingham. Involvement in these could help you gain valuable experience for a job in HR: Nottingham Advantage Award Nottingham Consultancy Challenge Nottingham Internship Scheme You could also volunteer for positions of responsibility within a student society which demonstrate an ability to work as part of a team and either organise or persuade other people. Find out about opportunities through the Students' Union Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}