{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/animal-science.aspx",
    "content": [
        {
            "p": "Animal science is the study of the biology of animals that are under the control or care of humans. This includes the production and management of farm animals, nutrition and foods of animal origin such as meat, eggs, and dairy. It also encompasses the behaviour, nutrition, care and welfare of companion animals. At Nottingham, students are also encouraged to consider more broadly the interaction of humans upon domesticated and wild populations of vertebrates. Since the subject is so broad, graduates go on to challenging careers in a huge variety of different areas. In addition to your subject specific knowledge, your animal science degree will equip you with a range of transferable skills including the ability to: You will also develop 12 competencies which have been divided into these four headings: Explore the Biosciences Core Graduate Competencies Regardless of whether you are a first year or final year, developing skills outside your degree will enhance your CV and allow you to provide evidence of these in applications and at interviews. There are a wide range of opportunities at the university and beyond for you to explore. Below are some ideas of how to develop these transferable skills during your degree; make sure you look at the ‘What can I do?’ pages for even more ideas. Many charities who work with animals are supported through volunteers, so they are always happy to hear from people eager to help out. Charity Choice have produced a comprehensive directory of the UK’s leading animal charities. The Students’ Union Volunteer Centre advertises a variety of volunteering roles which can be subject to change, but recently has included roles with Cats Protection, Stonebridge City Farm and Riding for the Disabled. You can also find voluntary opportunities directly through animal charities such as the RSPCA, Bluecross, Dogs Trust or the Wildlife Trusts Charity Choice Contacting the University Farm managers or staff is a great way to build on your hands-on farming experience right here on Sutton Bonington campus. Hands-on experience is useful for any role in the agricultural industry. You could also think about harvest or lambing positions during university vacations. The University Farm website Lambing work experience 4xtrahands recruitment agency Farmer’s Weekly jobs Many kennels and livestock farms hire seasonal workers to help during busy times of the year. For example, kennels and catteries seek extra help around summer and Christmas and farms take on staff to assist during the lambing season. National Sheep Association - seasonal lambing work experience To learn more about a particular job role you could ask for work shadowing opportunities. For example, if you are interested in going into sales, shadowing an experienced sales representative in the field can give you a real insight into what the job is like and a competitive edge in the recruitment process. Attending conferences and making use of professional networking websites such as LinkedIn are great ways to start connecting with and approaching professionals. Advice on using LinkedIn to connect with professionals Companies such as IDEXX, Boehringer Ingelheim and Covance sometimes offer animal-related summer internships. Some charities offer unpaid internships that can result in a paid role at the end. For example, Sea Watch - look under Get involved section for their internships and work experience pages. Some societies and research organisations offer opportunities, such as The Fisheries Society of the British Isles which has funded summer research internships. The Royal Society of Biology has links to various organisations for internships and summer research projects. Nottingham Internship Scheme My Career - vacancy board Sources of vacancies for internships The School of Biosciences offer summer research opportunities - it is worth approaching the academic staff working in the area of research that interests you. There are also other sponsored opportunities and funding for summer research placements through organisations such as the BBRSC. If you are interested in working further afield, there are many global short and long-term animal-based opportunities. Check out: Please also ensure that you read our ‘Opportunities outside the UK’ work experience guide, which provides guidance on key practical considerations when seeking experience outside of the UK. Why not take an optional industry placement, between years two and three of your degree? This will extend your degree to a four-year programme. Find out about what's on offer. Year in Industry The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge The Nottingham Advantage Award offers interesting extracurricular modules to develop and reflect on your employability. With over 200 modules across our three campuses in the UK, China and Malaysia. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union Animal Science Society Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Many of our animal sciences graduates have moved into animal science roles but we have also seen them use their skills, experience and knowledge to enter a diverse range of employment areas. This webinar brings together five animal science UoN alumni who provide insights into their careers. Login to SharePoint to watch the webinar If you have a keen interest in wildlife, conservation, research, and education, this webinar is for you! Staff from Twycross Zoo talk about: A large proportion of our animal science graduates progress onto further study. If you want to pursue a research-focused career either in industry or academia, a postgraduate qualification is usually a prerequisite. Other graduates have opted to take a postgraduate qualification which will allow them to pursue a particular career interest such as conservation. A degree in animal science does not qualify graduates to work as veterinary surgeons or veterinary nurses, although many go on to study veterinary degrees after graduating from their first degree. British Veterinary Association Some animal technology roles may require a NACWO licence. The following companies run introductory courses accredited by the Institute of Animal Technology. A number of animal science graduates undertake a Postgraduate Certificate in Education (PGCE) in science or biology in order to train to become a teacher - a profession for which science students are currently in high demand. Find out about teaching Find out more about further study - courses, applying and funding In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Careers in agriculture and food Careers in animal health and well-being Scientific careers Scientific careers beyond the lab Animal Jobs Direct - courses, careers advice and blogs The British Society of Animal Science - funds, awards and jobs Prospects - what can I do with my degree? telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}