{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/scientific-careers.aspx",
    "content": [
        {
            "p": "As a science student, you might assume that your main options for using your scientific knowledge upon graduation either involve working in a laboratory or teaching. You aren't alone in that assumption, but you couldn't be more wrong. Science graduates are in demand across a range of sectors and occupations. The numeracy, technical, and scientific skills you can gain from your degree makes you valuable in areas such as energy, health, digital, teaching and manufacturing, but many job roles are open to graduates from any degree background. To help you make sense of your career options, read on. Return to A to Z jobs list Book a careers appointment Our graduates have embarked on diverse scientific careers in academic research, environmental consultancy, analytical chemistry, software engineering, pharmaceutical statistics, livestock nutrition and even space operations. If you think that your future lies in using your science knowledge, then explore what different laboratory-based roles are like. You may also find that taking the Science Council's quiz to find out which of the 10 types of scientists you are can help your decision making: Which type of scientist are you? Laboratory work While you might have enjoyed your subject while studying, you might not want to work in a lab or research environment but do want to work in a role where their science skills will be used. Many of our graduates chose a career in a sector outside of lab or research-based science, but where the transferable skills they have gained from their degree – numeracy, problem solving, researching, coding and analysis – are in demand. Understanding how you can use your degree across a range of different occupations and sectors associated with STEM such as life sciences, food and drink, engineering, the games industry or the environment can help generate career ideas. Explore our seven alternative careers for scientists to give you a flavour of what else is out there. Science careers beyond the lab Perhaps after your course you have decided that you want to explore a career outside of science and technology. Reflecting on how the skills and experiences you have gained while at university, through your course, work experience or extra-curricular activities, can help you secure your dream job in other areas such as international development, marketing and HR, or even the sports industry. Check out the “How do I find a career path?” section below for more help on how to reflect on your skills. Other occupational areas Perhaps you are considering embarking on a masters degree or PhD after your undergraduate degree? Choosing to undertake further study is a popular route for many science graduates to help them specialise further in their area of interest. Use our further study pages to decide if postgraduate study is right for you. Choosing further study as an option In Careers we're often asked, \"what can I do with my science degree?\" The answer is anything you want as most job adverts rarely specify a particular subject discipline. However, you may find that such freedom of choice can be overwhelming if you're trying to make sense of what your options are. A better starting point might be to consider where your interests lie and what you enjoy doing. In other words, what are your career values? Useful questions to ask yourself could be: Whether you have too many ideas or none at all, our step-by-step guide will help you move forward. Alternatively, if you have some job ideas but aren't really sure how to get into them, we’ve got that covered too. Help to find careers that suit you Environmental careers Software development Agriculture and food careers Pharmaceutical careers Biotechnology careers Medical technology careers Two of the speakers from this webinar have a scientific background. Joining Kev and Gemma are Zoe Goodwin, HR Project Manager and Chris Birchall, Education and Student Experience Manager. The speakers share how they got their role, what they do day-to-day, and the key skills they use. They also spoke about what makes working in higher education unique, including the benefits and challenges. Login to SharePoint to watch the webinar If you are looking for a graduate role which is related to science, then recruitment agencies could be one effective way of finding employment. They can offer temporary or permanent opportunities over a broad range of sectors. Sometimes when you are looking for work it can seem that many of the vacancies are being managed by recruitment agencies. What does this mean and how should you approach a recruitment agency? Recruitment agencies work on behalf of employers (clients) who will ask them for help in recruiting for a particular role. There are several reasons that an organisation might use a recruitment agency rather than recruiting themselves; the process will probably be quicker, and the agency may have access to more candidates in a niche area. A recruitment agency will also conduct eligibility to work checks and in some cases reference checks which could save the client time. Recruitment agencies charge the organisation for these services, so as a candidate you cannot legally be charged by them to help you find a job. An organisation may use more than one agency to help them fill a role as often no charge is made until a position has been successfully filled. Are you looking for temporary or permanent work? Recruitment agencies deal with permanent and temporary (also called contract or interim) work. For a permanent role the agency would charge their client a one-off placement fee when they make a successful placement, and the candidate would work directly for the client organisation. For temporary work a candidate would be employed and paid by the agency but work for the client for a period of time. This could include maternity or paternity cover, covering a secondment, or working on a short-term project. Temporary work could be a way to gain experience, try out a new sector or even a route to a permanent role. Temporary contracts can range from a few weeks up to two years in the UK. Recruitment agencies work on behalf of a number of different organisations over a range of sectors. For this reason they often have a great commercial insight into the areas in which they operate. If you can build a relationship with recruiters, they could be a great source of useful information. Established recruitment agencies have access to a large number of positions which may not be advertised elsewhere. Recruitment agencies are commercial organisations and will have a monetary interest in making placements, it is possible therefore that advice they give you may not be impartial. You may also find that recruiters only contact you when their client is interested in your CV and therefore, it is possible that the quality of service may not be consistent. Agencies may be most interested in graduates who already have some work experience. Some of the science roles you will be thinking of applying to may well be advertised by recruitment agencies and you should be able to spot which agencies are advertising the most positions at a suitable level. It may also be worth asking any friends or colleagues if they have used an agency before – they may have recommendations. The Recruitment and Employment Confederation (REC) offers advice on choosing a recruitment agency along with a members’ directory. You could also use Agency Central to help you find and select a recruitment agency. There are lots of science jobs advertised through recruitment agencies and you could choose to apply for one of these online and wait and see if the agency contacts you. Alternatively, it is worth contacting recruitment agencies and having a more general conversation about what sort of vacancies you are interested in. You could do this by email or telephone. If you use LinkedIn or a CV library website, you may find that recruiters contact you about opportunities. It is really important to have an up-to-date LinkedIn profile with a professional photograph, and you should make it clear what sort of employment opportunities you are interested in. Connect with any recruiters who contact you about vacancies. Find out how to create your LinkedIn profile In order to register with an agency you will normally be required to send your CV. You may then be invited to a registration interview where the recruiter will explore your experience and what sort of roles you are looking for. A good recruitment agency may want to meet you face-to-face so that they can really get to know you. You could look to develop a relationship with two or three agencies. Reputable agencies should be keen to spend a little bit of time getting to know you and understand exactly what your career aims and work requirements are. The agency will submit your CV to any suitable roles and organise interviews with the client organisation for you. They should be able to offer feedback after an interview process and potentially help you negotiate salary or benefits if you are offered a role. Get advice on developing your CV It may be worth signing up with two or three agencies who can help with your job search. However, it is important not to rely solely on recruitment agencies; you should continue to check jobs boards, network and undertake your own job search activities. Acknowledgement: The University of Kent Careers and Employability Service was the original source for this list. Checked and updated in 2024 If you want to explore alternative roles where your science skills could be useful, then looking at the GSK Future Leaders Programme page could provide some inspiration. It includes other suggestions for careers outside the lab that could be applicable to other organisations you may be interested in such as: Interested in a career in teaching? Watch a recording of our Spotlight On: Science Careers beyond the lab in which Emma Mizen talks about how she became a biology teacher. You may also be interested in 10 scientific careers beyond the lab. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}