{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/data-science-and-analysis.aspx",
    "content": [
        {
            "p": "With the amount of data becoming available through the use of smart technology, internet of things and web-based activities that businesses use, the need for data scientists and analysts is growing. Data scientist and data analyst roles continue to be in high demand in many industries. With the increasing availability and accessibility of data and teamed with advancements in technology and the growing value of data-driven decision-making, have contributed to the demand for professionals with expertise in data analysis and interpretation. There is simply more data to analyse which requires more people. The need for deeper analysis is growing in order to work out what is going to help with the goals of the business so companies are investing more into their data analytics. Blueera reports that data science along with cloud computing, will be amongst the top ten skills that employers will seek by 2025. Return to the A to Z jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment Search for jobs on MyCareer A data analyst is responsible for collecting, organising, analysing, and interpreting data to obtain insights and support decision-making within an organisation. Here are some key tasks and responsibilities of a data analyst: The specific data analysed by a data analyst can vary depending on the nature of the business. It may include financial data, sales data, market research data, or even data related to service users in fields like medicine or human resources. Prior to analysis, data analysts are also responsible for preparing and cleansing the data to ensure its accuracy and integrity. Once the analysis is complete, data analysts present their findings to colleagues throughout the organisation. This can be done through presentations, reports, or dashboards. It is crucial for the data analyst to transform the complex data into a format that is easily understandable for colleagues who may not have an analytical background. While data analysts and data scientists both work with data, there are some key differences in their roles and skill sets. Here are the main distinctions between a data analyst and a data scientist. Data scientists are often involved in the entire data process of a business, for instance, setting the questions within the business that will inform the analysis used by data analysts. Data scientists might use more advanced methods to produce data, for example, machine learning or artificial intelligence to predict future trends for the business. They may even be involved in creating different ways for the data to be gathered (or mined) within the business – for example, through setting up algorithms in their software or creating systems which will do some of the work for them. Quite often, a data scientist may be required to have a higher level of qualification (often a PhD or masters but not always) but nevertheless, someone with strong technical and mathematics skills is required for this kind of role. Here are some more differences to take into consideration: It's important to note that the roles of data analysts and data scientists can vary across organisations, and there may be some overlap depending on the specific job requirements. In some cases, the terms data analyst and data scientist may be used interchangeably. Data analysts and data scientists can be found in a wide range of industries and businesses, but below are some examples: There are a range of job titles that companies use for people who work with data. The duties of analyst can vary massively between companies, so it is always a good idea to read the job description to check that the role covers the areas that interest you. The more common iterations of a data analysis role include (but are not limited to) the following: Read about Nikita's career path from UoN to EY Read about Jonny's career from UoN to Modo25 You can get into data analysis without a degree especially with larger companies where there are trainee roles available. However, there are internship, placement and graduate schemes available in many companies. Getting a graduate role in data analysis is possible if you do not have any prior experience in this area. However, developing your data analysis skills through an internship or work experience placement would give you an advantage over those without direct experience. According to Prospects, employers look for applicants with: You will also need communication skills, teamwork skills and excellent attention to detail. An understanding of the sector and business that you wish to work in is important if you want to impress a recruiter. This is often called commercial awareness. For example, if you understand how the customers or users of a business behave, you can easily check data anomalies to identify any issues with the data or if the dip or spike in behaviour can be explained by your analysis. Find out more about commercial awareness For financial analyst roles, it can sometimes be desirable to have experience or knowledge of the finance industry. The requirement for higher level qualifications may vary between employers, so it is best to check the requirements of those companies that interest you. To explore further study options, use: Postgrad.com Find a PhD Find a masters Tech Academia A great to start your research is MyCareer, our graduate and internships job board with vacancies from employers targeting Nottingham students and graduate MyCareer Also use: CW Jobs DataScientistJobs DataJobs DevITjobs Indeed OnlyDataJobs StatsJobs TARGETjobs To progress through the recruitment process, you will need to: You may have some experience through your degree – particularly if you are using data analysis as part of your dissertation or projects - but if not, are there additional modules involving data analysis that you could choose? Gaining work experience will boost your CV – look out for part-time jobs or internships involving data analysis. Consider: The Nottingham Internship Scheme Nottingham Consultancy Challenge Nottingham Advantage Award - Capital One Business Decision Making Module Unitemps - sign up for part-time and temporary work opportunities Taking some free high quality introductory courses - find out more on Moodle There's also other free online courses such as edX or Futurelearn to learn new programming skills and practice data analysis techniques. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}