{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/architecture.aspx",
    "content": [
        {
            "p": "A degree in architecture forms the first stage of the professional education and training required to become a registered architect. The majority of students completing a first degree in architecture at Nottingham progress on to architectural assistant positions or similar as their next step. However, an architecture degree is also a valuable and transferable degree in its own right and can open the door to a range of other opportunities. Talk to an adviser Check out our events Search for vacancies or internships In addition to your professional, technical and design skills, your architecture degree will equip you with key transferable employability skills to employers in all sectors such as: Currently, most students completing the BArch Architecture at Nottingham and many MEng Architectural Environmental Engineering students progress into ‘stage 1 experience’ roles – generally these are advertised as architectural assistant, or sometimes junior architect, architectural intern or similar. In recent years, Nottingham students have gone on to work for a range of practices including: 70% of all graduate roles are open to students from any degree background, so as an architecture graduate you will have access to a range of alternative opportunities either in general graduate employment or within the broader construction, property, design and creative sectors. Other roles that architecture students from Nottingham have progressed into in recent years include: If you need to develop a portfolio for job applications, please go to our design portfolio webpage. Advice and information on all aspects of the recruitment process can be found on our Making applications webpages. For many architecture students, their next step in education will be to return to complete part 2 of their architectural studies, either through the RIBA accredited MArch course at Nottingham, or a similar course elsewhere. However, some students may choose to pursue other postgraduate study routes including PhD research in architecture and design related areas or masters level study either in architecture and design or in alternative subjects. Regardless of whether you are a first year or final year, developing skills outside your degree will enhance your CV and allow you to provide evidence of these in applications and at interviews. There are a range of opportunities at the University and beyond for you to explore. If you need to develop a portfolio for job applications, please go to our design portfolio webpage. The mentoring scheme gives students an insight into practice and to enhance their learning experience. Around 1,000 students and 600 mentors take part in the RIBA student mentoring scheme each year. RIBA mentoring scheme RIBA East Midlands provides provide a range of events and services for members including the RIBA’s professional development programme, management and delivery of the RIBA East Midlands Awards and the highly successful Student Mentoring scheme. Explore what RIBA has to offer Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge The Nottingham Advantage Award offers interesting extracurricular modules to develop and reflect on your employability. With over more than 200 modules across our three campus in the UK, China and Malaysia. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union Architects Lectures We offer a range of events to develop your skills and meet employers throughout the year. Check out: Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}