{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/clinical/small-animal-care.aspx",
    "content": [
        {
            "p": "Does a high level of client interaction combined with the care and treatment of pets appeal to you? The information below explores the world of small animal veterinary practices in more detail. Return to the Vets homepage Book a careers appointment The main responsibilities of a small animal vet include: There are opportunities to gain extra skills in any of these areas either through formal training or through personal interest and practise. Communicating with clients contributes to a large proportion of a small animal vet’s role. Giving advice, managing client expectations and building good relationships are as important to the work of a small animal vet as their clinical skills. Small animal practice is usually physically easier than other areas of clinical vet practice. However, it can be mentally challenging due to the volume of cases, the wide variety of conditions you will deal with and the range clients you work with. It can be very satisfying building relationships with clients and supporting their pets with various medical conditions throughout their life. Depending on the organisation, the levels of clinical practise may vary depending on facilities and equipment available. There can be a great deal of variation between practices that on paper look very similar so use your EMS as an opportunity to see how the work and environment of small animal practices differ. You may want to undertake some charity work during your EMS, spend time at small or large employers, and work in practices that have a range of vets with different advanced professional certificates and expertise. This will enable you to gain exposure to the variety of opportunities in the small animal practice and develop or confirm your interest in pursuing a particular pathway. In addition, try to gain experience across a range of environments including practices located in low socio-economic areas and more affluent areas to gain exposure to a range of needs, clients and working cultures. Don’t forget to use the EMS experience to develop good working relationships at practices and build your professional networks - you might want to apply to them for a job later in your career. Internships and residencies are not required to work as a small animal vet and many professionals in the field would recommend working in general small animal practice before deciding if you want to specialise. Vets undertake continuous professional development as part of their role to refresh or develop their skills and keep up-to-date on advances in clinical practice. Many small animal vets will undertake further qualifications and professional development during their career such as studying for a post-graduate certificate to develop their knowledge and skills in a particular area or as a stepping stone to future specialisation. Find out more about internships and residencies Read the blog post, Life as a rotating intern at Pride Veterinary Centre In larger practices you will work with a range of vets with different interests providing you with the opportunity to share and obtain ideas and knowledge for your personal development. With more staff than smaller practices, you can ask for help from a different person each time so you don't feel like you're having to go to one or two individuals all the time. On the other hand, working in a smaller practice offers you the chance to develop a few close professional relationships. You may feel more comfortable in this environment learning with a vet you know well and work closely with. Some small animal practices are described as having a friendly family culture which can provide an increased sense of belonging and job satisfaction. However, working in a small practice may lead to more referrals to specialist centres due to a lack of facilities, equipment or experienced staff in some areas of medicine and surgery. How busy a practice is can be more important than size when it comes to support. The practice needs to be busy enough for you to see a varied caseload and expand your skills but not so busy that everyone is working under stress and they don't have time to help. Gaining experience in a variety of small animal practices will help you decide which type of practice is right for you. Whether you work for a charity, in a private practice or for a corporately owned group of practices you will find that there are opportunities and challenges in all contexts. For example, all practices have budgetary constraints and compliance requirements so you will need to learn to manage these limitations or needs. You may learn complicated procedures like surgery more quickly working for a charity as these practices are unable to refer cases externally. However you may have less opportunity to get involved in diagnostics and may have less treatment options open to you in this setting (depending on the charity’s protocols and finances) as your clients are not directly paying for the service. In private practice, the options for diagnostics and treatment will be greater as your clients will be for covering the costs of service. This can be really variable so choose a position which will provide you with the level of support you need. When researching potential employers, don't be nervous of asking exactly what support you will get during your first year. As a new graduate, you should expect at least one senior experienced vet for guidance. Having a formal back up if you work out of hours and an experienced vet as your mentor is a good idea. Don’t forget the range of knowledge and experience within the wider team - experienced qualified veterinary nurses can be invaluable support. Peer advice from other new graduates and early years' vets can also be an excellent source of support as they know, or can remember, how it feels to be a newly qualified vet in your first job. All vets are continuously learning and developing their skills regardless of how long they are qualified. You can study for a certificate while in normal private practice and become an advanced practitioner; these can come with advances in salary on completion. There is also the opportunity to specialise by doing an internship, residency and diploma if you have a passion for a particular area. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}