{
    "url": "https://www.nottingham.ac.uk/careers/employers/events/sustainability.aspx",
    "content": [
        {
            "p": "Join us in our journey towards a greener future as we commit to supporting the United Nation's Sustainable Development Goals through our research, education, and community engagement. At the University of Nottingham we are dedicated to environmental sustainability, partnering with the City of Nottingham's net-zero carbon goal by 2028 and collaborating with our campuses internationally to enhance sustainability. As you participate, we kindly request that all employers align with our commitment to sustainability. We encourage you to minimise waste by utilising eco-friendly materials where possible, reducing printed materials, and adopting digital alternatives. Please prioritise energy efficiency and responsible transportation in your arrival and setup. By adhering to these recommendations, you actively contribute to responsible recruitment that echoes our values and global sustainability endeavours. If you have any questions, we’re here to help. Please contact us on: For more information on the university's commitment, please visit the Sustainability website. Thanks to online promotion, we are now able to provide information to students without the need for printed leaflets or event guides. Prior to events, information is emailed to employers and students or publicised on our website, reducing our environmental impact further by discontinuing printed welcome packs. Help make our events more environmentally friendly by reducing the number of printed materials you bring to campus. Encourage students to quickly access online resources using QR codes or Bit.ly links. If you will be providing promotional giveaways, we encourage you to offer a practical item that will both promote your message and be of use to students. Consider what the item is made of. Does it contain any recycled material? Can it be recycled when it comes to the end of its life? Think about the message printed on the item too. By not including the date or other content that would not be appropriate for future events, surplus stock can be used at other events. In a bid to reduce plastic waste we no longer provide complimentary bottled water. Please bring a reusable bottle which can be refilled at one of our fountains on campus. Publicly available water fountain locations can be seen on this map. Reusable cups are also encouraged, and discounts are offered on drinks at campus cafes when used. Recycling bins are available at all our events. Please use these as much as possible when disposing of any materials. Our event set-down teams will be happy to recycle your rubbish left at the end of the day, but it would be helpful if any cardboard boxes could be flattened. Please take any unused promotional materials with you so they can be reused. Car sharing is encouraged where possible. Please note, parking spaces are limited. Electric car points are available across our campuses. Check out their location and usage. Our campuses are extremely accessible via public transport routes and we encourage this method of travel where possible. telephone: +44 (0) 115 82 32233 fax: +44 (0) 115 951 3679 email: recruiterservices@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}