{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/maths/index.aspx",
    "content": [
        {
            "p": "As a maths graduate, you will be equipped with a range of numerical, analytical and problem-solving skills that are highly valued by employers and will enable you to progress into a wide range of employment sectors. As well as being able to speak the fundamental language of science and engineering, those with advanced mathematical skills have the ability to understand, analyse and interpret complex data, which is invaluable in many employment sectors. The common language of mathematics has become increasingly important across the employment sector. Maths graduates benefit from opportunities to work in a range of sectors, and the flexibility to change career directions as required. The most popular employment sectors nationally for maths graduates to progress into are: Source: Source: What do technology, engineering and maths graduates do? (Luminate 2021) However, career opportunities are continually expanding. In particular, the roles of data analyst and data scientist have recently emerged strongly in a range of both new and traditional businesses in which there is greater emphasis on algorithmic approaches arising from digital technology, the use of large data sets, security, communication and computer-based technology. Computer-based mathematical modelling of commercial and industrial processes is of vital importance to many employers - the use of such models usually requires good mathematical insight and the development of these models can require advanced mathematical skills. The Prospects website outlines the following skills you can expect to gain from a maths degree: You also develop key general skills that all employers expect, including: Consider taking advantage of modules and activities within the school which will help develop your employability skills such as the PASS mentoring scheme and Data Analysis and Modelling, Communicating Mathematics and Vocational Maths modules. Summer internships are also a great way to gain experience. Nottingham Internships Scheme, for example, offers a range of local paid internships with companies in Nottingham, and other sources of vacancies are listed on our work experience pages. Find out more about work experience opportunities You can now undertake a placement year as part of your degree at the end of your penultimate year of study. The placement can be aligned to your degree discipline or related to your career aspirations. Speak to a career adviser or your school for more information. BSc Maths with a Year in Industry MMath Maths with a Year in Industry The School of Mathematical Sciences run a summer research internship scheme. There are lots of opportunities to volunteer locally. Students' Union Volunteering Nottingham CVS Get involved in activities including volunteering and societies such as MathSoc. Students with an interest in business and finance could also join societies such as Enactus and NEFS. Students' Union There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Students in Classrooms Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs. Many of our second and third year students complete one NAA module as part of the Maths PASS scheme and the summer research internship scheme. Nottingham Advantage Award We advertise part-time, casual and temporary jobs on campus and with local businesses. Created just for you, the advertised vacancies can fit around your studies and other commitments. The vacancies are advertised in two places. On-campus jobs Off-campus jobs Attend sector specific careers fairs and employer events to find out more about career sectors and employers of interest. Our events programme The roles and companies below are examples from the destinations of recent Nottingham maths graduates. The Institute of Mathematics and its Applications (IMA) has a dedicated careers website for undergraduates and graduates. Technology Others The courses below are examples from the destinations of recent Nottingham maths graduates. In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar Council for Mathematical Sciences Institute of Mathematics & its Applications telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}