{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/law.aspx",
    "content": [
        {
            "p": "The majority of law students, and a good number of non-law students want to pursue a career as a solicitor or a barrister. It is important that you understand the differences (and similarities) before applying for either role. Both professions will consider law and non-law graduates, and as a consequence you will apply for opportunities (work placements, open day, mini-pupillages, training contracts, pupillage) at different stages in your academic career. Whatever career you choose, you need to be clear about: Return to jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment Three law alumni give an insight into their work, their route into the profession and advice if you want to become a solicitor or if you are undecided about which route to take. Speakers: Login to SharePoint to watch the webinar According to Chambers and Partners, there are approximately 73 broad practice areas to choose from, not counting all of the specialisms. For example, if you are interested in family law, you can be involved in anything from pre-nuptial agreements to international child abduction depending on the firm. If you want to be a media lawyer, you may specialise in film, TV, gaming, social media, interactive content, music, publishing or theatre. Once you have decided what area(s) of law interest you, you need to research who specialises in that area and decide whether you wish to apply for their opportunities. You are trying to narrow down your selection so that you can make informed and focused applications. Firms and chambers have personalities and cultures, and as such are not all the same. Depending on your interests, you might be considering local firms rather than international firms, London chambers rather than regional chambers, or in-house. You have choices, so make sure you are applying to those that match your interests, values, personality and career ambition. For information on training and qualifying to become a solicitor visit SRA and The Law Society for up to date information on the Solicitors Qualification Exam and the new route to qualifying as a solicitor For information on training to become a barrister Solicitor - The majority of law firms offering training contracts will fund SQE assessments. Legal education providers may offer scholarships along with the Law Society. Chambers students guide provides a good overview of what is available. Barrister - The Inns of Court offer scholarships to study the PGDL and the BTC. Some Commercial Sets may also offer funding. For more information visit Chambers Student Read Ella's blog: Securing a Bar Course Scholarship The lifestyle of a lawyer is something you have to consider, and depending on your chosen area of work, your lifestyle can vary hugely. This is not to put you off, but for you to be realistic about what will be expected of you in a professional environment. You can find out more from websites such as RollOnFriday (solicitors) and barristerblogger (barristers). You can find other legal blogs on Delia Venables' excellent legal resource website. Whatever area of law you are interested in, then that becomes your hot topic. If you are interested in the media, then you need to understand more than the celebrity gossip. You need to follow the legal and business stories of the media, in the media. What you also need to know is that law firms and barristers chambers want you to understand their business, their products and services, and the importance of client service – in a nutshell, being commercially aware. This does not mean having worked in a business – or even a law firm – before, but about recognising and appreciating what they do, how they do it, and how they meet clients' needs and get paid for it. Read about Panayiotis's journey into legal technology through the Nottingham Internship Scheme The legal profession provides many opportunities to gain insights and experience. Some, but not all of the experience you will undertake will form part of a recruitment process. Those that do are work experience placements (solicitors), and assessed mini-pupillages (barristers). Forage is an online platform providing free access to virtual experience programmes with world leading companies. The virtual experience programmes let you sample ‘life-like’ tasks that provide a better understanding of what it’s like to be a junior employee at that company. They take five to six hours to complete and are self paced. Forage Firms will also advertise virtual work placements on their websites. Check firm websites for details. There are several student-run societies that will give you an insight into the legal profession, and develop the skills employers need. You should also look out for societies that reflect your interests including where you may see the focus of your legal career and those that give you the opportunity for community engagement. Advocate Magazine Amnesty International Debating Union Economics and Finance Society Law Society The Mooting Society Negotiation Society Pro Bono Society The Bar Society Writing applications will be a time-consuming business. If you are to impress the recruiter you must address their needs. You have to write in a professional manner, use plain language, avoid cliches, use grammar correctly and make no spelling mistakes. Attend one of our application support sessions Book an appointment to talk to our team for support with your applications If you are a law student, a lot of your job application activity to become a solicitor will take place in your penultimate year. If you are a non-law undergraduate, a lot of your job application activity will take place in your final year. Law firms want to recruit candidates with the potential to become future associates and partners. Non-law students have as much chance as law students at becoming qualified practitioners. Job hunting for a career in law may well continue beyond graduation. Key dates for intending solicitors Key dates for intending barristers The legal profession is keen to recruit from the widest possible talent pool and there are a wide range of organisations you can register with. Law Careers Diversity Access Schemes The legal profession is keen to recruit students from all backgrounds and you should not be put off applying if you have a disability or health issues. Some law firms have linked up with organisations such as EmployAbility and My Plus Consulting who are worth contacting, attending their events and applying to employers they work with. As a student interested in law, there are many opportunities to engage with the profession and access advice, information, and guidance about choosing law as a profession. Employer recruitment events on-campus Workshops on applying for legal positions Spotlight On events looking at the working life of solicitors or barristers, or alternative careers Application and advice one-to-one appointments Student-run societies Working in this sector is not just about solicitors or barristers – in fact there are many careers that are available for you to consider. Other options for a career in law could be: Legal Operations graduate programmes are offered by Norton Rose Fulbright, Linklaters, Slaughter & May, Herbert Smith Freehills andDentons. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}