{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/first-day/impression.aspx",
    "content": [
        {
            "p": "Let’s start with a positive, you’ve already made a good impression. You secured the job so you must have impressed your employer at interview. This means you’re starting from a strong position and that’s worth remembering as it might help you to feel confident when you first start your new role. Now you just have to win over your new co-workers! Before you start spend some time considering how you’d like to be known at work. What words would you like your new colleagues to use if asked about their first impressions of you? Likeable, calm, thoughtful, curious, keen, humorous, capable, enthusiastic, warm, bright... the list probably goes on. Try to narrow this down to what feels most authentic and then consider what behaviours and approaches come naturally to you and align with these qualities. Then, in every meeting and exchange, try to actively demonstrate these qualities. Be yourself. This is painfully cliché, but it's true. If you try to be someone you're not, you won't feel comfortable at work and won't be the best you can be. Jake Lester, UoN alumnus, Msci Physics, 2018 With any luck, your new employer will have put together an induction that will include meetings with key colleagues. These are likely to be people that you will work closely with or report to so demonstrating your interest in their role and any future collaboration is important. Try to ask intelligent questions, test any early observations you’ve made, and seek their expertise and opinions. Then offer background information about yourself, perhaps what you studied at university and why this might be useful, and what you’re keen to learn more about now. This approach will signal that you’re keen to engage in working together, able to offer thoughtful contributions, and may have existing skills or knowledge that could be quickly put to good use. Chatting may sound trivial but it can be really helpful when making connections with new colleagues. Impromptu conversations can help you to find common ground and build rapport. That said, striking up and maintaining effortlessly flowing conversation can be a big ask, especially if you feel a bit nervous. So, perhaps have a few topics ready to go. Popular culture is usually safe territory, try music, films, or TV. The daily commute is another useful topic, a shared delight (or horror) at the thought of public transport may help you to bond. Or ask for recommendations, like where is the best place to get coffee or go for a walk at lunchtime. You could also seek out semi-structured gatherings such as an office book club. This provides a ready-made topic and allows you to contribute without having to lead the discussion. When I first entered the workplace I thought it would be very formal and conversations would be stiff. In reality, everyone’s human and they still want to have fun with the people they work with. Obviously certain topics should be off limits but don’t be afraid to speak about things personal or more informal. Brushing up on small talk and topics of conversation can ease those awkward coffee machine moments. Laura Ascione, UoN alumna, MSc Marketing, 2017 Remote working is increasingly common, and if you work from home you may have to put a little bit more effort into getting to know your new colleagues. Let’s face it, you’re not going to have the same opportunities to strike up conversations over the water cooler, but there are things you can try. For more advice on hybrid approaches, go to our Digital Working page Remember, making a good impression isn’t all one way. You too will be getting to know and weighing up your new colleagues. With this in mind, it’s worth keeping your eye out for colleagues that you feel could offer additional support as you settle in. You might try to spot a technical specialist who is highly skilled and open to the idea of a new apprentice, or maybe a long-serving and experienced colleague who is willing to share their wisdom and contextual insight. Perhaps most immediately helpful, another recent recruit who still remembers what being the new kid is like and is happy to answer any ‘dumb’ questions off the record. Try to spend some time getting to know these people and before long you’ll have cultivated a ‘go to’ gang of informal mentors. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}