{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/beyond-few-weeks/tasks/wrong.aspx",
    "content": [
        {
            "p": "It happens. Everything seems to be going well, you’re performing and delivering, and then all of a sudden something goes wrong. It’s okay, don’t panic. Your first step should be to recognise the problem and try to get a sense of scale. When you first notice an issue it’s easy to feel overwhelmed but try to take a moment to think things through calmly. Next, identify any immediate action you need to take in order to rectify things and limit any further damage. Then, make sure you notify people appropriately. Once you’ve got these things covered, and you have some time to reflect, it might help to try and reframe things positively. In the moment that you realise something has gone wrong, you open up an opportunity for reflection. Ask yourself: Try to give yourself a bit of time and space to think these things through; your ‘hot’ instant reaction is likely to be more emotional and harsh than a more considered ‘cool’ reflection a few days later. And there you have it, valuable wisdom generated and banked for the future! When things go wrong you have an opportunity to develop, and demonstrate, the ability to bounce back. So, hooray for that mistake you just made, now you can focus on dealing with a difficult situation and prove your ability to cope in adverse conditions. Remember, people (like your manager) can often excuse an occasional error, they’re more interested in whether or not you’re able to come through things professionally. So, if things should go wrong, try to channel the ‘keep calm and carry on’ mantra and aim to move forward with a positive mindset, made even stronger by testing times. Everyone messes up at some point. It proves that you’re human, and therefore ‘normal’ (in a good way). Regardless of what Instagram, Facebook, and LinkedIn tells you about everyone else’s perfect life and career, remember that this is often highly polished and in the real world we all have days when our performance could be described as suboptimal at best. This reality can bring you closer to your colleagues. Generally speaking, people like to help, it makes us feel good. So, presenting an occasional problem (as long as it is only very occasional) provides a colleague with an opportunity to don their superhero cape and swoop in with solutions! The chances are that they will have experienced something similar and will have helpful advice to offer. Plus, working something through together will help to build a sense of teamwork and shared enterprise. Just remember to return the favour whenever you can. MindTools - How Resilient Are You? quiz telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}