{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/beyond-few-weeks/people/politics.aspx",
    "content": [
        {
            "p": "Wherever there’s people, there’s politics! And the workplace is no different. Your colleagues will all have emotions, needs, ambitions, egos, opinions, and insecurities, and occasionally these might surface at work in an unhelpful way. Add to this a range of competing agendas and priorities and things have the potential to get messy, particularly if people start to use underhand tactics to achieve their goals. That said, it’s not all doom and gloom, although workplace politics are fairly unavoidable, you can choose how to respond. You can practise positivity and professionalism, and in turn, contribute to a more harmonious workplace. Even if you’re determined not to get sucked into workplace politics it can still be useful to understand how things work. Perhaps start with an organisational chart. This will tell you who reports to who and give you some idea of where authority sits and who is likely to make decisions. That said, it doesn’t always reflect who has the most power and influence, nor will it tell you much about informal networks, who’s friendly with who, and where loyalties lie. To really get to grips with this you might need to spend a little time discreetly observing your colleagues and tune into everyday ‘chatter’ to discern what is happening in specific circles. As well as listening to what people say, it might also be helpful to reflect on the type of language they use, the tone they adopt, the frequency of ‘hot’ topics and in what situations these arise. Over time you may notice patterns and be able to build helpful background insight. Negative behaviour and game playing usually occurs due to a lack of respect or trust between colleagues, perhaps where relationships are merely transactional or lack any genuine warmth. Try to build authentic relationships early on. This means getting to know and valuing a colleague’s strengths, bringing energy and enthusiasm to your interactions, appreciating their opinion even when it is different to yours, and being honest in all of your dealings with them. As your professional network grows and you develop strong relationships, there’s nothing wrong with asking your contacts for help. However, you should always be clear about your motivations and act with integrity. Be nice. It goes such a long way. Even if the atmosphere seems cut-throat or competitive, people will remember the ones who are friendly and nice. Imran Rahman-Jones, UoN alumnus, Economics with French, 2016 Being professional is about self-regulation and conducting yourself in an appropriate manner while at work. Adopting a professional approach can help to counter workplace politics. Here’s a few basics: MindTools - Take this quiz to find out how emotionally intelligent you are Read our blog on Kindness: The Workplace Superpower! telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}