{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/psychology/helping-others.aspx",
    "content": [
        {
            "p": "Go back to psychology page Assistant Psychologist, Birmingham and Solihull Mental Health NHS Trust My journey into this role started while at university. I took any and every opportunity to immerse myself in the career opportunities that the School of Psychology offered. These schemes offered me a sense of what it was like to work within mental health, utilising psychological knowledge. In my third year, I also worked part-time as a support worker, which allowed me direct contact with patients and clients, a crucial aspect when applying to AP roles. Read Dafinah's blog post Paediatric Occupational Therapist and Sensory Integration Practitioner working in a private practice I am a specialist paediatric occupational therapist and sensory integration practitioner at Children's Sensory Therapy Ltd. I work with children and young people with sensory processing disorder, including praxis difficulties. Most of my work currently involves assessing and treating children and young people who have experienced trauma and adverse childhood experiences (ACEs) and are fostered or adopted. There is a huge amount of neuroscience and neurology behind my current role and having a background in psychology has enhanced my learning and understanding in this area. I completed a degree in psychology and biology. I worked in a school for several years as a classroom assistant as I wanted to complete my teaching training. I then began working as an occupational therapy assistant at the same school. The work was predominantly around sensory difficulties, following a year in this role I began my masters in occupational therapy at Sheffield. I have worked in mental health in high and low secure hospitals. During this time, I completed the sensory integration course up to module three. Following the training, I began working in a specialist school for children with Autism and I am currently working on a self-employed basis. I am now studying level one sensory attachment intervention. I attend many courses that enhance my understanding of helping and supporting the child, their families and the school they attend. Occupational therapy (OT) is a huge and diverse area. You can work in many different areas (physical, mental health, neurology, brain injury, sensory, dementia, intermediate care to name just a few), as well as with a variety of different people. This is a role that I knew nothing about at school or during my degree. My advice would be to shadow OTs if you are interested in this area of work. Trainee Psychological Wellbeing Practitioner, Rethink Mental Illness About one hour after my graduation ceremony, I received a call from my future employer offering me the job I had applied for a few days earlier. I am now working for a charity called Rethink Mental Illness. They are training me to become a psychological wellbeing practitioner (PWP) which means that I am currently working three days a week in prison and two days a week I am at university learning the skill-sets necessary to become a fully qualified PWP. Read Jessica's blog post telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}