{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/event-management.aspx",
    "content": [
        {
            "p": "Event management falls broadly within the hospitality sector. Event managers are responsible for the organisation of events, which might include charity fundraising, exhibitions, fairs, conferences, concerts, weddings, musical festivals and product launches. Event managers might cover all of these types of events, or specialise in one specific area. You might also be interested in careers within leisure, travel and tourism. Return to the A to Z jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment Event managers liaise with clients, manage and coordinate suppliers and usually manage staff from the planning stage to the day of the event. This includes amongst other things, discussing with clients what they might need or want, agreeing and managing budgets, researching venues, negotiating deals with suppliers and contractors, supervising a team and marketing the event. Event managers could work for: Events management and hospitality roles are careers in their own right, but there may also be overlap with PR and marketing. Event management can be an important part of public relations and marketing, as a key tool for promotional and sales activity e.g. exhibitions and trade fairs, or to generate publicity. Events may also be linked to sponsorship deals, in which case PR professionals will manage image and reputation by the use of communications and gaining press interest in events their clients are involved with. Marketing focuses on the positioning of a product or a company in the market and on the identification and advertising of the distinctive aspects of the product or service, so again, events can be a crucial element of the marketing plan. Events managers will also need to understand PR and marketing techniques in order to ensure the target audience for their events are engaged and communicated with effectively. According to Prospects: “Many events organisations look for casual staff to help out at their events, and this can be a good way to gain skills and build up contacts in the sector”. A good way to get relevant experience would be to break down the elements of this role and think about how to develop the specific elements elsewhere. For instance, your extracurricular activities can give you valuable experience; for example organising the end of term ball or a fundraiser for a university society. Another source of experience would be getting involved in local or national charities or big national events; “in the run up to a large event, and during the event itself, staff may need to work long hours and be very adaptable, so any role where you can demonstrate an ability to work hard and think on your feet is useful”. There are a variety of sources, depending on the type of event: university websites, company websites, event specific pages or national news websites. Event Job Search - advertises event roles nationwide Travel Weekly and The Caterer - for jobs in hospitality and catering Springboard - for jobs and work experience in the sector A few examples of venues in Nottingham are: Another good way to find vacancies or work experience would be looking at the charity sector, where fundraising events are often organised: Working with clients is key, so your communication and customer service skills are very important. You may wish to highlight skills in listening, problem-solving, negotiation and relationship management. Events management also requires you to be highly organised, with excellent planning skills and attention to detail, time-management, and the ability to multi-task and work under pressure. You will also be called upon to be an effective team-member, showing additional skills such as flexibility, tenacity, and problem-solving. Additional skills are resilience and a sense of humour to manage the ups and downs of orchestrating large scale events Association of Event Organisers Association of Event Venues The Association of British Professional Conference Organisers Event Supplier and Services Association telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}