{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/arts-and-culture.aspx",
    "content": [
        {
            "p": "The arts and culture industry, sometimes used synonymously with ‘creative industries’, is concerned with creating, producing, and managing cultural goods and services. Typically, ‘arts and culture’ is understood as including performing arts, creative arts, music, television and film production, writing, galleries, theatres, museums, libraries, and other cultural attractions. It may also include architecture, sport, and tourism. The UK has a creative economy worth £27bn and culture brings £850m to UK, through tourism, each year. Almost 2.3 million jobs exist in the creative industries in the UK and it is a vibrant sector with lots of opportunities for graduate careers. Return to A to Z jobs list Book a careers appointment You may immediately think of settings such as art galleries, museums, theatres and music venues, or historical buildings, but the arts and culture industry is far broader than this. It can also include film and TV production companies, advertising, publishers, fashion, newspapers and magazines, tourist attractions etc. Roles also exist in local government, community groups, and education. As well as large commercial companies you may also find many small companies and start-ups, for example marketing agencies and design consultancies, who work on a contract basis for a huge variety of organisations. Often the work is office-based. Some graduates may choose to be self-employed, or work on a freelance basis. Roles in this sector range from creative roles, for example as an artist, musician, or designer, to administrative or managerial roles in either art/culture focused positions, e.g. an arts administrator or a museum or gallery curator, or in professional ‘business’ roles, such as marketing and PR, or finance. Creative or cultural roles can exist in organisations which aren’t typically considered as belonging to the arts and culture industry, for example working as an archivist for a pharmaceutical company. Alternatively, you can work for a cultural organisation in a non-creative role, e.g. working as a management accountant for the National Trust. The opportunities are very wide ranging. Good starting points to research the roles available further are: Go to our Career paths pages written by our advisers Go to Prospects website and read their ‘Creative arts and design’ sector information Due to the very wide range of jobs in the arts and culture industry, it is important to read job descriptions and person specifications carefully to understand the skills the employer is seeking. Some roles, such as a museum or gallery curator may require specialist knowledge and expertise gained from a PhD and/or extensive experience. For other roles you may require specific qualifications e.g. for finance and legal roles. A large number of other roles will seek highly-valued transferable skills such as: There is also a growing overlap with creative industries and the use of digital technology, so employers may also seek a range of digital skills and awareness of digital platforms. Employers will also expect to see a strong interest in arts and culture, and some awareness of the political, economic and social opportunities and challenges facing the sector. Some larger organisations may offer graduate schemes, e.g. the BBC, large publishing houses etc, but the majority of roles will be by direct entry. The next section ‘Where do I look for job opportunities’ has some useful links for websites that list vacancies, but jobs in the arts and culture sector are not always formally advertised so speculative applications and networking can be particularly useful. LinkedIn can be a great way to reach out to professionals in the industry, and hear about job opportunities. Following organisations via social media platforms such as Twitter and Instagram is also an easy way to hear the latest sector news. It is fair to say that many graduates seeking work in the arts and culture sector take some time building their career through a series of roles to get to a specific career where they want to be or even to decide what job suits them. Often graduates will start in entry level roles with a view to building their experience and professional network before seeking more senior positions. Relevant work experience is ideal to help you build your knowledge of the sector and develop your network. It allows you to develop sector specific skills, and add to your portfolio of work, which is useful to show future employers. Your work experience could be paid or unpaid. Unpaid experience could include volunteering in an arts or culture based institution, such as a gallery or heritage site. Paid work experience could include part-time work with a relevant company/employer. Alternatively, you could seek an internship or schemes which exist to support students and/or graduates who are interested in working in the arts. These opportunities can be paid or unpaid. Go to our work experience page for more information Check the websites of employers you are interested in direct to see their advertised opportunities. You may also find roles advertised on jobs boards; it’s helpful to use a range of key words relating to both the role and the sector to search for jobs. Using LinkedIn to follow companies and institutions can be another great way to hear about upcoming vacancies. You can also contact employers direct to enquire about opportunities. ArtsJobsOnline Arts Council Creative Pool The Guardian jobs Arts Professional job finder Nottingham Advantage Award Creative Access You may also find work experience schemes offered by specific employers, for example the BBC, Penguin Random House, and English Heritage so it’s worth visiting the careers or jobs pages of companies/institutions you are interested in to find out more. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}