{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/sociology.aspx",
    "content": [
        {
            "p": "Studying sociology and social policy opens up a wide range of career options. Learn about these options and how we can support you on your journey. Most students choose to study sociology due to their interest and passion for the subject and their decision is not always a vocational one. Your career options are open ended. In addition to your subject knowledge, your sociology degree equips you with key skills valued by employers, such as: It is important that you can talk about these skills on application forms and in interviews. If you choose the Q-Step programme you will also develop excellent quantitative analysis and research skills. Sociology and social policy graduates enter a diverse range of occupations. Roles in both the public and private sector include: Career paths - explore roles and sectors Developing skills outside your degree course will enhance your CV and allow you to provide evidence of these in applications and at interviews. Some examples are listed below. Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates Nottingham Internship Scheme Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs. Nottingham Advantage Award We advertise part-time, casual and temporary jobs on campus and with local businesses. Created just for you, the advertised vacancies can fit around your studies and other commitments. The vacancies are advertised in two places. On-campus jobs Off-campus jobs Digital skills are essential in many career fields including advertising, publishing, marketing and general commerce. They range from social media to coding and will definitely enhance your employability. More about digital marketing careers The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Students in Classrooms Undertake an exchange semester in another country and broaden your horizons. Talk to your tutors and find out more about the programmes available from the International Office. Exchange programmes Many graduate recruiters use psychometric tests during the recruitment and selection process. They are common across all sectors and career fields. Practise will really help your performance. Use our example tests Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}