{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/chemistry/chemistry-alumni.aspx",
    "content": [
        {
            "p": "Four University of Nottingham chemistry alumni talk about their current roles and how they use their degree in their job. What is your current role and what does it involve? How do you use your degree as part of your job? My current role as a development chemist entails formulating all types of cosmetics for existing brands by liaising with clients. While formulating, I ensure compliance with regulations throughout the process and carry out stability tests once a formulation is approved. My chemistry degree is very helpful for my role as it gives me a deeper understanding of what is happening in a formulation and what factors can lead to the instability of a cosmetic. A career highlight so far is having one of the formulations I developed successfully launch into market. It’s such a rewarding feeling knowing that one of your formulations is helping someone feel better about themselves and that’s why I got into cosmetics in the first place. For anyone considering a career in cosmetics, especially in the UK, I recommend doing the Diploma in Cosmetic Sciences offered by the Society of Cosmetic Sciences. It supplements your knowledge of cosmetics and its regulations. I also advise on connecting with people that work within the cosmetics industry on LinkedIn as various roles that are not yet advertised are posted there. I really enjoyed studying at the University of Nottingham and it was great to be able to have the option of doing a year in industry. During my third year, I was fortunate enough to spend time at GlaxoSmithKline (GSK) as an Industrial Placement student. This was really valuable as it taught me how to apply what I had learned in Nottingham and gave me a taste for what I wanted to do after my degree. My placement really prepared me for coming back to Nottingham to finish off my Masters as it taught me how to manage my time between project work and module work. What is your current role and what does it involve? Although I enjoyed my time at GSK and the emphasis on ‘the patient at the end of the supply chain,’ I felt like I’d enjoy my role more if I could see directly the impact I was having. This led me to apply for the NHS Graduate Management Training Scheme. As part of the scheme I began working for the Department of Health. This was an unforgettable experience as I was able to work on the Strategy and Planning team for Covid-19 testing in England. I had the chance to make real changes in how quickly people’s PCR test results were communicated as well as how and where we introduced more lab capacity. Since March 2021, I have been working at Leeds Teaching Hospitals and have been more closely involved in the operational management of one of the hospital departments. This has involved looking at patient waiting times, departmental budgets, staffing levels and service improvements. It is great to get a true understanding of how the NHS runs and the limitations with it being a public sector organisation. Once my year in operational management is over, my second placement is in Community Healthcare and looks at how the NHS sets a strategy for how it will reach all of the patients in need. I’m really excited for where this scheme is taking me and the experiences that I am getting! I’d 100% recommend getting as much work experience as possible just to see what interests you and what you want from a job. I was convinced at the end of my first year that I wanted to be an accountant and work in audit. I did three weeks in an audit placement and realised that was enough for me! I wouldn’t worry if you don’t know what you want to do right now. I hadn’t heard of the NHS Graduate Management Training Scheme until during my masters year. What is your current role and what does it involve? How do you use your degree as part of your job? My current role involves solving chemistry problems to make medicines, using modern synthetic methodologies and high-throughput techniques. The fundamental organic chemistry and analytical knowledge I gained during my degree are key to my current job so I can plan synthetic routes to make molecules and how to analyse my reactions and products. During lab sessions I was able to work on my practical skills; this is where I first learned many of the techniques I now use on a daily basis. I've thoroughly enjoyed all roles I've held since university, but was particularly proud to be able to contribute towards a scientific publication. I am now excited to be undertaking a PhD as part of the GSK/University of Strathclyde scheme. I work as a material scientist with Pfizer which involves working in the research and development of our new low molecular weight medicines. My role is largely lab based, aimed at understanding the material properties and polymorphic landscape of our API, excipients and intermediates. My degree plays a fundamental role in my current job, where a grounding in physical chemistry is particularly key. I have the opportunity to employ many aspects that were covered in my degree on a daily basis, such as: thermodynamics, crystallography, vibrational spectroscopy, thermal analysis, surface science and so much more. I got into the industry through a job opening for a recent graduate at our site in Sandwich, Kent. In my technical interview (conducted by a Nottingham alumni) I was asked several questions on my knowledge of crystal structures and recrystallisation methods, conveniently in my third year I carried out a lab-based project with Professor Sandy Blake in this very area. My career highlights largely feature the huge amounts of learning I have made during my two years in the role, my degree set me up for the job perfectly but I have really only just started on my journey in the field of solid-state chemistry. I would love to continue growing in my role and get the chance to present my work in journals and conferences in the not so distant future. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}