{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/faith-based-roles.aspx",
    "content": [
        {
            "p": "Working in a faith-based role is likely to provide a varied and fulfilling career choice. Faith-based roles are not limited to formal vocations in established religions, and can be found in the public, private and not-for-profit sector, and exist to provide a link between faith and the world we live in. Students who wish to explore ordained or leadership roles within their religion are advised to speak with their religious leader for guidance. Faith-based roles may focus on the ethical, cultural, political and philosophical issues of religion. Use this page to explore the opportunities available in this sector and to think about entry routes and the work experience needed. Book an appointment with an adviser Chaplains provide guidance and counselling to individuals seeking pastoral care. Chaplains are employed by health and social care establishments, including hospitals; educational institutions; the police and fire service; prisons; professional sports teams; community organisations; and also in large companies, amongst others. In large organisations, such as a university for example, you may work as part of a multi-faith chaplaincy, which is open to individuals from a range of faiths as well as no-faith humanism. The nature of the work can be demanding. You may work with individuals seeking support with bereavement, depression, anxiety, and other personal issues, and according to the sector in which you work you may work outside of typical working hours. Part-time roles are common, and voluntary positions are also available. Opportunities exist in teaching, as either a religious studies teacher, or teaching other subjects in a faith-based educational setting. Other sectors where your faith could contribute to your success in the role, include journalism, either on a freelance basis, or for a specialist publication, or in charity or community work. Roles in faith-based organisations such as charities and associations include functions such as finance, management and administration, communications and marketing, fundraising, HR and so on. While these roles are typically open to graduates from all subject areas, you may feel that your faith will be beneficial both in the application stages, and while performing the role. Explore these individual roles such as HR, finance Some dedicated job board websites exist which specialise in advertising faith-based roles, or you can search for roles within specific categories, for example on LinkedIn or via websites like indeed.co.uk. You will need to: have excellent communication and listening skills demonstrate empathy and tolerance have integrity and resilience have excellent interpersonal skills, and be able to build positive, non-judgemental relationships Other skills that could be important are report writing, research skills, psychological understanding, IT skills and problem solving. If you are interested in working in a support role there may be additional skill sets to think about, for example data management, numerical skills or organisational skills. If you are thinking about a role in religious ministry, you should gain experience by being a part of your religious community to understand what’s involved, both in terms of the roles available and how to progress into these roles. It is essential to have experience before gaining a role as a member of a chaplaincy team. Volunteering opportunities can be found in chaplaincy teams in hospitals or health and social care settings such as residential care. You could also work with youth groups to gain experience of working with people in pastoral care. If you are interested in working in a faith-based organisation or charity then it can be useful to gain experience working with your local community or in a voluntary role for a charity. You do not necessarily need to secure work experience in a specifically faith-based institution but should aim to be working with people to build effective communication and interpersonal skills. Emmanuel House MHA: Volunteer Chaplains Nottingham City Council: Community Centres Nottingham University Hospitals NHS Trust: Volunteering Trent Vineyard Find out about volunteering opportunities Find out about work experience opportunities CharityJob - faith-based roles Christian Jobs Church of England - No ordinary ministry Third Sector Jobs telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}