{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/local-government.aspx",
    "content": [
        {
            "p": "Local government is responsible for vital services, people and business in their areas, including: social care; schools; housing and planning but also licensing, business support and pest control. In England over a million people work in local government doing wide ranging roles. Local councils are the most common form, headed up by elected councillors. Working with local partners they agree the priorities within their area and these are then delivered by permanent council staff. Therefore, the makeup of local government organisations can differ and roles evolve as priorities shift. If you have questions about your plans, talk to a member of our team. Watch this webinar to learn more about a career in the Civil Service and in local government. Mahel and Shambavi share their top tips on what you can do now to boost your career prospects, and expand on their current roles and their routes in. Login to SharePoint to watch the webinar Local government roles vary vastly from finance and administration to project management and public relations. However, the fundamental premise is to serve your community, so if this is something that resonates with you it might be a good option to explore. Skills that are highly valued include: With this in mind, think about the types of extra-curricular things you could get involved in that would allow you to evidence these skills in an application. In terms of general conditions, the pay can be lower than the private sector, and there is generally a more hierarchical structure than in some companies. However, there are advantages too, including flexible working, a varied workload, clear progression structures and opportunities for breadth and scope of roles. The National Graduate Development Programme matches graduates with local councils to work on specific projects gaining experience within your area of interest. Often Local Councils will have their own graduate programmes for example in Nottingham: You can also look at direct entry routes, by setting up job alerts with councils you are interested in and opportunities through: Other related job boards include: Local councils may run internships schemes for students which can be a helpful way of meeting the right people and getting your name known. Look out for these vacancies on MyCareer and through your School Placement Programmes. It’s also worth looking at: These kinds of roles are often highly competitive, so anything you can do to immerse yourself in local community issues so you can demonstrate a deeper understanding will help your application stand out. Charity and private players are increasingly involved in delivering services and collaborating. For example, government social research is often commissioned from private research organisations. So, when you are searching for jobs think about suppliers to local government in your interest area, as well as the local authority itself. If you are looking for more generalist roles there is rarely a specified degree subject that you will need to have. If you are looking at more specialist roles, such as in finance, then there may be preferred degrees that complement the skills required. Local authorities are unlikely to be able to sponsor international students and you will need the right to work in the UK. The recruitment process usually involves an application form, followed by a panel interview. For some roles there may also be some form off assessment centre. Local authorities will be proactive around equality and diversity matters within their recruitment practices, and may have specific schemes to target these applicants. Many roles will require criminal background checks. Understanding the current issues and challenges facing local government is important if this is a career you want to pursue. With budget cuts to the sector and the potential of elected Councillors changing fairly regularly this can be an environment that is forever changing and adapting to differing political influences. Additional challenges currently facing this sector are changing political landscapes: Brexit, for example, will make for an altered public sector. Keeping abreast of changes will prove useful for applications and interviews for public sector roles. Top tips: telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}