{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/psychology/index.aspx",
    "content": [
        {
            "p": "In order to work as a professional psychologist you must have an accredited undergraduate degree (which gives you Graduate Basis for Chartered membership or GBC). If you do not have an accredited psychology degree, you are able to gain GBC from a one year MSc Psychology (Conversion). For all routes into professional psychology there is a requirement for postgraduate study at either a masters or post-doctorate level. You will also need to gain relevant work (or voluntary) experience so there is no fast track route to professional psychology. It is extremely rare for students to progress straight to a psychology doctorate qualification immediately after graduation - gaining relevant experience in your field of interest is extremely important. Return to A to Z job list Book an appointment Find out about the different branches of professional psychology below and read our alumni case studies to get an insight into their work, career pathways and their advice to you. ‘Clinical psychologists deal with a wide range of mental and physical health problems including addiction, anxiety, depression, learning difficulties and relationship issues. They may undertake a clinical assessment to investigate a clients’ situation. There are a variety of methods available including psychometric tests, interviews and direct observation of behaviour. Assessment may lead to advice, counselling or therapy.’ (Source: BPS) Many students who are interested in clinical psychology undertake relevant mental health related voluntary work while they are at university. After graduating students could apply for roles such as: Many graduates also choose to undertake a relevant masters qualification. On average applicants have two to three years of relevant experience when they apply for a clinical psychology doctorate. Find out more in The Alternative Handbook 2023: Postgraduate Training Courses in Clinical Psychology. Following qualification, clinical psychologists can choose to specialise in specific areas, for example neuropsychology, child psychology and rehabilitation psychology. The British Psychological Society Health Careers Prospects Amy talks about her role as a clinical psychologist and her career pathway as well as offering advice to students considering clinical psychology. Go to Amy's case study Beth talks about her studies at the University of Nottingham, her career pathway to date as well as offering advice to students considering clinical psychology. Go to Beth's case study Counselling psychologists deal with a wide range of mental health problems concerning life issues including bereavement, domestic violence, sexual abuse, traumas and relationship issues. They understand diagnosis and the medical context to mental health problems and work with the individual’s unique subjective psychological experience to empower their recovery and alleviate distress. Counselling psychology is a relatively new field of professional applied psychology concerned with the integration of psychological theory and research with therapeutic practice. The practice of counselling psychology requires a high level of self-awareness and competence in relating the skills and knowledge of personal and interpersonal dynamics to the therapeutic context. (Source: BPS) Varsha talks about her role as a trainee counselling psychologist and her career pathway as well as offering advice to students considering counselling psychology. Go to Varsha's case study Educational psychology is concerned with children and young people in educational and early years settings. Educational psychologists tackle challenges such as learning difficulties, social and emotional problems, issues around disability as well as more complex developmental disorders. They work in a variety of ways including observations, interviews and assessments and offer consultation, advice and support to teachers, parents, the wider community as well as the young people concerned. They research innovative ways of helping vulnerable young people and often train teachers, learning support assistants and others working with children. (Source: BPS) Many students who are interested in educational psychology undertake relevant voluntary work while at university. This could involve working in a school or other childcare setting. There are a variety of opportunities offered at University of Nottingham where you can gain experience within an educational setting. Find out more - working with young people at Nottingham Mark talks about his role as a clinical psychologist and his career pathway. Go to Mark's case study Siya talks about her role as a educational psychologist and her career pathway as well as offering advice to students considering educational psychology. Go to Siya's case study Forensic psychology involves working with people who have been affected by crime or other legal systems (for examples family courts). Forensic psychologists aim to work with people to help them address factors associated with risk of further offending and develop healthy, pro-social lives and contribute to a safer society. Sometimes this involves exploring and understanding offending behaviour, vulnerabilities connected with offending behaviour (past trauma, substance use). The work of a forensic psychologist is guided by empirically derived formulations, which feed in to treatment pathways, providing opportunities for recovery and rehabilitation. Many students who are interested in forensic psychology undertake relevant voluntary work while at university. The Forensic Psychology Podcast - interviews by the psychology team from HM Prison and Probation Service with colleagues working in prisons Sarah talks about her role as a forensic psychologist and her career pathway as well as offering advice to students considering forensic psychology. Go to Sarah's case study Health psychology is primarily concerned with people’s experiences of health and illness. Health psychologists use their knowledge of psychology and health to promote general well-being and understand physical illness. They are specially trained to help people deal with the psychological and emotional aspects of health and illness as well as supporting people who are chronically ill. Health psychologists promote healthier lifestyles and try to find ways to encourage people to improve their health. For example, they may help people to lose weight or stop smoking. Health psychologists also use their skills to try to improve the healthcare system. For example, they may advise doctors about better ways to communicate with their patients. (Source: BPS) Bethan talks about her role as a health psychologist and her career pathway as well as offering advice to students considering health psychology. Go to Bethan's case study Occupational psychologists aim to increase the effectiveness of the organisation and improve the job satisfaction of individuals. The speciality is broader in scope and less formalised than many areas of psychology and it touches on diverse fields, including ergonomics, personnel management and time management. Work can be in advisory, teaching and research roles, and to a lesser extent, in technical and administrative roles. (Source: BPS) Phil talks about his role as a occupational psychologist, his career pathway and offers advice to students considering occupational psychology. Go to Phil's case study We invited three UoN alumni professionals to talk to you about their career journeys: Login to SharePoint to watch a recording of this event Exercise psychology is primarily concerned with the application of psychology to increase exercise participation and motivational levels in the general public. Examples of the work sport psychologists carry out include counselling referees to deal with the stressful and demanding aspects of their role, advising coaches on how to build cohesion within their squad of athletes, and helping athletes with personal development and the psychological consequences of sustaining an injury. Examples of the work that exercise psychologists do include optimising the benefits that can be derived from exercise participation and helping individual clients with the implementation of goal setting strategies Practitioners’ typically specialise in either the sport or exercise branches though some work equally in both fields. (Source: BPS) Lara talks about her role as a sports and exercise psychologist and her career pathway as well as offering advice to students considering sport and exercise psychology. Go to Lara's case study telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}