{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/publishing-and-journalism/publishing.aspx",
    "content": [
        {
            "p": "Publishing is a combination of creativity and communication. It is about communicating ideas and connecting people with the content. Publishers are at the centre of the information economy, communicating those ideas out to the world and the people that need them. Traditionally, the term refers to the distribution of printed works, such as books, newspapers and magazines. With the advent of digital information, it has expanded to include ebooks, audio, academic journals, website, blogs. The publishing industry is a term used to describe all the elements that contribute to the creation, acquisition, editing, marketing, sales and distribution of information to the public. A wide range of roles are available. The majority of roles are open to students from all subject areas, with a passion and proven interest for the publishing industry. Book a careers appointment Sales, marketing, rights, publicity, and editing are some of the areas in publishing you have heard about or are interested in pursuing. Hear from a panel of industry experts who will describe their routes into and experience of publishing. Login to SharePoint to watch the webinar Our Alumni Relations team invited alumnus Oliver Holden-Rea, Editorial Director at Headline Publishing to talk about his career to date with you. Oli began his career at Bloomsbury, working on literary fiction and prize-winning non-fiction, and with some of the best writers of all time, including Margaret Atwood, Madeline Miller, George Saunders and Ben Macintyre. Since then, he has worked at one medium, one small and one large publisher, publishing non-fiction books. His authors include Mel C (Sporty Spice), Otto English, Alex Goldie, Andy McNab and The Big Issue. The Publishers Association divides the publishing industry into three broad categories: As publishing is such a popular area of employment, there are several detailed resources offering advice and guidance about careers, including: While book publishing is a familiar area, there are many other formats within the industry, including databases, business media, directories, journals, newsletters, magazines and audio publishing. Research shows the UK exports more physical books than any other country in the world. The industry employs close to 70,000 people, accounting for 1 in 10 jobs in the UK’s creative industries. The Publishers Association in 2024 cited ‘publishing is more relevant and vital than ever’. Academic publishing is important to the sector’s overall performance, generating the majority of the industry’s turnover growth since 2010. Academic publishing covers everything from introductory textbooks to research monographs, reference, and journal publications. Almost all of this is now both in print and digital – with an increased focus on digital whether as eBook or on a digital platform. In recent years, the growth of digital technology has fundamentally changed how authors design their content, and how readers engage with it. Audio continues to be the fastest growing sector in digital publishing with sales increasing by a further 8% in 2022 to £164 million The Guardian features an interesting article about how developers are experimenting with technology to publish books with elements that simply wouldn't work in print. VR and AR are being explored to provide a more immersive reading experience and tech-forecasters cite the comeback of mobile apps as a trend that traditional publishers need to respond to. A further growth area to watch out for is AI. Although still in its infancy publishers see this as an opportunity to benefit the sector across different levels from supporting authors with research, to gaining a more informed insight into customers. Disruptive trends in the publishing industry include the expansion of Blinkist, which publishes boiled-down versions of non-fiction books which can be read or listened to in minutes. Self-publishing and online marketplaces, the chief being Amazon, are also changing the way the publishing industry works. The industry predicts the continued growth of self publishing as some authors are choosing to bypass traditional publishing in favour of producing their work and making it available to the public without any gatekeepers. There are many different roles available within the publishing industry, from editing to contracts and rights. Some key roles are highlighted here, along with useful websites for further research to allow you to explore jobs in the sector more widely. Entry-level routes often have 'assistant' in the job title, for example, editorial assistant, marketing assistant and production assistant. The Publishers Association has a useful YouTube video detailing the life of a book, from concept through to final publication, which showcases the various roles involved at each stage. Skills requirements will vary depending on the role, but key skills include excellent spelling and grammar, enthusiasm, flexibility, self-motivation, and good interpersonal and communication skills. Data collected from employers in the industry identifies gaps in: Skill sets are changeable and have shifted dramatically in five years. Certain roles may rely on data analysis skills or benefit from coding knowledge whereas in other areas of the industry an awareness of digital marketing skills is advantageous. Identifying trends and technical skills are important today, especially in editorial work. Most entrants are graduates, and for the majority of editorial roles, degree subject is not important. In certain areas of specialist or academic publishing a master or PhD may either be a requirement or advantageous. Relevant experience and appropriate skills are more important than qualifications, and postgraduate-level study is not usually a requirement. A new route is the Level 3 Publishing Assistant Apprenticeship. Several publishing houses including Bloomsbury, Penguin Random House, Harper Collins and Springer Nature have all introduced this route and it is available to graduates. For students with language skills, these can be an advantage when combined with good commercial awareness and a love of reading. A role worth exploring is Rights. Publishers increase revenues by selling foreign rights in their titles. Alternatively get a job as a translator, and seek work with a literary agent or publisher. You can shadow authors who come to the UK, or do this abroad. One World, for example, have staffers who speak and read Italian, German and Russian. A language is a boon, but you need to know both markets – UK and foreign. They don't always follow each other, so what works in one country, doesn't necessarily work in another. As relevant work experience is an expectation across the industry, the majority of employers offer work experience or internship opportunities. For example: In most cases these employers ask for a CV and covering letter with no particular deadline. This will also be the case for smaller publishing houses. Prepare a focused CV that demonstrates your commitment to the industry and has no typos in it, and send it speculatively to the organisations that interest you. The popularity of the publishing industry means that competition for entry-level roles is strong. It is not essential to have work experience within a publishing house, instead consider transferable skills from work for example in bookshops or literary festivals and book fairs. Paid experience can be difficult to find, so many students work voluntarily at first. This isn't a financially viable option for everyone especially as many publishing houses are based in London, but The Spare Room Project may be able to help. This is an organisation which matches interns from outside London with publishers who can offer a spare room. There are also other ways to obtain experience that will be interesting to employers and allow you to build a useful network of contacts, for example: The Publishers Association provides links to a range of blog posts about working in publishing. Entry-level jobs are usually obtained through networking and word-of-mouth, rather than advertised vacancies. Find out how to craft a speculative application. Occasionally, publishers will advertise vacancies on their own websites. Large publishing companies may recruit more formally. Penguin Random House runs The Scheme, a 13-month entry-level programme which aims to attract the marketers of tomorrow. The scheme invites applications from a BAME (Black, Asian, or Minority Ethnic) community, and/or from socio-economically disadvantaged backgrounds. Social media channels and blogs are also recommended places for finding out about entry-level opportunities and networking with people in the industry. Don't be put off by a temporary contract, this is a way to build your experience and make useful contacts. As well as the speculative approach, there are a number of online sources and recruitment agencies advertising publishing jobs, including: The Guardian The Bookseller BookCareers.com has a useful list of relevant recruitment agencies. While specialist qualifications are not a requirement, there are a number of well-respected training providers offering a range of courses to suit different needs, including: The London College of Communication London School of Publishing Publishing Training Centre The Tab - Writing for The Tab can be a great way for you to gain experience in the field of journalism. This publication has its own University of Nottingham branch and they do not require you to have any previous experience. You can apply at any time. Submit a sample of your written work and a list of topics you wish to write about. The University of Nottingham Creative Writing Society blog - Creative Writing Society blog is a student-run group you can participate in. They accept a wide variety of writing and will showcase your work on their blog. You can apply anytime via their website. The Letters Page - The Letters Page is a great publication run by the School of English. All their submissions take the unique form of a handwritten letter, which gives you great experience of writing in a specific genre. Find out when applications open on the website. Nottingham New Theatre - If you’re interested in performative writing, the Nottingham New Theatre is ideal. It is the only student-run theatre in the UK. You can gain a wide range of experience, such as writing, directing, producing and acting. You can apply at any time through their website. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}