{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/clinical/pathology.aspx",
    "content": [
        {
            "p": "Pathology is the science of the causes and effects of diseases and bridges science and medicine. From diagnosing disorders to researching cancer treatments, pathologists work across many different areas of prevention, diagnosis and treatment of disease. Animal pathologists work with animals in zoos, research facilities and farms, as well as with people’s companion animals Return to the Vets homepage Book a careers appointment Careers in veterinary pathology are very diverse, ranging from work in academia, pharmaceutical industries, governmental agencies covering important areas like disease surveillance and commercial diagnostic laboratories focusing on different areas of disease prevention, diagnosis and treatment in animals. Find out more: Royal College of Pathologists There are two main types of veterinary pathologists: You can find out more on the following websites. European College of Veterinary Pathologists European College of Veterinary Clinical Pathology Or contact your employability tutor for pathology at the School of Veterinary Medicine and Science (SVMS) - you can find them on Tutor relevant pages on Moodle. You hopefully will be okay with using microscopes to analyse and identify disease patterns. You will need to be thorough and pay attention to detail while using your analytical thinking skills. Excellent verbal and effective written communication skills are important as you will be working within a team and closely cooperate with other vets, doctors and/or researchers. Pathology is very well suited to someone with an investigative and curious mind. If you are a natural problem-solver, pathology could be a good fit. As a veterinary pathologist you might work with a range of animals or specialise in a species. Much of a veterinary pathologist’s day-to-day tasks will be performed in a laboratory or office, though some of the work of anatomical pathologists will be performed in a post-mortem room to examine bodies. Veterinary pathologists first train and graduate as vets and then specialise in one or more pathology disciplines. It’s recommended that you’ll have also gained some clinical experience before applying for the veterinary pathology training programme. This clinical practice experience often counts as an ‘internship’. Training to be a veterinary pathologist takes around three years if you’re training full time and is mostly done by completing a structured, three-year training programme, often called ‘residency’. Resident training in the UK often happens at a university (vet school) but you may find occasional training places in a commercial diagnostic lab. Check the two website below for advertised training opportunities. Find out more about internships and residencies I graduated in 2017 knowing that I wanted to pursue a career in veterinary anatomic pathology. I worked for two years in first opinion small animal practice and started the anatomic pathology residency at the University of Nottingham in October 2019. One of the biggest advantages of doing a residency has been the exposure to the many opportunities that a career in pathology can offer, from academia (through assisting in final year teaching) to research (through the concurrent Masters dissertation) to diagnostic pathology itself. During my undergraduate degree, I undertook EMS placements at various pathology services which allowed me to better understand the work of a diagnostic pathologist. My time during clinical practice gave me the opportunity to develop clinical skills and knowledge which have proved invaluable in the diagnostic pathology setting; it has allowed me to create useful differential diagnoses and understand certain limitations of clinical practice. Despite not doing any histopathology for two years, this did not disadvantage me much as the supervision provided ensured that I was taught proper techniques from day one. Kian Guerzoni, Resident of Veterinary Anatomic Pathology, SVMS, UoN After a successful certifying board examination at the end of the residency, you will become a Diplomate of your College (Dipl ECVP or Dipl ECVCP) which is the highest postgraduate specialisation in your field. There are ample, well paid job opportunities for certified clinical and anatomical pathologists in all areas of their specialisations. You will find a current picture of the job market with further development options on the following websites. Your starting points should be the websites listed on this webpage and your employability tutor for pathology at SVMS (go to the Tutor relevant page on Moodle). There is also the Nottingham University’s Veterinary Pathology Group (NPathS) of undergraduate and postgraduate students at the Vet School with a Facebook site and regular meetings. They also organise a pathology careers day, called Pathology Festival, at the School of Veterinary Medicine and Science (SVMS) which offers plenty of interactive sessions to ask questions an discuss career options with pathologists from all areas. For information, please ask your employability tutor for pathology or check out their Facebook site. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}