{
    "url": "https://www.nottingham.ac.uk/careers/students/postgraduate-taught-students/application-timescales-for-pgts.aspx",
    "content": [
        {
            "p": "Students on taught or research masters programmes may need to act very quickly at the start of their course to meet the recruitment deadlines for graduate programmes. Most of these deadlines will be set around the undergraduate timelines. As most masters courses finish in September with graduation in December, you will need to apply during the early part of your course if you want to begin work as soon as you complete your course. Go to our postgraduate taught students page Flexible placement opportunities with regional companies. Vacancies advertised all year round. Structured programmes lasting one to three years with varying application deadlines. Find out about training schemes Meet employers at recruitment fairs and presentations Short-term consultancy projects with local businesses or charities during February and March with applications opening in November. Find out about NCC Sign up for our employability award to showcase your extracurricular activities and skills. Find out about the NAA These lead to a qualification to practice,for example teaching, medicine and law Talk to a careers adviser Did you know? 79% of postgraduate taught students went into highly-skilled employment* Collaborative funded opportunities at centres of excellence Jobs.ac.uk DTP vacancies at Nottingham Funded opportunities for one-off projects Vacancies at Nottingham A three-way partnership between a graduate, university and employer for one to three years Find out more about KTP 8.9% of postgraduate taught students went onto further study* Direct entry for roles advertised when a vacancy arises Find out more about direct entry route Eight-week graduate placements with local SMEs Nottingham Internship Scheme *Graduate Outcomes 2020/21 published by HESA (June 2023), Full-time PGT respondents. Highly-skilled employment is classed as a role that has a SOC code of 1 to 3. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}