{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/charity-work-and-international-development/charity-work.aspx",
    "content": [
        {
            "p": "The charity sector, also often described as the 'third sector' or the 'voluntary and community sector' comprises a wide range of large and small organisations. Charities work with issues affecting our world and aim to improve the environments around us. You may also be interested in careers in international development. Back to the A-Z jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment This webinar highlights the vast range of careers in the charities and NGO sector. You can expect to hear some top tips on how to gather experience to enter this field and what life is like working in the sector. The speakers illustrate how career paths aren't often linear, and how this sector really is exciting and will take you to unexpected places. Login to SharePoint to watch a recording of this event Charities are organisations that are established to provide funding and support for a particular cause. Large well-known organisations include: Smaller local organisations include: The vast majority of the charity sector – over 70% – is made up of smaller, local organisations and this is often where graduates will find work or internships. More information can be found on Prospects webpages: overview of the charity sector and working for a small charity. NGOs are private or voluntary organisations that are united in a purpose. They can also be charities. Examples include: Websites such as Bond (British Overseas NGOs for Development) and WANGO (World Association of Non-Governmental Organizations) can give you an overview of the sector more widely. Social enterprises are businesses trading for social and environmental purposes who re-invest their profits to further their aims. Examples include The Big Issue, The Eden Project and Cafedirect. To find out more, you can visit the Social Enterprise Commission. The issues covered by the charity sector are huge, from poverty to cancer and from animal welfare to human rights. Some organisations focus on regional issues, others national, and some have an international focus. Examples of small, regional organisations are St Ann's Allotments and LAM Action, whereas bigger, national focuses include Prostate Cancer and international focuses such as Action Against Hunger. There are many different roles available within the charity sector. Some you may be more familiar with such as working in fundraising, volunteer management or international development. Others may be more focused on the operational side of the charity such as HR, finance, PR or legal roles and others on service delivery such as service managers, helpline/advice managers, and support workers. Go to the next section for sources of vacancies. For an overview of roles and responsibilities, go to: Charity Job Prospects Third Sector Due to the nature of funding, a lot of the roles offered may be fixed-term or temporary. Check out the job listings on Charity Job and Third Sector websites to gain an indication of pay rates and contracts on offer. Job satisfaction is often rates higher within the sector and there are lots of opportunities for flexible working. The vast majority of people, prior to working in the sector, will have done volunteering or internships. There are lots of opportunities for unpaid experience in charities, although fewer with paid contracts. Some unpaid opportunities are flexible so that you can also find part-time work to supplement income. It's common for employees in charities to be involved in lots of aspects of the organisation, particularly if the charity is small. It's important to show a commitment and passion for the work a charity carries out. There are a few graduate schemes for the sector, and as a result these are highly sought after. Also take a look at: targetjobs: graduate schemes and internships in the charity sector Read Grace's blog: Different roles in the charity sector that you may not have thought about Vacancies may be advertised on an organisation's website or national websites. There are lots of opportunities to work and volunteer, both in the UK and internationally. Vacancies are advertised on: Remember high-profile national charities make up a small percentage of the sector. Mostly charities are small, local organisations with less resource, so you will need to do your research into what is available and find your own opportunities. People with a proven commitment to and interest in the charity’s aims and ethos is important and so signing up to newsletters and social media so that you know what is current in their space provides valuable insights. The charity sector is popular with graduates and there are limited internships available, so you need to use your time at University to take up opportunities that will position you competitively when you come to apply. Employers will be looking for a wide range of skills, many value extracurricular activities and key skills such as adaptability and innovation as imperative for working in the sector. One of the best routes to gain experience is by volunteering. Most charities will have information on their website about how to get involved, so search for charities with a focus on issues that interest you and contact them directly. You can also find volunteering opportunities through: There are details of other schemes on the targetjobs website. Take a relevant Nottingham Advantage Award module Join relevant Students' Union societies Join Enactus - a student-run organisation that supports charities Go to the Students' Union's volunteering opportunities Apply for the Nottingham Internship Scheme - some paid internships with local charities Apply for the Nottingham Consultancy Challenge - involves groups of students acting as consultants for a charity Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Keeping up to date with the issues in the sector is important. You may get asked a question about a sector hot topic or an issue for a particular charity at an interview. One hot topic covered by the media recently is around aggressive fundraising tactics. There has also been comment about issues faced by certain parts of the sector, such as the smaller charities surviving in a saturated funding market. Try the Charity Commission or sector-based websites such as the Third Sector and Charity Times for email updates about news and issues affecting organisations, as well as news sites like The Guardian. The National Council for Voluntary Organisations champions the voluntary sector and lobbies Government so it is also a good place to see what topics are relevant. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}