{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/engineering/civil-engineering.aspx",
    "content": [
        {
            "p": "Civil engineering is everything you see that’s been built around us. It’s about roads and railways, schools, offices, hospitals, water and power supply and much more. The kinds of things we take for granted but would find life very hard to live without. Institution of Civil Engineers Return to A to Z list If you have questions about your plans, talk to a member of our team. Book a careers appointment Meet employers at our events Civil engineers are involved in the design, development and construction of a range of projects within the built and natural environment. Most civil engineers work either as consulting or contracting engineers. In brief, the difference between these is that consulting civil engineers work on the design of projects and are therefore predominantly office-based and more client facing, while contracting civil engineers work on the implementation and construction of those designs and are therefore more site-based. Liaising with clients, you will plan, manage, design and supervise the construction of projects. You'll work in a number of different settings and, with experience, could run projects as a project manager. You may work on projects involving: Source: Prospects.ac.uk Contracting civil engineers turn the plans of consulting civil engineers (designers) into reality. They oversee the actual construction on the ground and work in conjunction with consulting engineers. All civil engineers need a good understanding of design and construction processes, as well as of health and safety issues. As a contracting engineer you'll use your professional expertise to organise human and material resources on site, and ensure that the project runs to time and budget and is safe to work on. Although more commonly done by a consulting engineer, a contracting engineer will occasionally put together a design and build a team themselves. Source: Prospects.ac.uk Structural engineering is essentially a specialism within the broader area of civil engineering. As a civil engineering graduate, you are also able to apply for most graduate structural engineering roles. The focus of a structural engineer is, as the name suggests, more on the design, analysis and maintenance of structures and materials. As a structural engineer, you'll design structures to withstand stresses and pressures imposed through environmental conditions and human use. You'll ensure buildings and other structures do not deflect, rotate, vibrate excessively or collapse and that they remain stable and secure throughout their use. You'll also examine existing buildings and structures to test if they are structurally sound and still fit for purpose. Working in close partnership with architects and other professional engineers, you'll help to design most structures, including houses, hospitals, office blocks, bridges, oil rigs, ships and aircraft. You'll also be responsible for choosing the appropriate materials, such as concrete, steel, timber and masonry, to meet design specifications and will often be involved in inspecting the work and advising contractors. TARGETjobs - Three career decisions you need to make if you want a civil engineering job Prospects - what can I do with my degree in civil engineering? There are roles for civil and structural engineers in all areas which require large scale structures to be designed and built. These include: Find out where Nottingham graduates work Start your job and internship search on MyCareer - we advertise hundreds of engineering roles including graduate positions, year-long placements and internships. MyCareer - vacancies targeted at University of Nottingham students and graduates Careers in Construction CareerStructure ICE Recruit Just Construction UK Civil Engineering Anders Elite Conrad Consulting Hays MatchTech Penguin Recruitment Rise Technical Engineering Jobs Gradcracker Indeed LinkedIn Just Engineers Prospects RateMyPlacement TARGETjobs The Engineer Jobs Energy Jobline For smaller companies or more specialist roles, a speculative approach may be useful. Research companies (rather than jobs) that you are interested in joining and consider how you could network with these organisations. You could send your CV and a covering letter speculatively, follow the company on LinkedIn or even approach someone on LinkedIn and ask for advice. We invited three engineering recruiters to talk to you about their recruitment processes and provide tips on how to make a good impression. They also provided an insight into what life is like working in their sector. Speakers: Login to SharePoint to watch the webinar An important part of increasing your employability for any sector of work is developing your commercial awareness. This means having a good understanding of the industry as a whole, key employers, and developments. Commercial awareness is particularly important during the recruitment process as companies will expect you have knowledge and understanding in this area. Specific questions may be asked or you can impress them by weaving your understanding of the company or sector into your answers. Find out more about commercial awareness For the civil engineering and construction sectors, good sources of commercial awareness information include the following. Use the news tab to explore developments. Building.co.uk Construction Enquirer Institution of Civil Engineer (ICE) News New Civil Engineer News Now – civil engineering The Structural Engineer telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}