{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/ampr/analytics.aspx",
    "content": [
        {
            "p": "Did you know that careers in analytics and insights, SEO, and PPC analytics are some of the most in-demand and well-paid jobs in the digital marketing industry? If you are analytical, comfortable managing data, and like to learn about and apply new technological skills to your work, then these jobs might suit you. You may also be interested in: Back to the A to Z list If you have questions about your plans, talk to a member of our team. Book a careers appointment Web analytics is the process of analysing the behaviour of visitors to a website. As a web analyst, you will measure, collect, analyse, and report on data to understand and optimise web usage. For example, you might focus on improving the user experience, increasing website traffic, or enhancing sales conversion rates. Example job: As a web analyst for an e-commerce website, you might use data from Google Analytics to identify the most popular products, analyse user navigation patterns, and optimise the checkout process to reduce cart abandonment rates. Customer insights is all about analysing customers to understand who they are and the products and services they need. It involves collecting data, analysing it and learning more about buying behaviour in order to improve product development, and develop effective online marketing and sales strategies. Example job: Working for a subscription-based streaming service, a customer insights analyst might analyse user data to identify popular content genres, discover user preferences, and optimise content recommendations to increase customer satisfaction and retention. SEO specialists identify strategies, techniques and tactics to increase the number of visitors to a website via search engines. They optimise websites to rank higher in search engine results, driving organic traffic and improving online presence. Example: An SEO specialist working for a digital marketing agency might conduct keyword research, analyse competitors' websites, and implement on-page and off-page SEO strategies to improve a client's website rankings and organic traffic. PPC specialists advise on and manage online advertising campaigns, for example through Google AdWords. For all of these roles you may be employed ‘in-house’ in the marketing department of an organisation, or for a specialist agency, in which case you’ll manage accounts for clients. You may see a range of job titles for these roles, for example web analyst, data or digital analyst, CRM (Customer Relationship Management) coordinator, web officer, web communication executive and so on. You may find that ‘SEO’ or ‘PPC’ is used in the job title, for example, SEO executive, or it might be a more broad job title, such as online marketer or digital account executive. Typical starting salaries in these roles are around £20,000-22,000, and they can rise to £35,000+ with experience, and more for very senior roles. Example: As a PPC specialist for a fashion retailer, you might create Google Ads, experiment with ad designs, and adjust bids strategically to attract customers and boost sales, as your insights drive business growth. Many businesses offer starting roles within a broader digital marketing context where you can learn many relevant skills and gain experience of SEO, PPC, analytics and social media. For example, employers will help you to learn and apply skills such as Adobe Creative Suite for online banner ads, Google AdWords for pay-per-click campaigns and Google Analytics and Facebook Insights for web analytics reporting. We recommend that you take a pro-active approach to developing your digital skills and experience during your time at Nottingham so that you can increase your chances of getting a starting role. Skills and knowledge you can learn yourself include basic coding like HTML and CSS, Adobe Creative Suite, the basic SEO knowledge and Google Analytics. There are lots of resources out there to help get you started on any of the above, but we'd recommend: Digital agencies can be found in most large towns and cities across the UK and are usually open to approaches for internships and work experience. Enquiring about experience will work best if you can show that you developed some relevant skills, and have passion and curiosity about brands, culture and the digital world, along with a willingness to learn. The Nottingham Internship Scheme is a great way to gain experience with a local employer that can fit around your studies. Once you have taught yourself some basic skills, get in touch with local voluntary organisations and charities, such as Nottingham CVS to see if there are any projects you can get involved with. Try out your basic coding skills, but don't stop there. See if you can improve its Google ranking by applying your SEO skills. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Doing a professional course is not a pre-requisite for entry to these jobs, and relevant experience is often more important. However, if you wish to consider a course, the following options could be relevant. Chartered Institute of Marketing (CIM) Institute of Data & Marketing (IDM) Marketing Week magazine telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}