{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/applicationforms/index.aspx",
    "content": [
        {
            "p": "Application forms are usually the first step in the recruitment process and will help employers decide who to invite to the next stage of their process. As an applicant you need to prove you: have an understanding of the role and have skills and abilities they have asked for in the job criteria; have genuine motivations for applying; are a good ‘fit’ for their organisational culture and values. Employers may receive hundreds of applications, so your information needs to be impactful and tailored. As a result, completing application forms can take a lot of time. It will be a lot easier to complete an application form if you have an up-to-date CV to take information from. Refer to our CVs webpage for more information. Application forms differ from employer to employer, but often include requests for information on the following areas: Before you put any applications together you need to be able to answer the question – why am I applying? Read our blog on avoiding spam applications for more information. To do that you need to clearly define your criteria for this next step in your career journey. Is it about joining a sector you’re passionate about? Are location and salary important factors to you? Do you value progression and training opportunities? Or, is team and working environment one you would feel comfortable in? If you can’t articulate this yet, our Choosing your career pages will help you to understand where your interests lie. You can also book a careers advice appointment through MyCareer to talk through your ideas. This will ensure the applications you invest your time in are targeted. This is the most important stage of any application so don’t be tempted to skip it. You are aiming to get a sense of the company, what the job really involves, and to be able to demonstrate commercial awareness - which is an understanding of business trends in the sector. Examples of things you can do, include: Explore the organisation's website. What are they saying about themselves and their company culture? They may even have tips on their recruitment process and what to expect. Follow the company (and its competitors) on social media. How do they portray themselves? Who are they working with? See what’s happening in the news for this company or sector. Make sure you are aware of any professional bodies linked to the sector to keep up to date. Build your fluency in any industry language, jargon, and acronyms. Connect to people that work there on LinkedIn; you may be able to reach out with a few key questions. It can also give you an indication of what they did before, and the journey they have been on to get there. Our Researching employers webpage will give you more hints and tips. Your application must talk to the reader (the hiring manager for the role), and the more research you do the better you will be able to tailor your content. This section will ask you for all your basic information such as your full name and contact details. Double check this is correct before you submit your application; they won’t be able to get in touch with you if you have made a mistake. In the UK information such as date of birth and marital status will not be included in this section. In fact, increasingly some employers are removing any personal information that could encourage unconscious bias (judgments or decisions made based on our prior experience, assumptions, or interpretations, that we are not aware of). So even your name, address and educational institution may be removed from your application before it goes to the hiring manager for review. When it comes to your employment history the biggest question is always what do I include? The answer is simply, what is relevant. Remember the aim is to show them you can do the job, so you need to think carefully about how each of your experiences meets the criteria. This doesn’t mean that experiences without a direct link to the role or sector are irrelevant either. Most experiences expose us to learning opportunities and build evidence of skills that are transferable. As a graduate you are not expected to have years of experience in the industry. But, you do have to tell them why the experiences you have gained will make you successful when transitioning into the workplace. If you have retrained you may have had a previous career than spans many years. Think about the transferrable skills you gained from those experiences. How far back you want to go will depend on whether a role is adding value or just repeating information they already have. As a rule, we say five years, but it will be dependent on your situation. Gaps in your work history are not considered gaps if you were in education during that period. However, if you have genuine gaps that you are worried about explaining, book an appointment with one of our advisers. Often application forms will have a ‘reason for leaving’ space. Make this short and concise, for example: a new opportunity; relocation; going into full-time education. What you don’t want to do is raise questions about your loyalty and commitment. Finally, beware of simply cutting and pasting from your CV. This may provide a good starting point and a reminder of all that you have done, but as with everything in an application form it needs to tell the reader something about your suitability for the role. A supporting statement may come in different forms. Sometimes it’s structured into questions, but it could also be an open text box. Very similar to a covering letter, this is your chance to demonstrate how you meet their criteria through your experiences, including what you’ve done on your course, through work experience, or extracurricular activities. It shouldn’t just repeat your CV; instead it should expand upon and highlight the things that really make you a quality candidate for the role and what you bring that others may not. This can be the most challenging part of any application because you no longer need to write academically. Instead, you need to write about yourself, in the first-person and reflect genuine motivations. This requires a level of self-awareness and the language to put that into writing, so take some time to really think about it. If you don’t have one or more of the skills they are looking for then explain the transferable skills you think will meet the requirements and what you will do to develop is this area. Here is an example supporting statement structure: Introductory paragraph: Why am I interested in the job? Why am I interested in the company? What are my motivations for applying? Three to four individual paragraphs providing evidence of required skills, which you consider to be your strengths, for example: Attention to detail Effective time management Strong team working skills Closing paragraph If there is no suggested word count we would recommend this section is no longer than two pages. While studying for my A-levels, I had a part-time job as a waiter at my local restaurant and I also played rugby for a local club team. The team had a good chance of winning the County Cup so we agreed that we would add extra training sessions after school. Studying for my A-levels was my main priority so I planned my revision and developed a schedule which meant I would study for an hour before school and on alternative nights to my training. On the approach to my exams I also requested leave from my part-time job so I could spend two extra weekends revising. My schedule meant that I was much more focussed and I did not waste any time. I am proud to say that my team won the County Cup that year and I managed to get the grades to get into the university of my choice. Overall I learned that by constructing a plan and working hard I can achieve whatever I set out to achieve. In the second year of my degree I signed up to participate in a team consultancy project. The project involved working with a local charity to assess the impact of a change in government policy. After an initial meeting with the charity we met as a team to formulate a project plan and assign research areas to each team member. I also set up a meeting schedule so we could keep track of progress. A few weeks into the project a team member had to pull out of the project without completing their research. I instigated an emergency team meeting to review the plan and discuss how we would cover the additional workload. As a team we had been communicating regularly so everyone else was on track with their work so we were able to adjust our plan and divide up the outstanding research in a logical way. I spent extra time devising the final report and presentation for the charity. We received outstanding feedback for both the organisation and from our university on ‘a comprehensive piece of research and insightful findings’. Furthermore the charity has made adjustments to their procedures based on our recommendations. If your application form requires you to tackle some questions, they will fall into four categories: Motivational questions are designed to assess that you understand the job you have applied for, what you have to offer, and what you want from a career. While detailing your skills and experience will show an employer you can do the job, showing that you want to do the job, your motivations, will put you into the ‘must interview’ category. For the example below, you need to show that you’ve done your research, that you understand what the job entails and how it fits in with your career aspirations. Your organisation stood out to me when I was working on a recent research project on waste management as a company that is leading the way in sustainability in your sector. As a BSc Chemical and Environmental Engineering student I am aware of the importance of sustainable practice and I believe that my research and experience in this field would make me the perfect fit for your organisation. Competency questions are designed to assess your knowledge, skills and behaviours that are integral to the role that you are applying for. They require you to provide one example of a situation where you have demonstrated the required competency. A simple way to structure your response is to use the STAR technique: In the example below, you need to demonstrate your ability to analyse complex information, and communicate it in a way that an audience can easily understand. As part of my market analysis project, I had to report back to year group on findings from my qualitative and quantitative research into consumer trends (Situation). This meant I had to analyse numerous data sources, filtering the information and summarising my findings in a simple way that everyone would understand (Task). I made use of my skills in Excel to produce an initial report and then produced a PowerPoint presentation to summarise my main findings which I presented back to an audience of over 50 people. (Action). My presentation was well received and my findings also influenced the way in which other groups approached their research (Result). Strengths-based questions are designed to assess not just what you are good at but what you enjoy doing so that an employer can ensure that you are recruited into a role where you make the most of your strengths. While strengths-based questions are predominantly used at interview stage employers sometimes use them as part of the application process. Think about what types of activities you are good at and that you enjoy doing – these might indicate they are a strength. For the example below, you need to demonstrate self-awareness about the types of activities that you are good at and that you enjoy, that would ideally be relevant to the job you are applying for. I am somebody with a great attention to detail which was prevalent while studying Maths at A-level but has come to the forefront during a research project at university. I spotted mistakes in vast quantities of data which subsequently changed the conclusion and overall findings of the project. Through my volunteer work in a charity shop and at my local animal rescue centre, I learnt that I have a real compassion for helping those less fortunate. I have also learnt that this enables me to engage effectively with customers and I have received positive feedback as a result. Commercial awareness questions aim to test that you have some understanding of the company and/or sector you are applying to. They might also be testing your ability to write on a topic and articulate a point of view. Who you use as your referee is an important consideration. Most employers will expect you to provide them with two referees, who will typically be contacted at the time you are offered the job. However, application forms often ask for this information up front. Make sure you ask the permission of anyone you are going to use as a referee and check their contact details are correct. They will need to look out for the reference request, which will often be sent by email, and reply swiftly, as this could delay your start in a role if they do not. It is also a good idea to send them information about the job you are applying to, so they have some context. Most applications will ask you to complete an equality and diversity disclosure. This will often be removed from the application before it is sent to the hiring manager for consideration. The reason they ask for this information is to track the success of their recruitment strategies, for example are they attracting a diverse range of people to apply for their roles. It is not used to make recruitment decisions. This is valuable information for an employer and may change their recruitment practices in the future, so completing it is important, although not always mandatory. Telling a perspective employer any information about a disability(s) is a personal choice. It is up to you if, when and how. If you are unsure at any stage, consider what would be the advantage of sharing at that point. If you decide that you want to, think about what would be most relevant for the employer to know at this specific stage of the recruitment process. Go to our Disability and Accessibility in Careers NOOC For years employers have been using AI systems to screen candidate applications, highlighting keywords to make it easier to shortlist on mass. But now Generative AI systems are available to candidates too, so should you use them? There is no doubt it has its uses, helping with structure, or initial ideas for you to think through and include. But always remember the answers it gives are only as good as the questions you ask. These systems have no contextual awareness, they can’t think critically or assess the reliability of information. Employers want to know you as an individual to ensure your skills, strengths and values align with their company and the role requirements. So, you may do yourself a disservice if you rely on these systems to write about a very personal topic – you. You are best placed to sell yourself to an employer, doing this during the application stage will help enormously when you come to interview. People hire candidates they want to work with, so if you remove the personal touch from your application you will end up sounding just like everyone else. For more information: go to our webpage on using AI in applications. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}