{
    "url": "https://www.nottingham.ac.uk/careers/students/furtherstudy/thinking-about-a-phd.aspx",
    "content": [
        {
            "p": "A PhD is the highest level of academic qualification in the UK and it involves three to four years of original research on a specific topic. If you're considering taking a PhD, our advice will help you investigate whether or not it is the right option for you. Book an appointment Read PhD student stories on our blog Anastasia Lazaridi PhD Alumna Read Anastasia's blog post There are two main types of PhDs: predesigned projects and self-proposed projects, chosen based on personal preference and circumstances. There are different types of PhD, some related to particular professions, such as engineering and medicine, and some that include a first year of study at master's level. Research degrees differ from taught degrees. You'll be expected to: Think seriously about your reasons for taking a PhD as research degrees are rewarding, but tough. You will encounter periods of self doubt and difficulties. Being able to focus clearly on your original motivation and having a realistic view of what a PhD is will help Prospective students can be approached by a tutor or final year project supervisor if they consider the student has the academic qualities to undertake a PhD. If this happens to you, stop and think about what a PhD involves and if it really is what you want to do.. In a research degree you will not undertake a set course of study with a curriculum to follow, lectures to attend, supported by a reading and resource list. You will have to take responsibility for managing your own learning and achieving your PhD. There are, of course, support systems in the form of your supervisor, other academic colleagues and peers but it is your responsibility to plan and manage your work, to seek help and support when you need it and to overcome difficulties and setbacks. You will need to be prepared for what some call, “the loneliness of research”. While there may be other researchers in your department or school you will all be working on different topics so the “camaraderie” associated with an undergraduate or masters group of students is not replicated in a PhD. These are some of the attributes that PhD students possess: Some other things to think about: There's no central admissions system for research degrees. University departments will advertise the vacancies they have for PhD research degrees and they will receive and assess those applications. You may also see PhD opportunities advertised as part of a Doctoral Training Partnership (DTP), Doctoral Training Centre (DTC) or Centre for Doctoral Training (CDT). Advertisements will appear internally on departmental noticeboards and on university online vacancy bulletins (via the human resources department). You may be approached directly by a supervisor who has a research grant and has a vacancy, this does not automatically mean the place is yours but it is good to have the support of a supervisor. Find a PhD - searchable database of PhD opportunities Jobs.ac.uk - find PhD opportunities There are some differences in the application procedure between academic disciplines but generally you will complete an application form and include a personal statement or an outline research proposal. It is good practice to reach out to prospective supervisors prior to applying, as this will help you get more insight into both the PhD itself and what the supervisor may be looking for in candidates in more depth, as well as a better understanding if it is a good fit for you or not. For advertised projects, the supervisor will be listed in the advertisement. If you proposing a project yourself, you will need to find potential supervisors to reach out to. A good place to start is looking at department, faculty, school staff lists on university websites. Typically the first step is to send an email tailored to each supervisor, using their correct title and name, and clearly state your current degree, your intention to pursue a PhD, and the specific programme you're interested in. Demonstrate your enthusiasm by aligning your research interests with the supervisor's expertise and mention specific aspects of their work that resonate with you. Highlight your suitability by briefly mentioning relevant achievements and consider attaching your CV for more detail. Clearly outline any specific PhD programmes or funding options you've identified, and politely ask if they are interested in discussing PhD supervision further, while being patient and respectful of their time. In the sciences, engineering and technology you may not need to submit a research proposal but will write a statement about why you wish to contribute to the area under investigation. In the arts and social sciences you may need to generate a research idea and be able to present this as a proposal in your written application. FindAPhD - Information and advice on the application process A PhD interview covers your interest in the research area and your commitment to a PhD. Some typical questions may be: If you are successful and offered a place but have not yet secured funding, the offer will be subject to you being able to satisfy this requirement. FindAPhD - PhD interview questions Jobs.ac.uk - Top Ten PhD Interview Questions The main sources of funding in the UK are: government, research councils and charities. These methods of funding are highly competitive, subject to eligibility requirements and sometimes reserved for international students. If you're concerned about how you would fund a PhD, you may want to consider taking a part-time PhD. These usually take about six years and if you've already started your career, may be part of your professional development. Gov.uk - Information on the Doctoral Loan for perspective PhD students Research Councils UK Information on funding, availability and eligibility This online guide provides alternative sources of funding - especially charities - which can make awards (fees, maintenance, research costs) to any student regardless of subject, or nationality. It contains a huge database of funding opportunities, comprehensive guidance, and numerous tools to help you prepare a winning grant application. We have purchased a licence for the guide so it’s free to Nottingham students to use. Free webinar for UoN students Luke Blaxill from GradFunding held a webinar on how to apply for funding through charities and trusts. He also covered more traditional sources of funding for PhD students. This is an excellent session on all aspects of funding. GradFunding webinar. Login to MyCareer to watch it 189 UoN students received funding through the Guide with the total amount exceeding over £120,000. Log in to the Alternative Guide to Postgraduate Funding In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Although these videos are targeted more at science students, they still offer useful guidance for students from other faculties. Login to SharePoint to watch the webinar Careers and Employability Service Visit our site for postgraduate researchers Prospects Information on postgraduate study, research and funding options Vitae Main website for research telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}