{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/clinical/equine.aspx",
    "content": [
        {
            "p": "Keen on combining your veterinary skills in a varied job? If you like working outdoors, working with people and are a good communicator read on to explore the career opportunities within equine veterinary practices. Return to the Vets homepage Book a careers appointment Equine vets provide medical care to all sorts of horses, ponies and even donkeys. Equine vets treat a wide variety of cases and can collaborate with many different stakeholders from individual private clients to large professional competition or racing yards. The main responsibilities include; In addition to your clinical capabilities, you need to be able to handle horses with confidence and have strong communication skills when engaging with clients. Many equine vets work within an ambulatory setting meaning that you will travel around visiting patients. In this type of job you need to be independent, organised and enjoy a day ‘on the road’ travelling between calls. You could be employed in a clinic or hospital setting often working in larger teams with equine vet nurses and vets who specialise in areas such as orthopaedics, surgery or medicine. They accept referral cases by GP vets who want a specialist opinion for a horse they are treating. Equine practices across the UK vary from small to large teams, some form part of a mixed practice or charitable organisation. Opportunities for equine vets exist internationally- especially within the racing and breeding sectors. If you enjoy working outsides, working with people and horses, and travelling out to see your patients then equine practice could be a great choice for you. The job can be physically demanding and working days can be long. Ambulatory jobs require working on yards and travelling so require you to drive but some equine vets are solely hospital based. Most roles involve on call and weekends out of hours duties. The most common out of hours emergencies you are likely to experience are for colic and wounds. If you are keen to specialise, there are recognised routes via internships and residencies. Many intern positions are available every year which are predominantly hospital-based or within larger equine practices, to provide additional supervision and training. Many graduates choose to enter equine ambulatory practice via an internship as it allows them to learn from more experienced vets without having to take full responsibility for all decisions and treatment. Other graduates are confident to go straight into equine practice. Consider the type of practice you might want to work in. To gain experience of a variety of equine cases, busy ambulatory practices will expose you to a wide array of common conditions. You might spend time driving around and performing similar tasks on individual days but this can be useful to ask questions and assess you knowledge and understanding. Spending time in a hospital will allow you to see more horses and in-depth case work-ups A mixture of ambulatory and hospital settings would allow you to gain a diverse experience from EMS placements and to develop your knowledge for your final assessments and the future. Use the EMS experience to start building your professional network. Develop good working relationships with colleagues on your EMS, you might want to apply to them for a job later in your career and practices look favourably on students who have previous experience with them. If you really enjoy EMS at a particular practice, returning to that practice allows you to develop relationships with staff and often affords more capacity for development of practical skills. If you think you may want to work in a specialist vet practice, it is useful to undertake EMS in this environment to ensure it’s the right area for you. Think about the type of work you want to do – if you want to work in the racing industry, then you need to select a practice which serves the racing industry and has a relevant caseload. If you want to do stud work, you need to see practice during the stud season (spring/ early summer) and with a practice that is particularly active in this field. Don’t forget to think about other types of EMS when planning your work experience – placements in equine charities or with different caseloads, for example You do not need an internship or residency to work in equine practice. However, if you wish to specialise or work in a referral hospital, then you will need to undertake further qualifications. Internships usually provide an excellent introduction across a range of aspects of equine medicine, surgery and anaesthesia, which can then help you decide if you want to work in general practice or specialise further. If you want to do a residency, then the current European and American Diploma schemes require you to have completed an internship. In some cases you can provide evidence of experience in first opinion practice (usually around two years) as an alternative. Find out more about internships and residencies There is excellent information on the internship programmes on the BEVA website. This very much depends on the practice and staff. A smaller practice will likely have fewer facilities and usually focus predominantly on first opinion ambulatory practice. A larger practice may have a wider range of people and experiences and/or a central hospital or clinic to provide referral and back-up support. Working within a smaller team may mean working within a close-knit group, where all vets will have a good knowledge and relationship with their clients. The on-call rota is likely to be more frequent but less busy. Larger practices may have specific areas or regions allocated to different vets. Your on-call rota is likely to be less frequent but busier and cover a wider area. Some equine practices will use an out of hours provider for weeknight or weekends on call cover within a group of equine practices. This improves the on-call rota for vets but it is unusual for equine vets to have no out of hours responsibilities. However, all these aspects are very much dependent on the individual practice. Make sure that you ask about client and case allocation, teamwork, and support, mentoring for new graduates, and on call rotas and caseloads. This is very dependent on the individual practice and their approach. If you work in a small ambulatory practice, you will be seeing cases in the field on your own, but your colleagues can help and support as needed and be easily available for phone support. A small mobile practice can still provide excellent supervision and support. Larger practices with hospitals can provide direct supervision with colleagues physically in the same building, but they can also be very busy. You need to be clear when you consider applying for positions what you are confident doing, what you need supervision for or help with, and what levels of support the practice can provide when you start. It is also helpful to ask what the practice does as a routine for all vets, e.g. do they have regular case rounds or discussions and/or do they hold journal clubs or mortality and morbidity rounds, so that you know what the long-term ongoing support and approaches are. Many practices will have transition new graduates into the equine practice by starting them with routine appointments and cases whilst they find their way around and meet clients etc. Emergencies such as colics and wounds can occur at any time of day and week but this adds variety to the day. Being prepared to triage cases can be hugely beneficial to aid team integration and build confidence of new graduates.BEVA website. There are a wide range of career opportunities as an equine vet and as all vets, career development is a lifelong thing. The traditional areas of specialisation in disciplines (such as medicine, surgery, anaesthesia, diagnostic imaging) through internship/ residency/ diploma programmes. Further training, whilst continuing to work in practice, can be achieved by enrolling on a certificate programme in line with your clinical interests to achieve Advanced Practitioner Status. Many equine vets own and/or run equine practices. Salaries and responsibilities within the practice will increase with experience. There are many options for non-clinical development, including research and industry, regulatory bodies, equine welfare and policy development. There are a number of excellent equine charities who employ vets to work both within the UK and abroad. Find out more on the BEVA website telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}