{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/it/case-studies.aspx",
    "content": [
        {
            "p": "Two computer science graduates talk about their current role, their career paths from studying at Nottingham and their advice for you based on their experiences. My journey started in a graduate role at RBS in Jersey and realising it wasn't for me, I ended up spending some time finding my passions and direction. I'm currently working at an investment bank doing mergers and acquisitions and love the client-facing nature of the work, the team aspect and the ownership of work. The biggest tip I would give students is to take their time and look for what they really want to do and are passionate about. This may be very cliché, but we spend more time at work than anywhere else. I would also stress the importance of patience, it is all too easy to look at what others are doing and assess your progress relative to others, everyone is on their own journey and focus on yourself and things will work themselves out. I graduated from Nottingham in 2019 with a degree in computer science. I always had an interest in technology, however I was particularly inspired by the usability and design side. Upon graduation, I began working as a product manager (PM) at Starling Bank and have recently moved to Monzo. As a PM, I’m responsible for creating new products/features in-app which solve various problems our customers face, working very closely with a variety of teams. Thanks to my degree, I am able to understand what is feasible, what trade-offs to make and how quickly we can launch a product. Though I believe degree choice matters a lot, equally important are your extracurricular activities. I volunteered as an IT consultant through the Nottingham Advantage Award, interned at a tech-startup and completed a placement year. These experiences were vital in helping me understand which path to take following graduation. A great benefit to university is the people you meet. A friend from my course and I set up a new online business (Trimmy) which helps freelancers, barbers, beauticians, etc. take online bookings, manage their schedule and grow their businesses. Using the skills we learned on the course and extracurricular activities, we were able to build and launch this business, which is now growing every month. I would say, remember, computer science is way more than just coding. In the same way medicine is more than just being a doctor, technology has endless opportunities - from writing software, design, research, managing products, and so on. Don’t be put off just because you may not be enthused by the stereotypical computer career. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}