{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/liberal-arts.aspx",
    "content": [
        {
            "p": "As a liberal arts student, you work across a range of subjects, which prepares you to take advantage of a variety of career opportunities. Your degree is about adaptation and innovation and these skills are highly valued in every job sector. The modules you have studied and the experiences you have gained from your degree will allow you to describe your interdisciplinary approach in application forms and interviews. Remember, the strength of a liberal arts degree is the broad knowledge that you have obtained by studying across subjects. The skills gained from studying liberal arts are transferable to a wide range of areas, which means that graduates can, and do, enter a diverse range of roles and sectors. A liberal art graduate with typically have the following skills: Interdisciplinary thinking and making connections It's important to talk about these skills on application forms and during interviews. Liberal arts graduates will work in an extremely wide range of roles and job sectors. From business and finance, advertising, teaching, research, management, law, marketing, journalism, non-profit and public sector work. Employers frequently ask for graduates who are skilled across a range of areas as well as being adaptable and creative. As a liberal arts student, you can meet this demand by drawing upon your interdisciplinary education to work for many varying organisations because you can think differently and create significant added value. You are also well-placed to pursue further qualifications in a specific career or to study at a postgraduate level because of your interdisciplinary skills. Many graduates of liberal arts (and other subjects) take some time building their career through a series of roles to get to a specific career where they want to be or even to decide what job suits them. This could be due to a variety of reasons, for example: A to Z of graduate jobs - explore roles and sectors on our website Prospects website - career options and job profiles Postgraduate study or training can allow you to: It's important to understand your reasons for studying at postgraduate level and to research opportunities and the value of postgraduate study in your sector before applying. Masters funding is available (eligibility criteria exists) in the form of a postgraduate loan, but you can only access this funding once hence the importance of choosing your course carefully. If you'd like to talk this through with an adviser, arrange an appointment to speak to us. Careers blog: Thinking About Postgraduate Study? Find out more about further study The opportunities listed are primarily aimed at current students living in the Nottingham area. If you are well into your final year, graduated or are no longer in Nottingham, you can access work and volunteering options in your home area. Depending on your location and what you want to do, your strategy to develop your skills and experience may vary. You are welcome to have a chat with us, so just arrange an appointment. Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge We advertise part-time, casual and temporary jobs on campus and with local businesses. Created just for you, the advertised vacancies can fit around your studies and other commitments. The vacancies are advertised in two places. On-campus jobs Off-campus jobs Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Working with young people Undertake an exchange semester in another country and broaden your horizons. Talk to your tutors and find out more about the programmes available from the International Office. Exchange programmes You can now undertake an optional placement year as part of your degree at the end of your penultimate year of study. The placement can be aligned to your degree discipline or related to your career aspirations. Speak to a career adviser or your school for more information. If you are no longer at Nottingham, you can access work and volunteering opportunities at home. Depending on your location and what you want to do, your strategy may vary so come and speak to us or arrange a telephone appointment. Digital skills are highly valued by employers and essential in many career fields, including advertising, publishing, marketing, and general commerce. They range from social media to coding and will definitely enhance your employability. There are various ways to develop your digital skills whilst at university. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}