{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/clinical/internships-and-residencies.aspx",
    "content": [
        {
            "p": "There is often inconsistency in employers’ use of language relating to internships which can add to confusion as to what an internship actually involves. It is therefore important to research and fully understand what the employer is offering through internship and residency opportunities. Return to the Vets homepage Book a careers appointment Most internships last for one year and tend to take place within private referral centres or universities. Pay is often low and hours long, however, an internship should provide you with the opportunity to develop your knowledge and skills within a supportive environment under the supervision of one or more veterinary specialists. Some employers may look for previous experience in a practice in their selection process. The use of the term 'internship' can vary from one employer to another. Some employers may offer a structured programme of support with protected time for professional development whereas another internship opportunity may consist of a full-time vet job with informal mentoring from a senior member of staff. In order to know what you are applying for make sure you do your research. Speak to the employer and find out what the internship will involve, what support you will receive and what you will have gained by the end of the programme. Don’t be afraid to speak to previous interns and ask them what their experience was like. If your long-term aspiration is to obtain a residency, find out what percentage of interns progress on to residencies with the employer. Does the institution offer residencies in your specialist area of interest? Rotational internships enable you to gain exposure to a variety of disciplines within the organisation or hospital for example, surgery, medicine, anaesthesia, where you may have the opportunity to assist in some tasks and consultations. In a non-rotating internship you will work within one specific area of practice. This may be a perfect choice for if you clearly know where your passion lies but not so good if you want to keep your options open. If you aspire to a residency be sure to check with the relevant European college regarding internship requirements – some specify rotating, others will allow non-rotating. If undertaking your internship within a university, it is likely that you will be involved in teaching and supporting students. In addition, you may have the opportunity to be involved in research. If you are interested in undertaking an internship in the US, the AVMA have details on veterinary internships. AVMA internship information The American Association of Veterinary Clinicians sponsors the Veterinary Internship and Residency Matching Program where you can search and apply for residency and internship opportunities. Veterinary internship and residency matching program Please note, to apply for US internships, it is likely that you will need to have passed the NAVLE test and possibly have the relevant state/territory licence – see our working abroad pages for more detail. All vet graduates starting their first graduate job are now required by the Royal College of Veterinary Surgeons to enrol in a professional development programme called VetGDP (Graduate Development Practice). The VetGDP is structured around Entrustable Professional Activities (EPAs) which enables new graduates to develop confidence and competence in tasks relevant to their role. The RCVS advice on internships reads that: ‘There’s no reason why interns can’t adapt the existing EPAs and/or design their own Entrustable Professional Activity (EPA) around an internship, as it is still clinical practice. Our bank of EPAs will cover the majority of situations; there will be areas that aren’t covered and so we will support VetGDP Advisers and graduates in developing an EPA if required.’ (Source: RCVS). Find out more about VetGDP During a residency you will take on training and research with the aim of obtaining a specialist qualification in your chosen field. In a residency you will undertake accredited training within a particular area of veterinary medicine or surgery leading to an accredited diploma. Most European diploma qualifications awarded by members of the European Board of Veterinary Specialisation automatically grant the use of the term ‘veterinary specialist’. Residencies may require the completion of an internship as an entry requirement. Residencies tend to take between three and four years to complete and are undertaken within a university or a referral centre. Many residencies within universities will lead to a masters in veterinary medicine or veterinary science degree (MVM or MVSc). During a residency you will be required to undertake research projects, produce and publish research papers or present at conferences. If undertaking your residency within a university, it is likely that you will also be involved in teaching and supporting students. Residencies are generally advertised through university establishments and online via the relevant European college websites. Further information about the specialist education and accrediting veterinary specialist colleges/providers, visit: European Board of Veterinary Specialisation \"After graduating in July 2016, I went on to complete a one-year farm animal internship at Cambridge University. One of the main reasons for pursuing an internship was because of my concern of going out into practice as an ambulatory vet with little or no clinical support. The internship was great for me as it provided me with an excellent platform to clinical practice, allowing me to develop my existing skills set alongside a supportive academic clinical team. Completing my internship at a university establishment meant that I was actively involved in the clinical teaching. This enabled me to consolidate my own knowledge, implement best practice techniques and provided an excellent opportunity for clinical discussion of cases. Clinical discussion taught me about the varied approaches to an individual case and the importance of continual learning in order to strive to be the best. The internship enabled me to maintain a link to academia and gave me the opportunity to be involved in clinical research. This was important for me as I am an ambitious individual who wants to progress onto further postgraduate qualifications. The decision to pursue the internship did not disappoint and I have subsequently moved into clinical practice with greater competence and confidence and I am now working in New Zealand in a large progressive farm animal practice.\" telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}