{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/aerospace.aspx",
    "content": [
        {
            "p": "Many pursue a degree in aerospace as a way of developing sector specific skills with a view of pursuing a career in the aerospace sector. However, a degree in aerospace engineering will also give you a broad range of technical and transferable skills allowing you to work in a wide range of industries. Book an appointment Check out our events Search for graduate vacancies or internships In addition to your professional and technical skills, your aerospace degree will equip you with key employability skills such as: A large proportion of our students go on to work as aerospace engineers. Some students choose to use the skills they have gained throughout their degree to move into graduate roles outside of engineering Regardless of whether you are a first year or final year, developing skills outside your degree will enhance your CV and allow you to provide evidence of these in applications and at interviews. We have a wide range of opportunities at the University for you to explore: An industrial placement will enable you to gain industry experience, crucial for your career development. Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge The Nottingham Advantage Award offers interesting extracurricular modules to develop and reflect on your employability. With over more than 200 modules across our three campus in the UK, China and Malaysia. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. We offer a range of events to develop your skills and meet employers throughout the year. Check out: Here is a sample of the employers who recruited our aerospace graduates over the last few years: Other engineering roles such as process engineering, project engineering, renewable energy engineering can either be progressed into directly with aerospace degrees or following from a more specialised MSc. Not all engineering graduates become engineers. Many of our graduates find alternative opportunities where they are able to use their transferable skills: Examples of non-engineering roles and employers of Nottingham graduates: Job roles Employers Explore more graduate roles Some students will progress into further study at postgraduate level in both engineering and non-engineering related areas. Examples of recent further study destinations of aerospace engineering students include: Postgraduate study can be a way to develop a further specialism in a particular area of interest, either through carrying out research or undertaking specialist taught modules. It can also be a way to gain skills and qualifications in areas outside engineering in order to progress into other professions. For students studying for a BEng qualification undertaking an accredited MSc will give you the level of qualification necessary to become a chartered engineer and to meet the entry requirements of some graduate engineering employers who ask for a masters level qualification. For students studying for an MEng degree, undertaking an MSc won’t give you a higher-level qualification, but it can be a way of specialising in an area. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}