{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/interviews/after.aspx",
    "content": [
        {
            "p": "Taking time to reflect on your interview experience allows you to identify strengths and areas for improvement, paving the way for future success. Seeking feedback from interviewers provides valuable insights, regardless of the outcome, helping you to grow and refine your approach. Return to the main interview page Book an appointment with an adviser As soon as you can after your interview, take a minute to write down the questions you were asked and the examples you used in your answers. Think about how well you feel you answered the questions and whether there are any areas you would like to improve on if you were asked again. Taking time to reflect on your interview will help you to improve for your next interview. If you would like to discuss how you answered the questions and ways to improve your answers or interview technique for future interviews, you could book a careers appointment. After an interview it is so valuable to gain feedback on your performance, it will help you to understand where you performed well and where there is room for improvement. This insight will be valuable whether you are successful in securing the role or not. When you are contacted after an interview, with either an offer or a rejection the company may offer for you to contact them if you would like feedback. Always contact them. If a company doesn’t offer the feedback, we would still strongly encourage you to contact them to ask for some comments to help you to develop and progress. Companies may not be able to provide feedback for pre-recorded video interviews due to the number of candidates at this stage of the recruitment process. Find out more about asking for feedback Unfortunately we won’t all be successful every time we interview, but learning to manage that rejection in a positive way is a really valuable skill and can help you to succeed next time. Focus on what you have learned from the experience, don’t forget what went well, reflect on what you could do to improve the outcome of your next interview. This might be developing further skills, gaining experience or practising your interview technique. There are some excellent techniques explained in our blog that might help you to navigate this rejection. You can also book a one-to-one careers appointment to discuss with a careers adviser, this discussion can help to put everything into perspective and create a plan of action. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}