{
    "url": "https://www.nottingham.ac.uk/careers/postgraduate-researchers/outside-academia/index.aspx",
    "content": [
        {
            "p": "In a report by UK Research and Innovation focusing on those working outside of higher education, one in five employers said that their doctoral graduates were: UKRI - The impact of doctoral careers Watch webinars with UoN alumni Read UoN alumni case studies Sophie talks about the transferable skills that Capgemini were interested in and the value employers place on students who study at PhD level. Sarah didn't know what she wanted to do when she graduated and she talks about how she approached making her career decision. There are some settings where your specialist research knowledge and skills will be in demand, including industry, the public sector, commercial research organisations, consultancy firms, charities and think tanks. To enhance your chances of making a successful transition, consider the following: Professor Stephen Wang worked as an assistant professor in the School of Medicine at the University of Nottingham before moving to Johnson & Johnson as an associate director. He talks about his career from his early days at Nottingham to Johnson & Johnson and how he has transferred those skills from academia into industry. Stephen talks about the recruitment process in industry and how it is very different from academic recruitment. UK Research and Innovation - list of independent research organisations eligible for research council funding Jobs.ac.uk A Knowledge Transfer Partnership (KTP) is a three-way project between a recent graduate (KTP Associate), a business and a university. It is one of the country’s largest graduate placement schemes with more than 350 jobs available to UK, EU and international students. Contact our KTP team Graduates will be recruited to manage and deliver a strategic project for a business whilst being supported by their university. You’ll be employed by the University but work in the company under their terms and conditions. As a KTP Associate, you will: Current KTP vacancies managed by the University National KTP opportunities Read Sara Bru Garcia's blog post: KTP - My Time as an Associate Working on a Collaborative Project Look around your department and across the wider university, there are numerous roles that will utilise your knowledge of university structures and processes and allow you to support the teaching and research of others. Examples include university administration, management, research policy, academic support, quality assurance, careers and employability and marketing. The Guardian - jobs for non-academic roles in HE Jobs.ac.uk - working in HE in a non-academic role Jobs.ac.uk - working in higher education Jobs.ac.uk - vacancies for professional, managerial and support services roles Many graduate jobs in the UK don’t require a particular subject background, as employers are often more interested in whether you have the right attitude, skills, attributes etc. For example, areas such as finance, IT and management look for candidates with strong analytical skills, attention to detail and self-motivation; all skills that you will have developed during your research degree. Many of these roles will be appropriate for postgraduate applicants. You will be treated in the same way as any other graduate applicant. Prospects - job profiles Note: While they are primarily aimed at the undergraduate reader, they do include PhD specific information where relevant, and they provide useful detail about each role. Jobs.ac.uk - PhDs caught between graduate schemes and experienced hires A relatively small number of employers have specific schemes and programmes for PhD applicants, for example: The Bank of England - PhD internships and Researcher Programme Many individuals build a successful career from their interests. That may involve self-employment or might arise from being in the right place when an opportunity comes up such as at a sports club or charity you are involved with. It might also form part of a portfolio career i.e. working part time for several different employers. Organisations offering support and advice for self-employed The Guardian - turning a hobby into a career Innovative thinking and creative problem solving are key skills for a research student and also for a successful entrepreneur. With the huge potential for commercialising innovation, universities are keen to encourage business ideas and often provide lots of support for potential entrepreneurs, for example through business plan competitions and entrepreneurial training courses. University's Ingenuity Lab University of Cambridge - list of organisations for start-up support, competitions, funding and investment and business advice Find out about their: Watch webinars featuring UoN PGR alumni working in roles outside academia telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}