{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/what-is-a-graduate-job/selfemployment.aspx",
    "content": [
        {
            "p": "If you want to set up your own business you'll need an original idea, hard work, determination and expert advice. The university has a history of enterprising students and alumni developing successful businesses in a variety of sectors. Find out what support is available to you and get started. The University of Nottingham's Ingenuity Lab, part of the The Haydn Green Institute for Innovation and Entrepreneurship (HGI), helps undergraduates and postgraduates learn about enterprise and build their entrepreneurial skills. If you have an interest in business, whether it’s a commercial venture or a social enterprise, the Ingenuity Lab is there to support you to create products and services that are not only fit for purpose, but also offer a different perspective and approach. Visit the Ingenuity Lab website Monet Davis, management student. Read Monet's story Entrepreneur First (EF) Graduate scheme for computer science and engineering students and graduates HMRC self-employment e-learning resource Practical advice on financial issues (taxation, NI, VAT, etc.) The Prince's Trust Business support and low-interest loans for 18-30 year olds Shell LiveWIRE Supporting 16-30 year olds start and develop their own business Social enterprises are businesses set up to tackle a social and/or environmental need. The profits are then used to further the social and environmental goals of the business. Social enterprises operate across a wide range of industries and sectors. For more information and support look at the Social Enterprise Coalition website and read their guide on starting a social enterprise The British Franchise Association (BFA) Learn about franchising and attend seminars covering how to buy one Contractor UK Graduate guide to contracting work Everywoman Business support for female entrepreneurs Gov.uk Government information on starting your own business, with practical advice National Endowment for Science, Technology and the Arts (NESTA) Investment for young businesses to encourage development Nottingham Business Venture Training scholarships and financial support Prowess Supporting women to start and develop their own business The Royal National Institute for the Blind (RNIB) Information on setting up businesses for blind or partially sighted people telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}