{
    "url": "https://www.nottingham.edu.my/Careers/Students/Postgraduate-Students.aspx",
    "content": [
        {
            "p": "Planning your postgraduate career development may be a little different from undergraduates. Whether you are just starting out, have limited experience or are experienced professionals looking to join the workforce, the Careers Advisory Service (CAS) is here to support our taught and research postgraduates in developing and managing your career. We offer advisory and services tailored to your postgraduate career needs. Our activities, workshops and sessions help you to discover more about your pathway and offer industry insights for your career of choice. We could also work with you during virtual one-on-one sessions to identify your career objectives so that you are well-prepared to develop a career plan, acquire the right skills and manage career changes ahead. SERVICES: ‘Get Ready Get Hired’ Certificate Programme Career Talks and Workshops Postgraduate Careers Series Resume Competition Career Advice and Resume Review Digital Resources and Online Courses Browse online resources such articles, links and documents to help postgraduates. Think about where your PhD qualification might take you. Visit here. MBA students can access a whole range of information about careers and online subscriptions. Visit here. This online course supports all taught postgraduate students for their employment preparation or research. Follow the course at your own pace and at a time that suits you. Complete this flexible online Moodle course targeted for Research Postgraduates to be informed and prepare yourself for your future career. Career resources and information in the SharePoint is applicable to all, but the PhD career folder contains careers resources appropriate for postgraduates in exploring career options in academic and corporate, CV writing, networking and interviews. Job Opportunities telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}