{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/pharmacy/pharmacy-case-studies.aspx",
    "content": [
        {
            "p": "Three University of Nottingham pharmacy alumni talk about their current roles and how they use their degree in their job. In my role as a specialist clinical pharmacist in oncology and haematology, I work closely with the multidisciplinary healthcare team to manage pharmaceutical care for cancer patients. I am responsible for verifying chemotherapy and other complex treatment plans, ensuring they are both safe and effective. I also provide patient counselling, offering guidance on potential side effects, drug interactions, and correct medication use. My degree from Nottingham laid a solid foundation for my career ambitions by equipping me with a deep understanding of pharmacology, clinical pharmacy practice, and patient care. The combination of theoretical knowledge and practical placements provided me with essential skills, such as critical thinking, problem-solving, and effective communication with patients and healthcare teams. The method of teaching and assessment styles used during my degree were extremely relevant and applicable to life as a qualified pharmacist. My understanding of pharmacology, drug interactions, and therapeutic drug monitoring is essential for verifying chemotherapy and managing complex treatment regimens. The critical thinking and problem-solving skills developed during my studies help me assess patient cases, identify potential issues, and make informed decisions. Also, the communication and counselling skills developed through simulated patient scenarios during my course has been invaluable in my role, allowing me to effectively interact with patients and colleagues to optimise pharmaceutical care. In my current role, I split my time between being a ward pharmacist and a lecturer at the University of Huddersfield. As a ward pharmacist, I am deeply involved in patient care, managing medication therapy, and collaborating with healthcare teams to ensure optimal treatment outcomes. In my academic role, I enjoy teaching and mentoring pharmacy students, sharing practical knowledge and guiding them as they prepare for their future careers. This dual position allows me to stay connected to both clinical practice and education, combining my passion for patient care with my love for teaching My degree from the University of Nottingham was instrumental in supporting my career ambitions by equipping me with a comprehensive understanding of pharmacy practice and fostering critical thinking skills. The blend of theoretical learning and practical placements gave me the confidence to navigate complex clinical scenarios and excel in patient care. The university's emphasis on research and evidence-based practice prepared me to approach problems analytically, which has been invaluable in my dual role as a ward pharmacist and lecturer. Additionally, the supportive and innovative environment at Nottingham inspired me to pursue a career that balances both clinical practice and teaching, allowing me to contribute to the profession in multiple ways. The University of Nottingham played a crucial role in setting me up for my career, providing me with a strong foundation of knowledge and practical skills that I carried into my professional life. The rigorous academic curriculum, supportive faculty, and hands-on placements equipped me with the confidence and competence needed to successfully complete my trainee pharmacist year. The university's emphasis on real-world experience and critical thinking prepared me to navigate challenges and excel in both clinical practice and educational roles. My job involves the launch of new medications into the UK market. To do this, I help with outreach and dissemination of the product information by organising study days, conferences meetings and roundtables largely aimed at hospital consultants and pharmacists. I then assist in the review process for the medications so they can be made available to the NHS. The degree provided brilliant scientific and clinical training, and made me more confident at speaking authoritatively, largely through competence based verbal assessments and presentations The clinical knowledge developed from the MPharm degree as well as the understanding of the NHS structure. The soft skills developed from group presentations. The IT skills you pick up just from the various coursework and labs you do during the various modules. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}