{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/working-abroad/index.aspx",
    "content": [
        {
            "p": "As a vet you can work in a range of environments and for a number of Nottingham graduates, choosing to spend time working overseas is a big draw. This may be for short period of time or they may relocate on a permanent basis. We'll guide you through working in different countries and the things you'll need to consider when exploring your options including visa requirements. Return to the Vets homepage Book a careers appointment With a BVM BVS degree from Nottingham, you'll be qualified to practice in the UK, Australia, New Zealand and the Republic of Ireland. This is because your degree is accredited by or recognised by the: The University of Nottingham is an accredited Veterinary Education Establishment with the European Association of Establishments for Veterinary Education (EAEVE), however, this does not give you the automatic permission to work in the EU post-Brexit. See the Working in Europe below for more details. The University has obtained accreditation from the American Veterinary Medical Association (AVMA). This is a prerequisite for becoming a licensed vet in the US, with some further steps required for licensing. If you are hoping to work in a country not detailed below, then a good starting point is to search for the relevant veterinary board, awarding body or association for that country. Through the veterinary board you should be available to find the relevant information for vets wanting to practice in that country. Following the UK exit from the European Union in January 2021, a UK veterinary degree is no longer automatically recognised by EU member states and each country will interpret your qualification based on their own laws and regulations. The University of Nottingham continues to be an EAEVE-accredited veterinary school. If you are interested in working in Europe, you will need to contact the relevant veterinary authority in your country of interest to enquire if your UK qualification is recognised. If it is not, you may need to undertake further exams or action before you can practice as a vet in that country. The Federation of Veterinarians of Europe (FVE) has a list of competent authorities within the EU. A Mutual Qualification Recognition Agreement between the RCVS and the Veterinary Council of Ireland (VCI) agreed the continued recognition of each other’s accredited veterinary degrees. This means that your veterinary degree from the University of Nottingham will be recognised by the VCI. To practice veterinary medicine in the Republic of Ireland you will need to register with the VCI. In 2022, the University of Nottingham obtained American Veterinary Medical Association (AVMA) accreditation which means that Vet students who graduated after June 2022 have an AVMA-accredited qualification. In the majority of US states, graduation from AVMA-accredited institution is a prerequisite in the process for becoming licensed for professional practice as a veterinarian. With an AVMA-accredited qualification, graduates are eligible to take the North American Veterinary Licensing Examination (NAVLE) test, which allows a vet to work in the US and Canada. The NAVLE consists of a 7.5 hour exam of 360 questions which can be taken at one of several “Prometric” test sites across the UK. The NAVLE can be taken during two time periods in the year - a four-week period between November and December, and a 2-week period in April. The registration deadlines for taking the NAVLE test are 1 August and 1 February respectively. You can register for the NAVLE up to 10 months before graduating. Once you pass the NAVLE test you will then need a state or territory veterinary license for the state/territory in which you wish to work – this process may require further tests to be undertaken. Find out more on the AVMA web pages Find out more information about NAVLE test Preparing for your NAVLE test Vet Prep Zuku review AMVA accreditation is not retroactive. Therefore, if you graduated from the University of Nottingham before June 2022 and wish to work in the US, you will need to complete an educational equivalency certification program such as that administered by the AVMA: Educational Commission for Foreign Veterinary Graduates (ECFVG) This is a four-stage process, which includes: Find out more about the stages Once the ECFVG has been completed, you will be able to apply to take the NAVLE test. To apply for a licence to practise in Canada you must hold a Certificate of Qualification from the National Examining Board (NEB) before you can apply for registration by the Canadian Veterinary Medical Association (CVMA). CVMA - find out more Canadian Veterinary Medical Association (CVMA) Canadim - Canadian Immigration Law Firm article As the University is accredited by the Australasian Veterinary Boards’ Council (AVBC), you are eligible to work as a vet in Australia and New Zealand without needing to complete any further examinations. You will need to register with the individual Australian state’s veterinary board, or the Veterinary Council of New Zealand, depending on where you want to work. You may also need to apply for additional licenses such as a state radiation licence and a microchip implanter license. To work in New Zealand you will also need to hold a current practicing certificate. AVBC - Veterinary Boards for Australian states Australasian Veterinary Boards Council - AVBC Veterinary Council of New Zealand Vetlink Employment Service On our blog: 10,000 miles from Nottingham: caring for animals in the outback Read Charlotte's story about working in New Zealand Read Adam's story about working in Australia To practise in South Africa vets must be registered with the South African Veterinary Council (SAVC). This requires a small payment, an application form, copies of qualifications and a letter of Good Standing from the RCVS. You would then need to work for the government for one year, known as 12 months Community Compulsory Service which is administered by the Department of Agriculture Land Reform and Rural Development [DALRRD]. The government places you in a job although you can specify what sort of industry you would prefer to work in. New registrants need to apply for the South African work visa before starting the job for the government. After that year of service, you would gain full affiliation to South African Veterinary Council and can work for whoever you choose. SAVC - exam information and more Read Gemma's story about working in South Africa You will need to explore the various visa requirements and options depending on your personal situation to enable you to have the right to visit, live and work in your country of interest. Wherever you decide to work, even if it’s an English speaking country, there are bound to be cultural differences. It’s a good idea to prepare yourself for these in advance to help you settle in to life in a new country quicker. Check out the 42 country guides in GoinGlobal to find out more. Log in to MyCareer to access GoinGlobal Depending on who you ask you will get a multitude of different answers to this question. Vets who have gone to work abroad will often say that having worked in the UK for a year or two before you go abroad will allow you to build on your day one competencies and become more confident as a vet in a country and culture with which you are familiar. After a few years in practice you may be more confident to work in another country knowing you have consolidated and further developed your skills and knowledge through a few years of practice in the UK. The alternative argument is that if you want to work abroad, especially if you are planning to emigrate permanently, then you might want to relocate before you take on responsibilities such as mortgages and family commitments. If you would like to discuss your options with an impartial careers adviser then book an appointment with us. British Veterinary Association (BVA) - for careers advice International Veterinary Students' Association (IVSA) Kookaburra Veterinary Employment The Vet Service telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}