{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/environmental.aspx",
    "content": [
        {
            "p": "You might have chosen your degree because of your interest in nature and our changing ecosystems, or perhaps the desire to make a positive impact on climate change. You could even have a passion to develop new sustainable solutions for farming, fuel and wastewater treatment. Whatever your reasons were, as an environmental science or environmental biology student your degree will enable you to follow any number of different career paths. Book an appointment or attend a drop-in Join the Biosciences Teams site In addition to your subject-specific knowledge, your environmental science or environmental biology degree will equip you with a range of transferable skills including the ability to: You will also develop 12 competencies which have been divided into these four headings: Explore the Biosciences Core Graduate Competencies Why not take an optional industry placement, between years two and three of your degree? This will extend your degree to a four-year programme. Year in Industry As part of this, it is possible to gain accreditation from the Science Council as a Registered Scientist (RSci) Summer internships are also a great way to gain experience, whether in science or non-science based roles. Search for roles: My Career - internships from companies targeting Nottingham students Nottingham Internship Scheme Sources of vacancies for internships Volunteering can help you to build your experience and develop new skills, as well as giving something back. Students’ Union Volunteer Centre Environmentjob volunteering vacancies Volunteer with the Wildlife Trusts If you’re interested in the scientific side of your degree, the summer research placements might be a good option for you. You can find these through the School of Biosciences by approaching a relevant academic who is working in the area you are interested in. There are also sponsored opportunities and funding for summer research placements, visit: Royal Society of Biology - undergraduate studentships Involvement in relevant SU activities including volunteering, sports clubs and societies will always look good on your CV. Conservation Society Environmental Science Society Volunteering The Nottingham Advantage Award offers a range of modules to help you expand, develop and evidence your skills and experience during your time at university. With over 200 modules across our three campus in the UK, China and Malaysia, there's something for everyone. If you’re thinking of moving into consultancy after graduation, the Nottingham Consultancy Challenge module will help you develop and demonstrate all the right skills. Nottingham Advantage Award - find out more and explore the modules on offer Knowing about the latest developments is important for a couple of reasons: firstly it may spark off your interest in a particular part of the sector and secondly, employers often ask questions about the factors that may be affecting their company at an interview as a way of gauging your interest in their business. Institution of Environmental Sciences - FREE membership for UoN students Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Environmental science and environmental biology graduates enter a wide range of areas after graduation, including conservation, consultancy, project management, energy, education, agriculture, ecology and waste management. Find out more about the sub sectors of environmental careers. Some of the employers who have recruited our graduates Some of the roles secured by our graduates Each year a number of environmental science and environmental biology graduates start postgraduate courses either at Nottingham or other universities. Some examples of the types of courses Nottingham graduates study include: Search for further courses and find out about funding In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar Agri-Food Careers Biotechnology Careers Conservation Careers Environmental Careers Scientific Careers Science Careers Beyond the Lab British Ecological Society - careers pages Chartered Institute of Ecology and Environmental Management - careers pages Institute of Environmental Sciences - careers pages Sustainability Exchange - Sustainability Careers Guide telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}