{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/politics.aspx",
    "content": [
        {
            "p": "Studying politics and international relations at The University of Nottingham provides you with a firm foundation for your future career. Politics as a subject is valued by employers in many sectors and our graduates do well in the graduate job market. Continuing to a higher degree is a popular option and our graduates are very successful in accessing taught and research opportunities, in areas related to their academic, personal and career interests. Watch this webinar with a panel of politics and international relations UoN graduates. Learn where your degree could take you. Speakers: Login to SharePoint to watch the webinar In addition to your subject knowledge your politics/international relations degree equips you with key skills valued by employers: If you choose the Q-Step programme you will also develop excellent quantitative analysis and research skills. Approximately one third of large recruiter opportunities are filled by graduates who have already worked for the organisations through internships or placements. Gaining relevant experience during studies has an increasing impact on a graduates' success in the recruitment process. Our graduates continued to be successful in sourcing professional, well-paid positions in major companies and organisations. The table below lists a range of employers where our politics and international relations are now working. Our graduates secured professional positions across a diverse range of employment sectors, but the key sectors of employment for our graduates are: Read Josie's blog: How to use LinkedIn to your advantage as a politics student Watch our webinar that brings together a panel of UoN alumni with backgrounds or academic interests in the US who have forged successful careers across a variety of sectors and, in some cases, in the US itself. Iona Hampson, BBC Senior Journalist. BA Ancient History and History Alice Lilly, Institute for Government (think tank). MA and PhD in the Department of American and Canadian Studies Calvin Medcalf, Sanctions Adviser, UK Treasury. History and American Studies, 2022. James Brookes, Library Director, Virginia Museum of History and Culture. BA and MRes Social policy and research More graduate careers telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}