{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/psychology/case-studies3.aspx",
    "content": [
        {
            "p": "A Nottingham alumna provides an insight into her work in professional psychology and offers advice on getting into this career area. *All details correct for individuals at the time of their interview. Return to the professional psychology page Psychology case studies part one Psychology case studies part two I graduated from the University of Nottingham, with a BSc Psychology, in 2009 and knew I wanted to combine my passion for mental health work and my love of sport and exercise, but just didn’t quite know how to go about it. Initially I started purely down the mental health route and entered the world of IAPT (Improving Access to Psychological Therapies). I built up my clinical experience in IAPT and am now fully accredited with the BABCP as a Cognitive Behavioural Psychotherapist. How did you become a sports and exercise psychologist? Whilst working as a CBT therapist I eventually decided to take the plunge and make a career move towards becoming a sport and exercise psychologist. The first step was to study for a BPS accredited sport and exercise psychology masters. After gaining my masters from Brunel University, I enrolled on the BPS Stage 2 Qualification in Sport and Exercise Psychology (QSEP) training route. This is an independent training route which, upon successful completion, permits you to hold to protected title of ‘Sport and Exercise Psychologist’ and apply for registration with the Health and Care Professions Council. What is your current role and what does it involve? I am currently working as a trainee sport and exercise psychologist at Queen’s Park Rangers Football Academy and am delivering weekly workshops to the U15 and U16 squads. I also provide one-to-one input for any Academy player struggling with a range of difficulties including injury, loss of confidence, and mood and anxiety concerns. I also provide individual consultancy across other sport and exercise settings. I am very lucky to have a wonderfully supportive supervisor who is seeing me through my Stage 2 training and has welcomed me on board at QPR alongside her other trainees. I have less than a year now until I qualify, and I look back on my years of training to date with pride. It’s been a long and undulating journey, but if I had my time again, I’d still choose to do the same! What advice would you give someone considering a career in sports and exercise psychology? If you are considering a career in sport and exercise psychology the best advice I can give you is to make sure you plan ahead. Research the prerequisites and be clear how you may need to adapt your current work-life balance to fit around your training. The QSEP is a flexible training course, however, you will need to put in the time and effort to plan out your training as it is up to you how you will work to meet all the key roles needed to pass the qualification. Having said that, there is now the option to qualify via the professional doctorate route linked to a university. So, if this is more up your street then you might want to consider this option instead. In either case, get networking now, attend relevant conferences and events and for further information visit telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}