{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/ampr/content-management-copywriting.aspx",
    "content": [
        {
            "p": "If you are a creative thinker, possess excellent written skills and are good at managing your time, a role in content management or copywriting may be for you. Content managers in particular are in high demand and there are many opportunities available both in digital agencies and in larger organisations that have digital teams 'in-house'. In smaller companies, working in these disciplines may form part of a wider role which includes social media, digital marketing and account management. Larger organisations are much more likely to have specific roles focusing on just one area. You might also be interested in: If you have questions about your plans, talk to a member of our team. Book a careers appointment Copywriters are required to create engaging original written material (or copy) for webpages. As well as being eye-catching, copywriters need to reflect the style and tone of the brand, and write copy that is SEO-friendly. As well as strong written and listening skills, a basic understanding of digital marketing and how to write for search engines is required. Copywriting can be an entry-level role which then leads on to roles in content management, digital marketing or digital communications. Typical salaries range from £22,000-£80,000 dependent on experience and location. Content managers are responsible for the information that appears on a company's website. They need to ensure that the right type of information reaches the right audience and fits with the brand and style of the site. This involves working closely with designers, developers and copywriters to ensure that words, images, videos and feeds are picked up easily by search engines and displayed on the site in the best possible way. Typical salaries range from £18,000-£60,000 dependent on experience and location. Many businesses offer starting roles within a broader digital marketing context where you can learn many relevant skills and gain experience of copywriting, SEO, analytics and social media. For example, employers will help you to learn and apply skills such as web content management systems (CMS), Adobe Creative Suite for web images, and Google Analytics and Facebook Insights for web analytics reporting. Alice Yeates, a Nottingham graduate now working in a local agency feels that initially, personality can play a stronger role than a technical skillset. We recommend that you take a pro-active approach to developing your digital skills and experience during your time at Nottingham so that you can increase your chances of getting a starting role. There are lots of resources out there to help get you started on any of the above, but we'd recommend: Digital agencies can be found in most large towns and cities across the UK and are usually open to being approached for internships and work experience. Enquiring about experience will work best if you can show that you developed some relevant skills, and have passion and curiosity about brands, culture and the digital world, along with a willingness to learn. The Nottingham Internship Scheme is a great way to gain experience with a local employer that can fit around your studies. If you are a postgraduate researcher, check out the Researcher Academy's placement programme. Being able to demonstrate examples of writing for the web is essential. Use sites such as Creative Pool to showcase your work and make contacts. Also consider writing articles for publications which have an online presence such as IMPACT or LeftLion, or write a blog. You can also enhance your digital portfolio by building a digital profile. Having a presence on Twitter and LinkedIn allows you to follow organisations you would like to work for, keep up to date with industry news and find out about local networking events. You can also keep up with current trends by reading industry blogs and journals such as Creative Review, and The Drum. Once you have taught yourself some basic skills, get in touch with local voluntary organisations and charities who could do with help in creating web content, communicating with service users and some simple online marketing strategies. If there is a role that interests you, make contact with the person working in that role, and ask them lots of questions. You never know, a conversation like this could lead to the offer of work experience or mentoring. Societies such as MadSoc may offer training and networking opportunities. The IDM have a DMA Talent website looking to attract people to the sector through mentoring, workshops and training opportunities. The University's Digital Humanities Centre provides training, experience and networking opportunities for humanities students interested in digital media in the arts. You can choose an area of interest, one of which may include PR, marketing and social media. The Nottingham Writers' Studio, and other local organisations, sometimes offer courses around blogging and social media. Sign up to enhance your existing knowledge, plug any gaps on your CV and even prepare you for job applications. Courses last from a few days to a few weeks and are offered by hundreds of universities around the world. You can also learn more and boost your digital skills on the Digital Garage. Unitemps advertise paid temporary roles, many of which are roles within the University and may allow you to become familiar with web content management systems. Doing a professional course is not a pre-requisite for entry to these jobs, and relevant experience is often more important. However, if you wish to consider a course, the following options could be relevant. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}