{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/industrial-consumer-materials/3d-printing.aspx",
    "content": [
        {
            "p": "3D printing – or additive manufacturing to give it its proper name - has been around since the 1980s. However, in recent years, the technology has developed rapidly and become much more high-profile. The types of materials used have also evolved from plastics and polymers to include metals and biomaterials. For example, there have been a number of recent breakthroughs involving the 3D printing of human organs, and NASA recently funded the development of a 3D food printer for astronauts in space. From trainers to pharmaceuticals and entire houses, there’s almost nothing these days that can’t be 3D printed. Return to the A to Z jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment Search for vacancies The additive manufacturing sector is small but growing rapidly. It is worth around £6bn and growing at the rate of 20% per year. Below are some examples of the types of roles and job titles in the sector. However, bear in mind that as an evolving sector, opportunities and job roles are always changing, so it is important to do your research and keep up-to-date with the sector. If you are interested in working in this area: As a relatively ‘young’ industry, much of the sector is still very much R&D led, as technologies and materials continue to be explored and developed. This means that there are a range of PhD and post-doctoral roles in research groups such as the University's Centre for Additive Manufacturing. PhD graduates may then progress on into R&D roles within industry. As a small close-knit sector, many of these positions are filled through networking and word of mouth. Roles in this area require a specialist depth of knowledge in a range of scientific and engineering areas including materials science, software development and manufacturing engineering. Example job title: Research associate in 3D printing advanced materials The potential for widespread application of 3D printing technologies has also led to the development of a number of ‘spin-out’ companies such as Nottingham’s Added Scientific. They offer technical and consultancy services to businesses to help them understand how they could utilise and benefit from additive manufacturing technologies. Effective consultants require breadth of knowledge, flexibility, good interpersonal skills and commercially savvy. They need to understand manufacturing processes and quickly gain a deep insight into the client’s industry. Recruitment to these roles could be at PhD or masters level. Example job title: Research analyst or graduate consultant As additive manufacturing technology becomes more widely used, there are increasing numbers of opportunities with: Recruitment to these roles is often at degree or masters level. Example job title: Additive manufacturing applications engineer 3T Johnson & Johnson Renishaw There are a range of roles available to support the technical and commercial aspects of the additive manufacturing industry, for example technical sales, marketing, technician and, repair and maintenance roles. These roles may require less specific qualifications, but will still look for applicants with a good technical knowledge, an interest in and understanding of 3D printing, and relevant skill set for the position. Technical sales people, for example, will also require good communication and interpersonal skills along with a good understanding of the technology. Example job title: Graduate technical sales executive, technical assistant, CAD technician In addition to the companies listed in the job roles above, other employers in this sector include: Siemens Stratasys GoPrint3D Graphite Additive Manufacturing Materialise EOS Manufacturing Technology Centre - home to the National Centre for Additive Manufacturing Xaar Additive Manufacturing UK AMazing - check out AM Basics and AM News telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}