{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/criminology.aspx",
    "content": [
        {
            "p": "Whether you're keen to work to prevent crime, work within the criminal justice system, support victims or help individuals integrate into the community, you'll be challenged and gain a high-level of job satisfaction. Beyond the roles directly linked to criminology, the skills you gain on your degree will open up opportunities in connected career areas within the legal field and youth work. Book an appointment or attend a drop-in Go to our careers events Search for vacancies and internships In addition to your subject knowledge your criminology degree equips you with key skills valued by employers: If you choose the Q-Step programme, you will also develop excellent quantitative analysis and research skills. Criminology graduates enter a wide-range of professions. While some of those professions are directly related to criminology, many are not. For roles related to your degree you might consider a career working with offenders, victims of crime, for an organisation involved in the prevention of crime or as part of the criminal justice system. The types of roles that exist include within those career areas include: However, criminology graduates also go into a wide variety of other jobs where a criminology degree would be useful. Some of the organisations who recruit to these roles include: Graduates with a criminology degree can access a wide variety of graduate schemes from general management schemes to finance schemes depending on work experience and interest areas. There are also graduate schemes for the: Previous graduates have gone on to work for organisations such as Ministry of Justice, British Gas, and Nottinghamshire County Council. However, some graduates will go into careers unrelated to criminology including teaching, civil service, law, finance, journalism and many more. To explore different career areas take a look at our Career paths pages. Career paths - Explore graduate careers Prospects - What can I do with a criminology degree You may wish to pursue further study at the end of your degree, there are several options from Nottingham: Other courses available include forensic linguistics, legal-related courses and criminal justice. There are many ways that you can develop your skills to support job and course applications in the future. Gaining experience in one of the companies listed above or speaking to someone in one of the roles could help you form ideas and opinions about where you future lies. Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Faculty of Social Sciences - Placements Programme Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates Nottingham Internship Scheme Clinks Police UK - volunteering in policing Prison Reform Trust Local volunteering opportunities include: Catch 22 Framework NACRO Nottingham Community Housing Association Nottingham Community and Voluntary Service The Nottingham Advantage Award offers interesting extracurricular modules to develop your employability. With over more than 300 modules across our three campus in the UK, China and Malaysia. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. For example: Sova – mentoring ex-offenders Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Students in Classrooms Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. British Society of Criminology Careers at the Crown Prosecution Service (CPS) Civil Service Job - search for departments linked to the Criminal Justice System telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}