{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/psychology/index.aspx",
    "content": [
        {
            "p": "As a psychology graduate you will be equipped with a range of subject-specific and transferable skills that are highly valued by employers, enabling you to enter a wide range of careers. Nationally the most common sectors for psychology graduates to be in 15 months after graduation is childcare health and education (24.1%), which includes psychology-related professions within healthcare and education Source: HECSU – What do Graduates do 2023 The psychology degree at Nottingham is accredited by the British Psychological Society and you will need this accreditation to work in professional psychology. In addition to your subject specific knowledge, your psychology degree will equip you with a range of transferable skills including: Due to the range of career options and sectors open to you, it is important to consider your options early on in your course and look for opportunities to gain relevant experience and skills. As well as improving your CV, gaining experience can also help you to make choices about your future career. Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when The School offers research internships over the summer. We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates Nottingham Internship Scheme There are lots of opportunities to volunteer locally through the Students' Union's Student Volunteer Centre and volunteering centres in the city and beyond. Where to look for volunteer opportunities Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs. There a number of modules specifically for you including Psychology Internships, Engaging the Public With Psychology and Career Skills for Psychology Students. Nottingham Advantage Award Get involved in a society or sports club whether you are a team member, treasurer or marketing officer, you'll gain valuable skills and experiences that employers will love! Students' Union There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Students in Classrooms We advertise part-time, casual and temporary jobs on campus and with local businesses. Created just for you, the advertised vacancies can fit around your studies and other commitments. The vacancies are advertised in two places. On-campus jobs Off-campus jobs All psychology students have the opportunity of taking an optional placement year as part of their studies. It will be your responsibility to find and apply for a placement but there is lots of support available from us both in terms of internet resources, group workshops and one-to-one appointments. A psychology-related placement could mean many different things. Have a think about: Business-based placements should normally be paid and could include things like human resources, marketing or consultancy. You are able to apply for any type of placement – there does not have to be a direct link with your academic study area. It is a good idea to choose a placement in a sector that you might decide to work in after graduation although any year-long work placements should improve your employability. Search vacancies on MyCareer targetjobs RateMyPlacement It is more difficult to find one website which houses all psychology related placements. You may need to contact organisations speculatively and some of these opportunities may be unpaid. It could be worth looking for placement roles within organisations such as: Centre for Brain and Cognitive Development - Birkbeck, University of London CAMHS Nottingham City Cornwall Partnership NHS Foundation Trust Great Ormond Street Hospital Trust Health Education England - work experience in the East Midlands Outcomes First Group Surrey and Borders Partnership NHS Foundation Trust Sussex Partnership NHS Foundation Trust Trent PTS United Lincolnshire Hospitals NHS Trust University Hospitals of Derby and Burton NHS Foundation Trust Psychology graduates enter a diverse range of occupations and further study. About 20% of UK psychology graduates become chartered psychologists progressing in fields such as clinical, forensic, educational and occupational psychology. Take a look at the BPS website to find out more about career options in professional psychology. If you are interested in a professional psychology career it is really important to gain substantial paid or voluntary work experience with the client group you are interested in working with. Professional psychology career stories from UoN alumni stories The case studies are, in the main, from Nottingham alumni working in clinical, educational, forensic, health, occupational and, sports and exercise psychology Psychology graduates often use their skills to help others within roles such as community work, counselling and advice work, mental health work, research or teaching. As an alternative to clinical psychology graduates could also investigate careers such as Psychological Well-being Practitioner or High Intensity Therapist. Both of these roles are based within NHS IAPT (Improving Access to Psychological Therapy) services. Read UoN alumni stories about using psychology in careers helping others These career stories include: Some graduates progress to more business related jobs such as marketing, PR and advertising, human resources (HR), consultancy, finance and retail management. Also see the next section on careers in HR and marketing for top advice. Read our UoN alumni about using psychology in business-related careers Some psychology graduates wish to continue researching into the field of psychology. This could involve studying at PhD level or undertaking a research assistant position. A masters level qualification may be useful for this type of work. Read our case studies from two UoN PhD researchers The British Psychological Association Careers in Psychology Job vacancies across a range of sectors Prospects - what can I do with my degree? Using your knowledge and understanding HR departments are generally responsible for developing and implementing policies to ensure staff are used effectively within an organisation. This covers a diverse range of areas, including employment conditions, recruitment, pay, training, working practices, and equality and diversity. A psychology degree involving intensive study of how and why people think and act the way they do is often seen as an excellent course of preparation for working in HR. For example, understanding the theory and concepts behind reward and motivation can inform how staff incentive programmes are developed to encourage productivity and staff retention, as well as informing the development of staff wellbeing policies. As another example, understanding how assessments can be used effectively in testing and interviewing candidates, or measuring employee engagement and satisfaction, can draw upon skills from your psychology degree. Using your skills Employers will expect students with a psychology degree to be effective listeners, approachable and detail-orientated while possessing excellent written and verbal communication, data handling and problem-solving skills. All these skills will be useful for a career in HR as you will be working with people, sometimes during potentially sensitive situations where staff will speak to you confidentially about issues that affect them. You will need to ensure policies and activities are followed exactly and records are updated as well as dealing with data and sensitive information (such as attendance records and pay details) requiring effective data handling skills developed during your degree. Occupational psychologist You may also be interested in working as an occupational psychologist. This role entails looking at how people behave at work, and, depending on the needs of the organisation, can cover broad areas such as counselling, personal development, designing work environments, selecting candidates and employee training and motivation. To work as an occupational psychologist you will need a British Psychology Society (BPS) accredited masters course such as the University's MSc Occupational Psychology. Find out more about a career in HR Marketing essentially involves understanding people’s needs and wants to create marketing campaigns that show how a product or service meets these. Marketing is a common career path for psychology graduates who want to use the skills developed on their degree in a non-clinical setting. For instance, an understanding of cognitive psychology concepts such as cognitive biases and how people might not trust something ‘new’ and ‘untested’ could be useful when looking to market a new product or service. Principles of social psychology are also commonly used by marketers, such as to create marketing campaigns that encourage potential customers to gradually change their behaviour and become paying customers. In addition, researching and understanding human behaviour is very relevant to being a market researcher, and can be useful in considering and anticipating customer needs in other marketing roles, such as creating plans to engage with a particular audience. Employers are looking for people who have excellent communication skills and creative problem-solving skills, which you will develop during your studies. Find out more about a career in marketing Six UoN psychology graduates shared their career paths. They highlighted how they got into their current roles and shared insights about navigating careers in a range of sectors. Login to SharePoint to watch the webinar Here are some examples of the graduate employment destinations. The most common sector destinations for UoN psychology graduates are healthcare, social care and education. Every year up to 30-40% of psychology graduates choose to build on their undergraduate study by undertaking a psychology related taught masters course. Graduates have successful achieved places on courses including: Psychology MSc courses at the University of Nottingham are offered within the School of Psychology and the Division of Psychiatry and Applied Psychology in the School of Medicine. Most students who wish to progress to a PhD will have studied at postgraduate taught level. Other students opt to take a postgraduate qualification which will allow them to pursue a particular career interest, such as teaching. For careers in professional psychology a specific doctorate-level qualification is often a requirement. These doctorate courses offer a combination of academic teaching and service based learning alongside research. Entry is extremely competitive and students should gain as much relevant experience as possible before applying. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}