{
    "url": "https://www.nottingham.ac.uk/careers/alumni/changing.aspx",
    "content": [
        {
            "p": "It can be tricky to know when and how to make a move, and considering a job change can throw up lots of practical and emotional questions. Research and soul searching is likely to be required. Give yourself time to do that and reach out for support and guidance as necessary. There are all sorts of reasons why you might want to make a change. Reflecting on your reasoning can help to bring clarity. Perhaps you're very skilled at your job and you would like a new challenge with fresh opportunities to learn and develop. If this is the case, making a change might help, but before you rush to apply elsewhere it might be worth checking in with your manager. They may be able to offer you different responsibilities or stretching projects. I made my career move two years into my graduate role. I’d reached a stage where I wasn’t motivated by the role anymore as I was finding it boring and repetitive. I felt like I wasn’t learning or developing anymore. My pay hadn’t increased greatly since I started and I wanted a new challenge with a step up into a manager role. I came across a manager level role on LinkedIn by chance which was in my hometown and could provide me with the things I was missing in my current role: more challenging work, responsibility, variety and a shorter commute. If I hadn’t found a job that ticked all my boxes then I wouldn’t have moved. The move turned out to be the best decision for me and it has allowed me to grow and develop. Laura Ascione, UoN alumnus, MSc Marketing, 2017 Perhaps you feel that your job has failed to meet your expectations or you’ve realised that you want to pursue an alternative career. If so, don’t worry, it’s not uncommon for people to try a few things before feeling settled. Rather than focus on any feelings of disappointment try to frame this positively by reflecting on what you’ve learned about yourself and the world of work and how this might guide future decision-making. Being approached by a prospective employer shows that your talent and expertise has been noticed and is in demand. This puts you in a strong position and gives you choices. The new job offer might well turn out to be a smart move but be sure to weigh things up carefully before you make the leap, especially if this has come out the blue and you were otherwise happy with your current role. Perhaps there’s been an incident or you’re finding things particularly challenging. This can be very unsettling and it might feel tempting to abandon ship immediately, but before you do, try to take a step back and give yourself some time and space to reflect on any issues objectively. Moving on might be the best thing to do, but don’t rush that decision. My first job lasted just under a year. It was quite exceptional circumstances and hopefully not a situation many graduates will find themselves in. I knew it was my time to leave the company as I wasn't enjoying my job anymore, the atmosphere in the office was very turbulent and I was not comfortable with how I was spoken to by the office manager and the managing director. Ideally, I wanted my first job to have longevity, but it's all a learning curve, and ultimately job satisfaction and your overall mental health needs to take priority. While your career is important it is only one aspect of your life. Sometimes changes elsewhere in your world have an impact on your job. This might come down to practicalities, like needing more time for other commitments, balancing your finances, or a change of location, or it might be that your perspective and values have shifted. Whatever the situation, taking time to work through the pros and cons of any potential changes is wise. Being made redundant can be stressful and upsetting. Although it can feel very personal, try to keep in mind that redundancy is about an employer's need to reduce or restructure their workforce. When faced with this situation it might be helpful to make a list of things you need to arrange of consider. This might include financial and legal considerations, seeking emotional support, and exploring your next career move. Once you’ve reflected on your reasons for wanting to make a change it’s time to start exploring alternatives. As I approach the end of my graduate scheme, I am now thinking about next roles. I am currently keeping my options open but hoping to go into a project-based role as that's what I have enjoyed the most. If you are interested in something, drop an email to someone who currently works in the role and see if you can meet them for coffee to find out more. Associated British Foods grocery is made up of lots of decentralised businesses so I have tried to reach out to people in different businesses to find out what they are up to. Networking at events and building relationships with graduates in other businesses has helped me to do this. Paramvir Dhanda, Uon alumna, MEng Chemical Engineering, 2017 Careers - use our Choosing your career webpages to generate alternative career ideas Careers - explore our career paths pages to research careers telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}