{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/agriculture.aspx",
    "content": [
        {
            "p": "Agriculture in the United Kingdom uses 71% of the country's land area and employs 467,000 people on commercial holdings. The agri-food sector in the United Kingdom accounts for a total estimated Gross Value Added (GVA) of £115 billion, according to the UK Government report: Agriculture in the United Kingdom 2021 Within the agriculture sector there are a huge range of opportunities for graduates of all degree disciplines to contribute from farm to fork. Other life science sub-sectors you may wish to explore further are: Those working in the agricultural sector are constantly navigating a changing environment. Just a few examples of key topics affecting the sector are: The Transforming food production challenge is providing up to £90 million of funding to help businesses, researchers and industry to transform food production, meet the growing demand and move towards net zero emissions by 2040. Find out more about some of the projects that have already received funding to give you a sense of the possible future of the industry. The Agriculture and Horticulture Development Board's (AHDB) strategy enables British farmers, growers and their supply chains to succeed in a rapidly-changing world by: Given these three points alone, there are a range of opportunities within the sector for graduates from all degree disciplines. Depending on which degree pathway you are following you will be developing a range of valuable skills such as: You will also develop 12 competencies which have been divided into these four headings: Explore the Biosciences Core Graduate Competencies Employers often seek a range of transferable skills, such as communication, problem-solving, and teamwork, in addition to the subject-specific skills and knowledge you will gain during your degree. Below are some ideas of how to develop these transferable skills during your degree; make sure you look at the ‘What can I do?’ pages for even more ideas. Contacting the University Farm managers or staff is a great way to build on your hands-on farming experience right here on Sutton Bonington campus. Hands-on experience is useful for any role in the agricultural industry. You could also think about harvest or lambing positions during university vacations. The University Farm website Lambing work experience 4xtrahands recruitment agency Farmer’s Weekly jobs Why not take an optional industry placement, between years two and three of your degree? This will extend your degree to a four-year programme. Year in Industry Summer internships are also a great way to gain experience, whether in science or non-science based roles. Search for roles: Farmer's Weekly Jobs MyCareer - internships from companies targeting Nottingham students Nottingham Internship Scheme Approach companies for work experience opportunities. Several agronomy companies have said they’re happy for Nottingham students to approach them and arrange to shadow one of their agronomists for a day or two. As well as giving you an insight into the role, this would be a great addition to your CV. If you’re interested in the scientific side of your degree, summer research placements might be a good option for you. You can find these through the School of Biosciences by approaching a relevant academic who is working in the area you are interested in. There are also sponsored opportunities and funding for summer research placements, visit: Royal Society of Biology - undergraduate studentships The Henry Plumb Foundation NFU - for contacts within the industry Involvement in relevant SU activities including volunteering, sports clubs and societies can help you to develop and enhance skills that employers look for such as working in multidisciplinary teams, communicating scientific information to a non-science audience and consulting with local businesses. SBAgrics Full list of the Students' Union's student societies Volunteering The Nottingham Advantage Award offers a range of modules to help you expand, develop and evidence your skills and experience during your time at university. With over more than 200 modules across our three campus in the UK, China and Malaysia, there's something for everyone. If you’re thinking of moving into consultancy after graduation, the Nottingham Consultancy Challenge module will help you develop and demonstrate all the right skills. Nottingham Advantage Award - find out more and explore the modules on offer Knowing about the latest developments is important for a couple of reasons: firstly it may spark off your interest in a particular part of the sector and secondly, employers often ask questions about the factors that may be affecting their company at an interview as a way of gauging your interest in their business. Try the following resources - check out any events or directories of employers too. NFU - free membership for students British Society of Animal Science Agricultural Economics Society Institute of Agricultural Management Agricultural sciences and business management students move into a wide range of different careers after graduation, including farm management, consultancy, agronomy and farm trading, agricultural policy, academia, marketing and communications, starting a new business and various roles in the food industry. Some of the employers who have recruited our graduates Some of the roles secured by our graduates Read Peter Cox's (agriculture alumnus) blog post on becoming an agricultural business consultant. Each year a number of agriculture graduates start postgraduate courses either at Nottingham or at other universities. Some examples of the types of courses Nottingham graduates study include MSc Agri-Food, PhD Crop Science, PhD Sustainable Soil Management and accountancy training courses. Search for further courses and find out about funding In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar Agri-food careers Animal health and welfare careers Biotechnology careers Environmental careers Scientific careers Science careers beyond the lab Farmers Weekly – a guide to careers in agriculture Prospects - what can I do with my degree School of Biosciences Alumni LinkedIn Group telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}