{
    "url": "https://www.nottingham.edu.my/Careers/Students/Careers-Events-Workshops.aspx",
    "content": [
        {
            "p": "We support a wide range of organisations keen to recruit you and promote their graduate careers by arranging information sessions around the following types of activities: Career Talks & Workshops - Workshops by experienced career advisers and employers are held throughout the year with topics covered, among others, are Interview Skills, Job Search Strategies, Effective Resume Writing, Online Job Application and Build Your Online Presence. Sector-focused Careers Day - A networking prospect for you to reflect on the experiences of real industry experts who have demonstrated leadership aptness. Currently, we have the sector-focused careers day called as Spotlight, formerly known as Discovering Careers which we covered Discovering Careers in Engineering, Financial Services, Health Sciences, Environmental Science, Politics, History & International Relations (PHIR), and Media and Communication. Careers Fair - The careers fair is held annually in March with over 2,000 attendees that comprises students and graduates. It takes place in our Great Hall and presents a chance for local, national and international organisations to attract our students from diverse disciplines and highlight the graduate and internship schemes on offer. Field trips - A great way to learn about the inner workings of a professional business. Our students have visited Ernst & Young, Dell, BDO, Deloitte, Shell, Citibank, KPMG and Accenture where they had the opportunity to tour the office building and engaged with top recruiters directly. International Students Career Series - A series of highly interactive workshops to provide both local and international students with the tools and confidence needed to develop their careers abroad. The sessions will discuss the reality and expectations when embarking on a global job search, the career implications after studying abroad and tips on cross-cultural networking. Employer recruitment presentations - A one to two-hour on-campus presentation by employers to give you an understanding of the company overview, career opportunities and the application process. Past presenters include Crystal Group, Experian, KPMG, Huawei, Mondelez, OCBC, Nestle, PricewaterhouseCoopers, and Top Glove. We have also run a range of work arrangements in different formats and on a variety of topics, bringing top employers together with UNM students from diverse backgrounds. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}