{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/psychology/case-studies1.aspx",
    "content": [
        {
            "p": "Our Nottingham alumni give an insight into their work in professional psychology and offer advice on getting into their career area. *All details correct for individuals at the time of their interview. Return to the professional psychology page Psychology case studies part two Psychology case studies part three I am a clinical psychologist currently based in forensic inpatient services. I work across a secure male personality disorder service, providing input into several wards that are designed for assessment, treatment, high dependency, and pre-discharge. One of the great things about my role is the variety it brings; I have a caseload of patients I see on a one-to-one basis, support the running of therapy groups, offer supervision and consultation, attend team meetings, and deliver training to staff. My primary role is to assess, understand, and reduce patients’ risk, alongside supporting them with skills to get their needs met in a healthy way, improve relationships, and enhance their mental wellbeing. I initially completed my undergraduate degree in psychology before gaining several years work experience as a support worker, honorary assistant psychologist, and full-time paid assistant psychologist. I did not complete a masters degree, although many do, and this can be advantageous but is not always absolutely necessary. I completed my doctoral training in clinical psychology around four years after I finished my undergraduate degree, which takes three years. This involves a combination of university work, placements, and completing a thesis research project. The doctorate in clinical psychology is currently the only way to qualify as a clinical psychologist in the UK. The first thing I would say is don’t feel immediately put off by all the stories you hear about how competitive it is. It is true that there are many great candidates, but if you are able to put the time and commitment into learning and seeking relevant experience then there is no reason for it to be unachievable. I would advise initially gaining work as a support worker, shadowing psychologists, and reading about key aspects of clinical psychology such as formulation and trauma, and any therapeutic approaches you find interesting. Finally, talk to psychologists and find out as much as you can about the role. Trainee clinical psychologist I am currently in the final year of a Doctorate in Clinical Psychology (DClinPsy) at the University of Nottingham, which is run in conjunction with the University of Lincoln; collectively known as the Trent Clinical Psychology Doctorate. I am employed by the NHS as a trainee clinical psychologist; I work on placement three days a week. I attend teaching at both universities and submit clinical and academic assignments including a doctoral level thesis. I am currently on placement in a Drug and Alcohol team, where I see clients for individual therapy and provide psychological input for staff. Throughout the training I will undertake five placements to ensure that I experience working with different populations including adults, older adults, children and young people, and people with intellectual disabilities. My first degree was BSc Psychology from the University of Liverpool. Following this I worked on a forensic inpatient ward for people with intellectual disabilities as a healthcare assistant. My next role was with a charity, providing group interventions for people who used drugs. From here I got a job in a drug and alcohol team within the NHS. In 2014 I undertook a postgraduate diploma in cognitive and behavioural interventions and worked at the same time as trainee psychological wellbeing practitioner (PWP) within the NHS. I was then a qualified PWP for another year. At this point I changed tack and became a research assistant for University College London working on a project looking into a psychological intervention for people with dementia living in care homes. It’s hard to know what advice to give; some people applying to DClinPsy courses get on straight away, other people apply many times. For me, it was my third application process when I was offered a place. They seem to want applicants to have worked within the NHS and to have some research experience, whether that’s through a masters degree or by working in research. I feel it is important to say that both the application process and subsequent course are quite stressful undertakings, so this is not necessarily an easy career route. But if you are enthusiastic, dedicated and sure this is what you want then it is definitely worth it. I am trainee counselling psychologist at the end of my final year of a Doctorate in Counselling Psychology (DPsych). The programme runs for three years full-time and over the last three years I have had opportunities to apply for various clinical placement within the NHS, my most recent placements being within an eating disorders service and a psychosis recovery service. Within the programme I have had opportunities to choose which clinical placements I would like to gain experience in. I made the choice to work in six different placements throughout the three years, so that I could gain experience of working with different clinical populations and I also obtained over 450 hours of supervised clinical practice. My role as a trainee included engaging in one-to-one psychological interventions with young people, adults, and families, and I also provided consultancy, teaching and supervision to other clinicians and assistant psychologists within the teams I was working in. Generally, I would attend placements three days a week and one full day of teaching in my university. Remaining days in the week would be used for essential reading, completion of course assignments and working on my doctoral thesis. I initially completed my undergraduate degree in psychology and then completed a masters in counselling at the University. I then decided to gain some work experience so that I could figure out the path I wanted to take within the world of psychology. I spent several years employed as a service manager leading a cluster of residential and supported living facilities in and around London. In these services, I worked with my team members to support adults with complex and severe mental health conditions including personality disorders, psychosis, and compound trauma, to work towards their personalised goals and fulfil their aspirations in life. I feel this work experience made me a stronger, more confident and reflective clinician. I also realised that I had a deep passion for psychology and wanted to continue my educational and professional journey through the DPsych Counselling Psychology course. I would strongly encourage you to gain some experience within a mental health establishment before applying for the doctoral programme. It will provide you with an understanding of what to expect in terms of clinical work, risk assessment/management and engaging with a multidisciplinary team of professionals. These are all qualities that I believe will help you feel more confident and ready for your unique journey to becoming a psychologist. I’m really glad that I made the decision to become an educational psychologist (EP). I love helping other people and I love using a range of psychology in order to try and make a difference. My days are always different: sometimes I’m in a nursery watching young children play; sometimes I’m in a meeting discussing how to support a young person; other times I might be assessing their learning skills, or I’ll work with that young person to try and understand their view of the world. EPs are involved in enhancing children’s well-being and achievement. Training to become an EP will start to equip you with psychological knowledge and psychological skills in order to make a real difference and bring about positive change for children. One of the reasons I became an educational psychologist is because I like helping people and because I am interested in people: what they say, what they do and how they think. If any of this sounds interesting, then maybe it could be the career for you. I still remember sitting in a lecture in my final undergraduate year listening to a guest speaker who told us all about her job. She explained how she worked with children and adults to help those children whom others had concerns about. This involved observing, devising interventions, consulting with people, training others and continuous learning. Educational psychologist seemed like a good way to use psychology I thought. While I didn’t decide there and then to train to be an EP, a seed had been sown.A few years later whilst working in an uninspiring job, I remembered the EP who visited that day and thought, why don’t I do that? I decided to leave that job and do a masters degree (not essential in order to train as an EP) but I wanted to prove to myself that I could study again and start the journey to becoming an EP. Having gained experience of working with children in primary and secondary schools, a few years later, on my second attempt, I gained a place at the University of Nottingham on the Doctorate in Applied Educational Psychology - qualifying in 2015. I’m a trainee educational psychologist (TEP), in the final year of my Doctorate in Applied Educational Psychology. The doctorate is a fascinating three-year journey of research, learning and work experience. I'm in a cohort with 12 other TEPs and so far, we’ve learned about a range of topics relevant to child wellbeing, learning and development. We've had the opportunity to apply this knowledge to practice, through various work placements across the three years. The role involves using assessment, intervention, consultation and research to support children, families and organisations to 'unstick' a range of complex situations. It’s incredibly challenging at times, but it’s worth all of the head scratching moments we experience along the way. I graduated with a degree in psychology in 2012. There wasn’t a huge focus on applied or community-based roles in psychology at my university, but this is the kind of work I saw myself doing. So, I took a small break from the world of psychology before learning more about the role of an educational psychologist. The opportunities to work systemically and within communities is what attracted me to the position. Prior to the doctorate, I gathered experiences of: I would advise anyone interested in the career to reach out to trainees and EPs through official routes or using Twitter or LinkedIn. Most people are happy to talk about the role, especially if you approach them with some interesting questions. I think the profession urgently needs to be more diverse, so don’t be intimidated or put off if you don’t feel you will be well represented – the profession, and the children and families that we serve, need(s) you. Finally, find a motivation that works for you, which is broader than just the job itself. This sense of purpose will keep you motivated when the recruitment process, or doctorate becomes challenging (both of these things are likely to happen!). telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}