{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/library-and-information-management.aspx",
    "content": [
        {
            "p": "Library and information management professionals are responsible for managing, organising and making available information, from digital resources and media to the more traditional management of books, periodicals and audio and video recordings. The usual route into the sector is through a postgraduate qualification. If you have questions about your plans, talk to a member of our team. Librarians and information management professionals work in every kind of organisation, from schools, colleges and universities, local authorities, central government and public agencies through to professional membership bodies, charities, prisons, healthcare organisations and a huge range of commercial organisations including banks, law firms and pharmaceutical companies. Roles can vary from organisation to organisation, but the most common library and information management job titles are: The variations may reflect the size, culture, and history of the organisation. Job titles may also be determined by who the head of the library or information management reports to (the head of IT, HR, finance). You can find out more about the various job roles on The Library and Information Association (CILIP) website. Effective librarians and information professionals must be adaptable, adjusting their skills to support different parts of the organisation, build key relationships to meet a range of customer and stakeholder requirements. Employers tend to look for transferable skills. Communication and interpersonal skills are essential for just about every job in the information profession. Other key skills include; Here are a few ways you can gain some work experience. What are the entry routes? Library and information-specific qualifications are not essential to start your career, but formal qualifications will enhance your employability. Some roles, such as a museum or gallery curator may require specialist knowledge, a post graduate qualification and extensive experience. For other roles you may require specific qualifications e.g. for finance, legal, indexing or database production. Positions in Information Management may require a technical qualification. The main entry routes to professional accreditation are; Postgraduate qualification. Institutions can be found either on the CILIP or UCAS websites. If you are under 25 years old, it is possible to get your first job through the government’s apprenticeship scheme. Details can be found either on the CILIP website or the IFATE website. Some roles, such as a museum or gallery curator may require specialist knowledge, a postgraduate qualification and extensive experience. For other roles you may require specific qualifications e.g. for finance, legal, indexing or database production. Positions in information management may require a technical qualification. Here are two options: Archives & Records Association (ARA) – a list of career FAQs for careers in archives and records British and Irish Association of Law Librarians – professional association includes job vacancies and careers advice Chartered Institute of Library and Information Professionals (CILIP) – includes a careers section covering how to start your career, job profiles, salary guides and professional registration. Civil Service - Working in Knowledge and Information Management - advice on knowledge and information management (K&IM) Government Communications Head Quarters (GCHQ) – recruits information specialists. Their website has details about career and job opportunities Information and Records Management Society (IRMS) – professional association includes a job vacancies section The International Association of Music Libraries, Archives and Documentation Centres (IAML) – no careers section but has useful information for networking and understanding current issues Oxford Libraries Graduate Trainees – a blog that serves as a resource for current and prospective graduate library trainees at the Bodleian Libraries, University of Oxford New Library Professionals Network - offers advice when pursuing a professional qualification and regional job shadowing opportunities Prospects - advice on becoming a public librarian, academic librarian and information officer Society of Indexers – includes pages on indexing as a career telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}