{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/risk-management.aspx",
    "content": [
        {
            "p": "Risk management is an essential part of many other business activities – primarily insurance, banking and the finance industry, but also construction/infrastructure, energy, healthcare and IT. Risk managers minimise organisational vulnerability to financial, reputational or existential threats whilst ensuring compliance within legal and regulatory frameworks. To achieve this they evaluate, plan and implement strategies to avoid, reduce or transfer risks. If you have questions about your plans, talk to a member of our team. There is considerable variation in how risk managers minimise organisational vulnerability and so it is difficult to describe concisely what an individual would do. The risk manager profile from Prospects describes in some depth the role of risk manager, pay, conditions, how to get work experience, exams and career development. For more information, please refer to the professional body for risk managers, the Institute of Risk Management (IRM) which has more details about what the profession does. The IRM site also has information about what training, exams, professional development, and professional standards - IRM describes the framework within which risk managers work. Although there are degrees and postgraduate conversion degrees in risk management, students can enter the field with a wide variety of numerate degrees. Note also there is considerable transfer into the profession from mature applicants, especially those with significant risk analyst/underwriting experience. The sector is likely to become more automated, but it is very unlikely that the role of risk management would ever become solely performed by AI, because AI itself may not recognise what would cause reputational, financial or existential threat for a very long time due to their complex and unexpected natures. Risk management 2025 and beyond and Future of risk describe the need to evolve, but are generally positive about opportunities for the future in risk management. Gain as much work experience as you can including customer facing roles At the start of your second year, look for summer internships on MyCareer, student job boards or individual insurance company sites, as these are often a pipeline into graduate schemes. At the start of your final year, look for graduate training schemes. You will need to start applying for these in the autumn term of your second year. Attend the Management, Finance and Consulting Fair (held annually in October) Sign up and attend employer workshops and presentations Join NEFS (Nottingham Economics and Finance Society) and attend networking events Try online work experience such as Forage Practice psychometric tests as much as you can and contact the careers service to make an appointment with a careers adviser to perfect CVs, application forms and interviews. These all take practice, people often fail first time around. AIRMIC - professional body – The Association of Insurance and Risk Management ALARM - membership organisation for risk managers CII - Chartered Insurance institute - includes some risk management roles in insurance eFinancialCareers - jobs and information about finance careers The Institute of Risk Management (IRM) - leading international professional body for the field with a dedicated careers section. Risk managers help make decisions for the financing and control of risks for a specific group, company or organisation Prospects - graduate career information and vacancies TARGETjobs - graduate career information and vacancies The Year in Industry Scheme (YINI) - offers placements in business including finance telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}