{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/music-industry.aspx",
    "content": [
        {
            "p": "The 'music industry' is a term used to describe all the elements that contribute to the creation, performance, recording, and promotion of music, as well as the management of the business of music production. A wide range of roles are available. For some roles, the ability to perform music is essential. Other roles may benefit from the ability to perform music, or musical knowledge, without performance being the principal activity of the role. Many other roles are open to students who may not perform music, and are from all subject areas, but with a passion for the music industry. Other types of role, with a connection to music exist both inside and outside of the music industry, for example music teaching, or music journalism. Return to the A to Z jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment Creative and performing roles include musician, singer/songwriter, composer etc. As a performer or composer you are most likely to be self-employed as a freelance artist, or you may find work as a full or part-time member of a band, orchestra or ensemble. Other opportunities include joining the Armed Forces as a musician, or in industries which require original music, for example, gaming. A portfolio career consisting of gigs, freelance work and part-time work is not uncommon for those wishing to work in creative and performing roles. Naturally, for performance/creative roles you will require the ability to perform music and understand music theory, and as a freelance artist you will also benefit from business skills to manage your own business. Music performance also requires a range of underpinning roles such as sound technician, lighting and staging, and recording engineer, amongst many others. You may be employed at a live events venue, or in a studio, but freelance work is becoming more common. These roles require specific technical skills with a relevant degree, and work experience is highly valuable due to the competitive nature of these roles. An industry as large and diverse as the music sector requires a range of people to support it. Opportunities are available in management (for example, A&R manager, tour or event manager, agent, producer, charitable development manager), sales and marketing, public relations (PR), accounts and finance, law and contracts, and data management. Large corporations account for much of the music industry’s recording and publishing, such as Warner, Universal Music Group and Sony, with some smaller, independent labels. In addition, music streaming companies such as Spotify and Amazon Music recruit a range of business and commercial roles. Graduate schemes are available with larger corporations. Those seeking roles in the ‘business’ side of the music industry may require specific skills or qualifications, for example in legal or finance roles, while other roles are open to students from all degree disciplines. Demonstrating your commercial awareness and understanding of the music industry will also be an important part of any application. There are a range of roles where your music skills and knowledge will be required, or, if not essential, could contribute to your success in the role, for example opportunities such as teaching, music therapy, and music journalism. As a music teacher you will typically be a salaried member of teaching staff in an educational institution or be self-employed as a music tutor. Similarly, as a journalist you could be employed by a specific publication or be a freelance writer. Music therapy involves using music to help clients from all age groups address challenges or difficulties. You may be employed by the NHS or other healthcare providers, local authorities, or schools, and self-employment is common. Some roles, such as teaching or therapy will require additional training and qualifications, and work experience is essential for roles in journalism. Your motivation and enthusiasm for working in teaching, healthcare and journalism will also be an important attribute sought by potential employers. Careers in Music – career categories across the music business Composer jobs - explore jobs in composing, audio, music admin and more Discover Creative Careers – explore a directory of roles in the creative industries Music Business Worldwide jobs board – worldwide job vacancies Musicians’ Union – advice and information on securing paid work as a professional musician Prospects - Careers in music – for insight into careers in the industry UK Music Careers – providing music-sector endorsed information about the broad range of careers available UK Music – Mentoring in Music Guide telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}