{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/first-weeks/reflecting.aspx",
    "content": [
        {
            "p": "Hands up if starting an internship, placement or graduate role has felt a little bit like a roller coaster? Perhaps it’s time to take a minute to just breathe? And if you can summon the energy, reflect a little on where you are now and how much you've learned and achieved already. A good place to start is by simply noting down what has happened since you started your job. You might write a list of key milestones or adopt a fact-gathering ‘who, what, where, when’ approach. This activity alone may help you to realise the distance you’ve travelled. Once you’ve got a basic timeline of events, you can begin to layer on how you felt about each step. Reflecting on your emotions can help you to identify highs and lows and consider what has motivated you along the way. Explore both the ‘hot’ emotions that you felt immediately after an event, and the ‘cold’ emotions you experience in the days after when you had slept on things and were able to apply a more rational perspective. Next, you can begin to analyse your experiences in a little more detail and adopt a curious and questioning approach. Maybe you will spot patterns emerging in your experience or simply begin to appreciate the quirks and complexities of your professional life. Either way, in contemplating some of these questions, you will hopefully generate a series of learning points and in turn, this may help you to build both self-awareness and a deeper understanding of the workplace. Crucially, it is what you do next that matters. How will you now put all that you have learned into action? You might decide to set yourself some objectives linked to your learning, perhaps around specific training or development needs that you identify. Talking to your manager, your mentor, or a close colleague can help you to explore options and ideas to shape and define your goals. Or, if you’re returning to your studies after an internship or placement, talk to your personal tutor or placement contact about how you can put the new insight and skills you’ve acquired in the workplace to good use when you’re back at university. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}