{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/finding-work-abroad/international-careers-webinars.aspx",
    "content": [
        {
            "p": "Are you an international student considering your next steps after graduating? In collaboration with the University of Birmingham and the University of Warwick we are delivering a series of events to help you enter the global job market. Take part in webinars and listen to podcasts from international employers, alumni and careers staff. In addition to this, you will also be able to access bite sized videos with some of our top tips to support your international job search, with a specific emphasis on securing a role during challenging times. Register for webinars on MyCareer using the event links below If you have any questions, email the NUBS Postgraduate Careers Team BusinessPCS@nottingham.ac.uk The following videos are aimed at helping you in your applications and job searches. CVs part 1: Chinese CV conventions CVs part 2: Format and layout CVs part 3: Content - skills and impact Effective online networking Researching employers Do you aspire to work within the fast-moving consumer goods (FMCG) sector in China? In this webinar, we heard from some recent UK alumni, who are now working in China in this sector. Including a marketing manager at GSK and digital marketing and ecommerce specialist at Unilever. Alumni Webinar: Careers in FMCG Do you want to better understand what it is like to work for an internet firm in China? In this webinar, we were joined by University of Nottingham alum, Gianluca Fracasso, digital creative at Alibaba Group and a University of Warwick alum working as a management and strategy consultant at Bytedance. Alumni Webinar: Careers in Internet Firms Hear from professionals in this field about their experiences and how you can pursue a career in IT and Business Hear from some recent UK educated alumni, who are now working in China for some of the top consulting firms, including EY-Parthenon and Finastra. This session will give you the chance to learn more about their roles, what it’s like working in the consulting industry in China, how they entered the profession and their top tips for recent graduates. Do you want to better understand what it is like to work for an internet firm in China? In this webinar, we were joined by University of Nottingham alum, Daisy Peak, Global Organisational Culture and Employer Branding at Bytedance, a University of Warwick and University of Birmingham alum working as a Recruiting Manager at Tencent Games and a Senior Brand Manager at Tencent. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}