{
    "url": "https://www.nottingham.ac.uk/careers/postgraduate-researchers/applying/cover-letters.aspx",
    "content": [
        {
            "p": "Most employers will require a cover or covering letter as part of your application. It is typically sent alongside your CV. Your cover letter should complement and build on the content in your CV, rather than simply repeating the same content in more detail. This page provides all the information you'll need to build a strong cover letter ready for your next application. Your cover letter is an opportunity to expand on your experiences and skills beyond what you can include in a CV, as well as conveying your personal motivations and suitability for working in the role you're applying for. The letter is usually short, not exceeding one A4 page, although this can be two pages if applying for some academic jobs. It is typically expected that cover letters will be written in a business-style format, however some employers will specify an alternative format such as a supporting statement or similar. Make sure you have checked all requirements before getting started. Your tone should be professional, clear and a true reflection of you. Make sure you check your grammar and spelling, and ask a colleague or careers adviser to provide you with feedback before you apply. It's important to be concise, otherwise you risk losing the employer's attention. It's widely advised to use a clear font such as Calibri, with a font size of 11 or 12. You should use the same font for both your CV and your cover letter, to make sure your application looks professional and consistent. It's important to be clear about your motivations and suitability for the role, and avoid being vague or using clichés. Your skills and abilities are unique to you, so your cover letter needs to reflect this. Consider your cover letter to be the equivalent of an 'elevator pitch' where you have a short amount of time to explain why they should hire you. You should use your cover letter to demonstrate how your personal motivations and career values align with the role and the employer, and be specific about the reasons you are a good match. If there's something in particular about the employer values or activities that you resonate with, make it clear in your application. This will demonstrate to the employer that you have taken the time to understand the role, and that you haven't just sent the same application to multiple companies. When you've finished your CV and cover letter, you are usually required to send your application by email. Ensure that you have saved each file as a PDF document so that the formatting won't change when the employer opens the files. The job advert should provide an email address to submit your application to. You should address your email to that person, write a very concise email stating that you have attached your CV and cover letter for consideration for the advertised job vacancy. If the job advert provides a job reference number, include this in the email so that the employer can easily locate your application. If this has not been provided, use the title of the role instead. The purpose of a cover letter is to briefly introduce yourself and express your motivation and suitability for the role in three or four short paragraphs. It is therefore important to make sure you carefully consider the information you include in each paragraph striking the right balance between being concise and being thorough. Consider the guidance in this section to help you decide what to write about in each paragraph. At the start of the letter, include your personal contact details and include the date, in the same way you might start a business letter. If you have the employer's name and contact details, you should address them at the beginning of the letter. If you have not been provided with the name of the contact information or if the application is speculative, you can use LinkedIn or the company's website to find a suitable addressee. This could be the head of the department you are applying to, or the head of human resources. If you have the job reference number, it can be good practice to include this at the beginning of the letter so that it reaches the right person within the organisation more quickly. Begin the letter with a polite introduction to yourself and the purpose of the letter. You should be clear about the role you are making an application for, and if appropriate, let them know where you found the role advertised, for example, on their website or a job vacancy listing website. This paragraph is where you should describe the reasons why you are a suitable candidate for the job. Try not to duplicate the information you've included in your CV but expand on the key skills, experiences or activities in more detail. It's important to make sure that you choose examples which align with the requirements of the role, to demonstrate that you have a relevant skillset, even if these examples are not from your most recent experience. It is within this paragraph that you demonstrate to the employer the ways in which you would be an asset to their team rather than explaining what attracts you to the role. You should use this paragraph to explain what attracts you to the company or organisation that you are applying to. It's important that you take the time to research the company or organisation and understand their core values, their main competitors, their most recent projects, their position in the market, and so on. You should be so specific that the application would not make sense if it was sent to a similar company, otherwise they might assume that you have been vague due to a lack of research. If you're not sure where to find information about them, start by looking through their website, as well as exploring their social media presence and checking if they've been in the news. Find out more about researching a company or organisation. In this paragraph you will need to concisely summarise the above information and emphasise your suitability to the role and the employer. Complete the letter by thanking the employer for considering your application, and mentioning that you look forward from hearing back from them. Avoid clichés, and keep this section concise. Much of the advice for cover letters is the same regardless of the role you're applying for, but there are a few differences if you're applying for an academic job rather than a role outside academia. Academic cover letters are usually allowed to be longer than for those outside academia. You should always check the application requirements on the job advert in case they've set their own requirements, but it is standard to require two sides of A4 for academic jobs. For academic job applications, it's usually more important to focus on what you have to offer the institution you're applying to, rather than what you would like to gain from working there. You should still describe what draws you to the institution or department, but there should be a greater emphasis on your skillset and what makes you an ideal candidate. When applying to academic jobs, you can be more specific about your research skills than when you're applying to jobs outside academia. If there's a particular methodology or skillset that is required for the role and you have experience with this, make sure to provide detail so that the employer can see that you are a suitable candidate. You should try to mirror the job description in terms of the ratio of teaching to research. For example, if the job description seems to be 50:50 teaching and research, you should aim to have half of your cover letter focusing on teaching and half on research. If the role is heavily focused on research or on research, make sure that the majority of your cover letter mirrors this. Additionally, you will usually be required to submit teaching and research statements as part of your application to an academic job. Read through our advice on teaching and research statements under the section: specific application advice for academic jobs. Most advice on this page applies to both academic and non-academic jobs, but there are a few specific things to keep in mind if you're making an application outside of academia. When writing about your skills it's important to focus on transferable skills rather than going into too much detail about your methodology, or using jargon which is specific to your research area. Unless your role has been advertised to require those specific research techniques, the employer will be more interested in how your skills can be translated to match their requirements. It's important to remember that your postgraduate research degree is a job, and you will have gained experience throughout your research which will be highly valuable to an employer. Make sure you don't downplay your experience and your abilities by viewing it only as a course. For jobs outside academia, the process of researching your employer and explaining why you're interested in working for them is more important than it would be for academic jobs. The employer will want to make sure you understand how their organisation operates within the industry they're in, and what challenges they have faced and the achievements they have made. Find out more about researching the employer and sector thoroughly. If you are considering or are in the process of applying to a job abroad, the format of the covering letter could be different to the above advice. GoinGlobal is an international careers information resource providing advice on applying for jobs including covering letters in 42 countries. UoN students and graduates can access GoinGlobal free of charge by logging into MyCareer Go to GoinGlobal for advice on applying for jobs abroad telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}