{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/vet-public-health.aspx",
    "content": [
        {
            "p": "If you're interested in veterinary public health (VPH), find out about the array of roles available in this varied career area, understand the qualifications needed, how to gain work experience and where to look for job vacancies. Essentially, we have all the information you need about VPH in one place with links to specialist websites to move your career forward. Talk to an adviser about your plans The World Organisation for Animal Health (OIE) officially defines veterinary public health (VPH) It is a component of public health that focuses on the application of veterinary science and that includes all actions directly or indirectly linked with animals, their products and by-products, so long as they contribute to the protection and improvement of the physical, mental and social wellbeing of humans. Veterinary science has a rich history of contributions to public health, especially with regard to the provision of safe and adequate food, the prevention, control and eradication of zoonoses, the improvement of animal welfare and contributing to biomedical research. Public health in general is the science and art of, preventing disease, prolonging life and promoting health through the organised efforts of society. All the activities of the veterinary profession that impact on human health and also the impact of humans on animal health and welfare are just as relevant within the public health sphere. Veterinary public health is an integrated, multidisciplinary, cross-species sector with horizontal and vertical integration of knowledge which encompasses the food safety, zoonoses, animal welfare, comparative medicine, epidemiology and environmental hygiene comprising a ‘One Health’ concept. VPH requires individuals to draw on knowledge from various areas within veterinary medicine such as veterinary anatomy, physiology, microbiology, pathology, parasitology and medicine. This means that no matter what your particular area of interest is, there are VPH roles and opportunities that you could potentially pursue. The interests, skills and qualities needed to work in VPH will vary depending on the area of work that you wish to pursue. Different roles require different competencies for example clinical, research, organisational or analytical skills. VPH is an applied subject and if your interest lies in the application of knowledge gained through the basic courses in veterinary medicine for the ultimate goal of improving human health through food safety, disease control and animal welfare then VPH might be a career path worth researching further. Being a strong communicator and having the flexibility to work in a range of environments including farms and abattoirs and with a range of people from different backgrounds and different nationalities will be important in this industry. If you are interested in working within a global context and collaborating on projects or initiatives within an international environment, you are likely to enjoy the VPH career path. A one world is a reality, and no country is isolated as wildlife, livestock, and diseases do not respect boundaries and therefore countries of the world are inter-dependent. What happens in one country has impacts far beyond its borders, that is ‘a butterfly effect’. If your interest in veterinary public health is at a local, regional, national or global level, there are opportunities available in this career area. Careers in VPH can be categorised into three main job categories: The above description of roles is taken from a drawing by Dr. Sudhakar Bhandare as per discussion from the European Veterinary Food Safety Teachers Meeting, Uppsala, June 2016 There are a range of RCVS-registered and non-registered pathways available within VPH. Roles include: There are many opportunities to gain further qualifications, training or certification but the type of professional development will vary depending on your job role and is often provided through your employer. In order to work as an official veterinarian (OV) there are additional training requirements. You would need to complete the appropriate Official Controls Qualifications (Veterinary) (OCQ(V) training courses and undertake revalidation every four years. These are week-long courses in Bristol or Glasgow provided by the contracting company employing you. To work as a lead auditor further training is usually required from various providers and accredited by International Register of Certificated Auditors (IRCA), London. There are also a number of masters programmes if you’d like to specialise further. With a masters and PhD in VPH, it is easier to navigate the highly specialised research career options and opportunities in academia. There are also a number of masters programmes if you’d like to specialise further. With a masters and PhD in VPH, it is easier to navigate the highly specialised research career options and opportunities in academia. If you are considering continuing your studies, find out more on our pages about further study. You could also decide to specialise in the field and embark on a specialist accreditation through one of the many global residency programmes. There are many personal development courses available to support development in VPH. Take a look at: Career progression opportunities within veterinary public health are dependent on the organisation you are associated with whether it is a private organisation, or a government agency. All the roles mentioned previously in government agencies, food safety and research are available to explore in other countries especially in North America where the Food Safety and Inspection Service (FSIS) as well as the Canadian Food Inspection Agency (CFIA) directly employs veterinarians for VPH activities. This is unlike in the UK where such roles are employed via contractors. The following organisations give preference to the candidates with strong knowledge of VPH for their job roles: There are similar disease control agencies in Australia, New Zealand and throughout the world including the European Centre for Disease Prevention and Control (ECDC). International opportunities are also available in international organisations such as: VPH career opportunities are available as army vets in various countries including US military and the Indian Army. The role of a veterinarian as a technical manager in the food safety divisions of various multinational food companies in also an option when considering working abroad. You may find our working abroad pages helpful and you will need to check the visa requirements for any positions overseas. The university offers a VPH elective which accounts for two weeks EMS in year five for a maximum of six students once a year. Students who are interested in the VPH elective need to select this elective in year three together with the rest of their rotations options. The Animal & Plant Health Agency offers a range of EMS placements within: The British Veterinary Association (BVA) also has a useful article on using EMS to discover how VPH makes a difference. Depending on your area of interest, you can also contact companies directly to request work experience or work shadowing. The Government Veterinary Surgeons has also produced a booklet on getting experience in the food sector. Attend the conferences discussing VPH and food safety, for example: American Public Health Association Animal and Plant Health Agency Government Vets Service blog for the Veterinary Public Health Association MSD Manual - Role of the Veterinarian in Public Health/One Health National Association of State Public Health Veterinarians (NASPHV) Public Health Foundation (PHF) United States Animal Health Association (USAHA) Veterinary Public Health Association (VPHA) telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}