{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/microbiology.aspx",
    "content": [
        {
            "p": "The implications of the study of microbiology are wide ranging, touching all aspects of life on earth from disease control to food manufacture and climate change. Have you thought about how you want to use the skills and knowledge you are developing while studying microbiology after you graduate? Follow the Biosciences Teams site In addition to your subject specific knowledge, your microbiology degree will equip you with a range of transferable skills including: You will also develop 12 competencies which have been divided into these four headings: Explore the Biosciences Core Graduate Competencies Why not take an optional industry placement, between years two and three of your degree? This will extend your degree to a four-year programme. Year in Industry As part of this, it is possible to gain accreditation from the Science Council as a Registered Scientist (RSci). Summer internships are also a great way to gain experience, whether in science or non-science based roles. You can search for roles using the links below, but do also consider making targeted speculation applications to smaller companies who may not advertise all opportunities. My Career - internships from companies targeting Nottingham students Nottingham Internship Scheme Royal Society of Biotechnology - placement opportunities Plant Science Futures summer placements For list of organisations offering work experience or internships in the lab, visit laboratory work If you are interested in the scientific side of your degree, the summer research placements might be a good option for you. You can find these through the School of Biosciences by approaching a relevant academic who is working in the area you are interested in. There are also sponsored opportunities and funding for summer research placements, visit: Royal Society of Biology - undergraduate studentships Wellcome Trust - Biomedical Vacation Scholarships Involvement in relevant SU activities including volunteering, sports clubs and societies can help you to develop and enhance skills that employers look for such as working in multidisciplinary teams, communicating scientific information to a non-science audience and consulting with local businesses. MicroSoc Find societies that interest you Volunteering We advertise part-time, casual and temporary jobs on campus and with local businesses. Created just for you, the advertised vacancies can fit around your studies and other commitments. The vacancies are advertised in two places. On-campus jobs Off-campus jobs Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs You might be particularly interested in the STEM Outreach Scheme. Nottingham Advantage Award - find out more and explore the modules on offer Knowing about the latest developments is important for a couple of reasons: firstly it may spark your interest in a particular part of the sector and secondly, employers often ask questions about the factors that may be affecting their company at an interview as a way of gauging your interest in their business. Applied Microbiology International Microbiology Society Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Microbiology graduates move into a wide range of different careers working in areas such as the food and drink industry, healthcare, the pharmaceutical industry, environmental organisations, research institutions and universities. Some of the employers who have recruited our graduates Food and drink Pharmaceutical Healthcare Some of the roles secured by our graduates Clinical Microbiology Working as clinical or medical microbiologist you are likely to find yourself working in the private and public sector in organisations such as the NHS (recruited through the Science Training Programme), Public Health England, private pathology laboratories such as Spire Healthcare, private hospitals such as those run by Ramsey Health Care UK, and university departments. Depending on the role and organisation, you may be required to have a master's degree or PhD. A large proportion of our microbiology graduates progress into further study. Many choose to build on their undergraduate qualification by undertaking a microbiology-related masters course or PhD. For example our students have gone on to study: Others opt to take a postgraduate qualification which will allow them to pursue a particular career, such as Graduate Entry to Medicine. A number of microbiology graduates undertook a Postgraduate Certificate in Education (PGCE) in science or biology in order to train to become a teacher, a profession for which science students are currently in high demand. Search for courses and find out about funding In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar Agri-food careers Biotechnology careers Environmental careers Healthcare scientist Scientific careers Science careers beyond the lab Microbiology Society - careers pages Applied Microbiology International - for news and events NHS Careers - role of a microbiologist TARGETjobs - clinical microbiologist job description TARGETjobs - microbiologist job description telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}