{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/plantbiology.aspx",
    "content": [
        {
            "p": "Plant biology impacts a wide range of industries from agri-food to pharmaceuticals, but have you thought about how you want to use the skills and knowledge you are developing when you graduate? Depending on which degree pathway you are following you will be developing a range of valuable skills. You will also develop 12 competencies which have been divided into these four headings: Explore the Biosciences Core Graduate Competencies Why not take an optional industry placement, between years two and three of your degree? This will extend your degree to a four-year programme. Year in Industry Summer internships are also a great way to gain experience, whether in science or non-science based roles. You can search for roles using the links below, but do also consider making targeted speculative applications to smaller companies who may not advertise all opportunities. My Career - internships from companies targeting Nottingham students Nottingham Internship Scheme Royal Society of Biology - placement opportunities Plant Science Futures undergraduate summer placements For list of organisations offering work experience or internships in the lab visit: laboratory work Gaining research experience over the summer is particularly valuable if you are considering applying for a PhD after graduation. Summer research placements through the School of Biosciences depend on the research being conducted, but it is worth directly approaching the academic staff working in the area of research that you are interested in. There are also other sponsored opportunities and funding for summer research placements through organisations such as the BBRSC. Royal Society of Biology - undergraduate studentships Plant Health Undergraduate Studentships Wellcome Trust - Biomedical Vacation Scholarships Involvement in relevant SU activities including volunteering, sports clubs and societies can help you to develop and enhance skills that employers look for such as working in multidisciplinary teams, communicating scientific information to a non-science audience and consulting with local businesses. Conservation Society Sustainability Society Find societies that interest you Volunteering Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs If you’re thinking of moving into consultancy after graduation, the Nottingham Consultancy Challenge module will help you develop and demonstrate all the right skills. Nottingham Advantage Award Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Plant biology graduates often go on to work in a wide variety of fields such as research and development, green energy and biofuels, industrial biotechnology, conservation, agriculture, education, and science communication. Here are some examples of the graduate positions our plant science students have taken up: A large proportion of our plant biologists progress into further study. Many graduates choose to build on their undergraduate qualification by undertaking a related master's course or PhD. Search for further courses and find out about funding In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar Agri-food careers Biotechnology careers Environmental careers Scientific careers Science careers beyond the lab Biosciences Careers - advice, links, events and support British Society of Plant Pathology - career profiles Chartered Institute of Horticulture - careers in plant science and technology Plant Science Careers - jobs in plant science telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}