{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/accountancy-audit-and-taxation.aspx",
    "content": [
        {
            "p": "This sector covers many areas, including audit and advisory work, taxation, business consulting, and management accounting. The opportunities are generally open to all degree backgrounds. Those who work in this field usually work towards chartered status or a qualification from one of the sector’s professional bodies. In the UK, there are six accountancy bodies, covering different locations and types of practice. Return to jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment This webinar aims to show you how to enter a career in finance from any degree discipline. Learn how your degree can be valuable in a financial career, whether it is finance-related or not. Our speakers hail from a range of financial careers, and at differing stages, to give a variety of top tips and insight. Login to SharePoint to watch the webinar It depends on the area of work you choose to go into. There are a variety of different roles in this sector, and you should research which ones may be right for you. Bright Network provide a good overview of the different areas and things you should consider before making applications. The Financial Reporting Council provides links to each professional body. Below we have outlined some roles that are of interest to Nottingham students with links to further information: Accountancy Hear from representatives from CIMA, ICAEW, ACCA about: what they do the differences between them how they can help with your career paths. Read Jonathan's blog: Accountancy Journey as a Russian Graduate Audit Auditor (internal or external) – provides an independent review of an organisation's finances, assessing their past performance and their future income generation, to see if they are 'fair and true' and to give confidence to board members and shareholders. They may also conduct an audit of a company's other business areas, including Corporate Social Responsibility (CSR), health and safety, etc. For more information, access the Target Jobs auditor job description. Taxation Tax is a mixture of law, administration and accountancy and it draws on a range of intellectual, presentational and personal skills. Tax adviser – works with companies and individuals to create the best tax strategies for them. The diverse nature of taxation means that tax advisers rapidly develop areas of specialist knowledge, including corporate, personal, international, inheritance tax, VAT, national insurance, and trusts and estates. The Prospects Tax adviser job profile provides further details. Tax accountant – maintains financial records, produces reports and makes recommendations. A similar role to that of a chartered or management accountant but specialising in tax. There are opportunities worldwide and they would typically be in: Professional services firms - essentially, professional services involve a range of different occupations that provide support to businesses in the form of advice or performing tertiary roles. You may have heard of the ‘big four' which refers to PwC, Deloitte, KPMG and EY. There are also many other professional services firms and accountancy firms in the UK and worldwide. Industry and commerce for example, manufacturing, fast moving consumer goods (FMCG) Public sector such as civil service, local government and the NHS. You may qualify through the Chartered Institute of Public Finance and Accountancy (CIPFA) if you choose this route. HMRC are one of the largest employers of tax specialists and offer a graduate tax professional programme. There are a variety of trends that will affect the future of the profession from hybrid working practices to digital and technological advances. Some of the key issues are covered in The Future of the Chartered Accountancy Profession in 2024. However, the industry is positive about continued need into the future, even if the nature of the roles may change. Read the article from Future accountants: a bright future awaits MyCareer - Our vacancy portal (only available to Nottingham students and alumni) You can find roles in larger professional service consulting organisations such as Deloitte and PwC directly through their websites. Generic jobsites, such as TargetJobs, Prospects, and Indeed.com, are also worth searching for vacancies too. The Nottingham Internship Scheme offers spring and summer paid internships for Nottingham students with a number of these roles in the technology sector. Also try RateMyPlacement.com and other internships sites Attend the Management, Finance and Consulting Careers Fair (held annually in October) Sign up and attend employer workshops and presentations Join NEFS (Nottingham Economics and Finance Society) and attend networking events Take part in the Nottingham Internship Scheme Look for summer internships as these are often a pipeline into graduate schemes. You will need to start applying for these in the autumn term of your second year. Try online work experience platforms such as Forage Accounting, audit and taxation career options are complicated and so there are several links depending on career path chosen Association of Accounting Technicians (AAT) - information about the AAT qualification, career progression and job hunting Association of Chartered Certified Accountants (ACCA) - information about the ACCA qualification and a student blog Association of International Accountants (AIA) - information about the AIA qualification Association of Practising Accountants (APA)(medium-sized chartered accountancy firms) - careers section provides a list of member firms, training information and hints and tips for getting your first job Chartered Institute of Internal Auditors (IIA) - information about IIA qualifications Chartered Institute of Management Accountants (CIMA) - information about the CIMA qualification, case studies and graduate opportunities Chartered Institute of Public Finance and Accountancy (CIPFA) (public sector accountants) - information about the CIPFA qualification plus graduate job vacancies HAT Group of Accountants - a training consortium of 50 small-medium sized firms of accountants, their website provides information about training, a list of member firms and vacancies Inside Careers - provide careers information working with professional accountancy institutions Institute of Financial Accountants (IFA) - information about IFA training and careers Institute of Chartered Accountants in England and Wales (ICAEW) - offers the Associate Chartered Accountant (ACA) qualification and provides training vacancies and job hunting advice Institute of Chartered Accountants Scotland (ICAS) - the Scottish equivalent of ICAEW Prospects for a professional insight into the careers in this industry TARGETjobs - graduate career information and vacancies Chartered Institute of Taxation (CIOT) information on qualifications, careers profiles and case studies telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}