{
    "url": "https://www.nottingham.ac.uk/careers/employers/vacancies/policy.aspx",
    "content": [
        {
            "p": "We offer a free advertising service for graduate opportunities and internships through MyCareer, our online jobs portal. These guidelines are designed to help you recruit our talented students and graduates by advertising roles that are relevant to them. The opportunities on MyCareer are intended to be accessed only by University of Nottingham students and graduates, although we cannot absolutely guarantee this. Our Recruiter Services team is ready to answer your questions. +44 (0)115 82 32233 We invite employers to submit vacancies in accordance with the guidelines listed below. Adverts submitted will be only be published if they fall into the following categories: All details on the vacancy advert must be true to the best of the employer’s knowledge. We reserve the right to advertise only roles that meet criteria of relevance to our students and graduates. If necessary, we will make minor amendments to job adverts in line with our communication guidelines. We encourage employers to place their vacancies on My Career with a realistic lead time before the deadline to allow us time to publish them, and to give students time to engage with them. We cannot guarantee levels of student engagement with vacancies. Opportunities must be written in English to ensure they are accessible to, and allow us to judge their relevance to, our students and graduates. Please do read our guidance on writing an effective job advert on MyCareer. Please note we are unable to advertise any vacancies that, to our knowledge: *this does not include remote or online internships or graduate roles where the employee is required to work from home Any vacancy advertisements including statements such as ‘must be able to gain or have permission to work in the UK’ will be amended to read ‘the successful candidate must, by the start of their employment, have permission to work in the UK’. The University has further advice on recruiting non-UK candidates provided by Experts at Paragon Law and UKCISA. The University of Nottingham's UK policy on paid/unpaid internships. Adverts from organisations that are debtors to the Careers and Employability Service, including the Unitemps team, will not be published until that debt is cleared. Adverts will not be accepted from organisations who communicate with the university in what we deem to be an unprofessional and inappropriate manner. Graduate or internship opportunities offered in countries outside the UK must comply with the country’s relevant employment legislation. By placing a graduate or internship opportunity at the University of Nottingham, you are agreeing that you have up-to-date and valid: Please be aware of the following guidelines which apply to recruitment agencies. Any graduate or internship opportunities with the recruitment intermediary itself will be treated in line with our vacancy handling policy Given the large number of providers offering international experiences, we will quality check opportunities to ensure appropriate health, safety and wellbeing procedures are in place. Where employers and organisations arrange opportunities taking place outside the UK, please contact Recruiter Service team for information. Updated in June 2024 and approved by the Careers and Employability Service Leadership Team telephone: +44 (0) 115 82 32233 fax: +44 (0) 115 951 3679 email: recruiterservices@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}