{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/beyond-vet-practice/charities.aspx",
    "content": [
        {
            "p": "You're probably already aware of charitable organisations operating in the UK and internationally whose work supports animal welfare issues, such as the RSPCA, the PDSA, the Animal Health Trust, the Worldwide Veterinary Service and Blue Cross. Find out more about science careers beyond the lab Return to the Vets homepage Book a careers appointment The nature of the work you could undertake at a charity is varied, but the first question you should ask yourself is \"do I want to continue having physical contact with animals in my day-to-day duties?\" Firstly, you can continue to work as a practicing vet in the UK or internationally. Working abroad could give you the additional challenges of seeing different types of cases than in the UK and with different types of equipment than you are used to. Many vets who practice for a charity do so for a short time, but there are structured one or two-year programmes available. If you are interested in influencing the systems that vets operate within, this could be for you. This is an increasing area of focus for organisations that seek policy change and campaign accordingly. Charities generally specialise in certain issues. For example, the RSPCA and UFAW focus on animal rescue, and Greenpeace and WWF campaign for conservation. You may get a chance to get involved in engaging the media, marketing and producing campaign materials. Look for job titles such as 'PR and Marketing Officer', 'Campaign Officer, and 'Impact Officer'. You may work on a range of projects, e.g. part of a specialist scientific team looking at regulation, care and use of animals in experiments, or tracking conservation needs and lead analysis to identify and set priorities for valuable habitats and species. Researchers work closely with advocacy personnel as this is the channel by which their research has an impact. This is particularly important for researchers working for charities that concerned with the immediate and practical impacts of research. In smaller charities, advocacy and research roles may be done by the same person. This is a varied area and includes grant writers, membership managers and event managers. It's common to start in events and you should try to get a range of experience. It also breaks down into individuals and events, corporate businesses, trusts, foundations and multilaterals which all require different skills. These roles often involve marketing, technology and customer service How beneficial your veterinary training is will depend on which of the roles you are interested in getting into. 'Hands-on' roles such as practicing as a vet will see you directly using your clinical experience. For \"hands off\" roles, you will need to articulate through the recruitment process how your knowledge of the sector, greater credibility because of your expertise and evidenced passion for animal welfare means you are a more suitable candidate than someone who has not completed veterinary training. There are two questions you will need to address if you are planning on moving into a non-clinical role: There can be a lot of competition for charity-based jobs, so as well as looking at the big charities, you should also research and apply to smaller organisations to increase your chances of success. When recruiting, many charities prioritise individuals who fit with their values and principles. Therefore, when applying for roles you should articulate why working for the charity is important to you and how your values align with that of the organisation. In terms of job-hunting, you can find a variety of vacancies on charity specific job boards (see the further resources section below. In addition, develop and utilise any networks you may have developed through your EMS and extra-curricular experiences or through social media platforms such as Linkedin. The charities sector is well known for drawing people because of a passion for making a difference rather than high salaries. The precise salary will vary according to your level of experience and the seniority of the role. The location of the position will also impact of salary level. Volunteering is a great answer to both questions. This is a great way to build your skills and show your motivation for a role. For some great places to find volunteering opportunities, see the resources list at the bottom of the page. Before undertaking a volunteering opportunity, you should think about: You may also find that charities offer internships that can be a great route into paid employment and a chance to build your network of useful contacts. While it is worth exploring formal training courses, charity recruiters often value practical experience. For example, you could undertake training on marketing, social media, or PR for roles within campaigning, or start your own blog on relevant issues. A further research degree could also be beneficial for research posts. Charity Choice British Veterinary Association The Guardian Idealist.org ThirdSector.co.uk CharityJob Do It World Vets Volunteer Match UN Volunteers VSO British Veterinary Association - travel grant Projects Abroad WVS Vet Futures – Your passport to the future © CoSector, University of London. Used with permission. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}