{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/publishing-and-journalism/journalism.aspx",
    "content": [
        {
            "p": "Journalists work on newspapers, magazines, TV and radio stations, and in news agencies, and press offices. All journalists will produce online content, whatever media organisation they are working for due to divergence and digitisation. In addition to working for traditional journalism employers, journalism skills are also marketable across the wider communications industries such as public relations, marketing and in any organisation where online content may be produced. Questions about your plans? Talk to a member of our team. You need to decide what kind of content you want to create- is it news, lifestyle, a specialist topic? This could well determine where you may find work. Journalists work on newspapers, magazines, TV and radio stations, websites, and in news agencies, and press offices. See the section below if you are specifically interested in magazines. Many are freelance and most journalists have multimedia skills due to the integrated nature of content creation. The journalism landscape is changing rapidly. The way people access their news and other content is increasingly diverse. Historically the platforms were print publications (and their associated websites) or broadcast channels. Newer, online content providers such as TikTok, Facebook and bloggers, are challenging the status quo and responding to (often generational) changes in the way people access content. These challengers are often challenged themselves by the ever-emerging new platforms. Podcasts are currently very popular. This change has led to more curation of content, both by the provider but also the end user. Journalism skills are also marketable across the wider communications industries such as public relations, marketing and in any organisation where online content may be produced. This changing landscape offers a range of opportunities and choice of different types of organisations to work with or you could choose to work independently, creating and distributing your own content. There are different routes into journalism which broadly fit under these areas: All will require an enthusiasm for the work and a determination to work in this competitive industry: simply enjoying writing isn't enough. Personal branding is important for journalists. Think about your online presence, how you come across on the various platforms you use. Being able to write well is just a starting point. According to the National Council for the Training of Journalists (NCTJ), editors look for the following things: At a recent webinar, we brought together a panel of UoN alumni with backgrounds or academic interests in the US. One of our speakers was Iona Hampson, a BBC Senior Journalist, who studied a BA in Ancient History and History at UoN. She starts speaking at 7minutes and 8 seconds. Login to SharePoint to watch the webinar Three UoN alumni share their career journeys, give insights into the journalism industry, and provide tips to help you navigate your own path. Titles can vary from organisation to organisation, but the most common journalist job titles are: In addition, journalists can be employed as: and in many other digital communications roles According to analysis of the Office of National Statistics Labour Force Survey in 2021, the number of working journalists in the UK has gradually increased over the previous three years to nearly 100,000. This is up from 73,000 in 2017. For the first time, there are more women than men working in journalism. While the internet has provided more opportunities for journalists, copy can be unpaid, or paid at low rates that have not risen for many years, making it harder for the freelance journalist to make a living from that work alone. In the same period, the numbers of people working in public relations has also risen from 54,000 to 62,000. Some journalists do consider moving into this sector as their skills and knowledge can be transferable. Find out about public relations Magazines cover a vast array of topics and interests and are published periodically rather than daily. This could be weekly, monthly or less frequently and is why they are often referred to as periodicals. They range from: With paid for consumer magazines, unlike newspapers, people still like to buy the hard copy version. In fact, many periodicals aren’t replicated in full online. However, most publications have an active website and as well as the content within the publication, there is often additional online material to keep engaging with the readers, such as activities, quizzes etc to keep readers engaged between publications. Therefore, as well as roles in editorial, there are also roles in marketing and social media. Magazines are often owned and published by an umbrella publisher When it comes to consumer magazines, the leading companies – Bauer Media, Immediate Media Company and Future Plc – controlled an estimated 37% of circulation in 2020. Other big names include Conde Nast. The Press Gazette gives some fascinating insight into the most read titles and many other useful snippets, including circulation figures. Think as flexibly as possible, rather than just the big-name titles, but also try those too if you are interested in their content or have a specific interest in a specialist subject. Contact the editor or research whether there is a contact specifically for work experience. Some of the highest circulations are not necessarily the most glamorous titles. Think about the roles/section you are interested in (such as editorial or marketing). Bear in mind that features writers are increasingly freelance. Read this magazine journalist profile on the Prospects website. Being at university offers you an ideal starting point to build relevant journalism skills and experience and there are things you can be doing to see if it is the right fit for you. Cover student community news or special interests for Impact, write and broadcast news bulletins and features for URN and NSTV. These are all fantastic ways to try journalism out and get relevant skills and experience onto your CV. Social media is now a central tool of the modern journalist, whether you work in print, broadcast or online, so writing your own news or interest blog, or broadcasting a regular podcast, or Vlog and using platforms such as Twitter and Instagram to build a following for your posts is an essential thing to be doing and can show that you understand how a journalist would use social media. There are ways you can build up relevant skills, through blogging, vlogging or running a podcast and building an audience for your output via social media. Read this article for 5 tips for getting media work experience. You can also find opportunities to do some volunteer writing and editing on Journalism.co.uk After trying some of the things above, you might then want to think about getting in touch with news and media organisations to arrange some work experience during a vacation, or perhaps through volunteering on a regular basis for a few hours per week. Most media and news organisations will offer a short period of experience, but will look for evidence of commitment to journalism, even at this stage, so make sure you can demonstrate your seriousness through what you say in your application letter or email, backed up by your experience and evidence on your CV. Start by contacting your local media outlets: newspapers, magazines, news websites, radio stations or broadcasters. Try to find out who deals with work experience so that you can call or email them directly. Make sure you have addressed your suitability by being clear about your relevant qualities and skills (see section above) as well as talking about the experiences you have already had (points 1 and 2 above). Show that you know who the organisation’s audience is and be prepared to talk about some of its output, and ideas you may have, and importantly, be up to speed with the news of the day. For large organisations, check out what they say about applying for work experience via their websites. For smaller organisations, research what they do, who their audience is, familiarise yourself with their output, and write speculatively to the editor/producer. Editors and journalists are busy people, especially when their deadline is approaching. Try to find out what time of day is best to contact them. It is not impossible to break into journalism without a relevant qualification, and there are examples of past Nottingham graduates who have done just that. However, most of those who have been successful have usually built up an impressive CV of relevant experience whilst still a student. Some large media organisations run graduate journalism programmes, see the section on where to find vacancies on these pages for further details. There are industry accredited courses in news, magazine, and broadcast journalism that you can take after graduating. In addition to preparing you with the skills to work in your chosen form of journalism, you will be taught shorthand (still a sought after skill for journalism) media law, public affairs, digital production, and social media for journalism. The course options are: To find out more and search for courses, consult: National Council for the Training of Journalists - accredited courses Broadcast Journalism Training Council Journoresources - For direct entry onto annual journalism graduate training programmes Creative Access (for under-represented groups) For individual job vacancies and trainee positions see below. This is not an exhaustive list but gives a flavour of opportunities. BBC Careers Channel 4 Jobs Dennis Publishing Careers Guardian Media Jobs (Also lists external vacancies) Incisive Media Jobs ITV Jobs journalism.co.uk media beans News UK Careers (The Sun, The Times, TalkSport etc) Reach Jobs (The Mirror, Daily Record) Telegraph Talent Thompson Reuters Jobs Work For Sky While you are a student, try to get experience of blogging, writing for any other type of publication around your studies, getting work experience in PR. This all adds to your skills and knowledge of writing for different audiences. Get involved in the following student societies: IMPACT Magazine IMPACT organise a media conference each year in November. The Media Conference invites professionals from the media industry to share their experiences and advice with students interested in pursuing a career in this field. The event will include panel discussions, workshops and a networking session. Contact IMPACT for more details. Nottingham's Student Television Station (NSTV) URN Commonwealth Journalists Association - mentoring programme Hold the front page for industry jobs Journalism.co.uk for information about jobs and training schemes The Broadcast Journalism Training Council (BJTC) - for careers in broadcast journalism, sponsorship bursaries, traineeships, courses and jobs The Journalism Diversity Fund - aimed at people from diverse backgrounds without the financial means to attend NCTJ training courses The National Union of Journalists (NUJ)- industry news and a dedicated on professional training Press Gazette - industry news, jobs, student journalism blog and placement opportunities PressPad - for affordable accommodation in London to help with media internships and work experience telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}