{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/ampr/advertising.aspx",
    "content": [
        {
            "p": "If you're interested in pursuing a career in advertising, this page is a great place to start. Find out more about how advertising relates to, yet is distinct to marketing and PR, what types of roles are available, how to gain work experience and much more. Return to the A-Z jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment Find events relevant to this area Advertising allows companies to showcase their products and services by advertising through traditional media such as live TV/radio and print or through online platforms such as Facebook, Instagram, LinkedIn, etc. The goals of advertising are to: Although traditional advertising still plays a part, digital media has transformed the industry with advertisers now directing significantly more money and attention towards digital channels. Digital advertising is advertising through social media, websites, search engines, email and mobile apps and can be very effective at reaching specific audiences, boosting engagement, and producing measurable outcomes such as website traffic, leads, and sales. Its success relies on factors like accurate audience targeting, advert relevance, and effective optimisation strategies. Advertising agencies create campaigns to persuade people to buy or use products, services or organisations and do this by launching advertising campaigns via traditional or even more likely digital advertising. People employed in advertising generally work for an advertising agency. Agencies are selected by an organisation's marketing team or consultancy who will brief the advertising agency on the product or service they wish to promote. Marketing is the overall strategy and process of selling and raising awareness of products and services with an advertising campaign being part of this strategy. Public relations is about getting positive publicity and media coverage, and acting as a spokesperson for a person, product or service. See our section on public relations See our section on marketing The advertising industry is made up of the following: Services provided by the advertising agency can be categorised into four main areas (IPA): Some agencies may specialize in one of these areas, while others might cover one, two, or all of them. All services are interdependent; without each other, nothing would be created and delivered to the client. Agency structures can change frequently based on client needs and industry developments, requiring teams to adapt to new organisational strategies. Independent agencies - the vast majority are based in London and other big cities such as Manchester, Birmingham, Edinburgh, Glasgow and Bristol, but not exclusively so although many will not be specifically calling themselves ‘advertising agencies but rather ‘digital marketing’ with some aspects of advertising being incorporated into what they offer clients. Go to the IPA Agency Finder list Additional information on advertising and its make up is included in the IPA Career Guide below: Advertising has been transformed by technology and is trending towards providing a personalised approach to advertising. OA large percent of advertising is now online, working with web and mobile, and, increasingly, virtual reality and artificial intelligence. The industry is increasingly moving towards data analysis to create better advertising, leading to more opportunities for those with computer science and maths backgrounds, as well as social scientists who can link this data to human behaviour. For the latest news in advertising, take a look at the News section of the Advertising Association. Many different roles are available in advertising requiring different strengths and skillsets and you can find out about account executive, account planner, art director and copywriter on the Prospects website. Starting salaries can be around £20 - 26,000 per year. The industry is fast-moving and there are positions that people can work their way up in, with salaries rising to over £100k for senior positions such as creative director, managing director and head of strategy. Multinational companies are likely to offer higher salaries than independent agencies. The IPA have a useful Careers Guide, which includes: What role would suit you? Taking your first steps (which includes Preparing for an interview) Many entrants to advertising are graduates from a wide range of disciplines. Although increasingly roles are also open to non-graduates through apprenticeships and internships which is it is also worth considering. While there are numerous postgraduate degrees in advertising and marketing, these are not essential. Relevant work experience is often preferred. If you're considering a postgraduate course, do some research to see which courses and organisations are valued by employers Regardless of your degree background, advertising agencies will be seeking creative thinkers and those with a passion for the industry. Relevant work experience is highly desirable. For account management and media buying, customer service experience will enhance your commercial awareness. Creative Access has jobs and internships in creative roles, with some but not all are aimed at recruiting applicants from under-represented groups. Campaign IPA - job listing pages The Guardian Brixton Finishing School Creative Access advertises entry level jobs and internships in communications, marketing and Get involved with networking both on and offline and make the most of networking opportunities on LinkedIn, but remember to be professional. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}