{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/laboratory-work.aspx",
    "content": [
        {
            "p": "Many students express the desire to work in a laboratory. Finding vacancies can be a challenge as there is no single source for you to consult. There are also a diverse range of job titles which do not necessarily convey what you will be doing. Only on further investigation will you see if the vacancy is right for you. We invited three scientific professionals to talk to you about careers based in a laboratory. Login to SharePoint to watch a recording of this event Four speakers researching different types of diseases talk about their work in this webinar. Login to SharePoint to watch recording of this event Start at the end of your first year and throughout the autumn term of your second year. Many opportunities are advertised from the late summer onwards and depending on the organisation may close their offer at any time. Cogent - vacancies across all disciplines When applying a good application, CV and covering letter will be vital. Don't be frightened to contact organisations speculatively, as internships are not always advertised. Do think carefully what to include in your letter. It's important to include: why you are contacting them, what you can offer and what skills you can bring to the organisation. Advice on CVs, covering letters and application forms Inevitably some opportunities might involve volunteering and will not be paid. The value for you might be the experience rather than the money. Consider joining a learned society. Learned societies - find out more about them and a list of examples ABPI - membership list of pharmaceutical companies Association of Medical Research Charities - list of charities Biopharmguy - biotechnology, pharmaceutical and medical device companies Contract Research Map - companies listed by country UK Bioindustry membership directory Many science students express the desire to work in a laboratory. Finding vacancies can be a challenge as there is no single source for you to consult. There is also a diverse range of job titles and, depending on the role and organisation, various entry points too (for example, first degree, masters or PhD). To be successful when applying for jobs, you need to be clear about what you are looking for and the level of entry. For example, are you looking for research and development opportunities or roles in quality control? Employers will be keen to hear about your laboratory experience as well as associated technical ability such as IT, statistical and data skills. They will also seek evidence of competencies like team working, communication skills and much more. Always read the job description and the person specification and be prepared to tailor your experience to their applicant criteria. Employers are very diverse and of varying size. The bigger pharmaceutical companies will always be attractive to applicants because of their visibility and as such attract high numbers of applicants. Whereas a Contract Research Organisation (CRO) may offer just as many interesting opportunities but will be less well known and may attract less applicants. Both will be competitive job markets. Roles will be advertised all year round and not all jobs advertised will be formal graduate schemes. As a job seeker, it falls to you to research vacancies and consider the different information sources. You should also be prepared to raise your visibility and network as well make speculative applications. Visit our page on LinkedIn and online presence It might be helpful to consider the sectors you would wish to work as this could narrow down your choices of organisations to apply to and resources to use. For example, are you interested in pharmaceutical, healthcare, biotechnology, chemical, food, medical, environmental, agriculture or horticultural sectors? If you use generic terms such as ‘graduate laboratory scientist jobs in UK’ or 'medical laboratory technician', this will generate nationwide results. To narrow down your search, replace UK with your preferred location and type of work, for example, 'environmental laboratory analysis jobs, Nottingham'. There are lots of sources of vacancies available online and job adverts will be posted on generalist recruitment sites such as Indeed, Reed, TotalJobs, Adunza, Job Rapido, and LinkedIn Jobs to more specialist sites such as Pharmajobs and Europharmjobs. They will advertise jobs with titles such as graduate microbiology technician, laboratory technician - testing services / sample analysis to more senior roles. These sites will also advertise roles outside of the laboratory such as sales, regulatory affairs, medical writing and more. This is not a comprehensive list nor an endorsement by us. Recruitment agencies are also worth using to access opportunities. If you are looking for a graduate role which is related to science, recruitment agencies could be one effective way of finding employment. They can offer temporary or permanent opportunities over a broad range of sectors. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}