{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/psychology/case-studies2.aspx",
    "content": [
        {
            "p": "Our Nottingham alumni give an insight into their work in professional psychology and offer advice on getting into their career area. *All details correct for individuals at the time of their interview. Return to the professional psychology page Psychology case studies part one Psychology case studies part three I currently work as a forensic psychologist in a locked rehabilitation setting for adult males with an acquired brain injury. My main responsibilities are providing a psychological perspective within the clinical team regarding neuro-cognitive rehabilitation, risk reduction and issues regarding mental health. I conduct neuro-psychological assessments, develop psychological formulations, deliver direct individual and group therapeutic interventions, and provide indirect consultancy to the team. I also work privately, completing risk and diagnostic assessments within prison and court settings. I deliver training to mental health professionals and teach on a variety of master’s programmes. After completing my undergraduate degree in psychology, I worked as a healthcare worker in a forensic mental health hospital. I was lucky enough to get an assistant psychologist job there and was successful in getting onto a forensic psychology doctorate. I completed the masters component part time, and worked as a trainee alongside my doctoral placements which included working within the psychology departments at medium and low secure hospitals with adults detained under the mental health act, and developing the forensic strategy within a community autism charity. Since graduating I worked within a medium secure forensic intellectual disabilities ward, supervising and line managing assistant, trainee and qualified psychologists. It’s not a career for everyone so make sure it’s what you want to do sooner rather than later. Experience as a healthcare worker is invaluable in getting an insight into the environments you could be working in and may lead to more opportunities to work alongside psychologists. Make sure any training courses are approved by the relevant bodies, for example The British Psychological Society, before you commit. Finally, stick at it and take your time, it’s the journey that’s important rather than the destination! Research Fellow, MindTech I currently work as a research fellow within the NIHR MindTech Medtech Co-operative research group, based within the School of Medicine at the University of Nottingham. This group is all about research into the development, adaption and evaluation of digital technologies for mental healthcare and dementia - my role is specifically focused on applying this to children and young people’s mental health. My role involves a variety of research activities, including designing and supervising projects for undergraduate and postgraduate students; conducting systematic reviews; being involved with external organisations in evaluating new technologies for children and young people’s mental health; and writing up and publishing papers. Currently I have a lead role in the Online Remote Behavioural Intervention for Tics (ORBIT for short) study – this is a randomised controlled trial evaluating two different online programs for children and young people with Tourette syndrome. I actually ended up in psychology on accident – at A-Level, I wasn’t able to do a specific subject so ended up doing psychology A-Level instead, and it turned out I loved it! After doing my undergraduate degree in psychology at Bangor University, I completed my MSc Health Psychology at Nottingham in 2010-11 - as I went through this and did the applied research project, I realised that I quite enjoyed the research aspect and what this involved. So I had a look for PhD studentships that were available and which aligned with the kind of topics I was interested in – basically, the studentship had the research project already planned out but were looking for a PhD student for it. They were advertising a studentship in Division of Psychiatry & Applied Psychology here at the University of Nottingham which focused on the mental health of university students and the potential for using online resources to aid mental healthcare in this group. I applied for this and was successful at interview – three years of several quantitative and qualitative research projects later, I passed the viva and graduated. Soon after this, I started at MindTech! Head of Assessment and Diversity and Chief Psychologist/Assessor, Civil Service Fast Stream and Early Talent My role is focused on a set of programmes within the Civil Service, aimed at offering positions and work experience opportunities to early talent groups, especially from diverse backgrounds. Specifically, I oversee the assessment design of the Fast Stream graduate programme – voted The Times’ Number 1 graduate programme for this year. I also coordinate the multi-award winning Summer Diversity Internship Programme, Early Diversity Internship Programme, Autism Exchange Internship Programme and other positive action and outreach activities. In addition, I run mindfulness workshops and undertake numerous professional talks and advisory roles. After getting my first degree at the University of Nottingham in psychology, I attained a masters in occupational psychology at Birkbeck. I then moved onto Chartership status with the British Psychological Society and registered with the Health and Care Professions Council. In terms of my career, I was lucky enough to secure a sandwich year, while at Nottingham, in a clinical psychology posting. This gave me a great platform in terms of applying for psychology positions. I started after university at a business psychology consultancy – Saville and Holdsworth Ltd (SHL). After SHL I was Head of Occupational Psychology at the London Fire Brigade, as well as Acting Head of Occupational Psychology for Greater Manchester Police and also operated as a consultant for a range of industries. First of all make sure it is the right choice for you. What is your passion? What motivates you and what do you enjoy? Beyond this, I would say you should: telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}