{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/charity-work-and-international-development/international-development.aspx",
    "content": [
        {
            "p": "International development concerns the long-term and sustainable improvement of humanity's well-being. Organisations and projects in international development work across developing regions of the world, focusing on different aspects of well-being, from health and education to poverty and inequality. Many organisations are also involved in providing emergency aid, but the primary focus of international development is on long-term, sustainable improvements. Much has been achieved already by the United Nation's (UN) Millennium Development Goals and the more recent Sustainable Development Goals (see below), but there is still more to be done. Return to A to Z jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment The UN Sustainable Development Goals (SDGs) were set in 2015, and are comprehensive list of 17 goals which act as calls to action in which all countries participate. The goals are: Alongside these 17 goals, the UN have set 169 targets within their 2030 agenda, which aims to build on the Millennium Goals. The UN Sustainable Development Goals work cover three areas of development: However, the effects of Covid-19 have hindered the progress of SDGs. For example, according to the UN Sustainable Development Report 2022, more than four years of progress against poverty has been erased by Covid-19. Visit the United Nation's website for more information on the Sustainable Development Goals There are numerous roles available in international development and different countries and organisations will often give them different titles. They can be broadly divided up into the following categories: These roles may also be described as 'on the ground' or 'field' roles. Competition is fierce and relevant experience, e.g. technical, country-specific, overseas project management, etc. is vital. Typical job titles include 'Programme Officer', 'Field Coordinator' or 'Project Manager'. Job titles may include: policy analyst', policy advisor, research assistant, or programme advisor. These roles involve fundraising, campaigning and lobbying, and job titles may include advocacy advisor, fundraising assistant, development assistant or communications officer. An office-based administrative role is a good entry route for new graduates with limited experience. It will give you an opportunity to understand the organisation, network with the right people and be the first to hear about interesting projects and vacancies. Typical international development employers can be divided into five broad categories: NGOs are the main entry route into the sector. Don't just focus on the big names as they are inundated with applications, and successful candidates will often have two or three years' experience already. Take the time to investigate the thousands of smaller organisations that may be recruiting. Check out: BOND, NGO Voice, WANGO and RedR-UK. These organisations are globally recognisable and offer prestigious opportunities to a small number of exceptional candidates – mainly those with masters or PhD qualifications and relevant work experience. There may be some entry-level roles in their local or regional offices, but it can be difficult to move from there to the formal programmes. Check out: United Nations Development Programme, International Development Association and Organisation for Economic Cooperation and Development. Graduate schemes are likely to be open to nationals only – see their eligibility criteria. Entry onto these programmes is highly competitive. Check out: Department for International Development. Most roles will require a masters or PhD qualification and some previous research experience. Check out: Institute of Development Studies, Overseas Development Institute and Development Studies Association. Entry-level roles are likely to be at intern or volunteer level, as consultant roles will require significant experience in a specialist area. This webinar highlights the vast range of careers in the charities and NGO sector. You can expect to hear some top tips on how to gather experience to enter this field and what life is like working in the sector. The speakers illustrate how career paths aren't often linear. Bron and Sarah are relevant for international development careers. Login to SharePoint to watch a recording of this event What does a career in international development look like? This popular and increasingly important sector boasts a range of opportunities. Stephie Karagiorge from the UN Refugee Agency and the UN Young Professionals Programme, Legal Affairs department, will be speaking in this event to give you an honest insight into the sector. Stephie will talk about: Relevant work experience is vital, and much of that will be obtained through unpaid volunteering, either during or immediately after your degree. There are a number of approaches you could take: Charity Job - search for volunteer internships International Citizen Service (ICS) 2Way Development This is a very competitive sector and unless you have a specific technical skill that is crucial to a particular project, you will need some relevant experience, ideally overseas prior to making applications. See above and our work experience pages. In addition to practical experience, successful candidates often have either a social science or relevant vocational degree. It is possible to enter the profession without a masters qualification, but in some roles such as policy and research, it is likely to be a requirement. International organisations such as the United Nations run a range of prestigious development-related programmes and internships. Many of them include a masters or PhD in their entry requirements. Most roles within research organisations and think tanks will require a masters or PhD qualification and some previous research experience. Policy and research roles commonly require a masters or PhD-level qualification, ideally combined with practical experience. It is essential that you are good with people. You are likely to change project team, employer, country, etc. regularly throughout your career and you must be able to adapt to your surroundings and communicate with those around you. Self-sufficiency, problem solving and effective decision making are important, as is the ability to learn a new language. United Nations Development Programme The World Bank Overseas Development Institute (ODI) Fellowship Scheme Charity Job ReliefWeb World Service Enquiry DevNet Jobs Idealist Raleigh International Join Students' Union societies, for example Oxfam and Amnesty Nottingham & Nottingham Refugee Forum Nottingham Community and Voluntary Service UoN Students' Union volunteering Apply for the Nottingham Internship Scheme Join the Nottingham Consultancy Challenge and work with local charities and NGOs Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. As mentioned, Covid-19 has had a huge impact on global development and has greatly hindered the progression of the SDGs. International Development Minister, Andrew Mitchell, stated in his April 2023 speech how the UK aims to tackle the SDGs taking on a new vision for UK development. This has included replacing the Department for International Development with the Foreign, Commonwealth and Development Office to correctly reflect the integrated approach to the SDGs. Find out more about the UK response to the SDGs UK International Development - a new brand for the UK's work in this area Next Generations Champions Report: Youth vision for a future international development ecosystem and the UK’s role within it The spending of the Foreign, Commonwealth and Development Office on the strategy for international development More websites to explore: Foreign and Commonwealth Office (FCO) travel advice UN Online Volunteering Service United Nations Sustainable Development Goals The Future of Global Development report telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}