{
    "url": "https://www.nottingham.ac.uk/careers/students/work-experience/what-can-i-do/part-timework.aspx",
    "content": [
        {
            "p": "Finding a part-time or temporary job is important for many students. You can earn money and boost your CV at the same time! Whatever type of work you do, don't underestimate the value of the work and the skills you have gained. We can help you reflect on your experience and articulate how this has developed your skills. Full-time students are advised not to work more than 20 hours per week during term time as stipulated in the university's regulations. Get your CV ready to apply for part-time jobs. Book a CV review appointment Pooja Mooladka, nutritional sciences student Read Pooja's blog post Our JobZone team advertise part-time, casual and temporary jobs on campus and with local businesses. Created just for you, we advertise vacancies that can fit around your studies and other commitments. The vacancies are advertised offer: excellent rates of pay, holiday pay, complete flexibility – you choose when you work. Roles include: social media ambassadors, research assistants, catering and hospitality staff, invigilators, sports assistants and administrative roles. More unusual roles include: milk recorders (milking cows and collecting samples) machinery and animal technicians, seed sowing and harvesting assistants. Don't worry if you don't have any work experience on your CV, there are plenty of opportunities you can apply for including student ambassador roles at the university's Open Days. Search the Student Jobs website Search the Unitemps website Ring 0115 846 7374 between 9am and 5pm, Monday to Friday Email jobzone@nottingham.ac.uk This online NOOC can help you consider the opportunities available, learn about how to reflect on your experiences, and access helpful information about how to identify and articulate your skills and knowledge. The NOOC explores a range of topics and signposts you to helpful resources on our website. You can do as much or as little of the NOOC course as you wish. Or, you can complete the full course as part of your Nottingham Advantage Award. You can do this by completing the online activities alongside the work or volunteering experience you have gained. Take a look at the NOOC Indeed.com Paperound - Sign up to the marketplace and make money by selling your skills Student Job Job portal dedicated to the employment needs of students and graduates Most international students are eligible to work up to 20 hours a week during term time. However, this will depend on your visa so it is important to check on an individual basis. Check UKCISA for more information Before undertaking part-time work, please check with your department if there is any restriction on the number of hours you can work, especially for jobs outside the University. Science and engineering students may be recruited to work as demonstrators within the university. Talk to your supervisor or look on your department noticeboard for vacancies at the end of your first year. Arts and humanities students may be recruited for teaching work within the university, for example, as a language assistant. These opportunities are more suitable for second and third year students. Talk to your supervisor or look on your department noticeboard for vacancies. Other more general opportunities exist within the university, for example resident tutor in a hall of residence. These posts are advertised on the university's website. For information on your working rights in the UK such as the National Minimum Wage, the National Living Wage and working hours, please visit the following page: Your rights at work When you begin work you will need a tax code which tells your employer what your personal tax allowance will be. To obtain your tax code, you will need to fill in a P46 form. For details of paying Income Tax visit the HMRC website or contact HM Customs and Revenue office Nottingham 0300 200 3500. If you are a UK citizen you should have been sent a card with the details of your NI number from HM Revenues and Customs (HMRC) shortly after your sixteenth birthday. If you didn't receive one or have lost it, please contact HMRC on 0300 200 3500. If you are a non-UK citizen, you should contact Jobcentre Plus to apply for your NI number as soon as you are offered a job. Contact them on 0845 600 0643. You will be invited to an interview at your local JobCentre Plus office. It usually takes six to 12 weeks for your application to be processed but you can still work during this time. Inform your employer as soon as you have your NI number. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}