{
    "url": "https://www.nottingham.ac.uk/careers/employers/vacancies/job-adverts.aspx",
    "content": [
        {
            "p": "A good job advert not only tells a prospective candidate the skills you are looking for, it is also an opportunity to sell your role and organisation to potential applicants. Try to think about how you can use the job advertisement to attract candidates – anything that makes your organisation and role profile stand out will help you to attract more people. Our Recruiter Services team is ready to answer your questions. +44 (0)115 82 32233 Don't forget many students will be viewing job vacancies on their phones so consider carefully what you want to include in the main sections. After bookmarking vacancies of interest, they move to their laptop or computer to find out more detailed information opening any attachments (job description or person specification) or clicking on a link through to your website. On MyCareer, there are three sections that you need to complete in addition to the basic facts about the job, for example, contract type, salary, location and so on. We strongly encourage you to advertise the salary and we can offer advice as we subscribe to The Pay Index. Please contact us for more information. This is a short description for the role which will appear in the search results. This needs to provide the essential purpose of the role written in an engaging manner. There is the opportunity to add a link to your website for more details and/or attach supporting documentation (Word or PDFs). A description of your organisation is pulled through to the vacancy from your entry created when you first registered on MyCareer. You can add further information or update this information at any time and this is preferable to lengthening the information in the details section above. Please review our vacancy advertising policy before submitting a vacancy on MyCareer. If you need any help placing a vacancy with us, please do contact our Recruiter Services Team. telephone: +44 (0) 115 82 32233 fax: +44 (0) 115 951 3679 email: recruiterservices@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}