{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/first-weeks/communication.aspx",
    "content": [
        {
            "p": "Communication is frequently cited as an essential skill by employers, but just why is it so important? Good communication between colleagues fosters a positive and inclusive culture that helps to: Two UoN alums who both work in graduate talent development offer their insights into workplace communication: You may be speaking in person, on the phone, or online. Whatever the situation, consider the following things, and remember that it’s fine to take a pause to consider how best to express yourself aloud. Listening is as important as talking. Active listening is about being fully present and giving someone your whole attention. You can show you’re engaged by making eye contact and nodding. Taking notes may also demonstrate that you feel what is being shared is worthwhile, and you can further demonstrate your interest by asking thoughtful follow-up questions. Listening carefully will also help you to process new information and receive feedback, which is essential if you want to make sense of your workplace environment and make progress. Our facial expressions, hand gestures, movements, and postures all communicate meaning and contribute to how people interpret the words we say. Check in with your own body language to make sure that the signals you’re giving off visually are consistent with the messages you are offering verbally and remain positive. Use eye contact and smile to start interactions, adopt open postures and mirroring to build rapport, and nod to demonstrate active listening. Plus, by tuning into non-verbal cues you can also begin to read colleagues and better understand their position. If you sense that what you’re hearing and what you’re seeing don’t align, it might be worth trying to gently explore this further. You might be composing emails, writing reports, instant messaging, explaining data, or many other tasks besides, but as with all things linguistic, context is important. What is preferable, or indeed acceptable, may be completely different across different organisations so it’s worth observing how others communicate in writing and noting both everyday practice and official protocol. Ask yourself: Who will read what you write? Keep in mind how they’re likely to react, and remember, there could be a primary and secondary audience as things get passed on. What are you trying to communicate? Are you trying to explain, persuade, challenge, direct, praise or something else? Consider the tone of your language and how this aligns to your purpose. Have you proofread? When dealing with important or sensitive subject matter build in time to draft and then revisit your work later with fresh eyes. This will give you an opportunity to review the content and correct typos. Patience and respect are also important when it comes to written communication. You may not get an instant response. Keep in mind that your colleagues may be juggling multiple tasks and communication channels, and that people’s working patterns could vary so they may not receive your message immediately. Wherever possible, give people plentiful time to respond and if you do need to nudge, do so gently and politely. Preparation is key. Be clear about your brief and seek clarity about what is required if you’re unsure. Public speaking can sometimes be challenging, and you may feel nervous. You could experiment with different ways to self-soothe before you begin. Breathing exercises, visualising successful, using a mantra, power posing, or mindfulness meditation are all options. When presenting, be mindful of keeping to time and try to be responsive to your audience. For example, if people look quizzical or confused, you may need to provide further detail or use an example to illustrate your point. Check out the ‘speaking’ section for tips on tone, pace, and volume. Regardless of what method you’re using to communicate, here’s some things to keep in mind: Be clear about why you’re communicating and the key messages you need to get across. Think about how much context or background information might be helpful. If you have a lot of information you need to share, think about how you might break this up into smaller chunks. Consider the use of questions to elicit a response. Think about the words you choose carefully. Sometimes technical terminology is required, and acronyms can aid brevity (so long as everyone knows what they mean). However, as a general rule, a simple, jargon free approach tends to be more inclusive and is less likely to lead to misunderstanding. Try to communicate concisely. People are often busy at work, and this can help to demonstrate that you respect the audience’s time. The level of formality required will vary depending on the circumstances, but you should always be polite and inclusive. Remember that not all communication is perfectly polished all the time. While the above pointers are important, so is keeping it real, embracing mistakes as learning opportunities, and being true to yourself. Experiment with different approaches to build your own signature communication style. You may also find the following pages helpful: Meetings Relationship with your manager Working digitally telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}