{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/beyond-few-weeks/people/colleagues.aspx",
    "content": [
        {
            "p": "Life at work is certainly easier when you are surrounded by good people, so identifying brilliant colleagues and building relationships can really help to boost your success, and your overall wellbeing. When you’re new it can be helpful to seek out the following potential professional buddies. Ideally, you’re looking for people who get you, your ideas, and are great to work with. Sometimes you just jell with someone, working with them feels fluid, and tasks progress quickly with no drama; these people make great ‘go to’ collaborators when you need to form a dream team. Variety is also good. Seek out people who have diverse experience and bring different, yet complimentary, skills to the table. Need someone to champion a new project or help you to constructively challenge the status quo? Having the support of a workplace influencer could help. These people have built up trust and respect with a wide range of colleagues and have established channels of communication. Spot influencers by looking out for colleagues who are highly engaged and tend to drive conversation, and try to notice people who express themselves positively, broadcast their views with impact, and can build a buzz around new ideas. While you’re fairly new and still establishing your own network it can be helpful to identify a connector or two. These people have usually been around a bit longer and have worked within multiple teams or across projects with lots of different stakeholders. They’re good at mixing and know lots of people, and crucially for you, they’re willing to share their contacts and make introductions. Ask them for suggestions when you need expertise or a way into a new area, the chances are, they’ll know just the person! These people seriously know their stuff (inside out and back to front). They can provide technical or specialist advice and lend an authoritative voice when you need to add expert weight to a discussion or project. Ideally, you’re looking for experts that are willing to share what they know and exude infectious enthusiasm for their subject. Look out for hidden experts too, not everyone will have published material or delivered at conferences, sometimes people will have quietly built lots of valuable experience. To find these people, be curious when you meet new colleagues and ask about their professional interests. We all need someone who can turn a frown upside down! Your supporters are your workplace pals, they’re good for a giggle and will have your back if things go wrong. These people can offer tea and sympathy, but also know how to provide gentle challenge and encourage you to reframe things positively if you’re having an off day. They genuinely care about you, are a joy to around, and will help you to maintain your wellbeing. Disruption can sometimes be extremely helpful. Whether you're exploring a new topic or working on something you're very familiar with, it can be useful to look at something from a different angle or seek insight from colleagues with different perspectives or lived experience. So, approaching people who offer alternative viewpoints and can provide constructive challenge that disrupts your ordinary thinking will help you to keep things fresh and build deeper understanding. MindTools - Building Great Work Relationships telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}