{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/medical-education/case-studies.aspx",
    "content": [
        {
            "p": "During my undergraduate degree at the University of Sheffield, I had the opportunity to teach anatomy to biomedical science students in their second year. This took place in the Medical Teaching Unit, with the aid of cadaveric material. Each week I would be given an organ or region of the body that I could learn about in advance of the session. I would then be given some specimens demonstrating this organ and would teach small groups of five to 10 students all about this body region. This was an incredibly rewarding experience which allowed me to get a better understanding of the material myself. Not only was teaching valuable to me in this way, but it was also acknowledged in my Higher Education Achievement Report, which is something I could refer to in my CV when applying for graduate jobs. I am now working as an Anatomy Teaching Technician at the University of Nottingham. I began working here shortly after completing my undergraduate degree, and within seven months I was promoted to Level 3. I support anatomy classes focused on teaching students about the human body. These classes vary widely and use multiple approaches in order for students to best understand and remember gross anatomical structures. I look forward to taking on more responsibilities related to teaching in my future career. For anyone wishing to pursue a career in medical education I would strongly recommend looking at doing a masters and preferably a PhD in a relevant area, depending on your interests. I would also recommend asking staff in your department if you would be able to shadow them or volunteer to do some teaching, as this will help your application either for a job or a postgraduate course. Most staff are willing to accommodate students wishing to give some extra help. I am an acute medical specialist nurse within the Royal Navy and have been for nearly 14 years. I am currently the main recruiter for all specialist medical roles (adult and mental health nursing, ODPs, BMS and diagnostic radiographer). I recruit both qualified and student candidates. I attend many schools, universities, job fairs around the country and also by virtual means. What I do on these varies greatly from setting up a recruitment stand to presenting in front of large cohorts of students. I help them through the application process and support them in the build up to their final interview. The candidate is assessed on a number of different qualities such as professional effectiveness and, courage and integrity which makes sure that we are selecting the right people. I am also the specialist nurse advisor for medical nursing to the Royal Navy. I am part of a nursing strategy group that looks at training and development frameworks for all serving nurses and make sure that they are fit for purpose and that our nurses have the required skills required on deployments. These roles have been very challenging but immensely rewarding. I am passionate about effective coaching and mentoring and these roles have allowed me the scope to implement these skills. I have been a nursing mentor for a number of years, and I have given lectures to military nurses who are in their preceptorship phase. I have also been an instructor on the ALERT (Acute Life-Threatening Events Recognition and Treatment) course and on ILS (Immediate Life Support) courses. I have always had a passion for teaching and feel I have built up enough experience throughout my career that I want to further my understanding of clinical education. The next step for me is to undertake a postgraduate course in clinical education in September next year. There is a lot more to clinical education than merely teaching in front of a classroom. You may be supporting someone in a busy clinical environment, designing and implementing single lectures or an entire programme, setting examinations, etc. Experience is always useful and working alongside or shadowing current clinical educators will give you a better impression of what is involved. Most staff are more than willing to help you, and this has helped me in my preparations. A passion and natural enthusiasm for teaching is vital. Throughout my career, I felt I developed much better under those who possessed these qualities. My current role is Director of Education in the School of Veterinary Medicine and Science at the University of Nottingham. This involves leading a team who are responsible for teaching, learning, assessment and curriculum development for our undergraduate and postgraduate courses. My background before coming to Nottingham was small animal practice and teaching science in secondary school. When I joined Nottingham, I already had a PGCE, so was looking for an alternative to the PGCHE which would enable me to develop my understanding of healthcare education in a clinical environment. Hence, I enrolled on the Masters in Medical Education run by the Medical Education Unit at Nottingham. Firstly, as a vet, I would say that medical education is applicable to broader healthcare contexts, including those with animal patients. So, don’t be put off if your background is not medicine, but a related discipline. Experience is always helpful and I would encourage anyone interested to shadow educators within their own disciplines, and more broadly, to gain an appreciation of the challenges and also rewards involved in clinical education. Attendance at medical education conferences, for example, Association for Medical Education in Europe (AMEE) and in my context VetEd, is helpful to network and develop an insight into current hot topics. There are a number of open access online courses which can give you an insight into healthcare education for example: Developing Expert Educators for Healthcare Professions, run by Future Learn. The skills I developed during the Masters in Medical Education have been transferable to my own context within veterinary medicine. The course enabled me to see the veterinary curriculum and its challenges from a different perspective, which has been beneficial to course development and the student experience. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}