{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/pharmacy/index.aspx",
    "content": [
        {
            "p": "Pharmacists make a difference to the lives of their patients through an expert knowledge of medicines and health, combined with effective communication and rapport building skills. To qualify as a pharmacist in the UK you need to complete the MPharm degree which includes a one year paid placement known as the Foundation Year. In addition to your subject knowledge, the degree equips you with key employability skills such as: The graduate labour market remains buoyant for pharmacy graduates. However, it is likely there will be greater competition for pre-registration training places, as a result of the increase in output of graduates from newly established pharmacy degrees. Our pharmacy graduates secure professional positions largely within the human health sector, as hospital pharmacists, or the retail sector as community pharmacists. Some MPharm and MSci graduates choose to pursue careers in the private sector with pharmaceutical companies, for example, medical affairs, regulatory affairs, patent attorney or research roles. Find out more about options after your degree on the School of Pharmacy website: School of Pharmacy careers pages Employers often seek a range of transferable skills, such as communication, problem-solving, and teamwork, in addition to the subject-specific skills and knowledge you will gain during your degree. Below are some ideas of how to develop these transferable skills during your degree. Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when Research internship opportunities are advertised throughout the year in the School of Pharmacy. Announcements about opportunities are usually made through Moodle and emails, and/or speak to your personal tutor. We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union More volunteering options You can now undertake an optional placement year as part of your degree at the end of your penultimate year of study. The placement can be aligned to your degree discipline or related to your career aspirations. Speak to a career adviser or your school for more information. If you are no longer at Nottingham, you can access work and volunteering opportunities at home. Depending on your location and what you want to do, your strategy may vary so come and speak to us or arrange a telephone appointment. The majority of University of Nottingham students have the opportunity to study abroad during their university career. Nottingham has 200 partners in 40 different countries across four different exchange programmes. These include Inter-campus exchange, University-wide exchange, Summer Schools and school exchanges. Applications usually take place during the autumn semester of the academic year before you would go on exchange. Study Abroad We advertise part-time, casual and temporary jobs on campus and with local businesses. Created just for you, the advertised vacancies can fit around your studies and other commitments. The vacancies are advertised in two places. On-campus jobs Off-campus jobs Health Education England (HEE) introduced a centralised recruitment and selection process for preregistration pharmacist posts utilising the IT system Oriel. It applies to all hospital preregistration pharmacist posts and is optional for community pharmacy preregistration posts. Through Oriel only one application will be required and applicants can preference multiply preregistration pharmacists posts in both hospital and community posts. National Recruitment Scheme Once you have qualified - most newly qualified pharmacists enter the job market between July and August and many employers will target their recruitment to coincide with this. You will need to start your job search before you have finished your pre-reg training. Pharmacist Support - Looking for work Being a pharmacist isn’t the only option if you have a pharmacy degree. For information about alternative careers with your degree visit what you can do with a pharmacy degree as well as our pages on: Some local science-related companies include Quotient, Source Bioscience, Sygnature Discovery, as well a range of other companies in the BioCity Nottingham science park. If you want to look at more general options, visit our Career paths pages for information about different graduate roles. If you would like to discuss options outside pharmacy you can book an appointment with an adviser. This can be done by logging into MyCareer. Careers in the pharmaceutical sector NHS Careers - pharmacy Royal Pharmaceutical Society - careers pages including community and industrial pharmacy Prospects - community pharmacist National Pharmacy Association - for jobs Pharmaceutical Journal - for jobs C + D Jobs For information about careers in the pharmaceutical sector about drug discovery and design, see our page telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}