{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/finding-vacancies/sources-of-vacancies.aspx",
    "content": [
        {
            "p": "There are many sources of graduate vacancies and we would encourage you to use several different ones to find your ideal role. The sources below cover roles across a broad spectrum of career areas from advertising to telecommunications. Use these as a great starting point and talk to our advisers for further or specialist sources. Talk to an adviser The vacancies advertised on MyCareer are from graduate recruiters targeting Nottingham students and graduates. We advertise around 4800 graduate vacancies every year. The vacancies cover 30+ career areas so start your search now: Login to MyCareer Get the latest graduate jobs direct to your inbox every fortnight: Subscribe to Jobs by email Just a sample of the vacancies in and around Nottingham: Jobs boards are to recruitment what Ebay, Amazon and Etsy are to e-commerce. If you were an employer, would you rely on candidates visiting your careers webpage if you could reach thousands (if not millions) via a third party site? Most jobs boards allow employers to post vacancies for free, but sponsored adverts appear higher in search results. This means that candidates who are prepared to venture beyond the first couple of pages are likely to be rewarded with some hidden gems. Some jobs boards are extremely broad in scope, while others focus narrowly on individual sectors or types of role (for example, graduate schemes). Before diving in, identify up to three jobs boards that fit your job search requirements by visiting their websites and reading user reviews online. Any more than this and your job search will quickly start to feel like a chore. As with all online searching, you get out what you put in. It takes time to find the right combination of search terms. If your initial searches return lots of vacancies: Take some of the stress out of job hunting by allowing vacancies to come to you. Creating a free account with one of the big national jobs boards (for example Indeed, Glassdoor and TARGETjobs) and downloading the app will enable you to view, save and apply for jobs wherever you are. You can also choose to receive daily or weekly alerts which suggest vacancies based on your search activity and application history. There are hundreds of job boards on the web, use these as starting points for graduate-level jobs: Bright Network Gradcracker.com - for careers in STEM Glassdoor - jobs and reviews of companies by employees graduatejobs.com Knowledge Transfer Partnership (KTP) – opportunities at the University LinkedIn Jobs Prospects targetjobs Totaljobs Graduate Zone Work In Startups Read Amrina's blog: Navigating careers: resources for under-represented students Read our blog: How To Find Out if an Employer Is Genuinely Inclusive Blind into Business - support for blind or visually impaired students and graduates Creative Access - helping under-represented communities to enter and thrive in the creative industries Disability Connect - a reverse mentoring scheme providing businesses with a disabled mentor to increase their awareness of disability and disability issues in the workplace EmployAbility – disabled and dyslexic students/graduates Evenbreak - supporting disabled students/graduates Exceptional Individuals - jobs for dyslexics Proud Employers – LGBTQ-inclusive employers Rare - A programme for students from disadvantaged backgrounds where you can can gain access to free coaching, interview advice, news and events SEO - an organisation to help undergraduates secure internships and graduate roles with many of the top UK graduate employers Sutton Trust Pathways Plus (Law only) - undergraduate programme for students from under-represented backgrounds that includes residential, mentoring, work experience and application support The Times Top 50 Employers for Gender Equality 2023 upReach - a range of programmes for students from widening participation backgrounds to build knowledge, soft skills, networks and gain experience Windsor Fellowship Programmes - a range of programmes that support BAME students and recent graduates with internships and placements Take a look at the websites of universities in the area where you want to work as they may have information on the job market and vacancy sources. Here are some starting points for graduate vacancies around the country. North East Jobs Yorkshire Graduates BrighterBox University of London Careers Group Gradsouthwest.com Cambridge Science Park Northern Ireland, Scotland and Wales GradIreland NI Jobfinder MyJobScotland - public and third sectors sIjob.com - jobs in Scotland Recruitment agencies are a good source of vacancies. Some specialise in graduate recruitment, some in specific job areas and others offer a mix of vacancies. Before you use a recruitment agency, please read The Recruitment and Employment Confederation advice on using an agency. You should not pay a fee for the services of an agency as they charge the employer. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}