{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/geography.aspx",
    "content": [
        {
            "p": "With excellent written, numerical and analytical skills, studying geography opens up a wide range of career options. Learn about these options and how we can support you on your journey. You may have chosen geography because of your enthusiasm for the subject rather than an in-depth consideration of the vocational choices available to you. However our graduates have found success across a wide variety of job sectors. Book an appointment or attend a drop-in event Check out our careers events this term Search for graduate jobs and internships In addition to your subject knowledge your geography degree equips you with key skills valued by employers: Geography graduates enter a diverse range of occupations and courses. Some enter roles which have a direct correlation to their degree, for example: Others have gone into: Geography graduates secure positions across a diverse range of employment sectors but the most popular sectors are: Career paths - explore roles and sectors Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates Nottingham Internship Scheme The Nottingham Advantage Award offers interesting extracurricular modules to develop your employability. With over more than 300 modules across our three campus in the UK, China and Malaysia. Nottingham Advantage Award Digital skills are essential in many career fields including advertising, publishing, marketing and general commerce. They range from social media to coding and will definitely enhance your employability. Digital marketing careers The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Students in Classrooms Undertake an exchange semester in another country and broaden your horizons. Talk to your tutors and find out more about the programmes available from the International Office. Exchange programmes Many graduate recruiters use psychometric tests during the recruitment and selection process. They are common across all sectors and career fields. Practise will really help your performance. Use our example tests Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Royal Geographical Society - careers with geography Conservation Careers - environmental jobs telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}