{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/industrial-consumer-materials/chemical-industry.aspx",
    "content": [
        {
            "p": "The chemical industry is responsible for researching, developing and manufacturing the chemicals and chemical products that are found in many of the items we all use on a day-to-day basis, from perfumes to paints and fuel additives to plastics. The products of the chemical industry are used in sectors as diverse as energy, construction, automotive and pharmaceuticals, and indeed the pharmaceutical sector is often seen as part of the broader chemical industry. The sector provides opportunities for global graduate employment. The global chemical sector is is dominated by China, followed by the USA, Germany, Japan and South Korea. The UK is the eleventh-largest chemical and pharmaceuticals producer in the world, and the fourth-largest producer in the EU. Return to jobs list Find out more about a pharmaceutical career If you have questions about your plans, talk to a member of our team. Book a careers appointment In these roles you could use your chemistry skills to research, develop, analyse and test chemicals and chemical products. Roles include: R&D chemist, formulations chemist, analytical chemist, synthetic organic chemist, medicinal chemist, polymer chemist, quality control chemist and environmental scientist. In these roles you could use your engineering skills in the chemical production process. Roles include: chemical engineer, process engineer, mechanical engineer, electrical and electronic engineer and maintenance engineer. In these roles you could use your IT skills to support the scientific production and business functions of the sector. Roles include: laboratory information management support, IT support, system administration and software engineer. There are also a range of more general roles for any graduate with the right set of skills such as project management, business analyst, sales and marketing, supply chain, logistics, finance and other corporate roles. Chemical Industries Association Society of Chemical Industry - for early career scientists Cogent Skills - use the Career Navigator for career and training pathways Many of the larger chemical companies offer graduate programmes across a range of roles.For example: Many other employers offer graduate-level roles on a regular basis, although not always as part of a structured scheme or programme. There are around 3,000 chemical companies in the UK, the majority of which are small and medium enterprises (SMEs) employing less than 250 people. Within the East Midlands, there are a range of SMEs in the pharmaceutical sector such as Sygnature Discovery, as well as some larger companies such as Lubrizol in Derby. Smaller companies can be found on science parks such as Nottingham's Biocity, and other which can be found on the UK Science Parks website. To search for vacancies offered by these companies, use the following membership directories: Chemical Business Association Alliance of Chemical Association MyCareer Vacancies from companies looking to recruit Nottingham students Royal Society of Chemistry Jobs The Chemical Engineer CK Science SRG Gradcracker Postgraduate courses in chemistry, including courses specifically designed for industry, can help you further develop and refine specialist skills. It is also possible for students from a range of science and engineering backgrounds to study an MSc Chemical Engineering. For R&D and other highly scientific roles, a PhD will often be a requirement. Due to the research-intensive nature of the industry, there is a close relationship between academia and industry. There's lots that you can do at Nottingham to develop the experience and skills that employers in this sector are interested in, for example: ChemSoc ChemEnvSoc BioChemSoc Recruitment fairs at Nottingham Nottingham Advantage Award Institution of Chemical Engineers (IChemE) - find out about chartership and accredited company training schemes Royal Society of Chemistry - careers support and membership Chemical Week - latest news about sectors and regions The Essential Chemical Industry Overview of the processes, chemicals and materials used in the industry The Engineer CEFIC - European chemical industry facts telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}