{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/biotechnology.aspx",
    "content": [
        {
            "p": "Biotechnology is a revolutionary science which involves the exploitation of biological systems with proven impact on health, medicine, food and the environment. For more information on biotechnology as a sector visit this webpage Book an appointment or attend a drop-in event Follow the Biosciences Teams site In addition to your subject specific knowledge, your biotechnology degree will equip you with a range of transferable skills including the ability to: You will also develop 12 competencies which have been divided into these four headings: Explore the Biosciences Core Graduate Competencies Employers often seek a range of transferable skills, such as communication, problem-solving, and teamwork, in addition to the subject-specific skills and knowledge you will gain during your degree. Below are some ideas of how to develop these transferable skills during your degree; make sure you look at the ‘What can I do?’ pages for even more ideas. What can I do? work experience pages Why not take an optional industry placement, between years two and three of your degree? This will extend your degree to a four-year programme. Biotechnology students have previously secured placements at GlaxoSmithKline, Pfizer and Medimmune amongst others. Year in Industry As part of this, it is possible to gain accreditation from the Science Council as a Registered Scientist (RSci) Summer internships are also a great way to gain experience, whether in science or non-science based roles. You can search for roles using the links below, but also consider making targeted speculative applications to small and medium-sized companies who may not advertise opportunities. My Career - internships from companies targeting Nottingham students Nottingham Internship Scheme Royal Society of Biology - placements opportunities For list of organisations offering work experience or internships in the lab visit - Laboratory work Summer research placements are available through the School of Biosciences, these depending on the research being conducted. It is worth approaching the academic staff working in the area of research that you are interested in, particularly if you are considering applying for a PhD in future. There are also other sponsored opportunities and funding for summer research placements through organisations such as the BBRSC. Royal Society of Biology - undergraduate studentships Wellcome Trust - Biomedical Vacation Scholarships Involvement in relevant SU activities including volunteering, sports clubs and societies can help you to develop and enhance skills that employers look for such as working in multidisciplinary teams, communicating scientific information to a non-science audience and consulting with local businesses. BiotechSoc Full list of the Students' Union's student societies Volunteering The Nottingham Advantage Award offers a range of modules to help you expand, develop and evidence your skills and experience during your time at university. With over more than 200 modules across our three campus in the UK, China and Malaysia, there's something for everyone. If you’re thinking of moving into consultancy after graduation, the Nottingham Consultancy Challenge module will help you develop and demonstrate all the right skills. Nottingham Advantage Award - find out more and explore the modules on offer Knowing about the latest developments is important for a couple of reasons: firstly it may spark off your interest in a particular part of the sector and secondly, employers often ask questions about the factors that may be affecting their company at an interview as a way of gauging your interest in their business. News from the Biotechnology and Biological Sciences Research Council Latest news from BioIndustry Association Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. The biotechnology course gives the option to specialise in plant, animal or microbial biotechnology. As a graduate you can choose to pursue one of these areas of interest or enter a diverse range of employment areas. A sample of employers who have recruited our biotechnology graduates A sample of roles undertaken by our graduates A large proportion of our biotechnology graduates progress into further study. For those wanting to pursue a research-focussed career either in industry or academia, a postgraduate qualification, usually a PhD, is almost always required. Biotechnology undergraduates have built on their undergraduate qualification by undertaking a biotechnology-related masters course or PhD, including: Others opt to take a postgraduate qualification which will allow them to pursue a particular career interest such as Graduate Entry to Medicine. A number of biotechnology graduates have also undertaken a Postgraduate Certificate in Education (PGCE) in science or biology in order to train to become a teacher, a profession for which science students are currently in high demand. Search for courses and find out about funding In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar Agri-Food Careers Biotechnology Careers Environmental Careers What are my further study options Scientific Careers Science Careers Beyond the Lab ABPI - Careers in the pharmaceutical industry UKRI - find funding for BBSRC research (use funding source) Where to look for graduate vacancies UK BioIndustry Association - search for jobs Royal Society of Biology - careers pages telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}