{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/beyond-few-weeks/tasks/workload.aspx",
    "content": [
        {
            "p": "Or put another way, doing all the stuff you need to get done within the time available and without getting stressed out. It may sound simple but lots of people struggle with managing their workload. This might sound counter intuitive. Surely, getting on with what needs to be done would be a better idea, right? Perhaps. If you already have the winning formula for managing your workload then skip this, but if not, it might be helpful to take a step back and spend a little time appraising your current approach. This will help you to appreciate what works well and what doesn’t, and where there might be opportunities to make a change. Questions to ponder: Once you’ve got a good grasp of your current workload reality and identified where improvements could be beneficial, it’s time to get proactive and trial some new techniques. Workload management strategies can be broadly split into five groups and to begin with it’s worth considering what type of approach is likely to motivate you the most. Then google and you’ll find no end of methods to try. That said, remember that it might take a little while to find the thing that works for you. These tend to focus on breaking your working day into chunks of time and allocating tasks to each. Techniques include using timers to encourage short focused periods, spending set amounts of time alternating between enjoyable and less enjoyable tasks, or being aware of what times you tend to be more productive and working out an alternative schedule to suit your preferences. These tend to focus on determining the urgency and importance of each task on your list and then prioritising them accordingly. Search ‘prioritisation matrix’ online and you’ll find lots of templates, or if you prefer to keep this exercise live and want additional functionality, there are lots of apps available. These tend to focus on your relationships with other people and how they can help or hinder workload management. Techniques include pledging to a colleague that you will complete a particular task and asking them to nudge you regularly, introducing clear boundaries between social interactions and focused work activity to avoid friendly distractions, and being respectfully assertive and learning to say no sometimes when people ask you to take on additional tasks. These tend to focus on the idea of action and reward. Techniques include allowing yourself a treat once you complete a task (whether that be a cupcake or a new car), visualising the potential positive impact that completing a task will bring, or conversely, encourage people to identify any negative consequences of failing to do something, and aligning activity with personal or career goals. These tend to take a more holistic approach. Techniques focus less on finding ways to get tasks ticked off and instead encourage lifestyle improvements. The idea being that better exercise, diet, and sleep habits will enable you to adopt a more positive mindset at work or combat any stress caused by a heavy workload. Yolanda King, UoN alumna, MA Criminology, 2018 Don't be afraid to say no. If you've got too much on them saying yes and not getting work out looks worse than just putting your hands up and saying \"I can't do this\". Jake Lester, UoN alumnus, MSci Physics, 2018 Check in with your boss or team on priorities and any deadlines. Manage expectations if you're going to be delayed or if your snowed under be sure to explain everything you're working on. C Lisa Murkin, UoN alumna, Business Management, 2015 When I first started out I had a notebook where I did a flow chart for every process that the system required for each job, and another notebook for daily lists of jobs I had to complete. This helped massively as I ended up with a list of daily activities and I knew how long they would take on average. Olivia Dawkins, UoN alumna, English, 2018 Starting out, I was working much longer hours than the rest of my team. With time and practice, you become more efficient with tasks and identify what needs to be prioritised. However, at the beginning it always helps to have someone support you to identify what is important and what can be left until tomorrow. Aisha Natamkar, UoN alumna, Economics, 2015 Working from home (WFH) introduces a different dynamic and may impact how much or how little you achieve. If you work from home regularly, it’s worth factoring this in when considering any new workload management techniques. You might also try the following: Watch our video to hear from recent UoN alums about how to be productive when hybrid working. BBC - Productivity Playlists Harvard Business Review - Assessment: What's Your Personal Productivity Style (quiz) Lifehack - Productivity Music For Focus telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}