{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/it/computer-science.aspx",
    "content": [
        {
            "p": "As a computer science graduate, you will be equipped with a range of technical and transferable skills that are highly valued by employers and will enable you to progress into a number of different career areas. According to Prospects Luminate ‘what do graduates do?’ 2023 report, the 2019/20 Graduate Outcomes data shows that graduates from technology and engineering disciplines have higher full-time employment rates than the all-graduate average (57.3%). More than two-thirds of IT professionals (67.7%) were in roles related to their degree. With more technology vacancies being advertised over the last year than in any other sector, it shows the high demand for these skills. It also shows that computer science graduates working at graduate level, tend to move into roles such as: Cyber security professionals Look at the top in demand IT skills in 2023. Book an appointment or attend a drop-in Your computer science degree will provide you with a range of technical skills such as computer programming, data analysis and programming languages. In addition you will develop soft skills that are applicable to all professions and complement your technical skills. Some examples of this are communication, organisation and problem-solving skills. In addition to subject-specific knowledge, and developing an understanding of the core skills required, your computer science degree will equip you with a range of transferable skills including: Due to the range of career options and sectors open to you, it is important to consider your options early on in your course and look for opportunities to gain relevant experience and skills. As well as improving your CV, gaining experience can also help you to make choices about your future career. Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Gradcracker offers specific IT internships. Also think about completing a year in industry placement as part of your degree. Work experience - what, how and when The industry year lets you take what you've learned and apply it to real projects in industry. Placements are usually paid and can even lead to a job offer before you've graduated. Please speak to the Careers team or your School of Computer Science personal tutor if you are interested in completing a year in industry. Experience beyond the curriculum is encouraged by the School of Computer Science and valued by employers. There are a number of school-led modules designed to give credit for your own independent programming projects, work experience or teaching experience which are assessed and validated by the school. Employers will be keen to hear about the practical, project-based modules that you have completed, for example, second year group projects. Employers are always keen to hear from students who are passionate about technology and create code outside, as well as inside, their academic work. You could get involved with student societies such as Hacksoc or undertake some technology-based volunteering work. Coding for your own projects will also be useful experience and can be added to your CV. We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme If there’s a particular area of career interest that you’d like to explore an optional placement year could help you. As you’ll get under the skin of an industry, organisation and role to make better-informed decisions about your future career. It’s also an opportunity to build professional skills and ease the transition into working life. If you’d like to try different areas of work, gain relevant work experience and want to gain invaluable experience (especially within competitive sectors), volunteering could be a way for you to achieve this. Find out what's on offer on our volunteering page The award offers a multitude of ways in which you can build your employability skills including working with external organisations, learning a language or undertaking a work experience opportunity. Nottingham Advantage Award Get involved in relevant Students' Union societies Hacksoc and Compsoc or you may prefer to get involved with something completely different. You will be able to build your transferable skill set as well as have something extra for your CV. Students' Union You could build your communication, commercial awareness, problem- solving and teamwork skills through part-time jobs. Unitemps is our recruitment service for part-time and temporary work on campus and in the local area. Search for jobs on Unitemps The majority of University of Nottingham computer science graduates enter roles within the IT sector although some will use their IT knowledge to move into careers such as consultancy, finance or banking. Software development and engineering Web and app development Consultancy and business roles Data roles Other technical roles Joy, UoN computer science alumna, works at the university. Find out about her research and her role promoting science to women. UoN computer science alumna, Robyn works for EY. Find out about her role and the skills learned during her course in her work. UoN alumnus, Hassan who works at an investment bank offers advice to students thinking about their future. UoN alumnus, Giorgio talks about the value of extracurricular activities at Nottingham and the impact on his career. UoN alumnus, Alessia, talks about the skills she uses from her degree and how these gave her a foundation for her career. Each year between about 10% of University of Nottingham computer science graduates choose to continue with their studies onto a taught masters or PhD qualification. Further study options at this level have included Some students progress after graduation to a PhD or Doctoral Training Programme (DTP) in Computer Science In these two videos, Dr Judith Wayte from the University of Nottingham provides clear and wide-ranging advice on: Login to SharePoint to watch the webinar Careers in software development Gaming careers Cybersecurity Internet of Things (IoT) Digital marketing Prospects - what can I do with my degree? Tech Academia telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}