{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/what-is-a-graduate-job/time-out.aspx",
    "content": [
        {
            "p": "Taking time out after your undergraduate degree or postgraduate course can offer great personal and professional opportunities. You might take anything from a couple of months to over a year – how long isn’t important, it’s how you spend it. This page will show that taking time out is a valid option and provides inspiration on what you could do. Talk to an adviser Students and graduates tell us that they want some time out for one or more of the following reasons: There’s usually a ‘pick and mix’ approach for most students or graduates involving one of more of the following. It really depends on why you want to take time out. You could: From this summary, what do you think taking time out will involve for you? Read Helen's story about taking time out in Australia Read Josephine's blog post Whatever your reasons for taking time out, don’t feel pressured to have a plan sorted out before you finish your studies. There may be some people who might say that if you take time out, you will miss out on opportunities, employers don’t like graduates taking time out or that graduate schemes are only for new graduates. To address these in turn: Missing out on opportunities – for some training programmes or further study courses there are set application deadlines, so check out when the application period starts and finishes. If you’re abroad, have a look at your options below. Employers don’t like graduates taking time out – this just isn’t true. They will be interested in what you’ve done, why you did it and what you've got out of it but that’s to help them understand your suitability for the position. Graduate schemes are only for new graduates – employers will recruit recent graduates to their training schemes, usually up to three years after graduation. For some it’s much longer - the average age of new recruits to the Civil Service Fast Stream is 27 years of age. And don't forget, you can talk to us, come along to events and search for vacancies after you've graduated. Take a look at our alumni website and contact us by email, phone or through MyCareer. It really depends on when you go travelling and for how long. You may have a round-the-world air ticket or are only spending a few weeks or months overseas, for example, during a ski season, or working at a summer camp. Here are three options to consider: Find out more about application timelines for graduate roles. There are some deadlines for graduate schemes but many recruit all year round. For other graduate job roles, the employer will specify the deadline when the vacancy is advertised. If you're looking to spend some of your time out overseas, here are resources to help you explore what's on offer to you and what you need to think about. On our opportunities outside the UK page, you can explore the key issues to think about, information on passports and visas, and also where to look for vacancies. Go to our How do I find work overseas? pages to access GoinGlobal, an international careers database covering 42 countries, to find out more about the countries that interest you and job vacancies. You will need to log in to MyCareer to access GoinGlobal. Year Out Group - how to plan your time out, the benefits told from several viewpoints and opportunities There are many websites offering seasonal work. Anywork Anywhere Search for summer, temporary, gap year, casual and voluntary work worldwide This list of websites is not exhaustive and has not been verified by the university or the Careers and Employability Service. If you use a search engine for 'gap year providers' or 'temporary or seasonal work abroad', you will return hundreds of results. Some organisations have been around a long time and are well-known, and others less so. We've created a list of questions to help you to ensure the organisation is legitimate and meets your needs. What is the precise programme cost and what does it cover? How is the programme run and who is responsible? What exactly will I be doing? What are the meal and accommodation arrangements? telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}