{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/management.aspx",
    "content": [
        {
            "p": "Embarking on a management degree at Nottingham opens doors to a world of opportunities, preparing you for a dynamic career in business management, finance, or even launching your own startup. 87.80% of Nottingham University Business School undergraduates leap into graduate-level jobs or further studies within 15 months of graduation with an average starting salary of £30,195. Your degree means you'll have an understanding of essentials of the business universe, connecting the dots between organisations, their cultural fabric, and structural blueprints, all while mastering the art of management. You’ll also have insight into key areas like marketing, finance, operations, and communication. Not to mention, your skills in business strategy, sustainability, and the art of entrepreneurship. In addition to your subject knowledge your management degree equips you with key skills valued by employers: The graduate labour market has experienced significant growth in recent years, this was notable in the financial sector with increased vacancies in accountancy, professional services, IT and insurance. Growth in the banking sector was still disappointing resulting in a decline in the number of vacancies. These economic factors have impacted on those management studies students graduating in the summer, with more graduates entering the financial sector, and fewer entering the banking sector than in previous years. However, despite this highly competitive market, management studies graduates have secured professional roles in major companies and organisations. Top 10 companies Management studies students are highly sought after by a number of major companies including: Business management degree graduates find themselves in a diverse array of sectors, reflecting the versatile nature of their qualifications. Here’s a summary of the key industries where graduates typically go next: 1. Accountancy and finance: Roles such as financial analysts, investment bankers, and accountants. They contribute to fiscal planning and strategic financial management. 2. Consultancy: Providing expert advice on business strategy, organisational change, and operational improvements to client firms. 3. Marketing and sales: They develop strategies to promote products and services and drive revenue growth. 4. Human resources (HR): where they manage hiring, training, and development. 5. Entrepreneurship: Some graduates start their own businesses or work with startups, leveraging their business acumen to drive innovation and growth. Research graduate careers Prospects - What do business and administrative graduates do? Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates Nottingham Internship Scheme We advertise part-time, casual and temporary jobs on campus and with local businesses. Created just for you, the advertised vacancies can fit around your studies and other commitments. The vacancies are advertised in two places. On-campus jobs Off-campus jobs Through the completion of extracurricular modules, the Nottingham Advantage Award helps you develop key life and work-based skills and reflect on your experiences, allowing you to demonstrate your achievements and skills more effectively when applying for jobs Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a society or sports club - there's so many, you're bound to find one that interests you! Students' Union There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Students in Classrooms Undertake an exchange semester in another country and broaden your horizons. Talk to your tutors and find out more about the programmes available from the International Office. Exchange programmes Digital skills (sometimes called digital literacy) are vital for employability. Employers seek candidates proficient in tools like Microsoft Office (especially Excel) and data analysis software. They also include social media knowledge to coding too. Digital Marketing Academy Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}