{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/nursing.aspx",
    "content": [
        {
            "p": "Most nursing graduates find employment in healthcare. University of Nottingham's 2019/20 data reveals that 98.9% of Nursing graduates secured highly skilled work or further study within 15 months of completing their courses. Although many graduates start in NHS Trusts, some explore diverse healthcare settings and roles throughout their careers. This page, along with resources from the Royal College of Nursing and Health Careers website, provides valuable information to help you plan your future career. Book an appointment on MyCareer You might assume that nurses just work within a hospital setting, but you’ve probably also picked up from your course that the role of a Nurse can take into many settings. This opens up many exciting opportunities in terms of your career progression. As there are such a range of different roles and settings, it’s tricky to provide definitive ‘career pathways.’ Equally, opportunities are likely to be found locally, regionally, nationally and globally in many of the examples given here. Note the list we have offered is designed to provide an overview of some examples rather than all the available roles within nursing. There may also be some overlap in the following list depending on the host employer organisation: The vast majority of graduating nurses will start in band five positions as a newly qualified nurse, but after that, many different pathways will be open to you within the “four pillars of practice” (clinical practice, leadership positions, education and research). For example, you may continue and progress in clinical practice developing specialist knowledge or skills, or you may find yourself drawn to positions of leadership and management, others may move into more educational roles or research positions. The opportunities available to nurses are endless depending on your interest and ambitions to further develop or progress. While the following list has much cross over, we have grouped the following to give you a feel for the kinds of roles using the four pillars of practice. Working with certain client groups such as the homelessness, refugees, victims of sexual violence, teenage pregnancy, the elderly or with particular issues such as substance misuse, sexual health, stop smoking initiatives, diabetes, obesity, mental health and more. An example progression pathway from a band five staff nurse might be: Labour ward coordinator or manager, matron, consultant nurse, clinical governance, policy, commissioning, advisory roles (to Health Education England or Department of Health and Social Care for example). An example progression pathway from a band five staff nurse might be: Practice education, lecturing and teaching positions, nurse educator, clinical and educational mentor. An example progression pathway from a band five staff nurse might be: Clinical academic and research careers via opportunities such as lectureships and fellowships. An example progression pathway from a band five staff nurse might be: Registered nurses (and midwives) working in a public health role can apply to undertake an approved training programme in specialist community public health nursing (known as ‘SCPHN’). This can open up a range of further opportunities in areas such as Health Visiting, Occupational Health, School nursing and Public Health nursing as part of career progression. Most SCHPHN courses are offered at degree or master’s level. Find out more about entry requirements and further training using the following links. Some useful case studies and videos accompany the information available via these links. Case study – from child health nurse to school nurse and nurse to public health nurse Standards of Proficiency for Specialist Community Public Health Nursing In addition to your formal placements on your course, maximise opportunities to gain and develop your experience, which can provide a great addition to your CV and unique opportunities to sell yourself at interview. Find out more about gaining additional experience on our work experience pages Ensure you maximise all the support and help available to get the most out of your placements. So many student nurses reflect that their practice placements informed some of their most important future career decisions. For example, a student who said when they started their degree they were keen to pursue a role working in an emergency department. However, after reflecting on their volunteering experience in a women’s centre and some of their additional placement experiences which included A+E, they rethought their plans and went onto apply for nursing roles that focused on the healthcare of vulnerable women. This is a paid ‘sandwich year’ usually between the second and third year of the undergraduate course (or first and second year for graduate courses) with applications around April/May. Nurses, physiotherapists, midwives and sports rehabilitation students are invited to step off the course to spend 12 months as a paid university staff member to work on all sorts of exciting opportunities to develop their experience, employability and future career ideas. Read Amelia and Alex’s blog about their experience and what they gained from their internship 30 at 30: The Dean's Academic Health Sciences Internship. The Black Industry Connections and Empowerment Programme (BICEP) has been designed to help students expand their professional networks, meet inspiring role models and find empowerment in their university experience. As a student, the armed forces offer sponsorships and bursaries for university students. You can apply for subjects like science, technology, engineering, maths and healthcare. There are exciting ways to get experience of military life during your degree. While you're at university, you might also consider joining a relevant group or society to further your interests in military careers. Find out more about the armed services There are many opportunities both within university and within nursing organisations that you may consider being part of in order to further your learning and interests, for example: Access the excellent Just About to Graduate publication for advice on preceptorship, the NMC code of Conduct, Revalidation, Professional Indemnity and more If your role as a newly qualified nurse offers a preceptorship period, use the protected learning time and available support to help you develop the confidence, knowledge, skills attitudes and behaviours to practice as an accountable healthcare professional so that you are able to work effectively. Find out more about preceptorships: From tapping into a short online course to developing advanced clinical skills, engaging in regular CPD can offer valuable opportunities for development and can also help you to refine your career aspirations and direction. Regularly discuss opportunities with your employer as part of appraisal and development conversations and review what your professional body offers to source suitable opportunities. Revalidation is the method by which you will continue to renew your registration and remain fit to practice. There is a wealth of information about revalidation on the RCN website Developed jointly between the RCN and Health Education England, this excellent online resource is designed to provide you with a range of ideas about the varying roles that you can enjoy throughout your health and social care career. You can browse the different roles within clinical practice, leadership, education and research in order to gain a greater understanding of the skills and knowledge required as well as possible routes into these kinds of roles. In addition, there are sections on: RCN careers resources The Health Careers website hosts a comprehensive careers information section on nursing with many written and video case studies, and additional links and resources. It’s worth spending half an hour or so browsing through the information available, which may also help you to generate future career ideas to explore further. Simply visit the ‘explore roles’ section of the website and navigate to ‘nursing careers’ to view further information about different specialisms and just some of the roles you might consider as part of your future nursing career. The National Learning Disability Nursing Forum aims to recognise, promote and celebrate learning disability nursing and provides blogs, case studies and information about different areas of practice. Our website offers you some important and practical information to assist you in making career decisions and applying for jobs: Explore our choosing your career pages Find support for making applications Find out more about specific nursing (and midwifery) applications and interviews telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}