{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/social-research-and-think-tanks.aspx",
    "content": [
        {
            "p": "Social research involves planning, designing, conducting and analysing research projects on topics such as economy and business, environment, health and wellbeing, public services, politics and governance. Researchers may be employed on permanent or short-term contracts, depending on the organisation and size of project. You’ll use a range of methods including desk research, surveys, interviews and focus groups to gather data, and carry out analysis before presenting your findings. The findings from social research institutions can contribute to, and assess, social policy. Return to jobs list Book a careers appointment Typical employers of social scientists include large research agencies, such as Ipsos Mori, Kantar, and GfK. You could also work for a Think Tank. Think Tanks are small research institutes which have a specific focus for their research and advocacy, and are generally funded by charities or corporate organisations. In addition, social scientists work in the following sectors: Employers will expect candidates to have a detailed knowledge and experience of research techniques, including qualitative and quantitative methods, analytical skills, and project management skills. Postgraduate research, such as a masters, MPhil or PhD, is often sought after, for experience of collecting and analysing statistics and/or specialist knowledge. In addition, you will require: Employers will also expect you to have a keen interest in current affairs or public policy, and an awareness of issues relating to the research topic, or focus of the institute. At a recent webinar, we brought together a panel of UoN alumni with backgrounds or academic interests in the US. One of our speakers was Alice Lilly, who works for the Institute for Government, did her master's and a PhD in the Department of American and Canadian studies at UoN. You can jump to her input at 24 minutes and 31 seconds. Login to SharePoint to watch the webinar Many individuals in this field start work in research assistant roles, perhaps involved in collecting data for a particular survey. The National Centre for Social Research recruits survey interviewers throughout the year, and the Market Research Society has a useful job finder page. During your studies you could also look for opportunities to support academic researchers within your faculty – perhaps helping them with interviewing, data entry, etc. This will give you a useful grounding in the practical work involved. Involvement with the development and implementation of policy, perhaps through your department or the Students' Union would also be valuable. Join relevant societies (student membership fees are usually discounted) such as the Social Research Association or the Market Research Society. This will demonstrate your interest in the subject and allow you to make useful contacts. You can also join student societies relevant to your particular areas of interest. Some of the larger research institutions and think tanks offer internship opportunities so it is worthwhile visiting their websites to check what they have on offer, or to find their contact details in order to enquire. Reflect on any other experience you have too. For example, experience working in an administrative role, or in a team, even if it is not specific to research, could also be beneficial to build and evidence your transferable skills. You'll usually need a social science degree, for example in economics, politics, social policy, etc. For quantitative research roles, a subject with mathematical/statistical content will be useful. Some of the large research agencies offer graduate traineeships, for example, Ipsos Mori, GfK, as well as roles for more experienced social researchers. Smaller research companies might be more responsive to speculative applications, the Research Buyers Guide provides a useful list of organisations. Advertised vacancies in social research roles and think tanks can be found on jobs boards, for example Guardian Jobs, but the websites of individual think tanks and research institutes are the most common sources for vacancies and consultancy opportunities. Networking can also be a great way to hear about opportunities coming up, as well as being a useful source of information about the institute, or field you want to specialise in. Research potential employers carefully to understand their requirements in terms of completing a masters or PhD, and the skills and experience they are seeking, so you can tailor your application. Social Research Association Social Policy Association Smart thinking Economic and Social Research Council MRS - careers support Jobs boards and vacancies MRS Research Job Finder Guardian Jobs Civil Service Job Search telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}