{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/social-work.aspx",
    "content": [
        {
            "p": "A career in social work is grounded in issues of social justice, working with, and advocating for clients to ensure human rights are respected and protected. This can make it a very rewarding role that offers daily variety and the chance to make a real difference. With opportunities across the country and a focus on personal professional development it can be a graduate option worth exploring If you have questions about your plans, talk to a member of our team. Social workers are problems solvers, helping individuals, families and communities to have more control over their lives, protecting vulnerable people from harm and advocating for their rights. You could be the main contact for the client or be working as part of a multi-disciplinary team around the client’s individual needs which could include legal, health care and education professionals. Your day-to-day duties will vary depending on the client group you work with but could include: providing information and counselling; putting together support plans for clients; taking action to support a client's safety; holding meetings with clients to review their situation; working closely with communities and other agencies. You may be expected to work unsocial hours and evenings/weekends dependant on your role. You can become a social worker through a university course, apprenticeship or graduate training scheme. If your first degree is not in social work, you will need to complete a two-year postgraduate degree in social work. Applicants with undergraduate subjects related to the law, government, politics, social care, and social sciences will have valuable transferrable skills and knowledge to talk about in an application. Work-based training programmes are available to graduates with a 2:1 degree (or above) in a non-social work subject, combining postgraduate study with on-the-job training. These are currently offered by: You may specialise in a particular group, for example: the elderly; children/young people/adults with disabilities or mental health problems; offenders; people with addiction or substance misuse problems; asylum seekers/refugees; foster carers and adopters. Social workers can work in both statutory and non-statutory roles. In a statutory position, your role is to adhere and enforce the laws that exist to protect your clients. In non-statutory roles, often based in the charity or private sector, you may provide similar supportive interventions but are not specifically responsible for upholding the law. Social work is a profession where you will be expected to continuously keep your knowledge and skills up to date through training and conferences etc. Peer mentoring and supervision is often a requirement, especially in your early years, so you can learn from more experienced social workers and get support on cases. Progression is possible into supervisor and managerial roles which will often take you away from the front-line work with clients. You may also want to go into teaching or training roles. It is useful to make yourself familiar with the professional capabilities framework which sets out 9-levels of social work and the competencies involved, so you can plan your career and professional development. Think about the skills that are going to be highly valued for example: active listening; critical and creative thinking; communication; interpersonal skills; organisation and resilience and how you can develop these over the course of your studies. Gaining experience of working with the public, children and vulnerable groups is highly valued and will give you a better understanding of how to work with clients. You can do this in many different ways: Social work jobs are often advertised through local council and local authority websites so look for the one closest to you. In addition there are specific recruitment agencies that specialise in social work roles and gaining work through an agency can give you experience in a wide range of settings, although you’ll likely be working on short term contracts. Before you apply there are some specific eligibility criteria to be aware of: You can practice different types of recruitment processes through our events or by accessing Graduates First and ECareersGrad below. Understanding the current issues and challenges facing Social Workers is important if this is a career you want to pursue, so: telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}