{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/finding-vacancies/linkedin-and-online-presence.aspx",
    "content": [
        {
            "p": "Your online personal presence is the image you portray to others through your public profile online. This could be through social media platforms such as Facebook, Instagram and LinkedIn or the information returned by simply Googling your name. Thinking about our online identity is important. Creating a professional online presence is particularly key when applying for your next steps after university, but it is likely to be something you think about throughout your working life. Many employers will check out a candidate’s online presence as part of the application process or before making an offer. As well as using social media platforms to recruit talent, some studies estimate that as many as 80% of employers check out how candidates appear online before hiring. Read our blog: Your Best Digital Self In the last year, I have experienced the importance of having a LinkedIn profile. I attended some careers events and I found it was a way to connect with employers or professionals related to the field I was interested in. Claudia Medina Munoz, architecture and sustainable design student Read Claudia's blog post Many employers would expect to see a candidate on LinkedIn. LinkedIn is a professional networking tool where you can connect with individuals, groups and companies. More than 25 million professionals in the UK alone have created a personal profile that showcases their experience, knowledge and skills, which they then use to contact others. With more than 31 million companies on LinkedIn you can: In this video Luke Lynch, Employability Education Projects Officer, explains how you can make LinkedIn work for you and why this powerful networking tool is something you should be using right now. Connecting with employees of companies that you are interested in working for on LinkedIn can give you unique insights into what it is really like to work for them. Reach out and ask them for a virtual coffee, you’ll be surprised how many people are willing to have a chat, and it might open opportunities you weren’t expecting. But even if you don’t have the opportunity to meet anyone look into their career history, the jobs they have done, and companies they have worked for, this can give you an insight into the experiences that the company values when making hiring decisions. Find out more information about researching employers on our page. Watch the videos below for tips on how you can develop sections of your LinkedIn profile. Your professional headline is one of the first elements of your profile that LinkedIn users will see and so it's important to get it right. Find out from Hannah Woolley, Employability Education Manager, how to create a headline to capture attention. Are you using LinkedIn to make contacts and search for job vacancies? Then you'll need a strong personal summary. Hannah Woolley, Employability Education Manager, outlines the five steps to take to impress your audience. Businesses have been building their social media presence for quite some time and some employers will look at what potential employees are doing online. This means you need to do two things: Log out of all your social media accounts and then Google yourself. Use quotation marks to get more relevant search results and if you have a popular name add your location or date of birth. For example: \"Joe Thompson\" Nottingham. Identify which profiles are yours in the search results. What you see is what potential employers will see. Create a list of active profiles and decide whether you'd like to use them for professional or personal use. You may encounter some old accounts that need deleting. You don't have to use every social media platform professionally. If you want to keep some accounts for personal use, that's completely fine. Just protect your privacy. If Instagram is your scrap book of nights out, make your account private. Having a social life isn't a crime, but you don't need to expose it to potential employers. Same goes if you want to keep Facebook personal; check your privacy settings are set to 'Friends only'. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}