{
    "url": "https://www.nottingham.ac.uk/careers/postgraduate-researchers/exploring/development.aspx",
    "content": [
        {
            "p": "Even in the later years of their doctoral programmes, only around a third of respondents had definite ideas about their future careers, and about a fifth had little or no idea. What do researchers want to do? Vitae.ac.uk Ideally, your career planning should start in year one of your degree so that you’re not worrying about your future at the same time as writing up. Having said that – whatever stage you are at, there will be something you can do to make progress. In the end it’s down to you to take an active role in considering your future. Taking a step back to review and consider your options from a broader perspective will enhance the quality of any decisions you make. Here are the four steps to career planning. The first stage is to review what’s gone before. Ask yourself the following questions: The next stage is to take what you’ve learned about your motivators and your decision-making processes and consider if they were effective and have changed as you’ve matured. Would you apply then in the same way now, or would you approach things differently? Could my motivation to undertake a research degree be satisfied in roles outside academia? For example: in industry, education or government. Should I approach my career research differently this time? What else could I do? For example: build a useful network of contacts and seek out experts who can advise me. Have my influencers changed? For example: family members. By undertaking a placement, you will have the opportunity to gain an insight into a career as well as develop your skills outside your research. Not only could a work placement support your career decision-making process, it will add value to your CV highlighting your transferable skills and/or any new skills you develop. If you are interested in gaining work experience and developing your skills and knowledge alongside completing your PhD, this webinar gives a fantastic insight into how you can go about it. You'll hear from a postgraduate researcher who will share: Login to SharePoint to watch this webinar The next step is to acknowledge any practical barriers to your career research and decision-making and consider how they might be overcome. These might include: Workload, family or other commitments Recognise career thinking as valuable time spent and allocate some time to it, for example, find one hour a week for job ad surfing or LinkedIn profile development and commit to it. Fear or lack of confidence Look for career clues and use them to generate career ideas. For example, you might ask yourself: In the medium term, use your career planning time to research different career areas, make valuable contacts and look for opportunities to raise your profile in useful places, for example in social media discussion groups. Continue to review and reflect on your experiences, in and out of your workplace, so that you will be in a stronger position to recognise opportunities that might suit your strengths and interests, even if you have no idea yet of the job titles that might interest you. Consider booking a PhD career development appointment with one of our careers advisers to discuss your options. Please login to MyCareer to book an appointment. Some things you could do to generate initial ideas: Researching the roles and sectors that interest you will give you a more informed idea of what they involve. Consider the following questions: Our Career paths pages Prospects - explore jobs and sectors We offer a wide range of sector-based events in the autumn and spring terms. Speakers at our events are often Nottingham alumni. We also offer, in conjunction with the Researcher Academy, events targeted at research students; these also involve alumni speakers. Jobs.ac.uk - Download a career development toolkit for PhDs telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}