{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/working-in-film-and-tv.aspx",
    "content": [
        {
            "p": "The UK's film and high-end film production sector is expected to grow from £5.6 billion in 2021 to £7.7 billion by 2025, creating a demand for around 21,000 more crew members (ScreenDaily). Although London has traditionally been the center of the UK’s media industry, this has begun to change with some of TV's most popular shows, such as Peaky Blinders, Outlander, and Poldark, being shot regionally. Several new studios, such as Sky Blue Studios in Coventry and The Northern Studio in Hartlepool, are being constructed, and Littlewood Studios in Liverpool is under development. Although it can be challenging to get your foot in the door initially, the sector faces skills shortages in specific areas, such as technical and craft roles like cinematographers, set designers, and lighting technicians. Production roles are also in high demand, as well as VFX (visual effects) and post-production roles. There are many roles within the industry. The following resources provide an overview: The Royal Television Society provides an overview and information about the many jobs available in the TV industry. A helpful career map to the jobs available within editorial and TV production is available from ScreenSkills. ScreenSkills also has careers information on the job roles available in film and TV drama and unscripted TV. Common entry-level roles include production runner, programme researcher, and production administrator. Administrative or hospitality experience is beneficial as these roles demand transferable skills. In entry-level roles, you’ll be expected to work long hours, for example, ten-hour days. Showing enthusiasm and building connections can lead to further opportunities, as short-term contracts and freelance work are common in this sector. Success in getting a job depends more on your skills, enthusiasm, experience and commitment than the subject you have studied. Advertisements for production assistants often ask for excellent attention to detail, editing skills and good interpersonal skills for dealing with people e.g. guests on a show. These skills will vary though depending on the type of roles you’re applying for. Being well organised is helpful. Certain roles may require specific qualifications or training, so explore the job profiles that interest you on the ScreenSkills website. Trainee schemes do exist, but are very competitive and may apply specific diversity criteria. Examples include BBC production trainee scheme, Channel 4, and ITV. Check ScreenSkills and the BBC for details of current schemes. ScreenSkills currently advertises training schemes in high end TV and Creative Access also offer internships within the creative industries, sometimes including TV. The Production Guild run short courses for runners and admin staff which are very popular. Future Learn, The Royal Television Society and ScreenSkills provide online courses to familiarise you with different aspects of the industry. Many other websites listed in our Where to find opportunities section also have information on news and events including courses, which could potentially give you the opportunity to network. *Links to these scheme can be found below Some organisations ask you to pay them to access job vacancies. This is not necessary as the information is generally freely available. Water Cooler have an extensive list of websites where TV jobs are listed. Many jobs are not advertised, so you also need to make speculative applications and network with people in the industry. Increasingly, Facebook is being used to recruit runners. As well as the Facebook links below there are also Facebook groups around geographical locations like Birmingham, Bristol and Manchester, so if you are based in a specific location, it’s worth doing a search on Facebook for these groups. Sky – Early Careers Make an appointment on MyCareer and get our advice on CVs and covering letters as the sector prefers a concise targeted CV and well researched letter. Evidence of your passion and commitment will be looked for alongside skills related to the role you’re applying for. For further advice on targeting your CV to the television industry specifically, take a look at this helpful advice from The TV Watercooler website. Crew Directory from Filming in England provides a service matching CVs to opportunities they have and will also give feedback and guidance on your CV. At a recent RTS event, a talent manager offered the following guidelines. For further advice on targeting your cover letter to the television industry specifically, take a look at this helpful advice from The TV Watercooler website. A recruiter for a TV production company offered the following tips: Brush up on your essential professional skills and use your time at university to find relevant work experience where possible. Those in the industry require good organisational skills and the ability to work under pressure owing to it being a fast paced environment, often with long hours being worked Make sure you can evidence that you can do this. Recruiters seeking PAs often prefer those who have office or administrative experience or can demonstrate good attention to detail. Excellent communication skills are a necessity. Volunteering or working for a student society can help you develop some of these skills and the ability to work to tight deadlines. Brushing up on your administration skills including writing emails and being competent at using Microsoft applications such as Excel and Teams will also help equip you for your first role in TV. Online resources help you to hone your production skills, and platforms like YouTube and stock agencies enable you to host or broadcast your work for free. Developing a portfolio of work will provide invaluable experience and demonstrate to potential collaborators that you know your TV and are passionate about it. If you want to try your hand at scriptwriting start to collect scripts and write for Impact magazine. If you’re making films at University, then you could use TikTok or YouTube to showcase them. Another way to build your networks is by getting casual work as a crowd actor or 'extra', which will give you the chance to meet likeminded people, and get first-hand experience of a working film set. The university has several Students' Union societies which offer training and opportunities to gain hands-on production experience by working with like-minded people. These include the Film Making society which would be relevant if you are looking to work in film/TV drama. Visit the Students' Union's society pages for more information. You might also join the Creative Student Network where you may get to meet alumnus from film and TV. At a recent session run by the RTS, networking skills were strongly encouraged. Clearly when attending events in person you can practice your networking skills though meeting and talking to people in the industry. Be polite, professional and friendly and don’t forget to do your research beforehand. There is nothing worse than commenting on a TV show that you thought your contact produced, only to be told that they worked for a different production company! Joining film or TV related groups, gaining work experience and attending industry related events will expand your network. In Nottingham, the independent Broadway cinema hosts screenings, and film making training. The Royal Television Society runs numerous TV workshops and events. If online networking is more you style or a necessity then ScreenSkills offer mentors and are good places to meet people from the industry. Following people you admire on social media can work well. Again it is essential to do your research first. Those in the industry encourage persistence, but stress the importance of being polite and professional. Having a professional LinkedIn can be helpful, look at our webpages on building an effective profile or speak to a careers adviser. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}