{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/clinical/veterinary-nursing.aspx",
    "content": [
        {
            "p": "Veterinary nursing is the supportive care of animals receiving treatment within a veterinary practice. A veterinary nurse works as a member of the veterinary team, providing expert nursing care for sick animals. Veterinary nurses also play a significant role in educating owners on maintaining the health of their pets. They carry out technical work and are skilled in undertaking a range of diagnostic tests, medical treatments and minor surgical procedures, under veterinary direction. Return to the Vets homepage Book a careers appointment Veterinary nurses are not limited to working in one particular location or speciality when qualified; there is a comprehensive range of opportunities available. Depending on the nurse's interest, they may decide to work in general/first opinion-practice, which involves first-line animal care as well routine surgeries, nurse clinics etc. Some of these first opinion practices have their own out-of-hours which operate overnight care, including weekends and bank holidays. This service provides care for urgent, trauma and critical patients. Other veterinary nurses may wish to only use a specific skill set or be involved in specific veterinary departments. They may suit working in a referral hospital. These specialist hospitals may cover advanced surgery such as orthopaedics, ophthalmology, dermatology, and emergency critical care facilities such as ICU. Nurses may consider a less client face-to-face role and want to work in laboratories or research. Here, they are available to have a positive impact on projects and knowledge exchange. Veterinary nurses are great problem solvers, they have many transferable skills such as clinical auditing, and networking. This route may offer a better work/life balance with fewer invasive hours. Teaching is another career path for qualified veterinary nurses. Either in practice (clinical coaching of student nurses), or teaching student veterinary nurses at NVQ or diploma level, it's possible to also teach undergraduate veterinary students. Find out more about teaching with veterinary background There are different types of charity work available. Nurses can be employed by a charity such as the Blue Cross, PDSA and RSPCA. However, there is non-paid charitable work that nurses can undertake alongside working. Nurses can work with charities in England or abroad to assist with a multitude of charity corporations. Tasks may include vaccination clinics, neutering clinics, rehabilitation or conservation. Nurses can further their development and gain additional qualifications. These may be in clinical nutrition, anaesthesia, consulting, schedule three surgery or medicine. The day-to-day job of a veterinary nurse will vary but responsibilities may include: A key component of veterinary medicine is the ability to balance the care of the patient and the interaction with the owners. This requires a caring and empathetic approach. Often nurses are dealing with highly emotive situations. Specific scenarios where these skills may be needed are whilst performing euthanasia or dealing with presenting emergencies. Veterinary nurses work in an interprofessional environment and are required to work alongside a varied team. Teams comprise members of varying skills and knowledge. It is important that nurses have great team working skills and can communicate effectively. As part of the team, nurses are responsible for clinical audits, record keeping and stock management. Veterinary medicine is fast-paced and unpredictable and requires team members to adaptable. The vet will often delegate tasks to the veterinary nurses, giving them responsibilities relating to specific duties or the veterinary practice. The career role and working environment is often challenging. It's important that the individual is passionate and enthusiastic about their role. It requires dedication and pride. They are a valued member of the interprofessional team. Several universities offer the opportunity to complete a Foundation Degree in Veterinary Nursing (FdSc), or a BA (Hons) in Veterinary Nursing. The course takes three to four years and is more academic focussed. If you already have a degree you might decide that completing a Level 3 Diploma in Veterinary Nursing is the best training route for you. Undertaking the diploma is the quickest way to become an RVN. The Level 3 Diploma in Veterinary Nursing takes around two to three years and is a practical, hands-on approach. Level 3 Diplomas are offered on either a full-time basis or via an apprenticeship, where you will gain qualifications alongside your work in veterinary practice. Upon successful completion of the qualification, you will be able to apply to register with the RCVS. If you enrol on a full-time course, your time will be divided between that spent in the classroom and periods of training on placement (paid or unpaid) in veterinary practice. These placements will be organised by the college for you. As an apprentice, you will first need to find employment in an approved training practice and then attend college on a part-time or block release basis. You can obtain a list of training practices from the Royal College of Veterinary Surgeons. Training is quite intensive. A large proportion of this time will be spent gaining clinical experience in a training practice. You will be working under the supervision of qualified veterinary nurses and veterinary surgeons, learning how to provide nursing care and treatments in a range of different situations. You will be assessed throughout the course via theory exams, practical examinations, a work-based progress log and assignments. You will also be expected to undertake several hours of private study each week. Go to the RCVS Veterinary nursing pages for list of approved/accredited programmes Work experience should be easily accessible. Individuals should try and use a range of experiences, for example (but not an extensive list): Ideally individuals should observe and handle different species as this is what they are likely to encounter when training and qualified. It's important to be honest about the experience you have in these fields when on the premises, then the staff can tailor the experience you have. You are likely to have limitations on work experiences due to safety regulations and because of insurances. Stay open minded and patient as it’s a privilege to be able to attend and learn. Yes. Registered Veterinary Nurses from the UK are held with high regard around the world. The RCVS and BVNA regulations and training have high standards. Some countries have the equivalent positions but are not necessarily as well regulated, graduating in the UK can potentially place you ahead of other candidates when looking at working abroad. The UK Veterinary nursing qualification is a recognised qualification to practice in many countries, however, you may need to have your qualifications assessed by individual countries for equivalence in training or may need to sit additional national or state exams depending on the country’s regulatory requirements. In addition to researching whether your qualifications are recognised in your country of interest, you will also need to explore the various visa requirements and options to work. Our How do I find work abroad? webpages have resources to support those considering relocating to different countries. If a veterinary nurse chooses to top up a diploma/Foundation degree with a degree level BSc, they will be eligible to also be a Companion Animal Suitable Qualified Person Status (C-SQP). They can also pursue specialist interests in certain modules and projects. It enhances their skills in research and academic writing. By also completing the BSc, they can further develop their qualifications to higher levels such as a master’s or even a PhD. Registered Veterinary Nurses can also specialise in other areas, for example Physiotherapy, anaesthesia, advanced nursing, surgical, medicine and emergency critical care to name a few. Further information on how to enrol, find approved training practices and accredited qualifications in veterinary nursing Royal College of Veterinary Surgeons British Veterinary Nursing Association Lantra careers Animal Care job profiles Read the 'How to work abroad as a veterinary nurse' article Veterinary Nursing Journal “Vet nurses working in research” telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}