{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/law-enforcement-and-security/prison-and-probation-service.aspx",
    "content": [
        {
            "p": "The UK Prison and Probation Service employs nearly 22,000 people (England and Wales 2021) and can be a great career option for graduates, with a focus on continuous professional development, clear progression routes and opportunities across the UK. It’s a challenging and varied role where you can make a real difference to individuals and society. If you have questions about your plans, talk to a member of our team. The prison officer role is focused on offenders and balancing authority with empathy and enabling rehabilitation. The duties may differ slightly depending on the prison you are working in but will ultimately focus on ensuring a safe and healthy environment. You could be working in a standard prison setting or a remand centre, young offenders institution, open or resettlement prison. Full-time roles are usually 37-41 hours per week on a contracted and shift basis including some nights/weekends and public holidays. You will mainly be based inside with some patrolling in outside spaces. Longer term there are opportunities to take on greater responsibility for staff or do secondments to other services or headquarters/area offices throughout the country. You may get involved in specialist projects in the service for example rehabilitative work or working with vulnerable groups and their families. Or you may choose to take your experiences outside the service and onto policy or third sector roles. A probation officer works with offenders in courts, in the community and in custody, liaising with victims, police, agencies and prison service colleagues. You could be responsible for high, medium or low risk offenders carrying out reporting and risk assessments, ensuring community orders and court requirements are enforced, helping offenders reintegrate into society and reform their behaviours. You could work for the National Probation Service, a statutory criminal justice service or a private sector provider and duties will differ as a result. Full time roles are usually 37 hours per week and may require work outside of normal office hours. You may have an office base but be travelling locally to go to clients’ homes, court or meet with relevant agencies. Long-term there are opportunities to develop your leadership skills and move in to a team management position, taking you away from frontline work with offenders. You may also consider moving into specialist case management, approved programme units or prison work. The role is only available in England and Wales, Scotland and Northern Ireland have separate criminal justice systems. You can apply directly through the HM Prison and Probation Service for available roles. Once you have successfully completed the recruitment process you will attend 12-weeks of prison officer entry level training (POELT) to prepare you for the job ahead. The Unlocked 2-year Leadership Development Programme is open to graduates with a 2:1 degree or above that have not already gone through prison officer training. The aim is to develop leaders of the future for the prison service. You will receive a salary and be working as a prison officer, whilst also studying towards an MSc in applied custodial leadership which is fully funded. To qualify as a probation officer you’ll need to complete probation officer training lasting 15-21 months. To be eligible to apply you need a level 5 qualification (degree level) or above and relevant experience. More information is available on the HM Prison and Probation Services pages Gaining experience of working with the public for example volunteering with individuals or groups in the community such as sports coaching or youth groups, is a good idea and you can do this in many different ways. Skills that are valuable in these roles include: an ability to relate to people with sometimes challenging behaviours; to think on your feet and make decisions; to have resilience to cope with sometimes difficult and unexpected situations; an ability to work as part of a team but also autonomously; report writing and organisational skills. With this in mind, think about the types of extra-curricular things you could get involved in that would allow you to evidence these skills in an application. Relevant job boards include: Some prisons and probation services in the UK operate by private contract and are responsible for their own recruitment. Find a list of private prisons in England and Wales by searching on the GOV.UK website Before you apply there are some specific eligibility criteria to be aware of: The recruitment process usually involves a written application followed by some online tests and an assessment centre, which may include situational judgement, numeracy tests and competency-based interview questions. You can gain practice of different types of recruitment processes through our events or by accessing Graduates First and ECareersGrad. You will also need to undergo background checks such as security, identity, past employment and health. Understanding the current issues and challenges facing the prison and probation service is important if this is a career you want to pursue, so: telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}