{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/assessmentcentres/what-is-an-assessment-centre.aspx",
    "content": [
        {
            "p": "If you have been invited to an assessment centre, congratulations! You have made it to the business end of the recruitment process, where many employers make their final selection decisions. Assessment centres are made-up of activities designed by employers to assess candidates’ potential to fulfil the role. I was lucky enough to be invited to their assessment centre in-person. Although I wasn’t offered the graduate position, I was put on their reserve list and learned and gained a lot from the experience regardless. Rania Monasch, student Read Rania's blog post In this short video we'll cover an introduction to the types of activities you might be asked to take part in, when invited to an assessment centre. An assessment centre usually involves a series of tasks and activities designed to test your suitability for a role. Assessment centres can be held in person, at the employer’s offices or a central location, or online via video conferencing platforms. The number of candidates attending the assessment centre will vary according to the employer. It is important to remember you are being assessed against the employer’s criteria, not against each other. Stay focused on your own performance. The length and structure of assessment centres varies from employer-to-employer; some consist of a morning or afternoon of activities, whereas others last a full day - even longer in rare cases. The day will often begin with a welcome talk, followed by a tour or video tour before the assessments begin. There will usually be one or two assessments during the morning before a break for lunch when you will have the opportunity to socialise or network online with other candidates and possibly some employees. After lunch there will be more assessment tasks followed by interviews and final evaluations before the end of the day. Large recruiters will run assessment centres usually for graduate trainee positions. Employers use assessment centres as an opportunity to evaluate a pool of candidates against a set of criteria. It allows the assessors to see how candidates react to situations they may come across in the role as well as how they interact with those around them. There is a great variety of activities which employers could use to assess your ability to interact in a group environment, these can include; case studies, discussion exercises and ice breaker or team tasks. A work-related scenario in which you will be required to process and analyse information and communicate your findings or present recommendations either in writing or verbally. Make sure that you fully understand the brief and always justify recommendations made with evidence. It’s worth allocating time at the start of the exercise to plan the structure of your written report or presentation. A real world scenario in which you are judged on your ability to prioritise a number of tasks based on factors such as importance and urgency. In an interview, you'll be asked a series of questions by one, or a panel, of company representatives. Employers use a range of different question 'types' to help them draw out your experience, skills, knowledge and personal attributes, as well as your enthusiasm and motivation for the role. You might be asked to prepare and deliver a group or individual presentation. This could be on a topic provided by the employer or you might be asked to choose your own topic. For an individual presentation, you might be sent details in advance so you can prepare your presentation ahead, in order to deliver it on the day. Psychometric tests are typically done online, under exam conditions, and consist of questions designed to identify your skills, knowledge and personality. Employers use the results to check whether you've got the right skillset for a role, and also that you’ll be a ‘good fit’ with the company culture and values. You will need to process and analyse information relevant to the role before communicating your findings and recommendations in writing. Carefully structure your report and use business-formal language, unless instructed otherwise. Double-check your spelling and grammar before submitting. If you have a disability or health condition, you have the right to request “reasonable adjustments” during the different stages of the recruitment process, under the protection of the Equality Act 2010. These adjustments are intended to level the playing field, allowing you to showcase your abilities and talents without being hindered by barriers. Let your potential employer know as soon as possible that you require adjustments. You do not need to have a formal diagnosis to be eligible adjustments, but you will need to be able to explain what you find difficult, so the employer can make suitable adjustments. Employers may be able make adjustments to the assessment centre, such as allowing extra time or providing the format of the assessment centre in advance. In some circumstances, they may be able to provide an alternative. Go to our Disability and Accessibility in Careers NOOC Now you are aware of how a typical assessment centre is structured it's time to start researching to make sure you are up to speed with recent activities at the company. This will help give you the edge during decision making exercises and show the recruiters you are serious about the company. Remember to go back through the application and check the requirements of the role. Refresh your memory about what you can bring to the table, recruiters have selected you because they think you might be a good fit. Keep the key competencies of the role in mind and make sure to showcase these skills when completing tasks. For in-person assessment centres double check the start time and your travel arrangements. For online, make sure your device is fully charged/plugged in before you begin. Think about your environment; do you have a neutral background, reliable wifi, and somewhere where you won't be disturbed? Check any links the employer has sent you to ensure these will work on the day. If you have time why not book onto an assessment centre workshop? Find a workshop Or take our online course: How to prepare for assessment centres Try our online course Register for free Alumni? Email us for access. Each employer has its own list of desired skills or competencies, which they assess candidates against. These can include: After an assessment centre it’s a good idea to reflect on the tasks and review your performance. Here are some questions you could try, to help you reflect: Assessment centres are typically the final stage in a highly competitive process, so don’t forget to reflect on what you have achieved so far, and what you did well, as well as anything you want to improve. Talking things through can help process your thoughts and feelings. Speak to family members, friends, perhaps your tutor, and of course, do feel encouraged to make an appointment with us if you feel you would find that helpful. Contact the employer to ask for feedback (whether you were offered the role or not) as this will help you understand your strengths and weaknesses, and give you useful tips for your next application. Don’t forget that you can access further help from the Careers and Employability Service. Complete our short online courses, review the advice and tips on this page, or consider booking onto a mock assessment centre as part of our finding and making applications workshop programme. Receiving an invite for an assessment centre was a bitter-sweet experience as I was nervous just as much as I was excited to see the Warner Bros. Discovery office in Central London! But I was really glad to come out of it smiling as they made it a really comfortable experience for me. Khushi Dassani, student Read Khushi's blog post telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}