{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/cancer-sciences.aspx",
    "content": [
        {
            "p": "A degree in cancer sciences can lead to a diverse range of employment and postgraduate study opportunities. One of the main opportunities for students who study cancer science will be a career in research, either in industry or academia. Areas of research can focus on specific cancers such as breast, prostate or bowel cancer, or on broader areas in preventing, diagnosing and treating cancer. For example, The Institute of Cancer has eight scientific research divisions, which are breast cancer, cancer biology, cancer therapeutics, clinical studies, genetics and epidemiology, molecular pathology, radiotherapy and imaging and structural biology. Alternatively you may want to use your cancer sciences degree to work in areas that support scientific research, such as science policy or marketing. If you are considering a research career you may well undertake a PhD following your undergraduate degree. Studying a PhD may be possible directly from your first degree or after completing a relevant masters programme. If you have questions about your plans, talk to a member of our team. You may want to consider applying for the NHS Scientist Training Programme (STP). The STP advertises vacancies in January of the year you wish to start. One of the options available at the time of writing was cancer genomics. Healthcareers - Healthcare science Healthcare science careers page Pharmaceutical companies will undertake research into and manufacture of cancer drugs. Firms such as Roche, Bristol Myers Squib, Novartis, Johnson & Johnson, Takeda, Pfizer, Eli Lilley, Merck and Amgen manufacture some of the most widely used drugs on the market. As well as research & development they will recruit graduates to roles such as regulatory affairs, communications and government affairs, finance, commercial management. Information about pharmaceutical jobs The ABPI lists leading pharmaceutical firms within the UK many of which will offer graduate employment, summer placements and placement years. Medical research charities fund research in universities and start-ups. Cancer Research UK through their cancer research technology have funded 60 start-ups. Cancer Research UK also manages and supports CancerHelp UK which develops and maintains clinical trials databases such as The Experimental Cancer Medicines Centre Network Medical research charities funding cancer research CROs are companies that support pharmaceutical organisations amongst others to carry out clinical study and clinical trials for drugs and medical devices. Contract Research Map lists the research institutions in each country and the work they are currently doing. Biopharmguy is a good place to look for businesses involved in biotechnology and contract research. PHD opportunities (funded and non-funded) will be advertised throughout the year by universities, medical research charities, research councils and some pharmaceutical companies. Science degrees develop analytical, communication and numeracy skills and so there are many directions that a science graduate can take: Science and pharmaceuticals job profiles from Prospects summarise common destinations of those with science degrees who want to carry on using their degree, including There are also jobs such as teaching and education-related careers which draw on your scientific knowledge. Life science graduates enter a diverse array of roles spanning accountancy, actuarial work, banking, charity work, finance roles, legal roles, marketing, public relations, sales and so on. Explore a range of graduate roles During your course, as well as developing your laboratory expertise, you will develop competencies necessary to be a successful scientist, researcher, or to support whatever career you choose to follow. These competencies will be developed within the curriculum, and during any placement you choose to undertake. These skills are as follows: University Honorary Graduate, Professor Sir Steve Jackson delivered an expert guest lecture on ‘DNA repair: from mechanistic insights to new medicines.’ This lecture will provide students across cancer sciences and other science and life sciences disciplines the opportunity to consider and explore the breadth and impact of a career in research and innovation. He is the University of Cambridge Frederick James Quick Professor of Biology and Senior Group Leader at the Cancer Research UK (CRUK) Cambridge Institute. Login to SharePoint to watch the webinar Cancer Research UK The Institute of Cancer Research Prostate Cancer UK Bowel Cancer UK Breast Cancer Now British Association for Cancer Research Bone Cancer Research Trust European Association for Cancer Research The Royal Marsden Foundation Trust The Christie NHS Foundation Trust Cancer Research UK Cambridge Institute MRC Institute of Genetics & Molecular Medicine Ovarian Cancer Action telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}