{
    "url": "https://www.nottingham.ac.uk/careers/students/furtherstudy/studyabroad.aspx",
    "content": [
        {
            "p": "One of the benefits of studying abroad at postgraduate level is the opportunity to work with major world specialists in your subject. There are professional advantages to studying abroad, especially if the subject is specialised or particularly well resourced. In addition there is the experience that living in another country provides. Visit the applying for courses for advice Book a careers appointment You need to start carrying out your research early - ideally 18 months before the course starts. Many aspects of studying abroad are different to the UK, such as: Whilst academic postgraduate qualifications have an international value, you may need to exercise caution when looking at vocational courses as they may only be valid in the country awarding them. You may want to do some research into studying abroad either at the China or Malaysia campuses of the university, or through an exchange programme. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. In the USA, graduate degrees, known as master's degrees, are offered by about 1,000 colleges in various fields. These degrees typically take two to three years to complete, though some one-year options exist. There are two main types: Common types of master's degrees include M.A. (Masters of Arts) and M.S. (Masters of Science), involving self-directed study leading to a thesis submission. Unlike the UK, pure research programs are not common, instead, a blend of taught and research components is typical, with more frequent assessments. Admission to American master's programmes follow a process similar to the UK, requiring at least a 2:2 undergraduate degree from a recognised institution. However, conversion rates between UK and US grading systems vary by institution. To study in the USA, foreign nationals need an F-1 non-immigrant visa, requiring acceptance into a course and registration with Student and Exchange Visitor Information System (SEVIS). Application processes can be lengthy, often requiring 12 to 18 months of lead time. Language proficiency tests like TOEFL or IELTS are necessary for non-native English speakers. Regarding costs, studying in the USA is expensive, with undergraduate tuition ranging from $5,000 to $50,000 per year. Additional living expenses must also be considered. Public universities generally charge lower tuition than private institutions, with different rates for in-state and out-of-state students. Graduate programme fees vary widely by subject and institution, with financial aid available. Students, including international ones, can receive some form of financial aid, such as needs-based assistance, merit scholarships, or sports scholarships. The Fulbright Commission offers postgraduate scholarships for UK students. Once you’ve been accepted, apply for a visa. You will then register with the Student and Exchange Visitor Information System (SEVIS) and there is a fee for this. You will also need to make an appointment for a visa interview with the US embassy in your country. You'll need to bring the following: your passport, your visa application form and financial documents. The earlier you start this process the better. F-1 visas can be issued 120 days before your course start date. However, you won't be allowed to enter the US more than 30 days before your course start date. US visa requirements can be complicated so for a complete guide, visit the US Department of State - Student Visas. Association of Commonwealth Universities FindAMasters.com - international masters degrees across the continents FindAPhD.com - PhD study abroad Leverhulme Trust Study Abroad Studentships Postgrad.com Study.eu - universities and courses in the Europe Country-specific guides covering Austria and Brazil to the United Arab Emirates and USA, that provide information on courses, entry requirements, fees and more, are available on the following websites: Prospects The University of Nottingham, Ningbo Campus The University of Nottingham, Malaysia Campus Postgraduate studies in Hong Kong Fulbright Commission telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}