{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/psychometrictests/index.aspx",
    "content": [
        {
            "p": "Many graduate recruiters use psychometric tests and recent surveys show that this is a growing trend across large and small employers. Testing is not just confined to the industries you might expect, such as finance or banking, but are common across all sectors and career fields. Tests are coming earlier in the recruitment process, sometimes right at the start. Book an appointment with an adviser Darryl Giffts-Walker, Environmental Science graduate Read Darryl's blog post Employers often use psychometric tests to provide a measurable, objective assessment of a candidate's suitability for a job or training scheme. They are efficient at being able to deal with large numbers of applicants and are easy to administer. Many organisations use psychometric testing as a way of screening candidates to get to a further stage of the recruitment process. How do they work? In virtually all cases, tests are now computerised. They are mostly delivered in multiple choice formats and are timed. Your results are usually compared with how others have done in previous tests. Through Graduates First you can access a wide-range of resources: There are also a number of additional resources on the platform including: For each test, you are presented with a progress monitor as well as access to expert feedback reports. There is also a useful insight videos section which links to further information about how each organisation approaches its recruitment process and the kinds of assessments you may face. Over 100 videos are profiled on the site. In addition, an example recruitment process by a top employer will offer you a strong sense of the experience you can expect. Students - register for free access using your UoN email address Alumni - email our team for free access As technology develops, there is a wide variety of psychometric tests, but most will fall into one of the following categories: Sometimes also referred to as aptitude tests, these often include numerical, verbal and sometimes diagrammatical reasoning, spatial reasoning or error checking tests. These are the most widely used tests by employers. These are often about determining personality style or preference. There are no right or wrong answers. They typically address behaviour and distinguish between personality traits and types. Personality tests are being used more at the stage of the recruitment process to see if you 'fit' with the organisation's culture, values and so on. These are about your values, drive, energy and engagement. They may be used by an organisation to provide an understanding of what drives and motivates a person to perform effectively in work. These are often about assessing judgement skills and competencies in relation to challenging workplace scenarios.Tests may often involve ranking options or selecting the best to worst or the most important to least important options (for example, A to D or 1 to 5) These types of test tend to measure your knowledge of mechanical and physical concepts such as gears, pulleys, levers and circuits. Some of the questions may require basic knowledge of maths, fractions, ratios, percentages and averages. A candidates aptitude and/or personality traits are assessed whilst playing online games designed with the role and organisation in mind. Used by employers as an alternative to standard psychometric tests, they are easy to access and do not require any experience in playing games. If you have a disability or health condition, you have the right to request “reasonable adjustments” during the different stages of the recruitment process, under the protection of the Equality Act 2010. These adjustments are intended to level the playing field, allowing you to showcase your abilities and talents without being hindered by barriers. Let your potential employer know as soon as possible that you require adjustments. You do not need to have a formal diagnosis to be eligible adjustments, but you will need to be able to explain what you find difficult, so the employer can make suitable adjustments. Employers may make adjustments to the process, such as allowing extra time, or in some circumstances, provide an alternative. Go to our Disability and Accessibility in Careers NOOC We can adjust the time available to you for taking practice tests on Graduates First (see above). Please contact your faculty Careers team for more information. AssessmentDay.co.uk Psychometric and aptitude tests JobTestPrep.co.uk Situational judgement and others Practiceaptitudetests.com Numerical, verbal, diagrammatic and situational tests PracticeReasoningTest.com 12 types of psychometric tests PsychometricTest.org Free situational judgement tests PwC eLearn software Numerical, verbal and inductive reasoning tests SHL.com Various example questions targetjobs Graduate Benchmark Some people are worried more by numerical tests than anything else, but in most cases you will not be expected to have any mathematical knowledge beyond GCSE. National Numeracy Challenge Assess your maths ability with a diagnostic test BBC Bitesize Practise your KS3 maths Mathcentre Practise your math skills if you've not used them for a while Numeracy Skills for Employability and the Workplace Free online course developed by Loughborough University telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}