{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/careers-using-languages.aspx",
    "content": [
        {
            "p": "Language skills are valuable in today’s world where a global mindset is highly prized. Learn more about the diverse career options that linguists enter from translation to marketing. Whether you are studying languages or have languages skills from other experiences, you will be able to apply your skillset to a range of careers. Language learning opportunities Advance your career prospects and widen your horizon by learning a language alongside your degree (even if you are not a languages student). The Language Centre offers nine languages, from beginners right through to advanced. Depending on your course you can study a language for credits towards your degree, at an evening class or take it as part of the Nottingham Advantage Award. Find out more about how you can learn a language Return to A to Z list Book a careers appointment Check out our events Search for vacancies and internships You need to decide whether you want a job where languages are central to the role. These include teaching, translation and interpreting. Even in such careers, having the language skill alone is not the only factor, as each of these requires a range of other skills and qualities. Read Grace's blog: Languages: Options You May Not Have Known Were Available to You Interpreter- job profile Teaching Translator - job profile Practically any sector, company and role might require language skills if it is necessary for its operations: The language recruitment agencies in this section below advertise vacancies like these. Bear in mind though that language skills will seldom suffice by themselves; they are usually required together with sector or role-related competencies. In other cases, they might be desirable rather than essential. It is worth noting that even if you aren’t using the target language, a role or company might want someone who has an understanding of different cultures or who has lived elsewhere to help them understand different customs and practice (both within Europe and beyond), without necessarily the need to speak a foreign language regularly. This is where the breadth of your degree comes in, especially your time abroad where you might have been surprised by small but significant differences. As mentioned earlier, 70% of jobs requiring a degree is open to any discipline, so try researching different areas. Recent graduates with language skills have gone into roles as diverse as: Research graduate job roles Another way to immerse yourself in a foreign language is obviously to live in the target country - visit our working abroad pages. Many people start this process by teaching English abroad. Working abroad Teaching English as a foreign language The Unexpected Avenues of Modern Languages Interested in putting your language skills front and centre? Hear from a panel of professionals who are using their language skills in a wide range of roles. They provide an insight into their role and using their languages plus advice on how to enter these fields. Speakers: Login to SharePoint to watch a recording of this event Here are some examples of recruitment agencies which specialise in a range of sectors and roles where there is a language requirement such as: personal assistants, sales, finance, transport and customer service Top Language Jobs Indeed - you can add key words such as Spanish-speaking and location GoinGlobal - an international careers and jobs database covering 42 countries - log in to MyCareer to access Institute of Translation & Interpreting – advice and groups International Association of Conference Interpreters TARGETjobs - Using your language skills GCHQ MI5 telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}