{
    "url": "https://www.nottingham.ac.uk/careers/students/furtherstudy/sources-of-funding.aspx",
    "content": [
        {
            "p": "Finding funding is a priority for many postgraduates. The University of Nottingham’s postgraduate funding page should be your starting point as this information is relevant wherever you study within the UK. They have a step-by-step guide to follow with links to help you find funding. Funding for masters and research courses This online guide provides alternative sources of funding - especially charities - which can make awards (fees, maintenance, research costs) to any student regardless of subject, or nationality. It contains a huge database of funding opportunities, comprehensive guidance, and numerous tools to help you prepare a winning grant application. We have purchased a licence for the guide so it’s free to Nottingham students, staff and alumni (see opposite). In 2023-24, UoN students or alumni won 51 awards to the value of £117,755. Since 2018, the value of awards won by UoN students or alumni is £853,113. Free webinar for UoN students and graduates Dr Luke Blaxill from GradFunding held a webinar on how to apply for funding through charities and trusts. Luke also covered more traditional sources of funding for masters and PhD study. This is an excellent session on all aspects of funding. Students: Login to Careers SharePoint site using your University of Nottingham email address to watch the webinar Alumni: Email us to provide access to the webinar Read this blog on applying for funding Students: Log in via MyCareer Alumni: Log in via MyCareer Association of Charitable Foundations (ACF) Information about grant-making trusts and charitable organisations Chevening The Government's scholarships award scheme for developing future leaders, influencers and decision makers across the world Commonwealth Scholarships Access to Commonwealth scholarships, including contacts and national agencies FindAMasters.com scholarships A chance to receive up to £6,000 towards your masters FindAMasters.com Postgraduate Loans Scheme The Government's UK postgraduate loans scheme FindAPhD.com scholarships Every year, Find A PhD awards £6,000 in scholarships Leverhulme Trust Study Abroad Studentships Supports study or research for 12-24 months anywhere outside the UK or the USA Prospects Database on scholarships, bursaries, and research councils Turn2us Information on benevolent funds, grants and charitable trusts Find out more about getting a part-time job to help fund your studies telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}