{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/interviews/questions.aspx",
    "content": [
        {
            "p": "Interviews will vary from employer to employer, but it is likely that your upcoming interview will include a selection of the following types of questions. To help you to prepare for the interview, explore the different types of interview questions below, with our tips on how to answer them. Return to the main interview page Book an appointment with an adviser Attend an interview skills workshop Generative AI could be a useful aid to your interview preparation. If you put a job description into Generative AI with a prompt for it to give you a list of interview questions for the role, it will prepare potential interview questions that you can then practice answering or even better, ask a friend to practice interviewing you. You could also use Generative AI to provide feedback on your answers to these mock questions. However, it is worth also practicing with real people and out loud to get a real sense of how you answer questions and how you feel in an interview setting. If you do choose to ask Generative AI to help you with your interview preparation, always remember that it does have limitations. Some of the information it produces may be inaccurate or outdated, so ensure you verify any facts and apply your own critical view to its suggestions or answers. Read our blog on using ChatGPT in job applications This is a motivational question and it is likely to be one of the first questions you will be asked. The interviewers want to assess your motivation for the job role and organisation. Examples include: When answering motivational questions, be as authentic and honest as possible and relate your motivations to the job and the organisation you are applying for. In your answers try to highlight two or three key points, you don’t need to cover everything that you think would be good about the role. Focus on these key points and provide specific evidence from your research that shows how and why these points are important to you. You may also be able to relate these points back to your own previous experience giving you another opportunity to highlight your suitability for the role. Check out eCareersGrad, Shortlist.Me and the CAMP technique for healthcare interviews for more support answering motivational questions. Go to our online interview resources Employers are keen to find out about the skills and experience that you bring to the role. They may just ask the question as simply as: Alternatively, they may ask questions based around the competencies they are looking for in new recruits. You can find the competencies in the job description, the person specification and on the employer’s website. Competency-based questions aim to explore you skills within a specific context. Common skills assessed using competency-based questions include: communication, problem-solving, teamwork and leadership. Some examples include: When answering competency-based questions you need to think about the real life experiences when you have demonstrated the skill. It could be from past work experience placements, volunteering opportunities or extracurricular activities. Questions can relate to past failures as well as to past achievements so try to focus on what you have learned from past experiences positive or negative. Use eCareersGrad, Shortlist.Me and the STAR technique on our interview resources page: These interview questions assess your values, behaviours and attitudes, rather than your skills and experience. They assess how your past behaviours inform the person that you are, how you deal with future decisions and how your values and beliefs will fit in the wider team and organisation. Some examples are: When answering behavioural or values-based questions try not to think too deeply, think about your behaviours and values as competencies and how you are going to get these across to the interviewer. Instead of the situation think about the context giving solid examples. Use the STAR technique to help with answer these questions. Situational interview questions will provide you with a scenario, whether real or hypothetical, that you will have to respond to. They assess your transferable skills such as your time management or problem-solving skills and allow you to share your thinking process and how you respond to change. Examples: Use eCareersGrad and Shortlist.Me plus the STAR technique or for medical related interviews, SPIES on our resources page. Additional consulting examples: Bain & Company Boston Consulting Group (BCG) Oliver Wyman Rather than looking at the past, strength-based questions focus on the future and your potential within the organisation. They assess what you perform well in and what energises you and is therefore hoping you will enjoy your role. A lot of research shows that if employees are playing to their strengths, they are likely to be more productive and fulfilled. Examples include: Strength-based questions don’t have a right or wrong answer. Be as authentic and honest as possible and use your research as it is likely that some questions will be close to values-based questions. If you are being asked about your weaknesses, explain how your strengths compensate for them and what you are doing so that it does not impact on your performance. Use eCareersGrad, Shortlist.Me and the STAR technique. Find out more: Depending on the job you are applying for, you may get some questions around your knowledge, your technical or clinical skills. These questions may fall into different categories such as: To help you stand out when answering knowledge-based or technical questions, consider the following: Being honest in your answers is always the way to go. It's better to say that you don’t know than to try to make up an answer. However, you can still use this opportunity to show positive qualities, such as integrity and problem-solving skills. You could explain any further or similar information that relates to the question or explain how would you find the information you need. For example: Use the STAR technique or SPIES technique for healthcare interviews. Find out more: This type of question focuses on your commercial awareness. The interviewers will be assessing your understanding of the organisation and the industry or sector they operate within. Some examples include: Use the research you will have done before your interview and explain why you are focusing on specific aspects of your research. Don’t just regurgitate what you have read, explain what it means to you, the role and the organisation. Use eCareersGrad and Shortlist.Me to help with these types of questions. Curve ball questions don’t seem to be related to the role at first, their aim is to assess your creativity and how you think under pressure. There are no right or wrong answer, just share your thinking process! Some examples: Think about how you want to answer the questions, rather than what you answer. Show your creativity and highlight essential skills that the employer is looking for whilst also revealing a bit about your personality. Top resource: curve ball questions for interviews At the end of your interview the interviewers are likely to ask if you have any questions for them. Therefore, it is worth spending some time preparing a few questions that will: This isn’t the time to ask about a particular week’s holiday or to negotiate salary, these conversations would come when you are offered a role. Think about asking questions that will give you additional insights into the role, the team, the culture, their expectations, plans or challenges. Your questions should not be easily answered by a quick look at the company website, as your interviewers will expect you to have looked there first. For some inspiration on types of questions you might like to ask: targetjobs - What questions should you ask in a graduate interview? Prospects - 7 good questions to ask an interview Use eCareersGrad's interview success module available on our interview resources page: telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}