{
    "url": "https://www.nottingham.ac.uk/careers/employers/events/index.aspx",
    "content": [
        {
            "p": "We're keen to develop innovative ways for you to engage with our students as well as offering the simple, yet effective, options of attending our career fairs or holding a recruitment presentation. Whether you have vacancies to fill or want to raise your company's profile amongst our student population, we have an option for you. Want to do something a little different? Talk to us and we'll work out how we can help to achieve your goals. Our Recruiter Services team is ready to answer your questions. +44 (0)115 82 32233 We organise a number of general and sector-specific careers fairs throughout the year so you can attract a wide range of students or target certain disciplines. Our fairs attract local, national and international companies and organisations, all with one aim: to recruit our high-quality students and graduates. If you're interested in attending our fairs, get in touch with us three months before the fairs take place. Here's a quick timeline: There is a charge for exhibiting at a fair and our team can provide you with all the details. Please email or contact them by phone. Check out our recruitment and careers fairs Do you want to raise awareness of your company with our students? A presentation is a good starting point as you can provide an overview of your company, career opportunities and the application process. It also gives the students a chance to speak to you directly. Presentations last between one and two hours with the chance for informal networking. Most employers hold events in the autumn term, however, booking a spring term event may offer greater exposure as there are fewer employers on site. We do not hold events during January and the summer term because of exams. Do you want to share your company's expertise with our students, for example, proving advice on acing an interview, how to use LinkedIn successfully or developing a key employability skill such as commercial awareness. The aim of a workshop is to provide an employer's expertise on the topic chosen rather than a promotional opportunity for our company. Of course, you will be providing the information and advice from your company's perspective but these sessions are focused on developing our students' employability skills. Get in contact to chat about the topics that might interest you. Find out about the different options to raise the profile of your company on campus. As well as speaking to a member of our team, please check out our terms and conditions if you're looking to book an event with us. telephone: +44 (0) 115 82 32233 fax: +44 (0) 115 951 3679 email: recruiterservices@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}