{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/classics.aspx",
    "content": [
        {
            "p": "Did you know that 86% of graduate employers are interested in abilities rather than specific degree subjects* Studying classics, classical civilisation and ancient history can open up a huge variety of career opportunities. You will develop skills and abilities that make you very versatile in the graduate job market and over the years, graduates have pursued varied career pathways ranging from heritage to finance. Learn more about your career options and how we can support you on your journey Book an appointment Check out our events Search for graduate jobs or internships The skills gained from studying classics subjects are transferable to a wide range of areas which means that graduates can, and do enter a diverse range of roles and sectors. A classics graduate typically will have the following skills: It is important that you can talk about these skills on application forms and in interviews. Many graduate employers will recruit students from any discipline into a wide range of careers and classics students are well placed to be very competitive in the job market. In the past few years, classics graduates who seek employment have found themselves in a diverse range of roles with major employers and professions. Examples include: It is true to say that many classics graduates (and other subjects) take some time building their career through a series of roles to get to a specific career where they want to be or even to decide what job suits them. This could be due to a variety of reasons for example: the sector they want to enter requires an entry-level position (for example: heritage, media roles and publishing) or they are saving up to fund a postgraduate course or travel and therefore their first destination is a stop gap. Career paths - explore roles and sectors Prospects - for career options and job profiles Around a third of graduates leaving classics courses enrol in further study within six months of graduating. Some study higher degrees in classics and related areas while others take vocational training courses to enter professions such as teaching, health and law. Postgraduate study or training can allow you to: It's important to understand your reasons for studying at postgraduate level and to research opportunities and the value of postgraduate study in your sector before applying. Masters funding is available (eligibility criteria exists) in the form of a postgraduate loan, but you can only access this funding once hence the importance of choosing your course carefully. If you'd like to talk this through with an adviser, arrange an appointment to speak to us. Careers blog: Thinking About Postgraduate Study? Find out more about further study The opportunities listed are primarily aimed at current students living in the Nottingham area. If you are well into your final year, graduated or are no longer in Nottingham, you can access work and volunteering options in your home area. Depending on your location and what you want to do, your strategy to develop your skills and experience may vary. You are welcome to have a chat with us, so just arrange an appointment. Depending on what area of work or role you might be interested in, and where, there will be specific strategies, from speculative applications to formal processes you need to be familiar with. Work experience - what, how and when We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge The Nottingham Advantage Award offers interesting extracurricular modules to develop and reflect on your employability. With over more than 200 modules across our three campus in the UK, China and Malaysia. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. Alternatively you could get involved in a group or sports club - there's so many, you're bound to find one that interests you! Students' Union There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Working with young people Undertake an exchange semester in another country and broaden your horizons. Talk to your tutors and find out more about the programmes available from the International Office. Exchange programmes You can now undertake an optional placement year as part of your degree at the end of your penultimate year of study. The placement can be aligned to your degree discipline or related to your career aspirations. Speak to a career adviser or your school for more information. If you are no longer at Nottingham, you can access work and volunteering opportunities at home. Depending on your location and what you want to do, your strategy may vary so come and speak to us or arrange a telephone appointment. Digital skills are highly valued by employers and essential in many career fields, including advertising, publishing, marketing, and general commerce. They range from social media to coding and will definitely enhance your employability. There are various ways to develop your digital skills whilst at university. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. We can help you with all stages of the application, from reviewing your CV and/or application form to interview coaching and assessment centre practice. Many graduate recruiters also use psychometric tests during the recruitment and selection process. They are common across all sectors and career fields. Practise will really help your performance. Once you have looked at our application pages, why not book a one-to-one appointment and discuss your plans with one of our advisers. Expert advice on making applications Use our example tests Speak to an adviser telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}