{
    "url": "https://www.nottingham.ac.uk/careers/team/diane.allen",
    "content": [
        {
            "p": "Research Repository All Output Person Project OUTPUTS 46837 PEOPLE 3835 FACULTIES, SCHOOLS & GROUPS 328 PROJECTS 0 The Repository@Nottingham is intended to be an Open Access showcase for the published research output of the university. Whenever possible, refereed documents accepted for publication, or finished artistic compositions presented in public, will be made available here in full digital format, and hyperlinks to standard published versions will be provided. See our Policies for further information. Research Outputs People Faculties, Schools & Groups Research Projects The enigma of journal impact factors (2024) Journal Article Lobo, D. N., & Neal, K. R. (in press). The enigma of journal impact factors. British Journal of Anaesthesia, Improving patient flow - Ethnicity and socioeconomic status are associated with delayed discharge from hospital in patients with Covid-19 infection Background (2024) Journal Article Fogarty, A. (in press). Improving patient flow - Ethnicity and socioeconomic status are associated with delayed discharge from hospital in patients with Covid-19 infection Background. Journal of Research in Nursing, High resolution 3D printed biocatalytic reactor core with optimized efficiency for continuous flow synthesis (2024) Journal Article Attwood, S. J., Leech, D., He, Y., Croft, A., Hague, R. J., Irvine, D. J., Wildman, R. D., & Pordea, A. (2024). High resolution 3D printed biocatalytic reactor core with optimized efficiency for continuous flow synthesis. Chemical Engineering Science, Article 121156. https://doi.org/10.1016/j.ces.2024.121156 3D printing has the potential to transform biocatalytic continuous flow reactor technology, where precise control of topology is essential for maximizing reactor performance. By embedding enzymatic catalysts in polymer hydrogel networks, continuous s... Read More about High resolution 3D printed biocatalytic reactor core with optimized efficiency for continuous flow synthesis. Exploring soil erosion in the lake basins of Michoacán, Mexico: From sediment cores to conservation policies (2024) Journal Article Aguilera Lara, J., & Metcalfe, S. E. (2024). Exploring soil erosion in the lake basins of Michoacán, Mexico: From sediment cores to conservation policies. Journal of Quaternary Science, https://doi.org/10.1002/jqs.3676 Understanding soil erosion, its history and links to potential drivers such as land use (particularly agriculture and deforestation), different cultural perspectives and climate change are crucial for the development of effective management and conse... Read More about Exploring soil erosion in the lake basins of Michoacán, Mexico: From sediment cores to conservation policies. Specialist clinical pathways in audiology services for adults living with coexisting hearing loss and dementia: a scoping review protocol (2024) Journal Article Wenje, S. M., Calvert, S., Henshaw, H., Spriggs, R. V., Dening, T., Hendron, E., & Heffernan, E. (2024). Specialist clinical pathways in audiology services for adults living with coexisting hearing loss and dementia: a scoping review protocol. BMJ Open, 14(12), Article e087418. https://doi.org/10.1136/bmjopen-2024-087418 Introduction: Both hearing loss and dementia are associated with ageing, and it is thought that many individuals living with dementia also live with hearing loss. Despite the large comorbidity between these two disorders, there remains a clear lack o... Read More about Specialist clinical pathways in audiology services for adults living with coexisting hearing loss and dementia: a scoping review protocol. Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}