{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/writing.aspx",
    "content": [
        {
            "p": "Writing comes into many more careers than you might expect. It can form part of a huge range of roles, so consider whether you want it to form some of, or pretty much all of your job. When thinking about writing careers, for many it’s tempting to think of novels, film/TV scripts and journalism, but writing could also come into many topics and purposes including: policy documents for government; writing bids to secure extra funding at a museum; marketing brochures for a kitchen; or webpages for any kind of organisation. Some ‘writing’ roles can be called something else. Content is a term used in job titles which involve social media, blogs, websites and so on. Often jobs with the word ‘communication’ in their job title are likely to involve some sort of writing. Book a careers appointment Check out or events Search for vacancies and internships Many of the roles described in the section below can be found in a range of organisations, across most sectors, including education, charities, government, and commercial enterprises. You could be employed ‘in-house’, working directly for a company or organisation, or in an agency that supplies written content to other organisations, for example a marketing agency. Creative writing roles are typically freelance in nature, meaning that you will not get a regular income with holiday pay and so on. This can include scriptwriting, screenwriting,and some areas of journalism. It is said that around 6% of authors live entirely off the proceeds of their published books, and this can have taken a number of years to achieve. Therefore, consider whether this somewhat precarious earning potential is something that you want, and/or whether you want to try out while working in another field at the same time A lot of people like the idea of ‘creative writing’. Although this might seem like a strange question, the word creative has a different a meaning depending on who you ask. For example, it could mean a piece of literature which is original in content and style or finding a creative strap line in an advertising campaign in order to promote a product or service. Even in roles that seem more ‘creative’, where you want to have your own voice, you may be surprised at the editing process. For example, in many areas of journalism, you are writing for a specific audience and the editing process may alter the content, tone or style of what you have written. Novelists can also be advised by editors to alter, for example, parts of a plot or character development. In advertising and marketing, a client may have a particular brief, audience and budget that limits the scope of what you are able to do. Alternatively, you may find yourself in a role that is not in a traditionally ‘creative’ industry, for example engineering or pharmaceuticals, but have scope within your role to write stories or articles for a range of purposes, such as marketing and PR, research, corporate social responsibility and so on. Despite writing being at the forefront of your interests, as mentioned above, there are different types and styles of writing for different purposes and audiences. Some graduates find that they are better at or more interested in some of these than they thought. In addition, as with many other careers, other skills come into play. When journalists are asked about the most important skill they need, they rarely say writing, but often cite curiosity, as their number one quality. This is vital to find stories and encourage people to speak to you. Even authors often have to promote on social media, build networks, do book talks and fairs, especially when getting established. Digital skills are often a key part of writing roles, whether this is use of social media, writing with a web language, being able to work across various digital media. All writing has an end user or audience and this will determine how, what and when you write. Some audiences are wider than others both in terms of volume and demography. Explore different styles, audiences and purposes for your writing to build your portfolio, and hone your ‘voice’ and areas of interest. As well as your academic writing look for other opportunities, such as the student magazine, producing your own blog, submitting articles to local and national newspapers, and look for writing competitions and schemes designed to give those starting out an opportunity to be published. Writing exists in many roles, so you can gain experience in writing from a very broad range of work and work experience from part-time jobs to volunteering. Reflect on some of the points covered on this page in terms of the subject matter you are interested in, the type of writing, for example creative or to a set brief, and the roles and employers available. From this you can identify possible companies or organisations to research in order to see what work experience is offered, or to contact direct. At Nottingham you can also develop related experience and skills through participating in: These opportunities could provide you with the experience of writing for a variety of purposes from reports and blogs to reflective pieces. The following roles include considerable amounts of writing. When thinking about the role that would suit you, consider your specific interests. For example, if you are passionate about a hobby or activity, then you might want to write for a specialist journal or magazine. If you feel strongly about certain causes, then contributing to policy documents, or producing content to help fundraise for a charity might be for you. If you are excited by the latest technology and media, then social media content or podcasting could be something to explore. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}