{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/education.aspx",
    "content": [
        {
            "p": "A qualification in education can lead into a wide variety of roles whether directly related such as teaching, outreach or working in higher education or using your transferable skills into a wide range of sectors such as marketing, charities or business. Whatever your chosen career path, you’ll come out with a wide range of skills and experience that make you a valuable candidate for your chosen field. Talk to an adviser Check out our events In addition to your subject knowledge your education degree equips you with key skills valued by employers: An online workshop to explore your options and what is possible with an education degree. Discover the career routes you can take with your subject-specific and transferable skills. Speakers: Login to SharePoint to watch the webinar https://uniofnottm.sharepoint.com/sites/CareersandEmployabilityService-CurrentStudents/SitePages/What-can-I-do-with-my-education-degree-.aspx Education graduates enter a wide range of professions. While some of those professions are directly related to education, many are not. For roles related to your degree you might consider a career working with young children or teenagers, in an educational setting, a charity that is involved with the support of young people’s lives or even a role that allows you to be involved in the policy or administration of education. The types of roles that exist include within those career areas include: In an education setting Working with children or young people and families Roles that require further training However, a degree in education can give you many transferable skills that can lead into a wide range of careers such as marketing, HR and business management. If you would like to gain some work experience in these areas please look at our career paths pages for tips and guidance. Graduates with an education degree can access a wide variety of careers from teaching to graduate schemes and other sectors, depending on work experience and interest areas. Previous graduates have gone on to work for organisations such as Educational Academies, County Councils, the NHS, Civil Service, creative and more. However, some graduates will go into careers unrelated to education including marketing, HR, law, finance, journalism and many more. To explore different career areas take a look at our Career paths pages. Career paths - Explore graduate careers Prospects - What can I do with an education degree You may wish to pursue further study at the end of your degree, there are several options from Nottingham: Other courses available include Psychology conversion (for Educational Psychology routes), business qualifications and Social Work There are many ways that you can develop your skills to support job and course applications in the future. Gaining experience in a role through a summer internship or speaking to someone in that role that can help you to form ideas and opinions about where your future lies. Faculty of Social Sciences - Placement Programme Work experience - what, how and when Explore work experience in a remote setting through organisations who offer virtual or simulated activities. For example, Forage We work closely with a huge variety of local and national businesses to bring you an exciting range of internship opportunities, for both current students and recent graduates. Nottingham Internship Scheme The Nottingham Consultancy Challenge offers the chance for you to gain hands-on experience of managing a short term project for a local business or charity as part of a multi-disciplinary team. Nottingham Consultancy Challenge The Nottingham Advantage Award offers interesting extracurricular modules to develop and reflect on your employability. With over more than 200 modules across our three campus in the UK, China and Malaysia. Nottingham Advantage Award The Students’ Union offers a wide range of volunteering options both locally and internationally which you can fit around your studies. You could choose to volunteer for something completely new or there are many options related to education, for example Volunteering in Schools IntoUniversity Students' Union There are three initiatives which will give you the opportunity to work in a local educational setting. These initiatives support the academic attainment and raise the aspirations of primary and secondary pupils, whilst developing the skills and employability of those involved. These are excellent opportunities for students considering teaching, youth work or community engagement as a career. Students in Classrooms Undertake an exchange semester in another country and broaden your horizons. Talk to your tutors and find out more about the programmes available from the International Office. Exchange programmes Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Counselling and psychotherapy Careers in teaching and related careers Education-related careers More graduate careers telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}