{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/information-technology/gaming.aspx",
    "content": [
        {
            "p": "UKIE reports that the UK games industry was worth £7billion in 2020, an increase of almost 30% from 2019. The Game Culture sector (merchandise, toys, magazines) alone is worth almost £200 million in the UK. The UK is the biggest gaming market in Europe with over 37 million players. The Asia Pacific region has the largest share of the gaming market worldwide, with Gamesindustry.biz suggesting that 49% of all consumer spending in 2022 will come from China and the US. Book an appointment The video games industry consists of studios creating console and PC games, creators of tablet and mobile device gaming apps, and virtual/augmented reality. The video games sector works quite separately from educational games which has a focus on teaching skills or knowledge relevant to a topic. The Prospects page on video gaming offers a useful overview of the sector as well as ideas and websites to help find work experience and relevant opportunities. Not all roles are technical - there are also opportunities within animation, writing, research, and business functions. Factors and trends currently affecting this industry and its growth include crypto assets (such as NFTs), virtual reality and the ability this brings to collaborate and play with others; augmented reality; cloud gaming and smartphone gaming. There is a continued rise in the number of small, independent studios. The pandemic made many people worldwide turn to gaming for entertainment and this had a clear impact on the market, however, there has been a slowdown on spending in recent years as people revaluate what they want to spend money on. Gamesindustry.biz run an annual prediction on what the new year trends for the sector are. 2023’s predictions can still be read online. Esports continues to grow, in which multiplayer video games are played competitively for spectators, typically by professional gamers. Find out more about esports roles on the British Esports Association website. Use these resources to keep your finger on the pulse. Computer Weekly GamesIndustry.biz Games Radar Tiga Well-known large, global employers include Tencent, Sony, Microsoft, Google, Apple and Nintendo. Some of the most recognisable global game developers that specifically focus on Electronic Arts (EA) (FIFA), Activision Blizzard (World of Warcraft and Call of Duty) and Rockstar Games (GTA and Red Dead Redemption). Of the 2,555 games businesses based in the UK, 2,202 are games companies, 213 are service companies and 140 are academic institutions that offer games related courses and training. 95% of these are small or micro-businesses. Over 18,000 people are employed in games development and publishing work in the UK. Much of the industry is concentrated in London and the south-east, but the Midlands and the North are becoming important centres. The East Midlands has 120 games companies that include games developers and games publishers. GamesMap - interactive map of companies in the UK There is a history in the East Midlands region of games development. Tomb Raider was originally developed by Core Design – based in Derby – and the city now has a road named Lara Croft Way. There are a number of studios in Nottingham such as: The Multiplayer Group Sumo Digital Lockwood Publishing Dambuster Studios There are also smaller studios – often specialising in gaming apps for tablet or mobile – that are based in Nottingham's Creative Quarter. There are a wide variety of roles and opportunities for graduate from STEM (science, technology, engineering and mathematics) and non-STEM degrees within the sector. Arts students might find opportunities around the design or creative aspects of the industry such as animation. Experience with design packages is often useful and you will need a portfolio, often online, which demonstrates your work. You may also see writing and digital roles advertised within the industry. Some examples of relevant job titles could include narrative coordinator, guides writer and community manager. For all of these roles, being able to demonstrate an interest in the gaming industry would be paramount. For programming and development roles, a degree in computer science or related subject, or substantial programming experience is useful. You are likely to need a portfolio or demo for all of these roles so that you can showcase your work, and knowledge of languages such as C++ is useful. A demo consists of a small number of work examples to demonstrate some project work or coding that you have completed. These examples should include some games if possible, and employers are keen to see some practical experience, even if this has not been within a formal work environment. Read our advice on producing a portfolio. For descriptions of roles, the skills required and real-life case studies for jobs including animator, assistant producer, audio engineer and games designer, visit: Creative Skillset - job roles and case studies Other opportunities exist in producing or project managing productions, as well as more general head office functions for larger companies, such as marketing, HR or finance. Although not essential, having a relevant masters qualification may be helpful and can demonstrate specific development knowledge for the gaming sector. Make sure you investigate that the course meets your requirements and also consider whether there is opportunity to develop business and industry links through the course, or to complete industry-related projects. The gaming industry is a competitive sector to get into, particularly with the larger studios. You must certainly have an enthusiasm for the industry, shown through work experience, shadowing, or your own projects, as well as strong technical ability if you are interested in programming and development roles. You will need to be self-motivated while also able to work with other professionals in a team setting. Creativity and problem-solving abilities are key, as well as communication skills and the ability to meet deadlines. Ahead of project launch dates, the hours are often very long so flexibility is also important. Making contacts is key to breaking into the gaming sector. Use LinkedIn or other social media platforms to follow studios and get involved with any events or competitions that might be happening. Many games professionals work on a freelance basis rather than for one employer so networking can be really important. There are number of recruitment agencies working in the gaming sector, for example Aardvark Swift. They will work on behalf of several studios, recruiting graduates and experienced candidates to a wide range of opportunities. The Grads in Games website offers advice and entry level opportunities for students. They also often run gaming challenges and projects which can add to your experience and build your portfolio. It may also be worth checking studio websites for any roles they are advertising. For many applicants, a good entry-level role is as a games tester. This involves playing games repeatedly to identify problems or bugs. It will also be useful for you to gain work experience within the sector before applying, and developing a network of useful contacts through these opportunities along with events or projects is recommended. Games Jobs Direct GamesIndustry.biz More games developers are offering internships, work experience or year-long placement opportunities to students. These may be advertised, but often only on their own websites, so it might be worth taking a proactive approach to locating opportunities by networking checking studio websites. Use LinkedIn and other social media to follow studios and be mindful that you may need a portfolio to apply for work experience. You might also be able to find opportunities using a speculative CV and covering letter, even if companies are not recruiting at the moment, they may keep your CV on file. East Midlands Indies on Twitter offers a local networking opportunity for independent games developers. Tech Nottingham also organise events and information evenings which students and recent graduates are welcome to attend. You can request to join their Slack group to stay up to date with announcements. Nottingham Consultancy Challenge Work as part of a multi-disciplinary project team to deliver a real-life project for a business or charity over a six-week period. A great experience especially for those looking to develop transferable skills in project management, team work and communication. Nottingham Advantage Award The Award is the university's free employability scheme that helps you prepare for the job market and formally recognises your extracurricular activities. Nottingham Internship Scheme Undertake an internship with a local business or charity during the easter or summer vacation. Develop relevant skills needed by employers in the gaming industry, and work with local small to medium businesses. Some organisations offer project work, competitions and Games Jams which can help students to build experience. Grads in Games regularly host competitions and careers activities – these are great opportunities to get involved and start to build and develop games. There are also resources online to help you build your coding skills and many of these are free. Unity (a cross-platform games engine) and Unreal Engine (a 3D graphics game engine) are both widely used in the industry. Unity Learn game development courses Unreal Engine Online Learning The Guardian: Video game trends that will change the future of the industry BBC: Map of the UK's digital clusters The Guardian: \"playtime's over\" how 2023 will shape the industry Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}