{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/working-abroad/vet-case-studies.aspx",
    "content": [
        {
            "p": "Three Nottingham alumni reflect on their choices to move abroad after their degree. Return to the working abroad page Return to Vets homepage Around two and half years after graduating, I realised that clinical work probably wasn’t going to be my long-term career path. I was interested in the idea of industry work (e.g. pharmaceuticals, prescription foods or insurance) but also looked at unrelated jobs, however I couldn’t settle on where to focus my attention. In the short term, I resolved to head abroad for a few months to decide on what really mattered. I updated my CV and my LinkedIn profile and headed to Australia on a working holiday visa to begin what I had initially planned to be five months of locum work. That gave me the chance to work in many clinical settings, from small one-person clinics to a large 27-vet charity clinic as well as a referral hospital in their emergency team. High standards for both clinical and client care were expected, often with little-to-no onboarding. I worked in a variety of locations in Australia: mostly around Sydney, but I spent a month in the tropics of Cairns in Queensland, a month in the outback city of Broken Hill and a month in Tasmania to the south. Each offered a change in clinical standards and disease prevalence (for example, I’ve only encountered Tassie Devil fight wounds and tiger snake envenomations at one of those locations). Making it permanent I enjoyed the changes associated with locum work and life abroad, and quickly realised that five months or even a year in Australia probably wasn’t going to be enough to satisfy my curiosity. I swiftly investigated my options for staying in Australia and found that UK vets (including those graduating from Nottingham) are eligible to apply for permanent residency (PR). After a few piles of paperwork, a few thousand dollars in fees and a few months of waiting, I was granted a PR visa. Soon afterwards I was invited by a recruiter through LinkedIn to apply for a job as a technical services veterinarian for Boehringer Ingelheim. I’ve now lived in Australia for around five years, and have worked at Boehringer for over three of those five years and have seen plenty of changes in that time, particularly with the integration of Merial in 2017. I’ve now applied for citizenship, so in the not-too-distant future I should get a passport and the ability to vote! As I initially wanted to work in mixed practice, I felt that the large-scale farming systems practiced in New Zealand would allow me to hone my skills quickly - this was certainly the case as I manually palpated 1000 heifers in my first week! The main challenge in applying was finding the ‘right’ job. Despite having spent time on EMS placements in New Zealand and making supportive contacts, which I would encourage any student considering working abroad to do, I found it difficult to gauge whether a practice would provide a positive new graduate experience. It took time for me to find a practice with dedicated mentors and a support scheme for graduates. The other obstacle of working in New Zealand was being half a world away from family, friends and university peers. However, the welcoming nature of the people around me, the familiarity of the New Zealand way of life compared to the UK, and the fact that technology allows for easy communication made it simple to adjust to working overseas. Kiwi’s really value work-life balance and this principle was instilled in me, helping me to learn to manage stress effectively. I am glad that I persevered in finding the right first job as they supported me to develop my practical skills, particularly in small animal surgery for which many opportunities present in rural New Zealand. I feel that the experience that I gained built a solid foundation for my career and the drove me to pursue further study on returning the UK. Before vet school I travelled a lot in Africa, Asia and Europe. I visited many charity vet clinics that needed support, so when I started vet school, I founded Worldwide Vets to be that support. As company director, I now oversee hundreds of volunteers going abroad annually and help clinics reach their potential. Alongside managing Worldwide Vets, I am also a ‘normal’ vet working with wildlife in Zimbabwe, Africa. I don’t have a typical working day, which I love. Monday I will be up at dawn darting lions for treatment, the next six days may see me in the office doing company admin, then it’s packing my bags for a week long camping trip to the bush to capture antelope. Weekends are not a thing. Working with wildlife, there are many variables outside of a vet’s control, never mind if you can even find your patient on the day you intend to work on them! I make a plan for each procedure, then blow it out the window and adapt as I go along. You must be flexible, creative and able to work around the opinions and plans of government, national parks and landowners. Interested in wildlife work? It’s all about who you know. I suggest getting out there to volunteer and form professional and personal friendships before you are seeking a job. An employee is unlikely to consider someone who hasn’t been to the country, because it’s not all sunshine and safaris. They want someone they trust, who is fun to work with, and who has proven themselves when it’s not all going to plan. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}