{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/ampr/social-media.aspx",
    "content": [
        {
            "p": "Social media is a key part of our lives, and many employees work in social media jobs to ensure society can continue to enjoy it. Whether you see yourself a passionate content creator, an analytical data enthusiast, or someone who enjoys community engagement, a career in social media could be your perfect fit. Marketing Week notes that digital roles, including social media jobs, are the fastest growing in the industry. Brands continue to focus on digital marketing channels such as Instagram, YouTube, TikTok, and others, leading to a significant increase in job opportunities within this area. Book a careers appointment We invited four speakers to talk to you about their roles. They share details about their career paths and give you top tips on how to crack into this industry and what the essential skills are. It's also your chance to hear about the latest industry trends, and what the emerging skills are for this sector Lucy Faulkner, PR Account Manager, BA English 2018 Katie Moncur, Social Media Officer, BA English 2020 Login to SharePoint to watch a recording of this event Social media roles are rapidly growing in demand across various industries. Working in social media could involve a combination of managing online communities, building company reputations through content creation, blogging, implementing social media strategies, and participating in forums. Roles often include responsibilities in analytics, insights, SEO, PPC, content management and copywriting. Additionally, being a social media professional can involve creating campaigns and strategies to meet organisational goals. Organisations of all sizes now maintain an online presence. In larger organisations, social media roles might be distinct, while in smaller companies, they could be combined with other marketing and communications activities. Social media positions are prevalent in digital marketing agencies, government bodies, higher education institutions, and a wide range of private sector companies. Social media job titles cover all aspects of social media, such as building, managing and maintaining websites and the apps people use. Social media jobs exist in multiple industries, as many modern companies utilise social media for various reasons, such as engaging in customer relations, marketing or conducting their main operations. Salaries vary depending on a range of factors including your location, the sector you work in, the type of organisation you work for (agency or in-house), your experience, and the success of your social media campaign activities. 1. Social Media Manager 2. Content Creator 3. Community Manager 4. Social Media Analyst 5. Influencer Marketing Specialist There are no set qualifications for entry to these jobs, although many entrants have a degree, and some employers require this. These jobs are open to graduates from any discipline. Employers often view personal qualities, existing knowledge and relevant experience as important. These websites may be useful when looking for a job in this sector: For helpful industry insights into the sector, you may wish to visit: Creative Access have jobs and internships in all types of creative industries including digital. Many, although not all the jobs/internships advertised are aimed at under-represented groups. Networking can be a great way to access hidden opportunities. Digital agencies across the UK are often open to being approached for internships and work experience. Demonstrating relevant skills, passion and curiosity about brands, culture and the digital world can be beneficial, along with a willingness to learn. Reach out to local voluntary organisations and charities to offer your skills in creating web content, communication with service users and online marketing strategies. This can be a good way to build up experience alongside studying so that you can obtain relevant skills and knowledge. If there is a role that interests you, make contact with the person working in that role, maybe you could use LinkedIn and connect with them and see if they are willing to answer your questions and maybe even have a chat. You never know, a conversation like this could lead to the offer of work experience or mentoring. Employers seek a range of skills in social media professionals. both hard and soft skills necessary for each role. This could include technical skills (SEO, analytics, content creation tools), as well as soft skills (communication, creativity, empathy). Once you have done some of these, you will have some impressive evidence to demonstrate to employers that you have the potential to work in social media on a professional basis. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. While good writing skills seem the most obvious ones to possess, they need to be part of a broader skill set. For example, writing meaningful and impactful tweets in 280 characters takes some practice. You will need to be familiar with some social media platforms such as Twitter, Facebook, YouTube, Instagram, Wordpress, Pinterest, TikTok, Tumblr and Trello, together with Hootsuite to manage those platforms. There are often free on-line courses or YouTube tutorials to help you get started. It will also impress employers if you have taken time to understand and perhaps apply some of the following to your own social media output: Google Analytics, Facebook Insights and Twitter Analytics. Even having a bit of basic coding (HTML/CSS) in your armoury will help, as will knowledge of Adobe Creative Suite. The Institute of Digital Marketing IDM have a DMA Talent website looking to attract people to the sector through mentoring, workshops and training opportunities. There are many courses and even short ‘internships’ available online. Look at our online work experience pages. Once you have mastered the functions of social media platforms, try putting your skills into practice. Write your own blog and grow a Twitter or Instagram following. Offer your social media skills to a student society or a voluntary organisation to run a campaign. Once you have done this, you will have some impressive evidence to demonstrate to employers that you have the potential to work in social media on a professional basis. You can stay updated with industry trends through short courses, webinars, and professional qualifications from bodies like the Institute of Data and Marketing (IDM) and the Chartered Institute of Marketing (CIM). Joining these organisations can provide networking opportunities and access to the latest industry insights. Explore webinars and courses on emerging topics such as AI in social media marketing, storytelling techniques, and data-driven content creation. Keeping updated on the latest trends in social media, such as new and emerging platforms (e.g. BeReal, Threads), with insights into their unique features, audience demographics and growth potential can be helpful to stay ahead. Learning to leverage these platforms and similar ones can set you apart in the industry. Platforms like Facebook, Instagram, and TikTok are constantly updating their algorithms to prioritise different content formats. For example, Instagram now favours Reels, making short-form video content essential for engagement. TikTok’s algorithm rewards content that sustains viewer interest and interaction. Understanding these updates can help you craft content that reaches and resonates with your audience. Short-form videos, live streaming, and augmented reality (AR) filters are among the top trends reshaping social media content. Platforms are emphasising real-time engagement and unique user experiences, which means enhancing your skills in these areas can be helpful for a successful career. With regulations like GDPR and CCPA, it’s vital to understand the legal aspects of social media marketing. Being informed about data privacy ensures your strategies are both effective and compliant. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}