{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/environmental-careers.aspx",
    "content": [
        {
            "p": "Are you interested in working in the environmental sector? Find out about this diverse sector and the job opportunities spanning businesses in the UK. Growing legislation has led to greater opportunities in areas such as pollution control, recycling and carbon management but companies across all sectors are employing environmentalists or using consultancies for public relations or corporate social responsibility. Some large organisations even produce environmental or sustainability audits in the same way as financial reports. Read our blog: Exploring Careers in Sustainability Return to A to Z jobs list Book a careers appointment You might also be interested in our page on careers in sustainability. \"Though embarking on opportunities outside of university can be daunting and expensive, the knowledge and insight I gained from this expedition was invaluable\" Read Julie's blog post about her conservation placement The United Nations Environment Programme takes a broad industry perspective in its definition of 'green' or environmental jobs, describing them as: Work in agricultural, manufacturing, research and development (R&D), administrative and service activities that contribute substantially to preserving or restoring environmental quality. Specifically, but not exclusively, this includes jobs that help to protect ecosystems and biodiversity; reduce energy, materials and water consumption through high-efficiency systems; de-carbonise the economy; and minimise or altogether avoid generation of all forms of waste and pollution. Prospects has produced an overview of the environmental sector in the UK, which discusses: As you start your research, it will become clear that the environmental sector has a breadth and diversity of roles. For example: Catalyst Change have produced a guide to getting a 'green' career. Download it from their website (just scroll down the page). A Green Career in 5 Steps Primarily concerned with preserving and protecting the natural environment, this is a competitive field and likely to require relevant voluntary experience. To investigate the current issues in conservation and ecology, visit the following websites: Careers in this sub-sector include: Corporate social responsibility (CSR) is a growing area for businesses, both large and small, with many choosing to focus on sustainability. To find out more about the current issues and considerations in corporate sustainability, visit the following links: Environmental management is concerned with the interaction of impact of human societies on the environment. Environmental managers are responsible for overseeing the environmental performance of private, public and voluntary sector organisations. This has a significant overlap with CSR, where the focus is sustainability. To investigate further, visit the following websites: The Royal Society of Chemistry explains: 'green chemistry seeks to reduce the chemical-related impact on human health and the environment by the use of alternative, environmentally-friendly processes and reaction media'. It isn't a separate branch of chemistry, but an approach that permeates every stage of process development. To find out more, visit these websites: As green chemistry is an approach rather than a branch of chemistry, job titles will not always include a direct reference to green or sustainable chemistry. By searching for jobs on websites that focus on green issues, you may be more likely to come across dedicated roles. Alternatively, talk to potential employers directly to ask about their green policies. The management of land and its agricultural usage has a significant impact on our environment. It is a rapidly changing industry with new developments such as precision land management, involving technology such as satellite positioning and farm management software. To find out more about the future of the industry, visit these websites: There is a significant amount of legislation involved in managing the human impact on the environment, and much of the UK's legislation is linked to the EU. As the UK proceeds with its break from the EU, work in this area is likely to increase. There is also a growing legal focus on subjects such as corporate and social responsibility (CSR), emissions relating to climate change and sources of energy, e.g. the controversy around fracking. To investigate environmental law further, look at these websites: The Energy and Utilities Skills Group described waste management as 'one of the most exciting, quickly evolving industries in the UK. New developments and discoveries are being made all the time to help turn waste into valuable resources such as power and raw materials'. To find out more about current issues in waste management recycling, visit: Careers in this sub-sector include: waste management officer and recycling officer According to the International Renewable Energy Agency (IRENA), renewable energy jobs have increased to 11.5 million globally with the UK employing 144,000 as stated by the UK National Grid Net Zero Energy Workforce Report. The same research also reveals that the industry will need to fill 400,000 jobs to deliver net zero emissions by 2050. For more information on the renewables industry in the UK and globally, visit the following websites: Flood risk management has a high profile, and is the recipient of an increasing amount of funding. To find out more about the environmental issues impacting the water industry, visit the following websites: Careers in sustainability aren't limited to STEM graduates. This event hosted a range of arts and social sciences graduates who work within the sustainability sector. Hear how they entered the field and how their degrees helped them. Alongside the highs and lows of their careers, and how they contribute to a sustainable world. Login to SharePoint to watch a recording of this event For many of the roles outlined above, a BSc or BA in one of a range of relevant subjects is acceptable: from life or environmental sciences to engineering, law and geography. However, in cases where specialist knowledge is required at entry-level, a relevant postgraduate qualification may either be expected or advantageous. View the individual job profiles for further details on qualifications and then search the Prospects postgraduate courses database to find a list of the masters courses available to you. Many roles within the environmental sector are popular and entry is competitive, so relevant experience that demonstrates your commitment to the issues will be an expectation. That experience could come from volunteering with a local environmental charity or from a relevant internship or work placement. Many smaller companies will respond well to targeted, speculative applications. Becoming a student member of a relevant professional institute will allow you to build your network, which could be beneficial when looking for work experience. Joining and actively participating in a relevant student society will provide evidence of your commitment, and provide opportunities for networking. Having a strong application is important. Get some advice on how to make your application stand out by: Attending our skills workshops from developing your CV to acing the interview Reading our advice on all stages of the application process ENDS provides environmental and sustainability intelligence to professionals in business, consultancy, government and public bodies. The website includes a directory of over 1,000 environmental consultancies and suppliers, searchable by specialism, for example, nature conservation, environmental risk assessment, landscape management, etc. EnvironmentJob.co.uk produces a directory of over 600 environment organisations, searchable by sector and location. Friends of the Earth also provides a useful list of charities and campaigners it works with. There are a wide range of environment-related Government departments and agencies, including: For a full list of Government departments, agencies and public bodies, visit Gov.UK. Large companies employing environmental specialists range from energy and utilities companies to large financial corporations focusing on CSR. The roles will vary depending on the focus of the employer and their environmental priorities. Windo provides access to the sustainability plans, progress and achievements of potential employers, connecting you with employers that will align with your values. There are also leaderboards to help you compare employers and checklists to assess their commitments. Windo This is just a small selection of the numerous job vacancy websites available. To identify other agencies, use the Recruitment and Employment Confederation's Find an Agency tool, searchable under a number of criteria, including sector and region. For Purpose Jobs Green Choices Greenjobs EnvironmentJob.co.uk Sustainability Jobs The Guardian Conservation Careers Conservation Jobs Acre ENDS Lets Recycle CIWEM Jobs Law and Legal Renewable Energy Jobs Agriculture and Farming Jobs New Scientist Natural Environment Research Council Royal Society of Biology (includes conservation, ecology, animal placements) Royal Society for the Protection of Birds (RSPB) Wildlife Trusts World Wide Fund for Nature (WWF) Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}