{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/first-day/before.aspx",
    "content": [
        {
            "p": "On your marks, get set... but before we shout ‘go’ there is work to be done. You’ve secured a job (congratulations) and the countdown is on, so what could you do now to help you feel prepared as you approach the start line? If you have a disability or health condition, you may not have shared this with your employer during the recruitment process. You do not have to share any information before starting work if you don’t want to, however, if there are adjustments you need to be able to perform at your best, it’s not too late to ask. You can contact your manager before you start work if you need adjustments in place before you start. You can also talk to your employer after starting employment, for example, in a scheduled one to one meeting with your manager, if you realise you need an adjustment that you hadn’t anticipated. This may also be necessary if your circumstances change and you need new or revised adjustments. There is specialist government funding you may be entitled to, called Access to Work, which supports you to stay in work if you have a disability or health condition. Go to our Disability and Accessibility in Careers NOOC When you first applied for the job you will have researched the organisation so you’ve probably already covered off basic questions like what is the organisation’s purpose, how do they operate, and what 'hot topics' are currently trending within the sector? Now is the time to refresh your memory and build further knowledge. Turn your attention to the department that you’ll work in and look for more detail. Try to gather intelligence about their current strategy, recent activity, or projects, and work out who’s who. Armed with this information you’re less likely to fall into the trap of asking obvious questions, and instead, you’ll be well positioned to make thoughtful observations. I work in investment banking, and for me I'm always impressed with new analysts who are aware of what's been happening in the market, having done their research and keeping up to date with news prior to starting. It's also a great starting point to ask questions and build rapport with people by getting their views on a particular topic. Aisha Natamkar, UoN alumna, Economics, 2015 Why wait until day one to get to know people? Drop your new manager a line to reiterate how excited you are to be joining their team and ask if there is anything that they would like you to do before you start. You can use LinkedIn to start connecting with your new colleagues. Think back to when you were interviewed, perhaps you met people who already work for the organisation, or maybe you may know of other graduates who will be joining the organisation at the same time as you. Send personalised connection requests to these people to get the ball rolling. Initiating these relationships now is likely to help you to feel more confident when you start. Laura Ascione, UoN alumna, MSc Marketing, 2017 With any luck, conversations with your new colleagues will flow, but it’s always good to be prepared and have some ‘go to’ content lined up. Give some thought to how you might introduce yourself. Besides the obvious ‘hello, my name is...’ you could also include what you studied at university, what sparked your interest in this area of work, or what you’re keen to learn more about. Adding detail may lead you to finding common ground or encourage others to share a little about themselves in return. Once you’re beyond introductions, having some open questions and general topics of discussion in mind can also really help. You could start by asking about their role and how you might work together. Try to tick any personal errands off your ‘to do’ list before you begin your new job. Ideally you don’t want to have to ask for time off as soon as you start. So, if you’re due for a dental checkup, your car needs servicing soon, or you need to order anything that will require you to wait in for, get it done now. Hopefully this will not only offer a small sense of achievement, but it will also allow you to focus purely on your new role when the time comes and reduce the potential for any additional stresses. Refine some practical skills - you mind find it useful to take an Excel or PowerPoint crash course to learn all the shortcuts (Udemy, LinkedIn Learning and edX have great courses). They can be really useful in getting your job done better and faster, while also impressing your manager, who might even learn a couple of tricks from you. Paramvir Dhanda, UoN alumna, MEng Chemical Engineering, 2017 telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}