{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/medical-physiology.aspx",
    "content": [
        {
            "p": "Medical physiology and therapeutics (MPT) graduates are highly employable. Entering fields such as medicine, clinical research, sport, healthcare, public health, medical writing and health communications as well as NHS graduate schemes such as the Scientist Training Programme amongst others, MPT graduates have a wealth of choice as to their graduate destination. While many graduates choose to pursue a career as a doctor, many others choose roles such as physician’s associate, public health practitioner, medical writer, healthcare advertising or healthcare data analysts. The skills and knowledge developed as an MPT student can be applied in many different fields and graduates from this course enjoy varied careers that have real impact on peoples’ lives. Medical physiology and therapeutics (MPT) graduates are not confined to a single industry. Instead, they find themselves at the crossroads of various disciplines. Whether you're tackling infectious diseases, developing new drugs and health treatments, working in the NHS, or enhancing data-driven solutions, you will be working in a multi–disciplinary environment and with colleagues, clients and patients. While many graduates will undoubtedly begin health related careers, the evidence from previous graduate destinations is that your MPT degree opens a world of possibilities. MPT graduates have entered a diverse array of roles spanning law, market research, finance, IT (clinical Software), project management, public relations, teaching and science/health communications. As you embark on your career journey, you may discover the need for further study and specialised skills. Continuing professional development will ensure you remain skilled and expert in your chosen field. 42% of the graduating cohort in 2021 went on to complete post graduate study. Courses undertaken by former students include GEM, physician associate, physiotherapy, medical ethics and the law. As well as the skills developed on your course, participation in extracurricular and work experience, organisations large and small are also looking for students to have developed a range of attributes such as the following while at university. What employers seek from candidates is evolving all the time and it is important that you keep up to date with recruitment trends in the career areas that interest you. According to the Association of Clinical Scientists, there are two branches of science in hospitals – Clinical Science and Biomedical Science. Both careers result in state registration with the HCPC (Health Care Professions Council). The clinical scientist has a clinical interpretative role while the biomedical scientist is more laboratory based. The most direct route to become a clinical scientist is to participate in the STP (Scientific Training Programme) The STP is open for applications in the January of your graduating year and placements commence in September. For further information on how to become a clinical scientist, please look at the NHS careers website for more information and the National School for Healthcare Science website The Association of Clinical Scientists lists professional bodies related to specific modality. STP - listen to Nottingham alumni about the scheme You have many options available to you and it is in your interest to investigate the employment sectors (e.g. healthcare, pharmaceutical, food, finance), organisations and roles offered and apply to those opportunities that appeal to you. The areas highlighted below are some of the career paths you might want to investigate further as they are most closely linked to your area of study. However this list is not exhaustive. According to NHS Health Careers, there are three main areas of public health: Health protection - working to prevent the outbreak of epidemics, plan responses to emergencies, or in food safety. Improving people’s health - you might be involved in campaigns to encourage healthier eating, physical exercise, or to persuade people to quit smoking and drugs. Healthcare services - making sure that everyone has access to high quality health services and medicines that they need when they need them. NHS Public Health Careers Medical sales representatives or ‘reps’ are a key link between medical and pharmaceutical companies and healthcare professionals. They typically sell medicines, prescription drugs and medical equipment to GPs, hospital doctors, pharmacists and nurses, working to raise awareness and use of their company’s products. Prospects - medical sales rep Do you like communicating? Enjoy writing? Then have you thought of science communication and science writing? Science writers research, write and edit scientific news, articles and features in a range of different formats, including: Association of British Science Writers European Medical Writers Association Healthcare data analysts help improve healthcare outcomes using data from a variety of sources. Most commonly, healthcare analysts work on the business side of medicine, improving patient care, or streamlining the way things are run. They look at clinical data, claims and cost data, pharmaceutical data, behavioural data and health outcomes. Health Data Research UK Science communicators do much of the above but they may also organise exhibitions, produce film and digital content and present science education to the public. You may want to consider a specialist masters course in science communication such as those offered at the following universities Imperial College, Sheffield, West of England, Manchester Metropolitan, and Edinburgh. Listen to Tamela Maciel, Space Communications Manager at the National Space Centre We tend to think of pharmaceutical companies as huge global corporate, and they do account for the majority of UK Pharma employment. But a growing number of small to medium-sized enterprises are becoming involved in drug development too. The Association of the British Pharmaceutical Industry (ABPI) has developed a comprehensive list of pharmaceutical companies, their contact details and some of the areas they regularly recruit into. It is searchable by location, category, employment area and type of role, for example, internship, graduate training programme. The Association of the British Pharmaceutical Industry Find out about careers in the pharmaceutical sector Clinical trials are medical research studies involving people. All new treatments must be thoroughly tested. Researchers test possible new drugs in the laboratory to begin with. If they look promising, they are carefully tested in people. Clinical trials look at: SRG NHS approved agencies Indeed Reed Further study - courses and funding Medical Schools Council NHS Jobs Pharmiweb.co Royal Society of Biology Science careers beyond the lab The Physiology Society telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}