{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/psychometrictests/games.aspx",
    "content": [
        {
            "p": "Game-based assessment or gamification, is an emerging trend that many bigger employers like PwC, E-ON and Siemens are using as part of their recruitment process. Quite simply, it involves job applicants playing a game on a computer or mobile device so the company can assess their suitability for a job. Gamification assessments help match people to the right job roles. Psychologists devise a ‘fit’ profile for different jobs taking into account the job goals, challenges and requirements and it is the ‘fit’ for this job that an applicant is being measured against. There are different ‘fits’ for different jobs, so you could be an unsuccessful fit for one job but a perfect fit for another. Practise using Graduates First (free) Alumni - request access to Graduates First by email It is generally used at the initial stages of recruitment instead of, or as well as psychometric tests, to select for the next stage of recruitment, which can be an assessment centre and/or interview. The employer will send you a link to the computer game which you can play on your mobile or desk-top computer. You don’t need any experience of gaming but you do need to make sure you read the instructions properly. In a fun way, the games assess an applicant’s cognitive skills and behavioural preferences and depending on the job may include others skills such as abstract reasoning, numerical ability and decision-making. For example, the test could look at how much information you can process, your ability to remain calm under pressure and your attitude to risk taking. Some games are simulation activities of a work style environment while others are unrelated to a work situation. Gamification is not measuring ‘good’ or ‘bad’ aspects of an applicant’s personality, but natural behavioural responses, so remember to relax rather than second guess. Often, you’ll get your own report of what strengths and weaknesses you demonstrated in the game, which is useful feedback for you to take forward. The good thing about gamification is you don’t need to do much preparation. However, Students and graduates can access Graduates First completely free of charge. You can access a wide-range of resources including: Students - register for free access using your UoN email address Alumni - email our team for free access Plantville - An example of a work style environment gamification that simulates the experience of being a plant manager. TARGETjobs - the graduate job hunters guide to gamification telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}