{
    "url": "https://www.nottingham.ac.uk/careers/students/navigating/first-weeks/wellbeing.aspx",
    "content": [
        {
            "p": "Starting a new job is exciting, but it can also be stressful. You probably feel a bit nervous and there are a lot of unknowns which often means that you’re constantly guessing, processing, and trying to respond appropriately in the moment. So, maintaining your wellbeing at this time is essential. Not only will this help you to feel positive and upbeat, but it’s also likely to help you to stay focused and be productive at work. Laying a solid foundation for your wellbeing and happiness at the beginning of your working life will help you to develop good habits for the rest of your career. Here’s some ideas: The wellbeing benefits of getting enough sleep, taking regular exercise, and eating a healthy diet are well documented, yet when under pressure we often let these things slide. Make a conscious effort to maintain these important aspects. Think about who can support you over the next few weeks - who might make an excellent cheerleader, who can offer wisdom and calm, and who can be called upon for comic relief? Your nearest and dearest will want to help, so just ask. How will you conserve energy to see you through each day? How will recharge for the next day? Different things work for different people but it’s worth giving this some thought so that you can keep going and feel positive. The best thing you could do to get ahead before you even start is getting yourself in good physical and mental health. You can have short-term wins. For example, before I began my first job, I spent one week waking up at 6.30am (the time I would be waking up when the job actually started). This helped me set my body clock right, and get my sleep cycle in sync. On the day before my job, I went out to the local arcade and spent a lot of time enjoying myself there. It helped clear my mind and diffuse the worries and anxieties I had. Siddharth Shyamsundar, UoN alumnus, MSc. Work and Organisational Psychology, 2016 Everything is going super well, working life is slotting into place, you love your new job, and then boom, suddenly out of nowhere you feel flat, down, and disinterested. If this happens don’t panic. You’re probably exhausted and experiencing a perfectly normally dip. The first few weeks of any new job require a huge amount of energy. You’re getting used to a whole new lifestyle, you’re constantly making sense of new information, you’ve met loads of new people, and all while maintaining a smiley happy demeanour! So, now is the time to pause, reflect, and recuperate. Take some time to acknowledge all that you've achieved and then allow yourself some downtime. Do something that you enjoy, practise being mindful, and surround yourself with people who care. Hopefully this is a temporary blip and you’ll be back on your 'A' game before long. That said, if you do continue to feel this way it might be a good idea to seek help. After the first few weeks of your new job, you're likely to begin to feel more settled. However, it's wise to continue to be mindful of maintaining your wellbeing and keep up any positive approaches you put in place earlier on. This will help you to maximise the highs and recognise when you might need to take action to avoid a low. Knowing yourself and noticing your responses to challenging situations can be helpful. Perhaps when things feel tough you become more irritable, take things overly personally, abandon exercise or comfort eat. Spotting these early warning signs might give you an opportunity to be proactive and get back on track, whether that’s taking your lunch breaks, talking to friends, going for a run, or something else. It's also worth checking out what your employer can offer. You may find that they provide wellbeing focused training and resources, sport and fitness opportunities, mentoring schemes, and counselling services. Establishing a good routine is crucial in my opinion. You are going to have to be up early to get into work anyway, so your day is naturally more structured. You can use this structure to your advantage, maybe you want to do yoga or go to the gym before work or take up an exercise class in the evenings. It could be something as simple as finding a podcast that interests you and getting off a tube stop early and walking for a while before you get into work. Establishing a routine of good habits will help you make this transition. Andrew Drylie, UoN alumnus, Law, 2019 Getting used to a daily 9-5 was challenging at first. You can't skip work like you might have skipped a lecture or two... however, it didn't take long to adapt.To help yourself transition it's a good idea to get into a solid morning routine and also get enough sleep. Don't drop all your hobbies though. It took me about a year of missing the activities and social life I used to get from societies, before I realised you can still do things you enjoy as a working adult. Look out for clubs in your local area and get involved. Work-life balance is really important. Katy Ashby, UoN alumna, Physics with European Language, 2017 Read our blog on How To Deal With Imposter Phenomenon Mind - Watch this video for eight relaxation tips to help you look after your wellbeing Mind - read this guide about how to be mentally healthy at work. NHS - Get your mind plan: a quiz to get personalised advice telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}