{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/jobs-in-education/teaching.aspx",
    "content": [
        {
            "p": "Once you've decided that teaching if for you, there's a lot to consider and make decisions about including: who you want to teach, which route into teaching is right for you, how to gain relevant work experience and how to make a successful teaching application. We've got it all covered here and with links to key resources. Jump to: Return to the A to Z jobs list Book a careers appointment Book your place on our our teaching events Our Getting into Teaching recording will help you to understand more about teaching as a career option, explore different routes into teaching, identify skills you have, or may want to develop, that are necessary to a role in teaching and consider the kinds of experience schools are looking for. Through our alumni guests you will hear some real insights into the realities of the job, opportunities and career routes: Login to SharePoint to watch a recording of this event Would you prefer to teach students of 11 years and upwards, concentrating on a subject or subjects at which you excel, or teaching younger children several different subjects, and where you will be their main classroom teacher? Teacher training programmes leading to qualified teacher status (QTS) involve learning the principles of teaching and gaining practical experience in schools. However there are differences in the way in which they are delivered. Which route do you think would be best for you? If you're not sure which route will be best for you, you can chat it though with a careers adviser. PGCE programmes are run by higher education institutions (HEIs) throughout the UK. Full-time courses usually last one academic year and part-time courses are available. Lectures take place at the university and you will spend around 120 days on placements in at least two schools. This route will suit aspiring teachers who value peer contact and support. Some institutions will offer credits towards a masters qualification. Find out more about PGCEs School-Led training programmes are school-led training programme lead by a school in partnership with a university or consortium. The schools select their trainees because there is an expectation that if all goes well, you will be employed within the consortium of schools. Most lead to a PGCE as well as QTS, but always check. This can appeal to those who wish to be fully integrated into the school environment. They may be unpaid or paid: Find out more about School Direct The Teach First Leadership Programme is employment based. Teach First seek to make a difference in challenging primary or secondary schools. While working in a school, you would complete a Postgraduate Diploma in Education (PGDE) that integrates teacher training with leadership and includes credits towards a masters qualification. During the summer you could complete a work placement in another sector outside of teaching. Teach First require 300 UCAS points and a 2:1 degree (some secondary options will consider a 2:2). This route appeals to confident resilient applicants seeking early leadership. Most training providers request evidence of your motivation to teach, and this is also important to confirm that teaching is a potentially worth considering. Training providers prefer classroom-based work experience in a state school OR a deep understanding of teaching in the classroom, which maybe gained through other relevant experiences. Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. At the University of Nottingham, we have a range of teaching related initiatives that you can get involved with as a volunteer or on a paid basis. Find out more about all these programmes Working with young people School Experience Programme (SEP) This paid scheme is classroom based and is designed for those wanting to teach shortage subjects including maths, science, and modern languages at secondary level. Find out more about School Experience Programme Internships There are paid internship programmes open to students from specific subjects where you can gain experience and earn £300 per week while gaining insight into teaching as profession. For PGCEs and Schools Direct programmes, you will apply through the Government’s Teaching Training Application portal and you can also find more information on the Get Into Teaching Digital brochure about all routes. For Teach First, you will apply direct. You can start applying for postgraduate training from October the year before you want to start your course. You can apply throughout the year but be aware that some courses do fill up quickly. Teacher Training Applications Teach First - make an application Get into Teaching website Your statement should include skills you have that are relevant to teaching as well as any experience you have of working with young people. Demonstrate your understanding of teaching as a role as well as your reasons for undertaking teaching training. Finally you can also cover any activities you’ve done that could be relevant to teaching. Get Into Teaching: Teacher Training Applications If you're interested in teaching and applying for 2024 courses, this webinar explores the application process for Initial Teacher Training through the Apply Service. This webinar covers what to include in a personal statement as well as exploring recent changes that have been introduced to this service. It is delivered by an Explore Teaching Adviser from the DfE Get into Teaching Service. Login to SharePoint to watch the webinar The exact interview process will vary depending on the teaching training provider. You are likely to be asked about your motivations for teaching, the challenges faced by teachers in the classroom and what you can bring to the profession. There will be skills that your assessors are looking for such as passion, enthusiasm, confidence and professionalism. Providers will also expect you to reflect on your performance. Many providers will ask for some type of presentation. This is a chance to sell yourself and demonstrate your ability to capture students’ attention. See Get Into Teaching’s advice on teaching interviews Book an appointment to have your personal statement reviewed or for interview practice Check out our teaching events: Skills workshops and Spotlight On Read our blog: “It’s so rewarding”. Could teaching be the job for you? Tuition fee loans are available from Student Finance England (criteria permitting) for PGCE programmes accredited by a HEI. Bursaries are available for shortage subjects, and these can be generous for those with a good class of degree. Funding policy changes yearly, so you'll need to check what's on offer in mid-September Get into Teaching - funding options Professional teaching applications often require a tailored approach that highlights your relevant experience, skills, and achievements. Take the time to carefully craft your application, paying close attention to the job description and person specification provided by the school or institution. Emphasise your teaching philosophy, classroom management strategies, and any additional qualifications or training that demonstrate your readiness for the role. Your application should effectively showcase your passion for education and your commitment to fostering student success. Professional teaching interviews often differ from initial teacher training interviews in several key aspects. These interviews are typically more comprehensive and may involve additional tasks designed to assess your teaching abilities, professionalism, and suitability for the specific role and school environment. During a professional teaching interview, you may encounter a variety of activities, including: See get help applying for teacher job for more application and interview support If you would like to teach children aged 0-5 years, you can pursue an Early Years Teaching Scheme (EYTS) course specialising in early childhood development. You may be employed in private nurseries, nursery schools (state and private) and academies. Only the state sector will guarantee the national teaching wage. Early years programmes deemed equivalent to QTS may not be transferable if applying to primary school vacancies later on in your career. . EYTS programmes include: Funding is currently available. Find out more about EYTS In further education (FE), you'll teach students aged 16 and above, potentially covering a wide range of subjects such as A-levels, T-levels, or BTECs. Alongside academic training, you may also provide vocational and basic skills training. Various teaching qualifications are available, including the Level 5 Diploma in Education and Training or the PGCE Post Compulsory Education courses offered by higher education institutions (HEIs). While a degree in the subject you wish to teach is typically required for the PGCE route, it's possible to teach in FE without a formal qualification, although having one can enhance your prospects significantly. Teaching in FE encompasses an array of vocational subjects that can be both diverse and exciting. These may include animal care, sport, floristry, fashion design, agriculture, and public services, among others. Embracing the unique challenges and opportunities within vocational education can lead to a rewarding and fulfilling career in further education. Find out more about further education teaching Watch this video on becoming a teacher in FE To become a university lecturer, you will usually need to study for a masters and then a PhD qualification in the specialist subject area you want to teach. We can offer specialist advice for students considering this option. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}