{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/applicationforms/design-portfolios.aspx",
    "content": [
        {
            "p": "For many creative and design-based subjects, a portfolio of work will be required as part of the job application process. The purpose of this is to provide direct evidence of the candidate’s design abilities by presenting examples of their work. A strong portfolio can be critical in helping you secure an interview and land a job offer. Because a portfolio is an expression of your personal design approach, every one will be different and there is no set or standard approach to how a portfolio should be presented or what it should look like. Talk to an adviser There are different types of portfolio which might be used for different purposes. It is important to consider the purpose for which you are using your portfolio and select the right format for the purpose. First and foremost, this is a design industry, so there is no reason for you to send out a plain looking portfolio. It should reflect your quality of work and represent who you are and what you’re passionate about. Even the greatest work can be let down by something that is poorly laid out and has no design brilliance. Be concise and informative, and sell yourself with a CV and portfolio that have some design coherency. A PDF is usually the best format for showcasing your work, but you shouldn’t just leave it at an email. Chase up your application with a phone call and make yourself known to the company. Your application should also be an ego boost for the practice; tell them exactly what makes you want to work for them, and what makes them a standout in the industry. Generic answers and blanket statements won’t help you here. Izzy Rhodes, Swain Architecture Don’t forget to get advice and feedback on your portfolio from academic tutors, careers advisers and any professional connections you might have within your industry. Arch Daily - The Best Architecture Portfolio Designs Careers in Architecture - Professional portfolios Life of an Architect - Architectural Portfolios Yanko Design - Ten tips to improve your industrial design portfolio telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}