{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/information-technology/cybersecurity.aspx",
    "content": [
        {
            "p": "Cybersecurity is the process by which individuals and organisations reduce the risk of cyber-attacks. The main function of cyber security is to protect any devices that we all use (smartphones, laptops, computers and tablets) from theft, damage and cybercrimes. Cybersecurity is also there to protect us against any cyber threats we may face using online systems such as hardware, software and data that may be damaged or modified. It also protects the privacy of data and hardware that handles, stores and transmits that data. Cybersecurity has become so important in recent years that the government has written a strategy on how to deal with cybercrimes. Return to the A to Z jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment This webinar offers an exclusive insight into an ever growing, and increasingly important sector. You'll hear how to begin a career within security and intelligence from speakers at varying stages of their careers and from a range of backgrounds. Speakers: Login to SharePoint to watch a recording of this event There are many different types of jobs within this area, for example, you may be involved in building software, websites or networks or you may be involved in more of a consultative role (advising businesses on how to increase their security). Other jobs include: The information security jobs in demand for 2023 and beyond Cyber degrees – career options Cyber security job site Cybersecurity professionals require a diverse set of skills to effectively navigate the complex landscape of cybersecurity threats and countermeasures. Some essential skills for a career in cybersecurity include: Sources: Prospects and TARGETjobs These skills provide a foundation for a career in cybersecurity, but it's important to note that specific roles may require additional specialised skills or expertise. Ongoing professional development and certifications can also enhance a cybersecurity professional's skill set and marketability. The obvious places to look for jobs are in government departments such as GCHQ and DSTL but there are thousands of specialist cybersecurity companies who provide consultancy support to businesses and organisations. You can also find roles in larger professional service consulting organisations such as Accenture, BT, Cisco, Deloitte, IBM, Microsoft and PwC. CW Jobs - cyber security jobs CyberSecurityJobsite.com EC-MSP Blog Post - Top 15 Cyber Security Companies in London Generic jobsites are also worth searching for vacancies too. More national and regional jobsites it is important to have some work experience or knowledge around cybersecurity when you come to apply for jobs. You could complete an internship or placement within a company in a cybersecurity role or you could select specific modules related to the subject to get some experience. Specialist internships and placements are becoming more commonplace in consulting companies. The Nottingham Internship Scheme offers spring and summer paid internships for University of Nottingham students with a number of these roles in the technology sector. All the opportunities are with small to medium-sized enterprises (SMEs), charities or social organisations in the local area. They take place throughout the year with schemes during spring and summer. This is an excellent way for you to build invaluable experience. Take a look at RateMyPlacement.com and other internship-specific sites Code First Girls Gradcracker Tech Academia To enhance your prospects of a career in cybersecurity, consider attending networking events. Several tech meetups take place in the Nottingham area that you could get involved in. These are good places to speak to like-minded people, keep up-to-date with industry trends and news and pick up some tips too. HackSoc is also a great way to get experience in learning new tech skills and networking with like-minded individuals. HackSoc organises HackNotts Hackathon. Tech meetups HackSoc - UoN student society Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}