{
    "url": "https://www.nottingham.ac.uk/careers/students/work-experience/what-can-i-do/volunteering.aspx",
    "content": [
        {
            "p": "Volunteering is not only your chance to give something back to communities, but you can also: Book a careers appointment Read our blog: Where to Find Volunteer Opportunities While at University University programmes In the city and county In the local area The website below provides examples of organisations who offer opportunities overseas. This organisation and it's partners are not an exhaustive list and are for information only. It does not denote endorsement by the University. Explore opportunities with Go Overseas Also take a look at our working abroad page for more information and resources about working overseas. Our taking time out page contains useful links and a list of questions to ask organisations who arrange work opportunities abroad. MyCareer, our vacancy service, also advertises some opportunities to volunteer overseas. The UK Foreign and Commonwealth Office has recently introduced new official Travel Advice to warn prospective volunteers and visitors about the unintended consequences of orphanage tourism and volunteering. If you are considering volunteer work overseas in any institution for children please read this advice. This online NOOC can help you consider the opportunities available, learn about how to reflect on your experiences, and access helpful information about how to identify and articulate your skills and knowledge. The NOOC explores a range of topics and signposts you to helpful resources on our website. You can do as much or as little of the NOOC course as you wish. Or, you can complete the full course as part of your Nottingham Advantage Award. You can do this by completing the online activities alongside the work or volunteering experience you have gained. Take a look at the NOOC \"The first time I put together my CV, I realised that I was severely lacking in experience. I needed something that would make me stand out. So, I decided to spend my summer volunteering and found a great opportunity with the National Trust.\" A 14-minute podcast brought to you by Jen Balloch, Employability Officer, with guest Madeleine Fox from the Students' Union (SU). They discuss her role and the skills she has developed during her involvement with the SU. Read our blog: Students’ Union: Full-time and part-time Officer roles telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}