{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/pensions.aspx",
    "content": [
        {
            "p": "Pensions, either provided by the state or privately arranged by workplaces or individuals, exist to provide people with income when they are not able to earn (typically after retirement) and sometimes to provide their relatives with benefits after their death. In the UK a mixture of both state and private pensions are managed, with the latter overseeing £3 trillion in assets at the time of writing. Return to jobs list If you have questions about your plans, talk to a member of our team. Book a careers appointment There are many entry points into the pension industry from school leaver to graduate including apprenticeships at various levels. Different qualifications and regulations apply for different roles. Most graduates can apply for roles that are well paid and have good work life balance (see pension careers and The Pensions Management Institute (PMI) for further details) Although countries differ considerably in the balance between state and private pension provision, the fundamental actuarial calculations are transferable. Some of the key roles (pension careers) in the UK pension industry are:- Pension administrator – manages the administrative tasks around pensions including maintaining records, arranging payments, and interacting with pension holders and, after death, their relatives. Pensions manager – manages teams of administrators ensuring legal and regulatory compliance as well as liaising with sponsoring employers, trustee boards and service providers (pensions manager). Pension consultant/actuary – actuaries (see our actuarial work page) specialising in the pension industry. They perform relevant calculations relating to products, help organisations create and deploy pension plans, and communicate findings to relevant non-specialist stakeholders. Investment Consultant – advise trustees on investment strategies and opportunities, facilitating their decision-making role (pensions consultant). Trustees –are usually lay members appointed by employers to provide governance for pension schemes, however there is a growing number of professional trustees firms who specialise in providing this service and who train graduates in all relevant areas (the biggest professional trustee firms in the UK). Legal – professionals who ensure legal compliance Accounting – accountants audit schemes annually to ensure compliance IT – systems and processes need to be secure and flexible in an evolving data driven world.[BD1] Regulator - the Government Actuary's Department (GAD) employs actuaries for pension regulation It is worth mentioning that pension provision and also demographic predictions vary significantly from country to country. Working in an industry where investments are made to provide for requirements up to half a century later is challenging. Health predictions and overall life expectancy vary, markets can be unpredictable and different countries take dramatically different approaches to provision. The sector will be affected by AI, but the need for individual skills to interpret calculations will not go away. The following articles give a flavour of current thinking globally and in the UK. Global Pension Assets Study - 2024 - Thinking Ahead Institute Global Pension Industry Trends - Deloitte US Gain as much work experience as you can including customer facing roles. At the start of your second year, look for summer internships, these are often a pipeline into graduate schemes. At the start of your final year, look for graduate training schemes. You will need to start applying for these in the autumn term. Attend the Management, Finance and Consulting Careers Fair (held annually in October) Sign up and attend employer workshops and presentations Join NEFS (Nottingham Economics and Finance Society) and attend networking events Try online work experience, for example Forage Practice psychometric tests using our online resources and contact careers to make an appointment with a careers adviser to perfect CVs, application forms, interviews – these all take practice, people often fail first time around. Pension Careers jobs and careers advice for pensions professionals Pensions Age Jobs leading pensions market media source Prospects - graduate career information and vacancies TARGETjobs - graduate career information and vacancies telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}