{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/translating.aspx",
    "content": [
        {
            "p": "Translators work with the written word while interpreters convert spoken or sign language from one language to another. Some professionals are able to do both, but they are regarded as separate roles with distinct skill sets. If you have questions about your plans, talk to a member of our team. Translators are responsible for translating written text from one language to another, usually with specific deadlines. It is common for this to be out of the foreign (source) language and into the mother tongue (target language). Whilst staying true to the original text, it also needs to make sense in the new language and culture. It is often confused with interpreting, which focuses on the spoken word. Some language professionals do both, but it is far more common to specialise in one. Examples of translated texts include In this webinar, you will hear from experienced translators and interpreters. They will give you an understanding of their role, the skills needed, and useful advice for getting into this area of work. The speakers are: Login to SharePoint to watch the webinar Translators typically work in one of three ways: During the course of a translator’s career, they might work in all three ways. Watch the video from our Spotlight On: Interpretation and Translation session where James discusses all of the possible routes a translator may take. After an undergraduate degree, many would-be translators opt to study for an MA in translation. A number of universities offer such courses. Another option is to take the diploma in translation which can be completed via distance learning and accredited by the Chartered Institute of Linguists (CIOL), who have a list of training providers. Whilst not strictly essential to become a translator, either option would develop and hone your translation skills. In the case of the MA, you should learn at least one translation software tool and possibly undertake work experience or a live project. Prior to any further study, and/or afterwards, it could be beneficial to spend time in a country whose main language is the one you want to work with in order to deepen your understanding, cultural awareness and vocabulary. There are a number of postgraduate courses in translating. Some are approved by or aligned with a particular professional association, and abide by their quality standard. The CIUTI produces a list of ‘member’ courses. Always investigate the content of the course and particularly the destinations of their alumni. You may want to consider: Who are the trainers/lecturers with my language combinations, and do they work in areas in which I would like to work? Are the trainers/lecturers practising as interpreters/translators, or have they had a professional career in this world? Having a masters in translating doesn’t guarantee relevant employment. Neither does it allow you to work in specific fields such as conference interpreting, or some other specialist interpreting. As mentioned earlier, these are two are very different skills. There are some masters courses in interpreting and translating available, which teach both sets of skills, although the majority of students will go on to specialise in one or the other. It is difficult to obtain work experience in an agency at undergraduate level, not least due to the high level of language and technical knowledge required. For the UN and EU, you need to have graduated to be eligible for their internships. Occasionally, a translation agency may offer a week or two of work experience which would give you an insight into working in this environment. These would rarely be advertised; you would need to get in touch with the ones you are interested in. There are some charities that offer voluntary translation opportunities such as Translation without Borders, TED, Permondo and Global Voices. You could also offer to translate content for a local business or charity. With or without postgraduate qualifications, one of the challenges is getting started. You will need to be persistent and resilient. Some translation agencies such as RWS do take on graduates with no work experience. They advertise any opportunities on their website, and part of the selection process will be a rigorous language test. You can search for agencies using search engines or via the Association of Translation Companies and possibly get in touch speculatively. Some agencies only work with experienced translators and/or have a small number of staff while employing freelancers who do most of the translation work which is then overseen by project managers in the translation agency. The large institutions like the UN and the EU offer highly competitive internships. You need to check the eligibility criteria as you will need to offer specific language combinations. Setting up as a freelance translator straight out of university is challenging as you often need to have a proven track record for agencies or other businesses to offer you work. Some graduates have managed to do this however by being very proactive, and often some added extras such as offering an interesting mix of languages, having some valuable sector knowledge etc. You also need to consider the practicalities of not having a regular income for an unspecified period of time. For this reason, some try to do this around other work whilst trying to get started. The government security service such as GCHQ and MI5 offer linguist roles. Their most desired languages are Russian, Arabic and Mandarin and you must be a British citizen. Prospects: translator job profile Prospects: interpreter job profile Go to our careers using languages page Translation directory telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}