{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/vetphysio.aspx",
    "content": [
        {
            "p": "You don't need to be a vet to become a vet physiotherapist but you will need to complete a specialist course whether that's an undergraduate or postgraduate degree. Find out about this fascinating career area, where you might work, how to gain work experience and where to look for jobs. Talk to an adviser Veterinary physiotherapy is the assessment of the problems of each individual animal and, using critical thought and a large amount of background knowledge, designing a suitable treatment plan. Physiotherapists have a large variety of treatment options to help provide pain relief and restore normal function such as the application of manual therapies (for example, massage, stretching, range of motion) and electrotherapies (such as ultrasound, laser and magnetotherapy). Many animals require specific exercises to complete their rehabilitation, especially after surgery or an acute or chronic musculo-skeletal problem. Physiotherapists can devise individual exercise programs to help each animal (plus riders and handlers too) to reach their full potential. Therapies may also be used to maintain fitness and general mobility even in the absence of clinical problems. National Association of Veterinary Physiotherapists The Institute of Registered Veterinary and Animal Physiotherapists The day-to-day role can vary enormously. Equine veterinary physiotherapists will need to travel to visit several clients, whereas small animal veterinary physiotherapists might have their own practice base or use treatment rooms within veterinary practices. Many veterinary physiotherapists are self-employed, working closely with their local veterinary practices as animals need to be referred via a vet in order to receive veterinary physiotherapy. Relationship building and networking skills are vital in establishing your client base as a self-employed veterinary physiotherapist. Some larger practices or hospitals will have opportunities for in-house veterinary physiotherapists, but these opportunities might not come up often. Some veterinary physiotherapists have set up practices comprised of a group of veterinary physiotherapists. Find out about networking Find out about becoming self employed As we mentioned in the section above, many veterinary physiotherapists work for themselves, but if you are looking for advertised vacancies you can try the following sites. Some of the skills required for this role are: The most common routes into veterinary physiotherapy are: Entry to the University of Nottingham MSc course requires at least a BSc (level 5/6) in an animal or science degree. No specific veterinary or physiotherapeutic knowledge is required as these are taught on the course. Once you’re working as a veterinary physiotherapist you will be expected to undertake continuing professional development, to keep your knowledge and skills up to date. The most common way of learning about any upcoming CPD or further development opportunities is through membership of professional organisations such as: Experience working with animals is very important. In order to study veterinary physiotherapy at the University of Nottingham you will be required to undertake three weeks work experience with dogs, three weeks working with horses, plus six days in a veterinary practice. You could consider approaching local kennels or charities such as the Dogs Trust for experience. Approach local stables for equine experience. You could also volunteer with charities such as Riding for the Disabled Association or World Horse Welfare When approaching businesses or charities to request work experience, be polite, enthusiastic and proactive in making contact, share your career plans and passion for working in this sector. It would be useful to use your initiative and contact veterinary physiotherapists working in your area to ask for any work shadowing opportunities. This would give you a great insight into the day-to-day role. Different countries have different regulations around veterinary physiotherapy. Many countries will require a veterinary medicine and surgery degree as well as a veterinary physiotherapy degree in order to practice. If you are interested in working abroad, start by researching the professional bodies for veterinary physiotherapy in the country you are interested in. You can use GoinGlobal, an international careers database covering 42 countries, to carry out research into the countries that interest you. Log in to MyCareer to access GoinGlobal. This will depend on what you want to achieve in your career. It might be that you wish to specialise in a particular area, further to that you could consider working as a specialist consultant or in veterinary education as a lecturer. If you are working within a veterinary practice, it might be that leadership, ownership and expansion of the practice could offer the career progression you are looking for. For those who are self-employed, you could consider growing your business to employ additional veterinary physiotherapists to expand your business. Prospects - Vet physiotherapy Vet Record Careers - How to become a veterinary physiotherapist Vet Record Careers - A career in veterinary physiotherapy telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}