{
    "url": "https://www.nottingham.ac.uk/careers/postgraduate-researchers/outside-academia/case-studies.aspx",
    "content": [
        {
            "p": "Four former University of Nottingham postgraduate researchers talk about their move into careers beyond academia. My current role as co-founder and chief data scientist at Kubik Intelligence involves combining behavioural science with prescriptive and predictive data science techniques to understand customers' minds and drive sales. My company, Kubik Intelligence, is a cutting-edge market research agency that helps clients reach deep inside customers’ minds and push their ‘buy buttons’. I'm also a board member at the University of Nottingham Business School and I share my expertise as a guest business analytics lecturer and supervisor at a MSc course. I help clients around the world to transform their businesses and increase their profits, but I also specialise in using big data for social good (for example, using big data to solve menstrual poverty) and I've published several peer-reviewed academic papers on this topic. I worked as a global consultant for several years, but my journey into this field began with a multidisciplinary PhD Computer Science and Psychology at UoN, which provided a strong foundation for my work. Through years of experience with international projects across various sectors, I've gained a deep understanding of how to apply data science and behavioural insights to real-world problems. Finally, my passion for innovation and entrepreneurship has also played a significant role in my career. 'Do the scary thing first - get scared later.' I really believe that success comes only when we dare to push our own limits. Additionally, I would advise them to embrace an interdisciplinary approach that combines technical skills with a strong understanding of human behaviour. Practical experience is invaluable, so seek opportunities to apply your research in real-world settings and don't be scared to ask for help. As a learning and development adviser, I work as part of a team within human resources at the University of Nottingham. I manage and deliver individual and group development opportunities for members of staff. I currently specialise in leadership and management, mentoring, and psychometrics. This involves a mix of in-person and online course facilitation, one-to-one appointments, developing training, and project work. During my PhD English Literature, I considered my skills and preferences and realised I was more suited to a career in higher education (HE) professional services, than in academia. The skills which I developed during my PhD (from my thesis, extracurricular activities, and paid work) are useful in my current role. I still use my research, writing, and teaching skills, as well as organisation and project management. In my final year, I successfully applied for the Graduate Management Trainee programme, which trains professional services staff. I completed two six-month placements: first in Education and Student Experience and EDI in Medicine and Health Sciences, then in Learning and Development (where I secured my current role). I would advise researchers to consider which areas of HE professional services appeal to you. Think of all the non-academic staff who have supported your PhD journey. For example, I enjoy teaching as part of my role. Make sure you do work experience as soon as possible: my work as a Researcher Academy demonstrator and my placement with the PGR Careers team were key to my securing my first role. I also recommend speaking to the Careers team about interview preparation! I am a Knowledge Exchange (KE) Fellow at the Nanoscale and Microscale Research Centre, where my role focuses on facilitating communication between the Centre and external stakeholders, such as businesses and the public, regarding materials characterisation techniques. My responsibilities include project management for our business-facing characterisation services, marketing the Centre to attract new clients, and organising public engagement activities. Every day brings something new, making KE a highly dynamic field! I completed both my undergraduate and postgraduate degrees at the University of Nottingham, where I then initially stayed on as a research fellow in a chemistry lab, focusing on sustainable catalyst production. After a year, I realised I wanted to move out of the lab but stay connected to science, so I reached out to the Careers team. My careers adviser Kirstin, introduced me to Strengths Profiling, which revealed my strengths in explaining complex topics and connecting people, as well as my desire for continuous challenges. The very next day, I came across a job advert for a Knowledge Exchange Fellow - a role I hadn’t heard of before, but its key skills, including communication, creativity, and relationship-building, resonated strongly with me. To excel as a KE Fellow, strong communication skills are essential because KE is fundamentally about creating a two-way dialogue between the university and external partners. I recommend that researchers actively seek out opportunities to develop these skills, such as giving talks, presenting posters, or participating in public engagement events. Building relationships, being adaptable, and continuously learning from each interaction are also key to thriving in this field. Hear more from Luke about his role and Knowledge Exchange. Login to SharePoint to watch the webinar I am part of the team of researcher training and development managers (RTDMs) based in the University of Nottingham’s Researcher Academy. As the RTDM for research-focused staff, my role focuses on initiatives and activities that support our postdoctoral and research-focused colleagues – including research fellows, research assistants, research associates and more. My responsibilities include, among other things, contributing to the Researchers14 Networking and Profile-Building programme, the Resilient Leadership in Action programme and the Researcher Academy’s Early-Career Research Leadership Programme. I deliver inductions to support new research-focused colleagues; I run writing retreats exclusively for research-focused staff. I also lead on reporting around the university’s implementation of its Researcher Development Concordat action plan. Before joining the Researcher Academy, I spent the last few years as a Fellow in Gender, Media, and Culture at the London School of Economics. I loved my research, teaching and my department, but I struggled with the precarity that an academic career often entails. I realised that my experience as an early-career researcher – which encompassed teaching, publishing and public engagement – put me in a solid position to support other researchers, which is something I find valuable and I am very invested in. There usually are a great many non-academic roles in universities in which first-hand experience of doing a PhD, of being a researcher, of teaching, of navigating a university is really valuable – research development roles, researcher training roles, research librarian roles, governance roles, and many more. Have a look around, and speak to people in such roles.I find that, more often than not, people are very happy to share their experiences. Allow me to give slightly more general advice: Even though I had worked a variety of jobs before embarking on an academic career, I still found it quite hard to imagine what else I might do if I were to leave formal academic work. I felt very unskilled for anything else, which I gather can be quite a common feeling. Doing a PhD and working in research and/or teaching, however, involves a huge amount of transferable skills. If you are struggling to see what yours are (even though, I assure you, you have them) talk to people – book an appointment with the Careers and Employability Service, talk to colleagues about their experience working in industry, ask your friends about what their jobs entail. You’ll soon start seeing very good options opening up. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}