{
    "url": "https://www.nottingham.ac.uk/careers/employers/profile/index.aspx",
    "content": [
        {
            "p": "We offer a number of ways for you to raise awareness of your company, brand, and recruitment opportunities. We have different options for you depending on what suits your company. We will work with you to find a suitable time in the academic year to raise your company's profile and ensure that it does not fall within vacation periods. Due to the vibrancy of activities taking place across our campuses, please do get in touch as soon as possible. We suggest a four-week lead-in time. Our Recruiter Services team is ready to answer your questions. +44 (0)115 82 32233 You could join us during our events programme at our recruitment fairs or book a time for an employer presentation or drop-in session. You can meet students in an informal setting to raise your company's profile and employability opportunities. For example, employers have come on campus to promote their brand through various initiatives such as coffee carts, free doughnuts, gazebos, ice-cream vans, and interactive games. However, we are keen for all brand awareness initiatives to have an employability element, and all opportunities that an employer advertises are of graduate level. To discuss any on-campus promotional activity that you would like to do and to find an appropriate place on our campuses, please get in touch with us. As the University of Nottingham is a privately-owned property, you will need to get permission to be on our campuses, and we will support you with this. Recruit a student brand ambassador who can connect with other students across the university. Please advertise your vacancy for student brand ambassadors on MyCareer, free of charge. The student ambassadors must follow our university guidelines. Have another suggestion? Please talk to us and let's make it work! telephone: +44 (0) 115 82 32233 fax: +44 (0) 115 951 3679 email: recruiterservices@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}