{
    "url": "https://www.nottingham.ac.uk/careers/alumni/how-we-can-help/index.aspx",
    "content": [
        {
            "p": "As an alumnus of the university, you have lifelong access to our services. We can help you: Are you unsure about your next steps after graduation? Are you currently working but want a change but aren't sure how to go about it? Do you need advice on your CV, covering letter or how to prepare for an interview or assessment centre? We're here to help. Our expert advice will help you work things out wherever you are in the world – just get in touch and we’ll start the conversation. We offer one-to-one careers appointments online through Microsoft Teams, Skype and by phone. Please book an appointment by logging into MyCareer. If you can't log in to MyCareer, email us or give us a call on 0115 951 3680 Monday to Friday 9am to 5pm and we can talk you through it. If you are unsure about using Microsoft Teams or the phone, please take a look at our guide. Please note, that if you are using your personal email, we will need to set up an MS Teams meeting for the appointment. Please check your email for the meeting request. Careers support for alumni of MBA, MSc and PhD programmes is provided by the Business School's Postgraduate Careers team. Appointments can be booked through MyCareer or you can contact the team by: In addition to all the information on this website and our current students' website (still relevant if you have graduated recently), you can also access exclusive online resources free of charge. For example: Employers love Nottingham graduates, and advertise hundreds of graduate opportunities on our exclusive online jobs board. The vacancies on MyCareer cover 30 job areas including: You can also sign up for Jobs by email to get a selection of the latest vacancies direct to your inbox. For a list of job boards and recruitment agencies, visit our vacancies page. If you can't find what you're looking for, visit our career path pages for specialist sources and talk to an adviser. You are welcome to attend our events and recruitment fairs on campus or online. Throughout the year we offer a comprehensive events programme including: Whether you're looking for professional skills and insights or personal motivation and inspiration, your alumni experience ‘Connected we thrive’ is here to help you grow who and what you know. Our inspirational webinars and seminars offer unique insight from leading alumni and university academics on a range of practical topics. You’ll also be invited to exclusive alumni events, both in-person and digitally, across the world. We’re also here to help you stay connected with the rest of your global alumni community. Find out how the alumni team can help you. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}