{
    "url": "https://www.nottingham.ac.uk/careers/postgraduate-researchers/applying/assessment-centres.aspx",
    "content": [
        {
            "p": "If you've been invited to an assessment centre, this is a positive sign that the employer has decided that you could be the right person for the role. You may feel nervous or anxious, as will most people, but remember the employer has asked you to attend, and you just need to demonstrate your qualities and be yourself. Assessment centres are usually the final stage of the recruitment process. They usually consist of a selection of activities which are designed to assess your suitability for the role, focusing on your interaction with others and the key skills the employer requires such as communication skills, leadership skills and so on. The skills they required will vary depending on the role you are applying for. Assessment centres are used in most industries and are usually incorporated into the recruitment process if there are a large number of suitable applicants, or multiple roles available. . It tends to be larger recruiters who use assessment centres. Even if you are applying for a role within academia, the information on this page will still be useful. You may not be explicitly invited to an assessment centre, but an interview for an academic job often contains additional tasks and activities, such as giving a presentation to the team you would be working with. Usually the assessment centre will take up an entire day, with some variation of the following structure: Some employers will provide you with a brief overview of the day ahead of time, but others will prefer to keep information minimal, to encourage candidates to adapt quickly to new information and think on their feet. Although there may be a break in the middle of the day, ensure that you remain professional and in the mindset of an interview at this point, and assume that you are being observed throughout. The recruiters don't expect you to be perfect at every task so don't give up if you don't do very well at one task. They will be interested to see how you show resilience and remain focused for the following tasks. Group activities are one of the most common tasks used at assessment centres, as the employer can observe how each person works in a group setting as this reflects most work place scenarios. You may be set a variety of tasks which will require you to work with the other candidates, such as solving a workplace dilemma or creating a project proposal. You will likely be amongst other postgraduate researches as well as other graduates and career-changers, especially if you have applied for a graduate scheme. If there are any 'big characters' or overconfident personalities in your group, it can feel tempting to try and match their approach to catch the attention of the employer. On the other hand, it might cause you to become reserved, or shy away from fully taking part in the activities. It's important to remember that louder does not equal better, and you should try not to let other candidates influence your approach to the day. Be yourself and focus on the task to ensure the group achieves the outcomes required. The employer will be looking at how you interact with others and assessing skills such as team work, negotiation, leadership and so on. It can be useful to understand your personality type, in order to find where your strengths may be in the workplace and in group settings. Take a look at our MBTI resource if you're interested in finding out more. The advice for postgraduate researchers is very similar to the advice for undergraduate students. Find out more about group activities in assessment centres. Case studies are frequently used in assessment centres to allow employers to observe your approach to tasks and problems. You may be given a specific scenario which relates to the role you're applying for, and the employer may ask you to communicate to the assessor your approach to your solution. Usually a case study task will include a set of instructions and information, with which you will be expected to complete a task. This may be in the format of reports, graphs, or emails, where you will need to take in the information and use it to complete the task they have assigned. As a postgraduate researcher, you are likely to have more experience in project planning, analysis and communication compared to undergraduate candidates, so make sure you demonstrate these skills during the activity. Presentations are often used as part of an assessment centre, as they allow the employer to observe your communication skills. This could be an individual presentation which they may send details to you beforehand, or it could be a group presentation which you will complete with other candidates on the day with no specific prior preparation. During your PhD, you are likely to have some experience in presenting to a range of audiences. Lean on your transferable skills from your research, and use these in your presentation task. Some employers will use an 'in tray' or 'e-tray' exercise, to monitor your ability to work under pressure and prioritise different tasks. You might be given a hypothetical working scenario where your line manager is away for the day, and you've been asked to complete a task and send it back to the client the same day. The employer will be interested to see how you decide to approach the task, and how you find alternative solutions which may not be obvious from the start. To reflect the nature of a role where several tasks of differing urgency come in at similar times, the 'tray' may be filled with new tasks, and you will need to justify your decision to prioritise some over others. The tasks may overlap or have conflicting deadlines, such as urgent work needing approval by your line manager, during a week that they are on annual leave. During a full-day assessment centre, one of the final tasks will be an interview. This stage is one of the most important parts of the day, so make sure you are well-prepared. When preparing for the interview stage of an assessment centre, the advice will be very similar to that for a standard interview. Interview advice for postgraduate researchers Employers often use psychometric tests to provide a measurable, objective assessment of a candidate's suitability for a job or training scheme. They are efficient at being able to deal with large numbers of applicants and are easy to administer. Many organisations use psychometric testing as a way of screening candidates to get to a further stage of the recruitment process. Psychometric tests cover a range of categories including ability, personality, motivational and workplace scenarios. As part of your assessment centre tasks, you may be given an exercise where you will be expected to write and communicate based on a set of information. One format of this type of exercise is that the employer provides you with two project proposals linked to your role, and they want you to analyse both ideas and recommend which is your chosen option and why in written format. Your writing style will need to be formal unless they have specified otherwise, so make sure you have checked the flow of your writing and ensured that there are no mistakes with your spelling and grammar. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}