{
    "url": "https://www.nottingham.ac.uk/careers/students/work-experience/what-can-i-do/online.aspx",
    "content": [
        {
            "p": "Recent months have seen exciting changes in how employers offer work experience opportunities. There are now a variety of online work experience opportunities that you can do from home including internships, placements, insights and vacation schemes. You may also hear them referred to as remote internships, virtual internships or virtual experiences. Explore what’s available, as they could offer you something different. Book an appointment Read Anna's blog post about her internship through Bright Network Online work experience opportunities refer to any kind of work experience that you can do from home including internships, placements, insight and vacation schemes. As more organisations have supported their employees in working from home, some employers have designed web-based platforms and activities to support interns, placement students and students wishing to undertake short-term work experience to gain valuable experience and develop their skills online. These are designed to mirror real life wherever possible. Some companies including KPMG, Linklaters and Citibank, have partnered with organisations such as Forage, to offer live or resource-based activities. Activities include courses for skills development, networking, working on a task, accessing employer information and much more. Barclays Bright Network Forage Think Pacific Some providers of online courses and experiences may charge a fee. The University is unable to provide funding to students to engage in online work experience or skills development. We recommend that you research all options thoroughly and consider the benefits before paying fees to join an online activity. Our advisers can talk to you about your options, just book a careers appointment. There are a wide range of online courses that you can take to learn new skills while at the University or during the vacation periods. A number of examples are listed here: Faculty of Arts Digital Transformations Hub: How To: Practical Guides for Digital Projects The following two Moodle modules draw together a range of high quality, free introductory courses on important digital skills: Introduction to Data and Analytics Introduction to Artificial Intelligence (AI) The websites below are external to the University. Please note that this list is not exhaustive and does not denote endorsement by the University. Google Garage - develop skills for a digital world The Skills Toolkit - free digital and numeracy courses Finance Unlocked Codecademy - free and paid-for courses Udemy - wide range of free and paid-for online courses OpenLearn - free online course on a variety of topics Ahrefs Academy - lots of free video tutorials on digital marketing and blogging for business SEMrush - free digital marketing courses HubSpot Academy - free sales and marketing courses LinkedIn Learning - 1 month free trial Future Learn - wide range of online courses Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}