{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/actuarial.aspx",
    "content": [
        {
            "p": "Actuaries provide mathematical risk management expertise in the reduction of financial uncertainty to acceptable levels and try to predict how financial products will perform in the future. They are an essential component of pensions, insurance, investment management and any other role facilitated by predictions of the future, especially in terms of financial performance. Students with any degree can be trained to be actuaries, but the exams are easiest to take from subjects that are highly numerate, have a good understanding of business principles, economics, and legal regulations. If you have questions about your plans, talk to a member of our team. Actuaries are trained to use mathematical approaches based on statistics and probability theory to measure past financial trends, generate predictive models of future scenarios and report mathematical risks and recommendations to non-specialists. Thus, they also have to be good at communicating results to stakeholders concisely and accurately, whilst fully complying with legal frameworks. UK actuarial qualifications are very transportable, so it is very easy to work anywhere in the world after qualifying. Roughly 50% of actuaries are employed in the pensions, insurance, and reinsurance industries: three quarters work for consultancies or insurance companies. The most common fields that actuaries work in are life-insurance, general insurance, and pensions. Most consultancy firms have an actuarial division. Actuaries are often employed within financial risk management, for example fund management, hedge funds, investment banks, rating agencies, and risk management firms. The Government Actuary's Department (GAD) also employs actuaries for a number of roles including pension regulation, while the Financial Conduct Authority FCA employs actuaries in the regulation of insurance. Increasingly actuaries are also involved in climate change, cyber security, data science, healthcare and technology – in an increasingly uncertain world the need for actuarial analysis is very unlikely to diminish! Summer internships immediately prior to final year frequently result in offers – they are advertised from the very start of the penultimate academic year. Graduate Training Schemes for actuaries are advertised as the very start of the final year. Adverts for internships and graduate training schemes are advertised on:- MyCareer Our vacancy portal (only available to Nottingham students and alumni) Alternative routes: Actuarial analysis is too integral to risk management to disappear. With the rise of AI, manual calculation is likely to be replaced by automation over time: it is worth noting that this has not happened yet despite the obvious competitive advantage that an organisation deploying it would have! The general consensus (see examples below) seems to be that the nature of the role will become increasingly people focussed, but the need for expertise in interpreting calculations and advising non-specialists is very unlikely to disappear in the near to medium term future. This is because someone has to understand the mathematics behind predictions, if only to regulate the industry, confirm predictions are accurate and interpret findings for other. Read The Actuary Magazine article - The Future of Actuarial Science Gain as much work experience as you can including customer facing roles. At the start of your second year, look for summer internships, often in actuarial firms as these are often a pipeline into graduate schemes as a successful placement frequently results in a job offer. At the start of your final year, look for graduate training schemes. You will need to start applying for these in the autumn term of your second year. Attend the Management, Finance and Consulting Careers Fair (held annually in October) Sign up and attend employer workshops and presentations Join NEFS (Nottingham Economics and Finance Society) and attend networking events Try online work experience. Practice psychometric tests as much as you can and contact careers to make an appointment with a careers adviser to perfect CVs, application forms, interviews – these all take practice, people often fail first time around. Acturial Careers - career information and the latest graduate vacancies in the actuarial profession. Actuary List - latest job vacancies and blog posts about the actuary profession eFinancialCareers - provides industry news, advice and job listings The Actuary - magazine that provides news about the industry, a dedicated page for graduates entering the profession, and job vacancies The Faculty and Institute of Actuaries (IFoA) - information on the role of an actuary, a list of actuary firms to monitor for vacancies, and support finding work experience and jobs. TARGETjobs - graduate career information and vacancies upReach - programme for providing social mobility into actuarial careers. New scheme launched in 2022 telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}