{
    "url": "https://www.nottingham.ac.uk/careers/students/furtherstudy/applying.aspx",
    "content": [
        {
            "p": "Making an application for a postgraduate course is very similar to applying for a job. You need to convince the admissions tutor you have: Visit our dedicated pages for specialist advice on applying for: Preparing and writing a personal statement for teaching Book a careers appointment Read our blog: Choosing a Master’s: My Tips There is no central admission system for most taught and research masters courses in the UK except for teaching, law, nursing and midwifery, and social work. Apart from these courses, you will apply directly to the higher education institution. You will need to prepare and submit a personal statement as part of the application process. Follow the guidance below to make an impactful personal statement. While some courses have deadlines, for example graduate medical programmes, others will close once all the places are filled. Popular courses can be full as early as the Christmas prior to starting. For other courses places may still be available right up until they start. All universities produce prospectuses and often have open days. Always visit the campus and talk to staff and students before accepting an offer. You need to think about funding before you have secured a place as some forms of funding may require you to apply before the course application deadline. You apply directly to the university via the online system. You will be asked to upload scanned copies of your transcript or degree certificate. Depending on the course you are applying for, you may be asked to provide two references, including at least one who can comment on your academic ability. Depending on the course, you may be asked to either write a personal statement, or answer several application questions around your motivation and suitability to apply for the course. Use the information below on crafting your personal statement to answer these questions successfully. Try to avoid repetition in your answers by putting more emphasis and details on different things in each answer. Applications for teacher training are made through DfE Apply, and MA Social Work are made through UCAS. It is one of the ways in which those offering the course will begin to judge your commitment to your chosen area of study. For some courses it will be one of the main methods used, while others may use it as a preliminary assessment and will then ask you to attend an interview or other assessment activity. Most application forms will indicate what they would like you to concentrate on, for example, the University of Nottingham postgraduate application states: Before writing your personal statement, research and consider the following: You’ll usually need to provide the contact details of at least two ‘referees’ who can vouch for your academic skills and motivation. If you’re applying for a masters straight after your undergraduate degree, you typically choose two university tutors who know you well. Here are some tips to bear in mind. This may vary from one page of A4 to a text box in an application form with an instruction which allows you to continue on a separate sheet or a word limit, which might vary depending on the course and institution. For teacher training applications you may be limited to a specific number of characters. A course or admissions tutor will probably read your statement to check that you meet any eligibility criteria and also to assess whether or not you will be awarded a place or called for an interview, if there are more applicants than places available. Make sure the vocabulary and language style you use are appropriate for this audience. Some courses will set out areas they wish you to address in the statement. They may also state whether or not you can include other supporting documents, for example, a CV. Make sure you clearly address all the areas they want you to cover. Stick to any rules on length and word limits, as well as supporting documents. Your application may be rejected because of your inability to follow the limits set or the assessors may discard the additional text or documents you have included. Preparing and writing a good personal statement takes time. You will probably need to allow time to prepare a first draft, ideally receive some feedback on it and then finalise your statement. A rushed statement stands less chance of being successful. If you are applying for several different courses, then you will need to prepare a separate statement for each course, except where your application is made via a central portal such as for teaching or law. Book an appointment with adviser to review your personal statement Be factual, concise and positive. Make sure your grammar and spelling are accurate. Remember to focus on the experiences and interests that you bring to the course and how they will help you to study successfully. Avoid a simple repetition of statements made in the course publicity as this gives no indication of your capacity to think critically; a skill you will need to use in any postgraduate programme. FIndAMasters - for more advice on personal statements This example is far too vague and only states what the applicant will gain from the course. It shows no evidence of research into the course or potential career. Good personal statement This is much more focused and better researched. I am very committed to a career in marketing and have been to several presentations on this career area and have undertaken a period of work experience in a small marketing agency. As a result, I have decided that undertaking a postgraduate marketing course would be an essential next step towards my career ambition. I am particularly interested in the course offered at Littletown University as it combines practical placements in both marketing agencies and company departments with the theoretical study of the principles of marketing. I would also value being able to begin to work towards the Chartered Institute of Marketing qualification offered by the course.” An admissions tutor would consider this applicant a risk to offer a place as they have not decided which area of study in and why. I am currently studying for a BEng in Electrical and Electronic Engineering and would like to continue onto a masters course. I have looked at a number of different courses and have made applications for several different ones as I am not yet totally sure of which area of electronic engineering I would like to follow more closely. Again, a well-researched statement, which will impress an admissions tutor. I am currently studying for a BEng Electrical and Electronic Engineering. I have particularly enjoyed my final year module in electronic communications technology and am about to begin my final year research project in this area. My interest has also been stimulated by attending lectures delivered by industrialists, for example, Richard Smith, a design and development engineer, working for MobPhones Worldwide Ltd. From listening to these lectures, I realised that I would like to study communications technology in more depth and to be able to eventually undertake research in this fascinating field. Many employers use standard application forms, which often do not cater for the variety of qualifications that international students apply with. You can get a statement about how your qualifications compare to UK equivalents from UK ENIC - UK National Information Centre for the recognition and evaluation of international qualifications and skills. Go to UK ENIC If you are making an application to study outside the UK, make sure you take time to understand the application process. The documents and forms you may need to supply will vary. For example, a student applying for a course in France needs to prepare a three-page statement addressing a series of questions relating to academic and intellectual ability as well as personal reasons and understanding of the nature of the course. If you are applying to study in the USA, you should ideally begin the process at least 18 months prior to the course starting. A good place for information is the Fulbright Commission Course providers will always follow the same underlying principles with applications by reviewing what you have written to see if you are suitable for the programme of study you have chosen. Prospects - applying for courses overseas Noah Ajanaku, Public Health master's student Read Noah's blog post telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}