{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/assessmentcentres/group-exercises.aspx",
    "content": [
        {
            "p": "The group exercise is the most widely-used activity at assessment centres. Employers use them to assess how you interact with others and how you'd perform in the role. Find out what to expect and how you can stand out during a group exercise. Attend a mock assessment centre Read Belbin's roles and behaviours of group members Depending on the task, group exercises typically assess one or more of the following skills: Group exercises can take a variety of forms, however, the most common activities include: Case study scenarios - involve the group being given a work-related situation or challenge. All candidates may have the same brief or you may be given different information to bring to the task or different roles to play. Discussion exercises - involve the group being given a topic to discuss. Topics may be sector specific, a current topic in the news or an area of general knowledge. Ice breaker or team task – the group will be set a practical or intellectual challenge to complete within a specified timescale. Assessors will be looking at how you work as a team to plan, implement and achieve the task. Through Graduates First you can access a wide-range of resources. It also has a useful Top Employer Profiles and Job Assessment Stages section linking to further information about how each organisation approaches its recruitment process and the kinds of assessments you may face. Over 100 organisations are profiled on the site. There are short videos to help you navigate the process of preparing for group exercises including tips, step-by-step guides, feedback reports and a jargon buster. Students - register for free access using your UoN email address Alumni - email our team for free access When working as a team not everyone can be the leader, nor is everyone a natural leader. Belbin identified nine different roles and behaviours carried out by team members. Think about your strengths and consider the type of team contribution you can make. Read Lucy's blog: My group activity assessment centre advice Participate by making regular contributions during the task. This could include sharing your ideas or having a motivating impact on the group. Value everyone’s input – encourage quiet members to contribute by bringing them into the conversation and acknowledge good points made by other candidates. Demonstrate active listening skills by asking questions and use verbal and non-verbal cues to show you agree/understand what is being said. Compromise on areas to ensure the end goal is reached. Challenge others if you disagree with their ideas or point of view but remember to always back up your argument with reasoning. Ensure everyone understands the task objective, suggest a plan of action and keep an eye on time by suggesting that someone is the timekeeper. Bring the group back on task if the discussion goes off on a tangent. Dominate the discussion, shout the loudest or become argumentative. These are not the traits of a good collaborator. Interrupt or talk over other candidates while they are talking or dismiss others point of view. Sit and think without contributing to the conversation or task. If you have an idea or thought, say it before someone else does. Volunteer to record the discussions on behalf of the group unless you can use this to your advantage to facilitate the discussion. You may risk becoming the minute taker rather than actively contributing to the task. Demonstrate negative or closed body language such as folded arms or poor eye contact. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}