{
    "url": "https://www.nottingham.ac.uk/careers/students/applications/interviews/prepare.aspx",
    "content": [
        {
            "p": "You’ve made it to the interview stage. Congratulations. Being invited to an interview means that the recruiter feels that you have potential to fulfil the role on offer. They want to gain an insight into your personality, understand your motivations for applying and assess your experiences, your behaviours and skills. Find out how to best prepare yourself, talk confidently about your skills and experience to have the best chance of getting the job or internship. Return to the main interview page Book an appointment with an adviser Attend an interview skills workshop The priority is to revisit your research about the company and the job role. Once you have received your invitation, use the research you did when you first applied and get a good understanding about who they are and what they do. You want to be able to talk confidently, not necessarily in detail, about the employer. Consider the following areas and this list is by no means exhaustive. Find out more about researching employers and the sector If you have a disability or health condition, you have the right to request “reasonable adjustments” during the different stages of the recruitment process, under the protection of the Equality Act 2010. These adjustments are intended to level the playing field, allowing you to showcase your abilities and talents without being hindered by barriers. Let your potential employer know as soon as possible that you require adjustments. You do not need to have a formal diagnosis to be eligible adjustments, but you will need to be able to explain what you find difficult, so the employer can make suitable adjustments. Employers may make adjustments to the interview, such as allowing extra time or providing the questions in advance. Go to our Disability and Accessibility in Careers NOOC In addition to understanding the company, you also need to be clear on the exact nature of the role you are applying for. Using the job description and personal profile, if available, answer the following questions. You may need to interpret the employer’s language and if you are unsure about anything, please contact us. Use the job description to formulate potential interview questions and also use our list of types of questions that employers ask Go to our page on the different types of interview questions It's helpful to think about various examples that illustrate what they are looking for. Think about which example would be best for each question. An employer is not expecting you to give industry-related examples at this stage as you are at the start of your career. Use examples from your academic studies, extracurricular activities, an internship or part-time job. The employer will be analysing how well you can articulate your experience and how it relates to what you will be doing in the job so focus on your transferable skills. Consider the following. Read our blog post - Applications and Interviews: How to Choose Your Best Examples A local employer, Jigsaw24, has created two videos to offer advice on preparing for an interview. Jigsaw24 is a member of the Digital, Data and Technology Board, which includes a number of employers alongside representatives from the University of Nottingham and Nottingham Trent University, who work towards supporting talent in the local region. Watch this video: Preparing for an interview Watch this video: During an interview Everyone has interview nerves but what can you do to let the real you shine through? Kirstin Barnard, Senior Careers Adviser, talks you through the various ways you can overcome your nerves before and during the interview. If you want to ask for adjustments, refer to our Applying with a disability page I've been offered the press and marketing assistant role! telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}