{
    "url": "https://www.nottingham.ac.uk/careers/students/choosing/my-degree/genetics.aspx",
    "content": [
        {
            "p": "Geneticists can work in research and patient facing roles in areas such as clinical science, cancer genomics, genetic counselling, clinical genetics amongst others. A genetics degree is extremely versatile. Many graduates commit to scientific careers, but others find themselves in employment in areas such as health communications, Law, regulatory affairs and finance. Book an appointment or attend a drop-in Check out our careers events Search for graduate jobs and internships As well as the skills developed on your course, participation in extracurricular and work experience, organisations large and small are also looking for students to have developed a range of attributes such as the following while at university. What employers seek from candidates is evolving all the time and it is important that you keep up to date with recruitment trends in the career areas that interest you. Scientists and other professionals are using discoveries in genetics to revolutionise the world. This means careers in genetics and genomics are booming. According to the Genetics Society, demand for graduates in genetics and related fields is strong. A good qualification is much sought after by many employers. Universities require researchers and technicians and lecturers in a wide range of genetic-related fields. Hospitals require genetics clinicians, researchers, technicians, counsellors, and nurses. Find out more about careers within the NHS Agricultural, pharmaceutical and biotechnology industries require researchers and technicians in addition to people with knowledge of genetics to work in management, writing and reporting, marketing, sales and public relations. Find out more about science careers beyond the lab. Government bodies and agencies require administrators, managers, and officers with knowledge of genetics for decisions in science policy, regulation, advice, legislation and awarding research grants. In addition, genetic training in combination with another field such as law, computing, engineering can open up further avenues. Finally, a genetics degree, can be beneficial to careers not directly linked to genetics or even non-science related careers. Public health is closely related to your course of study and if this area interests you then do look at the areas of health protection, and health improvement and you could find yourself working for the NHS, the Government, local government, the Armed Forces or the charity sector. NHS Public Health Careers Do you like communicating? Enjoy writing? Have you thought of science communication and science writing? Science writers research, write and edit scientific news, articles and features in a range of different formats, including: More about science communication Association of British Science Writers Science communicators do much of the above but they may also organise exhibitions, produce film and digital content and present science education to the public. You may want to consider a specialist masters course in science communication such as those offered at the following universities Imperial College, Sheffield, West of England, Manchester Metropolitan, and Edinburgh. Medical sales representatives or ‘reps’ are a key link between medical and pharmaceutical companies and healthcare professionals. They typically sell medicines, prescription drugs and medical equipment to GPs, hospital doctors, pharmacists and nurses, working to raise awareness and use of their company’s products. Prospects - medical sales rep The European Medical Writers Association (EMWA) describes medical writing as ‘communicating clinical and scientific data and information to a range of audiences in a wide variety of different formats. Medical writers combine their knowledge of science and their research skills with an understanding of how to present information and pitch it at the right level for the intended audience. European Medical Writers Association We tend to think of pharmaceutical companies as huge global corporate, and they do account for the majority of UK Pharma employment. But a growing number of small to medium sized enterprises are becoming involved in drug development too. The Association of the British Pharmaceutical Industry (ABPI) has developed a comprehensive list of pharmaceutical companies, their contact details and some of the areas they regularly recruit into. It is searchable by location, category, employment area and type of role, for example internship, graduate training programme. Find out about the jobs in the sector The Association of the British Pharmaceutical Industry Science degrees develop analytical, communication and numeracy skills and so there are many directions that a science graduate can take: Science and pharmaceuticals job profiles from Prospects summarise common destinations of those with science degrees who want to carry on using their degree, including There are also jobs such as teaching and education-related careers which draw on your scientific knowledge. Genetics graduates enter a diverse array of roles spanning accountancy, actuarial work, banking, charity work, finance roles, legal roles, marketing, public relations, sales and so on. Explore a range of graduate roles Taking a PhD allows you to carry on in the direction of your favourite discipline, subsequently you could take post-doctoral research and potentially pursue an academic career. At any stage in this pathway you will have other job opportunities, and remember there is no rush to get a master's or a PhD either can be done at any point in your working life. When considering further study, it is important to note the differences between master's and doctorates, especially in terms of funding. Entry requirements for masters degrees are usually 2.2 and for PhDs 2.1 at BSc level – master's degrees might help competitiveness but are not normally a requirement. Find out more on out Further study page Association of Medical Research Charities (AMRC) AMRC lists organisations conducting health and biomedical research. Depending on monies available, each organisation will fund research opportunities (PHD scholarships) in collaboration with universities and research institutes. MRC Human Genetics Unit - working there and latest news MRC Science Areas NHS Healthcare Careers – Clinical genetics NHS Healthcare Careers - Clinical bioinformatics (genomics) NHS Healthcare Careers - Genomics Counselling NHS Scientific Training programme Royal Society of Public Health - careers information and vacancies The British Society of Genetic Medicine - information and training The Genetics Society - for careers advice The Wellcome Trust Centre for Human Genetics - work and study information telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}