{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/beyond-vet-practice/vet-adviser.aspx",
    "content": [
        {
            "p": "You may already be aware of some of the veterinary pharmaceutical companies that supply practices with drugs and other medical products. One of the most common alternative career paths for vets not wanting to remain in practice is working for such firms. Veterinary adviser is the usual job title, but this can vary from firm to firm, for example an international technical manager. Find out more about science careers beyond the lab Return to the Vets homepage Book a careers appointment Presenting to a wide variety of different groups is a core responsibility. For example, you may be presenting to practicing vets about a new product range, utilising your clinical knowledge and experience to explain how they could use the products in their practice work. You may also present or demonstrate at seminars and conferences to follow industry professionals on innovations and scientific developments in your range. Drawing on your veterinary knowledge, you would advise your colleagues researching new products on whether certain reactions and results of trials are normal or indicate a potential health risk. You would also provide input to the research team in terms of potential new product areas to be researched based on your insight into the products that practicing vets would find useful. When vets are faced with an unusual case, they may contact you to discuss treatment options. This aspect of the role can be particularly satisfying as it enables you to apply your clinical knowledge to individual animals. Your marketing team may ask for your feedback on the best way marketing approaches based on your experience in practice. You may also design and deliver scientific training to the sales team to enhance their credibility with clients, and accompany sales colleagues to new business pitches. Many vets that go into a veterinary adviser role have around five years of practice experience. This gives you professional credibility with clients due to your familiarity with research and products they have previously utilised. However, you shouldn't dismiss this option if you are interested in becoming a veterinary adviser with less than five years experience. Your attitude and vet skills are just as important as your experience and you will be given product training on the job. Recruiters will also be looking for evidence that you are commercially-focused and have a business mindset. You will need to demonstrate how your practice work was influenced by your values and show an understanding of how the pharmaceutical industry works. Networking while in role will be the key to career progression and securing more senior roles over time. Your approach to job-hunting will need to incorporate both direct applications to pharmaceutical companies and utilising recruitment agencies. See the further resources section below for useful job-hunting websites. Using LinkedIn to open up networking opportunities can be very beneficial in order to be both approached by recruiters, and to research companies and influential people within the industry. As a starting salary, you can expect to receive somewhere between £40,000 and £50,000. This is dependent on the location of the role and your level of prior experience. You may also get an annual bonus or profit share decided by the company's financial performance. Indeed Vet Click LinkedIn News Now Vet Futures – Your passport to the future © CoSector, University of London. Used with permission. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}