{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/speech-therapy.aspx",
    "content": [
        {
            "p": "Speech and language therapists provide treatment, support and care for children and adults who have difficulties with communication or with eating, drinking or swallowing. The role may vary from working with children with a stammer to supporting an individual who has developed difficulties in communicating, eating or swallowing following a stroke or head injury. The role of SLTs includes the assessment and diagnosis of speech and language needs and the provision of advice and therapy to patients and their families. SLTs work within hospitals and in a variety of community settings including health clinics, private practice, charities, schools, assessment units and day centres. Some SLTs work within the criminal justice system working in prisons, young offenders’ institutions and courtrooms. Community-based SLTs will undertake a proportion of their work within the homes of patients. Return to jobs A-Z Book an appointment SLTs work with patients and their families from a variety of backgrounds, ages, and ethnicities and therefore it is essential to possess excellent communication and interpersonal skills. Therapists also need to be able to motivate patients and have the ability to reassure others. Speech and language therapy involves a high level of multi-disciplinary team working and liaison with a variety of professionals including doctors, nurses and teachers to name a few; it is therefore important to be able to collaborate and develop good working relationships with others. Having additional languages and cultural awareness can also be very useful to offer a bilingual service and work with the diverse communities in some areas. Speech and language therapy in the community will involve travel and therefore having a driving licence would be beneficial or essential depending on location. Technology is helping to redesign innovative therapy systems through computer-aided therapy sessions and engaging patients using interactive activities on tablets and smartphones. In addition, the use of Skype/video conferencing tools is widening accessibility to services. Read The Guardian article about technology and speech therapy To practice as an SLT you need to be registered with the Health Care Professionals Council (HCPC). To become an SLT you will need to complete a HCPC approved degree (3/4 years) or an accelerated postgraduate programme (2 years). The NHS Health Careers website provides information on institutions that offer HCPC approved courses. Many SLTs work within the NHS. The usual starting salary for an SLT is at NHS pay band 5 with advanced specialist roles at band 6 & 7. Information on salary pay bands can be found at NHS Health Careers Employment may also be found with private healthcare providers and independent therapists. You can contact your local SLT provider or organisation for an opportunity to work shadow and gain an understanding of the profession, however, more long term opportunities may be difficult due to the confidential and sensitive nature of the work. You might find some work shadowing opportunities in the Nottingham area or through your local healthcare trust at home. You can also explore opportunities to gain experience in a care or educational setting where you may work with individuals with learning and communication needs. Volunteering with organisations who may support individuals with speech and language needs is another way of gaining valuable experience with potential client groups: Stroke Association National Autism Society British Stammering Association Cleft Lip and Palate Association Down Syndrome Association Headway While studying here at Nottingham, you can find volunteering opportunities through the Students’ Union or explore the opportunities to work with young people through our widening participation initiatives. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}