{
    "url": "https://www.nottingham.ac.uk/careers/employers/vacancies/placements-policy.aspx",
    "content": [
        {
            "p": "This policy is relevant to employers who are advertising a placement or internship with us and students who are planning or accepted a placement or internship. Employers: If you have any questions about this policy, please contact our Recruiter Services team Students: If you have any questions about this policy or the status of your placement or internship, please contact our Internships team. Employers - Email us Students - Email us This policy has been written to outline the University’s position on the promotion and endorsement of paid/unpaid placements and internships within the UK. The policy applies to University of Nottingham UK staff/students and organisations/employer partners who intend to promote placement and internship opportunities to University of Nottingham UK students. The policy is determined by National Minimum Wage Legislation and UK Government Guidance titled ‘Employment rights and pay for interns’. In the context of this policy ‘placements and internships’ are defined as work-based learning and/or work experience opportunities that are either extra-curricular or an integrated component of a student’s academic studies. This policy supports key strategic aims of the University of Nottingham, notably; This information is for University of Nottingham UK staff and students and for UK organisations who wish to recruit University of Nottingham students. The university encourages students to participate in activities that will enhance their learning experience. This policy has been written to outline the university’s position on the promotion and endorsement of paid/unpaid placements and internships within the UK. The university will only seek to promote opportunities which it believes will provide students with valuable skills and/or experience in readiness for their future professional careers and personal development. Unpaid internships and placements can offer valuable opportunities for students to gain work experience and put their learning at university into practice. However, the University of Nottingham will only advertise and promote unpaid opportunities to students which comply with National Minimum Wage (NMW) legislation and meet the guidelines set out here which are designed to ensure equality of opportunity for all University of Nottingham students in the UK and avoid exploitation. The key exemptions from NMW which will apply to placements and internships are: Opportunities for students to work in the UK which do not meet the above criteria are not exempt from NMW legislation. These opportunities should only be promoted and advertised by staff within the University if they are offering an appropriate salary taking into account factors which include but are not limited to location, expected commitment by the students, and industry standards. In all cases, the amount of salary offered should under no circumstances be lower than the applicable NMW. We will only advertise an unpaid placement/internship if: Where a student is receiving a stipend or bursary for an out-of-term research project, hours of work should be calculated to reflect NMW legislation. For further details please consult the government’s National Minimum Wage guidelines on work experience and internships: GOV.UK - The National Minimum Wage and Living Wage GOV.UK - Minimum Wage: work experience and internships The policy is designed to ensure equality of opportunity for all University of Nottingham students in the UK and to avoid exploitation. Non-compliance to the policy will lead to the risk of exploitation of University of Nottingham students and a reputational risk to the University of Nottingham. If you have any questions about how this applies to work experience opportunities within your school or professional service, please contact the Recruiter Services team on 0115 82 32233 or email them. Review annually Policy Name: UNUK Policy on Paid and Unpaid Placements and Internships Policy reference number: Allocated by Central Assurance Team Policy category: Allocated by Central Assurance Team Subject: UNUK Promotion and Advertising of Paid and Unpaid Placements and Internships Approving authority: Student Education Committee and Teaching and Learning Committee Accountable person: Registrar Responsible Team: Careers and Employability Service Last updated: December 2024 First approved: September 2015 Global application: UNUK telephone: +44 (0) 115 82 32233 fax: +44 (0) 115 951 3679 email: recruiterservices@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}