{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/supply-chain.aspx",
    "content": [
        {
            "p": "This sector covers a diverse range of occupations throughout supply chain including; manufacturing, sales, marketing, engineering, process management, IT and more. Often linked with logistics, supply chain incorporates all areas of business, from sourcing raw materials to delivery of the product to the end user. Book an appointment The terms supply chain and logistics are often referred to interchangeably and may mean different things within different organisation depending on how they are structured. Logistics refers to the transportation of good whereas supply chain refers to the entire network of people, activities and resources involved in getting raw materials from supplier to manufacturer to the end user. The dot.com revolution changed how supply chain and logistics worked because customers are now able to buy directly from suppliers through sites such as Amazon and eBay, making the above model much more complicated in reality. Supply chain often links different roles from different departments across an organisation and when done effectively supply chain lowers cost and makes a company more profitable. There are many different types of roles available within supply chain that draw on a range of different skills. The role of a supply chain management graduate may focus on the following areas, depending on how the company is structured: Some companies might outsource certain aspects of their supply chain or logistics operation to third parties such as their warehouses or a logistics company. There are lots of other roles that play a vital role in supply chain management and optimising supply chain efficiency within an organisation such as: Any company that uses or produces materials or products will have a supply chain. For example, in the UK the National Health Services (NHS) has a supply chain of medical goods from small to large suppliers, ensuring surgeries and hospitals have the equipment they need. Fast-moving consumer goods (FMCG) is a sector where having an efficient supply chain is pivotal to business performance. There is an increasingly fast movement towards automation and connectivity, meaning that more parts of the supply chain process will be done by technology rather than people. This is will require people to learn new skills as job roles evolve, for example using technology to improve risk prediction and anticipate issues before they arise, or being able to use technology to move goods faster in response to customer needs within an ‘on-demand’ economy. The Internet of Things (IoT), artificial intelligence, robotics and 3D printing are predicted to have an increasing impact in this sector. Streamlining the supply chain process is also a key priority for many organisations, such as reducing the number of suppliers. This may have an impact on the skills required to do well in this area, such as process management and relationship management. Resource-efficient sustainable production has been identified as a driving force for growth and development. Customers and companies are also more aware of environmental and sustainability issues, for example some resources are predicted to be more scarce in the future, which will affect price, availability and more. Being able to manage these factors will be essential in running a successful supply chain operation. Brexit may also have implications for this sector, for example extra costs of moving goods to and from the UK. At this stage it is impossible to say exactly what the developments will be. Life as a supply chain graduate will be fast-paced and challenging due to the nature and speed of production. Companies tend to allow graduates from all disciplines to apply for the more general supply chain management schemes providing they can demonstrate the skills that will be key to working in the environment. Although there will be some graduate schemes aimed specifically at engineering or science students due to the nature of the work involved, and in some cases these degree disciplines may be favoured. In general candidates will need to demonstrate: Boots supply chain jobs Unilever Future Leaders Programme Prospects supply chain manager profile telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}