{
    "url": "https://www.nottingham.ac.uk/careers/students/work-experience/on-offer/sustainability-challenge.aspx",
    "content": [
        {
            "p": "Join us for this year’s Sustainability Challenge, which gives you a chance to explore innovative ideas to drive sustainability, develop sustainability solutions for our campuses, and build essential employability skills. Throughout February 2025, you’ll develop and pitch your ideas while gaining insights from sustainability experts. The Sustainability Challenge is good for the environment on campus and for you. Applications open on Monday 4 November. Apply now Read our blog with insider tips and information The Sustainability Challenge is designed to encourage you to generate ways to reduce waste, increase efficiencies and implement new sustainable ideas for our campuses. You will work in a small group with students who have similar interests to you. Last year, nearly 100 students signed up for the challenge and their ideas ranged from composting and promoting vegan choices, to sustainable clothing opportunities and utilising technology to generate energy. The Sustainability Challenge will give you the opportunity to: Read Megan's blog: Sustainability Challenge: A Personal Reflection The Sustainability Challenge will take place over four Wednesday afternoons on 5, 12, 19 and 26 February 2025 between 1.30pm and 3.30pm (until 4pm for the final session). You must be able to commit to all four dates. Session one – The first session will introduce sustainability efforts at Nottingham, with insights from the Student’s Union and the sustainability team. Additionally, a guest employer will present on idea generation, offering advice on how to brainstorm innovative sustainability concepts. Session two – In this session, you will continue to develop your ideas from the previous week. One of our employer partners will present on sustainability in business and how to pitch sustainability ideas effectively. You will then be matched with students with similar concepts to yours to build on these, refine your recommendations, and craft a persuasive pitch. Session three - This session is dedicated to refining and finalising your sustainability ideas. Teams will work together to develop their concepts further, with the support of key stakeholders. Session four – In the final session, teams will present their sustainability solutions to a panel of experts. You’ll benefit from valuable feedback and networking opportunities with sustainability professionals. By participating in our Sustainability Challenge, you will have the opportunity to apply your knowledge and skills in sustainability to real-world challenges. This is a unique chance to: Last year's winners of the Sustainability Challenge proposed an impactful idea, focused on introducing sustainable-themed days in catered halls. Their initiatives aimed to maintain popular meal options while focusing on reducing the carbon impact of meals served. Their key components included: featuring an ingredient of the day to highlight sustainability, offering recipe cards to encourage long-term sustainable eating habits, posting informative posters and sharing content on Instagram to raise awareness, and introducing an inter-halls challenge to engage students in reducing their carbon footprints. The campaign promoted long-term lifestyle changes that extend beyond the halls and into everyday life. Whether you’re passionate about energy efficiency, food sustainability, or waste reduction, we’re excited to see what innovative solutions you’ll create. The Sustainability Challenge is a collaboration between the Careers and Employability Service, the Sustainability Team and the Students’ Union. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}