{
    "url": "https://www.nottingham.ac.uk/careers/staff/what-do-we-do.aspx",
    "content": [
        {
            "p": "We provide comprehensive support to students, graduates and early career researchers at the university to enhance their employability, and provide the best opportunities to develop a rewarding and fulfilling career for the future. Our dedicated faculty teams are available to help, and each area has a careers consultant who can be your first point of contact for questions about how we can help. View the contact for your faculty We offer a wide range of support, including: We will work with you to ensure that all students and graduates within your faculty and school can access these services as required, and are provided with the best opportunities to progress in their career after university. You can also view the students' section of our website to view the full range of our support. Information on graduate outcomes is provided below. Visit the students' website Like us on Instagram Read student and alumni stories on our blog Our Guide to Your Career gives students a glimpse into many aspects of their career journey. Whether they are a first year or master’s student, there's something for everyone. They navigate four simple sections and dip into short articles plus they can explore real-life student and alumni case studies. Go to begin! We are committed to supporting the career development of our postgraduate researchers. They are given tailored support whether they are continuing an academic career, or are considering a career outside of academia. Visit our PGR website We actively engage with a wide range of employers, from large multinationals to local SMEs to create internship and graduate opportunities for your students. Students can talk to employers on campus or online. Visit our information for employers The Higher Education Statistics Agency (HESA) have responsibility for undertaking and publishing annual data for graduate outcomes If you have an query regarding the outcomes for University of Nottingham graduates, please email our Business Information Team. Go to our Use my subject pages We offer lifelong access to alumni to support their career development. They can access one-to-one advice to help them clarify their career goals if they are undecided, making a great first impression at work, consider other career options if unsettled, and hone their job-search skills. Visit our alumni website telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}