{
    "url": "https://www.nottingham.ac.uk/careers/students/international/uk-employers.aspx",
    "content": [
        {
            "p": "Applying for jobs in the UK will be a different experience to your home country. Employers often put more emphasis on transferable skills, competencies and strengths rather then academic prowess. It is important you understand these differences and use this to your advantage when applying for jobs in the UK. Book an appointment to speak to an advisor In many cases, UK employers recruit graduates from any degree discipline. As an example, the accounting sector commonly seeks graduates who have not studied accounting, but they will require you to have an aptitude for maths and logic along with other specific skills. UK employers are focused on skills, competencies or strengths. They will outline in job advertisements and person specifications what the ideal candidate must have in terms of skills and experience. The employer will expect you to address these points in your application. This is known as tailoring your applications to the job. Although common overseas, it is unlikely employers will hire graduates after a short conversation at a careers fair. Instead, the focus in the UK is to speak to employers about the company, culture, job role and use this to gain insights on how to perform well in their recruitment activities. Some employers will allow you to skip the telephone or video interview stage if you have demonstrated a clear understanding of the job and how you match this and communicated with them clearly during this conversation. Find out more about getting a job in the UK The university subscribes to eCareersGrad, which has a course specifically targeted at international students called Target the Right UK Employer with lists of companies who have sponsored international graduates. Did you know that 300 UK employers routinely sponsor the vast majority of international students for UK graduate schemes and job opportunities? The course provides: Register using your UoN email Alumni: email us to access Most organisations will require you to have certain skills and qualities which match the job you are applying for. They will set these out in the job advertisement. It is therefore important to ensure you highlight your evidence of these skills and qualities through your applications and interviews. Simply listing a skill in your CV will not be enough, you would need to evidence this through providing examples. Most employers value work experience, however, examples do not always need to be work related. You could use examples from your studies, extracurricular activities, project work, internships, volunteering, as well as through any involvement you have in clubs and societies. These skills are often referred to as transferrable skills or soft skills. Some graduate roles would require you to have specialist skills. For example, an IT role may require you to have experience in using a programming language. Make sure you highlight your specialist skills when these are relevant to the job, even if these may seem obvious to you. There are some jobs that will require you to have gained specific knowledge and expertise from a specific course, a medical degree would be one example of this. UK employers don’t just recruit from subjects related to the job. So, for example, English students can apply to graduate accounting jobs and engineering graduates may have an interest in applying for consulting roles. UK employers are frequently quoted as saying they want more than good grades. This demonstrates their interest in graduates who can demonstrate a wider skill set. Making the most of your time at university to try out new things and develop your wider skill set will put you at an advantage when applying for graduate roles in the UK. These broader experiences will allow you to network and be able to demonstrate your skills from a wider range of experiences. Employers will also want a graduate with a positive attitude to learning and improving themselves once hired. There is a focus on demonstrating skills during UK recruitment processes which can be quite lengthy when compared to recruitment processes overseas. The good news is we are well equipped with resources and individual knowledge to help you to improve your abilities in each of these assessments. You may be asked to complete the following types of assessments: Psychometric tests Gamification (game-based assessments) Interviews Assessment centres Case studies (individual and group) Many students whose first language is not English struggle with situational judgment tests which are a form of psychometric tests. Graduates First is a resource you can use to prepare for these (and other tests) in advance. Using this resource prior to taking employer assessments can be helpful. Assessment centres are an important stage of the recruitment process, use the resources available to you to practice ahead of time. Employers will be seeking out graduates who want to work for them. They will judge this by the quality of your application and preparedness for interview. They will assess how knowledgeable you are about the company and the job you’ve applied for. They may ask you why you’ve applied for the role or why you want to work for the company. You need to be prepared for these questions in advance of an interview. Similarly, this is why your applications and CVs need to be tailored towards the job and company you are applying to. Common feedback from employers suggest they often see students who don’t have a clear understanding of job they’ve applied for and students who have not researched the company. Find out more about researching employers More organisations are taking an interest in the diversity of their workforce and the equality of their recruitment campaigns which has led to some employers using blind recruitment. This is said to reduce bias in the recruitment process and means that your personal details are removed from an application, and you are judged on your skills and abilities alone. This means that even more emphasis is put on your ability to demonstrate your skills and experience and therefore on the importance of gaining a wide range of experience while at university (other than just completing your course). Do not discount experiences you may have had in your home country. Your involvement in Students' Union activities, internships and projects could all be excellent ways to demonstrate your skills and experiences. Employers will be happy to hear about your examples from home if clearly explained. Employers need to feel confident that you can clearly communicate in English. The fact that you are studying in English in a UK institution is a good start and continuing to learn English while studying here will be beneficial. In addition, being able to demonstrate you’ve worked or volunteered with UK natives will provide employers with the confidence to hire you (so long as you also communicate well in English in your applications and interviews). In the UK, the ability to speak multiple languages fluently is relatively uncommon, this is where you can make yourself stand out from the crowd. Having the ability to speak multiple languages can be beneficial to global organisations or those trying to tap into new markets. The British Council have prepared a course specifically for international student to help them to prepare for UK work, you can sign up to this for free. International students often come to the UK to immerse themselves in the culture, but when they arrive often find they are sharing accommodation and classes with other international students. It can be difficult to break out of this group once you’ve made friends. However, getting involved in university activities and life will ensure you get a chance to mix with UK natives and other students from a range of backgrounds which will increase your cultural awareness. This is also a way to build your experience and skill set which is beneficial for future employment. Many students take on volunteering roles, or take an active part in the Students' Union and Society activities. Undertaking part-time work whilst studying or during the summer break can be helpful in building skills and experience. This could be related to your future career but alternatively if not related, it could still be useful in developing key transferrable skills like communication, problem-solving and teamwork. Take a look at our range of work experience options. 1. Gaining work experience will really help you to adapt to the culture shift of working in a UK environment. The sooner you can gain experience the better. There are a number of exclusive work experience opportunities organised by the university. 2. Some students prefer to take on a virtual internship to gain insights into what a typical piece of work would look like with an employer. 3. Take of paid work on campus or in the local area with part-time jobs to fit around your studies through Unitemps 4. If you are a postgraduate student, you could benefit from one of Nottingham's Researcher Academy Placements. 5. Find expert advice from the University of Nottingham alumni community on how to navigate the workplace. They provide real life insight and pearls of wisdom right from day one of your working life. 6. The British Council have prepared a course specifically for international student to help them to prepare for UK work, you can sign up to this for free. 7. Check out GoinGlobal, an international careers international database, which provides information and advice on working in the UK alongside 41 other countries. Log in to MyCareer to access GoinGlobal free of charge for UoN students and graduates. telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}