{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/career-paths/veterinary-work/beyond-vet-practice/veterinary-education.aspx",
    "content": [
        {
            "p": "Return to the Vets homepage Book a careers appointment Key skills and attributes to work in teaching include: As a teacher in veterinary education you might be university-based, practice-based, or a combination of the two. It is often possible to combine teaching with practice, and educational or clinical research. Therefore, although the two are separated below, these are not distinct pathways. Several different activities can be part of a teaching role. These might include lecturing, small group teaching, and teaching in practical sessions. Veterinary courses are often divided into pre-clinical and clinical teaching. Therefore, teaching roles might include basic science teaching, clinical teaching, or a combination of the two. The exact topics you teach may depend on your background and experience. When teaching at a university, you will be responsible for tasks including designing curriculum content, lesson planning and the assessment of students through written and practical exams. You may undertake additional responsibilities such as providing pastoral support to students as a personal tutor, contributing to specific working groups, and administrative tasks such as convening a module. Where appropriate you may also be involved in the supervision of postgraduate students, and contribution to recruitment such as admissions, open days, and outreach. Some clinicians choose to combine clinical practice with teaching veterinary students as a university associate, splitting their working week between the university setting and veterinary practice. Other veterinary educators teach alongside research which requires the ability to balance teaching and research responsibilities. In addition to planning, developing, and delivering curriculum teaching, your role would involve conducting research, applying for grants, and supervising postgraduate students. For those teaching non-clinical subject matter, usually a veterinary, veterinary nursing, or postgraduate qualification in a relevant subject area is required for non-clinical teaching (see pathways via research/academic route). If teaching clinical subject matter, a veterinary or veterinary nursing qualification suitable for clinical practice in the UK is usually needed. Teaching experience or experience of supervising students is desirable, and previous experience in a clinical role is advantageous. A postgraduate clinical qualification may be required for some posts. Entry into higher education can be found through teaching associate opportunities (job titles may vary) with further training and qualifications offered. A teaching qualification such as the Postgraduate Certificate in Higher Education (PGCHE) can be desirable; at some institutions this qualification is offered to teaching staff. Likewise, being a Fellow or Associate Fellow of Advance HE may be desirable, but staff may be supported to achieve fellowships while undertaking a teaching role. There may also be opportunity for students to gain teaching experience and qualifications through intercalation opportunities whilst at university (see ‘What are the opportunities to gain experience whilst at Nottingham’ section below). Further information on becoming a higher education lecturer - Prospects Vets might enter teaching through further postgraduate study. This can involve firstly undertaking a masters or residency, as this gives insight and experience of conducting high-level academic research. Further study can also be a route into teaching for those moving from clinical practice into academic work. In this case, the combination of clinical work and research that constitutes a residency is often seen as a \"good halfway house\". A much more common step to moving into academia is to undertake a PhD. Vets can fund their studies by successful scholarship applications to a university, but it is also possible to self-fund. See the further resources section below for sources of scholarships/studentships. Whilst undertaking your PhD, you may have the opportunity to get involved in teaching, mentoring and supervising students. Once you have completed your PhD (typically three years), you would then look for a post-doctoral contract, typically 18 months to three years in length. After a post-doctoral contract, you then start to apply for research fellowships, followed by a lectureship. Promotional opportunities from here follow the typical route to professorship. As a practicing clinician there is often opportunity to teach. This could be as a clinician who is hosting students on placement, through mentoring colleagues, or delivering continuing professional development sessions to other clinicians. Vets and vet nurses who enter a career in education have varying levels of experience and qualifications, in addition to a level of clinical experience. As with University-based teaching, it might be useful to have a Postgraduate Certificate in Higher Education (PGCHE), or be recognised as a Fellow or Associate Fellow of Advance HE, but these are things which can often be completed/achieved whilst in a teaching role Universities will usually have set structures for career progression, although terminology can vary between institutions. For example, you may start as a Teaching Associate and then apply for promotion to Assistant Professor. In University teaching, career progression can come through various activities, such as subject specialisation, taking on teaching and curriculum leadership roles (for example curriculum development, external collaboration, and contributions to wider community), and taking on additional pastoral support responsibilities. If you are teaching alongside research while studying for your PhD, progression usually involves looking for a post-doctoral contract. The essential guide to moving up the academic career ladder There may be opportunities to work abroad in veterinary education; this will be dependent on qualifications being recognised at individual establishments. There may also be opportunity to collaborate with other global stakeholders on research, projects and initiatives. There are many ways you could gain teaching-related experience while studying at Nottingham, including: The University of Nottingham School of Veterinary Medicine and Science (Vet School) funds several intercalation opportunities each year, including for the Postgraduate Certificate (PGCert) in Vet Education. The PGCert is a taught course where you will spend the year as a teaching intern. The role includes teaching in practical classes and facilitating small group teaching, alongside completing an educational research project and learning some educational theory. Contact your personal tutor for more information on intercalation opportunities. My one top tip for following a career in Veterinary Medicine, whether it be in education, in practice, in industry or diversifying, is to be open to different things. I had never planned to start working in education this early in my career, but my experience has only been positive and I would recommend the career highly. Read Olivia's case study Sign up for Jobs by Email Find out more about funding for further study Jobs.ac.uk (for academic jobs) Veterinary teaching blog post - Vet Record Jobs telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}