{
    "url": "https://www.nottingham.ac.uk/careers/students/graduatejobs/finding-work-abroad/key-advice.aspx",
    "content": [
        {
            "p": "Where in the world will your degree take you? If you want to explore living and working abroad for a short period of time or longer, read our advice and use our resources to explore what's out there. We highlight: Book a careers appointment The University's Alumni Office has developed a network of international contacts and groups which may be helpful for networking after graduation. Visit our Networking section for advice on face-to-face and online networking including the use of social media. Before you start your research consider the following points carefully: Your approach will vary depending on whether your priority is to work wherever the best opportunities are for your chosen career, or whether you have a specific destination in mind. I n this case, you might need to consider temporary or non-graduate positions as a way of obtaining valuable local knowledge, contacts and references. You are more likely to find a permanent job abroad once you have some experience. Some multinationals operating in the UK recruit graduates for posts abroad, although many expect a period of service here before offering the opportunity to work overseas. We subscribe to an international careers information package called GoinGlobal. You can access GoinGlobal free as a UoN student or alumni. GoinGlobal contains: Log in to MyCareer for access to GoinGlobal If you have any problems logging into MyCareer, please email our team. Familiarise yourself early with visa conditions and application procedures in your target country. Use GoinGlobal if the country is listed. Being eligible will depend on a range of factors such as shortage occupations, qualifications, age and so on. The Foreign and Commonwealth Office (FCO) website provides an up-to-date listing of foreign embassies in the UK which can be a useful source of information on these matters. You should also research other factors that will shape your experience of the country such as living standards or healthcare provision. Read Jack's blog post: From Nottingham to the UN in Thailand and a PhD in Japan Read Iona's blog post: Becoming a senior journalist for BBC News in Washington DC Read Jack's blog post: From St Paul's to the Stockyards - my journey moving to Dallas, Texas telephone: +44 (0) 115 951 3680 fax: +44 (0) 115 951 3679 email: careers-team@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}