{
    "url": "http://www.nottingham.ac.uk/cedex/index.aspx",
    "content": [
        {
            "p": "The Centre for Decision Research and Experimental Economics is a world-leading research group that investigates human decision-making using theoretical and experimental methods. CeDEx has global reach, produces cutting-edge research with societal impact and is consistently highly ranked in the field of behavioural economics. CeDEx laboratories are located in the University of Nottingham's School of Economics, Nottingham University Business School and the University of Nottingham Ningbo China. The Centre’s members are affiliated with international research institutions including the Institute for the Future of Labor, the ESRC Network for Integrated Behavioural Science (NIBS), the Institute for Fiscal Studies, the EC Joint Research Centre and the Nuffield Centre for Experimental Social Science. CeDEx research has been funded by grants from the ERC, ESRC, the Leverhulme Trust, the British Academy and the Nuffield Foundation. Connect with us on Twitter View more seminars View more papers View more news articles Wherefore art thou competitors? How situational affordances help differentiate among prosociality, individualism, and competition by Yi Liu, Simon Gächter, Paul van Lange, and 51 others. Social preferences and the variability of conditional cooperation by Malte Baader, Simon Gächter, Kyeongtae Lee, and Martin Sefton Social norms: Enforcement, breakdown & polarization by Loukas Balafoutas, Eugen Dimant, Simon Gächter, and Erin Krupka View more publications CeDEx conducts research into how people make decisions. We require the participation of volunteers. No special skills are needed, and most participants will receive a reward. If you are a registered student at the University of Nottingham you can sign up to be a paid volunteer. Watch our video to find out more (opens in an external window). CeDEx at Nottingham has two labs (based on two campuses) with a combined total of 72 computer terminals. With a dedicated Lab Manager, we can offer a professional service for anyone who wants to run experimental and decision-making experiments. Read more about our Lab Facilities and find out how to contact us. Sir Clive Granger Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 951 5458 Enquiries: jose.guinotsaporta@nottingham.ac.uk Experiments: cedex@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}