{
    "url": "https://www.nottingham.ac.uk/cele/alacs/profiles.aspx",
    "content": [
        {
            "p": "What our students say about our Academic Language and Communication Skills services. Find out how our academic language and communications skills services have helped our students during their studies at the university. Lorraine Zakeyo is a postgraduate student studying advanced nursing in the School of Health Sciences. In a series of short videos, Lorraine discusses why she uses the academic language and communications skills services, how they have helped her, and why she would recommend other students use the short courses and consultations to help them during their studies. We'd encourage you to read all the profiles, but you can also use these links to go to a specific profile: Melanie is a postgraduate researcher from the UK studying a Professional Doctorate in Education (EdD) in the School of Education. Melanie joined the Academic Writing: Synthesising Sources course to support her research because when she completed a part-time MSc in 2016 alongside a full-time midwifery position, her academic writing was good but required improvement. When commencing the EdD she wanted to take the opportunity to focus on her academic writing skills to produce assessments (and hopefully a thesis) that was to a high standard. Melanie said \"the synthesising sources course was able to take me back to basics – the use of words, formation of paragraphs and drawing on sources of data to aid academic discussion. This provided me with a foundation of knowledge to build my confidence prior to starting my assessments and provided key tools to support the development of my writing skills.\" Asked what was the best part of the course, Melanie said it is hard to pick, commenting \"firstly, the facilitators are enthusiastic about academic writing and provide key information at a good pace, with plenty of time for questions.The resources are also clear and engaging with interesting and useful activities. I also liked that the course was at a time of day that I could attend around my working hours. Finally, the facilitator was also able to look at some of your writing (related to the course) which I found really helpful.\" Melanie took her course online and said the online learning experience was very good, the facilitator encouraged students to be involved in the course content and it felt safe and supportive. In conclusion Melanie would recommend this course to anyone commencing academic writing as it’s a great refresher for those that have produced academic writing before, but want to brush up on writing skills that have become a little rusty over time and boost confidence. The course enables you to have an awareness of sentence and paragraph structure to develop clarity of points and apply resources with confidence. Melanie finished by saying the course is a \"very enjoyable and supportive course\". Melanie also utilised the one-to-one consultations offered by the academic language and communication skills team and said \"academic writing varies for different disciplines and I had only produced writing for healthcare previously. I wanted to make sure that I had clarity with my paragraphs and wording specifically for education. I also find that reading your own work makes sense, but may not to others. A consultation enables you to send in a section of writing prior to a meeting, where support and advice relating to structure can be provided. I booked a consultation and emailed a section of my writing where I received some supportive feedback both written and verbal and this helped to clarify key areas of my writing which were good, or required clarification\". Yiru is from China and studying an MA Teaching English to Speakers of Other Languages (TESOL) in the School of Education. Yiru has taken three courses with us: Academic Writing for TESOL; Academic Writing: Synthesising Sources, and Academic Writing: Planning an Assignment. She has also booked one-to-one consultations and used our drop-in sessions. Yiro gained a deeper and clearer understanding of the usage of academic writing vocabulary, sentence structure, and the organisation of essays, which has eased her confusion in subsequent paper writing and significantly increased her writing efficiency. Yiro said \"tutors in the classroom combine theory with practice, by having us engage in hands-on exercises, both oral and written, to further stimulate our thinking and gain a deeper understanding of certain concepts. In addition to this, the tutor has provided me with a lot of guidance during class, as well as a wealth of resources outside of class, such as useful websites and books, which include an abundance of academic writing resources. Commenting on support received, Yiro said \"my tutors are very responsible. In our tutorials, we discussed my thesis outline in detail, which gave me a clearer idea for writing each section. In addition to this, they also provided me with extra advice on references, which made my thesis more substantiated. Whenever I encountered problems during the writing process, I would email them, and they would reply promptly, resolving my doubts. Overall, I am very grateful for all the help I have received from every tutor.\" Yiro also attended one-to-one consultations because she said when she first started writing papers, she had very little confidence in her work. She said \"I was particularly worried about formal issues, such as citations, so I scheduled a one-to-one consultation. During the consultations, the tutors made detailed corrections to a portion of my writing, including grammar, word usage, and logical structure. They also explained these issues to me carefully, which gave me a clearer understanding of them and helped me avoid making the same mistakes in the future.\" Gerard is from Chile and studying a Master of Business and Administration (MBA) in Nottingham University Business School. Gerard has supported his degree studying by completing the Effective Academic Presentation course and said \"the course gave me a global perspective on how I can design an effective academic presentation, from making a potent introduction to capturing the audience’s attention, highlighting key points and messages, and giving a conscious conclusion. Finally, the Q&A stage is also a crucial part of the presentation because it allows us to open the discussion and start to have a dialogue with the audience.\" Asked about the best part of the course, Gerard said the course’s framework was not a typical lesson where you have to sit and start to pay attention to the tutor, and that part was his favourite. The tutor presented participants with different cases, and they had the opportunity to analyse, discuss and acquire knowledge from them. Additionally, the course encouraged them to share their experiences and knowledge in order to apply them in a practical way for their future presentations. Gerard said \"I felt supported by my tutor in three different aspects. First of all, she always encouraged us to participate in the lesson in a very kind way that allowed us to share our opinions in a friendly and safe environment. Additionally, I received fantastic material in terms of theoretical approaches and applying them in a practical way. Finally, we also reviewed real presentation cases that allowed us to identify the risks and opportunities to improve our further presentations.\" Gerard believes students should take acdemic language and communication skills courses because not only can they learn some specific content or subject, they also have opportunities to develop their communication skills, improve their English and acquire other perspectives and points of view related to the topic selected. Sujing is from China and studying an MA Teaching English to Speakers of Other Languages in the School of Education. She had little experience in academic writing and never had the opportunity to have professional academic writing training. After two terms taking academic writing courses, she acquired basic knowledge about academic writing, improved her writing skills and did not panic about English writing any more. Sujing has taken multiple academic language and communication skills courses, and also booked consultations for one-to-one support. The courses she has completed are: Asked what was the best part of the courses, Sujing said the tutors adding \"They are really lovely, patient and experienced. They prepare each lesson with their greatest effort and are always ready to help. Each week I completed my course, I got a feeling of fulfillment and I could clearly see my progress with academic writing. The tutors taught us how to select appropriate materials to read, how to do reading effectively, the differences between general writing and academic writing, and so on. They also taught us new knowledge with supportive practice. In addition, the tutors supported us not only on delivering the course content, but also in helping students build confidence in language learning. I can remember one of my tutors once said, “you are good, you are excellent, believe in yourself and I believe in you, too!”\" Sujing recommends academic language and communications skills courses saying \"as international students, we are not familiar with the British style of academic writing but even students with English as their first language may not be good at writing academic papers. The academic language and communication skills courses are an excellent place for every student in the university to get assistance about academic learning. Since they are available to all university students for free, why not give it a try and enhance your study experiences.\" Sujing also took advantage of the one-to-one consultations where she used to send part of her assignment writing to the consultation tutors for language improvement and advice. She commented \"the tutors read my writing carefully and sent me their feedback before our meetings, so that I had enough time to go through my writing and discuss effectively with tutors within the limited time. They also offered me fresh and creative ideas sometimes that I could develop in my writing. With their help, I think I have become more confident and improved my academic writing skills consistently.\" Art is from Thailand and is a PhD student in the School of Life Sciences. Art has taken the Academic Vocubulary Skills course which he says has enhanced his skills for choosing appropriate words for his academic writing. Art's thought the best part of the course was the task that asks participants to make suggestions to improve an article because it showed how to implement class content in a similar way to real situations. Commenting on support received during the course, Art said \"My class tutor was always open to the ideas of students and gave suggestions rather than judging. They also promoted active participation by encouraging discussion between students.\" Art thinks students should take an academic language and communications skills course as they provide many effective opportunities to enhance essential English skills saying \"as English isn’t my first language, the course I took made English less frustrating for me.\""
        }
    ],
    "pdf_files": []
}