{
    "url": "https://www.nottingham.ac.uk/cele/team/index.aspx",
    "content": [
        {
            "p": "The Centre for English Language Education team has colleagues from many different countries, many of whom are multilingual. They have taught across the globe and are experts in English language teaching and academic literacies. View the full CELE staff list and contact details. Olga has been teaching and supporting students in higher education in the UK and the US for over 15 years. She has previously worked at the University of Lincoln, Fordham University (USA), and New York University (USA). Olga holds an MA and a PhD in English from New York University (USA), and the Cambridge Diploma in Teaching English to Speakers of Other Languages (DELTA). She is also a Senior Fellow of the Higher Education Academy. At the University of Nottingham, Olga has taught on foundation and pre-sessional academic skills modules and has worked with students from foundation to PhD levels. Joanna has been teaching and researching in higher education contexts since 1996, supporting students at pre-sessional, undergraduate and postgraduate levels at various UK universities and in the Middle East. Joanna joined the School of Education at the University of Nottingham in 2010. Joanna has an MA in English Language Teaching from the University of Nottingham, and a Doctor of Education (EdD) from the University of Bath. Her main research interest is in the area of internationalisation of higher education. At the University of Nottingham, Joanna teaches on pre-sessional, academic language and communications skills and foundation programmes, as well as supervising doctoral students at the School of Education. She is module convenor for Foundation for Engineering and Science, working closely with the Department of Engineering. She launched and taught on the PGCert International Student Advice and Support programme. She has also taught on the PGCE (Malaysia) programme, MA Teaching English for Academic Purposes (MA TEAP) and MA International Higher Education. Catherine is one of the senior tutors in the School of Education. She has been teaching and supporting students in higher education for over 15 years. She joined the University of Nottingham in 2010, having previously taught and managed English and academic literacies programmes at a number of UK and overseas institutions. Catherine has an MA in English Language Teaching and a Diploma in Teaching English to Speakers of Other Languages (DELTA) and is a Senior Fellow of AdvanceHE. She is an ILM qualified organisational coach and works with individuals as part of the internal coach pool. At the University of Nottingham, Catherine is a senior tutor in the School of Education, overseeing personal tutoring and student support. She teaches pre-sessional English, and academic language and communications skills courses, as well as the Introduction to Teaching English as a Foreign Language elective for undergraduate modern languages students. She has an interest in teacher education and in the learning and development of staff and students. David has been teaching in higher education for over 25 years. He previously worked for the University of Gdansk, and the University of Skopje. David has an MA in Teaching English to Speakers of Other Languages from the University of Durham. At the University of Nottingham, David has taught modules in the Faculty of Engineering and the School of Cultures, Languages and Area Studies, and has worked with students from foundation to PhD level. Dave has been teaching English since 1993 and has over 20 years’ experience in the provision of EAP in UK universities. He has been at the Centre for English Language Education since 2010, having previously worked at Nottingham Trent University and the University of Birmingham. Dave gained an MA in English Language Teaching from Nottingham Trent University in 2009. He also holds a Cambridge Certificate in Teaching English as a Foreign Language to Adults (CELTA) and a Cambridge Diploma in Teaching English to Speakers of Other Languages (DELTA). At the University of Nottingham, Dave has worked extensively on academic language and communications skills courses and pre-sessional programmes, developing courses and teaching students across a wide range of disciplines at undergraduate, masters and PhD level. Aleksandra joined the University of Nottingham in 2010 and has been teaching English for Academic Purposes (EAP) across a wide range of academic disciplines to students from undergraduate to PhD level. She has worked on the pre-sessional programmes and has now moved to work on the academic language and communication skills courses. She has a Master of Arts in Liberal Studies from Queens College, City University of New York, an MA in Polish Philology from the University of Rzeszow, and a PGCert in Teaching English for Academic Purposes (PGCTEAP) from the University of Nottingham. Aleksandra’s areas of professional interest include leadership and management in education and teacher autonomy. Alasdair has been working at the Centre for English Language Education since 2017. His career as an English teacher began in South Korea in 2008, where he taught in a variety of educational settings. He commenced teaching in higher education at Chonnam National University, Gwangju. Subsequently, he taught in the Middle East - in both Saudi Arabia and Ras Al-Khaimah in the UAE - before returning to the UK. Alasdair is Cambridge CELTA qualified and has an MA in Applied Linguistics from the University of Nottingham. His final research project was an ethnographic study focussed on group dynamics in the language classroom, with a specific focus on British summer schools. His other areas of interest are second language acquisition, english vocabulary: learning and teaching, and language learner motivation. He is also a Fellow of the Higher Education Academy. Craig’s teaching career began back in 2004 at a language school in Osaka and then Tokyo, Japan, before entering into UK higher education in 2009. Since then, he has worked at a number of UK institutions and spent seven years teaching at a university in Kazakhstan. He joined the Centre for English Language Education in 2019. Craig’s teaching qualifications include the Cambridge CELTA, Delta and MA in Teaching English for Academic Purposes from the University of Nottingham. His MA dissertation explored the ways flipped learning can be used in an English for academic purposes context. In 2017, he won an award for the co-development of an online writing environment. He is also a Fellow of the Higher Education Academy and a committee member of the BALEAP Technology-enhanced Learning Special Interest Group. His role at the University of Nottingham includes teaching on the pre-sessional courses, course coordination, and materials development. Ewan has been working in education since 2005. He studied physics with astrophysics at undergraduate level, before undertaking an MA in English for Academic Purposes at the University of Nottingham. Ewan has also taught with University College London, Nazarbayev University (Kazakhstan) and Nottingham Trent University. At the University of Nottingham, Ewan has worked closely with students from the Schools of Engineering and Education, among others. Angela has been teaching and supporting students in higher education for over 10 years. She previously worked as a teacher for the British Council in Thailand, Poland, Portugal, Italy, Hungary and Colombia. Angela has a MEd in Educational Technology and English Language Teaching from the University of Manchester and a Cambridge Diploma in the Teaching of English as a Foreign Language to Adults. At the University of Nottingham, Angela teaches on pre-sessional courses and academic language and communications skills courses and has worked closely with the School of Education in supporting their MA Teaching English to Speakers of Other Languages and MA Teaching Chinese to Speakers of Other Languages students. Irina has over 20 years of teaching experience in English for academic purposes (EAP) (UK higher education), English as a foreign language, and and content and integrated learning (CLIL) at A Level in Romania. Since joining the Centre for English Language Education in 2009, Irina has worked on pre-sessional and academic language and communications skills courses, taught on the PGCE (Malaysia) programme and the MA Teaching English for Academic Purposes, and provided research support to visiting scholars. Her contributions in the Centre for English Language Education include materials development across a range of general and discipline specific EAP courses, course coordination, and coordination of curricular projects. Irina has a PhD in CLIL (University of Nottingham), an MA in Research Methods for Education (University of Nottingham), an MEd in TESOL (Exeter University), and a BA in English Language and Literature (Romania). Irina is also a Senior Fellow of the Higher Education Academy (UK), and has Qualified Teacher Status (UK and Romania). Irina’s scholarship focuses on learner strategies of accessing content through the medium of English; the role of reflection in academia; critical engagement and student voice; disciplinary variation in approaches to learning and curricular innovation. She also has a strong interest in enhancing student experience by enabling networking between Centre for English Language Education students and alumni. Richard has been supporting students to improve their academic skills in higher education for over 20 years in the UK and the UAE. He has previously worked for the University of Essex and the University of the United Arab Emirates. Richard has an MA in Applied Linguistics from the University of Essex and a PGDip Education from the University of Nottingham. He is also a senior fellow of the Higher Education Academy. Richard has worked extensively with the Schools of Education, Law, Veterinary Sciences, Biosciences and Engineering. Shasha has been teaching and supporting students to develop their academic and linguistic competence in higher education for over 17 years. She has previously worked at Ocean University of China, Xi’an-Jiaotong Liverpool University, Communication University of China, and Nottingham Trent University. At the University of Nottingham, Shasha works closely with all faculties to ensure our courses are what students need in their subject areas. Shasha has an MA in English Language Teaching from the University of Nottingham and a Cambridge Diploma in Teaching English to Speakers of Other Languages (DELTA). She is a winner of the Lord Dearing Award for her outstanding contribution to the development of teaching and student learning. Shasha’s research interests are academic literacies and inclusive education. Claire joined the Centre for English Language Education in October 2008 and has taught and co-ordinated on a range of pre-sessional programmes which focus on English for Academic Purposes (EAP). Claire also teaches on the Introduction to Teaching English as a Foreign Language (TEFL) elective for undergraduates, as well as being involved with course and materials design of various courses. Claire is currently the pre-sessional liaison officer who supports all Centre for English Language Education pre-sessional students with advice on admissions, visas, safeguarding, wellbeing and many other issues. Prior to joining the University of Nottingham, Claire completed her CELTA at International House (IH) Bangkok before continuing to work at IH Bangkok for two years. During her time in Thailand, she taught a range of ages and subjects, along with teaching business English at various companies across Bangkok. Claire’s teaching qualifications include an MA Applied Linguistics (University of Nottingham), a PGT in English for Academic Purposes (University of Nottingham) and the Cambridge CELTA. Her BSc degree is in psychology and information systems (University of Lincolnshire & Humberside). Ilari has been teaching since 1999. He spent a few years teaching English for specific purposes (such as business English) in Hungary, Poland and Finland, before discovering English for academic purposes (EAP). He has been working at the Centre for English Language Education as a Tutor in EAP since 2004 – this includes a few years at the university’s campus in Ningbo, China (2004-2008). During his many years with the centre, Ilari has worked on various courses/programmes (for example pre-sessional and foundation) in different roles (course leader, module convenor, course coordinator and course tutor). Nick has been teaching since 1994 in a variety of roles and countries. His career began in Phnom Penh, Cambodia, first at an English language school before leading the English language provision at an international school. After 11 years in Cambodia he moved into higher education at the Higher Colleges of Technology in Dubai where he spent 12 years, starting as an English for academic purposes (EAP) teacher before rising to head of the general studies department. He returned to the UK and after two spells teaching EAP at Sheffield University he started work at the University of Nottingham in 2019, first as an education technology consultant before moving to the Centre for English Language Education. Nick’s qualifications include an MA Teaching English as a Foreign Language, an MEd Education Technology, Diploma in Teaching English to Speakers of Other Languages, and the Cambridge CELTA. He is also a certified cinema 4d instructor as well as an intercultural intelligence workshop facilitator and personality dimensions workshop facilitator. His research interests include automated feedback of student work, technology adoption, and culture in education. Patience has been supporting students with academic skills in higher education for over eight years. He has previously worked as a secondary school teacher and English to speakers of other languages teacher in the further education sector and worked at De Montfort University in Leicester. Patience has an MA in Educational Studies (University of Leicester), and a BA in Education degree (University of Zimbabwe). He also holds two PGCE certificates in education research (University of Nottingham) and English (secondary) (Nottingham Trent University). At the University of Nottingham, Patience teaches on the foundation, pre-sessional and academic language and communications skills programmes. He supports students from various departments, at varying levels. Clare has been teaching and supporting students in both schools (in the UK) and in higher education settings for nearly 20 years. Before changing career paths to focus on teaching English as a foreign language, English to speakers of other languages and English for academic purposes (including teaching in Auckland, New Zealand), she previously taught students aged 14-19 at a college in Leicestershire. Clare holds qualifications including an MA English Language Teaching from Nottingham Trent University, a Trinity CertTESOL and is currently working towards the HEA Senior Fellowship Award. During her 14 years at the Centre for English Language Education, Clare has taught on many courses (for example, pre-sessional, foundation, electives and specialised courses) and has worked in a variety of roles (for example module convenor, course coordinator and pre-sessional admissions student liaison officer). She has also contributed towards the university community by sitting on a number of boards including the Immigration Compliance Group and the Qualifications Review Group."
        }
    ],
    "pdf_files": []
}