{
    "url": "https://www.nottingham.ac.uk/cele/pre-sessional/pre-sessional-courses.aspx",
    "content": [
        {
            "p": "Course details for our pre-sessional English courses. Our Pre-sessional English for Academic Purposes courses are designed to bring your academic and language skills up to the required level, so you can study a foundation, undergraduate, postgraduate or research degree at the University of Nottingham. In the event that the number recruited to a course is low, we may not be able to run it. If this is the case, we will inform you and provide more information at the earliest opportunity. This is a 10-week course. It is the first level of the 40-week course which consists of levels 1 to 4. For foundation students it will be the first module of a 30-week course (levels 1 to 3). It is designed for students of a lower level English proficiency (IELTS 4.0 or 4.5) who need a longer time to prepare. This course is available to study face-to-face here in Nottingham. The main aims of the course are to: You will be asked to do a series of tasks: You will be expected to study for at least 36 hours per week, which includes taught sessions with tutors, tutorials and independent study. At the end of level 1 you will be assessed to see if you are ready to move on to level 2. You will: Usually there are 14 to 18 students, but occasionally there may be over 18 in the class. If the number recruited to the course is low, we may not be able to run it. If this happens, we will inform you at the earliest opportunity. If you are successful in gaining the required marks in your final assessments, you will be able to move on to level 2. This is a 10-week course. It is the second level of the 40-week course which consists of levels 1 to 4 or the first level of the 30-week course (levels 2 to 4), depending on your current English language skills. For foundation students, it will be the first level of a 20-week course (levels 2 to 3). It is for students who have an intermediate level of proficiency (IELTS 4.5 to 5.5 depending on the future target) who need a longer time to prepare for their degree study. At the end of level 2 you will be assessed to see if you are ready to move on to level 3. You will: If you are successful in gaining the required marks in your final assessments, you will be able to move on to level 3. This is a 10-week course. This level is studied as the first level of a 20-week course (levels 3 to 4) or as the second level of the 30-week course (levels 2 to 4), depending on your current English language skills. For foundation students, it is the second level of a 20-week course (levels 2 to 3). It is for students with a good level of proficiency (IELTS 5.0 to 6.0 depending on the future target) who are close to meeting their English language requirement. This course is available to study on campus here in Nottingham, or as an online course. The information below applies to both modes of study. Online courses will include live taught sessions and monitored independent study tasks. At the end of level 3 you will be assessed to see if you are ready to move on to level 4. You will: Usually there are 14 to 18 students, but occasionally there may be over 18 per class. If you are successful in gaining the required marks in your final assessments, you will be able to move on to level 4. This is designed for higher level students who are close to their English language requirement and runs for 10 or six weeks, according to your current level of English (the six-week course only runs in the summer term). It is for students who need a small improvement to meet the requirements of their degree course. At the end of level 4 you will be assessed to see if you are ready to move on to your academic course. You will: If you are successful in gaining the required marks in your final assessments, you will be able to move on to your degree course at the University of Nottingham. Which course is right for you? Course dates and fees How to apply"
        }
    ],
    "pdf_files": []
}