{
    "url": "https://www.nottingham.ac.uk/cele/pre-sessional/dates-and-fees.aspx",
    "content": [
        {
            "p": "Our pre-sessional courses are offered for study on campus or as online courses. Our Pre-sessional English for Academic Purposes courses are offered for study on campus here in Nottingham or as online courses. Both on campus and online courses are comparable in terms of teaching, learning and student engagement. If you are able to, we would recommend you study your pre-sessional course on campus, so you can acclimatise to being in the UK and receive the benefits of campus life before progressing to your degree course. Please choose the correct mode of delivery when applying, as once you start a course, you cannot change (unless there are extenuating circumstances). Students taking a course on campus will need to travel to the UK and be based in Nottingham. The courses will include a mix of: In the event that the number recruited to an 'on campus' course is low, we may not be able to run it. If this is the case, we will inform you and provide more information at the earliest opportunity. Students taking an online course will not need to travel to the UK. In the event that the number recruited to an 'online' course is low, we may not be able to run it, or we may run the course in a hybrid format, where you will join the in-person classes remotely and in real time. If this is the case, we will inform you and provide more information at the earliest opportunity. Please note that applications and all required documentation must be submitted before the advertised deadline below. Incomplete applications with missing documents (such as evidence of meeting academic conditions) will not be accepted after these deadlines. Applicants are strongly advised to apply well before the relevant deadline. Applications are open for April, June, July and August 2025 courses. * When applying for Pre-sessional English - 6 weeks (business & management) or Pre-sessional English - 6 weeks (education), please select Certificate - CELE 6 Wk Preparatory English course. If your application is successful, you will be placed on the relevant course. ** This induction is for unconditional international offer holders who have met the English language conditions of their University of Nottingham academic offer and obtained their Confirmation of Acceptance of Studies (CAS). Which course is right for you? How to apply Visa information"
        }
    ],
    "pdf_files": []
}