{
    "url": "https://www.nottingham.ac.uk/cele/alacs/tutors.aspx",
    "content": [
        {
            "p": "Our Academic Language and Communication Skills tutors are experts in English language teaching and academic literacies. The Centre for English Language Education team has colleagues from many different countries, many of whom are multilingual. They have taught across the globe and are experts in English language teaching and academic literacies. David has been teaching in higher education for over 25 years. He previously worked for the University of Gdansk, and the University of Skopje. David has an MA in Teaching English to Speakers of Other Languages from the University of Durham. At the University of Nottingham, David has taught modules in the Faculty of Engineering and the School of Cultures, Languages and Area Studies, and has worked with students from foundation to PhD level. Joanna has been teaching and researching in higher education contexts since 1995, supporting students at foundation, pre-sessional, undergraduate and postgraduate levels at various UK universities and overseas. Joanna holds an MA in English Language Teaching from the University of Nottingham, and a Doctor of Education (EdD) from the University of Bath, UK. Her main research interest is in the area of internationalisation of higher education. Since joining the University of Nottingham in 2010, Joanna has been teaching on pre-sessional English for academic purposes courses, and academic language and communication skills courses. She has also taught on various postgraduate programmes including: PGCE (Malaysia) programme, MA Teaching English for Academic Purposes (MA TEAP) and MA International Higher Education. Joanna is also a supervisor for doctoral students at the School of Education. Olga has been teaching and supporting students in higher Education in the UK and the US for over 15 years. She has previously worked at the University of Lincoln, Fordham University (USA), and New York University (USA). Olga holds an MA and a PhD in English from New York University (USA), and the Cambridge Diploma in Teaching English to Speakers of Other Languages (DELTA). She is also a Senior Fellow of the Higher Education Academy. At the University of Nottingham, Olga has taught on foundation and pre-sessional academic skills modules and has worked with students from foundation to PhD levels. Dave has been teaching English since 1993 and has over 20 years’ experience in the provision of EAP in UK universities. He has been at the Centre for English Language Education since 2010, having previously worked at Nottingham Trent University and the University of Birmingham. Dave gained an MA in English Language Teaching from Nottingham Trent University in 2009. He also holds a Cambridge Certificate in Teaching English as a Foreign Language to Adults (CELTA) and a Cambridge Diploma in Teaching English to Speakers of Other Languages (DELTA). At the University of Nottingham, Dave has worked extensively on academic language and communications skills courses and pre-sessional programmes, developing courses and teaching students across a wide range of disciplines at undergraduate, masters and PhD level. Aleksandra joined the University of Nottingham in 2010 and has been teaching English for Academic Purposes (EAP) across a wide range of academic disciplines to students from undergraduate to PhD level. She has worked on the pre-sessional programmes and has now moved to work on the academic language and communication skills courses. She has a Master of Arts in Liberal Studies from Queens College, City University of New York, an MA in Polish Philology from the University of Rzeszow, and a PGCert in Teaching English for Academic Purposes (PGCTEAP) from the University of Nottingham. Aleksandra’s areas of professional interest include leadership and management in education and teacher autonomy. Ewan has been working in education since 2005. He studied physics with astrophysics at undergraduate level, before undertaking an MA in English for Academic Purposes at the University of Nottingham. Ewan has also taught with University College London, Nazarbayev University (Kazakhstan) and Nottingham Trent University. At the University of Nottingham, Ewan has worked closely with students from the Schools of Engineering and Education, among others. Angela has been teaching and supporting students in higher education for over 10 years. She previously worked as a teacher for the British Council in Thailand, Poland, Portugal, Italy, Hungary and Colombia. Angela has a MEd in Educational Technology and English Language Teaching from the University of Manchester and a Cambridge Diploma in the Teaching of English as a Foreign Language to Adults. At the University of Nottingham, Angela teaches on pre-sessional courses and academic language and communications skills courses and has worked closely with the School of Education in supporting their MA Teaching English to Speakers of Other Languages and MA Teaching Chinese to Speakers of Other Languages students. Richard has been supporting students to improve their academic skills in higher education for over 20 years in the UK and the UAE. He has previously worked for the University of Essex and the University of the United Arab Emirates. Richard has an MA in Applied Linguistics from the University of Essex and a PGDip Education from the University of Nottingham. He is also a senior fellow of the Higher Education Academy. Richard has worked extensively with the Schools of Education, Law, Veterinary Sciences, Biosciences and Engineering. Shasha has been teaching and supporting students to develop their academic and linguistic competence in higher education for over 17 years. She has previously worked at Ocean University of China, Xi’an-Jiaotong Liverpool University, Communication University of China, and Nottingham Trent University. At the University of Nottingham, Shasha works closely with all faculties to ensure our courses are what students need in their subject areas. Shasha has an MA in English Language Teaching from the University of Nottingham and a Cambridge Diploma in Teaching English to Speakers of Other Languages (DELTA). She is a winner of the Lord Dearing Award for her outstanding contribution to the development of teaching and student learning. Shasha’s research interests are academic literacies and inclusive education. Patience has been supporting students with academic skills in higher education for over eight years. He has previously worked as a secondary school teacher and English to speakers of other languages teacher in the further education sector and worked at De Montfort University in Leicester. Patience has an MA in Educational Studies (University of Leicester), and a BA in Education degree (University of Zimbabwe). He also holds two PGCE certificates in education research (University of Nottingham) and English (secondary) (Nottingham Trent University). At the University of Nottingham, Patience teaches on the foundation, pre-sessional and academic language and communications skills programmes. He supports students from various departments, at varying levels"
        }
    ],
    "pdf_files": []
}