{
    "url": "https://www.nottingham.ac.uk/cele/pre-sessional/profiles.aspx",
    "content": [
        {
            "p": "What our students say about our presessional courses. Meet some of our pre-sessional alumni and current students and see how their course is helping (or helped) them prepare for their degree study. We encourage you to read all the profiles, but you can also use the links below to go to a specific profile: Home country: Ukraine Pre-sessional course: 20 weeks - levels 3 and 4 Study mode: online and face-to-face Now studying: PhD in Mechanical Engineering How did the pre-sessional course help you prepare for your degree course? First of all, I would like to say that pre-sessional courses are aimed not only at academic literacy and use of academic English language but also at social and conversation skills. I obtained a lot of skills during the course, improving my writing, reading, listening, and speaking abilities along with my communication, presentation, and research skills. The course provides great material in terms of how to read, analyse and write academic papers. Moreover, the course aims to enhance students' presentation skills which is very important for future study. I can say that now in my doctoral studies, I use the knowledge and skills I have developed on the pre-sessional course continuously because, as a PhD student I do academic reading, analysis, and writing every day. The knowledge and understanding of academic conventions I have gained have given me a good background for my PhD study. What was the best part of the pre-sessional course? Apart from the excellent organisation of the course, the best part was the intercultural community. On the pre-sessional course, students and tutors from different countries and even different continents can interact with each other while studying English. Everyone has different life experiences, so it allows us to find a lot of new information about the world. There were students from five different countries in my face-to-face course, so it was an enjoyable time to learn about different cultures along with studying English. If you studied your pre-sessional course online, how did you find the online learning experience? Due to exceptional circumstances, I was allowed to study the first 10 weeks (Level 3) of my pre-sessional course online and then was able to travel to Nottingham to study Level 4 face-to-face. So, I have experience in both online and face-to-face study and can say that the online course is very similar to the face-to-face course in terms of content covered in class and skills you develop. The online course has clear structure, good time management, and a lot of materials. During the online session, tutors do their best to keep students focused and deliver learning material with maximum benefit for students. I enjoyed the online course, especially the moments we had mini-group discussions with other students. I made fast progress during the online course in different aspects, but the most important has been progress with my listening and speaking abilities. How did your tutors support you on the course? The support from tutors has been excellent, starting from the first introduction session. Everyone, from personal tutors to liaison officers supported us with our various questions. Tutors were always friendly and happy to help with any problems, from language and visa to everyday problems. So, I always felt supported by my tutors during the course and I feel it even after the course. I am in touch with some of the tutors and they are always willing to guide me and help with any questions. Anything else you would like to add about the pre-sessional course? If you need to make good and quick progress in studying English and be ready for your degree course, the pre-sessional courses are the best choice for you. Professional tutors, a friendly environment and your efforts will make this journey enjoyable and easy for you. Why do you think students should come to the University of Nottingham? The University of Nottingham has a huge history, a diversity of courses and educational programs, and maybe the best campuses I have ever seen. I live on the main campus – University Park, and the landscape of the campus is just amazing. There is also a good infrastructure within all campuses. There are sports centres at each campus, a lot of cafes and even a health centre on the main campus. Free buses run between campuses for students. The university also provides excellent support for students with disability, from study to sport. Now you are on your degree course, have you taken any Academic Language and Communication Skills courses, booked consultations or attended a drop-in session? After starting my PhD course, I took several courses and booked one-to-one consultations. The academic language and communication skills courses are very similar to pre-sessional courses in the structure. Each course takes 60 to 90 minutes per week and aims to improve student's social and academic skills. These courses cover a lot of areas, from pronunciation to academic writing. So, I find it very useful to continue my language studies, and again to interact with other students and build a network. Booking a one-to-one consultations is particularly useful in terms of preparation for any assignments as a tutor can check your writing task and give good feedback on what to improve. What is also very helpful for students is that the courses, consultations and drop in sessions are completely free and run through the year. Home country: China Pre-sessional course: 30 weeks - levels 2, 3 and 4 Study mode: face-to-face Degree course after pre-sessional study: MSc Entrepreneurship, Innovation and Management How is the pre-sessional course helping with your academic English? The pre-sessional course, especially level 2, has been a big support for speaking, research skills and academic conventions. I learned how to write a real academic article. I understood how to design my own primary research project, learnt about research methods such as interview, questionnaire and convenient sampling. Another useful aspect was learning about the structure of academic articles and how to read these. What was the best part of the pre-sessional course so far? In my view, every part is excellent, but my favourite part is when we get opportunities to speak and do group work. How do your tutors support you on the course? My tutors are excellent, and offer whatever advice you need about your study or about life at the university in the UK. If I have any problems, I can ask my tutors any time, even at break time they are happy to help. And if we cannot understand in class sometimes, they will teach us again again and again to make sure we understand. A pre-sessional course at the university is good to improve your English, to prepare for your degree course by learning about academic genres (different kinds of articles), how to read these, how to research and how to effectively communicate your ideas. Overall, I am very happy with my experience here. Home country: Saudi Arabia Pre-sessional course: 30 weeks - levels 2, 3 and 4 Study mode: face-to-face Degree course after pre-sessional study: MSc Industrial Engineering and Operation Management The pre-sessional course helps me improve my academic English, learn how to write structure ideas appropriately, read and understand complex texts in academic settings, research effectively, and expand my vocabulary by deepening my understanding of academic culture. The best part of the course has been the interactive workshops that allow for real-time feedback on my writing and speaking skills. The tutors support me by providing feedback on my essays, holding individual and group tutorials every week, and being readily available for queries and clarification, whether face-to-face or online. In my opinion, students should study pre-sessional courses in Nottingham because of the high-quality teaching, supportive academic environment, and opportunity to be part of a student community. Home country: Saudi Arabia Pre-sessional course: 30 weeks - levels 2, 3 and 4 Study mode: face-to-face Degree course after pre-sessional study: MSc Artificial Intelligence This course has been helpful in enhancing my academic English skills by providing structured lessons, sufficient practice opportunities and providing personal feedback. In addition, this course teaches research skills (primary and secondary research) which are greatly beneficial for our future study. The best part of this course for me is not only learning research skills but also practicing them by conducting research related to our discipline and then applying these skills to it. Tutors support us in various ways, including providing feedback on assignments, offering additional resources for further practice, and welcoming any questions outside of class hours. They do their best to help students and facilitate the educational process. Additionally, they understand that we are international students so they have the necessary patience and understanding. Anything else you would like to add about the course? This course has improved my skills, not only in time management but also in my ability to write more effectively. After this course, you will be able to compose 2,000-word essays with many interesting points such as: linking words, reporting verbs and utilizing high-level vocabulary, as opposed to the IELTS challenge of writing only 250 words. The University of Nottingham is one of Russell Group universities and it is seen as stronger on the academic front."
        }
    ],
    "pdf_files": []
}