{
    "url": "https://www.nottingham.ac.uk/cele/alacs/courses.aspx",
    "content": [
        {
            "p": "Courses to help you develop your use of academic language and communication skills. Continue to develop your academic, communication and language skills while studying your degree with our Academic Language and Communication Skills courses. Monday 7 October to Friday 6 December 2024 Booking will open at 10am on Friday 27 September Duration: Three weeks This course aims to prepare you at the beginning of your academic study. It will enable you to learn about key aspects of academic writing in the UK Higher Education, specifically to help you: Book a place on this course Access course materials on Moodle Duration: Six weeks This course aims to help you develop a clearer and more precise writing style, particularly in the areas of: Duration: Nine weeks This course helps you to: The aim of this course is to improve your active and passive vocabulary knowledge. It will help you to: This course aims to improve your pronunciation. It will help you to give presentations more confidently and participate more successfully in discussions with staff and other students. Specifically, it will help you to: The aim of this course is to develop your speaking skills and provide the opportunity to practise in an unpressured environment. It will: The aim of the course is to help you read more efficiently and quickly by: Duration: Four or five weeks This course aims to introduce you to the language and communication skills of academic seminar discussion. It will enable you to notice how academics and students communicate with each other and give you opportunities to develop similar skills by engaging in seminar discussions on a range of topics. Specifically, it will help you to: Book a place on the four-week course Book a place on the five-week course This course will help you to build your confidence for delivering an academic presentation; in particular, to give you opportunities to: Book a place on the five week course You are invited to send part of your writing to the tutor in advance, perhaps from an annual report or from an article you wish to submit to a journal. As a group, we look at a paragraph or two from each person, discussing content, structure, clarity and accuracy. The class provides an opportunity to get ideas and feedback from your peers as well as a tutor. This course will help you to familiarise yourself with the fundamental university requirements and expectations for academic coursework writing. The course helps you to: This course aims to familiarise yourself with the university expectations for avoiding plagiarism, developing a critical approach, and maintaining academic style in coursework. The course helps you to: Duration: six weeks This course helps you to familiarise yourself with requirements and expectations in scientific and technical writing. It helps you to: The purpose of this course is to help you to produce more effective argumentative writing within your science discipline. Key aims of the course are: Please note that while all students are welcome to attend, this course focuses on developing and communicating academic arguments within the natural and applied sciences, not the social sciences. The aim of the course is to help you develop your academic writing and provide support for your coursework. Key objectives are as follows: The aim of the course is to help you develop your academic writing and provide support for your coursework. Key objectives are to: Duration: Eight weeks The aim of the course is to examine aspects of academic writing and exam skills at the postgraduate level, including writing critically, using sources appropriately and preparing efficiently for written examinations. The aim of the course is to help you with the key speaking skills required on Business School postgraduate courses, including seminar discussions and academic presentations. Please note the exact focus of each session may be subject to change. In addition, it is possible that the order of the sessions changes according to student needs. Duration: Four weeks The aim of the course is to help you prepare for and deliver your presentations by considering expectations, and practising pronunciation, structures and vocabulary for different functions. You will also watch videos of previous presentations. Duration: Seven weeks The aim of the course is to help you to familiarise yourself with requirements and expectations in sociology and social policy writing assignments and seminars. The aim of the course is to help you develop your academic writing and provide support for your dissertation. Key objectives are to: The aim of the course is to help you develop your academic writing and provide support for your coursework on the PGCEi. Key objectives are to: The course deals with issues relating to writing at postgraduate level in law and content is flexible. The aim of the course is to help you familiarise yourself with requirements and expectations in the school. This course deals with issues relating to writing at postgraduate level in health sciences and content is flexible. The aim of the course is to develop your ability to read and use sources critically and appropriately, and to improve your academic language. We have a limited number of in-person consultations, with the majority offered on MS Teams. Consultations information and booking"
        }
    ],
    "pdf_files": []
}