{
    "url": "https://www.nottingham.ac.uk/cele/pre-sessional/apply.aspx",
    "content": [
        {
            "p": "All applications are made online through NottinghamHub. In order to apply for a Pre-sessional English for Academic Purposes course leading on to your degree course at the University of Nottingham, you will normally need to have an academic UKVI IELTS score (taken in the last two years). To apply for a pre-sessional course, you must have one of the following: All applications are made online through NottinghamHub. You will be asked to create a username and password when you make your application and will use these to access the system at any time. The decision about your application and communication from the university will also be made through this system. Apply through NottinghamHub If applying for an on-campus course, you will be sent an email with a form requesting additional information, please complete and return the form as soon as possible, as an offer cannot be made until this is received. If you have the correct entry requirements, you will be sent an email notifying you of our decision and your offer within two weeks. You can view this in NottinghamHub. When emails are sent, sometimes your email provider directs them into a junk/spam folder, so please check these folders as well as your inbox. If you are made an offer for a pre-sessional course, please check the information is correct on your offer letter. If any information is incorrect, please email us as soon as possible. To accept your offer, please click the 'Accept' button found in your NottinghamHub account. You need to accept your offer within two weeks of it being issued. CAS checking documents will be sent to you by email within four months prior to the start of your course (not before). You must check your CAS details and let us know whether the details are accurate or not. When we have received confirmation of your details, your CAS will be processed. This can take up to two weeks and your CAS will then be emailed to you. For 10, 8 and 6 week presessional courses, if you have not paid before registering, you will still be expected to pay 100% of CELE course fees after registration. There are no refunds for the course after you have registered. Email CELE for more information."
        }
    ],
    "pdf_files": []
}