{
    "url": "https://www.nottingham.ac.uk/cele/pre-sessional/faqs.aspx",
    "content": [
        {
            "p": "Useful information about our courses. Click on a topic below to see questions: This depends on the entry requirements of your degree course and your existing English language skills. To find out more, see which pre-sessional English course is right for you? This varies per course, see current fee information. No, in order to comply with UKVI requirements, all pre-sessional students must be able to show evidence of an offer of further study in the UK. This varies per course, see course dates and fees. For a step by step guide, see how to apply. You need a 6.0 (minimum 5.5) for a joint CAS. If you haven't got 5.5 in every element, you will need to get a single CAS for the pre-sessional course and extend your visa at the end of your course. Yes, if you have a different target IELTS, please contact us. We will let you know what course length you need. You do not need a visa if you choose to study an online pre-sessional course. If you choose to study a face-to-face course in Nottingham, you may need a visa. Depending on your status, you may be able to apply for a: For more details, see visa information. You can apply for university accommodation through the Accommodation Office. You can pay your fees online. You will need to show evidence of your ability to fund your studies in order to apply for your visa. If you require any help, contact international student recruitment. For 10, 8 and 6-week pre-sessional courses, there are no refunds for the course after you have registered. Contact us for more information. Please see our refund of fees regulations for full information. All learning materials are free and you will also have access to free online learning activities. If you are staying in Nottingham, you may be able to take part in leisure activities on campus. Some may be free, but others may incur a cost. You will need to need to budget for your accommodation and living costs. Registration details will be confirmed to you nearer the start date of your course. You will have one working week from the start date of your course to complete all registration requirements. Teaching will take place on Monday to Friday for the duration of your chosen course with the exception of public and university holidays when the university is closed. There will also be study days during each pre-sessional course term where you will be expected to study independently and these will be confirmed to you in advance. If you are successful in meeting the required marks in your final assessments, you will pass your pre-sessional course and you can usually progress directly to your degree course without retaking your IELTS or equivalent. Please contact us for details of courses that have additional entry requirements. International student recruitment can help with many different queries you might have about fees, visas, accommodation, arrival in the UK and more. They are here for you before you arrive and will support you throughout your studies. You can also contact us with any queries about your course, and we will be happy to help."
        }
    ],
    "pdf_files": []
}