{
    "url": "https://www.nottingham.ac.uk/cele/pre-sessional/visas.aspx",
    "content": [
        {
            "p": "Students have three main visa options, depending on the length of the course. Find out more about the type of visas, courses and visas available and questions to consider when applying for a visa. Students have three main visa options, depending on the length of the course: For applicants who intend to study at undergraduate or postgraduate level at a UK university shortly after their pre-sessional English programme. Requires a UKVI approved IELTS test (also known as a Secure English Language Test or SELT). Student visa information For applicants who will study for six to 11 months and would eventually like to study at undergraduate or postgraduate level at a UK university, but who do not currently have a UKVI approved IELTS score. STSV information For applicants who will study for six months or less and would eventually like to study at undergraduate or postgraduate level at a UK university, but who do not currently have a UKVI approved IELTS score. Visitor visa information Family members accompanying the main student visa holder (for example spouses and/or children under 18) would need to apply for a dependants' visa, more information can be found on the UK Government website. * Joint or integrated CAS are not available for all pre-sessional courses or for all students. You will be informed if you are eligible for a joint CAS (covering your pre-sessional course and your degree course) after you apply. Please visit our joint CAS frequently asked questions for more information. ** It is not normally appropriate to enter the UK for a pre-sessional English course under the short-term student or visitor visa routes where the degree course commences immediately after the pre-sessional course. This is because it is not possible to 'switch' from the visitor visa type in the UK. The student is required to travel outside the UK to obtain a full student visa, which takes time and affects the commencement of the academic programme. You may find it helpful to download the university's guidance on applying for your student visa from overseas and sample visa application guidance. There are a number of other questions you will need to consider before you apply: Joint CAS from the start of your pre-sessional course to the end of your degree course. Only applicable for courses between 6 months and 11 months maximum. You will need to return to your home country after this period/programme of study to reapply for another visa. Only applicable for course of six months and less. You will need to return to your home country after this period/ programme of study to reapply for another visa. Depends on the conditions for the main student visa holder. Single CAS - UKVI approved IELTS only. Joint CAS - IELTS required but does not need to be UKVI approved. IELTS required to study at the Centre for English Language Education but does not need to be UKVI approved. Single CAS Yes, if you study on a 30-week course and you are government sponsored. No, if you study on a 20 or 10-week course. Joint CAS Yes, if you are a postgraduate student or a sponsored undergraduate student. No. Single CAS Yes, up to a maximum of 10 hours per week. Joint CAS Yes, up to a maximum of 20 hours per week. Contact us if you need further help"
        }
    ],
    "pdf_files": []
}