{
    "url": "https://www.nottingham.ac.uk/cele/pre-sessional/specialist-courses.aspx",
    "content": [
        {
            "p": "We offer specialist courses for those with offers for specific degree subjects. We offer specialist Pre-sessional English for Academic Purposes courses for those with offers for specific degree subjects. In the event that the number recruited to a course is low, we may not be able to run it. If this is the case, we will inform you and provide more information at the earliest opportunity. This course is designed in collaboration with the Nottingham University Business School and runs for six weeks. It is suitable for undergraduate and postgraduate students going on to study a degree in business and management. This course is available to study on campus here in Nottingham. The main aims of the business and management course are to: You will be asked to do a series of tasks: You will be expected to study for at least 36 hours per week. The course will include seminar type sessions, individual and group tutorials and independent study tasks. At the end of course you will be assessed to see if you are ready to move on to your academic course. You will: Usually there are 14 to 18 students, but occasionally there may be over 18 in the class. If the number recruited to the course is low, we may not be able to run it. If this happens, we will inform you at the earliest opportunity. If you are successful in gaining the required marks in your final assessments, you will be able to move on to your degree at the Business School. This course is designed in collaboration with the School of Education and runs for six weeks. It is suitable for undergraduate and postgraduate students going on to study a degree in education. The main aims of the education course are to: Usually there are 14 to 18 students, but occasionally there will be over 18 in the class. If you are successful in gaining the required marks in your final assessments, you will be able to move on to your degree at the School of Education. Which course is right for you? Course dates and fees How to apply"
        }
    ],
    "pdf_files": []
}