{
    "url": "https://www.nottingham.ac.uk/cele/credit-bearing/index.aspx",
    "content": [
        {
            "p": "These modules offer students studying particular courses at the university the opportunity to enhance their English language skills and develop specialist knowledge that is relevant to their degree. Second year students from the Department of Modern Languages and Cultures, particularly those who are undertaking a year abroad and plan to do overseas assistantships, or related work placements can take this 20-credit, full year module. This module introduces some key principles and practical techniques in the teaching of English as a foreign language. It will include workshops, practical teaching sessions, as well as the opportunity to observe Centre for English Language Education classes. The content can be broken down as follows: This module is suitable for all first-year undergraduate students. It is worth 10 credits. This course will give you the opportunity to learn and refine the academic skills you will require in your academic discipline in order to more effectively engage in the learning processes and enhance your learning experience. The course will encourage research and critical reading skills, and train vital writing and oral presentation skills with a view to the production of a purposeful research project. For instance, you will develop skills to: You will receive constructive feedback on the work you produce for this course. Apply for this module on NottinghamHub This module is designed for 2+2 students in your first term at the University of Nottingham. With 16 hours of seminars and four hours of problem-based learning, it develops study skills in environmental science. You'll focus on critical reading, writing, argument development, and communication. Group work and independent learning are key components, supported by staff from the Centre for English Language Education, School of Geography, and Schools of Biosciences."
        }
    ],
    "pdf_files": []
}