{
    "url": "https://www.nottingham.ac.uk/cele/pre-sessional/joint-offers.aspx",
    "content": [
        {
            "p": "You may be eligible for a joint Confirmation of Acceptance of Studies (CAS). If you have an offer for a postgraduate level degree course and want to take a Pre-sessional English for Academic Purposes course of 10 or six weeks to precede the masters course start date in September, you may be eligible for a joint Confirmation of Acceptance of Studies (CAS). A joint CAS covers the pre-sessional course and the academic course, so you only have to apply for your Student Visa once. A joint CAS can be issued if you hold an offer for a postgraduate degree taught course* providing that: * Due to professional accreditation and/or clinical practice compliance requirements, the following course cannot be supported with a joint CAS: We are unable to issue joint CAS for any postgraduate certificate (PGCert) or postgraduate diploma (PGDip) offer of study. Please email our team of experts for clarification if you believe any of the options might apply to you. Students who qualify for a joint CAS will automatically receive a joint offer from our Admissions Team. We will begin issuing CAS documents for summer 2025 pre-sessional programmes during week commencing 28 April 2025. If you have an unconditional offer for CAS for either a 10 or six-week pre-sessional English course or a postgraduate course and have already received a CAS, we cannot change the CAS. You are welcome to email us for advice in this situation. It is possible to get a joint CAS if you hold an offer with two conditions, for example one is an academic condition related to your undergraduate degree results and one is an English language condition. This requires you to have a SELT English qualification. You would need to meet your academic condition/s no later than four weeks before the start date of your 10 or 6-week pre-sessional English course for consideration. If you prefer to receive a single CAS for your pre-sessional English course due to timing, please let us know. For relevant deadline information, please refer to our course dates and fees webpage. If you are planning on coming to the UK with a CAS that only covers a pre-sessional English course, you will need a UKVI IELTS test. Many students choose to have a UKVI IELTS to make sure that they can keep all options open. However, you can apply for a joint CAS with a non-UKVI IELTS with an overall score of 5.5 and 5.5 in all elements (reading, writing, listening and speaking) or above. Please visit the pre-sessional English courses page for requirements. If you accept an offer for a 10-week pre-sessional English course and then get an IELTS score that allows you to do the six-week pre-sessional English course, it is only possible to change course if you have not already received a CAS and the course application deadline has not passed. If you have already received a CAS, it is not possible to switch, you would need to reapply. You will need to accept your joint offer two weeks after receiving confirmation. You will need to pay a deposit of £2,000 when you accept your offer before you can receive your joint CAS. Once you receive a joint CAS, you are obliged to attend both courses in order to comply with the attendance and engagement rules of the UKVI."
        }
    ],
    "pdf_files": []
}