{
    "url": "https://www.nottingham.edu.my/CFFRC/StudentProjects/FoodPlus-brassica-crops-(ID-code-FoodP1-008).aspx",
    "content": [
        {
            "p": "Project Title Understanding the physiology and shelf life of underutilised brassica crops Project Description The postharvest performance of underutilized brassica crops will be thoroughly investigated. Initially, local brassica species/cultivars will be identified. The parameters to be studied include shelf life, respiration rate, ethylene production, turgor loss, profiling of key phytochemicals e.g. glucosinolates, mineral, micro and macronutrient composition. Additionally, soil minerals from where the plants were grown would be analysed to relate soil mineral composition to plant mineral composition and subsequent postharvest performance. The next phase of the project is to explore the consumer’s attitude towards new crops with reduced packaging. The potential of new crops within Malaysia and the UK as well as the potential for novel packaging to offer a unique selling point will be assessed at this phase of experimentation. Following that, a subset of brassica will be grown at CFFRC and postharvest testing will be repeated, along with some intervention aimed at extending the shelf life such as modified atmosphere/controlled atmosphere packaging. The studies also include mapping population to assess the postharvest performance and phytonutrient profile of the different lines. A reasonably rapidly cycling Brassica of commercial use will be used for the population studies. The objective of this study is to generate the trait data for variation in nutritional content and also to explore the consumer preferences towards new crops and novel packaging. This project will be conducted partially in University of Nottingham, Malaysia Campus and partially in University of Reading UK. Level: PhD Supervisor names and contact details Asgar Ali, School of Biosciences, UNMC (asgar.ali@nottingham.edu.my) Carol Wagstaff, Department of Food and Nutritional Sciences, UoR (c.wagstaff@reading.ac.uk ) Martin Broadley, School of Biosciences, UNUK (martin.broadley@nottingham.ac.uk ) Yasmeen Siddiqui, Department of Plant Protection (yasmeen@putra.upm.edu.my ) Sean Mayes, CFFRC (sean.mayes@nottingham.ac.uk ) Further information: Crops for the Future Research Centre| (CFFRC) is pleased to announce its support for a wide range of scholarship opportunities for postgraduate projects (PhD and MRes) registered at the University of Nottingham Malaysia Campus. Funded studentships will relate to the research themes and programmes of CFFRC. Applicants should have a good first degree from an accredited institution in a relevant field. Students who do not speak English as a first language must also meet the relevant English language qualifications as determined by the School of Biosciences|. Applicants are encouraged to contact the first supervisor listed in each instance for further information about the scholarship, including application details and entry requirements. Please quote I.D. code on all correspondence. telephone: +6 (03) 8924 8799 fax: +6 (03) 8924 8798 email: enquiries@cffresearch.org"
        }
    ],
    "pdf_files": []
}