{
    "url": "https://www.nottingham.ac.uk/chaplaincy/index.aspx/",
    "content": [
        {
            "p": "Chaplains are here to support all students and staff of any faith or none. They help people practice their faith and engage with faith communities. They also offer general pastoral support to anyone who needs a listening ear or someone to talk things through with. Further information about how we can support your academic studies can be found by following the links on the right. What is chaplaincy? Religious observance & your studies Book an appointment Detailed biographies of our chaplains and staff members are availble if you would like to find out more about us and our different roles Chaplaincy support available for staff and students, including pastoral and bereavement support A listing for all upcoming events and activties that the Chaplaincy and Faith Support team are hosting A-Z of faiths. Information on different faiths, finding places of worship and faith groups for students and staff. We run a number of activities specifically for international students of any faith or none, here is an overview of what you can get involved in Information on faith support for LGBTQIA+ students and staff A calendar for 2024/25 to support everyone in our university community to plan for, participate in, celebrate, observe and remember key EDI-related events such as faith festivals. Information on prayer rooms and Chaplaincy faith spaces, including how to book rooms for faith activities Not sure where to find us? Directions and information on where to find us on all three campuses Information on local faith-based organisations for support and volunteering opportunities Find the latest edition of the Chaplaincy and Faith Support Newsletter and how to sign up to receive regular updates As a student at UoN you can access support 24 hours a day, 7 days a week, 365 days a year with Togetherall. Whether you want to speak to other peers or a trained professional, there will be someone there every minute of every day. You can join a supportive online community where interactions are anonymous, take part in courses and use other wellbeing tools like journaling, goal setting and self-assessments for support. Sign up is free, use Togetherall.com to join with your academic email address – it takes 5 minutes, and you’ll have immediate access to support. A29, Portland Building University of Nottingham University Park, Nottingham, NG7 2RD Tel: +44 (0)115 951 3931 Email: chaplains@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}