{
    "url": "https://www.nottingham.ac.uk/chaplaincy/faith-based-organisations/faith-based-organisations.aspx",
    "content": [
        {
            "p": "We serve 140+ hot meals every Wednesday night between 5.30- 7pm, to those in need in Hyson Green, Nottingham from The Bridge Centre on Gregory Boulevard. SaSh Kitchen is always happy to hear from students wishing to volunteer with them. Visit their volunteering page to find out more Our vision is a world where forced migrants are welcomed, safe, and have hope to rebuild their lives for a better future. There are many different ways to volunteer at Baca, which include Education Mentors, Sport and Music Volunteers, Residential Volunteers, Residential Cover Volunteers and Holistic Mentors. Find out more here. Mary’s Meals is a registered charity serving a nutritious daily meal to some of the world’s poorest children to attract them into the classroom where they can gain an education and a brighter future. We are always looking for volunteers to join our mission and help us feed the next hungry child. All volunteers are fully supported, and all training / resources will be provided. If you think you would like to get involved with Mary’s Meals, please contact your local Supporter Engagement Officer Jane Wright via email – jane.wright@marysmeals.org There are 67 million primary school-age children out of school around the world; they have to work or beg to survive. And when they do make it into the classroom, hunger affects their ability to learn. Mary’s Meals gives children the energy to learn so they can become the men and women who will lift their communities out of poverty in later life. Our vision is that every child receives one daily meal in their place of education and that all those who have more than they need, share with those who lack even the most basic things. A29, Portland Building University of Nottingham University Park, Nottingham, NG7 2RD Tel: +44 (0)115 951 3931 Email: chaplains@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}