{
    "url": "https://www.nottingham.ac.uk/chaplaincy/international-students-and-staff/international.aspx",
    "content": [
        {
            "p": "Faith, religion or belief can be an important part of life for many international members of our University community. All chaplains are here support you during your time at the University of Nottingham. We offer pastoral support and can help you make friends and feel at home in a new culture. Some of the international activties we organise are in collaboration with a Christian organisation, Friends International. Many of these are social events open to all international students and staff, some are specifically for international Christians and some are for those wanting to learn more about the Christian faith. If you would like to know more about any international events listed on our events page, please do just get in touch. We have international chaplains based on University Park, Jubilee Campus and Sutton Bonington Campus. If you would like to speak to one of the international chaplains or any of the other faith chaplains please feel free to book an appointment. Our International Chaplains availability: Val Owens - International chaplain at Sutton Bonington Campus on Tuesdays, Wednesdays and Thursdays (email to make an appointment) Madeleine Bonicel - International chaplain at University Park on Mondays and Jubilee Campus on Wednesdays Lydia Panter - Assistant International chaplain at University Park on Mondays and Jubilee Campus on Wednesdays Grace Li - International chaplain & Mandarin speaking support at Jubilee Campus on Wednesdays and Thursdays A list of all Chaplaincy events, including those for international students and staff Kitchenware and homeware for international students. A recycling project based on Sutton Bonington Campus Sign up to our Chaplaincy newsletter to receive regular updates and event listings Would you like to be linked to a local host whilst studying in Nottingham? Local Link is a great opportunity to: If so, sign up through the Friends International App A29, Portland Building University of Nottingham University Park, Nottingham, NG7 2RD Tel: +44 (0)115 951 3931 Email: chaplains@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}