{
    "url": "https://www.nottingham.ac.uk/chemistry/people/martyn.poliakoff",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR Process Intensification of the Continuous Synthesis of Bio-Derived Monomers for Sustainable Coatings Using a Taylor Vortex Flow Reactor (2024) Journal Article Edwards, M. D., Pratley, M. T., Gordon, C. M., Teixeira, R. I., Ali, H., Mahmood, I., Lester, R., Love, A., Hermens, J. G., Freese, T., Feringa, B. L., Poliakoff, M., & George, M. W. (2024). Process Intensification of the Continuous Synthesis of Bio-Derived Monomers for Sustainable Coatings Using a Taylor Vortex Flow Reactor. Organic Process Research and Development, 28(5), 1917–1928. https://doi.org/10.1021/acs.oprd.3c00462 We describe the optimization and scale-up of two consecutive reaction steps in the synthesis of bio-derived alkoxybutenolide monomers that have been reported as potential replacements for acrylate-based coatings ( Sci. Adv. 2020, 6, eabe0026). These... Read More about Process Intensification of the Continuous Synthesis of Bio-Derived Monomers for Sustainable Coatings Using a Taylor Vortex Flow Reactor. Reducing the Environmental Impact of Solvents for Catalytic Reactions (2024) Presentation / Conference Contribution Poliakoff, M., & George, M. W. (2022, November). Reducing the Environmental Impact of Solvents for Catalytic Reactions. Presented at 26th International Solvay Conference on Chemistry: Chemistry Challenges of the 21st Century , Hotel Plaza, Brussels, Belgium , 17 – 19 October 2022, Brussels, Belgium High-Productivity Single-Pass Electrochemical Birch Reduction of Naphthalenes in a Continuous Flow Electrochemical Taylor Vortex Reactor (2022) Journal Article Lee, D. S., Love, A., Mansouri, Z., Waldron Clarke, T. H., Harrowven, D. C., Jefferson-Loveday, R., Pickering, S. J., Poliakoff, M., & George, M. W. (2022). High-Productivity Single-Pass Electrochemical Birch Reduction of Naphthalenes in a Continuous Flow Electrochemical Taylor Vortex Reactor. Organic Process Research and Development, 26(9), 2674-2684. https://doi.org/10.1021/acs.oprd.2c00108 We report the development of a single-pass electrochemical Birch reduction carried out in a small footprint electrochemical Taylor vortex reactor with projected productivities of >80 g day-1 (based on 32.2 mmol h-1), using a modified version of our p... Read More about High-Productivity Single-Pass Electrochemical Birch Reduction of Naphthalenes in a Continuous Flow Electrochemical Taylor Vortex Reactor. Photochemistry of transition metal carbonyls (2022) Journal Article Turner, J. J., George, M. W., Poliakoff, M., & Perutz, R. N. (2022). Photochemistry of transition metal carbonyls. Chemical Society Reviews, https://doi.org/10.1039/d1cs00826a The purpose of this Tutorial Review is to outline the fundamental photochemistry of metal carbonyls, and to show how the advances in technology have increased our understanding of the detailed mechanisms, particularly how relatively simple experiment... Read More about Photochemistry of transition metal carbonyls. High Yielding Continuous-Flow Synthesis of Norketamine (2022) Journal Article Hernando, M. V., Moore, J. C., Howie, R. A., Castledine, R. A., Bourne, S. L., Jenkins, G. N., Licence, P., Poliakoff, M., & George, M. W. (2022). High Yielding Continuous-Flow Synthesis of Norketamine. Organic Process Research and Development, 26(4), 1145-1151. https://doi.org/10.1021/acs.oprd.1c00407 A new continuous-flow process is presented for synthesis of the pharmaceutical intermediate norketamine (5). Our approach has been to take the well-established and industrially applied batch synthetic route to this promising antidepressant precursor... Read More about High Yielding Continuous-Flow Synthesis of Norketamine. Self-Optimization of Continuous Flow Electrochemical Synthesis Using Fourier Transform Infrared Spectroscopy and Gas Chromatography (2021) Journal Article Ke, J., Gao, C., Folgueiras-Amador, A. A., Jolley, K. E., de Frutos, O., Mateos, C., Rincón, J. A., Brown, R. C., Poliakoff, M., & George, M. W. (2022). Self-Optimization of Continuous Flow Electrochemical Synthesis Using Fourier Transform Infrared Spectroscopy and Gas Chromatography. Applied Spectroscopy, 76(1), 38-50. https://doi.org/10.1177/00037028211059848 A continuous-flow electrochemical synthesis platform has been developed to enable self-optimization of reaction conditions of organic electrochemical reactions using attenuated total reflection Fourier transform infrared spectroscopy (ATR FT-IR) and... Read More about Self-Optimization of Continuous Flow Electrochemical Synthesis Using Fourier Transform Infrared Spectroscopy and Gas Chromatography. Integrated Multistep Photochemical and Thermal Continuous Flow Reactions: Production of Bicyclic Lactones with Kilogram Productivity (2021) Journal Article Howie, R. A., Elliott, L. D., Kayal, S., Sun, X. Z., Hanson-Heine, M. W., Hunter, J., Clark, C. A., Love, A., Wiseall, C., Lee, D. S., Poliakoff, M., Booker Milburn, K. I., & George, M. W. (2021). Integrated Multistep Photochemical and Thermal Continuous Flow Reactions: Production of Bicyclic Lactones with Kilogram Productivity. Organic Process Research and Development, 25(9), 2052-2059. https://doi.org/10.1021/acs.oprd.1c00089 Combining continuous photochemistry and flow reactions in high-temperature/high-pressure water has enabled us to integrate a multistep sequence into a single process with a reduction in reaction time to <10 min compared to >24 h in batch. At the same... Read More about Integrated Multistep Photochemical and Thermal Continuous Flow Reactions: Production of Bicyclic Lactones with Kilogram Productivity. Multigram Synthesis of Trioxanes Enabled by a Supercritical CO2 Integrated Flow Process (2021) Journal Article Wu, L., Abreu, B. L., Blake, A. J., Taylor, L. J., Lewis, W., Argent, S. P., Poliakoff, M., Boufroura, H., & George, M. W. (2021). Multigram Synthesis of Trioxanes Enabled by a Supercritical CO2 Integrated Flow Process. Organic Process Research and Development, 25(8), 1873-1881. https://doi.org/10.1021/acs.oprd.1c00111 Photochemical synthesis of highly reactive hydroperoxides and their conversion into useful products, such as 1,2,4-trioxanes, are of wide interest for synthetic organic chemistry and pharmaceutical manufacturing particularly because of their relevanc... Read More about Multigram Synthesis of Trioxanes Enabled by a Supercritical CO2 Integrated Flow Process. Scalable Continuous Vortex Reactor for Gram to Kilo Scale for UV and Visible Photochemistry (2020) Journal Article Lee, D. S., Sharabi, M., Jefferson-Loveday, R., Pickering, S. J., Poliakoff, M., & George, M. W. (2020). Scalable Continuous Vortex Reactor for Gram to Kilo Scale for UV and Visible Photochemistry. Organic Process Research and Development, 24(2), 201-206. https://doi.org/10.1021/acs.oprd.9b00475 © 2020 American Chemical Society. We report the development of a scalable continuous Taylor vortex reactor for both UV and visible photochemistry. This builds on our recent report (Org. Process Res. Dev. 2017, 21, 1042) detailing a new approach to co... Read More about Scalable Continuous Vortex Reactor for Gram to Kilo Scale for UV and Visible Photochemistry. In Situ Sulfidation of Pd/C: A Straightforward Method for Chemoselective Conjugate Reduction by Continuous Hydrogenation (2019) Journal Article Moore, J. C., Howie, R. A., Bourne, S. L., Jenkins, G. N., Licence, P., Poliakoff, M., & George, M. W. (2019). In Situ Sulfidation of Pd/C: A Straightforward Method for Chemoselective Conjugate Reduction by Continuous Hydrogenation. ACS Sustainable Chemistry and Engineering, 7(19), 16814-16819. https://doi.org/10.1021/acssuschemeng.9b04347 A method has been developed for the in situ sulfidation of Pd/C under continuous flow. The approach provides a cheap, sustainable, and operationally convenient method for chemoselective conjugate reduction by continuous hydrogenation. High conversio... Read More about In Situ Sulfidation of Pd/C: A Straightforward Method for Chemoselective Conjugate Reduction by Continuous Hydrogenation. Turning the periodic table upside down (2019) Journal Article Poliakoff, M., Makin, A. D. J., Tang, S. L. Y., & Poliakoff, E. (2019). Turning the periodic table upside down. Nature Chemistry, 11(5), 391-393. https://doi.org/10.1038/s41557-019-0253-6 The periodic table is immensely powerful for rationalizing many different properties of the chemical elements, but would turning it on its head make some important aspects easier to understand and give everyone a new perspective on chemistry? Photooxidation of Fulvenes in a Continuous Flow Photoreactor using Carbon Dioxide as a Solvent (2018) Journal Article Wu, L., Lee, D. S., Boufroura, H., Poliakoff, M., & George, M. W. (2018). Photooxidation of Fulvenes in a Continuous Flow Photoreactor using Carbon Dioxide as a Solvent. Chemphotochem, 2(7), 580-585. https://doi.org/10.1002/cptc.201800033 A range of 3‐substituted oxepinones have been synthesised by the photooxidation of fulvenes with photochemically generated singlet oxygen (1O2) using carbon dioxide (CO2) as a solvent and a CO2‐soluble porphyrin photosensitizer. The reactive intermed... Read More about Photooxidation of Fulvenes in a Continuous Flow Photoreactor using Carbon Dioxide as a Solvent. UN sustainable development goals: How can sustainable/green chemistry contribute? By doing things differently (2018) Journal Article Poliakoff, M., Licence, P., & George, M. W. (2018). UN sustainable development goals: How can sustainable/green chemistry contribute? By doing things differently. Current Opinion in Green and Sustainable Chemistry, 13, 146-149. https://doi.org/10.1016/j.cogsc.2018.04.011 Until now, much Green and Sustainable Chemistry has been focused on how chemicals are made. Here we suggest that, if chemistry is to contribute effectively to achieving the SDGs, we need to change the way that things are done at both ends of the chem... Read More about UN sustainable development goals: How can sustainable/green chemistry contribute? By doing things differently. Tribute to Daedalus: Fertile mind that led to unexpected places (2017) Journal Article Poliakoff, M., & Perutz, R. N. (2017). Tribute to Daedalus: Fertile mind that led to unexpected places. Nature, 549(7670), https://doi.org/10.1038/549031d Tribute to Daedalus, David E.H. Jones. Valorisation of lignin by depolymerisation and fractionation using supercritical fluids and conventional solvents (2017) Journal Article Perez, E., Tuck, C. O., & Poliakoff, M. (in press). Valorisation of lignin by depolymerisation and fractionation using supercritical fluids and conventional solvents. Journal of Supercritical Fluids, https://doi.org/10.1016/j.supflu.2017.07.033 A procedure for Lignosulphonate valorisation is investigated. An attempt has been made to obtain diverse value-added products maximizing the atom economy. This procedure is carried in sequential steps starting with an oxidative depolymerization in su... Read More about Valorisation of lignin by depolymerisation and fractionation using supercritical fluids and conventional solvents. Continuous Photo-Oxidation in a Vortex Reactor: Efficient Operations Using Air Drawn from the Laboratory (2017) Journal Article Lee, D. S., Amara, Z., Clark, C. A., Xu, Z., Kakimpa, B., Morvan, H. P., Pickering, S. J., Poliakoff, M., & George, M. W. (2017). Continuous Photo-Oxidation in a Vortex Reactor: Efficient Operations Using Air Drawn from the Laboratory. Organic Process Research and Development, 21(7), 1042-1050. https://doi.org/10.1021/acs.oprd.7b00153 © 2017 American Chemical Society. We report the construction and use of a vortex reactor which uses a rapidly rotating cylinder to generate Taylor vortices for continuous flow thermal and photochemical reactions. The reactor is designed to operate un... Read More about Continuous Photo-Oxidation in a Vortex Reactor: Efficient Operations Using Air Drawn from the Laboratory. Continuous niobium phosphate catalysed Skraup reaction for quinoline synthesis from solketal (2017) Journal Article Jin, J., Guidi, S., Amara, Z., Selva, M., George, M. W., & Poliakoff, M. (2017). Continuous niobium phosphate catalysed Skraup reaction for quinoline synthesis from solketal. Green Chemistry, 19(10), 2439-2447. https://doi.org/10.1039/C6GC03140D Solketal is derived from the reaction of acetone with glycerol, a by-product product of the biodiesel industry. We report here the continuous reaction of solketal with anilines over a solid acid niobium phosphate (NbP), for the continuous generation... Read More about Continuous niobium phosphate catalysed Skraup reaction for quinoline synthesis from solketal. Continuous N-alkylation reactions of amino alcohols using γ-Al2O3 and supercritical CO2: unexpected formation of cyclic ureas and urethanes by reaction with CO2 (2017) Journal Article Streng, E. S., Lee, D. S., George, M. W., & Poliakoff, M. (2017). Continuous N-alkylation reactions of amino alcohols using γ-Al2O3 and supercritical CO2: unexpected formation of cyclic ureas and urethanes by reaction with CO2. Beilstein Journal of Organic Chemistry, 13, https://doi.org/10.3762/bjoc.13.36 The use of γ-Al2O3 as a heterogeneous catalyst in scCO2, has be successfully applied to the amination of alcohols for the synthesis of N-alkylated heterocycles. The optimal reaction conditions (temperature and substrate flow rate) were determined usi... Read More about Continuous N-alkylation reactions of amino alcohols using γ-Al2O3 and supercritical CO2: unexpected formation of cyclic ureas and urethanes by reaction with CO2. A laboratory-scale annular continuous flow reactor for UV photochemistry using excimer lamps for discrete wavelength excitation and its use in a wavelength study of a photodecarboxlyative cyclisation (2016) Journal Article DeLaney, E. N., Lee, D. S., Elliott, L. D., Jin, J., Booker-Milburn, K., Poliakoff, M., & George, M. W. (2017). A laboratory-scale annular continuous flow reactor for UV photochemistry using excimer lamps for discrete wavelength excitation and its use in a wavelength study of a photodecarboxlyative cyclisation. Green Chemistry, 19(6), 1431-1438. https://doi.org/10.1039/C6GC02888H This paper describes a new annular reactor for continuous UV photochemistry, which uses easily interchangeable excimer lamps of different wavelengths. The reactor has narrow clearance to form thin films of material for efficient irradiation of molecu... Read More about A laboratory-scale annular continuous flow reactor for UV photochemistry using excimer lamps for discrete wavelength excitation and its use in a wavelength study of a photodecarboxlyative cyclisation. The phase equilibrium and density studies of the ternary mixtures of CO2 + Ar + N2 and CO2 + Ar + H2, systems relevance to CCS technology (2016) Journal Article Ke, J., Suleiman, N., Sanchez-Vicente, Y., Murphy, T. S., Rodriguez, J., Ramos, A., Poliakoff, M., & George, M. W. (2017). The phase equilibrium and density studies of the ternary mixtures of CO2 + Ar + N2 and CO2 + Ar + H2, systems relevance to CCS technology. International Journal of Greenhouse Gas Control, 56, 55-66. https://doi.org/10.1016/j.ijggc.2016.11.003 The p-T phase diagrams of two ternary systems (CO2 + Ar + N2 and CO2 + Ar + H2) have been measured at temperatures between 268 and 303 K using a fibre-optic phase equilibrium analyser. CO2, which is the major component, has a mole fraction ranging fr... Read More about The phase equilibrium and density studies of the ternary mixtures of CO2 + Ar + N2 and CO2 + Ar + H2, systems relevance to CCS technology. Showing 1 - 20 of 26 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}