{
    "url": "http://www.nottingham.ac.uk/chemistry/research/centres-and-institutes/centre-for-sustainable-chemistry.aspx",
    "content": [
        {
            "p": "In our search for better medicines to improve healthcare in an ageing population, for safer agrochemicals to aid food production for a growing population, and for new materials to match our insatiable desire for new technology, Chemistry plays the dominant role. Without Chemistry the scientific advances required to secure our future will simply not be available. However Chemistry is often viewed as demanding in its need for energy and natural resources, and its impact on the environment. We have to ensure that our Chemistry is safe, efficient and, above all, sustainable – Chemistry that is benign by design. The School of Chemistry is committed to focusing its world class research expertise on the major challenges that affect us all – healthcare, energy and sustainability. As part of this commitment we have recently established a Centre of Excellence for Sustainable Chemistry. The Carbon Neutral Laboratory The Centre for Sustainable Chemistry is now housed in a brand new carbon neutral laboratory, the first of its kind in the UK. Part funded by a very generous gift from GlaxoSmithKline, the building is served as a hub to catalyse new collaborations with industry. The Centre is unique in the UK not only in its design but also in its focus on world-leading research activity in sustainable chemistry that aims for the highest \"clean and green\" standards to minimise environmental impact and ensure that the new chemistry developed is both energy and resource efficient, and sustainable. Located on the University’s award winning innovation Park, the new carbon neutral laboratory building provides unrivalled facilities for chemistry. The focus on sustainability is reflected in the building itself, which incorporates the latest technologies to allow it to be carbon-neutral over its lifetime. The laboratory is built from natural materials and energy required to run the laboratory is met by renewable sources such as solar power and sustainable biomass. Excess energy created by the building provides enough carbon credits over 25 years to pay back the carbon used in its construction. The building occupies 4500 m2 over two floors and in addition to laboratory space for ca. 100 researchers, it contains dedicated instrument rooms, a teaching laboratory for advanced undergraduate classes, and space for a range of outreach activities. The Carbon Neutral Laboratory and Centre for Sustainable Chemistry will build research capacity – two new Chair appointments will be made to develop Nottingham's ambition to be the UK centre of excellence in this area. A GSK-EPSRC funded Chair in Sustainable Chemistry and a University appointment in physical chemistry linked to our sustainability agenda will see the start of that growth in 2013 Research Focus All research in the Carbon Neutral Laboratory aims for the highest “clean and green” standards, providing an excellent opportunity for closer collaboration with UK industry and for developing a wide range of collaborative research programmes. Potential research themes include: Education and Training We also plan to put in place an innovative new training framework and develop an ethos for sustainability that will be unique in the UK – the creation of a ‘benign-by-design’ research culture for the 21st century chemist – and make new scientists from Nottingham “industry ready”, with a thorough understanding of the sustainability and environmental impact of their work. We will grasp the opportunity to place sustainability high on the educational agenda. New modules will be delivered by the School of Chemistry and collaborators through specialist courses and seminars. In addition our unique CNL building will provide outstanding facilities for teaching. Outreach and Public Engagement The new building will also provide unrivalled opportunities to engage in outreach activities, and international visibility through our pioneering YouTube videos. We will engage, encourage and educate new audiences by providing a teaching laboratory as a flexible facility for using the CNL as a regional hub for chemistry education, offering local schools and colleges access to a working laboratory (with technical support) to conduct experimental science using facilities and instruments not routinely available within the classroom environment. For all enquiries please visit: www.nottingham.ac.uk/enquire"
        }
    ],
    "pdf_files": []
}