{
    "url": "https://www.nottingham.ac.uk/chemistry/research/centre-for-sustainable-chemistry/the-carbon-neutral-laboratory.aspx",
    "content": [
        {
            "p": "Located on the University’s award winning innovation Park, the new carbon neutral laboratory building provides unrivalled facilities for chemistry. The focus on sustainability is reflected in the building itself, which incorporates the latest technologies to allow it to be carbon-neutral over its lifetime. The laboratory is built from natural materials and energy required to run the laboratory is met by renewable sources such as solar power and sustainable biomass. Excess energy created by the building provides enough carbon credits over 25 years to pay back the carbon used in its construction. The building occupies 4500 square metres over two floors and in addition to laboratory space for around 100 researchers, it contains dedicated instrument rooms, a teaching laboratory for advanced undergraduate classes, and space for a range of outreach activities. GSK’s target of developing a carbon-neutral value chain by 2050 has seen the pharmaceutical company turn its attention to the sustainability of its laboratories which, alongside office facilities, account for 14% of the firm’s total carbon emissions. GSK therefore wanted to produce a carbon-neutral laboratory in the UK, incorporating innovative design features which comply with green building standards and could be replicated at other laboratories internationally in the future. The £15.8m GSK Carbon Neutral Laboratories for Sustainable Chemistry at the University of Nottingham, was officially opened on 27 February 2017. Backed by a £12m fund from GSK, the building is not only designed to offset the carbon emissions from construction within the next 25 years, but also utilises water reduction and heat-capturing technologies to deliver an array of additional environmental benefits. In April 2017, the building was awarded the BREEAM Outstanding and LEED Platinum certifications – the highest levels of green building certifications. Timber for the building's frame had to be transported by boat from Europe in order to comply with LEED requirements. Traditionally, chemical laboratories are highly energy-intensive and most are operational 24 hours a day due to complex temperature needs for the manufacture and storage of chemicals. For example, energy-intensive cooling systems are required to stop temperatures reaching levels where solvents will evaporate. Meanwhile, recovering excess heat from processes can be challenging due to the risk of chemical and fume corrosion on the ventilation systems. GSK first agreed to fund the project at the University of Nottingham in 2012, and AECOM was brought in to deliver the LEED and BREEAM services for the project, as well as mechanical, electrical, public health and structural engineering and computational fluid dynamics (CFD) modelling. The completed building includes state-of-the-art teaching and research laboratories, writing-up areas, school outreach space, academic offices, seminar rooms and a communal winter garden. Throughout the project development, cooling systems were only incorporated where absolutely required – for example, the Nuclear Magnetic Resonance lab, which is mechanically ventilated. A single lab in the centre of the building has been fitted with a natural ventilation system, to test its viability elsewhere. Chemicals at the facility are held in special storage units, meaning individual laboratories can shut down operations at night, leading to substantial energy reductions in ventilation and cooling requirements. A 125kWe biofuel combined heat and power (CHP) system was built on-site, providing the majority of heat needed for the buildings. As well as lowering carbon emissions, the CHP system exports excess heat to adjacent buildings located on the University of Nottingham campus. Also situated on-site, a 230.9kWp solar array covers approximately 45% of the main building’s roof, while LED lighting has been fitted throughout, at an average of 5.4 Watts/sq.m. Overall, the building is estimated to deliver power savings of more than 60% and will use just 15% of the heat needed for a more traditional building design. Excess energy created by the building (some 40MWh) will provide enough carbon credits over 25 years to offset the construction phase, and is being used to heat the nearby office development on campus. The annual power consumption of the building is expected to reach 572MWh, which is 37% of the consumption benchmark for a chemistry laboratory. The PV array will deliver approximately 201MWh of solar generation annually and the biofuel CHP will generate 410MWh of power and 503MWh of heat annually. A total of 284MWh will be exported to adjacent buildings on the site, 40MWh over and above total building consumption after imported energy is accounted for. The frame, walls and floors of the building are built using PEFC and FSC-certified timber, sourced by ship from Europe as part of the LEED requirements. The winter garden has also been designed to capture low-level heat in the spring, while the roof has been fitted with a range of biodiverse, drought-resistant crops. The building also incorporates numerous water reduction technologies, such as a water leak detection system and a sustainable drainage system designed to absorb discharge from the green roof,dry swales and filter drains. BREEAM calculations suggest that the building’s water consumption is 5.47cu m per person annually, a 63% improvement in water efficiency. The GSK Carbon Neutral Laboratories for Sustainable Chemistry aims to be a catalyst for new industry collaborations and will focus on world-leading ‘clean and green’ research in sustainable chemistry. The centre will also act as a regional hub for chemistry education, giving local schools and colleges access to working laboratories and technical support. For all enquiries please visit: www.nottingham.ac.uk/enquire"
        }
    ],
    "pdf_files": []
}