{
    "url": "https://www.nottingham.ac.uk/chemistry/about/index.aspx",
    "content": [
        {
            "p": "The School of Chemistry at Nottingham has a reputation for excellence in teaching and research: The School of Chemistry offers a wide range of undergraduate honours degree programmes both within the school and collaboratively with other schools across the campus, recruiting over 150 new undergraduates each year. The range of available programmes reflects the ‘centre stage’ that chemistry occupies within the sciences, as well as the wide range of career opportunities available to science graduates. The School of Chemistry has a thriving research environment, with 160 postgraduate students and 60 postdoctoral fellows from all corners of the globe. These co-workers reflect the research activity of over 40 academic staff, supported by 30 technical staff. Chemistry is a truly multi-disciplinary science and our researchers are engaged in, and leading, major university-wide research initiatives in areas such as the medical and biological sciences, chemical engineering, and nanoscience. Reflecting the cross-disciplinary nature of our research, researchers from the School of Chemistry are located in our chemistry building on University Park, as well as in the Biodiscovery Institute and the GSK Carbon Neutral Laboratories for Sustainable Chemistry. Click here to take a virtual step into the Carbon Neutral Laboratories, allowing you to see the facilities and hear from researchers working in the field of sustainable chemistry. The poster session within the virtual winter garden showcases research from across the School of Chemistry, and footage of the laboratories highlights our excellent analytical and research facilities. To support our wide-ranging research programmes, we draw significant research funding from: The value of research grants from these organisations for each of the previous two years exceed £10 million. Reflecting our national and international research reputation, scientists within the School of Chemistry have received numerous awards and prizes from the Royal Society of Chemistry and industry. Our excellence in research is the foundation for our undergraduate teaching programmes, which provide a first class training in chemistry by experts in their field. Our teaching programme is strongly supported by the chemical and pharmaceutical industries, many of which sponsor annual undergraduate prizes for outstanding achievement. Our teaching laboratories have been recently refurbished and are equipped with state-of-the-art instrumentation, augmented by a recent £300K grant (from the HEFCE Teaching and Learning Fund). These investments follow the upgrading of our two main lecture theatres (£600K) to include state-of-the-art audio-visual facilities for undergraduate teaching and as a major conference venue. University and HEFCE funding continues to support the upgrading of facilities and new projects in the School of Chemistry, as recognition of our excellence in teaching and research. The School has a dynamic, vibrant and highly stimulating teaching and research environment which is achieved through a truly international blend of students and researchers from different cultures who are committed to learning and scientific discovery. The excellence of our staff and students make our school one of the leading Schools of Chemistry in the UK. We welcome applications from home and international students for our wide range of BSc, MSci, and graduate programmes. The choice of subject areas is extensive and we are confident that we have a course to suit your interests. Our objectives are to ensure that your future ambitions can be achieved by studying at Nottingham. The city of Nottingham has many attractions, ranging from sporting to cultural facilities. Not only is the campus conveniently located outside the city centre in extensive parkland, but there is also easy access to the surrounding countryside. Nottingham is a great place to live and study! Click here to find out more about living in Nottingham. For all enquiries please visit: www.nottingham.ac.uk/enquire"
        }
    ],
    "pdf_files": []
}