{
    "url": "https://www.nottingham.ac.uk/chemistry/diversity/workingenvironment.aspx",
    "content": [
        {
            "p": "The School of Chemistry is committed to providing a truly international education, inspiring our students, producing world-leading research and benefiting the local and global communities. The School endeavours to create an environment which is not only free from discrimination, but celebrates and values diversity. This both reflects and is fundamental to achieving our goals. We are committed to ensuring that each person, regardless of heritage or personal circumstances, will have the opportunity to give their best and be appropriately recognised and rewarded for their contributions. The Equality and Diversity Committee is responsible for the development and implementation of policies/activities to help provide a working and studying environment that all colleagues value and appreciate. We aim to deliver and maintain a well-balanced diversity of gender and ethnicity across all job families in the School of Chemistry. The Anne McLaren Fellowships are aimed at outstanding female scholars in science, technology, engineering and/or medicine at the early stage of their academic careers. The Fellowships enable female researchers in STEM subjects – often under-represented in these areas - to establish independent research careers. https://www.nottingham.ac.uk/research/researchwithus/fellowships/internally-funded.aspx We are very proud to have achieved an Athena SWAN Silver Award (awarded May 2017) in recognition of our efforts. Athena SWAN (https://www.advance-he.ac.uk/equality-charters/athena-swan-charter) recognises and celebrates good employment practice for women working in arts, humanities, social sciences, business and law. The EDC and the School of Chemistry work closely with the university-wide Women in Science Engineering and Technology (WinSET) group, which has been established since 2005. Professor Katharine Reid, Professor of Chemical Physics, is Vice-Chair of the University's WinSET group and Chair of WinSET International sub-group. For all enquiries please visit: www.nottingham.ac.uk/enquire"
        }
    ],
    "pdf_files": []
}