{
    "url": "https://www.nottingham.ac.uk/chemistry/people/jonathan.hirst",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR Manipulating adsorbed hydrogen on lanthanum-modified CuOₓ: Industrial-current-density CO₂ electroreduction to C₂₊ products or CH₄ (2024) Journal Article Guo, Z., Zhu, H., Yan, Z., Lei, L., Wang, D., Xi, Z., Lian, Y., Yu, J., Fow, K. L., Do, H., Hirst, J. D., Wu, T., & Xu, M. (2025). Manipulating adsorbed hydrogen on lanthanum-modified CuOₓ: Industrial-current-density CO₂ electroreduction to C₂₊ products or CH₄. Applied Catalysis B: Environmental, 364, https://doi.org/10.1016/j.apcatb.2024.124839 The selective electrochemical CO2 reduction reaction (CO2RR) yields valuable C2+ and C1 products, yet the influence of adsorbed hydrogen (*H) on product distribution remains inadequately understood. This study explores this effect by developing bimet... Read More about Manipulating adsorbed hydrogen on lanthanum-modified CuOₓ: Industrial-current-density CO₂ electroreduction to C₂₊ products or CH₄. Quantum Chemical Characterization of Rotamerism in Thio-Michael Additions for Targeted Covalent Inhibitors (2024) Journal Article Chaudhuri, S., M. Rogers, D., J. Hayes, C., Inzani, K., & D. Hirst, J. (2024). Quantum Chemical Characterization of Rotamerism in Thio-Michael Additions for Targeted Covalent Inhibitors. Journal of Chemical Information and Modeling, 64(19), 7687-7697. https://doi.org/10.1021/acs.jcim.4c01379 Myotonic dystrophy type I (DM1) is the most common form of adult muscular dystrophy and is a severe condition with no treatment currently available. Recently, small-molecule ligands have been developed as targeted covalent inhibitors that have some s... Read More about Quantum Chemical Characterization of Rotamerism in Thio-Michael Additions for Targeted Covalent Inhibitors. Theoretical Study on the Biosynthesis of the Mandapamates: Mechanistic Insights Using Density Functional Theory (2024) Journal Article Wang, D., Pattenden, G., Fow, K. L., Stocks, M. J., Hirst, J. D., & Tang, B. (2024). Theoretical Study on the Biosynthesis of the Mandapamates: Mechanistic Insights Using Density Functional Theory. Journal of Organic Chemistry, 89(18), 12946-12956. https://doi.org/10.1021/acs.joc.4c00859 Density functional theory (B3LYP-D3(BJ) and ωB97XD) calculations have been used to assess the stereochemical outcomes of the proposed transannular [4 + 2] cycloaddition pathway for the biosynthesis of mandapamate and isomandapamate from macrocyclic i... Read More about Theoretical Study on the Biosynthesis of the Mandapamates: Mechanistic Insights Using Density Functional Theory. An Improved Diabatization Scheme for Computing the Electronic Circular Dichroism of Proteins (2024) Journal Article Rogers, D. M., Do, H., & Hirst, J. D. (2024). An Improved Diabatization Scheme for Computing the Electronic Circular Dichroism of Proteins. Journal of Physical Chemistry B, 128(30), 7350-7361. https://doi.org/10.1021/acs.jpcb.4c02582 We advance the quality of first-principles calculations of protein electronic circular dichroism (CD) through an amelioration of a key deficiency of a previous procedure that involved diabatization of electronic states on the amide chromophore (to ob... Read More about An Improved Diabatization Scheme for Computing the Electronic Circular Dichroism of Proteins. Artificial intelligence for small molecule anticancer drug discovery (2024) Journal Article Duo, L., Liu, Y., Ren, J., Tang, B., & Hirst, J. D. (2024). Artificial intelligence for small molecule anticancer drug discovery. Expert Opinion on Drug Discovery, 19(8), 933-948. https://doi.org/10.1080/17460441.2024.2367014 Introduction: The transition from conventional cytotoxic chemotherapy to targeted cancer therapy with small-molecule anticancer drugs has enhanced treatment outcomes. This approach, which now dominates cancer treatment, has several advantages. Despit... Read More about Artificial intelligence for small molecule anticancer drug discovery. Solvent flashcards: a visualisation tool for sustainable chemistry. (2024) Journal Article Heeley, J., Boobier, S., & Hirst, J. D. (2024). Solvent flashcards: a visualisation tool for sustainable chemistry. Journal of Cheminformatics, 16(1), Article 60. https://doi.org/10.1186/s13321-024-00854-9 Selecting greener solvents during experiment design is imperative for greener chemistry. While many solvent selection guides are currently used in the pharmaceutical industry, these are often paper-based guides which can make it difficult to identify... Read More about Solvent flashcards: a visualisation tool for sustainable chemistry.. Machine learning insights into predicting biogas separation in metal-organic frameworks (2024) Journal Article Cooley, I., Boobier, S., Hirst, J. D., & Besley, E. (2024). Machine learning insights into predicting biogas separation in metal-organic frameworks. Communications Chemistry, 7(1), Article 102. https://doi.org/10.1038/s42004-024-01166-7 Breakthroughs in efficient use of biogas fuel depend on successful separation of carbon dioxide/methane streams and identification of appropriate separation materials. In this work, machine learning models are trained to predict biogas separation pro... Read More about Machine learning insights into predicting biogas separation in metal-organic frameworks. Discovery of novel SOS1 inhibitors using machine learning (2024) Journal Article Duo, L., Chen, Y., Liu, Q., Ma, Z., Farjudian, A., Yong Ho, W., Shin Low, S., Ren, J., Hirst, J. D., Xie, H., & Tang, B. (2024). Discovery of novel SOS1 inhibitors using machine learning. RSC Medicinal Chemistry, 15(4), 1392-1403. https://doi.org/10.1039/D4MD00063C Overactivation of the rat sarcoma virus (RAS) signaling is responsible for 30% of all human malignancies. Son of sevenless 1 (SOS1), a crucial node in the RAS signaling pathway, could modulate RAS activation, offering a promising therapeutic strategy... Read More about Discovery of novel SOS1 inhibitors using machine learning. Applications of Quantum Chemistry in Biomimetic Syntheses of Polycyclic Furanocembrane Derivatives (2024) Journal Article Wang, D., Zhou, T., Ren, J., Hirst, J., Gao, Z., & Tang, B. (2024). Applications of Quantum Chemistry in Biomimetic Syntheses of Polycyclic Furanocembrane Derivatives. SYNLETT, https://doi.org/10.1055/a-2239-6577 This paper summarizes the guidance provided by quantum chemical calculations to the biomimetic syntheses of polycyclic marine furanocembrane derivatives. Polycyclic furanocembrane derivatives are a group of structurally complex and biologically impor... Read More about Applications of Quantum Chemistry in Biomimetic Syntheses of Polycyclic Furanocembrane Derivatives. Optimizing Excipient Properties to Prevent Aggregation in Biopharmaceutical Formulations (2023) Journal Article King, T. E., Humphrey, J. R., Laughton, C. A., Thomas, N. R., & Hirst, J. D. (2024). Optimizing Excipient Properties to Prevent Aggregation in Biopharmaceutical Formulations. Journal of Chemical Information and Modeling, 64(1), 265–275. https://doi.org/10.1021/acs.jcim.3c01898 Excipients are included within protein biotherapeutic solution formulations to improve colloidal and conformational stability but are generally not designed for the specific purpose of preventing aggregation and improving cryoprotection in solution.... Read More about Optimizing Excipient Properties to Prevent Aggregation in Biopharmaceutical Formulations. Electrocatalytic CO2 reduction to C2H4: From lab to fab (2023) Journal Article Guo, Z., Yang, F., Li, X., Zhu, H., Do, H., Loon Fow, K., Hirst, J. D., Wu, T., Ye, Q., Peng, Y., Bin Wu, H., Wu, A., & Xu, M. (2024). Electrocatalytic CO2 reduction to C2H4: From lab to fab. Journal of Energy Chemistry, 90, 540-564. https://doi.org/10.1016/j.jechem.2023.11.019 The global concerns of energy crisis and climate change, primarily caused by carbon dioxide (CO2), are of utmost importance. Recently, the electrocatalytic CO2 reduction reaction (CO2RR) to high value-added multi-carbon (C2+) products driven by renew... Read More about Electrocatalytic CO2 reduction to C2H4: From lab to fab. Theoretical analysis of divalent cation effects on aptamer recognition of neurotransmitter targets (2023) Journal Article Douaki, A., Stuber, A., Hengsteler, J., Momotenko, D., Rogers, D. M., Rocchia, W., Hirst, J. D., Nakatsuka, N., & Garoli, D. (2023). Theoretical analysis of divalent cation effects on aptamer recognition of neurotransmitter targets. Chemical Communications, 59(99), 14713-14716. https://doi.org/10.1039/d3cc04334g Aptamer-based sensing of small molecules such as dopamine and serotonin in the brain, requires characterization of the specific aptamer sequences in solutions mimicking the in vivo environment with physiological ionic concentrations. In particular, d... Read More about Theoretical analysis of divalent cation effects on aptamer recognition of neurotransmitter targets. Synergistic engineering of heteronuclear Ni-Ag dual-atom catalysts for high-efficiency CO2 electroreduction with nearly 100% CO selectivity (2023) Journal Article Guo, Z., Zhu, H., Yang, G., Wu, A., Chen, Q., Yan, Z., Loon Fow, K., Do, H., Hirst, J. D., Wu, T., & Xu, M. (2023). Synergistic engineering of heteronuclear Ni-Ag dual-atom catalysts for high-efficiency CO2 electroreduction with nearly 100% CO selectivity. Chemical Engineering Journal, 476, Article 146556. https://doi.org/10.1016/j.cej.2023.146556 Single-atom catalysts (SACs) have emerged as attractive materials for the electrocatalytic carbon dioxide reduction (ECO2R). Dual-atom catalysts (DACs), an extension of SACs, exhibit more compelling functionalities due to the synergistic effects betw... Read More about Synergistic engineering of heteronuclear Ni-Ag dual-atom catalysts for high-efficiency CO2 electroreduction with nearly 100% CO selectivity. ML meets MLn: machine learning in ligand promoted homogeneous catalysis (2023) Journal Article Hirst, J. D., Boobier, S., Coughlan, J., Streets, J., Jacob, P. L., Pugh, O., Özcan, E., & Woodward, S. (2023). ML meets MLn: machine learning in ligand promoted homogeneous catalysis. Artificial Intelligence Chemistry, 1(2), Article 100006. https://doi.org/10.1016/j.aichem.2023.100006 The benefits of using machine learning approaches in the design, optimisation and understanding of homogeneous catalytic processes are being increasingly realised. We focus on the understanding and implementation of key concepts, which serve as condu... Read More about ML meets MLn: machine learning in ligand promoted homogeneous catalysis. Nicholas A. Besley (1972–2021) (2023) Journal Article Hirst, J. D., Teale, A. M., Stace, A. J., & Knowles, P. J. (2023). Nicholas A. Besley (1972–2021). Molecular Physics, 121(7-8), Article e221867. https://doi.org/10.1080/00268976.2023.2218676 Predicting bioactivity of antibiotic metabolites by molecular docking and dynamics (2023) Journal Article Chio, H., Guest, E. E., Hobman, J. L., Dottorini, T., Hirst, J. D., & Stekel, D. J. (2023). Predicting bioactivity of antibiotic metabolites by molecular docking and dynamics. Journal of Molecular Graphics and Modelling, 123, Article 108508. https://doi.org/10.1016/j.jmgm.2023.108508 Antibiotics enter the environment through waste streams, where they can exert selective pressure for antimicrobial resistance in bacteria. However, many antibiotics are excreted as partly metabolized forms, or can be subject to partial breakdown in w... Read More about Predicting bioactivity of antibiotic metabolites by molecular docking and dynamics. AI4Green: An Open-Source ELN for Green and Sustainable Chemistry (2023) Journal Article Boobier, S., Davies, J. C., Derbenev, I. N., Handley, C. M., & Hirst, J. D. (2023). AI4Green: An Open-Source ELN for Green and Sustainable Chemistry. Journal of Chemical Information and Modeling, 63(10), 2895–2901. https://doi.org/10.1021/acs.jcim.3c00306 An Electronic Laboratory Notebook (ELN) combining features, including data archival, collaboration tools, and green and sustainability metrics for organic chemistry, is presented. AI4Green is a web-based application, available as open-source code and... Read More about AI4Green: An Open-Source ELN for Green and Sustainable Chemistry. Dynamic Disorder Drives Exciton Dynamics in Diketopyrrolopyrrole-Thiophene-Containing Molecular Crystals (2023) Journal Article Jiang, L., Hirst, J. D., & Do, H. (2023). Dynamic Disorder Drives Exciton Dynamics in Diketopyrrolopyrrole-Thiophene-Containing Molecular Crystals. Journal of Physical Chemistry C, 127(11), 5519-5532. https://doi.org/10.1021/acs.jpcc.2c07984 There is a growing interest in controllable molecular materials for potential nanophotonic and quantum information applications where excitons move beyond the incoherent transport regime. Thus, the ability to identify the key parameters that correlat... Read More about Dynamic Disorder Drives Exciton Dynamics in Diketopyrrolopyrrole-Thiophene-Containing Molecular Crystals. Krein support vector machine classification of antimicrobial peptides (2023) Journal Article Redshaw, J., Ting, D. S., Brown, A., Hirst, J. D., & Gärtner, T. (2023). Krein support vector machine classification of antimicrobial peptides. Digital Discovery, 2(2), 502-511. https://doi.org/10.1039/d3dd00004d Antimicrobial peptides (AMPs) represent a potential solution to the growing problem of antimicrobial resistance, yet their identification through wet-lab experiments is a costly and time-consuming process. Accurate computational predictions would all... Read More about Krein support vector machine classification of antimicrobial peptides. Cysteine-Selective Modification of Peptides and Proteins via Desulfurative C−C Bond Formation (2023) Journal Article Griffiths, R. C., Smith, F. R., Li, D., Wyatt, J., Rogers, D. M., Long, J. E., Cusin, L. M. L., Tighe, P. J., Layfield, R., Hirst, J. D., Muller, M. M., & Mitchell, N. (2023). Cysteine-Selective Modification of Peptides and Proteins via Desulfurative C−C Bond Formation. Chemistry - A European Journal, 29(16), Article e202202503. https://doi.org/10.1002/chem.202202503 The site-selective modification of peptides and proteins facilitates the preparation of targeted therapeutic agents and tools to interrogate biochemical pathways. Among the numerous bioconjugation techniques developed to install groups of interest, t... Read More about Cysteine-Selective Modification of Peptides and Proteins via Desulfurative C−C Bond Formation. Showing 1 - 20 of 72 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}