{
    "url": "https://www.nottingham.ac.uk/clas/about/news-and-events/news/maxwell-ayamba-and-louis-cotgrave-receive-the-vice-chancellors-medal.aspx",
    "content": [
        {
            "p": "We are delighted to announce that two of our PhD students received the Vice-Chancellor's Medal on 8 December 2022! Both Maxwell Ayamba (PhD in Black Studies/ACS) and Louis Cotgrove (PhD in German) received the Medal for their exceptional achievement in their fields. Louis unfortunately fell ill this week, but his parents were able to collect the award on his behalf. Maxwell Ayamba Maxwell is a PhD student in Black Studies, studying the spatiality of the Peak District National Park, in relation to access and use by people of Black African ancestry in the diaspora. His work builds on the Government's 25 Year Environment Plan and the Julian Glover Review attempt to promote access to the countryside for everyone, especially Black and Minority Ethnic Communities. It’s also based on his own interests and convictions: in 2004 Maxwell co-founded the 100 Black Men Walk for Health Group, and he was the first Black person appointed on the board of Ramblers Association UK in 2006. Maxwell regularly participates in public and policy discussions about black access to the countryside. Amongst much other advocacy work, Maxwell gave a speech in March 2022 at the Natural England Parliamentary Reception. Maxwell’s advocacy and expertise on black access to nature in England is making a difference at national level. Louis Cotgrove Louis graduated last summer with a PhD in German. His thesis examines how German young people use language online. In order to undertake his research, Louis designed and built a searchable repository - the Nottingham Corpus of German YouTube language - consisting of 33 million words drawn from 3 million YouTube comments posted underneath videos uploaded by German‐language YouTube channels from 2008‐2018. Louis’ corpus was the first of its kind and has been recognized by the German Institute for German Language, which added his work to its public references. For any non-German linguist to achieve this would be impressive, but for a PhD student starting from scratch, it is an outstanding achievement."
        }
    ],
    "pdf_files": []
}