{
    "url": "https://www.nottingham.ac.uk/clas/about/news-and-events/news/brian-lee-obituary.aspx",
    "content": [
        {
            "p": "It is with great sadness that we announce the death on 11 December 2019 of Professor Brian Lee, founder and first Head of the Department of American Studies (as it was then named) at Nottingham. Born on 27 July 1932 in Bispham near Blackpool, he studied English at Bristol University after two years National Service in 1951-52 in the army education corps in Egypt. He then went on to do postgraduate research on Henry James. Later in his career he would accordingly publish The Novels of Henry James: A Study of Culture and Consciousness (London: Edward Arnold, 1978) and edit James’s novel Washington Square for Penguin Books (1980). His other published works would include Hollywood(Brighton: BAAS, 1986), American Fiction: 1765-1940(London: Longman 1987) and The Thirties: Politics and Culture in a Time of Broken Dreams, ed. by Heinz Ickstadt, Rob Kroes, Brian Lee (Amsterdam: Free University Press, 1987). Brian became a Lecturer in the English department at Nottingham in 1959 and, over a long career (he retired in 1993), developed American Studies within the University, from modules within the English department to the creation of Joint and Single Honours degree courses in the late 1960s. This eventually led to the formation of an independent department which grew to become one of the largest in the country. This was a hard-won struggle in the face of more conservative interests, but Brian doggedly pushed on, aided by the resounding popularity of the subject with students. These were exciting times, in that developing the department went hand in hand with developing the subject itself. Reflecting the background and training of most of the staff, American Studies began with the twin pillars of Literature and History, but one of Brian’s virtues was an intellectual openness and enthusiasm for interdisciplinary ventures which eventually became central to the subject at Nottingham. In particular he was always open to popular culture and personally developed courses on Film Studies within the Department which were to prove the beginnings for what would become the Institute of Film and Television Studies, now incorporated in the Department of Culture, Media and Visual Studies. He also looked outward to the community in his role as Director of Nottingham Film Theatre (now Broadway Cinema). Brian became too a leading figure in an innovative Erasmus network, organizing conferences and teaching exchanges with other leading European universities: an intellectual and pedagogic collaboration of real value. With hindsight it is easy now to see the American Studies course as it was originally taught as – with the exception of Jennifer Bailey – relatively exclusionary in terms of gender, though not (with the work of Richard King, Peter Ling and Dave Murray) of race. It was also, at core, canonical. But it is worth recalling that what was canonical in the US was, in an English context, far from that. The subject, as a result, seemed accessible, popular and often transgressive, and students loved it. One of Brian’s greatest achievements was his strong commitment to teaching as a primary responsibility of the department and the creation of an environment where everyone felt enabled and encouraged to develop their own interests – a genuine community without any sense of hierarchy, which both staff and students shared. Shortly before he retired, the Department registered the highest grade in what was then the national Research Assessment Exercise. This was achieved not through a regime of performance management of staff but by creating the best kind of atmosphere for teaching and research. In line with this, he himself was known as a first-class supervisor for postgraduate students, an encouraging and supportive presence. Brian liked socializing and sport in equal measure. He was captain of Mr. Lee’s Sunday Academicals, a mainly staff-based football team known more for their enthusiasm and the quality of their wit than for any real talent. And, in the summer afternoons of those rather less-pressurized years, he and other department members could often be found exercising their limited talents on the tennis court while the then-Department secretary, Gwen Thiman, covered for them. The Department was then of course a very different place with much smaller year groups and tutorials of just four or five people, many (Brian included) chain-smoking and drinking coffee as they conducted their discussions. In short, Brian will be warmly remembered by generations of undergraduate and postgraduate students who enjoyed both his teaching and his company and by those colleagues who were lucky enough to have worked beside him."
        }
    ],
    "pdf_files": []
}