{
    "url": "https://www.nottingham.ac.uk/clas/people/andrew.goffey",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR Hypnosis between Science and Magic (2024) Book Stengers, I. (2024). A. Goffey (Ed.), Hypnosis between Science and Magic. Bloomsbury Publishing What if judgment returned to the craft of magic? How would that relieve the burdens of critique and realign its priorities? These questions regarding the value of magic to thinking are at the very heart of the acclaimed philosopher of science Isabell... Read More about Hypnosis between Science and Magic. Machinic Highs and Pathic Patchworks of Addicted Systems (2024) Book Chapter Goffey, A., & Fuller, M. (2024). Machinic Highs and Pathic Patchworks of Addicted Systems. In M. Sehgal, & A. Wilkie (Eds.), More-Than-Human Aesthetics: Venturing Beyond the Bifurcation of Nature (153-171). Bristol University Press. https://doi.org/10.51952/9781529227819.ch010 Adopting, as its starting point for the engagement with more-than-human aesthetics, a discussion of the concept of the machinic ‘high’ to be found in the work of Félix Guattari, this chapter proposes an ‘ethico-aesthetic’ engagement with networked di... Read More about Machinic Highs and Pathic Patchworks of Addicted Systems. Automation Anxieties and Infrastructural Technologies (2019) Journal Article Goffey, A. (2019). Automation Anxieties and Infrastructural Technologies. New Formations: A Journal of Culture, Theory, Politics, 2019(98), 29-47. https://doi.org/10.3898/NEWF%3A98.03.2019 Contesting binaries that tend to underlie claims about automation, this article seeks to complicate arguments that are made about digital technology and the processes and practices of automation essential to it. In particular, it contests a well-entr... Read More about Automation Anxieties and Infrastructural Technologies. Guattari, transdisciplinarity, and the experimental transformation of research (2019) Book Chapter Goffey, A. (2019). Guattari, transdisciplinarity, and the experimental transformation of research. In G. Collett (Ed.), Deleuze, Guattari, and the problem of transdisciplinarity (35 - 46). Bloomsbury Academic Powers of Time: Versions of Bergson (2018) Book Lapoujade, D., & Goffey, A. (2018). Powers of Time: Versions of Bergson. University of Minnesota Press In Powers of Time, David Lapoujade returns to two central themes that continuously converge throughout the writings of the French philosopher Henri Bergson: durée (duration) and intuition. Lapoujade uncovers multiple versions of Bergson, guiding us t... Read More about Powers of Time: Versions of Bergson. Schizoanalysis and Ecosophy: Scales of History and Action (2017) Book Chapter Querrien, A., & Goffey, A. (2017). Schizoanalysis and Ecosophy: Scales of History and Action. In . C. V. Boundas (Ed.), Schizoanalysis and Ecosophy: Reading Deleuze and Guattari (87-108). Bloomsbury Publishing. https://doi.org/10.5040/9781350052215.0011 Machinic Operations. Data structuring, healthcare and governmentality (2016) Book Chapter Goffey, A. (2016). Machinic Operations. Data structuring, healthcare and governmentality. In P. Harvey, C. Bruun Jensen, & A. Morita (Eds.), Infrastructures and Social Complexity: A Companion. Routledge. https://doi.org/10.4324/9781315622880-45 The National Programme for IT, or NPfIT for short, was a ﬂagship IT project of the ﬁrst Labour administration initiated by Tony Blair in 2002. Headed by Richard Grainger and costing an alleged £18.7bn, it was widely billed as the ‘biggest IT project... Read More about Machinic Operations. Data structuring, healthcare and governmentality. Guattari and transversality: Institutions, analysis and experimentation (2016) Journal Article GOFFEY, A. (2016). Guattari and transversality: Institutions, analysis and experimentation. Radical Philosophy, 195, 38-47 Towards a rhizomatic technical history of control (2015) Journal Article Goffey, A. (2015). Towards a rhizomatic technical history of control. New Formations: A Journal of Culture, Theory, Politics, 58-73. https://doi.org/10.3898/NewF%3A84/85.03.2015 Gilles Deleuze's Postscript on Control Societies lends itself readily - too readily, perhaps - to historical interpretations of control that accept the universalising claims of techno-science. Critical social and cultural theory tacitly confirms the... Read More about Towards a rhizomatic technical history of control. Homo immunologicus: on the limits of critique (2015) Journal Article Goffey, A. (2015). Homo immunologicus: on the limits of critique. Medical Humanities, 41(1), 8-13. https://doi.org/10.1136/medhum-2014-010661 Through a discussion of a range of research drawn from the humanities and social sciences, and with a particular emphasis on work that tackles questions about the discourse of the life sciences, this paper considers some of the difficulties with rese... Read More about Homo immunologicus: on the limits of critique. Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}