{
    "url": "https://www.nottingham.ac.uk/clas/departments/culturalmediaandvisualstudies/subject-areas/film-and-television/film-and-television.aspx",
    "content": [
        {
            "p": "The film, television and screen industries are central to global culture. They entertain, inform, promote ideology and help us communicate and connect. We're experts in how these industries have developed, how they operate now and what the future trends are. We're also concerned about how people are affected by these industries - both as consumers and how people making the products are treated. Our staff work closely with industry so their research is based in current practice and this knowledge feeds into their teaching. Combine with another subject: Designed for talented UK students whose personal circumstances make achieving our usual entry requirements difficult. Watch our academics explain their modules Explore opportunities to get practical experience, study abroad and share your subject passions with fellow students. I’ve got a better understanding of the industry now – where it’s been, where it is, and where it might be in the future. Melania Burlacu, Film and Television BA graduate Find out more about the highlights of Melania's degree Our research produces ground-breaking work that supports the understanding, analysis and growth of these exciting and ever-changing creative sectors. We work closely with industry partners across all formats and around the globe to engage and innovate with real-life scenarios and projects. Find out more about our research themes, projects and people In the latest Research Excellence Framework assessment: The department is home to the Institute for Screen Industries Research - the first ideas incubator and innovation generator for the film and TV industry based at a leading UK university. We've vast experience of industry partnerships and well developed contacts with leading practitioners and executives. Gianluca Sergi Associate Professor of Film Studies"
        }
    ],
    "pdf_files": []
}