{
    "url": "https://www.nottingham.ac.uk/cmc/introduction-to-cmc/where-to-find-us.aspx",
    "content": [
        {
            "p": "As the campus is being redeveloped, please take care when entering and leaving campus, following the pedestrian walkways. Nottingham Train Station offers rail connections to a wide range of regional and national destinations including: London St Pancras, Leicester, Derby, Sheffield, Birmingham, Manchester, Liverpool, Peterborough, Norwich and Cardiff. Visit the National Rail website for more information Castle Meadow Campus (CMC) is only a five or ten minute walk from Nottingham Station. Nottingham Station is also the closest tram stop to CMC. The tram connects the campus with destinations to the north (Bulwell and Hucknall), east (University Park, Beeston and Toton), and south (Wilford and Clifton). Visit here for more information. Nottingham City Council are investing in cycling infrastructure around the city, installing new bike lanes to improve safety for Nottingham’s cyclists. CMC benefits from being located just off the Western Cycle Corridor - a high quality segregated cycle route from Nottingham City Centre along Castle Boulevard and Abbey Street, connecting to the Queen's Medical Centre hospital and University Park. The Nottingham Canal towpath provides an alternative off-road route towards University Park, and to the east the towpath can be used to access Nottingham Station. It then continues south towards Trent Bridge and West Bridgford. There is secure cycle storage at CMC. If you would like to use this, please visit reception to 'sign in' as a guest and ask for a member of the team to unlock the cycle store for you. Bike hire operator Lime has launched an electric bike (e-bike) rental scheme in Nottingham, in partnership with Nottingham City Council. Users can pick up and return Lime e-bikes from a network of designated e-bike-hire bays across the city. You can hire e-bikes through the Lime app which is available on the Apple app store or the Google Play store. Cycle map Cycle journey planner Within a 5 minute walk there are numerous bus services connecting Castle Meadow Campus with destinations to the south and west of Nottingham: If you need to travel between CMC and University Park or Jubilee campus then you can catch NCT’s 34 service from Canal Street – this stops outside Jubilee Campus’ southern entrance and then continues onto University Park. See Trent Barton and Nottingham City Transport web pages for more information on local bus services. Broad Marsh bus station is served by National Express coaches, offering long distance coach services to UK airports and cities including London, Birmingham, and Manchester. Nottingham is also served by Megabus and Flixbus coach services, which use the Greyfriars Gate bus stops in the city centre. Nottingham City Council offer plenty of spaces at multi-storey and other car parks, along with on-street parking and cashless zones around the city centre. Or avoid the city centre traffic, by parking at one of Nottingham’s Park & Ride sites and catching the bus or tram to the city centre. Find out more."
        }
    ],
    "pdf_files": []
}