{
    "url": "https://www.nottingham.ac.uk/cmc/about/equality-diversity-and-inclusion.aspx",
    "content": [
        {
            "p": "Castle Meadow Campus is being designed with inclusivity at its core. This involves not just the infrastructure of our estate, but also the educational offer and workplace culture. From an inclusive curriculum, to a diverse workforce and a welcoming and accessible environment we want our staff, students, partners and members of the local community to feel they truly belong. Working in collaboration with AccessAble, our architects Bond Bryan and the research expertise of our own academics, we are crafting a campus that meets the needs of our people. This will include accessible travel route guidance, quiet spaces for neurodivergent staff and students, gender neutral toilets, space to observe faith and belief and welcoming parenting areas. To ensure that our partnerships on Castle Meadow Campus reflect the values of the University of Nottingham, we are uniquely building the offer of expertise in inclusive design into our tenancy agreements. As part of the Universities for Nottingham partnership, University of Nottingham is leading work to diversify the workforce across the region. This includes a commitment from large employers to introduce a lead for EDI/culture at a senior level and Nottingham Trent University and the NHS have so far appointed these roles. The partners are now working collectively, led by University of Nottingham, to share inclusive recruitment practices and develop secondment, work experience and development opportunities for staff with protected characteristics across the organisations. One of our academics, Professor Louise Mullany, who helped develop University of Nottingham’s inclusive recruitment practices is working with Castle Meadow Campus based law firm, Browne Jacobson, to advise them on making their workforce and culture more inclusive. In addition, Nottingham University Business School is leading inclusive entrepreneurship across the region through the recent launch of the charter for inclusive entrepreneurship. University of Nottingham led the signing of the charter and Castle Meadow Campus will provide a home from which this initiative can be promoted across the region and UK."
        }
    ],
    "pdf_files": []
}