{
    "url": "https://www.nottingham.ac.uk/cmc/about/community-commitment.aspx",
    "content": [
        {
            "p": "We understand that maintaining our natural surroundings is important to our community. That's why we have recently completed some necessary tree removal works along the canal and Tinkers Leen. These works were essential to ensure that our campus remains a safe and sustainable environment, without any knock-on effects on other buildings and spaces. As a university, we are committed to sustainability, and ensuring that our campus is a desirable place for all visitors. We are working closely with the local authority to ensure we are meeting their requirements and the needs and expectations of our neighbours and visitors. At Castle Meadow Campus, we are aware that some members of our local community may have concerns about the potential impact of our new campus on noise levels and traffic disruption. We know the importance of being a responsible neighbour, and we want to assure you that we are taking every necessary step to minimise any possible disruption that may occur during the phased construction process. Here are some other steps we are putting in place to support you, should you have any queries: Community Engagement Team We have a dedicated Community Engagement Team who will serve as a point of contact for any community-related issues or concerns. If you have any questions or would like to report any issues, please send us an email. Email Community Engagement Team More information Construction Practices We understand that construction can be disruptive, and we are committed to minimising any potential negative impact on our neighbours. We will be taking steps to reduce noise and traffic disruption during our phased construction process. These steps include scheduling very noisy construction activities during specific hours, implementing traffic management plans, and ensuring that our contractors adhere to our responsible construction guidelines. Communication We are committed to keeping the community informed about our progress and any potential issues that may arise during the construction and operation of the new campus and will ensure that our latest news pages are always up to date with the latest information. If you have any questions or concerns, please do not hesitate to get in touch with us by email. Email Us"
        }
    ],
    "pdf_files": []
}