{
    "url": "https://www.nottingham.ac.uk/cmc/introduction-to-cmc/history-of-cmc.aspx",
    "content": [
        {
            "p": "A distinctive series of buildings designed by Sir Michael Hopkins CBE, of Hopkins Architects, with engineering by Arup Group. This landmark site was first completed in 1994 and occupied by HM Revenue and Customs, until its sale to the University of Nottingham in 2021. Castle Meadow Campus encompasses seven buildings and 32,500 square metres of space. It is built on a former railway goods yard off the A453 and Castle Meadow Road, next to the Nottingham Canal. Renovation work has already begun, with the University of Nottingham officially opening the Central Building in summer 2025. This move will capitalise on the city centre location to develop new opportunities for teaching, research, and partnership activity, enabling the university to grow its student offer and increase collaboration with strategic partners. The university also envisages opening the campus up as a creative and community orientated space for events, installations, demonstrations, and digital showcasing – including immersive technology, artificial intelligence (AI), robotics and digital 3D mapping tools. In addition, it hopes to be able to offer digital skills education for local professionals and young people as well as regional networking opportunities for small and medium sized businesses. Photography by Martine Hamilton Knight, BuiltVision © 2023 The exceptional quality of the architectural design and interior spaces has led to the buildings being listed at Grade II by Historic England, in 2023. Reflecting their importance and for the degree of survival – this also demonstrates the sustainability of the original design and its flexibility. Castle Meadow Campus contains an interesting mix of old and new idioms, demonstrating a new tempered modernism in the early-1990s. In April 1993 the scheme was awarded maximum points in a BREEAM (Building Research Establishment Environmental Assessment Method) environmental assessment, the first building to achieve this score. This assessment method had been established by the Department of the Environment in 1990 and was the first system anywhere for independently assessing the environmental impact of a building. The design of Castle Meadow Campus was ahead of its time, employing a unique natural ventilation*. The building design throughout the site employs the thermal mass of the concrete to cool the buildings at night. The main Central Building provides a focal point for the site, with a fabric roof suspended from four raking steel masts. * 'Natural' or 'passive' ventilation is the process of supplying air to, and removing air from, an indoor space without using mechanical systems. It refers to the flow of external air to an indoor space as a result of pressure differences arising from natural forces. Since 2011, law firm Browne Jacobson has situated its Nottingham office at Castle Meadow Campus and will continue to do business from here. The King's Trust (formerly Prince's Trust) have started to deliver programmes for local young people in 2024, as we build the community of business tenants and other organisations. The campus will enhance and build new links with local communities, charities, schools and colleges. More partners will be locating their businesses on campus as we continue our journey towards aligning our academic, research, business and community endeavors. Together with our partners, we’ll build long-term partnerships to tackle local challenges, innovate, upskill society and provide students with amazing opportunities for knowledge exchange, placements, training opportunities and a dynamic and digital environment of collaboration and problem solving. If you're interested in joining our community on campus - please get in touch with UNIP."
        }
    ],
    "pdf_files": []
}