{
    "url": "https://www.nottingham.ac.uk/cmc/about/faqs.aspx",
    "content": [
        {
            "p": "Formerly occupied by HMRC, Castle Meadow is on the south side of the city centre, close to the train station, the iconic Nottingham Castle, and a short walk from Lenton. The site was originally designed by award-winning architect Sir Michael Hopkins. It extends to 3.75 hectares, housing accommodation of approximately 32,500m square comprised of seven buildings. This is a substantial programme of activity and will be overseen by a group chaired by Deputy Vice-Chancellor Professor Jane Norman. This group will ensure that Castle Meadow enables us to better deliver on the aims and objectives of our University strategy. There is a programme of engagement and consultation with staff and students that will be taking place throughout the duration of the programme The University Strategy places a special emphasis on environmental sustainability and supporting the city’s ambitions to be net zero carbon by 2028. Making use of existing buildings rather than creating new buildings is a significantly more sustainable solution to support the university’s expansion plans. The Castle Meadow development was ahead of its time when it was constructed in the early 1990s as it integrated a wide range of sustainable measures that were innovative for the period. Reusing these buildings, even after adaptation, means that the CO2 expended will be a fraction of that from a new build and significantly below the targets now set by the Royal Institute of British Architects. The Castle Meadow site itself is an attractive green space, with easy access to the train station and the cycle paths of the Nottingham Canal, offering sustainable, accessible and safe transport routes for staff, students and visitors. The infrastructure of the buildings at Castle Meadow are very good. The spaces within the buildings are very flexible, which will enable us to purpose them in whichever way we need to meet the needs of teaching, research and student and staff experience. The site has now been listed, Grade 2 status by Historic England and although this will have limited impact on the layouts and designs timescales are currently be looked into to ensure all required approvals are progressed. We have already had interest from some external companies about being housed on this campus, as well as current occupants Browne Jacobson LLP, which would generate significant annual rental income and open up exciting new opportunities in both teaching and research. However, though commercial opportunities will be explored where appropriate, the primary development of the campus will be around improving teaching and learning, research opportunities, working environments and the student experience. For Kings Meadow, the plans are dependent on solutions for relocating a number of important functions – storage, logistics, mailroom and data centre. All of this is being considered in the campus planning process. We are committed to bringing staff based at KMC to Jubilee Campus and University Park. Castle Meadow could be used to deliver the following activity, all of which would contribute to the government’s levelling up agenda: In addition to this, the Castle Meadow can also contribute to the 12 Levelling Up Missions set out within the recent White Paper. The Castle Meadow programme will be working closely with our faculties and professional service departments to ensure our new development supports the levelling up agenda where possible. This is a good idea and this will be looked into as part of the development of the landscaping as well as internal spaces within the various buildings. Postgraduate, Student Engagement Associates and students from the Department of Architecture and Built Environment are members of the Castle Meadow Campus Design Recommendations Group. The group has approximately 40 members that includes UoN Staff Network representatives, academic and professional services colleagues, and is Chaired by the Director of Student and Campus Life. The site when constructed some 25 years ago was an exemplar of Sustainability at its time and we will be building on it. Having the opportunity to repurpose an existing building rather than building new gives us an opportunity to reduce the embodied carbon of the development. Sustainability is an integral part of the site’s operating model and is a key principle in our approach to design, construction, and eventual operation of the campus. Recognising the broad nature of sustainability and our desire to take environment further than just the built environment we have in developed an output focused Sustainable Development framework, with the priority outputs being: These outcomes have been used to develop a framework. To ease communication the framework that deliver’s the outcomes has been split into 9 focus areas – with these focus areas influenced by the above outcomes. For further details please visit the Sustainability stand at the open day. The University has published, printed, and posted an information guide with invitation to the open day to the 1,100 homes and business most closely located tto the South of the campus in the meadows area. This is in addition to 9,000+ residents in other parts of the city. Through our existing Public Engagement and Community Engagement Teams there will be an ongoing effort to connect with local people, communities, and businesses to ensure the Campus has a positive impact in the locality. As we bring the campus to life, we are looking to significantly change the external environment by changing it from a car centric environment to a pedestrian friendly campus, with any parking pushed away from the core boulevard of the site. The mobility vision for the campus Castle Meadow Campus, through its design and function, will prioritise sustainable and climate conscious travel choices by providing a safe and welcoming environment for pedestrians and cyclists, which connects into Nottingham’s comprehensive public transport and active travel network. The inclusivity ambition for the campus means some essential car access will be retained, although car parking provision will be reduced to facilitate a pedestrian friendly environment which all users will benefit from. This moves us away from the use of car and that will be reflected in the fact that there will be very few car parking spaces, and users and visitors to the campus will be encouraged to use public and active travel (of which there are many options) to visit the site. Parking will be available for those with greatest need and accessible provision will be required. Of all the campuses the University operates, CMC benefits from the most comprehensive transport infrastructure. Located on the southern side of Nottingham City Centre, CMC is a 5minute walk from Nottingham’s Main Line Rail Station. The station is also served by the NET tram network, which offers direct tram services to the QMC and University Park, and trams northwards to Phoenix Park, Bulwell and Hucknall, and trams southwards to Wilford and Clifton. The closest bus stop to the site is on Castle Boulevard, a 300m walk from CMC, this stop is served by Skylink Nottingham which runs between the City Centre and East Midlands Airport via University Boulevard and Beeston. The Broad Marsh Area / Southside of Nottingham is undergoing dramatic transformation, with pedestrians and cyclists at the heart of NCC’s vision for the area, aligning with Nottingham’s ambition to be carbon-neutral by 2028. Within a 5minute walk of CMC there are several public car parks including the NCP Maid Marion Way (412 spaces), Broad Marsh Car Park (1,304 spaces) and Nottingham Railway Station Car Park (512 spaces). The Student Living Strategy project which is a partnership between Nottingham City Council, Nottingham Trent University and Nottingham City Council ensures that current and future student accommodation is carefully considered to meet the city's requirements. The CMC is well located to be served by the existing and developing students accommodation in the immediate local vicinity. Furthermore, the excellent transportation links via tram and bus allows students, staff and visitors to commute to the campus via public transport. Community Engagement Team: We have a dedicated Community Engagement Team who will serve as a point of contact for any community-related issues or concerns. If you have any questions or would like to report any issues, you can contact them at CommunityEngagement@Nottingham.ac.uk. For more information, please visit www.nottingham.ac.uk/yourcommunity Communication: We are committed to keeping the community informed about our progress and any potential issues that may arise during the construction and operation of the new campus. We are currently working on a new website but in the meantime, you can keep updated with any latest news by visiting: https://www.nottingham.ac.uk/about/castle-meadow/castle-meadow-campus.aspx. You can also get in touch with the team directly at: castlemeadowcampus@nottingham.ac.uk. Please don't hesitate to contact us if you have any questions or concerns."
        }
    ],
    "pdf_files": []
}