{
    "url": "https://www.nottingham.ac.uk/cmc/digital-nottingham/index.aspx",
    "content": [
        {
            "p": "Discover Digital Nottingham, a University of Nottingham initiative that connects academia, industry and the local community to foster an ecosystem of exploration and collaboration. Digital Nottingham will enable businesses, organisations and communities to collaborate on cutting-edge digital research and data practice. Castle Meadow Campus offers people of the city the opportunity to develop digital skills through collaboration with the Institute for Professional and Workplace Learning, and to co-produce with City as Lab, the university’s creative engine for digital innovation that puts local challenges at the heart of activities. Digital Nottingham will explore opportunities for business partnerships and industry with INFINITY, The Inclusive Financial Technology Hub, funded by Research England. The INFINITY Hub is a partnership between the Universities of Birmingham, Nottingham, and Warwick, located on Castle Meadow Campus. INFINITY will contribute to developing the next generation of financial technology start-up ventures and firms by creating a pathway for university-inspired research to give rise to early-stage commercialisation ventures in financial services. All of this, with the benefit of the University of Nottingham Innovation Park (UNIP), being home to pioneering start ups and small to medium enterprises. City as Lab offers a fresh approach to digital research, connecting researchers, communities and local partners in collaborative projects that tackle real-world challenges in the Nottingham city region. Using Nottingham as a dynamic living laboratory and working with communities, City as Lab brings people together to create and test new ideas, tools and technologies to address local challenges. INFINITY exists to catalyse the next generation of university-inspired financial technology start-up ventures. The Hub will create an agile pathway for commercialisation of fintech research, taking early-stage research-inspired commercial propositions on a journey to being realised as live commercial prospects."
        }
    ],
    "pdf_files": []
}