{
    "url": "https://www.nottingham.ac.uk/cmc/unip/index.aspx",
    "content": [
        {
            "p": "Where innovation thrives Welcome to the University of Nottingham Innovation Park (UNIP), a dynamic space located at the heart of the University of Nottingham's new Castle Meadow Campus. Building on UNIP’s success at the university’s Jubilee Campus we are passionate about fostering collaboration between businesses, researchers, students, and entrepreneurs in a vibrant and inspiring environment. At UNIP, we provide commercial co-location space for businesses that wish to collaborate with the university on research projects, utilise the talents of our students and graduates, or spin-out companies from the university itself. We strive to be the gateway for our occupiers to access valuable business support from the university. Castle Meadow Campus is a catalyst for economic growth in the city of Nottingham. By creating an innovation district that brings together companies, innovators, students, entrepreneurs, and the university's knowledge base, we aim to generate new opportunities, businesses, and jobs for the citizens of Nottingham. Access innovative research and specialist knowledge to develop new products and services and enhance your business performance Connect with talented students and graduates to bring fresh thinking to your business Unleash the talent of your people through our professional development programmes and courses Meet our people and like-minded companies through a programme of networking and events designed specifically for businesses At UNIP, we will not only manage the co-location space at Castle Meadow Campus but also serve as a gateway, directing businesses and facilitating interactions between the University of Nottingham and the business community. Since 2008, UNIP has successfully operated on Jubilee Campus, supporting a vibrant community of over 40 clients alongside the Ingenuity Lab and Nottingham Technology Ventures. Facilities at Castle Meadow include high-quality office spaces for our business partners, as well as meeting rooms and breakout spaces to facilitate collaboration and innovation. Castle Meadow Campus will offer occupiers lease and “easy-in-easy-out” licence options. We also provide a range of client services and facilities management activities, including reception services, meeting rooms, mail handling, cleaning, maintenance and repair of common areas, lift and access control management. In partnership with Research and Innovation (R&I), UNIP will foster a sense of community and promote business and innovation activities through networking events, workshops, engagement with local business organisations, hosting of accelerator and incubator programs, and marketing and PR initiatives to highlight the achievements and opportunities available at Castle Meadow. A leading full-service law firm committed to promoting greater equality, diversity, and inclusion in the legal sector and beyond. Their dedicated startup legal support program will add significant value to our Innovation Park. The Prince’s Trust at Castle Meadow Campus provides an East-Midlands base for the organisation to help improve the lives of local young people. To explore the exciting opportunities at University of Nottingham Innovation Park (UNIP) and arrange a campus tour, please get in touch with us today. Contact our reception team at unip@nottingham.ac.uk or call us on 0115 823 2294. We would be delighted to provide more information and show you the remarkable facilities and collaborative environment that UNIP offers."
        }
    ],
    "pdf_files": []
}