{
    "url": "https://www.nottingham.ac.uk/computerscience/news/new-academic-director-for-national-rehabilitation-centre.aspx",
    "content": [
        {
            "p": "Professor Praminda Caleb-Solly who specialises in person-centred machine learning and assistive robotics has been appointed as University of Nottingham Academic Lead for the NHS National Rehabilitation Centre (NRC). Praminda Caleb-Solly is Professor of Embodied Intelligence in the University of Nottingham’s School of Computer Science where she leads the Cyber-physical Health and Assistive Robotics Technologies (CHART) research group. This research focuses on investigating how socially and physically assistive robotics and sensor-based intelligent technology can assist people with disabilities and long-term conditions, as well as their carers, in providing support for activities of daily living. The £105 million NRC programme aims to transform the delivery of rehabilitation in England through the programme of work including building a 70-bed, state-of-the-art and highly energy efficient new facility, run by Nottingham University Hospitals NHS Trust and part of the Government’s New Hospital Programme. Research, innovation and training will be led by academic partners the University of Nottingham and Loughborough University. Combining patient care delivered by staff from Nottingham University Hospitals with research, innovation and training, the centre’s objective is to act as the National hub to transform how people recover and regain fitness and function following serious injury or illness, and to widen access to rehabilitation beds. Professor Caleb-Solly will also lead the development of national and international relationships, providing leadership to guide the vision of the project. Professor Caleb-Solly commented: “The NRC offers a wholly exceptional opportunity to spearhead the next generation of evidence-based, person-centred rehabilitation solutions. I am honoured to have the opportunity of being part of the NRC as it emerges as a beacon for realising the best ways to address patient needs for personalised rehabilitation and clinical recovery. “Realising the potential of innovative technologies requires multidisciplinary environments, bringing together patients, healthcare providers and healthcare industries in a systematic way to maximise clinical, economic, and environmental sustainability and viability as part of an evolving healthcare ecosystem.\" Professor Caleb-Solly takes over the Academic Director role from Professor Pip Logan who is moving onto a Professional role in Australia. Professor Logan commented: “It’s fantastic news that I will be handing over my role as University of Nottingham Academic Lead for the National Rehabilitation Centre to Praminda. I have been involved in this project for over 10 years, when we wrote the first research strategy with the Defence Rehabilitation Centre. In 2021 we won the chance to be a partner with NUH and LU to build the NRC, next to the Defence Rehabilitation Centre. Since then we have grown a thriving research portfolio in rehabilitation, spanning across projects in engineering, pharmacy, applied health, robotics and mental health and have established four new masters programmes. We lead the NRC patient and public involvement network to make sure our academic work is having real impact on peoples’ lives and have recently secured £3M funding for a Centre in Rehab Technology. I wish Praminda all the best in her role, and know it will be an exciting time as the first patients, clinicians and academics become integrated into the NRC building.” More information is available from Praminda.caleb-solly@nottingham.ac.uk For all enquires please visit: www.nottingham.ac.uk/enquire"
        }
    ],
    "pdf_files": []
}