{
    "url": "https://www.nottingham.edu.my/ComputerScience/Research/Themes/AIApplications.aspx",
    "content": [
        {
            "p": "Determining Optimal Lag time section function with novel machine learning strategies for better agriculture commodity process forecasting in Malaysia (PI: Dr. Chen ZhiYuan, FRGS Fund, 2019 - 2022, RM 121,800) Pipe Crack Detection System by Using the Non-destructive Testing based Mindstorm Robot with Multiple NXT Sensors (PI: Dr. Chen ZhiYuan, MOSTI Science Fund for IP Filing, RM 20,000) Towards enhancing unsupervised anomaly detection by improving complexity, dimensionality and class-boundary properties (PI: Dr. Chen ZhiYuan, School Research Fund, 2016-2022, RM 210,000) mHealth App: Prevention and Management of Cancer via an AI-based Integrated Mobile Application to Recommend Plant-Based Diets. (PI: Dr. Marina Ng Kher Hui, Industry Fund. RM 123,688) ZHIYUAN CHEN, WALEED SOLIMAN, AMRIL NAZIR and MOHAMMAD SHORFUZZAMAN, 2021. Variational Autoencoders and Wasserstein Generative Adversarial Networks for Improving the Anti-Money Laundering Process IEEE Access. 9446893 WAI MUN CHAN, DINH VAN-KHOA LE, ZHIYUAN CHEN, JULLY TAN and IRENE MEI LENG CHEW, 2021. Resource Allocation in Multiple Energy-Integrated Biorefinery Using Neuroevolution and Mathematical Optimization Process Integration and Optimization for Sustainability. 5(1), KASRA BABAEI, ZHIYUAN CHEN and TOMAS MAUL, 2021. AEGR: a simple approach to gradient reversal in autoencoders for network anomaly detection Soft Computing. 25, 15269–15280 JIAWEI CHONG, ZHIYUAN CHEN, MEISHIN OH and AMRIL NAZIR, 2021. An Automated Knowledge Mining and Document Classification System with Multi-model Transfer Learning Journal of System and Management Sciences (JSMS). 11(4), 146-166 ZI YAN CHEN, IMAN YI LIAO and AMR AHMED, 2021. KDT-SPSO: A multimodal particle swarm optimisation algorithm based on k-d trees for palm tree detection Applied Soft Computing. IMAN YI LIAO, BRANDON SOO KHEY SHEN, ZI YAN CHEN, MOHAMMAD FAKHRY JELANI, CHOO KIEN WONG and WEI CHEE WONG, 2021. A Preliminary Study on Germinated Oil Palm Seeds Quality Classification with Convolutional Neural Networks In: 7th workshop on Computer Vision in Plant Phenotyping and Agriculture. KANG, CHEN WEN, HONG, CHUA MENG and MAUL, TOMAS, 2021. Towards data-free gating of heterogeneous pre-trained neural networks Applied Intelligence. 1-12 AMIN, HAFEEZ ULLAH, OUSTA, FIRAS, YUSOFF, MOHD ZUKI and MALIK, AAMIR SAEED, 2021. Modulation of cortical activity in response to learning and long-term memory retrieval of 2D verses stereoscopic 3D educational contents: Evidence from an EEG study Computers in Human Behavior. 114, 106526 VERGHESE, SHEENA LEEZA, LIAO, IMAN YI, MAUL, TOMAS H and CHONG, SIANG YEW, 2021. An Empirical Study of Several Information Theoretic Based Feature Extraction Methods for Classifying High Dimensional Low Sample Size Data IEEE Access. 9, 69157-69172 SENG, GOH HOWE, MAUL, TOMAS and KAPADNIS, MANAV NITIN, 2021. Compositional Committees of Tiny Networks In: International Conference on Neural Information Processing. 389-396 WANI, DUHITA and MAUL, TOMAS, 2021. Image Super-Resolution for Arthropod Identification In: 2021 4th International Conference on Computer Science and Software Engineering (CSSE 2021). 317-324 LAI, WENG KIN, MAUL, TOMAS, LIAO, IMAN YI and GOH, KAM MENG, 2021. Artificial Intelligence and Computer Vision-A Match Made in Heaven? The Journal of The Institution of Engineers, Malaysia. 82(1) ZHIYUAN CHEN, HOWE SENG GOH, KAI LING SIN, KELLY LIM, NICOLE KA HEI CHUNG and XIN YU LIEW, 2021. Automated Agriculture Commodity Price Prediction System with Machine Learning Techniques Advances in Science Technology and Engineering Systems Journal. 6(4), 376-384 SENTHIL KUMAR ARUMUGASAMY, ZHIYUAN CHEN, DINH VAN-KHOA LE and HARSHINI PAKALAPATI, 2021. Comparison between Artificial Neural Networks and Support Vector Machine Modeling for Polycaprolactone Synthesis via Enzyme Catalyzed Polymerization Process Integration and Optimization for Sustainability. 5(1), MAHMOOD HAITHAMI, AMR AHMED and IMAN YI LIAO, 2021. Employing GRU to combine feature maps in DeeplabV3 for a better segmentation model Nordic Machine Intelligence: MedAI: Transparency in Medical Image Segmentation (NMI Challenge). 1(1), Dr. Chen ZhiYuan (e-mail: Zhiyuan.Chen*) Dr. Tomas Maul (e-mail: Tomas.Maul*) Dr. Iman Yi Liao (e-mail: Iman.Liao*) Dr. Radu Muschevici (e-mail: Radu.Muschevici*) Mr. Michael J H Chung (e-mail: Michael.chung*) Dr. Tan Chye Cheah (e-mail: ChyeCheah.Tan*) Dr. Tissa Chandesa (e-mail: Tissa.Chandesa*) Dr. Doreen Ying Ying Sim (email: Doreen.Sim*) Dr. Yasir Hafeez (email: Yasir.Hafeez*) Dr. Muhammad Nasir Ibrahim (email: Muhammad.Nasir*) Dr. Simon Lau Boung Yew (email: Simon.Lau*) * All e-mails are @nottingham.edu.my telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}