{
    "url": "https://www.nottingham.edu.my/ComputerScience/About/Welcome.aspx",
    "content": [
        {
            "p": "Two hundred years ago Britain was a birthplace of the industrial revolution in which we created new technologies to augment our physical powers. The impact of this on our society, indeed on the whole world, is still being felt today. We are now living through the birth of a second technology revolution, the information revolution, in which a new generation of computing technologies are beginning to augment our intellectual powers. From the Internet, to gaming consoles, mobile phones, and satnavs, computers are transforming nearly every aspect of our lives, from the way we work to the ways in which we play, travel, learn and socialise. And yet this is nothing compared to the changes that we will see during your lifetimes as we enter the ‘era of ubiquity’ in which all of us will routinely interact with many thousands of computers that are connected into a global computing environment. What better time could there be in which to study Computer Science? Computer Scientists are at the heart of the Information Revolution, developing radical technologies and designing new applications and products that will bring them into people’s lives. Our discipline is fast-paced, exciting and at the cutting edge. If you want to help shape the world, than there is no better place from which to do it. Here at Nottingham, we are passionate about Computer Science. We are committed to educating graduates who are well prepared for challenges of the knowledge-based economy of the 21st century. We share this passion and commitment across all of our international campuses and are proud of being among the founding schools at both campuses - in Malaysia and China. While we offer a smaller portfolio of courses at international campuses we ensure the parity of educational experience of all Computer Science students and share the scholarly and research expertise of staff through their cross-campus visits and involvement in research supervision. Our students are not only knowledgeable and enthusiastic about contributing their skills and energy to local industry but are inspired by the broader vision of Computer Science that can be afforded through the three-campus operation of the School. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}