{
    "url": "https://www.nottingham.edu.my/ComputerScience/Research/Themes/ImageProcessingandComputerVision.aspx",
    "content": [
        {
            "p": "The Image Processing and Computer Vision research team is generally interested in the topics of Image Processing, Computer Vision, Pattern Recognition, and their related applications. 3D face reconstruction, object tracking, structure from motion and medical image processing are topics that we have been working on and will continue to explore. Research techniques such as nonrigid registration, deformable models, Active Shape Models, 3D Morphable Models and interpretable convolutional neural network are of particular interest. Dr. Iman Yi Liao is working on Small Sample Size Problem in High Dimensional Data Modeling, a very challenging problem which has recently stemmed from diverse fields of sciences, engineering, and humanities, ranging from genomics and health sciences to economics, finance, and machine learning. Dr. Chen ZhiYuan is working in machine learning, data mining, user modelling, simulation, and applications of image processing. She has a particular interest in kernel methods, especially using support vector machines to solve real world problems, such as in anti-money laundering and medical diagnosis. Dr. Tomas Maul is working on neural network architectures and applications in image processing and computational neuroscience. He has been involved in the research of visual functions (e.g., pattern recognition, pose estimation, illumination normalization, and others) and therefore Computer Vision and Image Processing are central to his investigations. Dr. Tissa Chandesa’s current research work centres on Computer Vision, Image Processing, Deep & Machine Learning, Generative Artificial Intelligence (GAI) and the use of Educational Technologies as well as GAI to augment the teaching and learning experience in Higher Education. A Quantitative Interpretable Convolutional Neural Network to Diagnose Diabetic Retinopathy (PI: Dr. ZhiYuan Chen, Faculty Fund, 2019-2022, RM 43,000) Real-Life Sized 3D Human Body Shape Reconstruction from 2D Images for Virtual Garment Fitting. (PI: Dr. Iman Yi Liao, Industry Fund, 2018 – 2021, RM81,420) Automated detection and analysis of Breast Cancer from microscopic pathological images, in collaboration with Cancer Research Malaysia (PI: Dr. Iman Yi Liao, 2021-2022, RM 75,000) Development of Automated Detection and Quality Classification of Germinated Oil Plam Seeds, (PI: Dr. Iman Yi Liao, 2020 to 2022, RM 49,120) Deep Learning for the Automated Curation of Camera Trap Data. (PI: Dr. Tomas Maul, USD 15000, Microsoft AI for Earth) FENG JIANG, ZHIYUAN CHEN, AMRIL NAZIR, WUZHEN SHI, LIM WEI XIANG, SHAOHUI LIU and SEUNGMIN RHO, 2021. Combining Fields of Experts (FoE) and K-SVD methods in pursuing natural image priors Journal of Visual Communication and Image Representation. 78. LIM WEI XIANG, ZHIYUAN CHEN and AMR AHMED, 2021. Quantitative Interpretable Convolutional Neural Network to Diagnose Diabetic Retinopathy, SPRINGER NATURE - Research Book Series: Transactions on Computational Science & Computational Intelligence. (In Press.) KANG, CHEN WEN, HONG, CHUA MENG and MAUL, TOMAS, 2021. Towards data-free gating of heterogeneous pre-trained neural networks Applied Intelligence. 1-12 VERGHESE, SHEENA LEEZA, LIAO, IMAN YI, MAUL, TOMAS H and CHONG, SIANG YEW, 2021. An Empirical Study of Several Information Theoretic Based Feature Extraction Methods for Classifying High Dimensional Low Sample Size Data IEEE Access. 9, 69157-69172 ZI YAN CHEN, IMAN YI LIAO and AMR AHMED, 2021. KDT-SPSO: A multimodal particle swarm optimisation algorithm based on k-d trees for palm tree detection Applied Soft Computing. SHEENA LEEZA VERGHESE, IMAN YI LIAO, TOMAS MAUL and CHONG SIANG YEW, 2021. An Empirical Study of Several Information Theoretic Based Feature Extraction Methods for Classifying High Dimensional Low Sample Size Data IEEE Access. 9, 69157-69172 MAHMOOD SALAH, AMR AHMED, IMAN YI LIAO and HAMID JALAB, 2021. An embedded recurrent neural network-based model for endoscopic semantic segmentationIn: 3rd International Endoscopy Computer Vision Challenge and Workshop (EndoCV2021). MAHMOOD HAITHAMI, AMR AHMED and IMAN YI LIAO, 2021. Employing GRU to combine feature maps in DeeplabV3 for a better segmentation model Nordic Machine Intelligence. (In Press.) IMAN YI LIAO, BRANDON SOO KHEY SHEN, ZI YAN CHEN, MOHAMMAD FAKHRY JELANI, CHOO KIEN WONG and WEI CHEE WONG, 2021. A Preliminary Study on Germinated Oil Palm Seeds Quality Classification with Convolutional Neural NetworksIn: 7th workshop on Computer Vision in Plant Phenotyping and Agriculture. IMAN YI LIAO, MOHAMMAD FAKHRY JELANI, ZI YAN CHEN, CHOO KIEN WONG and WEI CHEE WONG, 2021. Deep Convolutional Neural Networks and Their Applications to Quality Classification of Germinated Oil Palm Seeds In: E-Proceedings International Seminar on Digitalisation of Data for Oil Palm Breeding. SENG, GOH HOWE, MAUL, TOMAS and KAPADNIS, MANAV NITIN, 2021. Compositional Committees of Tiny Networks In: International Conference on Neural Information Processing. 389-396 WANI, DUHITA and MAUL, TOMAS, 2021. Image Super-Resolution for Arthropod Identification In: 2021 4th International Conference on Computer Science and Software Engineering (CSSE 2021). 317-324 LAI, WENG KIN, MAUL, TOMAS, LIAO, IMAN YI and GOH, KAM MENG, 2021. Artificial Intelligence and Computer Vision-A Match Made in Heaven? The Journal of The Institution of Engineers, Malaysia. 82(1) Dr. Tissa Chandesa (e-mail: Tissa.Chandesa*) Dr. Chen ZhiYuan (e-mail: Zhiyuan.Chen*) Dr. Tomas Maul (e-mail: Tomas.Maul*) Dr. Iman Yi Liao (e-mail: Iman.Liao*) Dr. Simon Lau Boung Yew (email: Simon.Lau*) * All e-mails are @nottingham.edu.my AI Innovation Lab Vision and Machine Learning Lab Muhammad Waqas Irfan Yaqub Dr Hermawan Nugroho - hermawan.nugroho@nottingham.edu.my (Department of E&E) Dr Yvonne Seow Hsin Vonn - hsin-vonn.seow@nottingham.edu.my (NUBS) School of Computer Science, University of Nottingham, Malaysia Campus School of Computer Science, University of Nottingham, UK telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}