{
    "url": "https://www.nottingham.edu.my/ComputerScience/About/WhyStudyComputerScience.aspx",
    "content": [
        {
            "p": "Computer Science has the distinction of being a scientific discipline that has engendered some of the most profound and far-reaching social and economic changes since its inception in early 1950s. What’s more it’s a discipline whose pace of development is accelerating as we become more reliant on computers in our day to day lives. Making choices about what to study has to be based on long-term prospects for your career development. As computers become increasingly sophisticated and their presence all-pervasive, the importance attached to advanced computer skills will increase. Computer Science is a field that allows students to pursue a number of exciting career paths, below are just a few. Efficient information processing is at the heart of all business and information technology provides a means of achieving this objective. However, a pure technology-based approach is not sustainable, as fast-changing modern businesses need customisation of the support infrastructure. This development points to a new generation of IT professionals who have a good understanding of the business environment and can translate its objectives into viable technological solutions. Such professionals are well placed to provide competitive advantage to their businesses. Exploration of concepts such as thin-client, grid computing and virtualisation are already receiving attention in the business community and the emerging theme of energy-efficient, environment-friendly IT departments is increasingly gaining prominence. Information management . . . more Financial scandals such as those associated with Enron and Worldcom have triggered renewed attention to the importance of good corporate governance. The effects have trickled down into IT departments as centres of information processing. Consequently there is a newfound interest in IT governance and IT service management. This area embraces many skills. Business continuity expertise is one of the promising specialisms; others include development of best-practice codes such as ITIL and Cobit. With the off-shoring of much industrial production, linking collaborating enterprises in different countries in terms of business information flow is a growth area. The demand for project managers who are comfortable with multi-cultural teams distributed across the planet is expanding. It may seem premature to set your eyes on the Boardroom at the time you are choosing a degree programme. However, the pivotal role played by Computer Scientists in developing systems for information management in future businesses suggests that those responsible for efficient and effective processing of information are likely to be considered key players in their respective organisations. So, while planning to develop as an IT professional, you may also want to broaden your knowledge of business development and finance through an appropriate postgraduate training. Aside from a wide range of interesting career paths, new Computer Science graduates frequently command some of the highest-paid entry level positions compared to graduates in other disciplines. Further, although fewer students are studying Computer Science, the rate of job growth in the sector is increasing; making Computer Science graduates highly employable. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}