{
    "url": "https://www.nottingham.ac.uk/computerscience/news/world-leading-researcher-named-as-turing-fellow.aspx",
    "content": [
        {
            "p": "A leading AI researcher from the University of Nottingham has been awarded £6m to lead bold new work aiming to help AI better enable humans to make meaning of the themselves and the world, and AI itself by combining art and the body. Professor Steve Benford from the University of Nottingham’s School of Computer Science has been awarded a UK Research and Innovation (UKRI) Turing AI World-Leading Researcher Fellowship. He is one of three new fellows, supported through a £15 million UKRI investment. The scheme is designed to retain, attract and develop the best and brightest AI researchers and allows them to undertake world-leading, innovative AI research in collaboration with partners from other sectors to accelerate its impact. Professor Benford’s research will explore how AI can be embodied in a way that meaningfully connects to our own human bodies. He will collaborate with award-winning artists to create and study a series of robotic artworks, from robots that embrace and groom humans, to ones that dance and play music with them. By investigating these systems using an artistic lens he aims to create AI that embraces ambiguity, evokes interpretation, and embraces improvisation. The touring artworks supported through the fellowship will inspire the creative industries with new forms of cultural experience, while engaging the public to reflect on the future role of AI in society, especially on how it might become more inclusive. Professor Benford says: “This Turing Fellowship will allow me and the teams I work with to not only undertake new, exciting research into AI but also to take that research out to the public to enhance understanding and engagement with this fast-paced technology. We plan to take our landmark artworks on tour internationally, reaching audiences around the world.\" The UKRI fellowships are delivered through the UKRI Engineering and Physical Sciences Research Council (EPSRC). EPSRC Executive Chair Professor Charlotte Deane said: “To ensure that we capitalise on the enormous potential of AI and also ensure that it serves the needs of society we need to support bold thinking. “That is what the UKRI Turing AI World-Leading Researcher Fellowships are all about, allowing adventurous thinkers from the UK and across the world to thrive and develop ideas that will benefit us all.” The three new fellows are the latest leading AI researchers to be supported through the Turing AI World-Leading Researcher Fellowships initiative. More information is available from Professor Steve Benford on Steve.Benford@nottingham.ac.uk Read the full story here - https://www.nottingham.ac.uk/news/world-leading-researcher-named-as-turing-fellow?dm_i=5IL5,13LO8,23CDH,52FZZ,1 For all enquires please visit: www.nottingham.ac.uk/enquire"
        }
    ],
    "pdf_files": []
}