{
    "url": "https://www.nottingham.ac.uk/computerscience/emails/colin-johnson-staff-biography.aspx",
    "content": [
        {
            "p": "I am an associate professor in the School of Computer Science here at Nottingham. Before coming to Nottingham at the beginning of 2020, I worked for the University of Kent in Canterbury, teaching a variety of computing courses including Internet of Things and Creative Computing. I was also involved in developing a research team in artificial intelligence, and leading postgraduate studies across the science faculty. My main research and teaching interests are in artificial intelligence, machine learning, and data science. What have been your career highlights? I've particularly enjoyed working with a huge variety of people over the years. Computers are used everywhere, so there are opportunities to collaborate with people both inside and outside universities. Over the years this has involved me working on research with colleagues in biology, physics, and the humanities. I have also collaborated with the railway and finance industries and with musicians and artists to understand how they can use machine learning and computer graphics technologies. I'm currently working on a research project about finding faults in computer programs by analysing the data that is generated as a program runs. Around half of programmers' time is spent finding and fixing faults, so if we can automate even part of this, it could have a huge impact. I am also working on a new edition of the book How to Get A PhD, which gives guidance to PhD students from application through to the final submission and viva. I enjoy working with the variety of students we have. Some students are returning to study after years at work or looking after family, some are coming into computer science for the first time having studied another subject. Of course, we have students from all around the world here at Nottingham. It is great to work with such a diverse group of people. I have been learning to play the cello over the last decade, and I used to play in a local orchestra. I practice at home and enjoy taking part in rehearsals and concerts. Email Colin with any questions about your course For all enquires please visit: www.nottingham.ac.uk/enquire"
        }
    ],
    "pdf_files": []
}