{
    "url": "https://www.nottingham.ac.uk/computerscience/about/about-us.aspx",
    "content": [
        {
            "p": "The School of Computer Science at the University of Nottingham is a modern and dynamic place to work and study. We providing state-of-the-art facilities and undertake world leading research. The Computer Science building is based in the centre of the picturesque Jubilee Campus. Just a short walk or 5 minute free bus from the renowned University Park Campus. The historic city centre of Nottingham is no more than a few minutes' bus ride away. We work hard to maintain a great relationship between our staff and students. We hold regular events such as Christmas parties and Chinese New Year buffets to help everyone in the school feel part of a community. The University’s first foray into the world of computing came in 1962 when the Cripps Computing Centre was founded. The first computing classes were taught in 1963 by Dr Eric Foxley of the Mathematics department. 1984 saw the beginnings of a detachment from Mathematics when the Computer Science Group moved into a row of three portacabins! The Department of Computer Science then moved to the top floor of the iconic Tower Building in 1986. Once we had filled every inch of space which became available there we moved to the newly developed Jubilee Campus in September 1999. Since then, we have continued to expand. The number of students we have has continued to grow. We have also seen the development of the Horizon Doctoral Training Centre and Digital Economy Institute along side us. The School of Computer Science at the University’s China Campus (UNNC) offers a full range of undergraduate and postgraduate computer science programmes. Supported by major research grants, the School of Computer Science at UNNC is developing strong research in areas including Big Data and Visual Analytics, Computational Intelligence, Machine Learning, Software Implementation and Testing, and their applications in Manufacturing, Transport, Healthcare and others. Computer Science at UNNC is a designated strategic area for growth in the University’s Strategic Plan and recruits among top 5% students from China national “Gaokao” examination. More details can be found at http://www.nottingham.edu.cn/go/cs. For all enquires please visit: www.nottingham.ac.uk/enquire"
        }
    ],
    "pdf_files": []
}