{
    "url": "https://www.nottingham.ac.uk/computerscience/studywithus/buying-a-computer.aspx",
    "content": [
        {
            "p": "What we provide Our building has several computer labs inside, that Computer Science students can access 24/7 as needed. These labs include a large teaching lab with windows machines for 250+ students, and smaller windows labs for small group teaching. We also have some specialist labs with custom linux and Mac hardware/software. These machines contain all the software you will need to study on our course, and students can access virtual cloud instances of these machines too, so that you can access them from your own devices in halls or e.g. from home during the summer. Students can also download most of the software to install locally on their own computers too if they have them. We also provide alternative virtual machines for e.g. linux. Buying a computer Although you do not need to provide your own computer, as we provide large labs with different types of computers, many students prefer to have their own, whether for using it away from our labs, or indeed for personal entertainment. Things you might want a computer for include taking notes in seminars and meetings, working in the university during gaps in the timetable, and working at home. Some prefer a laptop for both, whilst other students prefer a desktop computer at home, and a tablet on the go. The most important thing when choosing a machine is making sure it is something you are comfortable using. It is then also more important to have a good set of equipment, rather than the best spec computer you can afford. Consider a longer battery life, over high performance, as you will have access to cloud resources processing and storage. Please note: Chrome books and tablet computers (even with keyboards) may not have the capability to run some software you may need for your studies. Follow us on Twitter Find us on Instragram For all enquires please visit: www.nottingham.ac.uk/enquire"
        }
    ],
    "pdf_files": []
}