{
    "url": "https://www.nottingham.edu.my/Conferences/Alumni-award/index.aspx",
    "content": [
        {
            "p": "Celebrating the achievements of Nottingham's finest Alumni are an asset to any educational institution. At University of Nottingham Malaysia, we aim to celebrate the numerous outstanding accomplishments of our graduates, especially those who have made significant contributions to their professions and communities, as well as demonstrated leadership and excellence in their respective fields and industries. The Nottingham Alumni Awards presents you with an opportunity to nominate yourself or other deserving alumni in five different categories, highlighting your achievements and recognising how far you have progressed in your career after graduation. Nominate today and be part of our exciting award ceremony happening this November. More details about the ceremony coming soon! Nominate now Nominations Open: 29 July 2024, 12PM Nominations Close: 30 September 2024, 12PM Winner Announcement: 8 November 2024 An award ceremony will be held in November. More details will be provided after the winners have been announced. Nominate now Terms and Conditions Data Protection Notice Business and Entrepreneurial Award Alumni who are active in initiating and contributing to business opportunities, innovative and creative in creating new ideas with the potential for growth. Arts, Cultural and Creativity Award Alumni who have carved a career in the arts, cultural, and creative industry and who have demonstrated their artistic ingenuity, influence, and creativity. Environmental and Sustainability Award Alumni who have distinguished themselves through their career and achievements in the world of science, environmental, and sustainability, and who can demonstrate the impact and scale of their achievements in their profession or beyond. Community Service Award Alumni who have made an exceptional contribution and commitment to creating positive social change and improving the lives of others, and has made a positive impact regionally, nationally, or internationally through community service work, philanthropy or volunteering. Academic and Research Excellence Award Alumni who have made significant contributions to the professional, academic and research workplace, and whose accomplishments, affiliations, careers, and services have honoured the University’s legacy of excellence and have a significant impact at the regional, national, or international level. Join our online community to connect with fellow alumni, receive the latest updates about the university and future exclusive events, and subscribe to our newsletter. Register now General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/Nottingham-Alumni-Awards-2024.pdf"
    ]
}