{
    "url": "https://www.nottingham.edu.my/Conferences/ICWES-POCER/index.aspx",
    "content": [
        {
            "p": "2nd International Conference on Water and Environment for Sustainability (ICWES) and 7th Postgraduate Colloquium of Environmental Research (POCER) | Venue: Kuala Lumpur Convention Centre | Date: 23-25 April 2024 It is a great honor to extend to you an invitation to the ICWES-POCER 2024: 2nd International Conference on Water and Environment for Sustainability (ICWES) and 7th Postgraduate Colloquium of Environmental Research (POCER), scheduled to take place in Kuala Lumpur Convention Centre, Malaysia from the 23 to 25 April 2024. In the spirit of fostering interdisciplinary dialogue and maximizing the impact of scholarly gatherings, the collaborative initiative of organising ICWES-POCER 2024 promises to create a dynamic platform for knowledge exchange and networking. This joint endeavor seeks to capitalize on the strengths and expertise of both conferences, providing participants with a richer and more comprehensive experience. The conference is to be held alongside ASIAWATER 2024, the Region's Leading Water & Wastewater Platform for Developing Asia. The conference, themed \"Water, Energy, Climate, and Sustainability: Charting the Future of Environmental Research\", brings together experts and researchers to discuss and explore solutions for vital environmental issues. Preview our conference with this exclusive teaser video View Event Photos here Award Nomination Deadline: 5 April 2024 (Refer programme section) The organising committee of ICWES-POCER is calling for abstract submissions. The scopes of the conference include, but are not limited to the following topics: Download abstract template here Submit abstract here All registered extended abstracts will be published in the conference proceedings with e-ISBN as in conference programme book. After the conference, registered participants will also be invited for submitting their full paper to referred journals. BMC Chemistry Compendium by paperASIA Frontiers in Microbiology Molecular Biotechnology The conference fee will include e-proceedings, lunch and tea breaks (Accomodation and transportation are excluded) Important: Please remember to indicate the invoice number in \"Payment Description\", and email us the payment slip immediately after the payment transaction. HSBC Bank Malaysia Berhad Main Branch 2 Leboh Ampang 50100 Kuala Lumpur Bank account number: 301-879391-101 Swift code: HBMBMYKL Important: Please remember to indicate the invoice number in your transaction, and email us the payment slip immediately after the payment transaction. Registration and Refreshment ASIAWATER 2024 Opening Ceremony by YAB Dato' Sri Haji Fadillah Yusof Deputy Prime Minister and Minister of Energy Transition and Water Transformation 11:30 - 14:00 Light Lunch and Networking 14:00 - 15:30 Welcome Address by Professor Ir Dr Mohd Shahir Liew Vice Provost of Research and Knowledge Exchange of the University of Nottingham Malaysia Launch of ICWES-POCER 2024 Opening Speech and Keynote by Ir Mohd Zaki bin Mat Amin Director General of the National Water Research Institute of Malaysia (NAHRIM), Ministry of Energy Transition and Water Transformation \"Leverage Malaysia's Future in Climate Change and Water Research: What Do We Need?\" Signing Ceremony Group Photo Tea Break Keynote Session I Professor Dr Van-Thanh-Van Nguyen Brace Endowed Chair Professor of Civil Engineering, McGill University, Montreal, Quebec, Canada \"Linking Climate Change to Urban Water Infrastructure Design: Recent Advances and Shortcomings in Downscaling Methods for Estimating Design Rainfalls\" Keynote Session II Professor Ir Dr Thomas Choong Shean Yaw Department of Chemical and Environmental Engineering, Universiti Putra Malaysia \"Application of Nano Calcium Peroxide in Wastewater Treatment\" Keynote Session III Jerry Joynson Director, Cquestr8 Ltd \"Unlocking a Path to Prosperity: Harnessing Malaysia's Unique Assets for Net-Zero Success\" Refreshment Plenary Talk I Professor Ir Dr Faridah binti Othman Universiti Malaya, Malaysia \"Advances in Flood Monitoring and Modelling: Application of AI and Remote Sensing\" Parallel Session I Plenary Talk II Professor Dr Agamutu Pariatamby Sunway University, Malaysia \"Waste Management Challenges in Malaysia: SDGs, EPR, CE and ESG\" Parallel Session II Plenary Talk III Dr Shu Qing Yang University of Wollongong, Australia \"How to Mitigate Flood Sisasters using SPP and Coastal Reservoirs\" Parallel Session III Plenary Talk IV Dr Prasad Kulkarni MIT-World Peace University, Pune, India \"ABCD of Sustainability\" Parallel Session IV Networking Lunch Plenary Talk V Professor Ir Ts Dr Teo Fang Yenn University of Nottingham Malaysia \"Integrating Water Solutions with Nature: From Source to Sea\" Parallel Session V Plenary Talk VI Professor Ir Dr Denny Ng Kok Sum Sunway University, Malaysia \"Redefine Value-based Economy for Sustainable Development\" Parallel Session VI Plenary Talk VII Professor Dr Handry Imansyah Universitas Lambung Mangkurat, Indonesia \"The Main Driver Toward Sustainable Development in Indonesian Manufacturing Sectors\" Parallel Session VII Plenary Talk VIII Professor Dr Roslan Zainal Abidin Universiti Sains Malaysia \"Forecasting Landslides with regards to Rainfall Erosivity and Soil Erodibility\" Parallel Session VIII Award and Closing Ceremony with Gala Dinner Field Trip to National Water Research Institute of Malaysia (NAHRIM) and University of Nottingham Malaysia View ASIAWATER event brochure here View Field Trip information here View Programme Book here View Conference Proceedings here List of awards (during conference) List of awards (by nomination) Deadline - 5 April 2024 Download award guideline here Submit nomination here Ir Mohd Zaki bin Mat Amin National Water Research Institute of Malaysia (NAHRIM), Ministry of Energy Transition and Water Transformation \"Leverage Malaysia's Future in Climate Change and Water Research: What Do We Need?\" Professor Dr Van-Thanh-Van Nguyen Department of Civil Engineering, McGill University, Montreal, Quebec, Canada \"Linking Climate Change to Urban Water Infrastructure Design: Recent Advances and Shortcomings in Downscaling Methods for Estimating Design Rainfalls\" Professor Ir Dr Thomas Choong Shean Yaw Department of Chemical and Environmental Engineering, Universiti Putra Malaysia \"Application of Nano Calcium Peroxide in Wastewater Treatment\" Jerry Joynson Cquestr8 Ltd (Industry) \"Unlocking a Path to Prosperity: Harnessing Malaysia's Unique Assets for Net-Zero Success\" Professor Ir Dr Faridah Binti Othman Department of Civil Engineering, Universiti Malaya \"Advances in Flood Monitoring and Modelling: Application of AI and Remote Sensing\" Professor Dr Roslan Zainal Abidin REDAC, Universiti Sains Malaysia \"Forecasting Landslides with regards to Rainfall Erosivity and Soil Erodibility\" Professor Dr Handry Imansyah Fakultas Ekonomi dan Bisnis, Universitas Lambung Mangkurat \"The Main Driver Towards Sustainable Development in Indonesian Manufacturing Sectors\" Dr Shu-Qing Yang School of Civil, Mining and Environmental Engineering, University of Wollongong \"How to Mitigate Flood Sisasters using SPP and Coastal Reservoirs\" Dr Prasad Kulkarni Department of Environmental Studies, MIT-World Peace University, Pune \"ABCD of Sustainability\" Professor Ir Dr Denny Ng Kok Sum School of Engineering and Technology, Sunway University Malaysia \"Redefine Value-based Economy for Sustainable Development\" Professor Ir Ts Dr Teo Fang Yenn Department of Civil Engineering, University of Nottingham Malaysia \"Integrating Water Solutions with Nature: From Source to Sea\" Professor Dr Agamutu Pariatamby Jeffrey Sachs Center on Sustainable Development, Sunway University \"Waste Management Challenges in Malaysia: SDGs, EPR, CE and ESG\" ICWES-POCER 2024 offers several sponsorship opportunities to meet your organisation's branding requirements and maximize your investments. For more sponsorship and exhibition details: Download sponsorship package here About ICWES This biannual International Conference on Water and Environment for Sustainability (ICWES) was first initiated in 2022, concurrently with the ASIAWATER, the region’s leading international water and wastewater event in Asia. This conference offers a good platform to bring together leading experts to share recent scientific knowledge, management approaches, and engineering solutions water and environmental related academia, research institutions, industries, companies, non-government organisations, and government agencies to help address the world’s pressing water and environment issues. About POCER This biannual Postgraduate Colloquium of Environmental Research (POCER) was first initiated in 2011, and this has expanded to a wide pool of international participants. POCER wishes to bring together students and researchers, to encourage exchange of ideas and issues amongst peers, as well as experience-sharing from other researchers and industries. ICWES-POCER 2024 support SDG: Prof Ir Ts Dr Teo Fang Yenn Prof Ir Ts Dr Show Pau Loke Co-Chair (1) Co-Chair (2) Dr Senthil Kumar Arumugasamy Dr Sivathass Bannir Selvam Dr Suchitra Thangalazhy Gopakumar Dr Vasanthi Sethu Aan Mohammad Nusrat Aman Chen Yixiao Chew Zhi Xian Chong Jun Wei Roy Ching Siew Wen Joel Wong Ching Jue Lee Qian Xuan Leena Abdelazim Hassan Omer Maniyammai Kumaresen Nur Aina Maisarah Teoh Rui Hong Email us at icwes.pocer@nottingham.edu.my for more info. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}