{
    "url": "https://www.nottingham.edu.my/Conferences/PYROASIA/PYROASIA.aspx",
    "content": [
        {
            "p": "We are inviting you to the PYROASIA Symposium 2023 (PyroAsia 2023) which will be held on 26 and 27 June, 2023 at The Majestic Hotel Kuala Lumpur, Malaysia. There will be a social visit/lab visit to Genting on 28 June 2023. The conference is organised by University of Nottingham Malaysia together with the co-organisers PYROASIA Forum and Frontiers Lab, Japan. PYROASIA forum is an effort to bring a network of researchers and practitioners for the advancement and commercialization of pyrolysis and related technologies for future fuels. Participants are cordially invited to submit their original work for presentation. PYROASIA symposium 2023 will include presentations from all thermo-chemical conversion technologies for fuel production. Pyroasia@nottingham.edu.my pyroasia2023@gmail.com Suchithra.Thangalazhy@nottingham.edu.my 26, 27 and 28 June 2023 Early-Bird fees: RM 800 + 6% SST (Normal), RM 500 + 6% SST(Student) Normal registration fees: RM 1000 + 6% SST(Normal), RM 700 + 6% SST (Student) Early-Bird fees: USD 250 +6% SST (Normal), USD 200 + 6% SST (Student) Normal registration fees: USD 300 + 6% SST (Normal), USD 250 + 6% SST (Student) Abstract template Abstract submission Registration here Please make your payment here (Please select pyroasia 2023) Awards: Three (3) Best Oral presentations Each registration can submit only one paper. Abstract submission: 1 November 2022 - 10 May 2023 Early-Bird Registration: 1 December 2022 - 20 May 2023 Regular Registration: 21 May 2023 - 10 June 2023 Organizer : Faculty of Science and Engineering, University of Nottingham Malaysia : PYROASIA Forum Co-organizer. : Frontier Lab, Japan Silver Sponsors : CDS Analytical, USA JEOL Ltd, Japan IT Tech Research (M) Sdn Bhd, Malaysia Selected paper will be recommended to the specific journal to submit full paper after the conference. All full papers will undergo normal peer review process before it can be accepted for publication. Currently we have two confirmed VSI for our conference. https://www.sciencedirect.com/journal/journal-of-analytical-and-applied-pyrolysis/about/call-for-papers#pyroasia-2023-international-symposium-on-thermo-chemical-conversion-technologies-for-fuel-production https://www.mdpi.com/journal/energies/special_issues/thermochemical_conversion_food_agricultural_forest_wastes_biofuel Conference Chair: Dr Suchithra Thangalazhy Gopakumar Co-chair: Dr Sathrugnan Karthikeyan (Frontier Lab) Local Committee Members International Advisory Members telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}