{
    "url": "https://www.nottingham.edu.my/Conferences/ISEDCAB/index.aspx",
    "content": [
        {
            "p": "The application of environmental DNA (eDNA) in biomonitoring has taken off in recent years in Southeast Asia, due to better availability of omics platforms and expertise. Environmental DNA is now being used in biodiversity surveys, to monitor population dynamics and movement of threatened and economically important species and assess response of species and communities to environmental change. This inaugural symposium aims to bring together eDNA researchers to discuss the opportunities and challenges in the Southeast Asia region and beyond. The symposium is held in conjunction with the 4th International Workshop for Mangrove Biodiversity Studies by eDNA Metabarcoding 2023 (11-19 Mar 2023). 14 March 2023 The University of Nottingham Teaching Centre Level 2, Chulan Tower No.3 Jalan Conlay 50450 Kuala Lumpur Malaysia RM200* RM100* *A 6% sales and service tax will be added onto the fee during payment. Registration here edna.symposium2023@nottingham.edu.my Registration open: 06 February 2023 Closing for Extended Abstracts: 24 February 2023 Program finalised; presenters notified: 28 February 2023 Registration closed (no walk-in): 10 March 2023 ISEDCAB 2023 Symposium: 14 March 2023 Time Agenda Note 09:00-09:30 Arrival & registration 09:30-09:40 Welcome speech Prof. Sarah Metcalfe (Provost and CEO UNM) 09:40-09:45 Welcome address & housekeeping from the organising committee Dr Alison Wee 09:45-10:15 Challenges to Understand Global Mangrove Biodiversity using eDNA Metabarcoding Prof. Tadashi Kajita 10:15-10:30 Developing Cost- and Time-efficient eDNA Protocols for Surveying Freshwater Mussels in Tropical Rivers Dr Alexandra Zieritz 10:30-10:45 Morning break & poster viewing 10:45-11:15 Next-generation Biodiversity Monitoring Using Genome-side SNPs and eDNA Analysis Prof Yoshihisa Suyama Lightning talks (poster session) 11.15-11.45 Splash, splash. Who’s there? Assessing a megadiverse but poorly known community of fishes in a tropical mangrove estuary through environmental DNA (eDNA) metabarcoding Danial Hariz Zainal Abidin The potential of eDNA metabarcoding for mangrove ichthyofauna survey in Peninsular Malaysia Leanne Frances Yee Fish diversity monitored by eDNA: A case study from mangrove ecosystem of Thailand Itchika Sivaipram MiFish eDNA metabarcoding analysis in mangrove ecosystem in Nakara River at Iriomote island, Japan Yukinobu Isowa Applications and limitations of eDNA metabarcoding to assess fish biodiversity in the seascape of Prieto Diaz, Sorsogon, Eastern Philippines Camila Frances P. Naputo Monitoring fish biodiversity using eDNA metabarcoding in the newly registered World Natural Heritage Site: Iriomote Island, Okinawa, Japan Bernadeth Grace S. Pananganan Creating a reference database for eDNA decapod research in Akkeshi Bay Kanako Iguchi Where and when to sample: Investigating spatio-temporal variation of community assemblages in kelp forest systems with eDNA metabarcoding Emma Rossouw Potential environmental DNA approach to complement biodiversity monitoring in strengthening the CITES regulation of the Asian Bonytongue, Scleropages formosus (Teleostei: Osteoglossidae) in Malaysia Haslawati Baharuddin New record of digenean trematode parasite infestation on snail in Sabah, Malaysia Jasrul Dulipat The placement of Sabah Dryopteris (fern) within Asian Dryopteris Florina Anthony Effect of tidal zones on the diversity and distribution of gastropods in mangroves of South Andaman Islands, India Pridvi Raj Gutthavilli A Review on Next-Generation Wildlife Monitoring using Environmental DNA (eDNA) Nursyuhada Othman 11:45-12:00 Group photo 12:00-13:00 Lunch Poster viewing Oral presentations 13:00-13:15 Oral 1 Ecology, evolution and conservation of Brazilian mangrove trees and forests: adding eDNA to the molecular toolkit Gustavo M. Mori 13:15-13:30 Oral 2 Morphological and molecular monitoring of fish in east coastal of North Sumatera and Aceh, Indonesia Mohammad Basyuni 13:30-13:45 Oral 3 Enhancing invasive fish detection through the integration of complementary sampling strategies in environmental DNA analysis Saba Abdulwakil Olawale 13:45-14:00 Oral 4 Marine mammals monitoring in Southeast Asia: An eDNA perspective Sivakumar Kannan 14:00-14:15 Oral 5 Metagenomic insights on the phylogenetic and functional characteristics of sediment microbiota from Malaysian mangroves and seagrasses Nur Hidayah Hamdan 14:15-14:30 Oral 6 Assessment and monitoring of fish biodiversity in a Malaysian tropical peat swamp forest Muhammad Azamuddeen bin Mohammad Nasir 14:30-14:45 Oral 7 Using environmental DNA (eDNA) to access the diversity of sharks and rays in Tioman Island, Malaysia Loh Kar Hoe 14:45-15:00 Oral 8 eDNA-based approach for detecting Chitala ornata (Teleostei: Notopteridae), an invasive species of freshwater fishes in Malaysia Muhamad Hanif Iryani Bin Adnan 15:00-15:15 Oral 9 Developing an environmental DNA species-specific assay to monitor endangered Asian Arowana in Malaysia Norli Fauzani Mohd Abu Hassan Alshari 15:15-15:50 Afternoon break Poster viewing session Poster presenters to be next to poster 15:50-16:00 Closing remarks Chair of the Organising Committee Dr Alison Wee Kim Shan School of Environmental Geographical Sciences University of Nottingham Malaysia Scientific Committee Professor Tadashi Kajita Tropical Biosphere Research Center University of the Ryukyus, Japan Professor Chin Chiew Foan School of Biosciences University of Nottingham Malaysia Dr Amy Then Yee Hui Institute of Biological Sciences Universiti Malaya ISEDCAB 2023 Secretary Dr Cecilia Chu School of Environmental Geographical Sciences University of Nottingham Malaysia ISEDCAB 2023 Publicity Dr Sivathass Bannir Selvam School of Environmental Geographical Sciences University of Nottingham Malaysia To register your participation please fill up the form in the following link: Registration form Notes on registration: 1. Bank Transfer Bank: HSBC Bank Malaysia Berhad Account name: The University of Nottingham in Malaysia Sdn Bhd Account number: 301-879391-101 Swift code: HBMBMYKL Please indicate \"Invoice number (eg:GRIV54xxxxxx) ISEDCAB2023 \" in your transaction details. 2. Online Payment https://epay.nottingham.edu.my (select “ISEDCAB2023”) Please indicate invoice number (eg:GRIV54xxxxxx) under “Payment Description”. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}