{
    "url": "https://www.nottingham.edu.my/Conferences/COPE2024/index.aspx",
    "content": [
        {
            "p": "Education Reforms: Reshaping Today for Tomorrow COPE24 strives to provide a platform for individuals who are directly or indirectly involved in the pre-university education sector to share and exchange their latest findings and experiences in pre-university education. This conference welcomes scholarly discussions of new issues, innovative teaching and learning approaches, and technology-enhanced learning, which would include novel and rigorous investigations of educational practices, policies, and assessments. Date : 20 August 2024 Venue : Putrajaya Marriot Hotel Step 1: Create a new login account with EasyChair with this link: https://easychair.org After login is successful, go to the conference link and click ‘start registration’. https://easychair.org/my/conference?conf=cope2024 Step 2: Fill in the information required, provide a valid email for COPE24 team to send important updates and/or notifications. Step 3: Choose registration type. Step 4: Once registered, you can proceed to make payment. Click the ‘Pay Registration’ button to proceed. Note that changes to personal data can still be made after this stage. Step 5: Payment is successful when you reached the ‘Payment Received’ page. To view/download receipt or make changes to personal data Here is the step-by-step registration and payment guidelines for your reference. Please do not hesitate to write us an email if you need assistance, at COPE2024@nottingham.edu.my UNM Staff: USD79 (amount with 8% SST included) Early Bird: USD79 (amount with 8% SST included) with deadline on 30 June 2024 Normal Registration: USD99 (amount with 8% SST included) with deadline on 20 July 2024 The Organising Committee of COPE24 is calling for abstract submissions that will be evaluated by the Scientific Committee. The scopes of the conference include, but are not limited to, the following tracks: The abstract must include the following information: Submission of abstract must go through the EasyChair platform. An EasyChair account is required for the submission. Step 1: Login to EasyChair via this link: https://easychair.org/conferences/?conf=cope2024 Step 2: Click ‘Author’ and click ‘Make a new submisison’. Step 3: Key in the required information: Author 1, Title, Abstract (Max 250 words). Keywords (3 to 5 words). Note: Author 2, Author 3, etc are optional. Step 4: Click ‘Submit’. Abstract submission deadline: 15 July 2024 Notification of acceptance: 20 July 2024 Early bird registration deadline: 30 June 2024 Normal registration deadline: 20 July 2024 Arrive in the conference room at least 10 minutes before start of your session and load the presentation materials to the laptop.( to setup). The chair will remind the presenter of their timings before the start of the session. Authors should have their posters in place the session begins. There MUST be a presenter standing at the poster during the entire scheduled poster time. One poster board is reserved for your use. Each board has a width of 84cm and a height of 155cm. The poster is not required to fill this entire space, but it cannot be any larger than the board size. It is recommended to use A0 Portrait for your poster size. The title of your poster should appear at the top in CAPITAL letters about 25mm high. Below the title put the author(s)' name(s) and affiliation(s). Once your abstract is accepted (regardless of presentation mode), you will be invited to submit a full-text paper, which may include research papers, developmental papers, extended abstracts as well as case studies. All submissions should be original and previously unpublished research works. All papers will undergo a peer review by at least two anonymous referees, and evaluated based on originality, technical, presentation, research depth, accuracy, and relevance with the conference themes. Accepted papers will be submitted for inclusion into a peer reviewed conference proceeding published by MMU Press. Full paper submission ends: 25 Aug 2024 Notification of full paper acceptance: 30 Oct 2024 Camera-ready full paper submission: 30 Nov 2024 Subarna Sivapalan FRSA is presently Associate Professor and Head of the School of Education, University of Nottingham Malaysia and Research Lead of the Sustainability and Transformational Education Research Cluster (STERC). She is also the Lead of the University of Nottingham UNESCO Chair in International Education and Development Malaysia Office. She has over 20 years of experience within the higher education sector. At the national level, Subarna is actively involved in sustainability education advocacy. She is presently the Co- Chair of the National Education for Sustainable Development Association of Selangor. She also sat on the National Committee of WWF Malaysia's Foundation for Environmental Education (FEE) Eco Schools Programme, and has held the role of Chair and Deputy Chair of the FEE Eco Campus Programme. At the international level, Subarna is an Acumen Fellow, the world's school for social change. She is also a fellow of the United Nations University Pro.SPER.Net Leadership \"Building Transformational Leadership Towards The SDGs\" fellow. Subarna is the recipient of WWF Malaysia's National Eco-Lecturer Award for her efforts in advocating for greater awareness amongst youth to champion sustainability. She has also received awards for Effective Education Delivery and Academic Leadership. Subarna obtained her PhD in Education from the University of Nottingham. Tina has worked in education for 30 years across both the compulsory and post-compulosry sectors. As an engaging and experienced educator, Tina has extensive experience in lecturing and tutoring in research methods, education and social policy and social justice. Tina’s research interests include widening participation, student voice, education policy, reproduction of inequality, vulnerable and disadvantaged groups and qualitative methods. She has led and contributed to high profile social research studies including teenage pregnancy, homelessness amongst young people and young people’s transitions into higher education. Her PhD focused on interventions that support students who go into higher education from disadvantaged backgrounds, with a focus on the role of the Sutton Trust. She has significant consultancy experience with a pharmaceutical company, conducting and disseminating research on a number of health-related studies. An effective leader and manager, Tina has extensive experience in leading strategy, change programmes and developing staff. Her most recent role as Head of Enhanced Academic Practice places her at the forefront of strategic developments to enhance the practice of staff, leading to improved experiences and outcomes for university students. Beyond academia, Tina provides strategic leadership as a non-executive Director (current Board Chair) at the National Ice Centre. Associate Professor Dr. Tan Wee Chuen has worked in tertiary education institutions for over 20 years within education research, teaching, management and leadership. She has extensive work experience in both academic and management positions. Dr. Tan holds a PhD in Educational Technology, a Master degree in Education and a Bachelor Degree in Science and Computer with Education. As a researcher in education, Dr. Tan conducted extensive research in educational technology and has published these findings in various publications including books, proceedings and journal papers. As a lecturer, she had applied various pedagogies at the higher education level to promote students’ learning, which have been shared in conferences and journals. These experiences have led Dr. Tan to become a prominent trainer in pedagogy and providing guidance to academic staff in teaching and learning. She is a Certified Trainer under Human Resources Development Fund Malaysia. She is also appointed as a Panel Assessor for the Malaysia Qualification Agency. Will be updated soon Dr. Jaya Kumar Karunagharan Ms. Saleha Abdul Rahman Email us at COPE2024@nottingham.edu.my for more info. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}