{
    "url": "https://www.nottingham.edu.my/Conferences/ISPFVF/index.aspx",
    "content": [
        {
            "p": "Participants are invited to submit an original research paper in their area of specialisation for oral / poster presentation. Topics available are such as food processing, food security, food engineering, food ingredients, product development, halal food, food properties, product quality and analyses, functional food, food chemistry, food biotechnology, food waste recovery and treatment, nutrition and health, packaging and storage, food microbiology, food safety, drying of food waste, valorisation of food waste, 3D printing of food, education and training and other related topics. Awards: Three (3) Best Oral and Poster presentation and other awards 22 and 23 June 2023 Cititel, Mid Valley Kuala Lumpur, Malaysia Local Fees: Early bird fees extended (before 3 April 2023): RM 800* (Normal), RM 500* (Student) Normal registration fees: RM 1000* (Normal), RM 700* (Student) International Fees: Early bird fees extended (before 3 April 2023): USD 250* (Normal), USD 200* (Student) Normal registration fees: USD 300* (Normal), USD 250* (Student) Participation/Accompany person: Local Fees: RM 400* International Fees: USD 200* *All payment are subject to 6% government tax. Please request for an invoice before making any payment. Registration here Submit abstract here Email Department of Chemical and Environmental Engineering, Faculty of Science and Engineering, University of Nottingham Malaysia Plenary speaker: Prof. Kuan-Chen Cheng (National Taiwan University) Keynote speakers: Prof. Mohammad Djaeni (Diponegoro University) Prof. Luqman Chuah Bin Abdullah (Universiti Putra Malaysia) Dato' Wong Yew Kai (ABG Interactive Sdn Bhd) Dr Samuel Yap Kian Chee (Malaysian Cocoa Board) Abstract submission open: 1 November 2022 Abstract submission for oral presentation close: 31 May 2023 Abstract submission for poster presentation close: 15 June 2023 Full paper for proceedings (Optional) & Oral Presentation close: 31 May 2023 Poster presentation close: 15 June 2023 Conference registration close: 15 June 2023 Apart from the conference proceedings, ISPFVF 2023 also invites paper submissions to the following journals. Selected paper will be recommended to the specific journal to submit full paper after the conference. All full papers will undergo normal peer review process before it can be accepted for publication. Selected journels: Foods, Q1 Journal with Impact factor: 5.561 (15% discount for invited paper submitted to this conference) https://www.mdpi.com/journal/foods/special_issues/I025IYP260 Processess , Q2 Journal with Impact factor: 3.352 (a discount between 15-25% for the papers submitted to the conference) https://www.mdpi.com/journal/processes/special_issues/7YT318EPQS Ir Dr Chien Hwa Chong (Chair) Dr Tan Choon Hui (Rachel) (Vice-chair) UCSI University Ir Professor Chung Lim Law Ir Professor Pau Loke Show Ir Dr Ching Lik Hii Ir Dr Sze Pheng Ong Dr Ianatul Khoiroh Dr Yin Yin Lau Dr Lee Sin Chang Professor Arun S. Mujumdar (Chair) McGill University, Canada Ir Professor Chung Lim Law (Co-chair) Professor Dato’ Ir Dr Wan Ramli Wan Daud Universiti Malaya Professor Min Zhang Jiangnan University, China Professor Prabhat Kumar Nema Professor Henry Ho-Hsien Chen National Pingtung University of Science and Technology, ROC. Professor Luqman Chuah Abdullah Universiti Putra Malaysia Professor Mohamad Djaeni Professor Zhonghua Wu Tianjin University of Science and Technology, China Professor Sakamon Devahastin King Mongkut's University of Technology Thonburi, Thailand Professor Zhongjie Zhang Academy of National Food and Strategic Reserves Administration, Beijing, China Professor Xiao Hong Wei China Agriculture University, China Dr Sachin Jangam National University of Singapore Dr Siew Kian Chin Newcastle University Singapore Dr Li-Xin Huang Institute of Chemical Industry of Forest Products, China Dr Chaleeda Borompichaichartkul Chulalongkorn University, Thailand Professor Adam Figiel Wroclaw University of Environmental and Life Sciences, Poland Professor Antoni Szumny Professor Mohd Djaeni Diponegoro University, Indonesia Dr Ming Chiat Law Curtin University, Malaysia Dr Rafeah binti Wahi Universiti Malaysia Sarawak, Malaysia. Dr Meng Wai Woo University of Auckland, New Zealand. Dr Samuel Yap Kian Chee Lembaga Koko Malaysia. Dr Kar Yong Pin Forest Research Institute Malaysia , FRIM Dr Nanik Suhartatik Universitas Slamet Riyadi Surakarta, Indonesia Dr Teng-Jin Khoo telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}