{
    "url": "http://www.nottingham.ac.uk/conference/facilities/index.aspx",
    "content": [
        {
            "p": "Nottingham Venues is a collection of independent venues specialising in meeting and events, set in the beautiful grounds of the University of Nottingham. By bringing together all of the University’s conferencing, hotel and event spaces under one iconic brand, we provide an unrivalled guest experience. We are incredibly proud of our region, our city and our accessible location, which is why our icon represents the mighty oak. A wide range of facilities for events of all sizes can be found across all three campus locations (University Park, Jubilee Campus, and Sutton Bonington) at the University of Nottingham. Available in University vacation periods. Campus Venues Set within 65 acres of lakeside grounds, close to Nottingham city centre, Jubilee Conference Centre offers an innovative setting for events, along with all the comforts of a modern hotel. Featuring contemporary interiors, natural décor, and light-filled spaces combine across versatile and modern event suites with space for up to 250 guests. Jubilee Conference Centre Following a multi-million pound refurbishment, East Midlands Conference Centre offers state-of-the-art meetings and events spaces, banqueting suites and magnificent, contemporary public spaces. A leading venue in the Midlands for large events including exhibitions and gala dinners, East Midlands Conference Centre accommodates up to 1000 guests - and also offers a collection of spaces for smaller meetings and training sessions. East Midlands Conference Centre A stylish, eco-friendly hotel featuring 202 bedrooms located next to the modern and recently refurbished East Midlands Conference Centre. Awarded with Best Sustainable Venue at the CHS 2017 and CHS 2019 Awards, the Orchard Hotel features 5 meeting rooms and bespoke modern décor. When it comes to eating and drinking, there’s a brasserie style restaurant and bar to choose from that serve up the very best of local and seasonal food. Orchard Hotel Discounted hotel rates for the Orchard Hotel and Jubilee Conference Centre are available for staff, associates, Alumni and visitors coming to the University of Nottingham. To book, please email Orchard.reservations@Nottinghamvenues.com or Jubilee.reservations@Nottinghamvenues.com Alumni In order to qualify for the alumni rate, please ensure you contact the Alumni Team for a verification code, providing your name, subject and year of study at alumni-enquiries@nottingham.ac.uk or on +44 (0)115 823 2408. Once verification is complete, please book directly with the hotel With new conferences being confirmed all the time you’re sure to find something that catches your eye. We attract expertise drawn from across all academic disciplines so that academic conferences at The University of Nottingham bring together subject specialists from across the globe. There are no results that match your criteria. View the full events calendar rather than a list. If you need to find out more about a past conference you can do so easily by consulting our conference archive. This directory of our previous events includes information on the topics covered by the conference, the keynote speakers and the coordinating institutions. Conferences at The University of Nottingham Beeston Lane The University of Nottingham NG7 2RJ telephone: +44 (0) 115 876 0900 email: conferences@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}