{
    "url": "https://www.nottingham.edu.my/Conferences/icrs2025/index.aspx",
    "content": [
        {
            "p": "Bridging Borders: Addressing Cancer Across South-East Asia The International Cancer Research Symposium 2025 (ICRS2025) is a premier two-day event designed to bring together professionals dedicated to advancing cancer research in Southeast Asia and beyond. This symposium provides a platform for researchers, healthcare experts, and industry leaders to share groundbreaking developments, trends in cancer treatment, and cutting-edge research findings. The event aims to promote collaboration, inspire innovation, and create meaningful connections that transcend borders, ultimately contributing to a healthier global future in cancer care. Date : 14-15 May 2025 Venue : The Waterfront Hotel, Kuching, Sarawak, Malaysia Step 1: Complete the registration form.* You will receive your Registration ID through e-mail.: link Step 2: You will receive an e-invoice within 3-7 working days of your registration. Step 3: Process your payment through our e-Gateway**: Step 4: Email your receipt to ICRS@nottingham.edu.my with the subject “Proof of Payment (Registrant Name, Registration ID)”. * Early Bird Registration Deadline: 31 March 2025 **Early Bird Registration Payment Deadline: 7 April 2025 * Normal Registration Deadline: 30 April 2025 **Normal Registration Payment Deadline: 7 May 2025 Discounts Available *Note: Student presenters must provide a valid student ID upon registration. Group registration applies only when all registrants sign up together in one transaction. The highest eligible discount will be applied, and discounts cannot be stacked or combined. Cancellation Policy *Note: Cancellation requests must be communicated to the secretariat by e-mail. All approved refunds will be made after the symposium. All bank charges for remittance will be deducted from the refund. Researchers, clinicians, and professionals in cancer research are invited to submit abstracts for presentation at ICRS2025. This is an opportunity to showcase innovative research and contribute to the global fight against cancer. Abstract themes include: Abstract Submission Guide CMT Guide Guideline to register to Microsoft CMT Coming soon Sponsor will be updated soon To ease the respective secretariat team in replying to your request, kindly include the keywords below when you email us at ICRS@nottingham.edu.my: General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}