{
    "url": "https://www.nottingham.edu.my/Conferences/ICWES/index.aspx",
    "content": [
        {
            "p": "The 1st International Conference on Water and Environment for Sustainability will be held from December 7 to 9th 2022 in Kuala Lumpur Convention Centre, Malaysia, concurrently with the ASIAWATER 2022, the region’s leading international water and wastewater event in Asia. The conference will be organised by the University of Nottingham Malaysia together with the co-organisers, the Malaysia Chapters for the International Association for Hydro-Environment Engineering and Research (IAHR) and the International Association for Coastal Reservoir Research (IACRR). Sustainable management of global water and environment issues is fundamental for the achievements of all the 17 United Nations Sustainable Development Goals (SDGs) that can positively impact our world and provide a better future for all, including the improvement to the quality of life. To achieve that, we need the strong cooperation and close coordination among scientists, researchers, engineers, industry players, managers, and policy makers. In this regard, this international conference will offer a good platform bringing together leading experts to help address the world’s pressing water and environment issues. The conference will also provide the opportunity to share recent scientific knowledge, management approaches, and engineering solutions by the participants from different backgrounds of water and environmental related academia, research institutions, industry companies, non-government organisations, and government agencies. Extended Abstract Deadline: 1 November 2022 Acceptance Notification: 15 November 2022 Full Paper Deadline (Optional): 31 December 2022 Conference: 7 - 9 December 2022 Selected full papers will be invited for publication in Scopus Indexed Larhyss Journal and MYCITE Indexed IEM Journal. Kuala Lumpur Convention Centre, Malaysia USD 250 (International) MYR 800 (Local) USD 300 (International) MYR 1000 (Local) Registration here Dato' Ir Dr Md Nasir Md Noh (Director General of the Department of Irrigation and Drainage, Ministry of Environment and Water) Professor Joseph Hun Wei Lee (President of IAHR) Professor T G Sitharam (President of IACRR) Professor Roger A Falconer (Past President of IAHR) Professor Rahmah Elfithri (Chief of Section on Capacity Development and Water Family Coordination at UNESCO) To be held concurrently with ASIAWATER 2022 – the Region’s Leading Water and Wastewater Event for Developing Asia Message from Organising Chair On behalf of the organising committee, I am delighted to invite you to participate in the 1st International Conference on Water and Environment for Sustainability (ICWES 2022) to be held in Kuala Lumpur Convention Centre, Malaysia, from December 7 to 9th, 2022. The theme of the ICWES 2022 is “Towards Sustainable Water and Environment Management for the Future”, as we all share and are striving to achieve a more sustainable management of water and environment for the future. The conference aims to provide a platform for scientists, researchers, engineers, industry players, managers, and policy makers to engage, share, and exchange the recent scientific knowledge, management approaches, and engineering solutions on water and environment for sustainability. You are welcome to Malaysia for this exciting international conference and see you all soon! Ir Ts Dr Teo Fang Yenn Chair of the Organising Committee Conference Theme Towards Sustainable Water and Environment Management for the Future Conference Topics Contact Us Email: ICWES2022@nottingham.edu.my Co-organised By Sponsored By telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}