{
    "url": "https://www.nottingham.ac.uk/confucius/funded-projects/talking-trees.aspx",
    "content": [
        {
            "p": "NCI FUNDED PROJECT Academic Leads: Dr Lan Lo and Dr Michael Pinchbeck Changing this current slide of this carousel will change the current slide of the thumbnail carousel that follows. What does home mean to you? What does arriving mean to you? What does leaving mean to you? Talking Trees / 树说/述说 involves a living archive of stories to be listened to at trees, imported from China, by downloading tracks via the QR codes. The stories explore the notion of home, roots/routes and how trees have grown over time as a metaphor for migration and belonging. One tree represents the idea of ‘leaving home’ while the other tree represents the idea of ‘arriving home’. At each of the two trees you are invited to listen to verbatim interviews with Chinese speakers on a range of relevant themes. The voices were provided by students and staff from a range of backgrounds. A fictional narrative drawn from archival research and images explores the journey the trees might have taken from China to the UK, 100 years ago, how they might be talking to each other and what they might say. This fictional narrative frames the interviews and forms an audio walk between the trees for visitors to follow. This immersive audio experience has been designed with Leicester-based sound artist, Chris Cousin. Talking Trees / 树说/述说 is a collaborative research project that provides students from the University of Nottingham (UoN) with the opportunity to ‘Journey to the East’ without travelling to the country. It was devised in collaboration between Dr Lan Lo, Associate Professor in Chinese Language and Society from the UoN and Dr Michael Pinchbeck, Reader in Theatre (MMU) during the Covid-19 pandemic as an alternative to study placement for students taking Chinese on university degree programmes. It was part of a package of measures designed to address these students’ language and cultural study needs in the context of lockdown and restrictions on international travel including to China. It is located within research on student migration and chimes with previous projects delivered either separately or in partnership by Lan Lo and Michael Pinchbeck around notions of home, migration and belonging. Please note the piece is in English and Mandarin / Cantonese. A written transcript is available on request. Point 1 - listen to the audio track for Leaving Tree (Tree of Heaven) This track reflects on the Tree of Heaven, its history and heritage, and how we might connect to it. It asks you to look up and listen. It asks where our speakers are from, what they might consider home and how it felt to leave that place. You are then asked to take a journey to the second tree through the botanical garden and consider what these trees might have experienced since they were planted. You are invited to explore the botanical garden as you journey to the second tree and listen to our speakers talk about their journeys to and from the places they consider home. Point 2 - listen to the audio track for Arriving Tree (Gingko Biloba Tree) This track reflects on the Gingko Biloba Tree, its history and heritage, and how we might connect to it. You are invited to take a seat on the bench next to the tree and look around the botanical garden. The track considers what the trees have witnessed over time and how the landscape might have changed. It asks our speakers how it felt to arrive in a new home and how they have adapted to this new landscape, like the trees. You are left with a moment of reflection and contemplation in this space - an opportunity to see leaving and arriving home through the stories of our speakers. Point 3 - Listen to the audio track for Future Trees (Gingko Biloba saplings) This track reflects on the Gingko Biloba Tree saplings in front of you, and the world they might grow into. You are invited to take a seat on the bench next to the trees and look around the environment. The track considers what the trees will witness over time and how the landscape might change. It asks our speakers, four young people, how it will feel to grow older and how they will adapt to this new landscape, like the trees. You are left with a moment of reflection and contemplation in this space - an opportunity to see the future through the stories of our speakers. Credits: We would like to thank the project funder (Nottingham Confucius Institute), interviewees and participants at the preview event at UoN Diversity Festival for their feedback. We would particularly like to thank Hua Geddes (NCI), Fangfang Xie (NCI), Prof. Neil Hughes (CLAS), Prof. Nicola McLelland (CLAS), Dr Tara Webster-Deakin (CLAS), Sam Robinson (CLAS), Ian Leroux (CLAS), Victoria Waring (HR) and Julie Thomas (HR), Dale Coates (Estates office) for their support of Talking Trees/树说/述说. Thanks to Manchester School of Art Research Centre. Video / Photographs: Ai Narapol / Yellow Pocket Studios Sound: Chris Cousin Text: Dr Lan Lo / Dr Michael Pinchbeck Voices: Lan Lo, Songbo, Zhuo Earl, Qing Shan, Howard Wat, Hwee Er Teo. Project Leads: Dr Lan Lo / Dr Michael Pinchbeck Room A23, CI Library Si Yuan Building Jubilee Campus Nottingham, NG8 1BB telephone: +44 (0)115 748 4502 fax: +44 (0)115 846 6324 email: confucius.institute@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}