{
    "url": "https://www.nottingham.edu.my/Conferences/FSSIDS/Keynote-Speakers.aspx",
    "content": [
        {
            "p": "FATIMAH MOHAMED ARSHAD (DATIN PADUKA, Ph.D.) Fatimah Mohamed Arshad is a research fellow at the Laboratory of Agricultural and Food Policy Studies, Universiti Putra Malaysia specializing in agricultural marketing and policy analyses. She obtained her doctorate degree in Agricultural Marketing from the University of Newcastle upon-Tyne in 1980. She has served as an academician at the Faculty of Economics and Management, Universiti Putra Malaysia (UPM) since 1980 until 2014. She was the Director of the Institute of Agricultural and Food Policy Studies, UPM (2006-2014) and later as a research fellow at the institute until to date. She is currently a member of the country’s National Agriculture Advisory Council, Ministry of Agriculture and Food Industry, Malaysia (2018 - ). She is actively involved in providing input to the formulation of the country’s agricultural food policy since 1980s starting with the National Agricultural Policy (NAP I) (1984), NAP II (1992-2010), NAP III (1998-2010), Agro-Food Policy (2011-2020), Agro-Commodity Policy (2011-2020), Food Security Policy (2008), Agro-food Policy 2.0 (2021-2030) and various five-year Malaysia plans. She is also a permanent member of Executive Committee on Food Security, Ministry of Agriculture and Food Industry (2020 - ). She is the Head, Agriculture and Food Security Cluster, Academy of Professors, Malaysia (2020 - ) and senior fellow, Institute for Democracy and Economic Affairs (IDEAS), (2020 - ). Her research areas include; agricultural marketing and economics issues, policy analyses, and agricultural market structure, conduct and performance. She has done various policy research studies particularly on the role of agricultural subsidies and incentives in the paddy and rice industry, food security, agricultural cooperatives, food supply chain and marketing, price analyses and forecasting and commodity and agricultural sector modelling. She has developed a vintage model for estimating oil palm production, system dynamics modelling on pertinent issues in agriculture such as food security, industrial commodity development and paddy and rice sector in Malaysia. She has carried out policy research for local and international agencies. Local agencies include: Economic Planning Unit (Department of the Prime Minister), Ministry of Agriculture and Food Industry, Fisheries Development Authority, Federal Agricultural marketing Authority (FAMA), Ministry of Plantation Industry and Commodity (MPIC), National Paddy and Rice Authority (NPRA), Bank Rakyat, Ministry of Science, Technology and Information (MOSTI), BERNAS, Malaysian Palm Oil Board (MPOB) among others. The international agencies include: World Bank, FAO, ACIAR, ALARN/ICONE, IAEA, ICLARM, SEARCA, AFMA, TFNet and IDRC. PROFESSOR PAUL TENG (Ph.D., Hon. D.Sc., FAAET) Professor Teng is Adjunct Senior Fellow, Centre for Non-Traditional Security Studies, and concurrently Managing Director and Dean, NIE International Pte. Ltd., both entities of Nanyang Technological University Singapore. He is also Senior Adviser (AgriFood) to A*STAR Singapore, and additionally advises several agtech startups. Paul previously held leadership positions in the Worldfish Centre, the International Rice Research Institute, Monsanto Company and U.S. universities. Professor Paul Teng is internationally recognized for his expertise in tropical agrifood systems, sustainable rural transformation and food security, with a focus on smallholder cropping systems like rice-based ecosystems. He is also expert in AGTECH (Agricultural technology), Biotechnology applications in agriculture, Digitalization in agrifood systems, Smart/Precision farming and Integrated Pest Management. Additionally, Paul has started, divested, and is still involved in several agri-bio tech companies. He has researched and taught in North America, Africa, and Asia, and has published over fifteen books and over two hundred technical papers. Paul obtained his B.Agric. Sc (Hons) and Ph.D. from Lincoln College, University of Canterbury, NZ. Paul has been recognized for his work through the Eriksson Prize in Plant Pathology, election as Fellow of The World Academy of Sciences and other professional societies and conferred an Honorary D.Sc. from Murdoch University, Australia. PROFESSOR RAJEEV VARSHNEY (Ph.D.) Prof. Rajeev Varshney is an agricultural research scientist specializing in genomics and molecular breeding with 20+ years of service in international agriculture while working in India, Germany, Australia, Mexico and several countries in Africa. He is serving Murdoch University as a Director, Centre for Crop and Food Innovation; Director, State Agricultural Biotechnology Centre: and International Chair in Agriculture & Food Security with the Food Futures Institute. Prof. Varshney is a globally recognized leader for his work on genome sequencing, cataloguing and utilizing genetic diversity, genomics-assisted breeding, seed system and capacity building in developing countries. He has made centrally important contributions towards improving food and nutrition security in India and several countries in Africa and Asia by assembling genomes, developing genomic resources and integrating genomic technologies in crop improvement programs in many tropical crops, and delivering several superior crop varieties to some of the world’s poorest farmers. Prof. Varshney, a highly prolific author and Highly Cited Researcher for 8 consecutive years (2014-2021) in a row has published >500 papers in high impact factor journals including 20 papers in Nature journals. Based on his publications, he has h-Index of 111 with >50,000 citations. He is the only agricultural/plant scientist in India, and the second plant biologist in Australia to achieve an h-index of >100 as per Google Scholar. He is an elected fellow to about 10 science and agriculture academies/ societies in India, Germany, USA, etc. and recipient of several noted awards including the most coveted science award, Shanti Swarup Bhatnagar Prize, and the most prestigious agricultural science award, Rafi Ahmed Kidwai Award from Government of India. Recently ICRISAT won the 2021- Africa Food Prize for the outputs and impact of Tropical Legume projects, led by Prof Varshney as Principal Investigator for 7 years. PROFESSOR ANDY SALTER (Ph.D.) Prof. Andy Salter has worked at the University of Nottingham since 1984 and is based in the Division of Food, Nutrition and Dietetics in the School of Biosciences. He has worked extensively on the molecular mechanisms whereby diet impacts on lipid metabolism and metabolic disease, particularly cardiovascular disease. In parallel, he has developed a research portfolio looking at the sustainable production of healthy foods to meet the demands of the expanding and ageing global population. He is currently the Director of the University’s Future Food Beacon, which is an open research platform working across global food systems to help deliver sustainable food and nutritional security. This has provided funding for the Future Protein Platform which aims to evaluate novel systems for production of novel protein sources (plant, single cell organisms and insects), to assess their nutritional value and to develop their use as human foods and animal feeds. He is a Registered Nutritionist, has served as Elected Honorary Scientific Officer and Trustee of the Nutrition Society (2012-2018) and is currently a Trustee of the UK Academy of Nutrition Sciences. Emeritus Professor Dr. Phang Siew Moi FASc, FMBA (UK) Emeritus Prof. Dr. Siew-Moi Phang pioneered Applied Phycological Research in Malaysia. She co-founded the Asia-Pacific Society of Applied Phycology (APSAP) and served as its President, as well as President of the Asian-Pacific Phycological Association, Member of the International Phycological Society Board of Directors, and Overseas Vice-President of the British Phycological Society. She is a Fellow of the Academy of Sciences Malaysia (ASM); Fellow of the Marine Biological Association, UK; and Executive Committee Member, International Association for Biological Oceanography. She is the Founding Director, Institute of Ocean and Earth Sciences (IOES), University of Malaya, and led the IOES from 2003 – 2018. She joined the UCSI University in 2019 as Deputy Vice-Chancellor (Research & Postgraduate). Prof. Phang leads the Algal Research Group, which focusses on the applications of algae in food, biofuel, biomaterials and their role in environmental and climate management, which has active collaborations with international partners. She has received several awards, including the International Foundation for Science/King Baudouin Award; the University of Malaya Vice-Chancellor’s Lifetime Achievement Award for Publications, 2008; Outstanding Researcher Award (Distinguished Researcher), University of Malaya, 2017; Newton Prize 2017, British High Commission; and the ASM “Top Research Scientist Malaysia, 2012” Award. She has produced 276 papers in indexed journals, 17 books and 57 book chapters; awarded 9 patents with 8 filed; produced 32 PhDs and 70 Masters graduates. She is Associate Editor of the Journal of Applied Phycology; Maritime Technology & Research Journal; Geoscience Letters; Resource Person, Malaysia Biodiversity Information System (MyBIS) and Chair, ASM Committee on Blue Economy. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}