{
    "url": "https://www.nottingham.ac.uk/confucius/news/hubei-uk-tour-8-11-2024.aspx",
    "content": [
        {
            "p": "14/11/2024 Nearly 700 people gathered at the Albert Hall Conference Centre in Nottingham on Friday night to experience a mesmerising performance from the Hubei University Loong and Lion Art Troupe, hosted by the Nottingham Confucius Institute (NCI). The evening was a breathtaking display of culture and creativity. The show featured some awe-inspiring Loong (Dragon) and Lion dancing, along with spectacular martial arts displays, intricate choreography and powerful musical and vocal performances. Each act showcased the troupe’s dedication and extraordinary skill, captivating the audience with a vivid and authentic celebration of Chinese traditions. Honoured guests included Jason Feehily, Head of Trusted Research at the University of Nottingham; Karsten Stephan, Head of the Alderman White Confucius Classroom; Dr. Xue-Zhong Sun, Headmaster of Nottingham Chinese School; and Eva Vicente, Head of Modern Foreign Languages at Rushcliffe Spencer Academy. Many staff, students, and parents from the Nottingham Confucius Institute’s partner schools—Alderman White School, Nottingham Chinese School, Rushcliffe School, Middleton Primary, and St. Edmund Campion—also joined to enjoy this remarkable event. NCI is immensely proud that Nottingham was chosen as one of just three cities for the UK leg of the troupe’s tour. We very much look forward to hosting more high-quality events like this, creating more opportunities for the local community to experience the richness of Chinese arts and traditions. Event highlights are available on our Instagram here. It was truly a night to remember, filled with moments that will resonate long after the final curtain! ~ENDS~ Room A23, CI Library Si Yuan Building Jubilee Campus Nottingham, NG8 1BB telephone: +44 (0)115 748 4502 fax: +44 (0)115 846 6324 email: confucius.institute@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}