{
    "url": "https://www.nottingham.ac.uk/counselling/workshops-and-groups/groups.aspx",
    "content": [
        {
            "p": "Groups are run as counselling in a group setting, and meet regularly (weekly or monthly). Attendees get to know other group members and can benefit from support and understanding from other participants, as well as hearing different perspectives. Facilitators will offer information and exercises to enable this process and guide the group to help you get what you need. Facilitators are also there to help establish and maintain agreements on how the group will run. Useful coping strategies often come from attending a group, but this is usually achieved through a deepening understanding of yourself through contact with, and feedback from others, which informs what strategies might work best for you. To enrol in a group, you will need to have an individual appointment first and talk to the counsellor about the group you are interested in; they can then refer you if group counselling seems appropriate to your needs. The different groups the service runs are: - A six-week group led by male counsellors for male identifying students. This group offers a safe space to discuss social and emotional challenges associated with being male, or male identifying, in todays society. Each session has some short themed input, as a way of launching group discussion. These themes typically revolve around the messages we receive about what it means to be male, family and interpersonal dynamics, self-image, emotions, and adaptive/maladaptive coping. The group takes place in the summer term and will run in person. If you would like to attend this group, please email us for further information. Please note that students do not normally have individual ongoing counselling while attending a group. An six-week group for students which gives you a chance to talk about how you are coping. In the group you will have chance to see what you’re managing well, the things you’re struggling with and to connect with others who might understand. Groups like this offer the opportunity to share your thoughts and feelings and to get and give support and perspective. It’s a group to connect with yourself and others. The group runs twice per year in the autumn and spring semesters and is held in person. Facilitators offer input to the group to help members learn how they function in response to the challenges the world throws at us, and to see what changes you may want to make. Examples of themes that regularly arise in this group are: identity, self-esteem, anxiety, self-criticism, sexuality; relationships, friendships, family, mood, eating and unhealthy coping strategies. Please note that students are not eligible for individual ongoing counselling while attending this group. The group is intended to be a place where members can have regular, longer-term (between 1 and 3 terms) support and interaction with other students who want to discuss similar things. It’s a place to take time to reflect on important issues in your life (present or past), gain insight, support, and ideas about what is working and what’s not. It’s hoped that participants can do this by connecting more closely with themselves through personal reflection; and connecting with others, when members offer support, similar experiences, or different perspectives. This group offers the opportunity to take your time to settle and get to know the other members and build the safety you need to share important inner thoughts and feelings that might not get attention elsewhere. It’s also somewhere we can celebrate achievements, have some fun and build a sense of belonging. There is an emphasis is on providing a safe atmosphere in which to discuss important issues people are facing. Members can explore where their problems may originate from, how to deal with them, hopefully then feeling more confident about their ability to manage. And because this is a group, there is the sense of being in this together, a welcoming community. Each session will have some structure, possibly some input from the facilitators to initiate discussion and help group members to decide on a focus or themes. Examples of topics that regularly arise in groups like this are: identity, self-esteem, anxiety, self-criticism, sexuality, relationships, friendships, family, mood, eating, self-harm, exclusion/discrimination, abuse, suicidal thoughts and unhealthy coping strategies. No-one will be pushed to talk about any area if they do not wish to. The sessions are 1 ½ hours weekly and we ask people to make a commitment to come regularly. They will be in person at the university counselling service. This monthly support group for international student offers a safe space for you to talk with other international students who are likely to understand what it’s really like for you being at university a long way from ‘home’. The themes that have come up include: - changes in relationships with people at home and in the UK, the successes and worries about studies and coping, identity issues, practical issues such as appointments with doctors, where to find certain foods, cultural differences and adjusting to the British social language. Referral into the group is via one of our counsellors, a mental health advisor, a support and wellbeing officer or a chaplain. You would meet with the facilitator before being offered a place on the group. Currently this group is being offered in-person at University Park. This group runs weekly for eight weeks with the aim of creating a positive support network for students whilst on placement, involving coping mechanisms and strategies to maintain mental health and self-care whilst on placement. This group is specifically for issues around School of Medicine placements, specifically FFP students. These will include performance anxieties, self‑esteem, imposter syndrome, balancing work/life, possible trauma. This group begins before the students start placement so that they can reflect on and get support for the concerns and worries they have about the transition. It will also enable the group to become established before they begin the possible unsettling routine of moving accommodation and starting placement. This group will take place via MS Teams video call. The Orchards University Park Nottingham, NG7 2RD telephone: +44 (0)115 951 3695 email: counselling.service@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}