{
    "url": "https://www.nottingham.ac.uk/counselling/aboutus/counselling.aspx",
    "content": [
        {
            "p": "When you are experiencing problems it can be helpful to talk about them with someone else. You might turn to a friend or family member, but there are times when it can also be useful to talk to an impartial person such as a counsellor who is experienced in helping you to think about your difficulties when you are feeling stressed or distressed. We are a short-term, brief intervention University Counselling Service. Our appointments are offered on a one at a time basis. This means you have one appointment with your counsellor to identify the focus for the work, and then together decide if another session, or additional support, is appropriate for your situation. If a further appointment is agreed it will be scheduled for a time that works for both you and your counsellor. You are encouraged to reflect upon the content of each session, and if an additional appointment is not scheduled, to make contact again to request one when needed. On average our students access counselling for between 1-4 sessions with appointments usually being spaced to enable time for reflection between sessions. The Counselling Consultation offers you the opportunity to talk about concerns in a way that's different to talking to someone you are close to. A counsellor can help you get perspective on the situation, and it can feel easier to express yourself. Making an appointment to see a counsellor is a decision only you can make, even when someone has recommended it to you. The University Counselling service provides support for a wide range of emotional and psychological issues including: The University Counselling service is now a referral only service. To arrange an appointment with the counselling service, you will need to meet with a member of staff from one of the following services: Who is the best person to speak to? The support and wellbeing team are based locally in the schools and provide wellbeing support to students. The residential experience (ResX) team provide support to students living in university supported accommodation. The disability team provide support to disabled students. The support and report team provide support to students reporting incidents to the university. What happens next? The person who refers you to the Counselling Service will complete a referral form with you to provide the service with some information about you and the difficulties you are facing. Once we have received your registration form, you will either be contacted over the phone to book an apointment or offered access to our self-serve booking system. You can book your appointment through StudentLife by logging in, clicking on \"Browse our appointments\" under the MyWellbeing tile, and then choosing \"Counselling Service\". You will have the option to meet with a counsellor via Teams, over the telephone or in-person. In-person appointments take place on University Park or Sutton Bonington, so please choose the location that is most suitable for you. You will be able to see up to see and book up to a maximum of two weeks ahead. NB If you complete a registration form without first being referred, you will be redirected to meet with one of the above services, so that a counselling referral can be properly completed. At busy times of the year you may be placed on a waiting list. All our counsellors are committed to practising counselling in ways that are inclusive, accessible and affirming to students from all backgrounds, cultures, ethnicity, beliefs, sexualities, abilities, gender identities and socio-economies. The Service promotes and enhances inclusivity through ongoing training commitments. We invite you to feedback to us throughout your contact with our Service primarily, with your counsellor or our admin team. There might be a situation where this won't suit your needs howver, if you need to make a complaint, the Service will take action promptly and in line with the BACP Ethical Framework. The Counselling Service complaints procedure is designed to enable complaints to be listened to, responded to and to take action where it is decided that change or improvement is required. Where necessary appropriate concerns will be escalated to the appropriate organisational level. If you have a complaint regarding any aspects of the Service, or conduct of a member of UCS staff, please contact the Service directly. Book a consultation Find out about our team The Orchards University Park Nottingham, NG7 2RD telephone: +44 (0)115 951 3695 email: counselling.service@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}