{
    "url": "https://www.nottingham.ac.uk/currentstudents/study-abroad/global-opportunities/global-opportunities-by-faculty.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy The sections below contain the information you need to decide where to apply to study abroad and learn more about the study abroad opportunities offered by your school/department. The information is correct for students who are applying to study abroad during the 2025/2026 academic year. School/department academic advisers' details are correct at the time of publication but are subject to change. For information about tuition fees, available bursaries and other finance information, please visit the study abroad finance page. To find out more about studying abroad follow our Instagram or Facebook pages. Online activities and events will be held throughout the autumn term, details can be found on our events webpage and social media. The opportunities listed on these webpages are correct as at the time of publishing and for the application year 2024/2025. Please be aware that study abroad options may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities, travel restrictions or other circumstances outside of the University’s control. Every effort will be made to update this information as quickly as possible should a change occur. Please note that, in order to be accepted on to a study abroad programme, you have to achieve the relevant academic requirements as set by the University AND meet the selection criteria of both the University and the partner institution (though the partner institution is under no obligation to accept you). International Exchange Inter-campus Summer schools Global opportunities events Study abroad finance Volunteering and internships abroad"
        }
    ],
    "pdf_files": []
}