{
    "url": "https://www.nottingham.ac.uk/currentstudents/wellbeing/emergency-support.aspx",
    "content": [
        {
            "p": "On-Campus: In case of an emergency on campus, call the security emergency line on 0115 9518888. They will respond promptly and can facilitate access to additional emergency services if necessary. Off-Campus: If you are off-campus and require immediate assistance, call 999. If you are at risk but not in immediate danger, there are several avenues to seek help: On-Campus: If you are on campus, you can contact campus security control on 0115 951 3013 for assistance. University Supported Accommodation: Residents of university-supported accommodation can reach out to the ResX team on 0115 748 7600. Support and Wellbeing Services: For various support needs, including accessing mental health and counselling support if needed, you can make an appointment with the Support and Wellbeing team. If you are experiencing harassment or abuse and there is no immediate risk, you can: Report the incident through the university's reporting platform, Report & Support. The specialist team will review your report within one working day and contact you within five working days to provide support and discuss reporting options. Contact the police by ringing 101. For medical advice, you can: Call 111 for non-emergency medical assistance. Contact your General Practitioner (GP) and/or local Pharmacy. In addition to university services, you have access to other community mental health support options: You can visit your local A&E department at Queen's Medical Centre outside of GP opening hours or during the day if you have seriously harmed yourself and need immediate care. Please call 999 or security if you require assistance getting to A&E. This 24/7 helpline available on 0808 196 3779 is operated by local health workers who can connect you with the appropriate support. This service can also be accessed via calling 111. If you are close to experiencing, or currently experiencing a mental health crisis and need a safe space to talk, call 0115 844 1846. For 24/7 support, call Samaritans free on 116 123 or email jo@samaritans.org. If you're under 35 and struggling with suicidal feelings or concerned about a young person, call 0800 068 4141 (open 24 hours every day of the year), email: pat@papyrus-uk.org or text 07860 039 967."
        }
    ],
    "pdf_files": []
}