{
    "url": "https://www.nottingham.ac.uk/currentstudents/healthyu/alcoholdrugssmokingandaddiction/drugs.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy When it comes to drugs, it’s important to be aware of the facts so that you can make informed decisions about the choices you make. Think you, or someone you know, has a problem with drugs? Then it’s important to get the correct information and support. Many students will choose to avoid trying or using any type of drug, while others may want to try them. Whatever your attitude towards drugs, it's important that you are aware of the facts so that you can recognise the risks. The risks can concern personal safety and wellbeing, as well as the legal consequences involved. Tips for staying safe The best way to stay safe is to avoid drugs completely. Things to consider: Visit the Talk to FRANK website for a comprehensive list of drugs, including how it might affect you, the risks and the law. The New Psychoactive Substances Act means that it is now illegal to supply any 'legal highs' for human consumption. The changes in the law mean it's now an offence to sell or even give psychoactive substances to anyone for free, even to friends. Punishments range from a prohibition notice, which is a formal warning, to seven years in prison. If you're worried about drug use or would like to know more, you can get free confidential advice and information from: University Counselling Service 'The Orchards' (situated behind Law & Social Sciences Building on University Park). University Student Service Centres Go to your nearest Student Service Centre on campus for support and advice. Student’s Union Advice Service Provides impartial advice and information to students. B Floor, Portland Building, University Park. Nightline Nottingham Nightline is a student run, confidential listening and information service. Nightliners are on duty every night from 7pm - 8am during term time to listen to any problem you may have. Tel: 0115 951 4985 Int: 14985 (from UoN hall phones) Nottingham Recovery Network (NRN) NRN delivers a complete and confidential access, advice, support, treatment and recovery service in the heart of Nottingham. You can simply ring or drop in for advice and an assessment of your needs at either centre: Tel: 0800 0665362 The Place The Place provides a range of support services primarily for young people up to the age of 25 around drugs and alcohol. They work to reduce harm and promote positive change. The service is for young people who live in Nottingham and Nottinghamshire. You can make a referral here Change Grow Live (CGL) deliver an integrated drug and alcohol service in Nottinghamshire. Derby Drug and Alcohol Services - Information, advice and support for those affected by drugs and alcohol. telephone: +44 (0) 115 951 5151 fax: +44 (0) 115 951 3666 email: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}