{
    "url": "https://www.nottingham.ac.uk/currentstudents/studentsunion/index.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy “Our aim is to be where you, our students, are. We want to be right at the heart of student life, representing, supporting and involving all of you, when you need us.” The Students' Union is the recognised voice of student representation at the University of Nottingham. An independent charity - separate to the University - the Students’ Union creates positive change to improve students’ lives within the University through partnership working, lobbying, and campaigns. Any student who has something that they would like to see improved at the University can make their voice heard using the established structures and support processes within the Students’ Union – including course reps, committees, campaigning groups, elected Officers, and union policy. The University of Nottingham values the work of the Students’ Union and the representation it provides is highly influential in the decision making of all aspects of the institution. The elected Officers of the Students’ Union sit on every major decision-making body that runs the University, including the University Council, University Executive Board Committees and working groups on every aspect of teaching, learning and the student experience. The Students’ Union is never afraid to challenge the University where they believe students want something changed and works to empower students so that they can make their points positively, respectfully and with impact to effect real change. More details about how to engage with the Students’ Union to raise an issue can be found at: https://su.nottingham.ac.uk/make-change The Union offers over 300 clubs and societies, volunteering opportunities, a student magazine (Impact), TV station (NSTV), and radio station (URN) for you to get involved with, so you can be assured that there is something for everyone to enjoy. There is also support available for financial, welfare and course-related issues, should you need it. Please contact the Student Union Advice Centre for independent advice and support. The Students' Union is here to ensure you have the most incredible time at the University of Nottingham. Communications and Marketing University Park Campus Nottingham, NG7 2RD telephone:+44 (0)115 82 32353 e: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}