{
    "url": "https://www.nottingham.ac.uk/currentstudents/mature-students/mature-students.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Mature students are an important part of our community at the University of Nottingham, making up 10% of our student population. The skills, motivation and life experience they bring is valued across our communities. Being a mature student can give you an advantage at university, but we understand it can also be a big decision to return to study. Luckily, there is plenty of support on offer for anyone who is over the age of 21 when enrolling on an undergraduate course, and to help students returning to education after a long break. On this page you'll find all of the support and resources that have been specifically designed for mature students, but don't forget that it doesn't have to have a 'mature students' label on it for you to use it. Whether it's disability support, academic skills or career and employability services, you have access to the same opportunities as any other student. If you're a postgraduate mature student (over the age of 24) make sure you visit our postgraduate pages as well. Mature student Katie shares what it's like to be a mature student at the University of Nottingham. Each faculty offers its own tailored support to mature students. Click on the faculty that your school/department belongs to below, to find out what support is available for you. The Faculty of Arts sends dedicated email communications to support mature students throughout the academic year. If you’re not receiving these communications and would like to, please let us know. The faculty also organises faculty-wide mature student socials. To find out more about these, or to suggest other ways we could support mature students, please email us. For additional information about how the Education and Student Experience Team supports students, please read your weekly departmental bulletin and check your Moodle community hub. Mature students are an important part of the community in the Faculty of Medicine and Health Sciences. Our school-based teams host events and resources to support mature students, creating a unique learning community between staff and students to enhance the student experience. To find out more about the events or resources, or to suggest other ways we could support mature students, please contact your school using the relevant email below. We want to help every student feel like they belong within the Faculty of Science and strive to create an excellent learning experience for everyone. Our school-based teams want to keep supporting mature students in ways that are important to them, so if you have any suggestions or ideas please contact your school using the relevant email below. Mature students are an important part of the community in the Faculty of Social Sciences. Our school-based teams provide information and resources to support mature students, creating a unique learning community between staff and students to enhance the student experience. To find out more, or to suggest other ways we could support mature students, please contact your school using the relevant email below. Not commenced your studies yet but want to know what support is available in helping you prepare for university? Visit the pages below, which include lots of useful information and support, including our Ambition Nottingham: Access programme (which provides information about university and what it's like to study as a mature student) and KickStart (our two-day induction programme for mature students). Communications and Marketing University Park Campus Nottingham, NG7 2RD telephone:+44 (0)115 82 32353 e: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}