{
    "url": "https://www.nottingham.ac.uk/currentstudents/wellbeing/wellbeing-services.aspx",
    "content": [
        {
            "p": "The Wellbeing Service is made up of a number of teams who work closely together to best support you. The route of entry/first step of support for students struggling or needing support is the Support and Wellbeing Service. The Support and Wellbeing team is here to help you. Our Officers work alongside your personal tutor, or Here For You Guides, and supervisor and other university support services. We encourage a healthy approach to your studies and provide practical advice, help and support on a wide range of issues. We can help you to find the right support service if you are unsure where to go. We also offer advice on policies and processes relating to your studies such as extenuating circumstances or interruption of studies. The Support and Wellbeing team offer in-person or virtual appointments Monday to Friday, 9am to 4pm, through the StudentLife platform. Book an appointment through StudentLife Our Specialist Wellbeing Services are here to support you when your emotional and psychological needs are more complex. We are a referral only service consisting of two specialist departments: The Counselling Service provides a year-round service for all students. The team comprises of qualified counsellors who are experienced in supporting university students. We offer a range of services including groups and workshops and individual, short term, brief intervention counselling. Your counsellor will help you to reflect on your situation and to think about your needs and possible choices. The counselling consultation offers you the opportunity to talk about concerns in a way that's different to talking to someone you are close to. A counsellor can help you get perspective on the situation, and it can feel easier to express yourself. On average, our students access counselling for between 1-4 sessions with appointments usually being spaced to enable time for reflection between sessions. The Mental Health Advisory Service is there for students experiencing significant mental health difficulties. Mental Health Advisors have core professional training (Social Work, Occupational Therapy, Community Psychiatric Nursing, Psychology) and have significant experience working in NHS secondary mental health services. Using a recovery model, the team works closely with the university and external services to support students to develop strategies which maximise their university experience. Our HealthyU programme can help support you to stay healthy whilst at university, helping you make the most of your university experience. Find out about campaigns, events, and resources on a range of wellbeing issues on our HealthyU webpages. The Health Improvement Team run initiatives including the HealthyU programme. We aim to support students to adopt and sustain a healthy lifestyle at university and beyond. The University of Nottingham is committed to ensuring we do everything we can to provide a safe and supportive environment for everyone. Our campuses are a pleasant and inclusive place to study and work but, as with any community, issues can arise. If you or someone you know has experienced or witnessed an incident (for example harassment, abuse or hate crime), you can tell us anonymously or ask to speak to an advisor. Speaking to an advisor does not mean that you are making a formal report to the university, it is to enable you to access the support you need to make an informed decision. To learn more about our service, or to make a report visit our Report & Support pages We provide pro-active information about how you can take care of your mental health and information about specialist services you can access if you feel you are struggling. More information"
        }
    ],
    "pdf_files": []
}