{
    "url": "https://www.nottingham.edu.my/CurrentStudents/StudentRegistry/Examinations/Overseas-Examinations-Arrangement/index.aspx",
    "content": [
        {
            "p": "Overseas exam arrangements are only made for students: In cases where the candidate is not an overseas resident, arrangements will not be made unless the circumstances and reasons have been discussed with the International Office and/ or School/ Department. Please note: overseas exam arrangements will not be made for students who are on holiday or temporarily overseas during the published examination periods. Kindly refer to the respective Academic Calendar dates for the exam sessions. YOU MUST APPLY ONLINE FOR EACH EXAM PERIOD YOU WILL BE WANTING TO SIT OVERSEAS. COMPLETING AN APPLICATION FORM ONLY ENTITLES YOU TO APPLY FOR NEXT SCHEDULED EXAM PERIOD. Telephone: + 603 8924 8751 Email: Exams@nottingham.edu.my Incoming exchange students studying in Malaysia for the Autumn Semester are expected to sit the normal assessment relating to the modules to which they are signed up for. In exceptional circumstances exchange students may apply to the School/ Department to arrange an alternative form of assessment. Where this is not possible, the student must return to Malaysia to complete the assessment. Only where the start date of the home university semester is before the end of the Malaysia's exam period; may a student apply to take their examination overseas. Schools should not advise students that they may sit overseas at this stage – for incoming students this is only possible if the student has been given permission to sit overseas as part of an exchange agreement with his/her home institution. Please refer here if you want to pay for the overseas examination fee. You will be required to pay the full amount even if you do not continue with the overseas resit examination. Any local costs must be paid directly to your chosen institution. Some modules are not permitted to be taken overseas especially computer based exams. If permission is required for any of your modules, contact the administering School/ Department office for approval. For the Overseas Exams Application Dates please email to exams@nottingham.edu.my The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia telephone: +6 (03) 8924 8663 email: student_registry@nottingham.edu.my"
        }
    ],
    "pdf_files": [
        "pdf_files/Updated-Final-Examinations-TimeTable-for-Spring-2024-30-April-2024.pdf",
        "pdf_files/Notice-of-Changes-in-Timetable-Spring-2024-30-Apr-2024.pdf",
        "pdf_files/Examination-Guideline-for-Students-2022-2023.pdf",
        "pdf_files/FAQ-Reassessment-Examination-Overseas.pdf",
        "pdf_files/Checklist-for-AEA-overseas-exams.pdf",
        "pdf_files/approved-overseas-institutions-2024-2.pdf"
    ]
}