{
    "url": "https://www.nottingham.ac.uk/currentstudents/study-support/study-support.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy When you need some advice and support, the university are here to help. We are keen to support our students so you can thrive and succeed. With diverse student needs in mind, we offer a range of support that you can access. There are plenty of options offered by the: Options range from one-off sessions to semester-length courses, subject-specific courses and one-to-one support. You can choose what suits you best. The ALACS team has been supporting students at the university for over 30 years. We offer a wide range of in-depth, practice-based courses on vital skills, including writing successful assignments and dissertations, criticality, academic integrity, understanding feedback, effective presentation and discussion skills, and courses to develop important language skills such as grammar, vocabulary, pronunciation or social conversation - all delivered by experienced and qualified tutors. We also offer subject-specific courses rooted in thorough research on what you need to succeed in your studies. For individual support to suit your needs, you can book our very popular consultations. We are here for you year-round from registration until graduation. Based in Libraries, the Learning Development Team provides support for all students at the university. We work with you throughout your academic journey by helping you find your resources, read them critically, and then transfer that understanding into expressing criticality and argument in your writing, presentations, and reflections. In addition to academic skills, we also support study skills such as time management, note making, revision strategies, referencing, and digital literacy. You can access our online resources 24 hours a day, join our regular programme of webinars, or, if you need tailored support, book a 1-2-1 session with one of our learning development consultants or librarians. The Researcher Academy is the network for researchers, and staff who support them, at the University of Nottingham. We provide specialist researcher training courses exclusively for postgraduate research students and early career researchers. We deliver a range of online and in-person courses that connect researchers with the skills they need to take their specialism to the world. The central programme is for researchers from all disciplines, while the Faculty and Doctoral Training Programmes offer courses tailored for researchers in particular faculties or disciplines. You can access these short courses and other resources on our Training Hub. Communications and Marketing University Park Campus Nottingham, NG7 2RD telephone:+44 (0)115 82 32353 e: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}