{
    "url": "https://www.nottingham.edu.my/CurrentStudents/StudentRegistry/Attendance-and-Engagement/Attendance-Monitoring-Procedure-at-UNM.aspx",
    "content": [
        {
            "p": "This procedure is part of the University of Nottingham Malaysia’s Supplementary Policy on Attendance and Engagement, which should be read in conjunction with this document. This procedure is applicable to study within the 2023/2024 academic session and beyond. Decisions regarding non-attendance are made by Schools/Departments. This procedure should only be used to address a student’s absence from compulsory teaching activity such as classes, and supervision meetings or other activity that are required by the School or the University for the pursuit of their studies no covered under other procedures. Absence Requests outlined in this procedure should not be used as a substitute for Extenuating Circumstances (EC) claims or to cover parameters under the EC procedure: this includes absence from an examination/assessment or non-submission of coursework and requests for extensions to deadlines for submission of written assignments. However, approved EC claims and evidence may be used in place of an absence request. Therefore, there would be no need to file an absence request if an approved EC claim evidence already covers the period of absence. Evidence presented for both planned and unplanned absences must meet be acceptable and meet the standards set under the guidance on Acceptable Circumstances and Evidence in the university EC regulation. (I)Below is the attendance monitoring for all students EXCEPT Foundation April Semester/3rd Semester of FDN 3 semesters: 1. In Week 4, students whose overall attendance rate is under 80% will receive an invitation for AIM meeting. Students should meet up with their tutor within a week from the day they received the invitation AIM Meeting. 2. Where the School does not receive a satisfactory explanation for absence, or student does not attend the AIM, the school/department should proceed sending a Notification of Absence to the student and explain the implications for not meeting the overall attendance rate of 80%. 3. The above monitoring process (No.1 and 2) will repeat in Week 5 for new identified students whose overall attendance rate is under 80%. 4. In Week 7, students whose overall attendance is below 77% will need to interrupt their study. Student will receive email notification to interrupt study. 5. In Week 7, students with overall attendance 77% and above which considered as borderline percentage to 80%. These students will be given opportunity to improve their attendance until week 11. a) They will receive an invitation for AIM meeting. Students should meet up with their tutor within a week from the day they received the invitation for AIM Meeting. b) If in week 11, their overall attendance rate is still under 80%, they will be required to interrupt their study. Student will receive email notification to interrupt study. 6. In Week 8 and Week 9, students whose overall attendance is below 78% will need to interrupt their study. Student will receive email notification to interrupt study. (*this excluded students that have already identified in No. 4 and 5 above) 7. In Week 8 and Week 9, students with overall attendance 78% and above which considered as borderline percentage to 80%. These students will be given opportunity to improve their attendance until week 11. (*this excluded students that have already identified in No.4 and 5 above)a) They will receive an invitation for AIM meeting. Students should meet up with their tutor within a week from the day they received the invitation for AIM Meeting.b) If in week 11, their overall attendance rate is still under 80%, they will be required to interrupt their study. Student will receive email notification to interrupt study. 8. From Week 10 until Week 12, any students overall attendance is below 80% students will need to interrupt their study. Student will receive email notification to interrupt study. (*this excluded students that have already identified in No. 4-7). Student will receive email notification to interrupt study. (II) Below is the attendance monitoring for all students in April Semester / 3rd Semester of FDN 3 semesters: 1. In Week 3, students whose overall attendance rate is under 80% will receive an invitation for AIM meeting. Students should meet up with their tutor within a week from the day they received the invitation AIM Meeting. 3. In Week 6 and 7, students whose overall attendance is below 78% will need to interrupt their study. Student will receive email notification to interrupt study. 4. In Week 6 and 7, students with overall attendance 78% and above which considered as borderline percentage to 80%. These students will be given opportunity to improve their attendance until week 9. b) If in week 9, their overall attendance rate is still under 80%, they will be required to interrupt their study. Student will receive email notification to interrupt study. 5. From Week 8 until Week 10, any students overall attendance is below 80% students will need to interrupt their study. Student will receive email notification to interrupt study. (*this exclude students that have already identified in No. 3-4). Student will receive email notification to interrupt study. *Student who didn’t put in interruption as they should, school could submit a case to QSC for university to interruption their study. The QSC case need to submit to Registry Office for further process. The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia telephone: +6 (03) 8924 8663 email: student_registry@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}