{
    "url": "https://www.nottingham.edu.my/CurrentStudents/Facilities/amenities.aspx",
    "content": [
        {
            "p": "The following is the F&B and Retail Services arrangement effective in September 2023 onwards. F&B stalls Weekdays (Mon-Fri) Weekend (Sat) Weekend (Sun) Block H (Bistro 1) – Indian Muslim (Mamak) 8.00am – 10.00pm Block H (Bistro 2) – Coffee & Pastry 8.30am – 6.00pm Closed Block H (Bistro 3) – Malay Fusion (Zafa Café) 8.00am – 6.00pm 9.00am – 3.00pm Block H1 – Western 10.30am – 9.00pm Block H1 – Japanese Block H1 – Arabic 10.00am – 9.00pm Block H1 – Thai 11.30am – 9.00pm Block H1 – Indian 11.00am – 8.00pm Block H1 – Yummi & Dim Sum 10.00am – 8.00pm Block H1 – Chicken Rice & Noodles 9.00am – 8.00pm Block H1 – Chinese 9.00am – 9.00pm Block H1 – Vegan Block H1 – Beverage Coming soon Block H1 – All Day Breakfast 7.30am – 8.00pm Block H1 – John’s Pie 9.00am – 8.30pm Block H – ZUS Coffee Please do not hesitate to email us if you have any queries at campus.services@nottingham.edu.my. 1 Retail Outlets Block H – 7 Café - Convenience Store 24 hours Block H – MyNews - Convenience Store 7.00am – 11.00pm Block H – Mobile Phone/Electronic outlet 10.00am – 5.00pm Block H – On Campus Clinic 8.30am – 5.00pm 9.00am – 1.00pm Block H – Affin Bank ATM Machine Block H – Affin Bank Helpdesk Tuesday & Thursday only 11.00am – 2.00pm This outlet is manned and operated by students selling academic and educational materials including stationery and University souvenirs, ranging from pens to our Nottingham t-shirts and hoodies. The Students' Association Building, located at block H and H1, has two student meeting rooms, two television rooms with Astro provided, pool and foosball tables, and reading areas. There are also music, computer, games room and a dance studio for your utilisation. Automated tellar machines (ATM's) will also be located here. The Great Hall is located in the Trent Building (Block A). Students may use this venue for events and functions. Bookings can be made through the Student Association Manager. The Amphitheatre and the Academic Plaza provide alfresco spaces suitable for outdoor events, concerts, recitals and performances. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}