{
    "url": "https://www.nottingham.edu.my/CurrentStudents/StudentRegistry/Registration/Central-Administration-Services.aspx",
    "content": [
        {
            "p": "New student at UNM? We can help you find the right information and support if you are unsure where to go for help. Information for students living in on-campus accommodation. Attendance monitoring policy and procedures at UNM. Careers services, resources, guidance and opportunities to become more employable. Information about tuition fees and scholarships. Information for new postgraduate students. Information for all new international students. Information about IT account, Wi-Fi, University email, Printing, Moodle, and other tools to support learning. Opening hours, NUsearch for books, e-books, journals, e-journals, articles, databases and other related information. The portal for applicants and students to access services and data. The University provided a wide range of amenities and recreational enhancements to improve the quality of life on campus. Services available to student includes student ID card collection and vehicle sticker application. New students can collect their student ID cards, when they return to the campus, from the Security Office located at Block H, Level 1. Information on online induction, request of student confirmation letters, provisional transcripts and other related services. One stop centre that provides various non-academic student support services. Information on Students’ Association Executive members, online induction programme and students related activities. Information regarding semester dates, exam dates and other key dates for the academic year. Information for all international students about visa and immigration. Information about wellbeing services that available online.The services available are counselling services, mental health advisory services and disability advisory services. The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia telephone: +6 (03) 8924 8663 email: student_registry@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}