{
    "url": "http://www.nottingham.edu.my/CurrentStudents/Your-voice/Academic-feedback/Student-Charter/Student-Association.aspx",
    "content": [
        {
            "p": "Here is a list of what you can expect from us in the areas of: The opportunity for you to actively participate on a range of important University committees to help you be part of the on-going improvement of all aspects of your University. Read more . . . Support and training for Course Representatives who represent you at meetings with academic staff. Engagement with the University at all levels, through the Student Association Education Network in order to enhance your academic experience. Student involvement in the recognition and reward of staff excellence. The collation of feedback from our students about their learning environment, learning facilities and working with the university to develop these resources. Impartial and confidential advice on issues such as housing, finance and academic appeals. Read more . . . Conduct surveys to receive student feedback on welfare related issues and develop proactive campaigns based on the needs identified. Investment in, and training for all of our student groups; welfare representatives and information to ensure your peers are best equipped to signpost you to the appropriate Association and University services. Advice on applying for Student Hardship funding and other assistance and advice with debt problems. Read more . . . Advice on available employment opportunities to support students financially through their studies. Representational Networks to improve the support for, and representation of, all students. Read more . . . The promotion of diversity, acceptable norms of behaviour and respect across all of our activities. A range of opportunities and events that are inclusive and reflective of the diversity of our student body. That we will promote the notion that representational networks and student groups should be welcoming of all students and free from discriminative practices as outlined by the Student Association Constitution Opportunities for you to learn and develop a diverse range of new skills through our student groups and networks. Read more . . . Opportunities to gain positions of responsibility in all aspects of the Students’ Association. Careers-related events organised by student groups and specific to your interests. Recognition for your time and involvement with the Students’ Association. Opportunities to volunteer in a variety of roles through the activities of the SA Societies. An active and exciting student community both on and off campus. Read more . . . Advice on the process; mediation with your school, attendance at informal meetings aimed at early resolution; help preparing written complaints at all levels throughout the University's internal processes as well as to the Office of the Independent Adjudicator externally. Read more . . . telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}