{
    "url": "https://www.nottingham.edu.my/CurrentStudents/StudentRegistry/Examinations/Overseas-Examinations-Arrangement/How-to-apply-for-overseas-examinations.aspx",
    "content": [
        {
            "p": "Do not wait until you receive official notification via the Portal or an official letter from the University before applying to sit overseas. As soon as your School informs you of your results, you must start making the arrangements. YOU MUST APPLY ONLINE FOR EACH EXAM PERIOD YOU WILL BE WANTING TO SIT OVERSEAS. COMPLETING AN APPLICATION FORM ONLY ENTITLES YOU TO APPLY FOR NEXT SCHEDULED EXAM PERIOD. You must follow steps 1-3 before completing the application form. STEP 1 Check to see if your modules can or cannot be taken overseas and what permission you need to obtain. Some modules may require permission. If permission is required for any of your modules, contact the administering School/ Department office for approval. You must have permission for EACH MODULE you wish to take so this may involve contacting more than one School/ Department. You will need to tell us the names of the staff members who have given you permission when completing the application form. If any of your modules cannot be taken overseas or you have not received the correct permissions, your application could be refused and you would have to take your exams in Malaysia campus. STEP 2 Contact an approved institution to ask if they are able to facilitate your exams. It is your responsibility to do this. If they need to contact the University, please ask them to contact the Exams Office. Please note: If there is not an approved institution in a reasonable distance to you, please contact the Exams Office immediately. They may have been removed due to poor performance in the previous exam period. We may not be able to add some institutions back on to our list so you may have to be prepared to travel. Institutions may ask for the Exams Office to contact them before you apply. We cannot make contact with the overseas institutions so please tell them we will make contact once the application deadline has passed. STEP 3 To apply please contact us via exams@nottingham.edu.my. Please refer to the deadline here. No late applications will be accepted. If you decide to return to Malaysia to sit your examination, you will need to email Exams Office to cancel your arrangements no later than 10 days prior to the first day of the exam period. If you do not inform the Exams Office you will still be required to pay the full overseas examination fee of RM300.00 and any local fees by the institutions. The results will be released via Blue Castle. We will notify students via University email. Please kindly ensure your University email is active to receive further updates from us. The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia telephone: +6 (03) 8924 8663 email: student_registry@nottingham.edu.my"
        }
    ],
    "pdf_files": [
        "pdf_files/approved-overseas-institutions-1920.pdf",
        "pdf_files/Autumn-2018-Final-Examinations-TimeTable-12-Dec-2017.pdf",
        "pdf_files/Overseas-Institutions-2023.xlsx.pdf"
    ]
}