{
    "url": "https://www.nottingham.ac.uk/currentstudents/news/are-you-up-to-date-with-your-vaccinations",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy The NHS offers free routine vaccinations, so make sure you're up to date. If you're not sure on your vaccination history, speak check with your GP practice to make sure you are up to date with any of the following routine vaccines: Make sure you're familiar with the following symptoms so that you know what to look out for. If you, or someone you know, presents with any of these symptoms, please contact NHS 111 or your doctor. In a medical emergency, call 999. Mumps Mumps is a contagious viral infection that can cause painful symptoms. Mumps is usually recognised by the painful swellings at the side of the face under the ears. However more general symptoms often develop a few days before the face swells. These can include: The best way to protect against mumps is have two doses of the MMR vaccine. It is never too late to get the vaccine and there are no risks to health if an extra dose is given. Anyone with symptoms should stay away from others and remain at home until 5 days after the swelling started. If you are worried about any symptoms, contact NHS 111 or your doctor. In a medical emergency telephone 999. Measles Measles is very infectious, it can cause serious complications and, in rare cases, can be fatal. Measles can be more severe in young people and adults, often leading to hospital admissions. Measles starts with cold-like symptoms and sore red eyes followed by a high temperature and a red-brown blotchy rash. If you experience these symptoms, call NHS 111. Meningococcal disease Meningitis and septicaemia can develop suddenly and progress very quickly resulting in life changing disabilities and ongoing health problems. Meningococcal disease can be difficult to diagnose because it can be confused with other infections. Symptoms of meningitis and septicaemia include: Symptoms vary and can occur in any order, and not everyone gets every symptom. The MenACWY vaccine is available free to any student who has not already had the vaccine up until their 25th birthday, including international students. Reducing the spread of infection Here are some simple ways to reduce the spread of infection: NHS guidance strongly advises patients to register with a practice close to where you spend most of the year, which will be your university address. As a student you can register at the University of Nottingham Health Service on University Park campus. There you can access NHS primary care and GP services, including vaccinations. Communications and Marketing University Park Campus Nottingham, NG7 2RD telephone:+44 (0)115 82 32353 e: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}