{
    "url": "https://www.nottingham.ac.uk/currentstudents/study-abroad/international-summer-schools/international-summer-schools.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Undergraduate University of Nottingham students have the opportunity to apply for an international summer school to study taught courses offered by one of our partner universities. International summer schools usually range from one to six weeks in duration. As these programmes are offered during holiday periods, credits are not transferred back to Nottingham and in most cases you are free to study whatever is of interest to you. Available programmes vary from year to year, however we traditionally offer a range of summer schools across East and Southeast Asia, Europe and Latin America. The International Summer Schools application for summer 2024 is now closed. International summer schools offered in summer 2025, will be available to view on the webpage in late January 2025. Summer Schools FAQs Global opportunities events Find us on Facebook Follow us on Instagram We offer summer schools opportunities from partner universities in the following regions. Subject areas vary depending on each summer school, please see the individual partner university profiles for further information about each summer school offered in 2024. Summer school opportunities from partner universities in Hong Kong, China; Singapore and South Korea. Summer school opportunities from partner universities in Denmark, France, Germany, Sweden and Switzerland Summer school opportunities in Brazil The summer schools application is competitive and open to all undergraduate students. For some programmes, priority will be given to students from the relevant school as confirmed in the summer school details. Students will be assessed on the following criteria: Priority will be given to students who have not previously studied abroad, or who are not due to study abroad within their degree programme at Nottingham; students who are not in their final year and who do not have resit examinations unless otherwise stated. However students not in these categories are still eligible to apply and their applications will be considered. Students applying for a summer school hosted in a country, in which the applicant holds citizenship and permanent residence, will be de-prioritised. The minimum academic mark required to be considered for a summer school is 45%, however some of our summer school destinations do have higher minimum academic mark requirements. Students must be in good academic standing at the time of their application, students who have completed modules which show a fail mark for the current academic year at the time of application without approved extenuating circumstances or are currently in resit will not be considered. Some partner universities require students to have subject-specific knowledge in order to participate in a summer school course, please read the course requirements thoroughly on the partner university summer school webpages. As our summer schools and short-term programmes take place during holiday periods, any credits you gain from a summer school programme do not count towards your Nottingham degree programme. This gives you the freedom to study subjects that are not normally available to you. A variety of subjects can be studied at our partner university summer schools including business, economics and languages. Successful applicants who are nominated to either an online or in-person summer school at one of our partner universities do not pay tuition fees to the partner university unless otherwise stated. Tuition fees are payable for summer schools outside of the University of Nottingham's scheme and for students who apply independently. Some in-person summer school tuition fees includes additional items such as accommodation, it will state on the summer school profile page for each university what is included in tuition and which fees are waived. Unless otherwise stated, students are responsible for paying accommodation, flights, visa (if required), travel and health insurance and spending money. Financial travel support is available for in-person summer schools, please visit the partner university profiles and the Summer Schools FAQs webpage and individual partner university profiles for further information. Please be aware that Turing funding is not guaranteed. For full details of the anticipated costs associated with studying at a summer school please see the individual partner university profiles. Think Pacific offers 4-week international volunteering and internship opportunities in Fiji and Bali, Indonesia. Turing funding is available to students who meet the eligibility criteria, for further information, visit the Think Pacific profile page below. Applications for summer 2025 will open during the autumn semester, keep an eye on this webpage for updates. Universität Tübingen: Tü-VIP offer free 10-week online short courses starting in October and February each year; each course is one class per week, which can be studied alongside your degree course. Applications for October 2024 are open now, submit your application directly to Universität Tübingen as soon as possible. Free, 10-week online short courses starting in October and February each year. Volunteering and internship opportunities in Fiji and Bali, Indonesia There are a lot of advantages to participating in either an in-person or an online summer school. Some of the key benefits include: In-person summer schools: Online short courses: There are time-differences to consider and some programmes require participation in the partner university country's local time or include in-class assessments, therefore you must read the partner university information to check you are able to participate before applying for a programme. Study abroad finance Study abroad disability information LGBTQ+: Stonewall Global Workplace Briefings Careers and Employability Service: Internships abroad If you have any questions about international summer schools, please contact the Global Opportunities team."
        }
    ],
    "pdf_files": []
}