{
    "url": "https://www.nottingham.ac.uk/currentstudents/study-abroad/study-abroad-student-experience.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Featuring students who either spent a semester or full year on exchange or attended a summer school in the last couple of years, the student experiences below give you an idea of what studying abroad is really like from students who have done it themselves. Find out what the challenges are, the opportunities they had while away and how the experience benefitted them. I chose to study in Australia because I wanted to experience its unique culture and see all of the country’s natural wonders. Being alone in a country so far away from home meant that I had to go out of my comfort zone to meet people. Studying abroad allowed me to develop the ability to interact with a diverse group of people which is a skill that I will always be able to use in future education and careers. The people I have met and the beautiful places I have visited made this experience the best year of my life. Due to my love of travel I always knew I wanted to study abroad and so applied for a degree with a mandatory year abroad. While overseas all of my travel took place during the academic year, developing my time management skills considerably. I had to plan around weekends, national holidays, vacation periods and lectures to efficiently optimise my time and visit the maximum number of countries. These skills have proved essential for my third year as I have managed to balance two jobs, society commitments, volunteering and my studies. This may not have been possible without the experience of juggling my obligations and passions during my year abroad. My decision to study abroad was without a doubt one of the best decisions I have ever made, and I am confident the skills, experiences and friendships I obtained in Malaysia will last a lifetime. I chose to study at HKU in Hong Kong to challenge myself and experience life outside the western world. The idea of studying abroad wasn’t something I had previously thought of, but I quickly saw it as an opportunity to broaden my horizons and grow as a person. I think being out of your comfort zone is an excellent way to build independence, social skills and is just an all-round character building experience. The study abroad programme requires a lot of planning before embarking on your journey. The experience is all about doing new things and learning along the way. I enrolled in the UZH International Summer School programme, in Switzerland, because I wanted to study something completely left-field from my degree. The summer school allowed me to explore subjects such as sociology, history and economics – normally beyond my reach due to my life sciences background. Studying abroad has demonstrated to employers that I am willing and able to cope with change as well as giving me the opportunity to discover new interests. I immersed myself in the Swiss way of life: including the many languages and gastronomy. It was a once in a lifetime opportunity to share these exciting moments with students from across the globe."
        }
    ],
    "pdf_files": []
}