{
    "url": "https://www.nottingham.edu.my/CurrentStudents/Nottingham-Advantage-Award/Modules/Online-Language-Learning-Exchange.aspx",
    "content": [
        {
            "p": "OLLE is the short name for the Peer Supported Online Language Learning Exchange – at UNNC it is a very special NAA – for one thing it was the first NAA here to be designed in partnership with students and for the past two years it has continued to be managed and delivered with student partners. The Vis-à-vis student organisation plays a huge contribution to student life and experience at UNNC as it supports buddying coaching and peer learning and makes a big contribution to OLLE. OLLE is about learning to learn together beyond linguistic, cultural and geographical barriers. With OLLE students from UNUK, UNMC and UNNC learn to learn a language together online. The focus of OLLE is on developing a strong set of language learning strategies for life – learning to make use of the exciting opportunities and resources to learn a language online and with a wide range of digital tools. Mostly OLLE is about empowering yourselves to take control of your language learning and to discover new ways of learning what you like how you like it and as you learn to learn together, it is also a very good way to make new friends near and far. Transform your language learning and unlock the gates to global future opportunities, join OLLE and be part of its global community of learners. “I really enjoyed this experience and I would definitely recommend this module to my other friends. I think it’s a great opportunity not only to meet new people and learn about new cultures, but also to challenge yourself, to go out and find tools to learn or practice a language. Although I really love learning new languages, I have always been taught in a classroom, so it was a bit of a challenge to have to do this through a computer. Nonetheless, I feel like it has helped me improve both my French and my Mandarin, and now I have the motivation and confidence I was lacking to learn by myself.” OLLE is a tri campus NAA you too can join. To apply for this module, kindly fill in the online application. The deadline for applications for students at UNUK and UNMC is on 7 October 2016, Friday. OLLE will start on 3 October 2016, Thursday. You can contact Marion Sadoux for more information on this module. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}