{
    "url": "https://www.nottingham.ac.uk/currentstudents/wellbeing/healthyu/alcoholdrugssmokingandaddiction/gambling.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Online gambling activities like bingo, poker, betting, or more specific types of gambling, have seen a huge increase in popularity as access is now easily available. Gambling addiction is when you experience an impulse to gamble, regardless of the consequences. You know the odds are against you but you just can’t stop. However, gambling doesn’t have to be an addiction to impact negatively on your life. One of the most common results of a gambling addiction or gambling problems is loss of money and debt, but it can also leave you isolated and impact on your relationships and mental health. Debt due to gambling (or any other addiction) can cause or heighten feelings of shame and guilt, which may make it harder to seek help, but it’s important to get advice if it is causing severe financial hardship. Changing your gambling behaviour can be difficult especially if gambling has become a key part of your life. However, there are some practical steps that you can take to start to address the issue. Places you can visit for support: Gamcare NHS Gambling Addiction Self-exclusion is a way to limit the amount of online gambling you're able to do by asking the gambling provider to exclude you from gambling for a specified time. Find further details about self-exclusion here. To self-exclude go to Gamstop Online, a free, independent self-exclusion scheme for people with online gambling problems. You can also install software onto your phone to block certain websites using gamban, the current price for a single user is £24.99 per year. General Practitioner (GP, Doctor) Cripps Health Centre: 0115 846 8888 Support and Wellbeing Contact Support and Wellbeing for support. Students Union Advice Students’ Union Advice can help students with information, advice and representation around all aspects of student welfare and education, such as financial, housing and course issues. 0115 846 8730 SUAdvice@nottingham.ac.uk Click here to find your nearest Talking therapy services near you National services and information: National strategy to reduce gambling harms Be gambling aware NHS: Help for problem gambling Gam-anon National Debtline Money advice service Citizens Advice Ygam NottAlone AskLion telephone: +44 (0) 115 951 5151 fax: +44 (0) 115 951 3666 email: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}