{
    "url": "https://www.nottingham.edu.my/CurrentStudents/Nottingham-Advantage-Award/Modules/Student-media.aspx",
    "content": [
        {
            "p": "Introducing a NEW Nottingham Advantage Award module! IGNITE Magazine is UNMC’s online student media platform, operated by students under the guidance of academic staff from the School of Modern Languages and Culture (SMLC). Students from any UNMC faculty who are interested in contributing as writers, editors, photographers, public relations officers and advertising managers are invited to join the IGNITE family and contribute to the official Student Media at the UNMC, while gaining NAA credit in the process. Ignite focuses mainly on events, projects and issues that involve the UNMC student and staff community. We are keen on working with (1) aspiring journalists who are invested in long-form, serious reporting, (2) those with a keen insight on creating fun, humorous and entertainment-oriented content and (3) self-motivated, independent and creative individuals keen on putting their skills in service of furthering student media on (perhaps even off) campus. Students who are interested in participating as a public relations officer can contribute by managing’s Ignite various social media profiles (Facebook, Twitter, Instagram), and through live events targeting the UNMC student body. We are also looking for individuals who are interested in the business/commercial aspect of digital media operations, and who are motivated to generate revenue for Ignite via hosting advertisements, sponsored articles, etc. The module's aims to provide: Interested students from any faculty and year are encouraged to apply. Those who are self-motivated, passionate and able to work under tight deadlines will make the most out of this module. This will be a semester long module. Participating students (writers/ photographers) are required to attend a minimum of three (3) Editorial meetings. According to their skill and interest as indicated in the application form, they will be assigned to a Section and a respective Editor at the discretion of the IGNITE management team. Photography candidates are automatically placed under the Head Photographer(s). Throughout the module, participants are given assignment(s) and feedback by their assigned member of the Editorial Team. All content has to be approved by the Head Photographer/Editor before publication. Through correspondence and Editorial meetings candidates are guided and trained by the Editorial team and media professionals/SMLC staff. Advertising Managers and Public Relations Officers will put their creativity and management skills to use in encouraging media literacy among the UNMC community, enhancing IGNITE's capabilities and in improving IGNITE's reputation. Through team work, problem solving, communication and business and/or social media strategies they will come up with a proposal to be pitched to IGNITE's management. Constant guidance and feedback will be provided to applicants throughout the semester. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}