{
    "url": "http://www.nottingham.edu.my/CurrentStudents/StudentRegistry/Academic-Appeals-and-Academic-Misconduct/index.aspx",
    "content": [
        {
            "p": "Students have the right to appeal against a decision of an academic body on the issues of student progression, assessment and awards. For further information please see: This should be read this in conjunction with the appropriate Appeals Procedure: Students should take care to use the Procedure and Appeal Form for the relevant Campus. Appeals will only be accepted if submitted on the Appeals Form and in line with the requirements set out in the Appeals Procedure. The Appeals Frequently Asked Questions will help with most general queries. In addition, the Academic Appeal team can advise on the operational process of the Appeals Policy and Procedure. For more detailed help with specific cases, including advice as to whether or not a student has a case and assistance with completing paperwork, please contact the Student Association’s Education Officer for more assistance. The Regulations on Academic Misconduct came into force on 1 August 2013 and apply to students on all campuses. Flow chart of process. Academic Offences The Academic Offences Policy applies to academic offence cases where proceedings were initiated on or before 31 July 2013. For further information please see: The University's Academic Offences Policy. This applies to students on all campuses. If you have any queries or if you need any further information, please contact the Student Registry team. The Quality Manual is the University’s central source of information relating to policies and procedures and is relevant to both staff and students. Through the Quality Manual, all aspects of quality and standards are upheld in learning, teaching and supervision. Of particular note are sections on: The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia telephone: +6 (03) 8924 8663 email: student_registry@nottingham.edu.my"
        }
    ],
    "pdf_files": [
        "pdf_files/Academic-Appeals-Procedure-UNMC-effective-from-26-Sep-2016.pdf",
        "pdf_files/Academic-Appeals-Procedure-UNMC-effective-from-26-Sep-2016.pdf",
        "pdf_files/Academic-Appeals-Frequently-Asked-Questions.pdf",
        "pdf_files/regulations-on-academic-misconduct---flowchart.pdf",
        "pdf_files/Academic-Appeals-Procedure-UNMC-effective-from-26-Sep-2016.pdf",
        "pdf_files/Academic-Appeal-procedure-to-25-September-2016.pdf",
        "pdf_files/Academic-Appeals-Frequently-Asked-Questions.pdf"
    ]
}