{
    "url": "https://www.nottingham.edu.my/CurrentStudents/StudentRegistry/Attendance-and-Engagement/Supplementary-Policy-on-Attendance-UNM.aspx",
    "content": [
        {
            "p": "The intention of this policy is to ensure that students attend all activities, including teaching activities and meetings necessary for the pursuit of their studies, as required by their School or the University, and to satisfy attendance requirements by regulatory authorities in Malaysia. This Supplementary Policy on Attendance should be read in conjunction with the Quality Manual (QM) Regulations Governing Attendance and Engagement, and the Attendance Monitoring Procedure for schools and departments at UNM. This policy is applicable to all types of student on all programmes or courses registered at UNM, unless otherwise stated. Where a student’s ability to study or take assessments is in any way affected the Policy on Circumstances Affecting Students' Ability to Study and Complete Assessments should apply. This supplementary policy should therefore not be used to manage absence from an examination/assessment or non-submission of coursework. Timescales for students to inform faculty of unplanned absence, and submission of absence request for planned absence are set and published within the Attendance Monitoring Procedure and must be adhered to. The Guidance on Acceptable Circumstances and Evidence in the university EC procedure may be used as guidance on the types of acceptable circumstances and evidence that may serve as good cause or satisfactory explanation for absence. Regulations and action steps for the management of non-attendance and non-engagement are available under the QM’s Regulations Governing Attendance and Engagement and the Attendance Monitoring Procedure at UNM. Faculties are encouraged to understand and apply these regulations in a timely manner as prescribed. This will facilitate faculties to identify students who may be a cause for concern and can then take follow-up actions as required. This will also ensure that faculties maintain proper documentation (medical certificates, EC forms etc.) and communication evidences (letters, emails etc.) to inform any future reporting or audit activities by immigration/government agencies. Attendance Monitoring Procedure Regulations Governing Attendance and Engagement Policy on Circumstances Affecting Students' Ability to Study and Complete Assessments Voluntary Interruption of Study Guide on Instatt are available on SharePoint. Guides for Milestones in Campus Solutions are available on SharePoint. The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia telephone: +6 (03) 8924 8663 email: student_registry@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}