{
    "url": "https://www.nottingham.ac.uk/currentstudents/healthyu/mental-health/concerned-about-suicide.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy There are many reasons why a person might think about suicide. They may be feeling isolated and alone, because something has happened which feels too overwhelming, because being alive feels too hard or maybe because they feel trapped and unable to escape from a situation. Although people might think about suicide, most people don’t want to die but they feel their pain is unbearable. Attempts of suicide are rare; thoughts of suicide are more common. Suicide is often preventable and openly talking about suicidal thoughts and feelings can help save a life. Call Samaritans on 116 123 if you want to talk to someone about how you are feeling Ring 999 if you feel serious harm is imminent or has already occurred. On Campus, call Security 0115 951 8888 (Dial 8888 from an internal phone) GP or doctor: Ask for the duty doctor (Cripps Health Centre: 0115 846 8888) Attend your local A&E department (QMC) out of GP opening hours or during the day if you have already seriously harmed yourself and need urgent care. Please call 999/Security if you need assistance getting to A&E Reality: If a person is thinking about suicide, the idea is already there. Asking about suicide, will not make things worse. Talking about suicide can help lower their anxiety and help normalise what they’re potentially feeling Reality: If someone is talking about ending their life it shows that they are thinking about it and letting others know how low they feel, this does not mean that they will not go through with it - they need help and support Reality: Feeling actively suicidal is often temporary, even if someone has been feeling low, anxious or struggling to cope for a long period. It’s important to get the right kind of support at the right time Reality: There is no such thing as a ‘type’ when it comes to suicide. Although risks are known to be higher in some demographic groups. Many people have suicidal thoughts at some point in their life, so it’s important not to make judgements about who may act on them If you think a friend is feeling really down and you are worried they might be thinking about suicide don’t be afraid to ask. Saying something is better than saying nothing and asking shows, you care. If someone tells you they are feeling suicidal…. GP or doctor during opening hours Cripps Health Centre: 0115 846 8888 University Counselling Service: Provides free one to one support for students and staff. UCS can also provide support groups for students and staff following the sudden death of a student or a staff member. The University Counselling service is now a referral only service. To arrange an appointment with the counselling service, you will need to meet with a member of staff from one of the following services: Support and Wellbeing Officers: Can help advise with significant or complex issues and have knowledge of University specialist services and can refer students onwards as needed. Students’ Union Advice: Can help students with information, advice and representation around all aspects of student welfare and education t:0115 846 8730 e: SUAdvice@nottingham.ac.uk Nightline:A student-run service providing confidential listening and information 7pm-8am term time, 24 hours during welcome week and exams t:0115 951 4985 e:nightlineanon@nottingham.ac.uk If you need immediate support, you can call the 24/7 Nottingham and Nottinghamshire Mental Health Crisis Helpline on 0808 196 3779. The crisis line is operated by local health workers, who will help you to get the right support. The Nottinghamshire Crisis Sanctuaries provides mental health crisis support to the communities of Nottinghamshire. The Crisis Sanctuaries are for anyone near, or at crisis who need a safe space to talk Harmless – support for self-harm: Practical and emotional support, or long/short-term therapy. Based in Nottinghamshire - Referral line 0115 880 0280, or info@harmless.org.uk The Tomorrow Project – support for suicidal thoughts/crisis: Short-term practical and emotional support, based in Nottinghamshire - Referral line 0115 880 0280, or crisis@tomorrowproject.org.uk The Tomorrow Project: Support for people who’ve been exposed to suicide (friends, family members, colleagues, professionals, members of the public – anyone). Referral line 0115 880 0280, or bereavement@tomorrowproject.org.uk Harmless and The Tomorrow Project provide an out of Hours drop-in service for anyone of all ages and genders at risk of self-harm and suicide to access emotional & practical support. You can self-refer here Or call/text 07925 584 716 Targeted CAMHS – support for up to 18 year olds with moderate emotional and/or mental health needs For more information, call: 0115 876 4000, text: 0786 000 213, email: cypbehm@nottinghamcity.gov.uk. CAMHS Crisis Resolution & Home Treatment – support for up to 18 year olds experiencing a mental health crisis. For more information about the service and how to access please phone or visit the website. Phone: 0115 854 2299 or 0115 844 0560. Website here. Specialist CAMHS – support for up to 18 year olds with severe/ complex emotional and mental health difficulties. For more information about the service and how to access please phone or visit the website. Phone: 0115 876 4000. Email: cypbehm@nottinghamcity.gov.uk. SHARP (Self-Harm Awareness Project) – support for up to 18 year olds with self-harm and/or suicidal thoughts and behaviours. For more information, phone: 0115 876 4000, text: 0786 000 213, email: cypbehm@nottinghamcity.gov.uk. Website here. Base 51 - emotional health and wellbeing services for 12-25 year olds. Young people do not need a referral to access this service. For further information please phone or email. Phone: 0115 952 5040. Email: counselling@base51.org.uk. Website: www.base51.org Kooth: support for 10-25 year olds who want to talk to a mental health professional online, anonymously and free.You can register directly through Kooth. Alternatively you can email: contact@xenzone.com Samaritans: Offer a 24-hours a day, 7 days a week support service. Call them FREE on 116 123. e:jo@samaritans.org Papyrus: Prevention of young suicide (up to the age of 35). t:0800 068 4141. e: pat@papyrus-uk.org CALM (for men of all ages): The national helpline is open 7 days a week, 5pm-midnight. t:0800 58 58 58 SANEline: Open everyday from 4.30pm-10.30pm. t:0845 767 8000 Cruse Helpline: The Cruse Bereavement Care Freephone National Helpline is staffed by trained bereavement volunteers, who offer emotional support to anyone affected by bereavement. The number is 0808 808 1677. Email: helpline@cruse.org.uk Stay Alive: is a free suicide prevention app and is available to download to your phone. The Apple App Store and Google Play download links are on the front page It may not be clear whether a death was accidental, but sudden loss in difficult circumstances can cause intense grief and emotional distress. The link below helps explain some of the emotions you might be feeling and what might help. NHS Guide: Help is at Hand Support after someone may have died by suicide Samaritans: Information for university students telephone: +44 (0) 115 951 5151 fax: +44 (0) 115 951 3666 email: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}