{
    "url": "https://www.nottingham.edu.my/CurrentStudents/Nottingham-Advantage-Award/Modules/Malaysia-Sign-Language.aspx",
    "content": [
        {
            "p": "Instructor - En Mohd Armi bin Rusli Sign Language Instructor The 'Beyond Words: Malaysian Sign Language' module, in collaboration with #SignOn, a local Deaf organization, empowers students with the invaluable skill of sign language. By teaching essential Malaysian Sign Language (also known as Bahasa Isyarat Malaysia) words and phrases and incorporating perspectives from #SignOn’s Deaf trainer, students gain conversational proficiency and a deeper understanding of challenges faced by the Deaf community. Join us in creating an inclusive community that values and amplifies the unique experiences of the Deaf community – where understanding and connection extend beyond words. Class Schedule (all conducted in F4C11): Please check e-mail or Moodle page from time to time for any changes/updates. VERY IMPORTANT TO NOTE (REQUIREMENTS TO PASS MODULE): The workshops will be conducted in Bahasa Malaysia. You are encouraged to have adequate proficiency of this language to complete all assignments and in the event a student translator is not present. Students have to attend all 5 sessions in order to pass this module (in addition to completing the assignments), so if you cannot attend all sessions FULLY, please do not sign up for this module. For this reason, you need to ensure that you are able to make time for all of them before you commit. No excuses (except for actual emergencies) will be entertained if you do not fulfill these two requirements. PLEASE NOTE that this module is limited to 30 students to ensure an optimal learning experience. Enrolment is based on a first-come, first-served basis. Nevertheless, a waiting list will be maintained and we will reach out to you should there be any vacancies. Interested candidates please self-enrol via moodle starting 7 Oct 2024,10a.m. Below is the Moodle link https://moodle.nottingham.ac.uk/course/view.php?id=147066#section-0 Any enquiry , kindly e mai to naa@nottingham.edu.my telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}