{
    "url": "https://www.nottingham.edu.my/CurrentStudents/Nottingham-Advantage-Award/Student-award-and-testimonials.aspx",
    "content": [
        {
            "p": "Falonnie Chin Pei Lin, final year Finance, Accounting and Management student receiving her Vice Chancellor's Global Graduate Prize for the year 2017/18 from Professor Shearer West, Vice-Chancellor of the University of Nottingham during the award presentation at the UK campus. Shawn Teo Jia Yang Student, Finance , Accounting and Management 2024 Graduate Audit Associate at one of the Big 4 Accounting Firms in Kuala Lumpur The NAA programme offered by University of Nottingham provide students the opportunity to gain knowledge and skills beyond their selected academic. During my Degree Year 1 in Malaysia campus, I took the NAA modules: “Introduction to Security & Investment” and “Intercultural Awareness.” The first mentioned module delivers relevant knowledge on “the function of financial market” and practical skills on “security investment,” which are useful for “non-business school” students. The second mentioned module widened my perspective on international cultural awareness, allowing me to be more understanding and respectful towards different ethnic groups. My last NAA module was undertaken in the UK campus during my 1-year student exchange programme. Since I was a course representative for Year 2 FAM programme, I was allowed to select the module: “Importance of Representation in the SU.” The module has taught me critical skills in solving issues faced by my fellow course mates in a professional manner. The above are a short description of the learning outcomes for the 3 NAA modules I have undertaken. Of course, students have the opportunity to explore the various other NAA modules offered by all three campuses (UK, Malaysia and Ningbo campus). Another observation concludes that the module conveyor of each NAA modules delivers their teaching diligently. Would highly recommend all Nottingham students to participate in the NAA programme in becoming a better person. As Bryan Tracy says: “the more you learn, the more self-confidence you gain.” telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}