{
    "url": "https://www.nottingham.ac.uk/currentstudents/studentopportunities/index.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy There are a number of great ways for you to get more involved with everything university life has to offer. Not only will these opportunities provide you with a platform to develop new skills and enhance your CV, but they will help you meet new people whilst having fun at the same time. There are many ways that you can get involved in paid and voluntary schemes, working with young people and for your university including volunteering opportunities and paid work, including the Student Ambassador scheme. Help inspire young people of all ages to reach their potential and boost your CV at the same time. What would you change about teaching and learning practice in your school or faculty? The Students as Change Agents programme supports students and staff in academic Schools working in partnership to improve teaching and learning. This programme is dedicated to supporting local initiatives for the enhancement of education and student experience. Do you fancy doing a summer school in Korea, one year of study on the China or Malaysia Campuses or working in Spain through the ERASMUS programme? There's a huge variety of options available to you if you decide to spend time studying abroad. The opportunities are endless, so what are you waiting for? Listen to what students have to say about studying abroad. The Cascade funding programme offers up to £10,000 in funding for projects that benefit the student experience. The programme uses donations from alumni and friends of the University, and has gifted over £1 million to more than 120 projects since 2007. Previous funding has supported student-led initiatives such as Community First Responders, Liter of Light, Global Buddy Scheme and Foodprint. The University offers a range of schemes, parterships and funding opportunities so that you can make the most of your time at university and prepare for life after graduation. The Nottingham Advantage Award is the University's free employability scheme that helps you prepare for the job market and formally recognises your extracurricular activities. The University can support you in a variety of ways including bursaries to help you get through the academic year, and scholarships towards tuition fees for a particular course of study. The Ingenuity Lab aims to provide an environment in which students, graduates and staff can learn about the practical aspects of business development and build on their entrepreneurial skills. Success stories include sportswear companies, mobile app developers, video production companies and more. The University of Nottingham is committed to sustainable transport. Through the Ucycle Student Bike Hire Scheme, students are able to hire a quality bike for up to nine months, with prices varying by length of hire. Perfect for students who want to get about on two wheels. Communications and Marketing University Park Campus Nottingham, NG7 2RD telephone:+44 (0)115 82 32353 e: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}