{
    "url": "https://www.nottingham.edu.my/CurrentStudents/Your-voice/Academic-feedback/Student-Charter/Students.aspx",
    "content": [
        {
            "p": "Here is a list of what we can expect from you in the areas of: A willingness to actively participate in the intellectual environment, sharing responsibility for your development as an independent learner. Read more . . . That you make the most of the opportunities for academic and personal development. That you become an active member of our learning community, participating in your course and attending your classes. That you submit your work on time and ensure that it is your own. That you remain informed by using information that we will provide you with such as course handbooks, regulations and timetables. A willingness to reflect on your academic progress, seeking advice and support where necessary and keeping us informed of any circumstances that might affect your ability to perform at your best. That you will help us to continue to improve by providing feedback through evaluation processes such as Student Surveys. That you respect the physical environment of the University and the Students Association and behave respectfully towards other students, staff, neighbours and the local Community. Read more . . . Compliance with the Code of Practice for users of the University computing facilities. That you familiarise yourself with the resources and support provided by both the University and Students’ Association. Read more . . . That you take responsibility for informing your personal tutor, or relevant staff about anything impacting on your academic performance so you can be provided with the appropriate support. Payment of your tuition, accommodation and other University related fees on time and in accordance with financial regulations. Read more . . . That you take responsibility for seeking information about and applying for financial support that you may be entitled to. That you act with consideration for your fellow students, members of staff and neighbours, taking into account the diversity of the University community. Read more . . . A willingness to reflect on the skills developed throughout your time at University. Read more . . . That you stay informed and make the most of the opportunities available to you through the Careers and Employability Service and Students’ Association. That you are a respectful member of the University and wider Nottingham community. Read more . . . To familiarise yourself with these processes and to use them appropriately. When you register, you are undertaking to obey the Regulations and Ordinances of the University which are in force during your period of study. We will expect that you have read the regulations, which include those governing the payment of fees and other sums due to the University, attendance, conduct and progress in studies. The University is committed to ensuring that the personal data of its students is handled in accordance with the principles of the UK’s Data Protection Act 1988 and by any other relevant local legislation. By registering with the University, you are confirming that you understand that your data may be used by the University to maintain your student record, manage academic processes, and fulfil a legal obligation to supply certain data to governmental Higher Education agencies as well as other statutory bodies and other third parties where appropriate. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}