{
    "url": "https://www.nottingham.ac.uk/currentstudents/student-charter/student-charter.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy The University of Nottingham is committed to fostering an environment that values and respects all members of the university community. We expect everyone to conduct themselves in a manner that upholds the values of inclusivity, fairness and respect. The purpose of the Student Code of Conduct is to provide a framework for addressing behaviour that is not in line with these values. All students have agreed to comply with the Code of Conduct as part of studying at the University of Nottingham so it is important you have read and understood it. Stronger Together: Find out what we do to support students from different backgrounds The University of Nottingham aims to provide a safe and supportive environment for everyone, doing everything we can to ensure our campuses are inclusive places to study and work. As with any community, however, issues can arise and we want to support staff and students in being able to report these. You can tell us about issues of bullying, harassment & victimisation, discrimination, domestic abuse, hate incidents and sexual assault or violence using Report + Support. You can opt to tell us anonymously, which will help us understand behaviours on campus, but will not allow us to take action to support you/others or stop the behaviours. If you opt to speak to an advisor, someone will be in touch to talk about the support you might need and the options you have – it does not automatically result in making a formal report, or in sharing the information with others. Communications and Marketing University Park Campus Nottingham, NG7 2RD telephone:+44 (0)115 82 32353 e: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}