{
    "url": "https://www.nottingham.ac.uk/currentstudents/healthyu/alcoholdrugssmokingandaddiction/alcohol.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy We want you to know the facts, so that you can drink safely and make informed decisions about the way you live your life and care for your health. If you have experienced a non-occupational needle stick injury (pricked by a needle and injected with an unknown substance) We also encourage anyone who reports that they have experienced or witnessed these incidents to report it to the police immediately. The risk of developing a range of illnesses, including cancer, increases with any amount you drink on a regular basis. To reduce the risk of harming your health, men and women are advised not to regularly drink more than 14 units a week. Spread your drinking over three days or more if you drink as much as 14 units a week. Find out how many units you are consuming here. If you regularly drink more than 14 units a week, try these simple tips to help you cut down: For further information visit the Drinkaware website. ‘Drink spiking’ can include the addition of drugs or even extra alcohol to drinks. Information on what to do if you have been spiked by injection Drink spiking is a serious crime. Read this quick guide so you know what to do if you think you or someone else has been spiked. Pre-lashing, pre-drinking and pre-loading, are terms used to describe drinking a lot of alcohol in a short space of time. Don't assume you will save money by doing this as many studies suggest that people who pre-drink are around 75% more likely to continue to drink heavily on a night out. Drinking large amounts of alcohol in a short space of time can lead to an increase in accidents, anti-social, agressive and violent behaviour. Are you a binge drinker? Do you regularly drink more than the low risk alcohol unit guidelines in a single session? Do you tend to drink quickly? Do you sometimes drink to get drunk? Try Drinkaware's self-assessment tool to find out if you're drinking too much. If you're finding it hard to give up you may need help and support. Nottingham city Nottingham Recovery Network (NRN) deal with referrals to adult drug and alcohol services. NRN deliver a complete and confidential access, advice, support, treatment and recovery service in the heart of Nottingham. You can simply ring or drop in for advice and an assessment of your needs. Drop into: NEMS Platform One Practice, 79a Upper Parliament Street, Nottingham, NG1 6LD (weekdays from 9.30am - 5.30pm). Or visit 73 Hounds Gate, Nottingham, NG1 6BB (weekdays from 9.30am - 5.30pm). Phone: 0800 066 5362. The Place provides a range of support services primarily for young people up to the age of 25 around drugs and alcohol. They work to reduce harm and promote positive change. The service is for young people who live in Nottingham and Nottinghamshire. You can make a referral here. Nottinghamshire County Change Grow Live deliver integrated drug and alcohol services in Nottinghamshire. Derby Drug and Alcohol Services For information, advice and support for those affected by drugs and alcohol, visit the Derby Drug and Alcohol Services. Alcoholics Anonymous - 0115 941 7100 Leicestershire & Nottinghamshire Derbyshire telephone: +44 (0) 115 951 5151 fax: +44 (0) 115 951 3666 email: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}