{
    "url": "http://www.nottingham.edu.my/CurrentStudents/Nottingham-Advantage-Award/index.aspx",
    "content": [
        {
            "p": "Our Nottingham Advantage Award will give you the opportunity to stand out, the vision to achieve your goals and recognition for your commitment. to learn more. We are award-winning, we’re international, and we want you to join us. We’re a scheme that spans the entire University, making students more employable and helping them get the most out of their time here. Click here to learn more about NAA learning outcomes 2016. Nottingham Advantage Award briefing for Autumn modules. Date : 3 October 2024 (Thursday) Time : 5pm Venue: F1A15 If you’re an undergraduate student with plenty of enthusiasm for activities outside your main academic studies, then the Nottingham Advantage Award is designed with you in mind. Apply now! You will participate in a mixture of activities delivered by both academic schools and non-academic departments that provide you with opportunities to enhance your learning and be recognised for your contribution to activities outside your core curriculum. The teaching elements equal around 20 hours. This can comprise workshops or the equivalent in online learning. You will be required to spend around 40 hours conducting independent study for the work you will submit for assessment. In order to award you credits for your work, we will need to assess your performance. There are no extra exams, but we will just ask you to do some reflective activities like keeping a journal or putting together an e-portfolio. This all contributes to one of the main aims of the award ─ reflective learning. Students who are interested to complete three (3) modules are advised to take them during their first two years of study to be eligible for the Nottingham Advantage Award. If you are an outgoing mobility student and have completed any NAA modules outside Malaysia campus, kindly inform us via e mail at naa@nottingham.edu.my If you are in Ningbo /UK campus on Mobility Scheme for your second year, but have decided to transfer there for your final year , kindly inform us via e mail at naa@nottingham.edu.my. If you have completed any NAA modules in Malaysia and are planning to transfer to the UK or China campus, kindly inform us via e mail at naa@nottingham.edu.my. Should you have taken 1 or 2 NAA modules at the UK/Ningbo campus and then decide to transfer to Malaysia campus, kindly inform us via e mail at naa@nottingham.edu.my once you have registered at the Malaysia campus. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/NAA-learning-outcomes-2016.pdf",
        "pdf_files/NAA-learning-outcomes-2016.pdf",
        "pdf_files/MC-Terms-and-Conditions-NAA-20-21.pdf"
    ]
}