{
    "url": "https://www.nottingham.edu.my/CurrentStudents/Nottingham-Advantage-Award/Modules/AIESEC-global-volunteer.aspx",
    "content": [
        {
            "p": "Module convenor: Tiong Kung Ming Department: CELFE Attend the compulsory Preparation Seminar for Malaysian Youth Volunteer (before the project starts) and Debrief Session (after the project ends). Required to join the experience sharing space hosted by NAA and AIESEC within one months of the project end in the academic year 2024/2025. Students will have to deliver a 10 minute presentation to Mr Victor Tiong, sharing their volunteering experience and stories. This will be held physically, depending on the arrangements/ situation in the academic year 2024/2025. Students are encouraged to participate in the campaign(s) organised by AIESEC in Malaysia after their volunteering journeys end (if there is any). For students going for academic exchange and are unable to join the experience sharing space, a video presentation with a minimum duration of 10 minutes is to be submitted to Mr Victor Tiong and cc to Yong Jun Wen and Alvin Wilbert. Links for Application My experiences have provided me with numerous opportunities to be involved with diverse people and situations, make mistakes, learn from them and teach those around me what I’ve learned. Making these mistakes, and having these experiences has helped me in my journey of discovering who I truly am as well as evolve as a person. This experience was very fulfilling to me, and I personally felt it was my duty to inspire those students, as they are our future leaders. If I could positively impact at least one of those students then I’d be exultant with my choice to volunteer. Some benefit of this programme is I made a new friend all over the world and I really don’t regret giving my time for this volunteering programs. I loved every single second of this.\" HASANJALE | Share the Future I also gained valuable insight into other country’s cultures and cooperated with other members in delivering a decent class to the students. I feel like I have a sense of responsibility to lead someone and guide them the right way. As a conclusion, I truly recommend this programme to all students to participate, especially if you are very concerned about your budgets or travelling. Just like conventional physical volunteering, you can still make a great impact on the communities around you that are desperate for education entities.\" ZHENG HAO | Share the Future I can’t believe that I have already left this place, and I am no longer their teacher, ever again. These little kids will never know how much they meant to me. they are truly the sweetest. I can still remember how they shouted my name from far on the first day itself and how tightly they hugged me as they sent me off. It was so heart-warming that the locals have treated us in a way as if we were part of the Atayal tribe. Words can’t describe how grateful I was to have such lovely and affectionate Taiwanese dad and mom in Taiwan, they made us feel like home and loved us unconditionally. Right before we left the school, the students have left me with the most heart-breaking question, \"Are you gonna come back soon?\", my heart breaks a little knowing that I might not have the chance to be back here, ever again. My global volunteering journey in Hanxi Elementary School has been incredibly inspiring, Atayal has been amazing, Taiwan has been so beautiful. The heartrending part of the journey was parting, but the pain of parting is nothing to the joy of meeting again! It is tough to imagine how you could leave an impact in just 6 weeks, but not until you get yourself out of your comfort zone and leave your mark on this world!” SAW YIN YING Year 2 Biomedical Sciences student Taiwan | Camp & Conference-U-impact Project Global Volunteer Ambassador 2018 The girl who seemed incredibly excited for adventure was scared in her room. This made me realise that I should take a harder look before I come to a conclusion. When I was speechless in the hospital, the children I met were excited about the next day. The people in the hospice didn’t need my consolation. Language barriers did not prevent me from connecting with the children. In fact, they were more excited to meet people from all over the world. I could also add a few Sinhalese words they taught me to the list of things I learnt from this experience. Today, I flip through the journal I had with me and find a beautiful drawing from Tharu, one of the children I was closest with. I see the bright sun, the smiling red flower and know that there’s a tiny soul that I can think of, a smile that I can cherish. I find notes my friends wrote about the tiny things I never noticed about myself. It was truly an experience of the unexpected.” HARINI SANKAR Year 1, Psychology student Sri Lanka | Project Faith “Joining the Global volunteer programme was definitely one of the bravest things I’ve ever done. Never in my wildest imagination would I thought of going to a foreign country alone. Not only did I stun my parents and friends, even I couldn’t believe it, and a few months later, there I was, embarking on a journey into a foreign country all on my own. It’s difficult to compile all the wild range of emotions that I’ve felt throughout my journey. I’ve experienced a roller coaster of emotions from uncertainty to homesick, from nervous to excited and slowly falling in love with this country along with its people. At first, I was really shy but because of the warm hospitality given by my host family, I became more excited and confident that I can continue with this journey till the end. My project focuses on teaching English to school students around Southern Sulawesi and the project members comprised of members from Malaysia, Indonesia, China and Czech Republic. Each week, we would teach different schools in different province. The objective was to improve their English language by using various interactive teaching methods. However, because each school and each class consist of different grades (and different behaviours), I had to adjust the content of my teaching based on their understanding. Luckily, I wasn’t alone. I had a wonderful team consisting of both local and international volunteers to help me, especially when it comes to translation (Malay language and Indonesian language is very different sometimes!) As a psychology student, I learn that individual differences are real and can be very difficult to understand. Hence, volunteering as a teacher taught me to understand the different needs of my students and offer my best assistance to help them. It taught me how to be confident in myself and how that confidence can project change into the life of others. So yes, global volunteer definitely changed me into a better person and gave me a glimpse of how much change one person can bring into this world. The moment that really impacted me was in Polewali Mandar, a province located on the Western part of Sulawesi. The school that I taught was made of wood and the floor was bare ground. The school itself was built on top of a hill so that students from the nearby villages can access it better and yes, there's no signal coverage anywhere near this place including the village that I live in (My parents almost lodged a police report and my friends started a #prayforIrfan campaign on social media because I went 'missing' for 4 days). The journey to the school took us almost an hour from the nearest village with a mountain jeep across various geographical terrains including rivers, mountains and unpaved roads. My initial thoughts during the journey was that the students must have zero understanding in English considering how far the school is from civilisation. Surprisingly, the students were quite good in English and most of them are just 5 to 6 years old. Their enthusiasm in learning despite the challenges they faced really touched me and made me realized that the paths to success doesn’t depends on all the riches of the world. All it takes is mere courage and the determination to succeed. Before my visit, I always thought that Indonesia was just another developing country which shares a similar culture like Malaysia. But after my volunteering experience, I realised that they are very smart and polite compared to Malaysians. Their way of thinking is more advanced and the amount of respect they give to each other never cease to amaze me. Not to mention they’re very good at driving (But very dangerous!). Their street food is also very cheap and delicious! This exchange journey has pushed me outside of my comfort zone and challenge me to think out of the box when problems arise. Hence, I think it’s important for all youth to experience a different cultural experience so that they can improve themselves and possibly influence others to make even the smallest change in the lives of others.” MOHD IRFAN Year 2, Psychology student Indonesia | EDUNESIA - Big Smile for Makassar 3.0 project telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}