{
    "url": "https://www.nottingham.ac.uk/currentstudents/news/disability-recognition-month-2024",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy It also serves as an opportunity to inspire and empower future work in this area. As part of the university’s ongoing commitment to equality, diversity, and inclusion, we celebrate Disability Recognition Month annually. This year's events will take place from Thursday 14 November to Friday 20 December. The theme this year is ‘Disability Livelihood and Employment’, highlighting the current and historical opportunities and challenges the disabled community may face when accessing work or in everyday life. The university endorses the social model of disability and is committed to ensuring disability equality for all staff and students. Ongoing support Disability Support Services are available year-round to provide support if you have a disability, mental health difficulty, long-term medical condition, autistic spectrum condition, or a specific learning difference such as dyslexia, dyspraxia, dyscalculia or ADHD. Our student-led support enables students with Support Plans to flourish as independent learners. ‘Disability Equality for Staff and Students: Supporting our people through the launch of the Institutional Disability Equality Action Plan’ Date: Tuesday 19 November Time: 10-11.30am Location: Online (Microsoft Teams) The university is pleased to announce the launch of the Institutional Disability Equality Action Plan for staff and students. We will hear from Professor Katherine Linehan, Pro-Vice-Chancellor for People and Culture, who will introduce the event and formally launch the Institutional Disability Equality Action Plan. Register for the event There are various events and celebrations to get involved in, including talks, workshops and projects to raise awareness around disability and neurodiversity. ‘Entrepreneurship & Community Outreach Taster Event' Location: New Art Exchange, Gregory Boulevard, Nottingham, NG7 6BE Date and Time: Tuesday December 3rd 2024, 6pm - 8pm This community outreach event is aimed at informing and recruiting potential applicants for Ingenuity Impact, the university's entrepreneurship training scheme and competition. Entrepreneurship has long been recognised as a driver of employment creation and skills, and improved livelihood. The event will have a particular focus on inclusive entrepreneurship, building upon last year's events targeting specific groups. We will be seeking to welcome entrepreneurs from specific groups, such as disabled people, to mingle to strengthen intra- and inter-community networking and encourage synergy through tapping into intersectionality in identity. ‘BDI Mental Health event - Disability Awareness’ Location: A208-A209, BD13, Biodiscovery Institute, University Park. Date and Time: Thursday 19 December , 12 - 2pm This event will focus on mental health support and activities for those who have disabilities but also to raise awareness on how disabilities can add onto mental health or vice versa. The activities in mind include physical activities (both seated and standing), mindfulness activities to calm/distract the mind for those with ADHD/Autism as well as general mental health activities and awareness booklets/guidance on disabilities for those who want to learn more. No booking is required. ‘The Disability and Accessibility in Careers Focus Group’ Location: Conference Room, Careers and Employability Service, Portland Building, University Park. Date and Time: Wednesday 26th February 2025, 2pm The Disability and Accessibility in Careers NOOC is a new resource to support disabled students navigate their career choices, job applications and starting work. The aim is to empower students to know their rights, explore workplace adjustments and feel confident when speaking with employers about their disability. The Careers and Employability Service are putting together a focus group, consisting of 6 students who consider themselves to have a disability, to review the resource. These roles will be advertised out to students through Unitemps in January. ‘Digital Accessibility Training Programme’ The Digital Accessibility Team are running a programme of training sessions throughout November and December focused on raising awareness for Nottingham Accessible Practices and use of digital accessibility tools within UoN. All courses are available to book through Central Short Courses at UoN. Click the below links to find out more and book your place: Communications and Marketing University Park Campus Nottingham, NG7 2RD telephone:+44 (0)115 82 32353 e: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}