{
    "url": "https://www.nottingham.edu.my/CurrentStudents/StudentRegistry/Complaints.aspx",
    "content": [
        {
            "p": "The information below regarding the Student Complaint Procedure should be read in conjunction with the Student Complaints Policy. The procedure below is effective from 26 September 2016. Students whose case is already being considered under the previous version of the procedure will continue to have their case handled in accordance with the provisions of that procedure. The following sections explain what this means, and what to do if a complaint is not resolved satisfactorily. Level 1: Local Level (informal resolution). To make a complaint a student must start at Level 1 Level 2: Head of School/Service review Level 3: Faculty Dean/Registrar (UNM) After the internal University processes have been exhausted, complainants have the opportunity to have their complaint independently reviewed by the Office of the Independent Adjudicator (OIA). The OIA Good Practice Framework stipulates that the handling of complaints will normally be completed within 90 calendar days of the start of the formal stage (Level 2).* Student Student Registry Office Investigation Level 1 Complaint should be raised within 1 month of cause for complaint No involvement Response will be communicated within 6 weeks of notification of complaint. If this is not possible, an alternative timescale will be issued to the complainant within the 6 weeks. Level 2 Complaint should be raised within 1 month of outcome of Level 1 Will acknowledge receipt of complaint within 5 working days of receipt *Indicative timescales for this stage are that a response will be sent within 6 weeks of receipt of complaint form in Student Registry Office. If this is not possible, an alternative timescale will be issued to the complainant. Level 3 Complaint should be raised within 10 working days of outcome of Level 2 complaint *Indicative timescales for this stage are that a response will be sent within 4 weeks of receipt of complaint form in Student Registry Office. If this is not possible, an alternative timescale will be issued to the complainant. OIA Complaint should be raised within 12 months of the date of the Completion of Procedures letter. No direct involvement with complainant Variable If a student fails to proceed within the given deadlines of the complaints procedure they may not be able to progress through the internal complaints mechanisms of the University. The procedure has been separated into Responsibilities of Students and Responsibilities of those involved in the handling of the complaint on behalf of the University. You are expected to try to resolve a complaint directly, informally and quickly with the person/department concerned. In some circumstances, in the first instance, you may prefer to approach a different member of staff e.g. Personal Tutor, Course or Module Convener or School Manager. You should raise the complaint within 1 month of the unsatisfactory circumstances occurring, at the latest. The sooner the matter is raised, the better. You are expected to explain clearly what the problem is and what outcome you are seeking. If you are dissatisfied with the outcome, you can escalate your complaint to level 2. You should complete the Level 2 Complaint Form within 1 month of notification of the outcome of Level 1. You must provide a clear explanation of how you attempted to resolve your complaint informally at Level 1. As a minimum, your explanation should include a specific date, a named member of staff to whom the complaint was reported and why the complaint was not resolved to your satisfaction at Level 1. Your complaint must be substantiated by evidence. This may comprise one, or a series of the following types of evidence: a timeline of events, reference to relevant policies, procedures and/or regulations, letters, emails, independent medical evidence, reports by professionals, witness statements, screenshots, the outcome of an investigation under the University’s Dignity Policy etc. Any evidence or appendices relevant to the complaint must be submitted at the same time as the complaint form and clearly referenced and labelled. If you are making a Subject Access request as part of your complaint, you are expected to submit this as soon as practicably possible after the outcome of your level 1 complaint and to provide evidence of submission as part of your level 2 complaint. It is your responsibility to make your case. Complaints will not be accepted for further investigation if: You are required to ensure that any evidence not written in English is translated and provided at the same time as the complaint paperwork. If your submission is unclear or unnecessarily long, you will be asked to resubmit the form in a manner that enables proper consideration of the complaint to take place. You should send the completed form to the UNM Student Complaints. You will normally receive an outcome letter within 6 weeks of receipt of your level 2 complaint form by the Complaints and Conduct Team. If the investigation will take longer than 6 weeks, you will be informed of the reason and an expected date of response. If you are dissatisfied with the outcome, you can escalate your complaint to level 3 on the following grounds: You should submit the Level 3 Complaint Form within 10 working days of notification of the outcome of the Level 2 complaint. You must set out the grounds of the complaint by making reference to the above standards, and must provide evidence to support your claim, including proof of why new evidence being presented was not available at the time of the submission of your level 2 complaint. You will normally receive an outcome letter within 4 weeks of receipt of your level 3 complaint form by the Student Registry Office. If the review will take longer than 4 weeks, you will be informed of the reason and an expected date of response. Once the internal complaints procedure has been completed, if you are still not satisfied with the outcome, you may take your complaint to the Office of the Independent Adjudicator (OIA). The OIA operates externally to the University. It will not normally look at a complaint unless and until all relevant internal complaints procedures have been exhausted. Further information is available from the OIA website. As required by the OIA, if we are unable to resolve a complaint to the student's satisfaction, and there are no further steps available to the student, we will issue a formal \"Completion of Procedures\" letter. This provides a formal confirmation that the student has exhausted the internal complaints procedure, and is required before a complaint may be considered by the OIA. Hard copies of forms are available to students who, for reasons of disability, are unable to access the electronic form. Please contact UNM Student Complaints for further information. You have the right to bring a friend or representative from the Students’ Union to meetings arranged during the formal stages of the procedure. Solicitors or other legal representatives will not be permitted to attend. Staff dealing with complaints are encouraged, whenever practical, to meet with the student to establish the precise cause of dissatisfaction, to explore the remedy sought by the student and to foster a mutual understanding of the issues involved. The member of staff is expected to listen to the complaint and to try to resolve it in a straightforward, reasonable and prompt manner. Although informal, the member of staff should make notes of any meetings and keep a record of the agreed outcome. Notes should be shared with the student. The student should be notified that the matter is deemed to be resolved and advised of the availability of Level 2 of the complaints procedure, if the complaint is not upheld or the student is dissatisfied with the attempt at resolution. On receipt of a level 2 complaint the Student Registry Office will undertake an initial evaluation to check that the complaint is submitted under the right procedures, within the appropriate deadlines, and in the required format with supporting evidence. The Student Registry Office will administer the complaint and will be accessible to complainants and staff at all stages of the process. The complaint will be referred to the appropriate person in the school, usually the Head of School/Service. If the subject of the original complaint is the Head of School, then another Head of School will conduct the review. If the subject of the original complaint is the Head of Service, then another Head of Service or their line manager will conduct the review. If the subject of the complaint is a member of the University’s Management Board, another member of Management Board will conduct the review. The Head of School/Service will ensure that an investigation is carried out. The investigation may be delegated to an appropriate member of staff. It will not normally be appropriate to keep the name of the person investigating the complaint confidential. The investigation and its outcome must be fair and reasonable. It may be appropriate for the investigator to meet with the complainant and/or other parties named in the paperwork. Should the investigator wish to meet with the complainant, he/she will contact the student to propose this course of action and secure an appropriate date to meet. The complainant will be offered the opportunity to bring a friend or representative from the Students’ Union to this meeting. Solicitors or other legal representatives will not be permitted to attend. If the Head of School/Service finds in favour of the student, they may decide on whatever redress they think appropriate, bearing in mind the outcome sought by the student. A report of the investigation will be prepared before a written response is provided to the complainant. The report will be provided to the student with the outcome letter. If the complaint is not upheld, the student will be notified of the availability of Level 3 of the complaints procedure. All outcome responses to level 2 complaints will be issued by the Student Registry Office. On receipt of a level 3 complaint form, the Student Registry Team will undertake an initial evaluation to check that the complaint is submitted within the appropriate deadlines, meets the criteria for level 3 review and is in the required format with supporting evidence. A complaint without adequate grounds and evidence will be dismissed. If the student provides evidence to support the criteria, the complaint will be referred to the Faculty Dean for review. If the Level 2 complaint was reviewed by the Dean, it will be referred to the Faculty Dean of a different Faculty. Where the Level 2 complaint was heard by a Head of Service, the Level 3 complaint will be heard by the Registrar (UNM), rather than a Faculty Dean. The review stage will not usually consider the issues afresh or involve further investigation. In reaching a decision, the reviewer is expected to be fair and reasonable. If the complaint is upheld, both the student and the Head of School/Service will receive a written explanation of the decision. If the Faculty Dean/Registrar (UNM) does not uphold the complaint, the student will receive a written response giving reasons and a \"Completion of Procedures\" letter (see below) will be issued. The Faculty Dean may decide to uphold part, but not all, of the complaint and will respond to the student accordingly. Where a School deems the refund or waiver of a student's tuition fees to be the appropriate redress following a complaint made by a student, the liability for the fees will transfer to the School (where the complaint was made against the School). Details of the relevant circumstances and any associated documentation should be forwarded in the first instance to UNM Student Complaints. Where a refund or waiver is imposed on a School as a result of a Level 3 complaint outcome, the School will be notified by email prior to the outcome of the complaint being communicated to the student. Once the internal complaints procedure has been completed, if the student is still not happy with the outcome, they may take their complaint to the Office of the Independent Adjudicator (OIA). The OIA operates externally to the University. It will not normally look at a complaint unless and until all relevant internal complaints procedures have been exhausted. Further information is available from the OIA website. As required by the OIA, if we are unable to resolve a complaint to the student's satisfaction, and there are no further steps available to the student, a formal \"Completion of Procedures\" letter will be issued within 28 days of the outcome being determined. This provides a formal confirmation that the student has exhausted the internal complaints procedure, and is required before a complaint may be considered by the OIA. Student Complaints Student Complaints Policy Level 2 Complaint Form Level 3 Complaint Form The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia telephone: +6 (03) 8924 8663 email: student_registry@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}