{
    "url": "https://www.nottingham.ac.uk/currentstudents/essentials/study-here.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Whether you're looking for space for silent study or online learning, we can help you find the right study space across our campuses. Search or browse the table below to find space in your preferred location and with the facilities you need. Enter your keywords below to filter the list e.g. group, drop-in, silent, assessment, postgraduate, power, PC, University Park, online learning. Available classrooms UK campuses Bookable Various Individual study Group study Book via Resource Booker Communal areas Schools and departments Drop-in Building opening hours Computer rooms Digital and Technology Services Networked PCs Print, copy and scan Access out of hours is by University Card access only Monica Partridge Power University Card access Mon - Sun, 8am - 8pm Bookable spaces Book A Floor study rooms via: Large screens Assessment Business Library Jubilee Campus Bookable and drop-in space Silent and Quiet zones Individual and group study Group study room must be booked in advance. Library opening times Denis Arnold Music Library Drop-in space only Short stay PC Djanogly Learning Resource Centre Assistive Technology Room 24/7 computer room George Green Library Cafe Enhanced Library Support rooms Large screen F Floor, George Green Library Individual, silent study Postgraduate only University Card access - postgraduate only Greenfield Medical Library Medical School, QMC Calm study space Height adjustable desk Hallward Library Enhanced Library Support room James Cameron-Gifford Library Sutton Bonington Researcher Academy Hubs University Park, Jubilee, Sutton Bonington and QMC Hot desks or individual study space Postgraduate researchers Postgraduate researchers only Referral required for access Communications and Marketing University Park Campus Nottingham, NG7 2RD telephone:+44 (0)115 82 32353 e: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}