{
    "url": "https://www.nottingham.edu.my/CurrentStudents/Nottingham-Advantage-Award/Modules/Sustainability-in-action.aspx",
    "content": [
        {
            "p": "Module convenor: Dr Lau Phei Li Department: Faculty of Science and Engineering This module is aimed at all students who have the passion in turning sustainability ideas into action. Students are encouraged to join the student committee of UNM SEEN (Sustainable Environmental Education Network) - either WasteNott Project or Gardening. By being part of the team, you will gain experience in leadership, communication, team working and more! The module aims to raise awareness amongst the UNM Community on waste problems that have been occurring on campus, in Malaysia and globally. Through this, students will get to know how wastes impact our environment, society and economy. The topic of wastes will also be linked to the United Nation’s Sustainable Development Goals (UN SDG) to be achieved by 2030. Additionally, students will learn the solutions to waste that can be incorporated into daily lives at an individual level, community level, as well as corporate level, through actions such as: zero waste lifestyle, proper waste management, circular economy etc. Lastly, students will also get to gain knowledge on green environment and gardening in depth, through a series of practices, workshops and campaigns. Open to all students. Students are required to join one project group from the list below, with 10 credit hours, which is about 35-40 hours during the 2024-25 academic year: WasteNott project: to raise awareness of the waste problem and zero-waste lifestyle amongst the UNM Community and public via social media, event planning or waste audit. Topics can be related to promoting, engaging or implementation of circular economy concept. Gardening Project: to promote awareness on sustainable gardening amongst the UNM Community and public via social media and gardening activities, which include improving the campus community garden, as well as home gardening. Portfolio and logbook. Portfolio Logbook To register to this module, please self-enrol via Moodle from 01 October 2024. 10.00am. Registration is open to first come first serve basis. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}