{
    "url": "https://www.nottingham.edu.my/CurrentStudents/StudentRegistry/Courseenrolment.aspx",
    "content": [
        {
            "p": "Welcome back to the Autumn 2024-25 academic session. The video guide here provides general steps to complete the OCE for all the three campuses. Please follow closely the specific instructions below to complete your online course enrolment for courses/modules that you are most interested in for 2024/25 year: 1. Log in to NottinghamHub website to access the OCE page. Click on Modules (Courses) Enrolment tile. The OCE includes the compulsory courses/modules that you will be enrolled on (you cannot make changes to these as they are compulsory requirement of your programme) and optional courses/modules you have selected during the course pre-enrolment in April 2024. 2. Consult your tutor about your restricted and optional courses/modules or free choices before submitting your request. Some students will be able to select courses which are free choice which means you are able to select any course from the catalogue that you meet the requisite/target student requirement. This course/module selection must still be agreed by both the offering School and your home School or Department to ensure it is appropriate for you and your programme of study. 3. For full-time undergraduate students, your courses should normally total 60 credits per semester and not less than 50 or more than 70 per semester. You will need to fulfil 120 credits for the whole academic year. 4. You can only submit the OCE once. Please check your course/module choices carefully before submission. You need to ensure all credit totals have been satisfied before submission. 5. Details about the program structure for your respective programs can be viewed at Programme Specification. Kindly refer to it when making your choices for course enrolment. 6. Refer to the online Course Catalogue to find out which courses will be running in 2024-25. 7. In the event you are not able to access the OCE page or not able to submit your online course enrolment successfully or any other issues please refer to your respective school administrators: Faculty of Science and Engineering (Foundation/UG/PGT) : FOSE STUDENT SUPPORT FOSE.StudentSupport@nottingham.edu.my Faculty of Arts and Social Sciences (Foundation/UG/PGT) : FASS STUDENT SUPPORT FASS.StudentSupport@nottingham.edu.my 8. Complete your OCE by Friday, 04 October 2024. Changes will not be accepted/processed after the close of business on 04 October 2024. It is your responsibility to check the NottinghamHub contains the correct information of your student records. There may be a time lag after the submission of form before course enrolment can be updated in NottinghamHub. Please let your respective schools know if you notice any inaccuracies after Friday, 11 October 2024. You may change your choices in January/February 2025 (Spring Add-Drop), however, the teaching timetables are fixed and you might not be able to choose a course/module you are interested in due to timetable clashes. It may not be possible to schedule your optional courses/modules into your timetable to be clash free and additional enrolment criteria may apply. You are required to drop the free choices/optional courses if they clashed with your compulsory courses/modules. Please check the timetable for full year courses/modules (scheduled in Autumn and Spring semesters) before adding/dropping courses/modules. You may send your enquiries to COURSE ENROLMENT Course_enrolment@nottingham.edu.my if any. If you have any queries about module enrolment, please do not hesitate to email us. The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia telephone: +6 (03) 8924 8663 email: student_registry@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}