{
    "url": "https://www.nottingham.ac.uk/CurrentStudents/Wellbeing/HealthyU/sexrelationships.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy For information about sexual consent, including what it is, myths and stereotypes, and where to get support, go to Let's Be clear on Consent. Condoms offer protection from sexually transmitted infections as well as preventing unintended pregnancy. If you are a registered student at the University of Nottingham you can sign up for the UoN condom scheme. Register for a condom card You will then be sent a pack of condoms plus a card with your condom scheme number on. Please keep a note of your condom card number. Please be aware if you may have to wait up to 2 weeks for condoms to arrive in the post. Once you have received your card via post you can request more condoms by completing this form. The NHS provides information about different types of contraception, including where to get them and how well they work at preventing pregnancy. Emergency contraception can prevent pregnancy after unprotected sex or if your contraceptive method has failed, for instance if a condom has split or you've missed a pill. If you are concerned you may have an STI and want to get tested, there are a number of places you can access. What should I do if I think I've got an STI? Find a sexual health clinic Chlamydia affects around 1 in 10 sexually active young people and is the most common STI in the UK. Gonorrhoea is the 2nd most common STI after chlamydia. The good news is testing and treatment is simple and free. Find out more about chlamydia Find out more about gonorrhoea Chlamydia and gonorrhoea screening is available via postal kits. You can order a test kit at: SH.UK. Relate offers advice, relationship counselling, sex therapy, workshops, mediation, consultations and support. Unhealthy relationships and domestic abuse information can be found here. If you want to talk, seek support or just want some information, your Students' Union LGBT+ Network can help. Its free to join and a confidential service is available. Use Report and Support anonymously to tell us what happened or ask to speak an advisor. This is not making a formal report to the university, it is to enable you to access the support you need to make an informed decision on what to do next. Report and Support Information about sexual consent Nottingham POW - supporting the rights of sex workers and those at risk of being exploited Terrence Higgins Trust (for sexual health and HIV) NHS Sexual Health Brook (Sexual health and wellbeing support and information for young people) telephone: +44 (0) 115 951 5151 fax: +44 (0) 115 951 3666 email: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}