{
    "url": "https://www.nottingham.ac.uk/currentstudents/healthyu/keepingactive.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy In order to stay healthy, the NHS recommends doing two types of exercise every week. This includes at least 150 minutes of moderate aerobic activity (such as cycling or brisk walking) OR 75 minutes of vigorous aerobic activity (such as running or tennis) OR a combination of both. In addition, it is advised to do strength exercises on 2 or more days a week that work all the major muscles. See the NHS guidelines for further information and exercise ideas. Look for simple ways to be physically active every day, such as: With excellent indoor and outdoor facilities, amazing choice and state of the art equipment available at each campus, getting involved and meeting new friends has never been easier! Make the most out of three fully-equipped fitness suites, a 25m swimming pool, over 100 group exercise classes, squash courts and indoor sports halls. No matter what your level of fitness, our classes offer something for everyone. From zumba, box fit and the popular Les Mills Body Pump/Balance and Attack classes, to pilates, yoga and aqua fit. You won't need any special kit or equipment to take part, just comfortable clothes and a pair of sports shoes. Members can book online up to three days in advance. We have over 70 different sports clubs at The University of Nottingham, offering a huge variety of opportunities whether you are playing for fun or want to compete at the highest level. From netball to rugby to caving – there is something for everybody! To find out more about how you can join check out our sports club listings The Just Play programme offers fun weekly sessions for students wanting to try a new sport or play on a casual basis, with no commitment to a team. Sessions are just £3 for non-members (free for sports members) and you can turn up to as many as you want. Come along with your friends or on your own – there will always be a friendly face to greet you. Sports available include Badminton, Futsal, Netball and even Sky Diving – check out the weekly timetable for details. The University of Nottingham runs the biggest intramural sports (IMS) programme in the country with leagues on Wednesdays and weekends. Sports include football, netball and volleyball and no sports membership is required. You simply sign up with some friends, your hall or a society. Visit the IMS webpages for more information or ask your Hall JCR Sports Sec about joining a team. It doesn’t matter if you’re a regular sports leader looking to develop in your particular sport or completely new to Sport Leadership - there are a variety of programmes available. The academy offers a breadth of opportunities for students to develop their wider skills, boost their CV and gain training qualifications across a range of different programmes or initiatives. With excellent indoor and outdoor facilities, amazing choice and state-of-the-art equipment available at each campus, getting involved and meeting new friends has never been easier. As well as national standard 3G and sand-dressed pitches, the University boasts over 40 grass pitches at our Highfields and Riverside Sports Complex venues, providing an extensive student sporting programme throughout the year. The David Ross Sports Village also has a 25m 8-lane swimming pool. Use of the pool is included in your UoN sports and fitness membership. Several clubs such as swimming and water polo use the pool, you can simply swim in your own time or attend an aqua fit class. To find out more about opening times, swimming lessons and crash courses, visit our swimming pool page. Whether you want to participate for fun, fitness, to achieve your personal best or even to compete in the Paralympic Games, our Disability Sport Officer and rest of the University’s Sport Department are here to support you. We also work closely with the Students’ Union and Student Support Services to deliver an inclusive sporting programme for everyone at the University. Men’s Health Active is a new initiative which has been designed to encourage male students (and those who identify as male) to use sport and physical activity to help them maintain good levels of mental health. Hitting the treadmill not for you? Take advantage of our beautiful campuses and head outdoors. Have a look at our campus maps to find out how you could fit different routes into your daily routine or why not try our brand new Active Trail on University Park with five outdoor gym stations? Cycling is a great way to keep fit whilst on your way to lectures or exploring Nottingham – the city boasts an extensive cycle network and cycle lanes are marked out on campus. Sports membership Follow us on Twitter Find us on Facebook Join us on Instagram telephone: +44 (0) 115 951 5151 fax: +44 (0) 115 951 3666 email: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}