{
    "url": "https://www.nottingham.edu.my/CurrentStudents/Your-voice/Academic-feedback/Student-Charter/UNMC.aspx",
    "content": [
        {
            "p": "Here is a list of what you can expect from us in the areas of: That we will strive to support, recognise and reward teaching excellence and innovation. That we will provide you with the opportunities, resources and support to assist you in your studies with a view to creating an academic environment that is intellectually stimulating, research rich. Read more . . . Information and support to enable you to make the right course choices. The opportunity to become part of an international community of learning as part of a University with campuses in three countries as well as international exchange partners and a t hriving international student population. The opportunity where possible to spend part of your course overseas at our campuses in China and UK, or one of our many academic partners around the world, helping to instil the global perspective into your studies that so many employers are seeking. A culture of listening and responding to you, as well as business, industry and the community of which we are a part. Engagement with a range of surveys including the Student Satisfaction Survey and delivery of positive change as a result. Innovation and diversity in the methods we use to assess your learning. Feedback on your learning delivered impartially, and in a way that promotes learning and facilitates improvement. A learning environment that includes the provision of teaching space, access to libraries, availability of new technologies and access to a comprehensive range of learning materials. Read more . . . Wherever possible, digital services on the basis of ‘any time, any place, any device’: with 24/7 availability, both on and off campus, to be consumed on any appropriate device. Award winning campuses, both in the UK and abroad, and a commitment to continually invest in the University’s grounds, buildings and facilities. A comprehensive range of specialist services, including counselling, mental health, academic and disability support, career and personal development, international student support, financial support and childcare. A varied range of accommodation choices, and advice and information relating to the options available. Read more . . . Access to Surau and other worship facilities, Health service and other local community provision to complement on-site services. Pro-active encouragement in the development of healthy lifestyles via our Healthy U initiatives. Academic tutorial support, including pastoral support. Clear, concise information regarding fees and their billing to you in a timely manner. Clear information on payment methods and deadlines. Read more . . . Information and support to help you make informed choices about your finances as a student and advice on any difficulties you encounter along the way. An environment that strives to be safe, secure and free from discrimination or harassment. The promotion of equality of opportunity for all, where possible within the local legislative framework. Read more . . . A Careers and Employability Service offering information, advice and guidance to help you research your career options and ideas. Read more . . . Practical support to help you develop your CV, job or course application and interview preparation. A job vacancy service advertising graduate vacancies, internships, PhD opportunities and voluntary work. A comprehensive event programme offering workshops and recruitment fairs. An award winning Nottingham Advantage Award scheme to recognise your extra- and co-curricular activities and their importance in making you more employable. A University committed to engaging with and seeking respect from the local community. A University that fully supports and endorses its Students’ Association and the opportunities it offers to add great value to your time studying at University. Read more . . . A clear complaints procedure which is straightforward to use, and aims to reach prompt conclusions. Read more . . . telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}