{
    "url": "http://www.nottingham.ac.uk/currentstudents/study-abroad/index.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy The majority of University of Nottingham students have the opportunity to have an international experience during their university career. Nottingham has 200 university partners in 40 different countries spanning six different continents across four different exchange programmes. These include Inter-campus exchange, International exchange and International summer schools. Applications usually take place during the autumn semester of the academic year before you would go on exchange. To see what options are available for your specific subject area go to the Global opportunities by school webpages. Find us on Facebook Join us on Instagram Global opportunities blog Global opportunities events Study abroad at Nottingham UK Students at the University of Nottingham UK can apply to study for a semester or an academic year at one of our partner universities across the world Students based at the University of Nottingham UK can study for one semester or an academic year at our China and Malaysia campuses Opportunities for University of Nottingham UK undergraduate students to study at an international summer school Funding for study or work placements in eligible countries for University of Nottingham UK students Global opportunities for your specific subject area Study abroad experiences of University of Nottingham UK students A report by the International Education Unit* found there was a lower unemployment rate amongst students who studied abroad and 92% of students graduated with a 2:1 or 1st, as opposed to 80% for those who didn’t study abroad. You don’t need to be able to speak another language to study abroad, as most partner universities including those across Europe and our overseas campuses teach in English. While making an effort to learn some of the local language before you leave will help you settle in, you don’t need to be a fluent speaker to have a great study abroad experience but studying abroad is a great way to improve your language skills. While some courses have a degree structure that means you can’t take part in a ‘traditional’ one semester or year-long exchange, they may have other opportunities like field trips, one or two week placements abroad or you may be able to do a year in industry abroad. All undergraduate students have the opportunity to apply for an International Summer School through the University of Nottingham. Money is often seen as one of the biggest barriers to studying abroad but it doesn’t have to be. The range of opportunities at Nottingham gives you the chance to look for a study abroad option that fits your budget by choosing a country with a low cost of living, a country close to home with low travel costs or a short-term study option. If you study abroad for a semester or year you will receive a tuition fee discount, be eligible for an overseas rate of loan and be able to apply for the Student Finance Travel Grant. *2019 International Education Report: Gone International Mobility Works. Report on the 2017-18 graduating cohort. Universities UK International"
        }
    ],
    "pdf_files": []
}