{
    "url": "https://www.nottingham.ac.uk/currentstudents/study-abroad/turing-mobility-funding/turing-mobility-funding.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Undergraduate and postgraduate students have the opportunity to apply to take a study placement and/or a work placement in another country, depending on their degree programme. Study placements take place at one of our partner universities. Work placements include the opportunity to work as a Language Assistant or undertake paid or unpaid work in another European country. Students participating in eligible placements can apply for Turing funding, which will be provided by the UK's Turing scheme. Please note that funding is not guaranteed, priority will be given to students from low income households. If you still want to apply, please send an email to turing@nottingham.ac.uk with the details of your placement and your name will be added to our waiting list. Please note that students on the waiting list will be contacted by the Turing team ONLY if the University has enough money to fund the placements for which they have applied. Click the link below for more information on the Turing grant and how to apply. Turing Mobility Funding Moodle module This page was updated on 07/06/2024 at 5pm. Global opportunities by school Study abroad finance Study abroad disability information We have a wide range partner universities, for information on which partner universities and/or work placements are available for your school/department and the name of your academic adviser please see Global opportunities by school. Please visit Global opportunities by school to find our if your degree programme offers study abroad opportunities. Your home school/department will be able to confirm the minimum academic requirements in order to be eligible to apply for the programme. For information on studying at Lunds Universitet, Universiteit van Amsterdam or University College Dublin through International Exchange please refer to the International Exchange webpage. Students require a minimum overall academic average of 60% in order to be eligible to apply for International Exchange. Please refer to your academic school/department for the minimum academic requirements for school-based exchanges. A number of academic schools/departments at the University of Nottingham have student exchange agreements with partner universities. Students from the Department of Modern Languages and Cultures have the opportunity to study or work in Europe during their third year abroad. Each academic school/department which offers study abroad opportunities has a member of academic staff who is responsible for the exchange agreement with the partner university, acts as the academic adviser, agrees your academic study while abroad and provides advice and support prior to, during and after your study/work abroad experience. You will need to liaise with your academic adviser to find suitable modules at your host university before you apply. In some schools/departments, the credits gained while studying abroad will count towards your Nottingham degree. To find out the name of your academic adviser please visit Global opportunities by school. Work placements are only available for a minority of schools/departments. If you are undertaking a work placement, you will need to arrange this yourself, but it must be approved by your school/department in advance. You may also need to complete a work-based project. Your academic adviser/Year Abroad team will be able to confirm the requirements. Language Studying abroad in Europe is not just for language students. Increasingly our partner universities are able to offer courses in English, as well as the host language. For a growing number of countries including the Netherlands, Italy, Finland, Germany, Norway and Sweden, you don't need to speak another language fluently and you will be able to study in English. Check with your academic adviser to find out what level of language you will need to study abroad in Europe. Students participating in school-based exchanges are advised to speak to their academic adviser for information on the selection process and internal deadlines. Students participating in International Exchange should visit the International Exchange webpage for further information. If you are selected for a placement, your name will be forwarded to your host university by your academic adviser. Your allocated host university will then send application information in due course. If you are interested in studying abroad at Lunds Universitet, Universiteit van Amsterdam or University College Dublin through the International Exchange, please visit the International Exchange webpages for information on the application process and deadlines. Students from the Department of Modern Languages and Culture will receive information from the Year Abroad team. In order to apply for Turing Mobility Funding, you must complete an internal application to the University of Nottingham Turing Funding team. Nominated students can access further information and a link to the Turing Mobility Funding application form by self-enrolling on the Turing Mobility Funding Moodle module. Students who study or work abroad as part of their degree will pay a reduced tuition fee to the University of Nottingham for the academic year you study/work abroad. For further information please visit the Study abroad finance page. All students studying or working abroad on placements from 28 days to 360 days (1 to 12 months) in length are currently eligible to apply for Turing Mobility Funding, which is paid to the University of Nottingham by DfE, the UK Government's agency that in 2024 has replaced the British Council and Capita. Students who will be studying or working abroad in 2024/2025 should contact their academic adviser in their home school/department regarding any practical or academic questions. Detailed information regarding Turing Mobility Funding can be found on Moodle. Details of the Moodle page will be given to approved students. Students who have not signed a contract prior to the start of their placement will not be eligible for funding. International exchange Global opportunities events LGBTQ+: Stonewall Global Workplace Briefings Careers and Employability Service: Internships abroad If you have any questions about studying abroad, please contact the appropriate academic adviser in your school/department in the first instance. To find out the name of your academic adviser, please see Global opportunities by school. If you have any questions about studying at Lunds Universitet, Universiteit van Amsterdan or University College Dublin through International Exchange please contact the Global Opportunities team. If you are an outgoing student with a question about your Turing Mobility Funding, please contact the Turing Mobility Funding team"
        }
    ],
    "pdf_files": []
}