{
    "url": "https://www.nottingham.ac.uk/CurrentStudents/worried-about-assessments/Index.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Assessments play a big part in your university experience, and we know this can be a worrying time. This webpage has been designed to bring together services and resources to help you prepare for these periods and manage your wellbeing. We’re here to support you every step of the way throughout your journey with us and we understand that assessments can be a particularly overwhelming time. That’s why it’s important to take extra care of your wellbeing during these periods. Please explore the services and resources available to you below and don’t hesitate to engage with them should you feel you need to. We want to do all we can to make sure you go into your assessments feeling confident and prepared. There are plenty of resources available to you, which have been summarised below. These include study planners, revision tips, resources for studying effectively, quiet study spaces and more. You can also explore our assessment and examinations webpages. This is where you’ll be able to find key dates and examination timetables as well as information relating to in-person and e-examinations, outcomes and results, exam adjustments and our regulations and policies (eg academic appeals). Extenuating circumstances (ECs) are events that are unforeseen and out of your control, and we understand that this can affect your performance in assessments or ability to submit your coursework on time. Some examples may include illness (physical or mental); injury; family illness and bereavement. Our EC policy is in place to support you should you experience any such instances – make sure you submit your claim at your earliest opportunity so we can ease any anxieties by putting the right measures in place to support you. There’s also further wellbeing support available should you need it, so please don’t hesitate to reach out for this. See our full list of acceptable EC circumstances If you have any questions, a comprehensive list of FAQs - as well as other methods to reach out to us – are featured on the Student Enquiry Centre. We’ll be holding a range of webinars and drop-in sessions where you can receive expert advice from our university staff. Communications and Marketing University Park Campus Nottingham, NG7 2RD telephone:+44 (0)115 82 32353 e: studentcommsoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}