{
    "url": "https://www.nottingham.ac.uk/digitalengagement/",
    "content": [
        {
            "p": "A unique opportunity to join a world-leading university Find your role At the University of Nottingham we are making fundamental changes to how we engage with our students, staff and partners, because our future depends on it. Our graduates are tomorrow’s health crusaders, wealth creators and law reformers. They are our virologists, environmentalists and world leaders. They are our breakout artists, inventors, and tech entrepreneurs. To continue to attract the brightest, best and most brilliant to our university, we must create irresistible customer journeys and exceptional user experiences before, during and after their time with us. For our future students, we envision exceptional, contextual, connected, automated, seamless, omnichannel, hyper-personalised engagements. From the moment the University of Nottingham first enters their consciousness, to the day we welcome them onto one of our beautiful campuses. Whether on our website, or our mobile app. Connecting with our lecturers, or an AI bot. This is about delivering remarkable experiences at every touch point, through every channel. With our new skills, insights and platforms we will deliver services, experiences and engagements that make us stand out from the crowd. But transforming the student recruitment experience is only the first step. By investing now in our people, processes and technology, we are creating a future-fit capability. One that can be deployed to differentiate, improve and enhance experiences for our staff, students, alumni, researchers, publics, partners and policy makers. Our roadmap to engaging digitally combines our people, processes and technology with experience experts Adobe and Microsoft. This creative collaboration will see us harness the power of data and empower our people to design the powerful customer experiences that will ignite our vision for Digital Engagement. “The partnership between the University of Nottingham, Adobe and Microsoft brings together the world's leading technologies and expertise to deliver a truly world class Customer Experience platform. This creative collaboration reaffirms the University's commitment to empower students, engage globally and pioneer creative innovation. This programme will position the University as not only a leader amongst Higher Education peers, but as an equal amongst the world's leading private brands in delivering truly exceptional experiences for students, staff and partners.” Ronal Karia – Adobe Experience Cloud Director UK&I See our privacy policy."
        }
    ],
    "pdf_files": []
}