{
    "url": "https://www.nottingham.ac.uk/dts/teaching-and-learning/lecture-recordings/lecture-recordings.aspx",
    "content": [
        {
            "p": "Engage records both presentations and audio/video of the presenter and enables active learning. It is delivered by Echo360. Staff can access Engage in all centrally managed teaching rooms (use the Echo360 icon) which can also be installed on desktop computers or laptops Record your lecture audio and visuals either in a teaching room, your office or from home Live stream your lectures from whichever location you are comfortable teaching from Add interactivity into your presentations for use in your recording or live stream Post live questions whilst teaching or onto the recording afterwards to encourage student conversation around the materials Create interactive videos using quizzes and polls in pre-recorded videos Edit videos into chunks or remove unwanted sections for use as new teaching materials New to Engage? Staff must first request access to Engage. Students can view Engage recordings through their Moodle modules or by installing the mobile app on their smartphone or tablet (search for Echo360 in the app store) Students are able to access recordings of teaching sessions to enable them to review content at a time, place and pace that works for them and to help them master difficult concepts Engage has tools to support students with their learning, such as voting and quizzes New to Engage? Students must first click here to create an Engage account. Further details about first access and how to access Engage resources for a course (module) can be found here. Please ensure you have first requested access (staff) or clicked the link for first access (students) as per the information above. When logging into Engage: Log in to Engage The following Moodle pages provide support and all you need to know about Engage: Introduction to Engage (Staff) Introduction to Engage (Students) Campus IT support can provide technical support for the Engage service: Campus IT support If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}