{
    "url": "https://www.nottingham.ac.uk/dts/knowledge-hub/it-induction/before-you-start.aspx",
    "content": [
        {
            "p": "Once you have accepted your offer at Nottingham, you will be required to undertake a number of key tasks to: These are vital steps before you start your course - all instructions are detailed below. For our introduction, play the IT Induction video - Part 1 If you are planning to purchase new equipment or using an existing device to help with your studies, expand the box below for a summary of our advice and general specification. Please contact your school or department before purchasing a new device if you have any queries. Getting prepared - check our advice on what equipment you need: All students get Microsoft 365 for free during their studies. You will need access to a phone, tablet and/or laptop device to activate your IT Account and set up Multi-Factor Authentication (MFA). We recommend you have a suitable laptop to work on, as per this general specification: Check the student equipment page for all recommendations and items that could help improve your comfort while studying. Equipment advice Check your personal email inbox three weeks before you are due to start your course. You will receive an email containing your student ID – this is what you'll need to activate your IT account. Please ensure that you set your security questions and change your password. Student IT account Many services will require you to use Multi-Factor Authentication (MFA) to approve access. We recommend installing the Microsoft Authenticator app on your smartphone. Setting up MFA Once you have an active university account, sign in to Microsoft 365 and check your Outlook email regularly - this is how we will communicate with you. Sign in to Microsoft 365 and select Outlook to access your email. We recommend using the Microsoft Outlook app on your smartphone. Find out how to configure a range of devices (iPhone, iPad, Android, etc) to connect to your email. Get up and running by following our email account guidance: Email account guidance Get the Microsoft 365 and Teams apps Download the latest Microsoft mobile apps on your smartphone. Download Microsoft Teams as you'll be using this throughout your studies. All students can install Microsoft 365 (desktop and mobile) applications on up to any five devices for free for the duration of your studies. Microsoft 365 As a new student, you must register no later than three weeks after your course start date. Otherwise, you will not be able to join your course. You must first activate your IT account - see step 2. Once you have activated your username and password, we will send an email to your university email address inviting you to complete online registration. Online registration Completed these steps? Move on to the second part of your IT induction when you arrive. Need help? Our dedicated IT Service Desk is available 24/7, and we have experts available to help with all your IT needs. We offer specialist support with IT accounts, passwords, MFA and all other IT services. Call on +44 (0)115 95 16677 From Monday - Friday, between 8am - 5:15pm, our in-house team will be on hand to take your calls. Outside of these hours, you will be put through to an out-of-hours team, who will endeavour to resolve your issue. IT Service Desk"
        }
    ],
    "pdf_files": []
}