{
    "url": "https://www.nottingham.ac.uk/dts/communications/remote-working/vpn.aspx",
    "content": [
        {
            "p": "VPN is a service which allows users who are connected to the internet to access University-restricted web resources and other services off campus. VPN provides a secure connection between your device and the University network. Access systems remotely which can normally only be accessed whilst on campus Access specialist licensed software You are working with personal or sensitive data whilst connected to public WiFi Multi-Factor Authentication (MFA) increases the security of remote access services by requiring multiple forms of verification. Users must approve access requests via the 'Microsoft Authenticator' app each time they access a remote service such as VPN or Remote Desktop. You will need: Install 'Microsoft Authenticator' from your mobile device's app store Configure MFA across devices - once MFA is installed on your mobile device, use your university email address and password to sign in to https://aka.ms/mfasetup on your computer Configure MFA instructions (Workspace log in required) Download FortiClient VPN from https://remote.nottingham.ac.uk VPN access request (if not a permanent member of staff) Login with your university email address and password Approve the connection on your mobile device through the Microsoft Authenticator app, or enter the code when prompted Once logged in, click on 'Download FortiClient' to install on your desktop/laptop following the on-screen instructions and using any default settings System requirements For all unsupported operating systems, please use the \"Quick Connection\" web link at https://remote.nottingham.ac.uk/ to access a SSL VPN connection. are available on Workspace (Workspace login required). Follow the steps for your operating system to set up Fortinet VPN (Windows, macOS, iOS (iPhone and iPad), Android, Linux) Configure VPN instructions (Workspace log in required) Enter your university email address and password on the FortiClient VPN A pop-up message should appear on your desktop or laptop confirming that you are now connected to the UoN VPN service Please only use the VPN during the time when you need to access university web resources or systems that are not available off campus. Detailed instructions with screenshots are available on the links below (Workspace log in required): Multi-Factor Authentication Virtual Private Network (VPN) If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}