{
    "url": "https://www.nottingham.ac.uk/dts/communications/remote-working/access-systems.aspx",
    "content": [
        {
            "p": "University open access applications and systems can be accessed remotely from any device or location. Staff can access almost everything they have on a University PC on an alternative computer off campus via the internet, including purchasing via Business World (web client), managing jobs via Vacancy Manager and accessing the central student records via Campus Solutions. Please check the full list on Workspace to check the level of access required for the systems you use. Access your files and many services and software applications from any device or location Systems either have open access or require you to use the VPN or Remote Desktop to use them To access the file store drives Home (Z), Shared (S) and Research (R) on your University Windows managed device when away from campus, you can either: Access via the web at files.nottingham.ac.uk Map the drives by connecting to the University VPN and then running the Logon Script. Detailed instructions on connecting to the University VPN are available on Workspace (Workspace login required): University VPN Many University systems can be securely accessed via the internet from any device or location – a full list of these can be viewed on Workspace. All services listed below are open access from off campus and do not require VPN, Remote Desktop or the Virtual Desktop If services are not available off campus, please use: Many applications can be accessed and used from any device or location. The table below lists some of the frequently used applications. A full list of available applications and their usage rights can be viewed on the Software Library (Workspace). All software listed below are accessible from off campus and do not require VPN, Remote Desktop or the Virtual Desktop If software is not available off campus, please use: Staying in contact with colleagues is especially important when working remotely. In addition to mobile telephones for calls, the University has two recommended solutions for text, voice, and video communications when working remotely: Internal calls - Microsoft Teams Every member of staff and student has access to Microsoft Teams via their Office 365 account Can be used through a web browser, or the desktop or mobile application Enables instant messaging, virtual team meetings and voice calls with other University colleagues Teams Access Request Teams Advice and Guidance (Office 365 SharePoint) Note: calls to external numbers is not currently possible with Teams and any communication will use your data allowance if you are not connected to a wireless network. Online Meetings External calls - Skype for Business Skype for Business is only available to University Staff and Postgraduate Researchers Install on a personal computer, laptop or mobile device To make or receive external calls, please request your University telephone number to be transferred to a Skype for Business account if you do not have a mobile phone that you can divert calls to Note: calls made on mobile devices will use your data allowance unless you are connected to a wireless network. External Calls Full list of frequently accessed systems, available applications and their usage rights (Workspace log in required): University systems Software Library If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}