{
    "url": "https://www.nottingham.ac.uk/dts/accounts-and-access/it-account-and-password/multi-factor-authentication.aspx",
    "content": [
        {
            "p": "Multi-Factor Authentication (MFA) increases the security of access to services by requiring multiple forms of verification. MFA is used for extra security in addition to your university password. MFA is required to approve access to a number of services (such as Microsoft 365, VPN, Virtual desktop and Remote desktop). MFA is required by all staff, students and associates. If you haven’t used MFA recently, we would recommend you check your chosen MFA settings - you can view and change these at any point. In order to set up Multi-Factor Authentication (MFA), you will need: There are a variety of ways to approve authentication. This will depend on the device you have and your preferred method, as listed below: Select your preferred authenticator method below and follow the set up instructions. Watch our video instructions to set up the Microsoft Authenticator app. If you use the Microsoft Authenticator app, you may see a number on-screen when logging into a system that requires MFA approval. Simply enter that number into the Microsoft Authenticator app to log in. If you have configured your device to opt-in to phone sign-in, as outlined in Part 3 of setting up the Authenticator app, you will no longer need to enter your password. Microsoft introduced number matching to help eradicate the risk of accidental MFA approval should your account be targeted by criminals. Check our FAQs for some common questions asked. If you need help with the MFA set up instructions or have questions about the approval methods, you can ask our IT support teams. Find out more here: Help and support Follow the instructions below for your preferred authentication method. Follow the steps below in Part 1 and Part 2. You can also watch a video of these steps on MediaSpace. We recommend the 'Microsoft Authenticator' app because it is the only authenticator application that supports push notifications, which are required by some services and offers the best experience. You may first need to set up an account on the relevant app store in order to download the app. Download and learn more on the Microsoft website. Once the 'Microsoft Authenticator' app is installed on your mobile device, visit the MFA configuration page, by clicking the below button, on your computer and then follow the steps below: Configure MFA Top tip: when using MFA to approve sign in requests, we recommend having the app open and ready. What is phone sign-in? Phone sign-in is a Microsoft feature that allows users to authenticate MFA requests using their smartphone alone – no password is required. What is the benefit of enabling phone sign-in? Passwords are a primary target for cybercrime. Phone sign-in helps to mitigate this risk as you will not need to remember passwords or worry about others stealing them. Phone sign-in makes logging into systems quicker and more secure. What steps do I need to follow to start using phone sign-in? In order to start using phone sign-in, you must follow the steps below. You can complete these steps now. If you use the Microsoft Authenticator app on more than one phone, you will also need to follow the above steps on your other phone(s). What will I see when logging into a system that requires MFA? Once you have enabled phone sign-in, the next time you log onto a system that requires MFA, such as Microsoft 365, you will be prompted to enter your password as usual. After doing so, you should then see an option saying ‘Use app instead’ - click on this to start using phone sign-in. You may see a page saying ‘Request has not been sent’ in place of a number. This simply means there is a pending authentication that has not been approved/ denied within the app. You will need to open and approve or deny the authentication. If you do not currently use the Microsoft Authenticator app to log into systems, you will experience no change and you will be able to log into your systems as usual. What if I don’t follow the steps above? We strongly recommended you enable phone sign-in on your phone. It is more secure, and you will no longer need to enter your password into systems that use MFA. If you do not enable phone sign-in, you will need to enter your email address and password into systems, followed by the number matching element in the Microsoft Authenticator app. If you have any questions, please contact the IT Service Desk in the first instance. Using the verification code method, you can set up an app of your choice on a mobile device or laptop / desktop computer. Choose an authenticator app, here are some suggestions: There are other apps available. Part 2 gives generic instructions for setting up the verification code method. However, we have more detailed guides on Workspace for Authy and WinAuth. Once the authenticator app of your choice is installed on your mobile device or computer (laptop / desktop), visit the MFA configuration page, by clicking the Configure MFA button, on your computer and then follow the steps below. Generic instructions Finally, sign into portal.office.com to access your university Microsoft 365 account. Enter the six-digit code displayed in the authenticator app on your device and click 'Verify' to sign in. Before you start, have your mobile phone ready and in range of signal to receive text messages. Note: Users with a Chinese mobile phone number should not use this authentication method. Please use the Microsoft Authenticator app or Verification code as an alternative. When ready, visit the MFA configuration page by clicking the below button on your computer and then follow the steps. Finally, sign into portal.office.com to access your university Microsoft 365 account. You will be sent a verification code to your phone. Enter the code and click 'Verify' to sign in. Top tip: when using MFA to approve sign in requests, we recommend having your mobile phone ready. Below are some common questions that may help you. Click on a question to show the answer. For further FAQs, visit the Securing 365 SharePoint site. If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}