{
    "url": "https://www.nottingham.ac.uk/dts/communications/email/email-filtering.aspx",
    "content": [
        {
            "p": "Unsolicited email is a major concern for the university Microsoft 365 Defender checks email for spam, phishing and viruses before it is delivered to your mailbox. All incoming email, including emails addressed to sub-domains of the university domain and other non-Nottingham domains are directed through Microsoft 365, where email is checked against a number of mail delivery rules and either delivered, or held in quarantine. If an email is held in ‘quarantine’ it will remain there for 30 days or until it is released or deleted. Guards against known and unknown viruses, trojans, phishing emails, SPAM and other threats Every university email account holder has automatic access to Microsoft 365 Security Defender You can check for quarantined messages anytime from the Microsoft 365 Security Centre: Microsoft 365 Quarantine page Emails are quarantined for several reasons; the three main reasons are categorised as: Please note, notifications are only sent if you have a new SPAM email in your quarantine and it can take up to 24 hours to receive notification after the SPAM email has been received. Example of SPAM notification email: You will be sent a notification email (spam notification email shown above) from reports@nottingham.ac.uk * if a new email has been quarantined as SPAM. You will not receive notification of emails quarantined for any other reason. The notification contains a summary of each new quarantined item, detailing the sender, subject and date. From this email you have the option to: * quarantine notifications may go directly to your junk email folder, please check the junk email folder. Anything quarantined is held for 30 days for you to review and release or request release if it is genuine. Any email that has not been released will be automatically deleted after that time. To review all messages that are quarantined for reasons other than SPAM, it is advised you routinely check your quarantine page by navigating to: security.microsoft.com/quarantine. On the quarantine page, to release a message that has been wrongly quarantined, tick the checkbox next to the email that corresponds to the one you want to release and then click the 'Release' ✓ button. This will then trigger the email to be delivered and a message will open confirming the email has been released. If you suspect an email has been quarantined incorrectly and is flagged with something other than SPAM, you have the ability to 'release' the email. Depending on the severity, you may have to 'request release', where a security administrator will review the request. To ensure quarantine notification messages do not go into the junk email folder, we recommend adding '@nottingham.ac.uk' to Outlook's safe sender list. Follow these instructions for Outlook web or Outlook desktop app: If you have any questions or require support, please contact our help and support teams. If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}