{
    "url": "https://www.nottingham.ac.uk/dts/communications/conferencing/video-conferencing-and-broadcasting.aspx",
    "content": [
        {
            "p": "Communicate, collaborate or broadcast with others. Video conferencing and broadcast solutions range from group meetings to webinars and symposiums Services can be used to host meetings at the University for both internal or external audiences Note: Internal meetings or University hosted events should only use approved services (Zoom is not supported by the University). Microsoft Teams is the preferred choice for all internal and external meetings. Guidance for setting up a Microsoft Teams meeting (SharePoint login required) Engage is our primary service for recording lectures and seminars. Further information about Engage A Microsoft Live Event: The Virtual Broadcast Group offers advice and guidance for using Microsoft Live Event (SharePoint login required): Virtual Broadcast Group SharePoint site StarLeaf is available to staff on request. Before booking a video conferencing call, please consider the following: You will need the following information about the other site(s) you are calling before you can book the call: Submit a video conference booking request Video Conferencing suites are centrally bookable via the Timetabling Office. Jubilee Campus King's Meadow Campus If a Video Conferencing suite is not required or unavailable, we recommend University staff use Microsoft Teams. For more information and guides on how to use Teams, please visit the Office 365 SharePoint site (SharePoint login required): Microsoft Teams SharePoint Campus IT support can provide technical support for video conferencing calls, if required. For bookings between 8am - 6pm, Monday to Friday this service is free, but outside of these hours there is a charge for technical support. For support, or to arrange a system demonstration, please contact the Campus IT support team for the location of your booked room. Campus IT Support View case studies and scenarios using these conferencing services (SharePoint login required): Virtual Broadcast Case Studies If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}