{
    "url": "https://www.nottingham.ac.uk/dts/accounts-and-access/data-and-storage/data-and-file-storage.aspx",
    "content": [
        {
            "p": "The university offers a range of file storage solutions for students, staff and researchers Please note, the legacy file store website (files.nottingham.ac.uk) has been decommissioned. Users can continue to access the file store, Shared (S:) and Research (R:) drives by the following methods: Students, staff and researchers all have access to Microsoft 365 OneDrive storage On-site shared drives Students, staff and researchers all have access to: Microsoft Office 365 is the University's key digital collaborative platform. 5TB of OneDrive storage, which is included with your Microsoft Office license, should be used for personal files. When collaborating with others we recommend the use of Teams. Each Team is supported by 1TB of dedicated storage. You can also use SharePoint to create communication sites (think blogs, and shop-fronts) for projects and other unique ways of storing and sharing your data. All Office 365 data is secure, encrypted and accessible via the Internet using a web browser. You do not need to be on a University network to work, study and collaborate. Staff, researchers and PGRs all have access to: There are on-site storage systems - S: for Shared and R: for Research. On-site, these can be accessed via a university provided Windows machine. If you need access to those drives when off-site, you can do this when connected to the Virtual Private Network from a university provided Windows machine. For Mac and other non-Windows users, we recommend access via the Windows Virtual Desktop service. Alternatively these networked drives can be mapped. All of the mentioned On-Site storage systems may be accessed off-site: It is the responsibility of individuals to ensure that they understand privacy issues, the sensitivity of their data, and ensure retention/deletion takes place in line with regulations and laws. Campus IT support should be advised of any specific protection requirements so they can ensure the data security is compliant. Further information and advice on retention schedules, data protection and records management is available in university policies. All on-site file stores are backed up and users can request the restoration of lost data Access storage for UNIX specific systems via your Campus IT support team Microsoft Office 365 OneDrive offers 5TB of individual storage. You can also create Teams within Office 365 that will provide an additional 1TB of storage - more can be requested if required. For Research (R: drive), please review the Digital Research SharePoint for storage guidance. For Shared (S: drive), we are no longer able to increase storage space. Office 365 - particularly a Team with its own storage - is the recommended route for shared storage. Digital Research SharePoint Researchers may request storage on the University’s Research file service, which provides a basic capacity of 1TB and is available by contacting Campus IT support. Additional Research storage can be awarded up to 5TB, however, beyond that amount, further approval is required. We strongly advise Researchers to use OneDrive and Teams, both for data security and to guarantee access to help should something go wrong. We do not recommend the use of Google Drive, DropBox, or other free or 'pay to use storage' systems for storage of your University data. This is because we cannot help you should there be a problem, and the security of that data cannot be guaranteed by the University. This may also be in breach of the University's information security policy. Information security policy If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}