{
    "url": "https://www.nottingham.ac.uk/dts/communications/remote-working/virtual-desktop.aspx",
    "content": [
        {
            "p": "The Virtual Desktop allows you to connect to a Windows 10 virtual desktop environment over the internet. Virtual desktop is a virtualisation service that runs in the cloud. The service is available to all Staff and Students on any device. There are five virtual desktops available, see descriptions below. Gives you instant access 24/7 to a fully configured virtual University computer Access a range of specialist software applications without the need to download on your personal or work device Allows access to restricted web resources and University Filestores Note, the Virtual Desktop requires an Internet connection. Please do not use this service for general Office applications. For more details, visit the Software page. To use the virtual desktop, you will need to install Microsoft Remote Desktop client (recommended) or use a web browser and follow the steps for your operating system: Software can be found on the Desktop or within the UoN Applications folder in the Start menu Detailed instructions with screenshots are available on the links below (Workspace log in required): Virtual Desktop user guides Unless you are a student or staff in Computer Science or Engineering, please use the general purpose desktops. You will only see desktops which are relevant to you, and you won’t see all the desktops listed below. A general purpose desktop for all students with access to your files and UoN Applications. A general purpose desktop for all staff with access to your files and UoN Applications. A specialist desktop for staff and students in Computer Science with access to your files, UoN Applications and specialist software. A specialist desktop for staff and students in Engineering with access to your files, UoN Applications and specialist software. This desktop should only be used to access software which requires graphically intense processing. Software can be found on the Desktop or within the UoN Applications folder in the Start menu. To access software on the Virtual Desktop: For a full list of applications available on each virtual desktop, please see the Software Library. Software on Virtual Desktop If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}