{
    "url": "https://www.nottingham.ac.uk/dts/help/laptop-loan-and-repair/laptop-loan-and-repair.aspx",
    "content": [
        {
            "p": "A laptop loan and repair service for students. Our dedicated team, based at the Portland Building, offer a laptop loan service for students We also repair students' personal laptops You will need to book an appointment to use the Laptop Loan and Repair service. Complete the following form to request an appointment - we will contact you within two working days: Request an appointment Use the following link to book an appointment to return your loan laptop: Book appointment to return laptop Loan a laptop for free for 30 days (loan periods for more than 30 days can be requested under special circumstances) Available laptops Windows 11 laptops (with Microsoft 365) You can install software as required, and the hard drive is wiped after you return the laptop Laptops are loaned on a first-come, first-served basis. Laptops can be requested by completing this form Conditions of loan Software and operating system repairs Available for personal laptops running Windows*, macOS or GNU/Linux Available to all students at the University of Nottingham Your laptop will be booked into our workshop and we will let you know when it is ready to collect * We will only support Windows 10 devices onwards. Older versions of Windows are not longer supported by Microsoft. We can assist with helping you upgrade to a newer version of Windows (where possible). Note: For minor software issues, please visit the on-campus or virtual Smart Bar. We do not offer counter support or on the spot repairs. For simple software issues and general advice, please contact the Smart Bar service. Our IT specialists are on-hand to fix a wide range of personal devices for students. We offer free advice on how to resolve technical problems. Please note this is a student only service. Please make sure you bring the following items with you to your appointment: At the time of your booked appointment, go to: Laptop Loan and Repair, Portland Building, B09, B floor on University Park (building 15). If you have any questions about this service, you can contact us at loan-repair@nottingham.ac.uk. You can also get general advice and other simple fixes from our support team at Smart Bars: Smart Bar"
        }
    ],
    "pdf_files": []
}