{
    "url": "https://www.nottingham.ac.uk/dts/researcher/digital-research-service/digital-research-service.aspx",
    "content": [
        {
            "p": "Researcher collaboration We are an experienced, innovative team of software engineers, research scientists and data analysts. The Digital Research Service has been developed in collaboration with researchers and experts from across the university. We have experience in leading national research projects and have enabled hundreds of researchers across the university to deliver high impactful research outputs. Bioinformatics is an exciting and relatively new field of science, encompassing the branch of life sciences that applies information technology to the field of biology to help understand various biological processes. Research in bioinformatics can include anything from abstraction of the properties of a biological system into a mathematical or physical model, to implementation of new algorithms for data analysis, to the development of databases and web tools to access them. By utilising the latest methodologies and employing robust analysis pipelines we enable our clients with results that are both statistically robust and reproducible. We can help clients develop an validate novel solutions that are specific to their research or alternatively, if they already work with other bioinformaticians, then our expertise can be used to independently validate the outcomes of projects to give additional credibility to the results. We always advise our clients on the potential alternative uses of data in order to ensure a maximum return on their investments. As this extended period of home working continues, our research community faces ever more challenges in maintaining research and is increasingly looking towards digital technology for support. *** Whether it’s to maintain our strong ethos of collaboration both internally and externally, collect and store data, analyse findings, or conserve and preserve outputs, researchers are having ... The post COVID-19: Digital Research support for researchers appeared first on Digital Research. Researchers at the University of Nottingham thought that they had discovered an occurrences of the bacteria that causes plague in a rats from Liverpool and Vancouver. They were using a widely used microarray based platform specifically designed to identify zoonotic pathogens. By supplementing their analysis with metagenomics sequencing we were able to interrogate the validity ... The post Plague in the UK! appeared first on Digital Research. Researchers at the University of Nottingham in conjunction with scientist at Zoetis were comparing the effect of growth hormones and beta agonists on pig growth. By integrating time series RNAseq, microarray and metabolomic datasets using machine learning we were able to identify some the key gene networks and enriched molecular pathways that could in part ... The post Increasing lean muscle mass in pigs appeared first on Digital Research. View more on the Digital Research blog Data science is the process of evaluating data using analytical, statistical and intelligent tools to discover useful information and aid in decision making. With the advent of modern computing, the widespread use of sensors, tracking devices, electronic records, mobile communication and web browsing large volumes of data in different domains are being produced. Research in data science aims to establish effective tools for fast data gathering, storage, processing and analysis so that the information can be employed by researchers in a timely manner. Our team provides vital infrastructure to undertake advanced data analysis in multi-disciplinary contexts. We offer skilled data analysis expertise, involving several types of data with any size across a range of subject areas and application contexts. Our expertise ranges from data acquisition to final data analysis and archiving. In this blog, we explore the speed and efficiency of using the programming language Julia on the University’s high-performance computer. This blog has been guest-authored by Jamie Mair, a PhD researcher in the School of Physics and Astronomy. The repository for the code given below, which was presented at this year’s annual UoN HPC conference, ... The post Using Julia on the HPC appeared first on Digital Research. In this blog, we discuss an automated process for anonymising interview transcripts, patient notes, or other free-text data containing personal information. Colleagues wishing to share participant notes or interview transcripts, for example as publication appendices or in a research data repository, will likely need to anonymise the data. Anonymisation also comes with a number of ... The post Automated anonymisation of texts and transcripts appeared first on Digital Research. In this blog, we talk about how we created UoN Research Link and some of the technical and design decisions taken. What is UoN Research Link? UoN Research Link is a pilot tool with support until November 2025. It lets you search for University of Nottingham colleagues according to research interests and expertise. It can ... The post Creating UoN Research Link appeared first on Digital Research. Today’s research is not only enabled by, but also dependent on the effective use of research software to undertake new and innovative research. Research software is often bespoke not only to the research domain, but also to the individual research project or group by which it is used. Supporting expert researchers in the creation and utilisation of effective research software and computing resources is a key element in maximising research quality and impact. We can support researchers through the development of research software that is bespoke to their research. We flexibly adjust and adapt the way we engage with researchers to suit their needs, whether it’s end-to-end software development of software, co-development of software in direct collaboration with the researchers, or more advisory engagements to consult researchers on how to design or adapt software to be most effective. In addition, we aim to empower researchers to be able to develop better software through adopting good software development practices. Changing Times How we are using energy is changing. Not only how the energy is generated, but where and when it is used. These changes mean that we are now pushing the limits of how we expected to use our traditional gas-fired power stations, both in terms of the longevity of these sites, the operation ... The post CITRUS – Smarter Power appeared first on Digital Research. Nature is the Best Chemist Nature is the best synthetic chemist, capable of manufacturing chemicals in an energy-efficient manner and with biodegradable by-products. Millions of years of evolution have explored and optimized reaction pathways, and we would be foolish not to exploit that chemistry. Critical to this efficiency are enzymes – biological catalysts – that are not consumed by ... The post Going Greener Digitally with Enzymes appeared first on Digital Research. If you are seeking to leverage the full extent of computational resources for your research, you are likely to end up using a Unix machine to run your software. This is especially true if you are developing software and data analysis pipelines on High-Performance Computing (HPC) facilities, like Augusta – our own HPC facility at ... The post From Subsystem to Super System – Windows Subsystem for Linux, a Gateway to HPC appeared first on Digital Research. PGRs, post-docs and research staff. We can cost staff onto grants (as researchers) but we also have strategic support to help with the development of funding applications. To discuss how we might best support your research, please get in touch. Research tools and resources Services to support your research"
        }
    ],
    "pdf_files": []
}