{
    "url": "https://www.nottingham.ac.uk/dts/communications/conferencing/teleconferencing.aspx",
    "content": [
        {
            "p": "How to use the University's telephone conferencing service The University provides a dial-in worldwide telephone conferencing service for staff via MeetingZone: Can be used without making reservations Monitored and controlled through a browser as well as by the chairperson's (account holder's) phone Monitored for usage and an after-call email sent to the account holder noting the length of the call and the number of participants There are no set-up or rental charges for teleconference accounts. Once an account has been set up, you will be sent an email and welcome pack from MeetingZone, providing information including: Your unique Host Access Code and Participant Access Code Details of dial-in access numbers Request a teleconferencing account If you are chairing the call you will need to: Participants will need to: There are four key access numbers for this service. The first two of these limit the costs to the University without passing large costs on to other participants. Because you have unique participant and host codes, you can have a mix of dial in numbers for the call. Note: VAT will be added to all charges listed. Recommended when dialling from a University extension. No teleconference charge for using this number. Call costs are recharged in your normal monthly bill Recommended for UK-based participants. Call costs are recharged in your normal monthly bill. Teleconference charge is applied to the account holder's account at 5p/min. Recommended for international calls to the UK. Conference charges depend on the number of seconds each participant is present within the teleconference. The current list of dial in numbers is available from the IT Service Desk or by logging in to MeetingZone with your PIN codes. Pricing information is available from the IT Service Desk. MeetingZone have local and freefone numbers available in a large number of countries, allowing you to cover in full or part, international participants call and teleconference costs. Calls to these numbers are charged, per participant per minute to your teleconference account and recharged monthly. The MeetingZone conferencing account also allows access to PC screen sharing services. To share desktop and applications via the internet using this Glance service you will need to install a small application onto your Windows or Mac PC. Download MeetingZone Glance information (PDF) You can also give remote presentations using Presenter, a web based service, which builds on Glance and adds other features including the ability to: Download MeetingZone Presenter information (PDF) If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}