{
    "url": "https://www.nottingham.ac.uk/dts/communications/internet-and-web-services/connect-your-devices.aspx",
    "content": [
        {
            "p": "Advice and guidance on enabling your device for Wi-Fi access. When on campus, ensure you have connected mobile device(s) to eduroam and have Wi-Fi enabled at all times Following the instructions below to set up your mobile or laptop with eduroam Connecting your Android device to eduroam. To connect: You can use the geteduroam app, which will help automatically configure your device. The geteduroam app is available on Google Play and will use the configuration settings to set up your device. Once the app is installed, follow these steps: geteduroam app If you have changed your University password since setting up the wireless network you may need to forget the network and re-connect. Connecting your iPhone, iPad or iPod Touch to eduroam. You can download an automatic eduroam configuration file for iOS devices. You can also download the geteduroam app from the App Store. Once the app is installed, under Institution, search for 'The University of Nottingham' and then select the Profile that matches the ending of your email address, e.g. .ac.uk. Please note you will need to enter your username in the format of your University email address when prompted. If you have a problem connecting your Apple device to eduroam, you may need to upgrade to the latest software: Connecting your Windows 10 / 11 device to eduroam automatically. You can download an automatic configuration program for Windows. You will need to enter your username in the format of your University email address when prompted. If you have a problem connecting your laptop, you may need to upgrade to the latest software. You can install an automatic configuration file for Apple macOS which will set your computer up to work with eduroam. When prompted enter your University email address and password. Latest software If you have a problem connecting your macOS device to eduroam, you may need to upgrade to the latest software. You can download an automatic configuration script for some Linux distributions. You will need to enter your username in the format of your University email address when prompted. Some distributions do not support the automatic configuration tool, and should use the manual settings. If you have a problem connecting your laptop, you may need to upgrade to the latest software. Please run your distributions software update mechanism to check this. You can connect other devices to the eduroam wireless service if it supports 802.1X or WPA2-Enterprise encryption. Most devices will need the following information at minimum: For some devices, an automatic configuration tool (CAT) may be available. Not all of these settings may be required for your device, but you may need some of them to connect successfully. You may experience a security or certificate warning when first connecting to eduroam at the University of Nottingham. To ensure your safety, check that the certificate you are presented with matches the information on the main Connect to Wi-Fi webpage. You can also install the certificate yourself before connecting by using the Configuration Assistance Tool or the geteduroam app. If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}