{
    "url": "https://www.nottingham.ac.uk/dts/security/protecting-yourself/password-best-practice.aspx",
    "content": [
        {
            "p": "Protect your data by setting strong passwords. Having a unique, strong password and maintaining its confidentiality is vital to secure your IT account. Please note the following points when choosing a password: A good way to create a strong and memorable password is to use three or four random words alongside numbers and symbols, for example: !Justiceblanketmarketartist5- These 4 random words, plus a number and 2 special characters, amounts to a password that is 29 characters long which is very secure, but also memorable. Please do not use this example as your password. When setting a new password for your University IT account, your chosen password is checked against a list of passwords that have been previously exposed in third party data breaches. Any password that is on this list is visible publicly and is therefore not safe to use no matter how long or complicated it is. If you are informed that your chosen password is on this list, you must choose a different password. Once you’ve created a strong password you must protect it: The IT Accounts service allows you to set four questions and answers that you can use if you forget your password. Please note: You do not need to enter real data, such as dates of birth. Just enter information that you can remember. You may wish to add this information into your password manager. Manage your password Secure password managers allow you to keep track of all your different passwords, so you do not need to reuse the same password across different sites or services. Examples of password managers are Keepass, Keeper, 1Password, LastPass and Dashlane. You just need to remember one master password for the password manager in order to access all your passwords. You can then have a unique password for each website or service that you access. If one is compromised, you will not need to change your password everywhere else. Please note that password managers cannot be used to automatically login to desktops or laptops. If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}