{
    "url": "https://www.nottingham.ac.uk/dts/equipment/equipment-student/equipment-advice.aspx",
    "content": [
        {
            "p": "Using an existing device or purchasing new equipment to help with your studies. If you already have a Microsoft Windows, Apple MacBook laptop or similar device that is 2 - 3 years old, it is likely you will be able to use this for your learning at the university. Note, we do not recommend Chromebooks or tablets (such as iPads, Android) as your main study device. Please check the general specification below. To support your studies, there are PCs available on campus and we have a laptop loan service. We also have a Windows Virtual Desktop service which provides virtualised desktops and applications securely in the cloud. For students who do not have a laptop, a portable device is recommended so that it can easily be used on campus, at home or any other location. We have provided a general specification to help you purchase an appropriate device. Operating system is your choice, however we recommend Windows 11 (Full Version) to provide you with the best experience when using university systems. Note, we do not recommend Chromebooks as the Chrome OS is unsuitable to run most required apps and software. No need to buy Microsoft 365 apps and software, these are available to all students throughout your studies. Some schools and departments might suggest different device specifications or recommend using additional equipment relevant to your course. All students will need at least one device (a smartphone, tablet or laptop / desktop PC) to approve security access requests via Multi-Factor Authentication (MFA). MFA is required for extra security when accessing services such as Microsoft 365 and the Windows Virtual Desktop. Our recommendation would be to use a smartphone that is compatible with the Microsoft Authenticator App. To support your studies, the university recommends you have a suitable laptop to work on when on or off campus. Below, you can find a general specification. Other equipment such as a keyboard, mouse, webcam or external screens aren't essential but could help improve your comfort while studying. Students who own a Windows or Apple device similar to the specification below should be able to work without relying upon virtual services or on-campus PCs. Some courses might recommend different device specifications. Click the relevant link below to find out more. If you have any questions about specifications for your course, please contact your school or department before purchasing a new device: Find your school or department If you are experiencing financial difficulties that mean you are struggling to manage your costs, there may be support funds able to assist you: Financial support funds These aren't essential but could help improve your comfort while studying: A keyboard and mouse to ensure physical wellbeing and effective working practices A webcam and microphone so you can participate in video conferences and online group meetings Devices should be able to connect to a bigger screen (monitor or TV) for longer periods of study or collaborative work. University monitors use HDMI connections Rapid recharge of batteries or spare batteries to provide all day use Touch screens are not required for most academic programmes, but their enhanced capabilities can be useful If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}