{
    "url": "https://www.nottingham.ac.uk/dts/communications/email/connect-your-devices.aspx",
    "content": [
        {
            "p": "Access your university email from any device. Multi-Factor Authentication (MFA) will be required to access email and Microsoft 365. All users must set up MFA. We advise setting up MFA and securing your Microsoft account before following any instructions on this page. Configure a range of devices (iPhone, iPad, Android, etc) to connect to your email account Follow our step-by-step instructions Before you start, please ensure you have set up MFA and secured your Microsoft 365 account. Please note, we recommend using the Microsoft Outlook app. General configuration settings: Account type: Microsoft Exchange Email address: Server: outlook.office365.com Username: Please note, we cannot give detailed instructions for Android as the set up is different depending on the email app and manufacturer of the device. We recommend using the Microsoft Outlook app. Some versions of Android email apps don't support modern authentication which is required for MFA. You may need to update your Android software version or use the recommended Outlook app. Account type: Microsoft 365 or Exchange After typing in Name, Email Address and Password, you will be prompted with a Windows Security box. If different, replace the email address with the username in the format listed below and enter your password. You may need to click Use another account to change the username. Username Note, in Apple Mail you can set how long to keep messages in the Trash folder. Once a message is permanently deleted in Apple Mail it cannot be recovered from the Deleted Items folder in Outlook on the web. We recommend setting Apple Mail to never permanently erase deleted messages. Account type: Exchange Please ensure you are using the latest version of Thunderbird. Incoming server Outgoing server Note: If OAuth2 doesn’t show in the list of options click the Re-Test button and it should then appear. If you are using a device or operating system not listed above, although we cannot provide instructions, the general settings you will be asked to provide through the mail set up process may be as follows: If using IMAP or POP, please check that your app or software supports modern authentication which is also referred to as OAuth 2.0. Protocol: IMAP Protocol: POP3 Protocol: SMTP Authentication method: OAuth2 If you're struggling please get in touch with the team Submit and track requests to solve your IT issues Updates on the University's core IT services"
        }
    ],
    "pdf_files": []
}