{
    "url": "https://www.nottingham.ac.uk/dts/knowledge-hub/it-induction/after-you-start.aspx",
    "content": [
        {
            "p": "By now you should have completed the steps on the 'When you start' page to make sure you're connected and have access to the right software for your studies. This page lets you know more about further useful information and other services at the university. These are available to you throughout the year and ongoing academic studies. Stay safe online, avoid phishing attempts and make sure you set strong passwords. Secure your devices, data and protect your information and online privacy from attacks. IT security All official university communication will be sent via email - check your account regularly. We recommend the Outlook app to use your email and calendar. Expand the below for useful tips on using email at the university and professionally. The Careers and Employability Service have useful advice on use of email, here at the university and for your future work. Access a video of this topic via the 'career essentials' resource library on the MyCareer website (login required). Writing professional emails A very useful guide about many Outlook features to help you manage emails, tasks, calendar and time can be found on the Microsoft website. Best practices for Outlook OneDrive provides you with storage in the cloud where you can securely store, share, and sync your files. Start your work from portal.office.com and always save to OneDrive. OneDrive guide You can access specialist software 24/7 on a fully configured Microsoft Windows virtual university computer. Set up Virtual Desktop We provide a wide range of software that you can install on your personal device. Find software There are many computer rooms you can access on campus. Some computers may have different software installed depending on the requirements of the local schools / departments. PC facilities and locations Print, copy or scan at many locations on campus. First, activate your print account and then top-up online (if you really need to print). Scanning to OneDrive or your university email is free. Print, copy and scan Replay lectures anytime – 24/7 access to content. Record your notes for future review. Access via Moodle or Echo360 website and app. Learn more about first access to Engage. Introduction to Engage IT freshers survey Are you a first year student? We would welcome your feedback on your experience so far. From Monday 7 October, our survey will open. Complete the survey for your chance to win an IT goodie bag (includes Amazon voucher, power bank, wireless mouse and earphones plus much more). Start the IT survey Need help? There are a number of ways you can get both 1-2-1 and remote support to help you throughout the year and studies at the university. This includes peer support from our friendly team of IT Smart Bar assistants or by calling our dedicated IT Service Desk experts anytime to help you resolve IT queries. Help and support"
        }
    ],
    "pdf_files": []
}