{
    "url": "https://www.nottingham.ac.uk/dts/about/about-us.aspx",
    "content": [
        {
            "p": "Digital and Technology Services At the heart of our global, digital community. Digital and Technology Services (DTS) are an innovative and agile team of technical experts and partners. We determine the digital strategy for the global university and provide a range of compelling digital solutions and technology services to meet the diverse needs of staff, students and researchers As a team, we strive to be the trusted Digital Partner of the university, providing staff, students and researchers with an exemplary and collaborative user experience. Visit our jobs microsite to find out about working here, our wider plans, the digital ambition of the university and to browse current vacancies. Recruitment microsite Our Partnering and Innovation function is the primary means of engaging in constructive conversations with university peers regarding technology requirements to understand how digital can add business value. Service Design lead the effective delivery of the global project portfolio, ensuring that new technology solutions are customer centric, well designed, built to high quality and deliver tangible benefits. Service Delivery lead on the delivery of customer focused, secure, professional and responsive technology services and ensure the smooth operational running of core University infrastructure, platforms and systems. Page coming soon. Our Architecture function maintains deep knowledge of emerging technology trends, advising how best to exploit and innovate and ensuring new solutions are delivered within a coherent architecture. Page coming soon. The Chief Digital Officer is responsible for developing the Digital Strategy for the University and enabling the wider University strategy through the delivery of world class digital products and services. Visit our team pages above to find out more and how to contact us. Many of our services can be requested via our Self Service Portal. A full staff listing will be coming soon via SharePoint - for internal access only. The Digital Services and Technology team is led by Chief Digital Officer (CDO), David Hill, who is supported by a Senior Management Team and approximately 280 FTE staff who provide digital and technology services and support global IT infrastructure and systems for students, staff and visitors. Get in touch with the team"
        }
    ],
    "pdf_files": []
}