{
    "url": "https://www.nottingham.ac.uk/dts/knowledge-hub/it-induction/when-you-start.aspx",
    "content": [
        {
            "p": "We fully appreciate that getting connected and accessing the right software for your studies will be critical in your first few weeks with us. After completing the steps on 'Before you start', please follow the steps below when you arrive at university to ensure your first and subsequent weeks run smoothly. If you need any help with getting set up and registered, you can call our IT Service Desk anytime, or contact our Smart Bar service when you arrive. Check the help and support page for more details. Stay connected wherever you are across our UK campuses. 'eduroam' is the main wireless network and you will need to connect when you arrive as part of registration. Get connected To connect: For eduroam, your username is your university email address. For example: Undergraduate and Postgraduate Taught students: username@nottingham.ac.uk Postgraduate Researchers, Staff and Associates: firstname.lastname@nottingham.ac.uk We recommend using the Configuration Assistance Tool (CAT) or the Get eduroam app to help automatically set up your device. If you experience issues or have changed your password, please forget eduroam on your device and re-connect following the instructions above or check connecting your devices. During your welcome weeks, we are hosting IT Inductions for each Faculty. Check your timetable and attend your induction to get started and discover more about the services available. Each session is online via Microsoft Teams and lasts approximately 45 minutes (includes time for questions). Click the relevant link on the schedule below at the time and date of your induction to join. Links have now been updated with the recordings of each session. Links in the table below have been updated to a recording of each session presented (sign in required). If you have any questions, please contact the Smart Bar or IT Service Desk for help and support. A separate session for PGR students will be held on Thursday 3 October, 1.15pm - please only click the link at this time and date. Find your way around campus with the university maps and hopper bus timetables. Access your personalised timetable and your Meal Pass plus much more... MyNottingham app You can install the latest Office apps on up to any five devices for free. Download Microsoft Teams as you'll be using this throughout your studies. Microsoft 365 Moodle is the university’s Virtual Learning Environment (VLE). Each module you study has its own Moodle page with learning materials and activities. Using Moodle Completed these steps? Move on to the third part of your IT induction after you start. Need help? There are a number of ways you can get both 1-2-1 and remote support to help you get up and running in your first few weeks. When you arrive on campus, get peer support from our friendly team of IT Smart Bar assistants or call our dedicated IT Service Desk experts anytime to help you resolve IT queries. Help and support"
        }
    ],
    "pdf_files": []
}