{
    "url": "https://www.nottingham.ac.uk/economics/news-items/2024-25/economics-students-win-marden-prizes.aspx",
    "content": [
        {
            "p": "We are delighted to share that two final year economics students have been awarded a 2024 Elizabeth and JD Marsden Prize by the university. Thomas Handyside (BSc Economics) received a 2nd prize and Benjamin Buck (BSc Economics) was awarded a 3rd prize. Thomas achieved exceptional marks across his degree and was recipient of the school's Outstanding Achievement award in undergraduate final year in 2024. He was also awarded the school's Outstanding Achievement (Runner Up) prize in his first year. Throughout his degree, Thomas was a member of the Economics and Finance Society (NEFS) and part of the NEFS Global Economy Division in his second year. He was also part of 180 degrees, the world’s largest student run pro-bono consultancy. Having joined as a consultant in his second year, he then took on two committee roles – Client Acquisition Director and Head of Sponsors. He played in two IMS football teams throughout the entirety of his time at Nottingham and represented the university as a Student Ambassador at his old school, promoting and showcasing Nottingham to prospective students. Thomas' proudest achievement was the work he was involved with the knife crime charity, Switch Up. In the aftermath of the tragic loss of Grace and Barney, Thomas reached out to Switch Up, offering to take them on as a client for his consultancy. Due to his passion for the issue, he then chose to lead the project himself as a team leader. Thanks to the team’s hard work, he was able to establish relationships between Switch Up and various organisations, enabling the charity to promote its services whilst also giving it access to fundraising opportunities. He was also involved in conducting in depth research and identified which communities around Nottingham were in greatest need of Switch Up’s help. Thomas would like to thank the school for the nomination for the Marsden Prize. He feels extremely privileged to be considered for such a prize. He would also like to thank the School of Economics staff, whose hard work has provided him with a richly rewarding and enjoyable university experience. Benjamin achieved a first-class average in all years of his degree, picking up the school's Outstanding Achievement prize in undergraduate years one and two and the school's Outstanding Achievement (Runner Up) prize in undergraduate final year. Benjamin played an active role in the Nottingham Economics and Finance Society (NEFS). In his first year he was an Equity Fund Analyst, where he conducted extensive fundamental, competitor and technical analysis in order to pitch a stock once every three weeks. Benjamin was also a Corporate Finance Analyst and in his second year, Director of the Corporate Finance Team. In this role he planned and delivered regular informative sessions to 24 selected members and provided CV and cover letter support which enabled the members to achieve over 50 spring week and summer internship places. In his third year, he undertook the role of NEFS mentor, providing assistance to students in the application processes for spring weeks and internships, as well as addressing any of their concerns. In both first and second years, Benjamin represented the university swim team in Varsity and he held the position of Treasurer for the swim club in his second year. In his third year, Benjamin also took on the position of Treasurer of the Travel Society, and the team won the ‘Best Trip Award’ at the recent Students’ Union Activities Ball. During the first year of university, Benjamin was asked to become a mentor for younger pupils within his former school. He helped them academically and organisationally through online MS Team meetings. In addition, he has aided multiple university applications of pupils wishing to study economics, at the request of his economics teacher in school. During his third year, Nottinghamshire Police interviewed Benjamin about bike safety on campus. Having cycled to and from campus for the last two years of his degree, he felt it was a privilege to be interviewed about this topic, and so was delighted to see that UoN Sustainability posted about the event on Instagram. He hopes this article will make the local community more aware of the benefits of this scheme and how it can help reduce the chances of bike theft. The School of Economics would like to extend a huge congratulations to Thomas and Benjamin. The Elizabeth and JD Marsden prizes were founded in 1953 “to encourage not only the development of the mind (with which education seems to be mainly concerned) but also to encourage and reward the cultivation of those qualities which are the essence of character and personality” and by these prizes to “provide pecuniary help to students on leaving the university to enter upon their life’s work.” The prizes are “awarded to students who are adjudged the best students of the year — who have gained high distinction in their examinations, and who have throughout their university careers been of exemplary conduct and given proofs of outstanding character and personality.” Sir Clive Granger Building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}