{
    "url": "https://www.nottingham.edu.my/Economics/People/yvonne.chia",
    "content": [
        {
            "p": "Honorary Professor, Faculty of Social Sciences A trailblazer for woman in banking and was the first female Chief Executive Officer of any commercial bank in Malaysia. An award winning senior banker, she was named among the '50 business women in the mix' in 2013 by Forbes Asia and two-time finalist in the CNBC Asia Business Award. She has been in the ASEAN banking scene, with a focus on Malaysia in the last three decades. Her record of disciplined expansion with a higher purpose of value creation has transformed the value of banks and organization she has led with triple profitability and market capitalization. Demonstrated strong leadership to provide vision, focus and execution to achieve success in start-up, high growth and turn around operations. A proven strategist and influencer/mentor with strong understanding of relationship management to effectively promote and secure business interests and engagement with partners, customers, staff and the community served. She believes that everyone can lead sustainable lives in whatever they choose and are passionate about. With basic fundamentals of belief in the integrity of oneself, learning, asking and taking action, one is capable of evolving into a strong character and to change with the times. With these strong foundation and character, one can achieve success and potential in their career and personal life. She believes in youth and the young generation as the future, and she shares this through her website - Rock Passion to Perform, an accessible website for youths and those who are building sustainable lives. She wants to help them to find balance in their career and life, and shares her experiences with the youth and the millennial. She is also a mentor/coach to individuals at the crossroads as well as many second generation individuals in guiding them into their discovery to the next threshold in their journey. Throughout her journey of personal and professional life, she is always feeling alive, excited, energetic and resourceful. Blessed with tremendous energy, she professes the philosophy of integrated worklife; where the mind is focused when needed and adaptive to the nature of the situation. Her experience of learning and changing oneself is a continuous journey. She applies her philosophy to be significant to everything she does. She has been portrayed as a natural and nurturing leader by her peers. She currently sits on the board of several listed companies as well as NGOs. Until June 2013, she was the Group Managing Director of the Hong Leong Banking Group Malaysia (2003 - 2013); Group Managing Director of RHB Banking Group (1996 - 2002); Bank of America Vice President and Country Head of Marketing (1976 - 1994). telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}