{
    "url": "https://www.nottingham.edu.my/Economics/Newsletter/Issue-1-2014/School-news.aspx",
    "content": [
        {
            "p": "NSE Malaysia welcomes three new staff in September 2014. From (L to R): Dr David Prentice, Dr Kong Yoke Fong, Ananta Neelim Dr David Prentice, who joins the School as an Associate Professor, obtained his PhD in Economics from the Yale University in 1998. His fields of expertise are in empirical industrial organisation, economic history and empirical labor economics. His work has been published in, among others, Economic Inquiry, International Journal of Industrial Organisation, Labour Economics and Economic Record. Before joining NSE Malaysia, Dr Prentice worked in the La Trobe University, Australia for 17 years and had held visiting positions at renowned universities, including UCLA, Cornell University, Australian National University, University of Melbourne, Georgetown University and Lehigh University. He has supervised 11 PhD students and has co-authored a textbook, Managerial Economics: A Strategic Approach. Dr Prentice teaches Quantitative Economics II to IV in the 2014/2015 academic year. Dr Kong Yoke Fong, who joins the School as an Assistant Professor, obtained her PhD in Economics from the University of Nottingham in February 2014. Her field of expertise is in international trade. Before joining NSE Malaysia, Dr Kong served as a lecturer at Universiti Tunku Abdul Rahman, Malaysia. Dr Kong teaches Economic Integration I and II, as well as International Trade Policy in the 2014/2015 academic year. Ananta Neelim, who joins the School as an Assistant Professor, completed his PhD from the Monash University, Australia in August 2014. Ananta’s fields of expertise are in experimental economics, development economics and behavioral economics. Ananta teaches Quantitative Economics I, Microeconomic Theory and Advanced Experimental and Behavioral Economics in the 2014/2015 academic year. telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}