{
    "url": "https://www.nottingham.ac.uk/economics/alumni/index.aspx",
    "content": [
        {
            "p": "Your relationship with the University of Nottingham doesn't end when you graduate. We have many ways for our alumni to get involved and keep in touch, and help to inspire students currently studying with us. As a graduate of the University of Nottingham, you can continue to use the Careers and Employability Service to help build your career. They provide guidance and advice, run events, and have a job vacancy service. To hear the latest news from the School of Economics, follow us on social media and keep an eye on our news page. We would love to welcome you back at any of our public lectures and events which can be found listed on our website. Our graduates may have completed their studies with us, but we don't want to lose touch. We love to hear about what our former students are up to in their careers, so please do drop us a line to share your news, achievements and successes at any point after you graduate (no matter how long ago it was!). If you agree, we may feature you in one of our alumni profiles or in our Hall of Fame. We also welcome any suggestions for other opportunities we could offer to support and involve our alumni. Email your updates and suggestions to rachel.house@nottingham.ac.uk Our students are eager to learn of the careers opportunities open to them with a degree in economics from Nottingham, and to do so from former graduates of the School of Economics is especially compelling. If you would like to return to the university, please contact us with a brief description of your career and the area you would be willing to talk about. Would you be willing to offer a summer placement or internship at your place of work to a current Nottingham student? Work experience opportunities provide a real advantage to our students and, in return, their energy, talent and motivation in professional environments can offer tremendous value to employers. Contact us with some details of the internship such as location, duration (one to four weeks is typical) and the type of work. Payment would be up to you, although some help with travel and living expenses would be helpful. Giving your time is a great way to learn new skills, get more involved in the university and meet alumni. We offer a range of roles that you can do from home, work, in the UK or from anywhere in the world. Whether you can offer 30 minutes or 30 hours, your time will make a positive difference. Our mentoring schemes offer Nottingham alumni the opportunity to provide meaningful career support to current students and fellow alumni. Mentoring develops via remote contact over the academic year, giving participants time to benefit from their mentor's professional experience and knowledge. Every year thousands of people like you donate to the University of Nottingham to make a difference to the lives of students and fund world-changing research. Find out more below about the areas where you can make an impact. The university alumni website provides many ways to keep in touch and stay connected and lists of the latest alumni events. Sir Clive Granger Building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}