{
    "url": "https://www.nottingham.edu.my/Economics/Research/Research-groups/Energy-and-Sustainability.aspx",
    "content": [
        {
            "p": "The Energy and Sustainability research group supports sustainable development through research output and pedagogy as well as numerous collaborations with external academic institutions, policy makers, non-governmental organisations, and industry. The research group primarily focuses on three core themes: The research group’s collective contribution to empirical and theoretical research is evidenced by publications in high quality journals in economics and environment including Journal of Environmental Management, Journal of Cleaner Production, Energy Economics, Resources Policy, Energy Policy, Renewable Energy, Energy, International Journal of Finance & Economics, the World Economy, inter alia. Dr Muhammad Shafiullah conducts empirical research in various fields of economics—Environmental and Natural Resource Economics, Financial Economics, Tourism and Transportation Economics, inter alia. His current research agenda aims to understand the macro- and micro-economic ramifications—i.e., education, health, income, inter alia—of energy deprivation, energy finance decisions, migration, travel/tourism, etc. In particular, Dr Shafiullah is exploring the impact of culture, education, and migration on energy consumption (poverty) and/or carbon (dioxide) emissions. Of late, he has taken a keen interest in the viability of Islamic finance as a stabilising force in the global financial sector, especially in the wake of COVID-19. Subfields: Environmental and Natural Resource Economics, Financial Economics, Tourism and Transportation Economics Learn more about Dr Muhammad Shafiullah. The primary research interests of Sakiru Adebola Solarin include energy economics, environmental economics, natural resource economics, and sustainability. He is also interested in using several econometrics methods (such as times series and panel data techniques) to analyse different areas in Economics including financial economics, defence economics, tourism economics and development economics. He is currently working on persistence, convergence as well as the economic drivers of environmental degradation, substitutability of energy inputs, and economic impacts of tourism activities. The other current research works include economic factors and consequences of Islamic banking development and foodbanking system. Subfields: Energy Economics, Environmental Economics and Applied Economics. Learn more about Dr Sakiru Solarin. telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}