{
    "url": "https://www.nottingham.ac.uk/economics/study/postgraduate-taught/index.aspx",
    "content": [
        {
            "p": "Our MSc courses are designed to bring you to the forefront of current economic thinking and cover a wide variety of specialisms in economics, each of which reflect our research interests and expertise. The school has a long history of providing postgraduate training and we offer a combination of teaching delivered by world-leading academics, a wide choice of modules, and individual one-to-one supervision for your dissertation. Each course is linked to the research of one or more of our research centres, and MSc students will have the opportunity to attend weekly seminars by visiting speakers in their chosen field. For alumni of the University of Nottingham, including from our China and Malaysia campuses, we offer alumni scholarships. We also offer scholarship opportunities for all students. Our guide to applying Funding information Top 10 in the UK for economics and econometrics in the Times Higher Education World University Rankings 2024 5th in the UK for economics and econometrics in the Research Excellence Framework 2021 Six of our MSc courses are designed to give advanced training in core and important research fields of economics: Our MSc Economics focuses on current economic thinking, providing the technical tools for understanding and developing microeconomic and macroeconomic models. On this course, you will learn about the data science methods used widely in economic analysis, such as Lasso, random forests and supervised learning. This course provides you with a solid foundation in current econometric theory, and the expertise to apply that theory to the analysis of economic data. Our International Economics MSc studies economic interactions between countries, focused on international trade and finance. Two of our MSc courses are designed to provide advanced training in applied economics: Our Financial Economics MSc provides you with the core skills and techniques needed to understand the economics of financial markets. Hear from the MSc Director in the School of Economics about what it is like to study a masters degree in economics at the University of Nottingham. The school has dual degree options with the Universities of Konstanz and Tübingen in Germany. Under the dual degree option, students who have successfully completed the taught component of the MSc at Nottingham can spend a second year in Konstanz or Tübingen. We offer pre-sessional English language courses to improve your language level to meet the entry requirements for your degree. There is continued support while you study with us, with courses, consultations and drop-ins available. English language support Discover campus life with 360 degree images and videos on our virtual tour. Experience student life by exploring areas such as accommodation, student services, sport centres, libraries and the Researcher Academy. Visit our virtual tour Sir Clive Granger Building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}