{
    "url": "http://www.nottingham.edu.my/Economics/Study-with-us/Economics-vs-Business.aspx",
    "content": [
        {
            "p": "Economics and business are two closely related fields. Often, students are not sure what is the difference between an Economics degree and a business degree. Some would wrongly assume that if they are interested in a career in the business sector, they would have to major in business. The confusion is often due a lack of understanding about what a degree in Economics entails and its career prospects. Economics is the study of how people make choices under the condition of scarcity. As such, Economics is more than just the study of money, finance or the economy. Some of the questions that economists study include: While a business degree typically has a few Economics modules as part of its core requirements, a business degree focuses more narrowly on how a business is run, by studying various aspects of a firm such as accounting, human resource, operations and marketing. In contrast, a Business Economics degree integrates economic theories with practical business strategies, preparing graduates for strategic decision-making in diverse business environments. The wide-array of quantitative, analytical and critical thinking tools and skills that economics graduates acquire can be very useful in a wide-range of exciting careers, including in the business sector, such as business and financial analysts, government and policy advisors, investment and retail bankers, management consultants, pension advisors, journalists and market researchers. The solid mathematical, quantitative and analytical skills that students acquire in an Economics degree programme are highly in demand in the market, making Economics degree one of the highest paid degrees in the market. A list of notable people with a degree in Economics can be found here. Graduates of NSE Malaysia have been employed by reputable banks such as Alliance Bank, CIMB, Citibank, HSBC, OCBC, UOB, Royal Bank of Scotland, multinational companies such as Axiata Group, Frank Knight, Frost & Sullivan, GlaxoSmithKline, IBM, PwC and Wolters Kluwer as well as policy institutes such as Asia Strategy and Leadership Institute and Bank Negara Malaysia. \"See our undergraduate alumni profile for some examples.\" telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}