{
    "url": "https://www.nottingham.edu.my/Economics/Newsletter/Issue-1-2015/Research-and-publications.aspx",
    "content": [
        {
            "p": "By Paul, S. This study examines the household coping mechanisms during civil conflict in Cote d’Ivoire; the most powerful political economy factor dictating policy and performance in agriculture since the late nineties. The civil conflict that broke out in 2002 disrupted the socio-economic development caused by political instability and massive population displacement. It left the country divided into two halves - the tropical rain forest of the south, controlled by the government and the savannas of the north, controlled by the opposition forces. The north- south division demarcated by the enforcement of the UN peace-keeping line disrupted the food supply chain from the North to the rest of the country. Presumably, this had differential effects on agricultural strategies between the north and the South. This report provides theoretical discussion supported by empirical outcomes on the crop diversification as a coping mechanism for households facing the risk of conflict in the southern parts of Cote d’Ivoire. These households believed that if they can access land, they could make use of the available labor supply and thus feed their families. In other words, self-sufficiency became the common principle. In the pre-war period cassava was the only food crop grown by more than 10% of the farmers in the South Forest; however, in the post conflict period, a sizable portion of the farmers were also involved in growing rice, maize, sorghum, vegetables, etc. Published in V. R. F. Monograph Series, 2015, February, Institute of Developing Economies (IDE- JETRO), Japan. By Dabalen, A., Pariduri, R. and Paul S. This paper examines the effect of the intensity, timing, and persistence of personal history of mobility on individual support for redistribution. Using both rounds of Life in Transition Survey, we build measures of downward mobility for about 57 thousand individuals from 27 countries in Eastern Europe and Central Asia. We find that more intensive, recent, and persistent downward mobility increases support for redistribution. Accounting for systematic bias in perceived mobility experience and omitted variable bias and considering alternative definition of redistributive references do not alter the basic results. Published in Economics of Transition 2015, Vol 23, Issue 3. telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}