{
    "url": "https://www.nottingham.edu.my/Economics/Research/Research-groups/Development-and-Behavioural-Economics.aspx",
    "content": [
        {
            "p": "The Development and Labour Economics research group is primarily concerned with four (4) broad topics: Siew Yee’s research primarily follows the micro end of development economics that breaks big development questions into smaller ones. She is interested in questions of how public policies and social programmes empower micro- and small firms, women, poor households, and workers in developing countries. She also studies the units from other perspectives such as whether personal attributes, behaviour, and financial literacy matter in their decision making. She uses mostly micro level data and quasi-experimental methods to answer development questions. Her next step in research is exploring macro-development topics to better understand both sides of development economics. Subfields: Development Economics and Business Economics. Learn more about Dr LAU Siew Yee. Andrew's research focuses on applied micro-econometrics in the domains of labour, trade, and economic geography, particularly with respect to the distributional outcomes of workers. His current research investigates the transition of production in agglomeration economies from an orientation around sectoral output, to a structure defined by occupational task inputs, and the consequences this has for the geographical distribution of income. Other works in progress examine the spatial concentration of occupations due to the shift to remote work, the impacts of NAFTA on gender wages differentials in the U.S. via occupational segregation, and CGE modelling of wage changes due to the weight distribution between intermediate and final goods tariffs. His methodological interests include spatial models and simulation of counterfactual statistical distributions. Subfields: Labour Economics and Economic Geography Learn more about Dr Andrew Silva. Dr Luke Okafor’s research focuses on the intersection of international trade, digital transformation, tourism economics, development process, education economics, and industrial organisation with a specific focus on how firms and industries respond to globalisation and shocks. This includes investigating the interplay between digitalisation, economic resilience, and performance as well as COVID-19 effects on firms, industries, and economies. Subfields: International Economics, Tourism Economics, Industrial Economics, Applied Economics, Education Economics, and Development Economics. Learn more about Dr Luke Okafor. Dr Muhammad Shafiullah conducts empirical research in various fields of economics—Environmental and Natural Resource Economics, Financial Economics, Tourism and Transportation Economics, inter alia. His current research agenda aims to understand the macro- and micro-economic ramifications—i.e., education, health, income, inter alia—of energy deprivation, energy finance decisions, migration, travel/tourism, etc. In particular, Dr Shafiullah is exploring the impact of culture, education, and migration on energy consumption (poverty) and/or carbon (dioxide) emissions. Of late, he has taken a keen interest in the viability of Islamic finance as a stabilising force in the global financial sector, especially in the wake of COVID-19. Subfields: Environmental and Natural Resource Economics, Financial Economics, Tourism and Transportation Economics Learn more about Dr Muhammad Shafiullah. telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}