{
    "url": "https://www.nottingham.edu.my/Economics/Study-with-us/Undergraduate-Alumni-Profiles.aspx",
    "content": [
        {
            "p": "Graduates from the School of Economics choose to work in a wide range of industries and go on to achieve great success, whether in academia, business or their chosen career. View a selection of undergraduate alumni profiles below and see where your economics degree could take you. BSc (Hons) Economics Graduated 2013 Upon graduation, Kai Shen pursued a Master degree in Economics and Econometrics at the University of Nottingham, UK and is now pursuing a PhD in Population Health Science at the Harvard University under the prestigious Fulbright Scholarship. Rachel had worked for Bank Negara Malaysia before securing the prestigious Chevening Scholarship to pursue her Master degree in Economics at the University of Nottingham, UK, where she is now pursuing her Doctoral degree in Economics with full scholarship. Upon graduation, Jarren had worked for Asia Strategy & Leadership Institute (ASLI) before securing the prestigious Chevening Scholarship to pursue a Master of Public Policy degree at the University of Warwick and he is now a Senior Policy Analyst at the Employees Provident Fund (EPF). Esther secured a full scholarship from CIMB Bank to pursue her MBA at the Asia School of Business (in collaboration with MIT Sloan School of Management) after completing CIMB management training programme and is now working at CIMB Bank KL after one year secondment to CIMB Philippines. Upon graduation, Yohannan had worked for IDEAS, an independent public policy think tank, and Frost & Sullivan, a management consulting firm, before pursuing a Master in International Development at the London School of Economics and Political Science with full scholarship from the LSE. Yohannan is now a Senior Officer at ASEAN Secretariat. Upon graduation, Sakib Anwar had pursued a MSc Economics at the University of Surrey, a MRes Economics at the University of Essex, and a PhD at Lancaster University, and he is now a lecturer at the University of Winchester. BSc (Hons) Economics Graduated 2014 Upon graduation, Wan Hong had worked for Alliance Bank and he is now the Vice President at Khazanah National Berhad. Nikhil is now a Global Relationship Manager at ICE/NYSE. Upon graduation, Shi Yun joined RHB Investment Bank and is now an Assistant Vice President at the Private Equity & Special Opportunities division of OCBC bank. Upon graduation, Fu Sing had worked for IBM Malaysia before pursuing an MBA at the Nanyang Technological University with scholarship and is now a Programme Manager at Meta. BSc (Hons) Economics Graduated 2014 Upon graduation, Ravjit worked in Knight Frank and MaGIC (Malaysian Global Innovation & Creativity Centre) before taking up the current position as a Business Manager at Maxis eCommerce. Upon graduation, Wai Chun had worked for IBM Malaysia before taking up the current position as a Corporate Finance Team Lead at the British America Tobacco Malaysia. Upon graduation, Chew Ching joined GSK’s consumer healthcare future leader programme in sales and marketing, and is now a Brand Manager at Fonterra Dairy. Dinne is currently working as a Manager, Operations & Clearing Services at Kenanga Futures, one of the listed derivatives broker in Malaysia. Upon graduation, Yunyi had pursued an MA in Economics at Simon Fraser University and an MBA at Schulich School of Business, York University. He is now a Project Lead at fifty-five Data Company (part of The Brandtech Group). BSc (Hons) Economics Graduated 2015 Kavita is now a Specialist (Corporate Strategy) at Axiata Group. Rohini, an international student from the US and a recipient of the Vice Chancellor’s Medal, Upon graduation, she had pursued a MSc in Economics and a PhD in Economics at The University of Wyoming and is now a Senior Resource Planning/Valuation Specialist at PacifiCorp (a Berkshire Hathaway Energy company). Kar Man worked in Khazanah Research Institute after pursuing a Master degree in Economics at the University College London with full scholarship and is now a PhD student at Goethe-Universitat Frankfurt. Upon graduation, Timothy pursued an MSc Public Policy and Administration degree from the London School of Economics and Political Science and is now a Senior Analyst at the Penang Institute. Upon graduation, Joe Yee joined Frost & Sullivan as an Associate. Germán Olivares Merlos is now a Senior Customer Support Manager at PRINCE2®. BSc (Hons) Economics Graduated 2016 Teng Hau worked in Crystal Group in China upon graduation and is now a Venture Builder & Analyst at Owners Circle Berhad, a training and investment company, in Malaysia. BSc (Hons) Economics Graduated 2017 Yen Khai is now pursuing a Master in Public Policy at Lee Kuan Yew School of Public Policy, National University of Singapore with scholarship (MOE APEC Scholarship). Firzul, who graduated top of his class in 2017, has been appointed as the Deputy Minister of Finance of Maldives in January 2019, but “looks forward to pursuing an academic career in the long run”. BSc (Hons) Economics Graduated 2017 Linur, an international student from Uzbekistan, who was the President of Student Association in the 2016-2017 academic year, worked in Royal Bank of Canada Malaysia and Uzbek-Oman Investment Company in Uzbekistan after graduation, and now is a Co-Founder and Partner of QClay Design (UI/UX Design Agency). Han Khai is now a Senior Data Scientist at Grab. Ervin is now a Manager responsible for the regulation of Recognised Market Operators at Securities Commision Malaysia. Terence published a co-authored paper based on his undergraduate dissertation and is now a Model Validator at Standard Chartered. He is also a certified R programmer and SAS Machine Learning specialist. BSc (Hons) Economics Graduated 2018 Damian is now a Local Market Treasury Trader at Citibank Malaysia. Areecca is now an Equity Research Associate at Affin Hwang Investment Bank. BSc (Hons) Economics and International Economics Graduated 2018 Imsa, an international student from Maldives, went on a work and travel programme in the US upon graduation, and is now working at the National Bureau of Statistics of Maldvides, training enumerators for a nationwide survey. Upon graduation, Rynn joined the HSBC Global Graduate Programme where he currently works as a Coverage Banker in the Global Banking team. BSc (Hons) Economics Graduated 2018 Kellie is now working as an Associate in transfer pricing at Ernst & Young. Aron is now a Data Scientist at ADA, a digital advertising agency and consultancy. BSc (Hons) Economics and International Economics Graduated 2018 Chern Q’uan is now a Manager of Debt Capital Market at Securities Commission Malaysia. Pingalayen is now a Senior Business Intelligence Analyst at Zenyum. Henry is currently working as a Client Manager at S&P Global and pursuing an MBA at Heriot-Watt University. John is now a Project Management Specialist at Huawei Technologies. Nicholas is now a SAP Analyst at Deloitte Consulting. BSc (Hons) Economics Graduated 2019 Nadhira, an international student from Indonesia, is currently pursuing an MSc in Development Economics and Policy degree at the University of Manchester. Zhou, an international student from China, is currently pursuing an MSc Economics degree at the University of Zurich, Switzerland. Ahmad is now a Technology Consulting Analyst at Accenture. Jia Le is now an Assistant Brand Manager (MYSG) at Unilever. BSc (Hons) Economics Graduated 2019 Zuldanial Anxary is now a Senior Account Manager at Fiftyfive5 (Accenture Song’s company). Upon graduation, Angela had pursued a MSc Finance and Accounting at University of Birmingham and is now a Technology Risk Analyst at BDO UK LLP. She also holds an ACA Chartered Accounting Qualification (ICAEW). BSc (Hons) Economics Graduated 2020 Upon graduation, Veenitha had pursued a MSc Environmental Bioscience in a Changing Climate at University of Warwick and is now a TCB Associate (Sustainability) at CIMB. Zhong Han is now an Investment Analyst at The Hive Southeast Asia. BSc (Hons) Economics Graduated 2021 Adriana is now a Research Analyst (Economy) at Institut Masa Depan Malaysia. BSc (Hons) Economics and International Economics Graduated 2021 Utkarsh was the President of Student Association in the 2020-21 academic year. He is now a Brand Success Manager at Opa Marketing Tech. Bryan is now pursuing a Master of IT in Business at Singapore Management University. Yi Sheng is now an Economist at Retirement Fund Incorporated (KWAP). Amir is now a Solution Consultant at Rolling Arrays Consulting. BSc (Hons) Economics and International Economics Graduated 2021 Ursita is now a Portal Marketing Manager at Better Breathing Sport. BSc (Hons) Economics Graduated 2022 Peshala is now an Analyst for Control, Process & Governance at Standard Charted, Sri Lanka. Hanson is now pursuing a MSc Social Research Methods at the London School of Economics and Political Science with full scholarship (Khazanah Global Scholarship). Isabelle is now a Graduate Analyst at Bank Negara Malaysia (Central Bank of Malaysia). Wan Wei is now a Research Associate at National University of Singapore. telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}