{
    "url": "https://www.nottingham.edu.my/Economics/Student-experience/index.aspx",
    "content": [
        {
            "p": "BSc (Hons) Economics, Class of 2019 BSc (Hons) Economics, Class of 2018 BSc (Hons) Economics, Class of 2015 My time in the School of Economics, UNMC has fostered my love for economics as a discipline while shaping how I look at the practical applications of economics everyday. Before I joined this programme I wasn't sure what I wanted, or could do, with this kind of degree - I just liked the sound of it. With each passing semester I realised how well-rounded this course was. I had the chance to test the waters in different areas of economics, as well as focus on the subjects that interested me most, giving me a solid foundation for whichever path I chose next. When I started interviewing for graduate programmes (in both economics and finance) I found that I was able to impress my interviewers with the scope of my knowledge and my technical skill set. The lecturers in this school have often been a huge source of support and inspiration. They have tried very hard to instill in us something that goes beyond the classroom. For me my time here has really been about learning how to learn, and how to apply what I learn. I am confident that as I pursue my PhD in Economics, the lessons I take with me from NSE will play a huge part in my success. Master Student at the London School of Economics Nottingham School of Economics (NSE) has definitely been a defining part of my life in developing my interest in economic policy making. Thinking about the school, I would say that the student-lecturer relationship is what makes NSE a great place to study. Throughout my time in NSE, I’ve always told people that our lecturers practice an open door policy . More than just being a lecturer, I would say that they are also a highly qualified mentor to us students. Student feedback has also been something I appreciate. NSE provides many platforms for student feedback in terms of teaching methods, module choices and syllabus structure. Not only are these platforms available, our feedback are given due consideration and changes are made as to where appropriate. Do your tertiary-education-research well and you will come to realise that NSE is the best option for an economics degree in Malaysia. Master Student at the University College London (Full-Scholarship from Hong Leong Foundation) I first came to UNMC because I really like that the economics programme had a lot of optional modules and flexibility which I expected would be a nice challenge and increase my knowledge exponentially. I managed to achieve that through projects and self-study which allowed me to work independently, thus enhancing my analytical abilities. What I did not expect was the whole experience itself was invaluable in developing me as a person. The professors conducted their classes in such a way that students are actively encouraged to participate in discussion and this exposes us to various perspectives and builds self-confidence. We learnt to question everything and then back it up with solid data. We could always go to our professors for advice, even in non-academic areas, such as careers or further study. This advice guided me throughout the years and made my university life more productive, enjoyable and inspired me to have even bigger dreams. Master Student at the University of Warwick The Nottingham School of Economics is extremely close to my heart. This is the place which honed my dreams of being an economist into a reality. The academic staff are innovative, encouraging and most of all an excellent support system who enable you to succeed beyond the boundaries you once set yourself. This school is set apart with its unique class size that provides you the rare gift of personalised attention. This was the key to building excellent relationships among the brilliant minds of lecturers and peers, contributing to my overall development. Apart from its academic rigour, NSE provided me the opportunity to conduct research with both my personal tutor and dissertation supervisor throughout my period of study, who were extremely supportive of my dreams, and assisted me in being equipped in skills worthy of my progress to a postgraduate education at Warwick University. As a previous representative of the school and president of it's own student society, I must say that at NSE you will have the opportunity as I did to make friends for life, play football with your lecturers, present research at a seminar or attend corporate events among esteemed guests, and overall obtain an excellent education in economics, prepping you to take on your ambition in the real world. Consultant, IBM BSc (Hons) Economics, Class of 2014 Full Scholarship Recipient from the Sin Chew Daily Education Fund My experience being one of the second batch students of the Nottingham School of Economics Malaysia is one of the essential elements that brings me to where I am today. The intellectually challenging environment had well-trained me to be very independent and act beyond my boundaries. The fact that we were exposed to numerous fields of economics also encouraged us to look at things from different perspectives, which strengthened my analytical skill, which is very important in a consulting career. The flexible choices of modules also allowed us to pursue a subfield that we were interested in, making it easier for us to unleash our potential. BSc (Hons) Economics, Class of 2014 Full Scholarship Master Student at the Simon Fraser University, Canada The Economics programme at the University of Nottingham Malaysia Campus is truly intellectually stimulating. The exceptional curriculum and faculty members provided me a comprehensive training in Economics. The flexible choices of modules tailor to the needs of every student, whether they would like to pursue further studies or find a job after graduation. I particularly recommend the advanced level courses such as Advanced Macroeconomics and Advanced Microeconomics, which prepared me well for my post-graduate studies. Junior Economist, Alliance Bank Malaysia BSc (Hons) Economics, Class of 2014 As a proud Nottingham School of Economics graduate embarking on a career as an economist, my university days at Nottingham are never far away from my thoughts. From the lectures to the student exchange experience to the UK campus, my time at the University of Nottingham continues to breathe life as the classroom knowledge and university experiences gained equip me well to brace the real world and empirical economics. To inform that my alma mater is Nottingham does not only instil the confidence in me but also to others. The professors have delivered a solid fundamental of economics and I truly appreciate the flexibility and the opportunities that the School of Economics has provided in terms of learning and personal development. The close-knit school between the professors and students has nurtured me well and I will always be grateful for the world-class education from Nottingham. Associate Economist, Bank Negara Malaysia BSc (Hons) Economics, Class of 2013 Looking back, my experience at Nottingham Malaysia has been intellectually challenging but rewarding. The course, which centres around rigorous grounding of economic theories and the applications of it has opened up my eyes to see how economic agents behave in a world governed by scarcity and choices, both at the micro and macro level. The lecturer-student engagement extends beyond the classroom, where I was privileged to serve as a research assistant and a co-author to one of them in the field of development economics. The research-oriented approach to teaching and learning and the emphasis on independent development enhanced my ability to think analytically and critically, skills which would propel anyone further in both academic and practical fields, and certainly very useful for my career at the Bank Negara Malaysia. Research & Programme Executive, Centre for Public Policy Studies (Asian Strategy and Leadership Institute) Read two policy papers Jarren wrote here and here BSc (Hons) Economics, Class of 2013 I'm confident that the quality of education provided has given me specific analytic skills which is relevant to a wide career path. The dissertation process was inspirational as well as the close student-lecturer mentorship. I believe it was a launchpad for many of us to pursue the field of economics throughout the entire process. The Nottingham School of Economics exceeded my expectations and was an exceptional experience and I am proud to identify myself as a graduate from this school. MSc Economics and Econometrics Student, The University of Nottingham (UK) BSc (Hons) Economics, Class of 2013 What truly separates the economics programme in UNMC is simply its teaching faculty. While the School of Economics in UNMC has provided me with more than the necessary tools needed to succeed as a postgrad student, the most valuable takeaway I had as a student was the relationships I forged with my professors. Teaching is more than just books and journal articles, and the professors in UNMC understood that; the motivational support they indirectly exude has been monumental to my personal and academic growth. Additionally, the set of skills that I have obtained working as a research assistant alongside my professors has given me a solid advantage over the other postgrad students in UNUK. telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}