{
    "url": "https://www.nottingham.edu.my/Economics/Newsletter/Issue-1-2014/Key-events.aspx",
    "content": [
        {
            "p": "Professor Euston Quah delivering his keynote address at The World Economy Annual Asia Lecture sponsored by Wiley-Blackwell titled 'Pursuing Economic Growth in Asia : The Environmental Challenge' NSE Malaysia, in conjunction with Nottingham Centre for Research on Globalisation and Economic Policy (GEP) and Centre for Finance, Credit and Macroeconomics (CFCM) hosted a major international conference on Emerging Markets and Financial Integration at the Kuala Lumpur Teaching Centre. The annual conference is a major forum for academic interaction and debate, attracting prestigious speakers from universities around the world. It included two invited lectures as well as presentation and discussion of ten academic papers. The invited lectures were sponsored by Boustead Holding Bhd and Wiley-Blackwell respectively. In the first invited lecture, Dr Jayant Menon, Lead Economist (Trade and Regional Cooperation) from the Asian Development Bank explored the impact of Eurozone Financial Shocks on an increasingly integrated and globally connected ASEAN. Professor Euston Quah from Nanyang Technological University talked about the environmental challenges associated with pursuing economic growth in Asia in the second invited lecture. Some 200 participants from Asia and Europe attended the conference. Other Events Career talk: Being an Economist - What it Means to be One and Career Prospects on 13 March 2014 Teo Wing Leong, Head of School from the School of Economics presenting a token of appreciation to Ms Kristina Fong NSE Malaysia hosted a career talk: Being an Economist – What it Means to be One and Career Prospects. The talk was presented by Ms Kristina Fong, Head of Research of RAM Rating Services Berhad. Kristina shared with the audience the fun and excitements she has experienced in her career as an economist at RAM, British High Commission and Deloitte, and advised our students on how to better prepare themselves for a career. Community contribution by NSE Malaysia faculty member Nottingham Economic Essay Competition 2014 telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}