{
    "url": "https://www.nottingham.edu.my/Economics/Study-with-us/Why-NSE-Malaysia.aspx",
    "content": [
        {
            "p": "NSE Malaysia provides students with all the benefits of a world-class British education within an Asian setting. As the world looks East, our students are in the unique position to witness first-hand the extraordinary economic development taking place in Malaysia and regionally within ASEAN. NSE Malaysia has six members of academic staff – all with PhDs from world-class institutions including the Johns Hopkins University, the Graduate Institute of International and Development Studies, Genava, the Monash University, the Griffith University and the University of Nottingham. Our academic staff have also worked and consulted for governments and agencies around the world including The World Bank, and central banks from Taiwan and the United States. Our Economics degrees are among the few Bachelor of Science in Economics degrees offered in Malaysia. Our modules are a unique combination of breadth and depth: students can build on their specialist modules in year 2 by taking advanced modules in year 3, including modules on experimental and behavioral economics, an exciting field for which NSE is a global leader. In the final year, our undergraduates complete a dissertation under the direct supervision of a research active member of staff. The dissertation allows students to explore an area of economics in which they are personally interested and hone the critical thinking and research skills that they have gained throughout the course. Our PhD programme is available on a full or part-time basis and includes a period of study at the UK Campus. Our students benefit from the extensive resources available at both campuses - including joint supervision of the PhD dissertation by faculty members from the UK and Malaysia campuses. Information on scholarships, including full scholarships from the Sin Chew Daily Education Fund and many others can be found here. telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}