{
    "url": "https://www.nottingham.edu.my/Economics/Newsletter/Issue-1-2015/Key-events.aspx",
    "content": [
        {
            "p": "The World Economy Annual Asia Lecture (sponsored by Wiley Publishers) delivered by Dr Hans Genberg, Advisor, South East Asian Central Banks (SEACEN) Research and Training Centre titled 'Implementing Macro-prudential Policies: Challenges, Pitfalls and Way Forward' 8th Globalisation and Economic Policy International Conference NSE Malaysia, in conjunction with Nottingham Centre for Research on Globalisation and Economic Policy (GEP), Centre for Finance, Credit and Macroeconomics (CFCM) and Special Projects Cluster, Majlis Professor Negara (MPN) hosted the 8th GEP conference on Current Issues in International Economics and Open-Economy Macroeconomics at the Kuala Lumpur Teaching Centre. The annual conference is a major forum for academic interaction and debate, attracting prestigious speakers from universities around the world. It included two invited lectures as well as presentation and discussion of fourteen academic papers. The invited lectures were sponsored by sponsored by Boustead Holdings Berhad and Wiley Publishers, respectively. In the first invited lecture, Professor Christine Ennew, Provost and Pro-Vice-Chancellor, University of Nottingham Malaysia Campus talked on The Future of International Education. Dr Hans Genberg, Advisor, South East Asian Central Banks (SEACEN) Research and Training Centre talked about Implementing Macro-prudential Policies: Challenges, Pitfalls and Way Forward in the second invited lecture. Some 200 participants from Asia, Europe and Australia attended the conference. NSE Research Seminar on current issues in Economics On behalf of NSE, Dr Nusrate Aziz organized a day-long research seminar on current issues in economics. The seminar was held at Nottingham University Malaysia Campus on 15 February 2015. Dr Rasyad Parinduri, Dr Saumik Paul and Dr David Prentice from Nottingham University Malaysia Campus; and Dr Gareth Leeves and Dr Luc Borrowman from Monash University presented their papers on social health insurance, crop diversification, poverty and economic well-being, gender gaps in job satisfaction, and housing affordability stress, respectively. Some 45 participants attended the seminar. Dr Prentice visited Sri Lanka to deliver a workshop, 16 to 17 March 2015 Seaside, Colombo Dr Prentice's visit to Nottingham UK Campus, 15 to 27 June 2015 telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}