{
    "url": "https://www.nottingham.ac.uk/economics/research/scientific/index.aspx",
    "content": [
        {
            "p": "The Bonferroni Q test is widely used in empirical studies investigating predictability in asset returns by strongly persistent and endogenous predictors. Its formulation, however, only allows for a constant mean in the predictor, seemingly at odds with many of the predictors used in practice. We establish the asymptotic size and local power properties of the Q test, and the corresponding Bonferroni t-test, under a local-to-zero specification for a linear trend in the predictor, revealing that size and power depend on the magnitude of the trend for both. To rectify this, we develop with-trend variants of the operational Bonferroni Q and t tests. However, where a trend is not present in the predictor, we show that these tests lose (both finite sample and asymptotic local) power relative to the extant constant-only versions of the tests. In practice, uncertainty will necessarily exist over whether a linear trend is genuinely present in the predictor or not. To deal with this, we also develop hybrid tests based on union-of-rejections and switching mechanisms to capitalise on the relative power advantages of the constant-only tests when a trend is absent (or very weak) and the with-trend tests otherwise. A further extension allows the use of a conventional t-test where the predictor appears to be weakly persistent. We show that, overall, our recommended hybrid test can offer excellent size and power properties regardless of whether or not a linear trend is present in the predictor, or the predictor's degrees of persistence and endogeneity. An empirical application illustrates the practical relevance of our new approach. We study attention utility, the hedonic pleasure or pain derived purely from paying attention to information, which differs from the news utility that arises from gaining new information. The main, field, study examines brokerage account login data to show that investors pay disproportionate attention to already-known positive information on their stocks. Through its effect on logins, this selective attention affects their trading activity. Three experimental studies then show that (1) investors are more likely to engage in a paid task that will involve attention to a prior investment if that investment has gained value; (2) paying attention to a winning stock is more motivating than a doubling of monetary incentives; and that (3) attention has value independent of information acquisition. We develop a framework to analyze partial population experiments, a generalization of the cluster experimental design where clusters are assigned to different treatment intensities. Our framework allows for heterogeneity in cluster sizes and outcome distributions. We study the large-sample behavior of OLS estimators and cluster-robust variance estimators and show that (i) ignoring cluster heterogeneity may result in severely underpowered experiments and (ii) the cluster-robust variance estimator may be upward-biased when clusters are heterogeneous. We derive formulas for power, minimum detectable effects, and optimal cluster assignment probabilities. All our results apply to cluster experiments, a particular case of our framework. We set up a potential outcomes framework to interpret the OLS estimands as causal effects. We implement our methods in a large-scale experiment to estimate the direct and spillover effects of a communication campaign on property tax compliance. We find an increase intax compliance among individuals directly targeted with our mailing, as well as compliance spillovers on untreated individuals in clusters with a high proportion of treated taxpayers. The disposition effect is the reluctance to sell assets at a loss relative to a salient point of reference, typically assumed to be the purchase price. Using data on stocks and housing sales, we show that the peak price achieved by an asset during the investor's period of holding constitutes an additional salient reference point for asset owners that overlaps, and interacts, with the purchase price reference point. Peaks occurring before the investor purchased the asset do not aaect future sales, indicating that ownership affects how investors form reference points. I study price setting within a network of interconnected monopolists. Some firms possess stronger commitment or bargaining power than others, enabling them to influence the pricing decisions of other firms. While it is well-understood that multiple marginalization reduces both total profits and social welfare, I show that strategic interactions within the network exacerbate the marginalization problem. Individual profits are proportional to a new measure of network centrality, defined by the equilibrium characterization. The results underscore the importance of network structure in policy considerations, such as mergers or trade policies. We consider the issue of testing the null of equal average forecast accuracy in a model where the forecast error loss differential series has a potentially nonconstant mean function over time. We show that when time variation is present in the loss differential mean, the standard Diebold and Mariano test, which was proposed for evaluating forecasts in a stable environment, has an asymptotic size of zero, and, whilst consistent, can have reduced local power. This arises due to inconsistent estimation of the implicit long run variance estimator, which diverges under a time varying mean. We suggest a modified statistic that replaces the standard long run variance estimator based on full-sample demeaning of the loss differential series with one based on nonparametric local demeaning. The new long run variance estimator is consistent under both the null and alternative when the mean function is time varying or constant, and in both cases, the modified test recovers the asymptotic size and power properties associated with the original test in the constant mean case. The modified test therefore provides a robust method for testing the equal average forecast accuracy null, allowing for instability in the loss differential mean. The benefits of our test are demonstrated via Monte Carlo simulation and two empirical applications. We provide new evidence on the effects of economic shocks on political support, voting behaviour and political opinions over the last 25 years in the UK. We exploit a sudden, large and long-lasting shock in the form of job loss and trace out its impact on individual political outcomes for up to 10 years after the event. The availability of detailed information on individuals before and after the job loss event allows us to reweight a comparison group to closely mimic the job losers in terms of their observable characteristics, pre-existing political support and voting behaviour. We find consistent and long-lasting effects on support and votes for the incumbent party, and shorter-lived effects on political engagement. We find limited impact on the support for fringe or populist parties. In the context of Brexit, opposition to the EU was much higher amongst those who lost their jobs, but this was largely due to pre-existing differences which were not exacerbated by the job loss event itself. We estimate the impact of trade policy uncertainty (TPU) on CES import price indices, focusing on the implications of Britain’s exit from the European Union (Brexit). Our analysis reveals that a higher probability of Brexit increases U.K. import price indices by raising the prices of existing products and reducing product variety from the E.U. We find evidence that the risk of higher import protection from the 2016 referendum increased current import price indices by 11 log points. This amounted to a 2 log point increase in manufactured goods prices and a 0.6 log point decrease in consumers’ real income. Machine learning approaches provide an alternative to traditional fixed effects estimators in causal inference. In particular, double-debiased machine learning (DDML) can control for confounders without making subjective judgements about appropriate functional forms. In this paper, we use DDML to examine the impact of differential Covid-19 vaccination rates on care home mortality and other outcomes. Our approach accommodates fixed effects to account for unobserved heterogeneity. In contrast to standard fixed effects estimates, the DDML results provide some evidence that higher vaccination take-up amongst residents, but not staff, reduced Covid mortality in elderly care homes. However, this effect was relatively small, is not robust to alternative measures of mortality and was restricted to the initial vaccination roll-out period. In this paper we characterize the set of equilibria in a generalized version of the canonical two-region economic geography model that nests the class of models in Allen and Arkolakis (2014) as well as Krugman (1991) and features an input–output loop. We provide sufficient conditions for uniqueness of equilibria that — in contrast to the well-know result in Allen and Arkolakis (2014) — allow for positive agglomeration externalities, which concentrate economic activity, even in the absence of congestion effects, which disperse it, and highlight the key role played by three additional parameters: the trade elasticity, which regulates the strength of the dispersion force associated with the decline in the terms of trade caused by migration into a region; trade costs, which weaken this dispersion force by limiting trade across regions; and the importance of the agricultural sector, which pushes against agglomeration forces in manufacturing. To provide sharp answers to basic questions in international trade, a standard approach is to focus on a small open economy (SOE). Whereas the classic tradition is to define a SOE as an economy that takes world prices as given, in the new trade literature it is defined instead as one that takes foreign-good prices and export demand schedules as given. We develop a gravity model that nests all its standard microfoundations and show how to take the limit so that an economy that becomes infinitesimally small behaves like a SOE. We then derive comparative statics and optimal policy for the SOE. Ignoring standard tax indeterminacies, optimal policy is characterized by export taxes and import tariffs equal to the (inverse) foreign demand and supply elasticities, respectively, and employment subsidies determined by the scale elasticity (under perfect competition) or markups (under monopolistic competition). The textbook case for industrial policy is well understood. If some sectors are subject to external economies of scale, whereas others are not, a government should subsidize the first group of sectors at the expense of the second. Little is known, however, about the magnitude of the welfare gains from such policy interventions. In this paper we develop an empirical strategy that leverages commonly available trade data and existing estimates of sector-level trade elasticities to estimate sector-level economies of scale and, in turn, to quantify the gains from optimal industrial policy in a general-equilibrium environment. Our results point towards significant economies of scale across manufacturing sectors, but gains from industrial policy that are hardly transformative, even among the most open economies. for discussions, to Tishara Garg, Daniel Haanwinckel and Walker Ray for outstanding research assistance, and to many seminar and conference participants for comments. Costinot and Donaldson thank the NSF (grant 1559015) for financial support. We model structural time-varying macro-financial linkages between the U.S. and euro area using a large dataset for each region. We extract both real and financial cycles and identify shocks, using a factor model with drifting parameters. To interpret the mechanisms that drive the empirical results, we contextualize our estimates using a two-country financial accelerator model. Our evidence speaks clearly of an asymmetric cross-border transmission between U.S. and euro area, especially in the financial domain. This is confirmed by our theoretical complement, which shows a strong transmission of U.S. TFP shocks. Moreover, the U.S. is a more leveraged economy, which accentuates the financial accelerator effect. The collection of scientific contributions in this special issue explores the role of social norms in guiding collective behavior and the complexities of enforcing these norms in polarized contexts. It examines how norms, while fostering social cohesion, can also contribute to societal divisions, especially in politically charged environments. The included studies highlight three key areas: the enforcement of norms through mechanisms such as information dissemination and leadership; the breakdown of norms in polarized societies, where political affiliations and trust erosion can exacerbate discrimination; and the polarization of norms across political and generational divides, which can hinder collective action and deepen societal fragmentation. Together, these contributions provide valuable insights into how norms are maintained, challenged, or eroded in diverse settings, offering guidance for strengthening social cohesion in the face of contemporary global challenges. Economic institutions that impede factor mobility become more costly when an economy experiences substantial transitions such as trade liberalization. I study how trade triggers changes in labor institutions that regulate internal migration in the context of China’s Hukou system. Using a newly collected dataset on prefecture-level migration policies, I document an increase in promigrant regulations following WTO entry and estimate the impact of prefecture-level tariffs on exports on migration regulations from 2001 to 2007. I find that regions facing more export market liberalization enacted more migrant-friendly regulations. The Prisoner's Dilemma is arguably the most important model of social dilemmas, but our knowledge about how its material payoff structure affects cooperation is incomplete. We investigate the effect of variation in material payoffs on cooperation in one-shot Prisoner's Dilemma games. We report results from three experiments (N = 1,993): in a preliminary experiment, we vary the payoffs over a large range. In our first main experiment (Study 1), we present a novel design that varies payoffs orthogonally in a within-subjects design. Our second main experiment, Study 2, investigates the orthogonal variation of payoffs in a between-subjects design. In a complementary analysis we also study the closely related payoff indices of normalized loss and gain, and the K-index. A robust finding of our experiments is that cooperation increases with the gains of mutual cooperation over mutual defection. Why do individuals pay debt interest when they could use their savings to pay down the debt? We explore why individuals “cohold” debt and savings using detailed and highly disaggregated daily-level data on household finances. We find that coholding mostly occurs in short spells within the month and the level of coholding is typically modest. Periods of coholding are not associated with shocks at the individual level. We show that mental accounting has a role to play in explaining coholding, in particular how individuals allocate different categories of expenditure to accounts in credit and debit. Heteroskedasticity is a common feature in empirical time series analysis, and in this paper, we consider the effects of heteroskedasticity on statistical tests for equal forecast accuracy. In such a context, we propose two new Diebold–Mariano-type tests for equal accuracy that employ nonparametric estimation of the loss differential variance function. We demonstrate that these tests have the potential to achieve power improvements relative to the original Diebold–Mariano test in the presence of heteroskedasticity, for a quite general class of loss differential series. The size validity and potential power superiority of our new tests are studied theoretically and in Monte Carlo simulations. We apply our new tests to competing forecasts of changes in the dollar/sterling exchange rate and find the new tests provide greater evidence of differences in forecast accuracy than the original Diebold–Mariano test, illustrating the value of these new procedures for practitioners. Using data from an online brokerage, we examine the role of investor logins in trading behavior. We find that a new reference point is created when an investor logs in and views the investor’s portfolio. We observe this as a disposition effect on returns since last login in addition to the traditional disposition effect on returns since purchase. Further, these reference points produce a strong interaction such that even a small loss since last login nullifies the positive effect of a gain since purchase. This interaction follows if investors select the higher, more aspirational price as a reference point. Brexit will have implications on financial stability and the implementation of macroprudential policies. The United Kingdom (UK) will no longer be subject to the jurisdiction of the European Systemic Risk Board. This paper studies the welfare implications of this change of regime. By means of a dynamic stochastic general equilibrium model, I compare the pre-Brexit scenario with the new one, in which the UK sets macroprudential policy independently. I find that, after Brexit, the UK is better off by setting its own macroprudential policy without taking into account Europe's welfare as a whole. We exploit a natural experiment to study the causal link between dishonest behaviour and public employment. When military conscription was mandatory in Argentina, eligibility was determined by both a lottery and a medical examination. To avoid conscription, individuals at risk of being drafted had strong incentives to cheat in their medical examination. These incentives varied with the lottery number. Exploiting this exogenous variation, we first present evidence of cheating in medical examinations. We then show that individuals with a higher probability of having cheated in health checks exhibit a higher propensity to occupy nonmeritocratic public sector jobs later in life. The paper investigates two-player double-auction bargaining with private values in a setting with discrete two-point overlapping distributions of traders' valuations. We characterize parameter settings in which there exists a fully efficient equilibrium, and show that if there are traders that behave naively, ie set bid or ask equal to their valuation, then there is no equilibrium achieving full efficiency. We conduct an experiment to test the theoretical possibility that the presence of naive traders can reduce efficiency. We find, however, that efficiency is not lower in the presence of naive traders. Subjects mostly set bid/ask prices strategically but they do not coordinate on a fully efficient equilibrium and the extent of strategic behaviour is not different in the presence of naive players. We show that a learning model of noisy strategy adjustment explains the observed behaviour better than other (equilibrium or non-equilibrium) models. This paper investigates how the announcement of acquisitions affect the uncertainty that financial markets perceive about acquiring firms. We use data for publicly-listed firms in the UK between 2004 and 2017 and employ a matching estimator combined with difference-in-differences to address the endogenous selection of firms into acquisitions. While acquisition announcements do not result in a significant change in the volatility of stock returns of acquiring firms across our whole sample, this result hides substantial heterogeneity. Our main finding is that the impact of acquisitions on uncertainty is crucially shaped by a deal's geographic scope—ie whether the takeover involves a target in the same country or abroad. Domestic deals reduce the volatility of acquirers' returns by 5% on average one quarter after the announcement, while acquiring a foreign firm increases volatility by a similar magnitude. The heightened volatility resulting from cross-border transactions is primarily driven by acquisitions in industries characterized by high investment irreversibility and foreign markets where barriers to investment are higher. Conversely, the volatility reduction following domestic acquisitions is more pronounced in industries with low irreversibility. Additionally, characteristics of the deal itself, such as the relative size of the acquisition, the payment method, and whether the deal achieves majority control of the target, also play an important role in mediating the effect of acquisitions on volatility. We study the relationship between health and changing economic conditions in local areas using a GVAR model that allows for dynamic and interdependent responses to local and national economic conditions. We examine quarterly British data for 2002–2016 for 131 local areas, which displays considerable heterogeneity in economic conditions. We find robust evidence that health improves as the local economy (employment) expands, but that it takes over two years to realise the full effect. This relationship holds for musculoskeletal, cardiovascular, respiratory, and mental health conditions. We find considerable response heterogeneity at the local area level with the strongest relationship between changes in economic conditions and health found for areas with more traditional industrial structures. We test between cooperative and extractive theories of the origins of government. We use river shifts in southern Iraq as a natural experiment, in a new archeological panel dataset. A shift away creates a local demand for a government to coordinate because private river irrigation needs to be replaced with public canals. It disincentivizes local extraction as land is no longer productive without irrigation. Consistent with a cooperative theory of government, a river shift away led to state formation, canal construction, and the payment of tribute. We argue that the first governments coordinated between extended households which implemented public good provision. Economic incentives play a key role in the decision to run for office, but little is known on how they shape immigrants' self-selection into candidacy. We study this question using a two-period Roy model, and show that if returns to labour market experience differ between migrants and natives, then this will affect the relative likelihood to run for office for the two groups. We assess this prediction empirically using administrative data from Norway, a country with a very liberal regime for participation in local elections. Our results strongly support our theoretical model and indicate that immigrants' political and economic integration are closely intertwined. We use laboratory experiments to study communication games with partially verifiable information. In these games, based on Glazer and Rubinstein, 2004, Glazer and Rubinstein, 2006, an informed sender sends a two-dimensional message to a receiver, but only one dimension of the message can be verified. We investigate the effect of evidence and verification control using three treatments: one where messages are unverifiable, one where the receiver chooses which dimension to verify and one where the sender has this verification control. First, we find that evidence helps the receiver. Second, despite significant differences in behavior across the two verification treatments, receivers' payoffs do not differ significantly across these treatments, suggesting they are not hurt by delegating verification control. We also show that a theoretically optimal receiver commitment strategy identified by Glazer and Rubinstein is close to being an optimal response to senders' observed behavior in both treatments. We examine the role of cooperative preferences, beliefs, and punishments to uncover potential cross-societal differences in voluntary cooperation. Using one-shot public goods experiments in four comparable subject pools from the US and the UK (two similar Western societies) and Morocco and Turkey (two comparable non-Western societies), we find that cooperation is lower in Morocco and Turkey than in the UK and the US. Using the ABC approach – in which cooperative attitudes and beliefs explain cooperation – we show that cooperation is mostly driven by differences in beliefs rather than cooperative preferences or peer punishment, both of which are similar across the four subject pools. Our methodology is generalizable across subject pools and highlights the central role of beliefs in explaining differences in voluntary cooperation within and across culturally, economically, and institutionally diverse societies. Because our behavioral mechanisms correctly predict actual contributions, we argue that our approach provides a suitable methodology for analyzing the determinants of voluntary cooperation of any group of interest. Academia, and economics in particular, faces increased scrutiny because of gender imbalance. This paper studies the job market for entry-level faculty positions. We employ machine learning methods to analyze gendered patterns in the text of 12,000 reference letters written in support of over 3,700 candidates. Using both supervised and unsupervised techniques, we document widespread differences in the attributes emphasized. Women are systematically more likely to be described using 'grindstone' terms and at times less likely to be praised for their ability. Using information on initial placement we highlight the implications of these gendered descriptors for the quality of academic placement. Using data from an online brokerage, we examine the role of investor logins in trading behavior. We nd that a new reference point is created when an investor logs in and views their portfolio. We observe this as a disposition eeect on returns since last login, in addition to the traditional disposition eeect on returns since purchase. Further, these reference points produce a strong interaction such that even a small loss since last login nulliies the positive eeect of a gain since purchase. This interaction follows if investors select the higher, more aspirational price as a reference point. A large theoretical literature argues laws exert a causal effect on norms, but empirical evidence remains scant. Using a novel identification strategy, we provide a compelling empirical test of this proposition. We use incentivized vignette experiments to directly measure social norms relating to actions subject to legal thresholds. Our large-scale experiments (n = 7,000) run in the United Kingdom, United States, and China show that laws can causally influence social norms. Results are robust across different samples and methods of measuring norms, and are consistent with a model of social image concerns where individuals care about the inferences others make about their underlying prosociality. We develop a novel framework that simultaneously allows recovering heterogeneity in demand, quantity total factor productivity and markups across firms while leaving the correlation between the three dimensions unrestricted. We accomplish this by explicitly introducing demand heterogeneity and systematically exploiting assumptions used in previous productivity estimation approaches. In doing so, we provide an exact decomposition of revenue productivity in terms of the underlying heterogeneities, thus bridging the gap between quantity and revenue productivity estimations. We use Belgian firms’ production data to quantify total factor productivity, demand and markups, and show how they are correlated with each other across time and with measures obtained from other approaches. In doing so, we find quantity total factor productivity and demand to be strongly negatively correlated with each other, so suggesting a trade-off between the quality of a firm’s products and their production cost. We also show how our framework provides deeper and sharper insights on the response of firms to increasing import competition from China. In particular, we find that changes in revenue productivity materialise as the outcome of complex and sometimes offsetting changes in quantity total factor productivity, demand, markups and production scale. The 1965 Immigration Act represented a radical shift in US policy, which has been credited with dramatically expanding the volume and changing the composition of immigration. Its passing has often been described as the result of political machinations negotiated within Congress, without regard to public opinion. We show that congressional voting was consistent with public opinion on abolishing the country-of-origin quotas but not with the desire to limit the volume of immigration. While the former initially reflected attitudes over civil rights, the latter is consistent with contemporary expectations that the expansion in numbers would be modest. We develop tests for predictability that are robust to both the magnitude of the initial condition and the degree of persistence of the predictor. While the popular Bonferroni Q test of Campbell and Yogo displays excellent power properties for strongly persistent predictors with an asymptotically negligible initial condition, it can suffer from severe size distortions and power losses when either the initial condition is asymptotically non-negligible or the predictor is weakly persistent. The Bonferroni t test of Elliott, and Stock, although displaying power well below that of the Bonferroni Q test for strongly persistent predictors with an asymptotically negligible initial condition, displays superior size control and power when the initial condition is asymptotically nonnegligible. In the case where the predictor is weakly persistent, a conventional regression t test comparing to standard normal quantiles is known to be asymptotically optimal under Gaussianity. Based on these properties, we propose two asymptotically size controlled hybrid tests that are functions of the Bonferroni Q, Bonferroni t, and conventional t tests. Our proposed hybrid tests exhibit very good power regardless of the magnitude of the initial condition or the persistence degree of the predictor. An empirical application to the data originally analyzed by Campbell and Yogo shows our new hybrid tests are much more likely to find evidence of predictability than the Bonferroni Q test when the initial condition of the predictor is estimated to be large in magnitude. Laws mandating vaccination against Covid-19 as a condition of employment in health and care sectors were commonplace during the pandemic. Using weekly data at the local authority level, we examine the impact of the vaccine mandate for elderly care homes in England on vaccine take-up, staffing levels, and mortality. Our identification strategy involves 1. comparing take-up and staffing in English elderly care homes relative to other social care settings unaffected by the mandate; 2. comparing take-up and staffing in English elderly care homes relative to those in Wales where the mandate also did not apply; 3. comparing Covid-19 mortality among English elderly care home residents relative to mortality in domestic homes in England and to care homes in Wales. Our results suggest that the mandate substantially decreased the proportion of care home workers who remained unvaccinated (equivalent to between 28,000 and 41,000 fewer unvaccinated staff), but this came at the cost of a reduction in staffing levels of between 3 and 4 percent (equivalent to 14,000 to 18,000 staff). We observe this effect most strongly in areas of low unemployment. Our results do not provide evidence that the vaccine mandate was successful in its primary aim of reducing care home deaths. Relatively wide confidence intervals mean inferences regarding mortality are more uncertain than for vaccination uptake and staffing. The canonical model of Allingham and Sandmo (1972) predicts that firms evade taxes by optimally trading off between the costs and benefits of evasion. However, there is no direct evidence that firms react to audits in this way. We conducted a large-scale field experiment in collaboration with a tax authority to address this question. We sent letters to 20,440 small- and medium-sized firms that collectively paid more than US$200 million in taxes per year. We find that providing information about audits significantly affected tax compliance but in a manner that was inconsistent with Allingham and Sandmo (1972). We introduce \"group cohesion\" to study the economic relevance of social relationships in team production. We operationalize measurement of group cohesion, adapting the \"oneness scale\" from psychology. A series of experiments, including a pre-registered replication, reveals strong positive associations between group cohesion and performance assessed in weak-link coordination games, with high-cohesion groups being very likely to achieve superior equilibria. In exploratory analysis, we identify beliefs rather than social preferences as the primary mechanism through which factors proxied by group cohesion influence group performance. Our evidence provides proof-of-concept for group cohesion as a useful tool for economic research and practice. Rich behavioral biases, mistakes and limits on rational decision-making are often thought to make equilibrium analysis much more intractable. We establish that this is not the case in the context of one-sector growth models such as Ramsey-Cass-Koopmans or Bewley-Aiyagari models. We break down the response of the economy to a change in the environment or policy into two parts: the direct response at the given (pre-tax) prices, and the equilibrium response which plays out as prices change. Our main result demonstrates that under weak regularity conditions, regardless of the details of behavioral preferences, mistakes and constraints on decision-making, the long-run equilibrium will involve a greater capital-labor ratio if and only if the direct response (from the corresponding consumption-saving model) involves an increase in aggregate savings. One implication of this result is that, from a qualitative point of view, behavioral biases matter for long-run equilibrium if and only if they change the direction of the direct response. We provide detailed illustrations of how this result can be applied and generates new insights using models of misperceptions, self-control and temptation, and naive and sophisticated quasi-hyperbolic discounting. We analyse the impact of Covid-19 on productivity using data from an innovative monthly firm survey that asks for quantitative impacts of Covid-19 on inputs and outputs. We find total factor productivity (TFP) fell by up to 6% during 2020-21. The overall impact combined large reductions in 'within-firm' productivity, with offsetting positive 'between-firm' effects as less productive sectors, and less productive firms within them, contracted. Despite these large pandemic effects, firms' post-Covid forecasts imply surprisingly little lasting impact on aggregate TFP. We also see significant heterogeneity over firms and sectors, with the greatest impacts in those requiring extensive in-person activity. Understanding the structure of time preferences allows for accurate predictions of the effects of changing intertemporal incentives. Behavioral models of present bias are used to rationalize field data seemingly at odds with exponential discounting, leveraging additional degrees of freedom to improve in-sample fit. Largely lacking to date are the critical out-of-sample tests necessary to ensure predictive accuracy. This paper contrasts exponential discounting with present-biased procrastination for around 22,000 tax filers, advancing the literature in this domain by providing novel out-of-sample tests for both theories. Present bias provides qualitatively better in-sample fit, matching substantial increases in filing probability as the tax deadline approaches. Present bias also has improved out-of-sample predictive power for responsiveness to the 2008 Stimulus Act, and experimental data demonstrate a link between present bias and filing times. Without present bias, predicted responses to changed incentives are inaccurate, demonstrating its necessity in research and policy applications. We investigate how managers help firms grow by entering a new export market. We conduct an event study on the decision to export to Angola using data on Portuguese firms and workers. We evaluate the impact of the presence of managers with experience in exporting to the Angolan market on a firm's entry success in the aftermath of an exogenous shock: the sudden end of the Angolan civil war. We show that the presence of managers doubles the probability of a firm entering the market. We do not find any significant impact on the intensive margin of exports. We propose a family of CUSUM-based statistics to detect the presence of changepoints in the deterministic part of the autoregressive parameter in a Random Coefficient Autoregressive (RCA) sequence. Our tests can be applied irrespective of whether the sequence is stationary or not, and no prior knowledge of stationarity or lack thereof is required. Similarly, our tests can be applied even when the error term and the stochastic part of the autoregressive coefficient are non iid, covering the cases of conditional volatility and shifts in the variance, again without requiring any prior knowledge as to the presence or type thereof. In order to ensure the ability to detect breaks at sample endpoints, we propose weighted CUSUM statistics, deriving the asymptotics for virtually all possible weighing schemes, including the standardized CUSUM process (for which we derive a Darling-Erdős theorem) and even heavier weights (so-called Rényi statistics). Simulations show that our procedures work very well in finite samples. We complement our theory with an application to several financial time series. “Right to Buy” (RTB), a large-scale natural experiment whereby incumbent tenants in public housing could buy properties at heavily-subsidised prices, increased the UK homeownership rate by over 10 percentage points between its 1980 introduction and the 1990s. This paper studies the impact of this reform on crime by leveraging exogenous variation in eligibility for the policy. Results show that RTB generated significant property crime reductions. Behavioural changes of incumbent tenants and renovation of public properties were the main drivers of this crime reduction. This is evidence of a novel means by which subsidised homeownership and housing policy can reduce criminality. We study two generic versions of public goods problems: in Provision problems, the public good does not exist initially and needs to be provided; in Maintenance problems, the public good already exists and needs to be maintained. In four lab and online experiments (n=,105), we document a robust asymmetry in preferences and perceptions in two incentive-equivalent versions of these public good problems. We find fewer conditional cooperators and more free riders in Maintenance than Provision, a difference that is replicable, stable, and reflected in perceptions of kindness. Incentivized control questions administered before gameplay reveal dilemma-specific misperceptions but controlling for them neither eliminates game-dependent conditional cooperation, nor differences in perceived kindness of others' cooperation. Thus, even when sharing the same game form, Maintenance and Provision are different social dilemmas that require separate behavioral analyses. We study inference on the common stochastic trends in a non-stationary, N-variate time series yt, in the possible presence of heavy tails. We propose a novel methodology which does not require any knowledge or estimation of the tail index, or even knowledge as to whether certain moments (such as the variance) exist or not, and develop an estimator of the number of stochastic trends m based on the eigenvalues of the sample second moment matrix of yt. We study the rates of such eigenvalues, showing that the first m ones diverge, as the sample size T passes to infinity, at a rate faster by O(T)O(T) than the remaining N – m ones, irrespective of the tail index. We thus exploit this eigen-gap by constructing, for each eigenvalue, a test statistic which diverges to positive infinity or drifts to zero according to whether the relevant eigenvalue belongs to the set of the first m eigenvalues or not. We then construct a randomised statistic based on this, using it as part of a sequential testing procedure, ensuring consistency of the resulting estimator of m. We also discuss an estimator of the common trends based on principal components and show that, up to a an invertible linear transformation, such estimator is consistent in the sense that the estimation error is of smaller order than the trend itself. Importantly, we present the case in which we relax the standard assumption of i.i.d. innovations, by allowing for heterogeneity of a very general form in the scale of the innovations. Finally, we develop an extension to the large dimensional case. A Monte Carlo study shows that the proposed estimator for m performs particularly well, even in samples of small size. We complete the paper by presenting two illustrative applications covering commodity prices and interest rates data. The Voting Rights Act of 1965 redefined race relations in the United States. Yet, evidence on its effect on black office-holding remains scant. Using novel data on black elected officials between 1962-1980, we assess the impact of the VRA on the racial make-up of local governments in the Deep South. Exploiting predetermined differential exposure of Southern counties to the mandated federal intervention, we show that the latter fostered local black office-holding, particularly in the powerful county commissions, controlling local public finances. In the presence of election by district, covered counties experienced black representation gains and faster capital spending growth. In this paper, we estimate the trade effects of a transit system upgrading that streamlines border processing in developing countries. Our empirical approach combines transaction level export data from El Salvador with unique data that distinguishes export flows that were processed on the transit system. Our results indicate that the new transit system lowered regulatory border costs and raised exports. At the low end, our back-of-the-envelope estimate of the return to investment is US$ 3-to-1. This evidence informs a policy covered by the 2013 WTO Agreement of Trade Facilitation. Is it better to present evidence first or second in trials if witnesses cannot lie, and the litigants share all available witnesses? We address this question by defining preferences over playing games via their equilibrium correspondences. Exploiting this partial ordering over games, we show that litigants cannot prefer to lead, but can prefer to follow; the judge/jury may also prefer some litigant to lead, but only if the litigants each prefer to follow. Allowing a litigant to choose whether to lead after observing the available witnesses does not benefit either that litigant or the judge/jury. There is astounding variation in product quality sold in markets even when quality is difficult to ascertain and rules are poorly enforced. We investigate whether sellers differ in innate honesty (incur private cost to provide good quality) and whether this explains the variation in quality. Our study takes place in milk markets in India, where milkmen collude on price, customer rarely switch, and it is difficult to establish reputation. We invite milkmen to take part in a novel behavioural experiment to measure dishonesty. We then measure quality objectively as the percentage of water added to a litre of milk sold to customers. Our results show that dishonest milkmen add significantly more water to milk. Evidence from milk-testing tournament confirms that milk quality is difficult to verify. These results suggest that some sellers are willing to forego monetary gains to provide good quality in return for utility from being honest, even in an environment that encourages cheating. Very little is known on how traditional risk metrics behave under intraday trading. We fill this void by examining the finiteness of the returns' moments and assessing the impact of their infinity in a risk management framework. We show that when intraday trading is considered, assuming finite higher order moments, potential losses are materially larger than what the theory predicts, and they increase exponentially as the trading frequency increases-a phenomenon we call superkurtosis. Hence, the use of the current risk management techniques under intraday trading impose threats to the stability of financial markets, given that capital ratios may be severely underestimated. Posner hypothesised that the legalisation of assisted suicide may substitute for unassisted (unregulated) suicide. We test predictions arising from this hypothesis using data from US states that have legalised assisted suicide. Event study regression estimates provide strong evidence that legalisation of assisted suicide is associated with an increase in total suicides, especially for females and older people. There is some evidence that assisted suicide laws are also associated with a smaller increase in unassisted suicide, though the statistical significance is weaker than for total suicides. Results using the synthetic control method (SCM) are generally consistent with the regression estimates. Overall the US experience to date provides little evidence in support of the Posner substitution hypothesis. I motivate and empirically investigate differential long-run growth effects of democratisation across countries. While the existing literature recognises the potential for such heterogeneity, empirical implementations to date unanimously assume a common democracy-growth nexus across countries. Adopting novel methods for causal inference in policy evaluation I relax this assumption to confirm that in the long-run democracy has a positive average effect on per capita income of around 10%, adopting a range of alternative definitions for regime change in the form of binary indicators. Guided by existing hypotheses, additional analysis probes the patterns of the heterogeneous 'democratic dividend' across countries. A second common feature of this literature as well as cross-country growth empirics more generally is the absence of concerns for sample selection or influential observations. I carry out two rule-based robustness exercises to demonstrate that my empirical findings are highly robust to substantial changes to the sample. We offer new evidence on the spatial economic impact of Italian unification. Adopting municipal population as a proxy for local economic activity, we construct a new geocoded dataset spanning the pre- and post-unification periods, and discover robust evidence of an acceleration in growth near the former borders. A disproportionate improvement in market access boosted growth in these locations when barriers to trade were dismantled. Indirectly, unification’s decisive contribution to intraregional market integration, local specialisation and exchange, and economic development is revealed. A ‘meta’ model of the exchange rate combines a range of models distinguished by the drivers of the rate and by regime duration. Alternative model weights are proposed, including those obtained from a novel non-nested hypothesis-testing technique that accommodates periods of stability and slowly-evolving or abruptly-changing regimes involving multiple drivers. Focusing on density forecasts, the meta models perform well, demonstrating that all the sets of fundamentals considered can be useful for forecasting when the model is estimated over an appropriate time frame, but that the ability to exploit the changing relevance of different sets of fundamentals over time is important too. Is opposition to immigration deeply entrenched or is it open to updating in the face of new information? We explore this question by examining how attitudes of native citizens shift following exposure to information that points to potential upsides of immigration. We do so using a large-scale randomised experiment embedded in a text-comprehension study administered in Japan. As part of the study, participants were subtly presented with information on social and economic problems that immigration could help address (eg growing elderly population that requires care, labour shortage in certain sectors). Depending on the treatment, information exposure increased support for a more open immigration policy and motivated pro-immigration political action. Notably, effects persisted 10–12 days after the intervention. The results suggest that information campaigns can lessen public opposition to immigration. This paper provides a simple, yet reliable, alternative to the (Bayesian) estimation of large multivariate VARs with time variation in the conditional mean equations and/or in the covariance structure. The original multivariate, n-dimensional model is treated as a set of n univariate estimation problems, and cross-dependence is handled through the use of a copula. This makes it possible to run the estimation of each univariate equation in parallel. Thus, only univariate distribution functions are needed when estimating the individual equations, which are often available in closed form, and easy to handle with MCMC (or other techniques). Thereafter, the individual posteriors are combined with the copula, so obtaining a joint posterior which can be easily resampled. We illustrate our approach using various examples of large time-varying parameter VARs with 129 and even 215 macroeconomic variables. This paper develops a quantitative open economy framework with dynamics, firm heterogeneity and financial frictions to study the impact of corporate tax reforms targeted at multinationals. The model quantifies their impact on firm selection, production and welfare. Firms draw idiosyncratic shocks, invest in capital, choose optimal financing and select endogenously into selling abroad, through exporting or FDI. I apply this framework to the removal of the U.S. repatriation tax as in the Tax Cuts and Jobs Act. The reform’s impact trades-off two selection effects — more offshoring versus greater U.S. business dynamism. The reform leads to higher U.S. welfare at little cost to the Treasury. A series of exercises illustrate that the novel features of this framework have significant quantitative implications. The reform gives starkly different cross-sectional predictions and lower welfare gains when financial frictions are removed and it is welfare reducing in a static counterpart of the model. We study how compliance with norms of pro-social behaviour is influenced by peers' compliance in a dynamic and non-strategic experimental setting. We show that social proximity among peers is a crucial determinant of the effect. Without social proximity, norm compliance erodes swiftly because participants only conform to observed norm violations while ignoring norm compliance. With social proximity, participants conform to both types of observed behaviours, thus halting the erosion of compliance. Our findings stress the importance of the broader social context for norm compliance and show that, even in the absence of social sanctions, norm compliance can be sustained in repeated interactions, provided there is group identification, as is the case in many natural and online environments. Using the Krupka-Weber norm-elicitation technique in a lab-in-the-field experiment in rural Kenya, we measure the social norms that regulate the trade-off between wealth accumulation through saving and sharing income with kin and neighbours. We find a plurality of norms: from a strict sharing norm prohibiting any form of wealth accumulation to a norm that allows moderate wealth accumulation. We show that several individual and social network characteristics predict the norms perceived and that the pro-saving norm becomes majoritarian when an individual can conceal their income from kin and neighbours. In further exploratory analysis, we find some evidence that the type of norm individuals perceive mediates the effect of income secrecy on actual saving behaviour. Taken together, our results highlight the importance of measuring social norms when devising pro-saving policy interventions. The unravelling prediction of disclosure theory relies on the idea that strategic forces lead firms (information senders) to voluntarily disclose information about the quality of their products provided the information disclosed is verifiable and the costs of disclosure are negligible. This theoretical prediction requires that consumers (information receivers) hold correct beliefs about non-disclosed information and, in equilibrium, treat all non-disclosed information with extreme scepticism. Previous research finds that receivers are insufficiently sceptical, or in other words are naive, about non-disclosed information, which leads to the failure of unravelling. This paper examines the extent to which naivety responds systematically to features of the decision environment, namely the availability of opportunities to communicate with others (Consultation treatment) and the context of the experimental setting (Context treatment, based on hygiene ratings). We find that complete unravelling fails to occur in all our treatments. Receiver's beliefs and guesses about non-disclosed information are similar across the Consultation and Context treatments relative to the Baseline implying that receivers are naive about non-disclosed information under naturalistic features that exist in field settings. We also find that senders are partly to blame for the lack of unravelling, as intermediate types would gain from disclosing more often given the observed receiver behaviour. We analyse how spatial disparities in innovation activities, coupled with migration costs, affect economic geography, market structure, growth and regional inequality. We provide conditions for existence and uniqueness of a spatial equilibrium, and for the endogenous emergence of industry clusters. Spatial variations in knowledge spillovers lead to spatial concentration of more innovative firms. Migration costs, however, limit the concentration of economic activities in the most productive region. Narrowing the gap in knowledge spillovers across regions raises growth, and reduces regional inequality by making firms more sensitive to wage differentials. The associated change in the industry concentration has positive welfare effects. Are there positive or negative externalities in knowledge production? We analyse whether current contributions to knowledge production increase or decrease the future growth of knowledge. To assess this, we use a randomised field experiment that added content to some pages in Wikipedia while leaving similar pages unchanged. We compare subsequent content growth over the next four years between the treatment and control groups. Our estimates allow us to rule out effects on four-year growth of content length larger than twelve percent. We can also rule out effects on four-year growth of content quality larger than four points, which is less than one-fifth of the size of the treatment itself. The treatment increased editing activity in the first two years, but most of these edits only modified the text added by the treatment. Our results have implications for information seeding and incentivizing contributions. They imply that additional content may inspire future contributions in the short- and medium-term but do not generate large externalities in the long term. What are the origins of the ethnic landscapes in contemporary states? Drawing on a preregistered research design, we test the influence of dual socioeconomic revolutions that spread throughout Africa during the nineteenth and twentieth centuries—export agriculture and print technologies. We argue these changes transformed ethnicity via their effects on politicization and boundary-making. Print technologies strengthened imagined communities, leading to more salient—yet porous—ethnic identities. Cash crop endowments increased groups’ mobilizational potential but with more exclusionary boundaries to control agricultural rents. Using historical data on cash crops and African language publications, we find that groups exposed to these historical forces are more likely to be politically relevant in the postindependence period, and their members report more salient ethnic identities. We observe heterogenous effects on boundary-making as measured by interethnic marriage; relative to cash crops, printing fostered greater openness to assimilate linguistically related outsiders. Our findings illuminate not only the historical sources of ethnic politicization but also mechanisms shaping boundary formation. In this paper, we focus on the surprising phenomenon in which firms face difficulty issuing in domestic currency even in the home market, especially in emerging markets. Could this be due to \"original sin\" which has been familiar to sovereign bond issuance? In its new incarnation, original sin refers to the difficulty firms in many emerging markets have in borrowing domestically long-term, even in the local currency. We infer the nature of original sin from 5,901 financing decisions by firms in seven Asian emerging markets over a period of 20 years. Our sample period covers an episode when bond issuers had a choice between a less developed but growing onshore market, which varied across countries in the level of development, and a deep and liquid offshore market. We find that even in countries with onshore markets, it is often easier for unseasoned firms to issue offshore (in foreign currency) than to issue onshore, but changes in market development reverses this effect. In addition, once such a firm becomes a seasoned issuer, it is absolved from domestic original sin and is then able to act opportunistically and go to the market favoured by interest differentials. I examine why the harmful tradition of female genital mutilation persists in certain countries while in others it has been eradicated. People are more willing to abandon their traditions if they are confident that the government is durable enough to set up long-term replacements for them. Using a country-ethnicity panel dataset spanning 23 countries from 1970 to 2013 and artificial partition of African ethnic groups by national borders, I show that a one-standard-deviation larger increase in political regime durability leads to a 0.1-standard-deviation larger decline in the share of newly-circumcised women, conditional on the presence of an anti-FGM government policy. We investigate whether uninformative relative performance feedback can create biases in confidence leading it to ‘snowball’. We study elicited confidence about own performance, relative to other group members, in three stages. As subjects move across stages, we change group composition so that new groups contain either only top performers or only bottom performers, from the previous stage. Between treatments, we manipulate whether subjects know about their own past relative performance or that of currently matched group members. In a treatment where subjects receive no feedback between stages, their confidence remains calibrated and stable across the stages. When subjects receive feedback in the other two treatments, their confidence snowballs in the direction of the feedback, both when feedback is fully informative and completely uninformative of their future performance. The results suggest the possibility of confidence biases emerging and snowballing in a potentially wide range of field settings. We propose a testing based procedure to determine the number of common trends in a large non-stationary dataset. Our procedure is based on a factor representation, where we determine whether there are (and how many) common factors (i) with linear trends, and (ii) with stochastic trends. Cointegration among the factors is also permitted. Our analysis is based on the fact that those largest eigenvalues of a suitably scaled covariance matrix of the data corresponding to the common factor part diverge, as the dimension N of the dataset diverges, whilst the others stay bounded. Therefore, we propose a class of randomised test statistics for the null that the p-th largest eigenvalue diverges, based directly on the estimated eigenvalue. The tests only requires minimal assumptions on the data generating process. Monte Carlo evidence shows that our procedure has very good finite sample properties, clearly dominating competing approaches when no common trends are present. We illustrate our methodology through an application to US bond yields with different maturities observed over the last 30 years. Commodity prices are one of the most important drivers of output fluctuations in developing countries. We show that a major channel through which commodity price movements can affect the real economy is through their effect on banks' balance sheets and financial stability. Our analysis finds that the volatility of commodity prices is a significant predictor of banking crises in a sample of 60 low-income countries (LICs). In contrast to recent findings for advanced and emerging economies, credit booms and capital inflows do not play a significant role in predicting banking crises, consistent with a lack of de facto financial liberalisation in LICs. We corroborate our main findings with historical data for 40 ‘peripheral’ economies between 1848 and 1938. The effect of commodity price volatility on banking crises is concentrated in LICs with a fixed exchange rate regime and a high share of primary goods in production. We also find that commodity price volatility is likely to trigger financial instability through a reduction in government revenues and a shortening of sovereign debt maturity, which are likely to weaken banks' balance sheets. Global value chains have fundamentally transformed international trade and development in recent decades. We use matched firm-level customs and manufacturing survey data, together with Input-Output tables for China, to examine how Chinese firms position themselves in global production lines and how this evolves with productivity and performance over the firm lifecycle. We document a sharp rise in the upstreamness of imports, stable positioning of exports, and rapid expansion in production stages conducted in China over the 1992–2014 period, both in the aggregate and within firms over time. Firms span more stages as they grow more productive, bigger and more experienced. This is accompanied by a rise in input purchases, value added in production, fixed costs incurred, and profits. We rationalise these patterns with a stylised model of the firm lifecycle with complementarity between the scale of production and the scope of stages performed. We develop a political economy model to study the decision of representative democracies to join a preferential trading agreement (PTA), distinguishing between free trade areas (FTA) and customs unions (CU). Our theoretical analysis shows that bilateral trade imbalances and income inequality are important factors determining the formation of PTAs, whereas the patterns of geographic specialisation explain whether a CU or an FTA will emerge. Our empirical analysis-using a comprehensive panel dataset spanning 187 countries over the period 1960-2015-provides strong support for these predictions. In an interconnected world, economic and political interests inevitably reach beyond national borders. Since policy choices generate external economic and political costs, foreign state and non-state actors have an interest in influencing policy actions in other sovereign countries to their advantage. Foreign influence is a strategic choice aimed at internalising these externalities and takes three principal forms: (i) voluntary agreements, (ii) policy interventions based on rewarding or sanctioning the target country to obtain a specific change in policy, and (iii) institution interventions aimed at influencing the political institutions in the target country. We propose a unifying theoretical framework to study when foreign influence is chosen and in which form, and use it to organise and evaluate the new political economics literature on foreign influence along with work in cognate disciplines. We compare a credit rating agency's incentives to acquire costly information when it is only paid for giving favourable ratings to the corresponding incentives when the agency is paid upfront, i.e. irrespective of the ratings assigned. We show that, in the presence of moral hazard, contingent fees provide stronger dynamic incentives to acquire information than upfront fees and may induce higher social welfare. When the fee structure is chosen by the agency, contingent fees arise as an equilibrium outcome, in line with the way the market for credit rating actually works. Using a broad panel of advanced economies we document that increases in GDP per capita are associated with a systematic shift in the composition of value added to sectors that are intensive in high-skill labour, a process we label as skill-biased structural change. It follows that further development in these economies leads to an increase in the relative demand for skilled labour. We develop a quantitative two-sector model of this process as a laboratory to assess the sources of the rise of the skill premium in the US and a set of ten other advanced economies, over the period 1977 to 2005. For the US, we find that the sector-specific skill neutral component of technical change accounts for 18-24% of the overall increase of the skill premium due to technical change, and that the mechanism through which this component of technical change affects the skill premium is via skill biased structural change. We develop easy-to-implement tests for return predictability which, relative to extant tests in the literature, display attractive finite sample size control and power across a wide range of persistence and endogeneity levels for the predictor. Our approach is based on the standard regression t-ratio and a variant where the predictor is quasi-GLS (rather than OLS) demeaned. In the strongly persistent near-unit root environment, the limiting null distributions of these statistics depend on the endogeneity and local-to-unity parameters characterising the predictor. Analysis of the asymptotic local power functions of feasible implementations of these two tests, based on asymptotically conservative critical values, motivates a switching procedure between the two, employing the quasi-GLS demeaned variant unless the magnitude of the estimated endogeneity correlation parameter is small. Additionally, if the data suggests the predictor is weakly persistent, our approach switches to the standard t-ratio test with reference to standard normal critical values. Governments do not always enforce their laws, even when they have the means of doing so, and lax enforcement is common in the domain of immigration policy. To explain this paradox we develop a political agency model where gains from migration are unevenly distributed, and an elected government chooses both quotas and their enforcement. We show that distributional concerns can have perverse effects on migration policy since a utilitarian government may set a quota to appease the electorate, but then strategically under-invest in its enforcement. Under-investment is more likely, the larger the preference gap between median and average voter, and the higher the likelihood of a populist challenger gaining office. Our analysis also indicates that redistributive taxation reducing the share of enforcement cost borne by the median voter exacerbate the problem, whereas a compensatory tax rebate financed through a tax on profits from migration alleviates the conflict of interest, thus reducing illegal immigration. Gambling is an ordinary pastime for some people, but is associated with addiction and harmful outcomes for others. Evidence of these harms is limited to small sample, crosssectional self-reports, such as prevalence surveys. We examine the association between gambling as a proportion of monthly income and 31 financial, social, and health outcomes using anonymous data provided by a UK retail bank, aggregated for up to 6.5 million individuals over up to seven years. Gambling is associated with higher financial distress and lower financial inclusion and planning, and negative lifestyle, health, well-being, and leisure outcomes. Gambling is associated with higher rates of future unemployment, physical disability, and, at the highest levels, substantially increased mortality. Gambling is persistent over time, growing over the sample period, and has higher negative associations among the heaviest gamblers. Our findings inform the debate over the relationship between gambling and life experiences across the population. The disincentive effects of social assistance programs on registered (or formal) employment are a first-order policy concern in developing and middle-income countries. We study the impact of a conditional cash transfer (CCT) program in Uruguay on the employment of adult members in beneficiary households in a context of high informality. Our research design relies on the sharp discontinuity introduced by program eligibility rules around a poverty score threshold combined with longitudinal administrative data. We find reductions of about 6 percentage points (a 13% drop) in formal labour force participation among all beneficiaries and of 8.7 percentage points (a 19% drop) for single mothers. The implied elasticity of participation in the formal sector with respect to the net-of-tax rate is about 0.78 for the full sample and about 1.3 for single mothers. The reduction in labour supply is stronger among individuals who have a medium propensity to be formally employed, with a smaller reduction in the case of infra-marginal individuals. We also present suggestive evidence that the reduction in formal employment increases inactivity and informal work in equal proportions. Finally, despite pervasive informality in the context of the Family Allowance assistance program (AFAM), the program’s marginal value of public funds of 0.61 implies an efficiency cost within the range of cash transfer programs targeted to families in the United States. A principal seeks to persuade an agent to accept an offer of uncertain value before a deadline expires. The principal can generate information, but exerts no control over exogenous outside information. The combined effect of the deadline and outside information creates incentives for the principal to keep uncertainty high in the first periods so as to persuade the agent close to the deadline. We characterise the equilibrium, compare it to the single-player decision problem in which exogenous outside information is the agent's only source of information, and examine the welfare implications of our analysis. Sir Clive Granger Building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}