{
    "url": "https://www.nottingham.edu.my/Economics/Newsletter/Issue-1-2014/Research-and-publications.aspx",
    "content": [
        {
            "p": "By Lubik, T.A. and Teo, W.L. We derive and estimate a New Keynesian Phillips Curve (NKPC) in a model with deep habits. Habits are deep in that they apply to individual consumption goods instead of aggregate consumption. This alters the NKPC in a fundamental manner since it introduces consumption growth and future demand terms into the NKPC equation. We construct the driving process in the deep habits NKPC by using the model's optimality conditions to impute time series for unobservable variables. The resulting series is considerably more volatile than unit labor cost. Generalised methods of moments estimation shows an improved fit and a much lower degree of indexation compared to the standard NKPC. From Journal of Money, Credit and Banking 46(1), 79-114, 2014 By Dabalen, A. and Paul S. In this paper we estimate the causal effects of conflict on dietary diversity in Côte d’lvoire. To identify the true impact of conflict, we use (1) pre-war and post-war household data, (2) the specific counts of conflict events across departments, and (3) self-reported victimisation indicators. We find robust and statistically significant evidence of households in the worst-hit conflict areas and individuals who are the direct victims of the conflict having lower dietary diversity. The propensity score-matching estimates do not alter the main findings. Other robustness checks including subsamples of households with children support the existing findings. From World Development 58, 143-158, 2014 By Lam, C. and Paul, S. The practice of conservation through displacement has become commonplace in developing countries. However, resettlement programmes remain at very low standards as government policies only focus on economic-based compensation which often excludes socially and economically marginalised groups. In this paper, based on a case study of the displaced indigenous people, the Rana Tharus, from the Shuklaphanta Wildlife Reserve in Nepal, we argue that compensation as a panacea is a myth as it does not effectively replace the loss of livelihoods. This is particularly the case when the indigenous community's customary rights to land are not legally protected. From Conservation and Society 12(1), 65-76, 2014 This paper estimates the causal effects of civil war on years of education in the context of a school-going age cohort that is exposed to armed conflict in Côte d'Ivoire. Using year and department of birth to identify an individual's exposure to war, the difference-in-difference outcomes indicate that the average years of education for a school-going age cohort is .94 years fewer compared with an older cohort in war-affected regions. To minimise the potential bias in the estimated outcome, the authors use a set of victimisation indicators to identify the true effect of war. The propensity score matching estimates do not alter the main findings. In addition, the outcomes of double-robust models minimise the specification errors in the model. Moreover, the paper finds the outcomes are robust across alternative matching methods, estimation by using subsamples, and other education outcome variables. Overall, the findings across different models suggest a drop in average years of education by a range of .2 to .9 fewer years. From Journal of Development Studies (Forthcoming) telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}