{
    "url": "https://www.nottingham.ac.uk/edi/reasonable-adjustments.aspx",
    "content": [
        {
            "p": "At the University of Nottingham, we follow the social model of disability. We are committed to implementing adjustments to remove or reduce barriers, ensuring all staff can thrive and achieve their full potential. Our approach is to empower colleagues who are disabled or experiencing other limiting health conditions, to discuss potential adjustments which may support their physical workplace or working practices. This should be with their line manager as soon as they become aware of the need. Reasonable adjustment requests will be accepted in most cases, provided the measure requested is effective in alleviating the disadvantage and is reasonable in all the circumstances, including being the most proportionate way to provide the support. In the minority of cases where it isn’t possible to agree to the specific adjustment requested, collaborative and sensitive discussion should take place about alternative adjustments which can be offered. Line managers should take a pro-active approach, once they become aware of an adjustment request or potential need and all parties should be collaborative and maintain compassion and confidentiality in any discussions. Any required adjustments should be implemented in a timely manner. In this way, we can ensure that colleagues receive the support they need and that the university’s employer obligations under the Equality Act 2010 to make reasonable adjustments for staff with a disability are met. Whilst the Equality Act applies to those with a qualifying disability, and medical evidence is often required to help to establish the nature and effect of the health condition, the university seeks to align its approach to The Equality and Human Rights Commission Statutory Code of Practice, which states: ‘In order to avoid discrimination, it would be sensible for employers not to attempt to make a fine judgement as to whether a particular individual falls within the statutory definition of disability, but to focus instead on meeting the needs of each worker’. We therefore believe that it is helpful to view the requirements of the Equality Act as a minimum requirement and have committed to working towards an intersectional UoN (Staff) Adjustments Framework allowing us to create the infrastructure to enable us to make workplace adjustments for non-disabled staff who are disadvantaged by other circumstances such as caring responsibilities, fertility treatment, short-term illness/injury, etc. in addition to reasonable adjustments for staff with a disability. We understand that making workplace adjustments for our employees is fundamental to creating an inclusive, safe and supportive environment where everyone can succeed. Look out for the release of the Institutional Disability Equality Plan for further information. You might have heard the terms 'reasonable adjustments' and 'workplace adjustments' being used interchangeably. Many employers are striving to create inclusive environments that support staff members experiencing a breadth of challenging circumstances to access adjustments to support them in carrying out their role. A workplace adjustment is any adjustment that an employer makes to the workplace to support an employee(s) who may be disadvantaged by a circumstance. It is not specific to a disability. ‘Reasonable adjustment’ is a term used in the Equality Act 2010 which specifically refers to adjustments that employers are legally obliged to implement for staff and job applicants who meet the legal definition of a disabled person. At present, we are piloting our improved ways of working for reasonable adjustments specifically to ensure we embed these changes effectively. Our long-term ambition is to move towards ‘workplace adjustments’. We want to empower all colleagues to take an active role in reflecting on the work experiences of themselves and their peers to ensure we're able to identify and remove barriers that impact inclusion and success within our community. We know that some areas of our community are already role modelling excellence in line with our longer-term ambitions and we look forward to working collaboratively across the university and with our staff networks to ensure this practice is consistent and equitable across the university as a whole. We have adopted a three-meeting model process (a supportive open conversation, an explorative meeting and an outcome meeting) that enables the staff member and line manager to agree and implement adjustments in a timely manner. View our document on The Three Step Meeting Model and our process maps for more information. In addition, as a staff member, you can explore more about our process on our dedicated Adjustments SharePoint (available only to existing staff). Throughout the process, we strongly encourage the completion of the optional Adjustment Passport. It should be used as a live document to capture any adjustments in place for staff across the university. Guidance on how to use the adjustment passport can be found in the key document section of this page. In addition, we have created a referrals process to enable a route for colleagues to raise concerns if communication has broken down during the adjustments process, a resolution cannot be reached, or the outcome is felt to be unjust. Further information on the referral process can be found on the Reasonable Adjustments SharePoint. The university has created a dedicated reasonable adjustments SharePoint site to support existing colleagues who may be seeking reasonable adjustments or responsible for implementing adjustments for colleagues in their team. On this page you can explore: Visit the Adjustments SharePoint There is no automated process to update your staff profile if you declare a disability to your line manager. Please do update your profile on UniCore. More information on how you can update your disability status in UniCore can be found here. This aggregated anonymised data is helpful to understand how many disabled people work in the organisation and what their needs are so that we can measure engagement, establish a benchmark for assessing improvements, learn about barriers and provide adequate support. The information you choose to share is for monitoring purposes and to enable us to support you. When you complete this form, we will share your disability declaration status with your Line Manager. Please note that only the disability declaration will be shared, and not any further details, for example the category of your disability. You are not obliged to tell us that you have a disability, however if you do, it will enable us to support you on an ongoing basis. Changing/updating your disability will start a journey which will provide prompts for both you and your manager to discuss any reasonable adjustments/additional support you may require. A person may become disabled at any time, and we would like all our employees to check and update their information regularly. We are committed to inclusive recruitment and want to support you to succeed in our interview and assessment process. Where disability is disclosed on your application and you are shortlisted, you will be contacted to discuss potential adjustments. For example, depending on your needs you could receive questions in advance of the interview, receive test information printed in a larger font, or be provided with a quiet space or break during the process. You can also contact our Recruitment team directly to discuss adjustments by emailing hr@nottingham.ac.uk or by calling +44 (0)115 748 4800. Did you know that if you demonstrate that you meet the minimum requirements for the role, you will be automatically shortlisted as a disabled candidate (unless you opt out)? Learn more about our inclusive recruitment approach and our Disability Confident Employer commitments at our web pages for candidates. Please note that the agile working provision of equipment list has been removed whilst it's being reviewed to ensure it aligns with our support for disabled staff. Trent Building University Park Campus Nottingham"
        }
    ],
    "pdf_files": []
}