{
    "url": "https://www.nottingham.ac.uk/edi/recognition-months/black-history-month/black-history-month-at-the-university.aspx",
    "content": [
        {
            "p": "Each year throughout October the university recognises Black History Month. This year’s Black History Month theme, “Reclaiming Narratives” marks a significant shift towards recognising and correcting the narratives of Black history and culture. Please have a look at the events, talks, presentations and screenings below and get involved! We will be updating the information with any additional details as and when they are confirmed. When: Promotion will start around Thursday 3 October and activities will run throughout the month. Reading Challenge will run both w/c 7 and w/c 14 October Where: UoN Libraries Interactive Reading Display: We'll set up displays featuring books relevant to the month's theme, each accompanied by a sticky note with an engaging summary (similar to what you see in Waterstones). A QR code will be available by the displays, linking to accessible versions of each book and information about the accessible resources offered across our libraries. Self-Guided Reading Challenge: Participants can pick up or download a card or bookmark that includes recommended books from the reading list. There will be space for reflections, and we’ll encourage sharing on social media using a specific hashtag. We’ll randomly select three participants to win an Amazon or Blackwell’s voucher. Digital Promotion & Engagement: Throughout the month, we’ll promote the reading list and challenge via Libraries social media channels, website and newsletters, highlighting a different book each week and showcasing accessible options along with key quotes and themes. We will do a giveaway twice through this month where students can win a book from the library display reading list. Reflection Wall: Next to the displays, we’ll create a Reflection Wall where participants can post notes or quotes about what they’ve learned or how a particular book has impacted their understanding of Black history. A digital version will also be available for accessibility.\" When: Wednesday 9 October, from 5pm - 7pm Where: Room A17, Plant Science building, Sutton Bonnington Booking information: No booking required. Open to all UoN staff and students Showcase the diverse cultural richness at the SB campus during Black History Month. This event will encouraging all to come along wearing national costumes with a selection of food from diverse African/Caribbean countries. The event will screen a mini film ‘Victims of medical apartheid and racial objectification: The stories of two black women’. This film has been made by a black individuals from our school with local black actors/voice specifically for Black History month. There will also be informal discussions on perceived misinterpretation of African cultures. When: Tuesday 15 October 2024, from 3pm - 4pm Where: Online (via Teams) Booking information: Join the event now [Teams] We are very delighted to let you know that our UoN UCU President Professor Lopa Leach has kindly invited the UCU President Maxine Looby to be with us online at 3pm - 4pm on Tuesday 15 October 2024. She will give us a talk, titled Tackling Structural Racism: Moving the Conversation Forward, followed by Q&A. Please submit your questions here in advance, if you wish. Structural racism is a workplace hazard. It is real, it’s damaging and heavily impacts progression and outcomes. Structural racism impacts *Black academics, lecturers, educators and researchers at every level. As a union, UCU has a duty to ensure the *Black members voices are not only heard but to listened to. Black agency is key and must be front and centre in all we say and do as a union. So, how do we move the conversation forward? Join us in an open and honest discussion. *UCU uses the term 'Black' in a political sense to refer to people who through heritage have one or more parents, from Africa, the Caribbean, Asia (the Middle-East to China) and Latin America. It refers to those from a visible minority who have a shared experience of oppression.. The word is used to foster a sense of solidarity and empowerment. We hope you can make this session and join this open and honest discussion. When: Tuesday 15 or Tuesday 29 October 2024 (date still TBC), from 10am - 3pm Where: Centre for Interprofessional Education and Learning (Faculty of Medicine and Health Sciences) Booking information: TBC This interprofessional event is designed to equip healthcare students, practitioners, and community members with the tools and knowledge they need to address healthcare disparities and systemic racism at an individual level. Through thought-provoking discussions, personal stories, workshops, and interactive sessions, attendees will gain valuable insights into the importance of effective communication, allyship, and anti-racism in the healthcare environment. Event Topics: When: Wednesday16 October at 12pm-1pm. Where: LASS (Law and Social Sciences Building), B55 Booking information: No booking is required. Free, all welcome. A seminar by: Dr Miranda Armstrong, Assistant Professor in Sociology, University of Nottingham. For more details visit the ICEMiC webpage. When: Wednesday afternoon, 16th October from 3:00pm to 5:00pm Where: School of Computer Science, A07. Booking information: Register here Open to all. The Computer Science (CS) EDI Committee together with our dedicated students, the Education and Student Experience Team, Black Sport Collective, with sponsorship from Google, will host an in-person Black History Month event with the theme of ‘Reclaiming Narratives’. We will showcase vital work inspiring personalities in STEM have done or currently do in the CS Atrium, and inspire the next generation of young people to follow in their path. We aim to bring people from black communities together to join our conversation. We aim to recognise the challenges, reclaim narratives, celebrate successes, and discuss career progression. We will host a panel and roundtable discussions followed by networking, food and drink. Our speakers include: Ayaan Mohamed, founder of Digitech Oasis, a Google backed AI company that has received the King’s Award for Enterprise this year along with other awards, and Seun Runsewe, a cloud expert working on tech infrastructure for women’s health devices like breastfeeding pumps, both female African founders. If you have any questions please get in touch with the Black History Month Organiser Team. When: Thursday 17 October, from 6pm - 8pm Where: Room B01/B02, Gateway Building, Sutton Bonnington campus Booking information: No booking required - open to all UoN staff and students A 2023 film, based on a 2001 novel ‘Erasure’ - a black professor writes ironic stereotypic fiction that is mistaken for genuine black culture. When: Monday 21 October, from 5pm - 6.30pm Where: Campus Life Booking Information: TBC Reclaiming Narratives: The Art of Black Hair celebrates afro hair and explores hair styling as an art form and black heritage. The event will be open to all students and it's purpose is to engage students in discussion around black culture and hair, explore the history of black hair and engage in a practical workshop to explore black history. Participants will be invited to share their stories, memories, and experiences of hair, as well as the daily ritual of hair styling and the beauty of afro hair as an expression of individuality, imagination, and heritage. This is a collaborative workshop between the SU, ResX and Student Hub. When: Monday 21 October, from 5pm Where: TBC Booking information: TBC LGBTQIA+ Staff network will be showing a film about queer black lives. The Network will select the film from a shortlist. We want to bring awareness of the intersection of black and queer lives and show a film that highlights this community. The event is about fostering understanding and inclusion. When: Tuesday 22 October, from 11.45am - 1.45pm Where: E41,E Floor, Portland Building, University Park Campus Booking information: Register here (spaces are limited) for queries, please email bme-staffnetwork@nottingham.ac.uk. Join us for our special panel event and Q&A celebrating the power of personal stories, as individuals from Black heritage communities share how they are reclaiming their narratives in academic and professional spaces. Hear from alumni, students, and staff as they discuss navigating challenges, overcoming stereotypes, and reshaping their identities and careers. Agenda: We encourage you to invite friends, colleagues, and anyone interested in this important conversation. When: Wednesday 23 October, from 10am - 2pm Where: TBC This activity consists of mini-lectures and discussions led by students and staff on the historical inaccuracies, biases and inequalities within population health, and the untold successes and victories of Black population health practitioners. Each mini-lecture will be 20 minutes long, with 10 minutes for discussion and questions. Time at the end of the lecture series (1pm-2pm) will be available for networking. The lectures will be an in-person event and will be recorded and made available for all staff and students at the university. As the lecture series will focus on population health, the topics will be relevant to wider health and social science students and staff. Speakers will be staff and students based throughout Lifespan and Population Health (Public Health and Epidemiology, Health Psychology, Primary Care, Dermatology, Child and Perinatal Care) to ensure a breadth of topics, narratives and perspectives are embedded within the lecture series. As some lectures will be student-led, this activity will give Black students the opportunity to deliver a presentation on an incredible important topic within their field, ensuring that their views and experiences are embedded within the lecture series, giving them the opportunity to lead the narrative of teaching resources. Thus, this lecture series also aims to improve the student experience and academic outcomes of Black students. When: Wednesday 23 October, from 4.30pm - 5.30pm Where: Humanities Building, Room A2, University Park Booking information: Please register here Join Dr Richard Bates from History and Dr Philippa Read from French to find out more about the untold experience of French Colonial soldiers in the First World War. Free pizza and drinks will be provided. Booking required. When: Thursday 24 October 2024, from 12.30pm - 2pm Where: Room B43, Dearing building, Jubilee campus Booking information: Please book your place here Ever cringe after seeing a dodgy representation of cultures across the African continent on TV or film? Ever feel superimposing Black characters/subjects into European artforms seems offbeat? How to fill the dearth of diverse books in the UK and beyond with storylines channelling authentic melanated cultures? Come help write & plot the way forward as we reclaim narratives! this event will have fun QUIZZES/GAMES | ART & POETRY SESSION | LIVELY MUSIC! Part 1: Interactive Learning Session (30 mins) Part 2: Creativity Session (30 mins) This artistic exploration and narrative expedition is the first of award-winning Yorùbá-Nigerian writer, poet and lecturer Abíọ́dún Ọlátòkunbọ̀ Abdul’s event series focusing on cultural and social themes related to Yorùbá/Nigeria/Africa/Diaspora: YNAD Talks. When: Thursday 24 October, from 6pm - 8pm Where: Room B01/B02, Gateway building, Sutton Bonington campus Booking information: No booking required - open to all UoN staff and students A hybridisation of indigenous Aztec celebrations including Quecholli with Catholic Allhallowtide, Mexican Day of the Dead celebrations commemorate lost loved ones in a Danse macabre. The 2017 Pixar film Coco perfectly encapsulates this event with an all-Latino principal cast. When: Friday 25 October, from 6pm - 9pm Where: Coates Road Auditorium, University Park campus Booking information: Please book your place here Join us for us for what promises to be a great evening where our black students will be empowered, inspired, and celebrated. There will be music, food, activities, networking opportunities and a keynote talk by our very own Dr. Onyeka Nubia (Assistant Professor, UoN). A pioneering and internationally recognised historian, writer and presenter who is reinventing our perceptions of the Renaissance, British history, Black Studies and intersectionalism. Onyeka is the leading historian on the status and origins of Africans in pre-colonial England from antiquity to 1603. The talk will critically examine evidence for diversity in British history and explore ideas of British identity. When: Friday 25 October 2024, from 6pm - 9pm Where: 2 Collygate Road, Nottingham, NG2 2ET Booking information: Please register here Join us for an insightful panel discussion featuring CEOs, Directors, and Non-Executive Directors who will share their career journeys and personal stories. This is a unique opportunity to gain valuable insights from industry leaders who have paved the way in their fields. Our Speakers include: Whether you're just starting your career, looking to make a change, or aiming for the boardroom, this event is for you. Let's come together to learn, grow, and celebrate the rich history and future potential of the Black community in the professional world. Where: Foyer, Jubilee Sports Centre Booking information: No booking required A small exhibition in our sports centre (Jubilee) celebrating the creative minds of sportswear and fashion. This year's Olympics has shown great promise for this potential exhibition. With multiple team uniforms being designed by Black designers such as Team Nigeria's uniform being designed by Lanny Smith and Team Haiti's uniform being designed by Stella Jean. Where: School of English Booking Information: TBC The event will be a reading and discussion (including audience Q+A) with the black feminist writer and activist Lola Olufemi. This event will be on campus and open to the public, and will consist of around 30-minutes of reading with around 30-minutes of questions; it will be held on a weekday early-evening in October. Lola Olufemi is author of 'A FLY Girl's Guide to University' (Verve Poetry Press, 2019), 'Feminism Interrupted: Disrupting Power' (Pluto Press, 2020) and 'Experiments in Imagining Otherwise' (Hajar Press, 2021); her work considers and resists racialised and gendered structures of power - she is a hugely exciting young writer. This event will contribute to the process of diversifying the writing / writers hosted and prioritised on campus. By hosting a successful young black feminist writer, this event will seek to foster inclusion and inspire students – particularly global majority students – who hope to have their own voices heard in the literary world. The event will also platform an important new thinker who writes in nuanced ways about the history of black life in Britain, as well as in the contemporary. Lola's work is also especially pertinent to this year's theme of 'Reclaiming Narratives', as her recent book focusses on the liberatory power of the imagination. Overall, the event will predominantly contribute to fostering inclusion, promoting diversity and celebrating black excellence. Where: Faculty of Science When: From Wednesday 6 November - 1pm - 3pm to design and submit their art Booking Information: TBC The individual schools will be working collaboratively to run a creative competition that will be open to all students across the faculty. Students will be invited to submit a poster/poem/photo or similar around the national theme of ‘Reclaiming Narratives’. Example from last year from one school Once entries have been received our main event will involve showcasing the entries in a central location (e.g. ESLC). All students from across the faculty will be invited to attend to vote for their favourites and be part of the prizegiving ceremony. Where: The Orchards, University Counselling Service, University Park campus When: Every Tuesday between 5 November and 10 December Booking information: please email br-ucsworkshops@exmail.nottingham.ac.uk The university counselling service has created a space for Black students to come and discuss their experiences as students at UoN. The support group is facilitated by counselling staff and runs for six consecutive weeks. We aim to deliver a group once per term. The support group is primarily concerned with providing a space for Black students to engage in discussion about their experiences that they may not feel comfortable or able to with non-Black support staff or peers. Over the past few years, the university has held some amazing events to recognise and celebrate Black History Month. We encourage you to have a look back at events, workshops and discussions from previous years. A look back at 2023's events for Black History Month A look back at 2022's central event for Black History Month A look back at university events celebrating Black History Month 2021 A look back at university events celebrating Black History Month 2020 We have also had some amazing events with our Chancellor, including: Find out more about EDI at the University of Nottingham or our BME Staff and Student Networks. Trent Building University Park Campus Nottingham"
        }
    ],
    "pdf_files": []
}