{
    "url": "https://www.nottingham.ac.uk/edi/project-period/project-period.aspx",
    "content": [
        {
            "p": "Period poverty is a global problem, with millions of women and girls being held back and even endangered by not being able to afford basic menstrual care. In the UK, 1 in 10 girls can't afford to buy menstrual products, with many missing classes as a result. Project Period is the University of Nottingham's way of trying to address this imbalance, by offering free period products for students and staff across our campuses, home and abroad. Up to January 2024, we've distributed more than 300,000 pads and tampons across seven of the university's UK campuses. This initiative contributed to UoN gaining the first Athena Swan Gold Award in the UK, which is a tremendous accolade. Here to help - and begin the conversation In addition to tackling period poverty, the vision of Project Period is to make menstruation and menopause part of everyday conversation. For periods, our core objectives are to address being ‘caught short’, culture, education, compassion, dignity and hygiene Pads and tampons are widely available in toilets across our campuses – look out for posters and signs. UoN Transport and Logistics now delivers pads and tampons for Project Period, which are then distributed by the cleaning staff, similar to toilet paper and hand soap. If you need more products or replacement boxes, or you would like to provide products in a new location, please make a request by logging a ticket on UoN Requestor If unsure how to do this, your building manager will be able to assist. We have also been distributing 1,000 period cups to evaluate the potential inclusion of these reusable products into the offering from Project Period. We will have feedback from our volunteer users during the first half of 2024 to help with the forward decision. Led by Associate Dean of Teaching & Learning for the Faculty of Science & Engineering, Professor Jess Price, colleagues are launching the scheme as a pilot at the University of Nottingham Malaysia (UNM). Products should be in place at selected locations across our UNM campus in time for Earth Day – on Monday 22 April 2024. For any queries or more information, please contact Professor Jess Price. Download materials that you can edit for your location Links to further guidance, support and information For any feedback or queries, please contact Professor Chris Denning Trent Building University Park Campus Nottingham"
        }
    ],
    "pdf_files": []
}