{
    "url": "https://www.nottingham.ac.uk/edi/university-initiatives.aspx",
    "content": [
        {
            "p": "At the university, we try to embed the values of Equality, Diversity and Inclusion into everything we do. We have led multiple succesful EDI initiatives, that aim at creating an inclusive environment for our university community where everyone is free to be their authentic selves. This includes large-scale culture-change initiatives as well as more local-level schemes aimed at getting the best of our students and staff. Some of our recent campaigns include: STEMM-CHANGE Changing culture and practices in equality, diversity and inclusion in Science, Technology, Engineering, Mathematics and Medicine. Review of support of disabled staff A full review of support for disabled staff at the university has been published, examining the levels of support available and how this is accessed and experienced by disabled staff. EDI Resource Bank The EDI Resource Bank was developed as part of the STEMM-Change project to be a new, open-access database which brings together materials to support EDI work in a range of HE settings. EDI in practice Sharepoint The Equality, diversity, and inclusion (EDI) in practice sharepoint is a shop window to browse the work that is going on across the university, open to anyone with an interest in EDI. AccessAble App The university is proud to announce the launch of the new AccessAble app, a revolutionary tool that will greatly benefit all of our students, staff and visitors to campus. The app is designed to provide practical information about facilities available and the access routes into our buildings. EDI Conversation Cards Our Equality, Diversity and Inclusion (EDI) cards were developed by Peter Craigon, Debra Fearnshaw, Oliver Fisher and Emma Hadfield-Hudson at the University of Nottingham. The development of the EDI cards is an ongoing research project lead by Peter Craigon. For details on the original development of the EDI cards you can view a recording of a workshop that explained the EDI cards in June 2022. Research into historic slavery links It is important we learn from our past and acknowledge where we may have benefitted from action that would not be acceptable today. As part of this, we commissioned research, together with Nottingham Trent University, into historic connections to the transatlantic slave economy and we are publishing the findings of this research. EDI Champions campaign This campaign celebrated the university's EDI Champions - staff and students who not only incorporate EDI values into all they do at the university, but help to encourage and educate others to follow suit. Trent Building University Park Campus Nottingham"
        }
    ],
    "pdf_files": []
}