{
    "url": "https://www.nottingham.ac.uk/education/study/postgraduate-taught/rol/index.aspx",
    "content": [
        {
            "p": "If you have prior learning or experience at an appropriate level relevant to your studies at the University of Nottingham, you may apply for credit exemption from modules within our masters provision. Applications for ROL should be made at the time of application for admission to the university and at least four weeks before the start of the course. Applications for ROL are processed free of charge. Late applications will not be considered. Where you can demonstrate and evidence from an employer (or other professional person) that prior learning gained through vocational or other experience is relevant to the degree you wish to study. Where you have been awarded previous credits from a UK higher education degree-awarding body (including the University of Nottingham) and wish to transfer these credits to achieve a higher award, for example, progressing from a postgraduate diploma to a masters degree. We are unable to approve ROL for face-to-face courses where a student route visa is required to study in the UK. This is because we can only sponsor full-time students for a student route visa, and applying ROL for credits previously achieved reduces the study load to below full-time. International students are encouraged to consider our distance learning options if they wish to apply for ROL (see course information page for distance learning courses). This also applies to PGCEi alumni who can apply their PGCEi credits to subsequent MA study. You may apply for up to 80 credits towards your masters (180 credits) qualification. However, as this has to be taken against whole modules, for the majority of our provision this will be set against two x 30-credit modules. Credits gained through study at the University of Nottingham is not subject to this limitation. Please note that exemption from our modules may mean that your course duration is shorter than advertised. Tuition fees may therefore need to be paid in fewer instalments. If necessary an amended payment plan will be communicated to you at the beginning of your course. ROL can be claimed against masters level credits gained from previous learning or from substantive vocational (and other relevant work) experience. The course specific ROL information lists the programmes offering automatic ROL and maximum number of credits that can be applied for. Where the qualification is not included in the list, you need to demonstrate that there is a close match between the prior learning and the level and learning outcomes of the modules for which exemption is being sought. This is a rigorous process and ultimately a matter for academic consideration and judgement. Information about qualification levels can be found on the Qualifications Framework webpage. We cannot add your ROL exemption to your student record until you have completed registration. This means your fees will show the full amount at the time of registration. When we have added your exemption, your record will show the reduced fees to be paid."
        }
    ],
    "pdf_files": []
}