{
    "url": "https://www.nottingham.ac.uk/education/study/undergraduate/index.aspx",
    "content": [
        {
            "p": "Our BA Education combines the academic study of educational policies, systems, contexts and practices, with a practical focus on career development. The BA Education course explores current educational ideas and practices and will encourage you to challenge the assumptions that underpin them. When you graduate, you will be well-equipped to understand and influence a range of educational processes at local, national and international levels. You'll be able to challenge educational practices and debate issues such as equality in education, learning in the digital age, and the ways in which cognition and development affect the way people learn. If you’re interested in the factors that influence the way we teach and learn, and want to keep your career options open, the BA Education is perfect for you. Find out where a degree in education could take you. BA Education course information We offer a warm and safe community that allows you to be yourself, find your feet and have a great time in a space where you belong. What you will learn Our course leaders, explain why they are interested in education and how students learn on the course and how you can personalise your degree. Course leaders On a professional placement you will gain a wide range of skills that are directly applicable to your chosen career and enhance your knowledge and expertise. Placements From communities and societies to field trips and volunteering projects, find out what it's like to study education at the University of Nottingham Activities Meet some of our BA Education alumni who exlain how studying this course helped them achieve their career ambitions and find out where they went to work. Alumni We offer pre-sessional English language courses to improve your language level to meet the entry requirements for your degree. There is continued support while you study with us, with courses, consultations and drop-ins available. English language support Visit us on campus to learn more about the course, meet academic staff and chat to current students. You can also attend general talks about student life, accommodation, finance and more. Our open days for 2026 entry take place on: If you can't visit us in person, don't worry, you can still get all the information you need and a feel for campus life. We have subject talks and general information sessions online. You can also use a chat platform to talk with staff and students and can take virtual tours of our campuses. Visit our open days website and click the 'virtual visits' tab. The School of Education is based on the award-winning Jubilee Campus. The campus is an exemplar of brownfield regeneration and has impeccable green credentials. The environmentally-friendly nature of the campus and the buildings have led to numerous environmental and sustainability awards."
        }
    ],
    "pdf_files": []
}