{
    "url": "https://www.nottingham.ac.uk/education/events/2024-25/violence.aspx",
    "content": [
        {
            "p": "Please register your attendance This seminar is taking place face-to-face and online. When registering for this event, we will collect personal data from you. This information will not be passed outside of the University of Nottingham. Please read our privacy information for more detail about how we use data. This presentation reports the findings of a qualitative action research study undertaken in Durban, South Africa, from 2021-2023 to develop a group of practitioners – community activists, university tutors and academics – as facilitators of dialogues on sensitive social issues, in a context of what Adams refers to as ‘chronic violence’. In the study, a group of 35 participants worked over 10 sessions in 2021-2022 in an exploratory phase in 2021, partly in response to a breakdown in social cohesion demonstrated by widespread looting and violence in July 2021. A second group of 35 took part in a five-month implementation phase in 2023. While teacher development is much more than development of the theory and practice of facilitation, it is argued that the findings of this study may inform the education of teachers so that they can promote peace through their work. The theoretical framework for the study drew on Freire, Galtung and Bourdieu, in particular on their focus on how we internalise at a deep level the rigidities of unjust and violent societies, an internalisation that education either reinforces or challenges. The overarching research question was: In a society that has experienced historical violence, how can understandings of contexts, of students and of ourselves inform the pedagogy of a teacher education that aims to build peace? Six themes were generated from the data: 1 A great extent of violence and trauma was reported in the project. 2 The central role of a safe space in enabling change became evident. 3 The openness to experience revealed both the strength of emotions and the great diversity of experience. 4 Developing questions became a valuable way of extending learning. 5 Participants reported major development in their sense of themselves and their capabilities, as what one referred to as ‘beyond facilitation’, learning at a deep level about oneself and about oneself in relation to others; for some, it was part of a process of healing from our ‘embodied history’ (Bourdieu). 6 Worthwhile change takes time and may need to engage with resistance. A striking element was how close the roles of participant and facilitator became. There are major implications for teacher education in violent contexts. We need to make teacher education (and ultimately all education) a safe space within which specific processes of engagement draw on our diverse and often troubled histories. Such spaces can develop forms of participation that enable the imaginative possibilities of education. Crispin Hemson Biography International Centre of Nonviolence, Durban University of Technology, South Africa crispinh@dut.ac.za; hemsonc@ukzn.ac.za Crispin Hemson is former Head of the School of Education, University of Natal, former Director of the International Centre of Nonviolence, Durban University of Technology and now CEO, UKZN Extended Learning. His particular research interests concern pedagogy, violence and nonviolence; the study in this seminar is part of his doctoral work. He is also a social and environmental activist."
        }
    ],
    "pdf_files": []
}