{
    "url": "https://www.nottingham.ac.uk/educational-excellence/educational-enhancement/teaching-learning-assessment-technology.aspx",
    "content": [
        {
            "p": "The Learning Technology Section support the University of Nottingham in its pursuit of excellence in teaching, learning and assessment through the innovative use of technology and media. Working in collaboration with schools and faculties harnessing our expertise in pedagogy, technology and media, we aim to elevate student outcomes and support academic staff in creating unparalleled opportunities for learners. Learning Technology News and Updates (Internal Only) Our team of Learning Technology Consultants and Officers collaborate with academics, assisting them in creating enriching technology-enhanced teaching and assessment experiences. Moreover, our Learning Systems team provide cutting-edge tools to our students, revolutionising how they study and learn, regardless of their location or schedule. We strive to foster diversity in student intake. By employing innovative approaches, we open doors for \"non-traditional\" and new entry routes into the University, with staff dedicated to supporting Apprenticeships, Placement students and Distance Learning programs. Our dedicated digital accessibility initiatives ensure that every aspiring learner has an equal opportunity to thrive. As a team with a profound commitment to ethical and civic responsibilities, we actively share our knowledge and expertise with the wider community. We support the University’s engagement with the FutureLearn free course platform, we maintain Examsys and Xerte Open-Source Software projects, and our media production team engage with the public by sharing the University’s inspiring stories. For more information on how we can help you transform teaching, learning and assessment through the power of technology please contact us at Learning-Technologies@nottingham.ac.uk If you have any problems or queries relating to this page, please email: BR-EE-WEB@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}