{
    "url": "https://www.nottingham.edu.my/Education/People/xunyu.chai",
    "content": [
        {
            "p": "Assistant Professor, Faculty of Social Sciences Chai Xun Yu is an Assistant Professor at the School of Education, University of Nottingham Malaysia. She read for her PhD and MA TESOL at the University of Nottingham Malaysia. She holds a B.Ed TESL from the University of Selangor. Her work experience includes serving as an English teacher at a prestigious International School, both at the primary and secondary levels. She has also worked as an English language teacher at a national secondary school. ORCID ID: https://orcid.org/000-0002-0797-6300 Awards Involvement in Granted Education Research She has served at project management and administration levels in several granted education research that aim at developing and improving education in multiple aspects, ranging from higher education development, programme evaluation of learning tools and their effectiveness. These include: Involvement in Education Outreach Programmes She was involved in management and leadership roles in education outreach programmes. These include: Undergraduate Postgraduate In the past, she contributed to the following modules: She contributed to sessions on creativity in argumentation and problem solving for undergraduate students of Universiti Teknologi Mara, Kelantan and Universiti Tunku Abdul Rahman (UTAR) in 2023. She was involved in a professional development workshop on \"creativity in English language teaching\" for teachers of English Language Centre, Kuching in 2019. She was also one of the trainers for the University of Nottingham Malaysia Winter English programme with Hanyang University in 2017 and Summer English programme with Dong-Eui Institute of Technology in 2018. She also contributed to the training sessions of the education research and outreach programmes undertaken by the School of Education, University of Nottingham Malaysia including the LINUS teacher training, La Sallian school leaders training, Girl Guides Association Malaysia management training, SMK Dato Mohd Said, Nilai, NS, and Sathya Sai Organisation professional development programmes. telephone: +6 (03) 8725 3717 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}