{
    "url": "https://www.nottingham.edu.my/Education/Research/SRPBS.aspx",
    "content": [
        {
            "p": "If you are interested to run a seminar this year, you can send us the following information: 11 January 10am - 1pm Venue: EA28 Workshop: Research Grant Application - The ABCs Organiser: Dr Sivabala Naidu 24 February 9am - 4pm Venue: BA05 & EA23 Workshop: Microsoft in the Classroom Convenor: Ms. Fairuz Nadira Zainal, Teacher Ambassador, Microsoft Malaysia Dr Wong Tze Peng This workshop is only for the School of Education's students 15 March 9am - 1pm Venue: F3C09 Practice-based Talk: The School Curriculum Dr Philip Whitehead 4 – 5 pm Venue: BA64 Research Presentations 29 March 4 - 5 pm Research Presentation 31 March 2 - 4 pm Venue: F1A13 Education Forum: What and Where a Degree in TESOL Can Bring You? This forum features four successful panellists with a background in or affiliation with TESOL/TESL and who are currently committed to different professional roles within the education and corporate industries. This forum is organised in collaboration with the Careers Advisory Service Registration: https://goo.gl/forms/yvGvJVrPrzsfCRE92 Enquiry: 12 April 21 April 8:30am - 5pm Venue: F4B06 Public Workshop Supporting the Learning Needs of Persons with ADHD: Best Practices and Strategies Registration Fees: https://goo.gl/forms/YhNBlUUZL0idXIuB3 Payment: https://epay.nottingham.edu.my Enquiry: Dr Salma Jameel (p: +6 03 8725 3588) 26 April 2 - 3 pm Venue: F4LG10 Workshop Language Awareness and Diversity Management: Developing an Appropriate Framework for Teaching English in Asia Convenor: Associate Professor Isabel Pefianco Martin, Chair of the Department of English, Ateneo de Manila University, Philippines 28 April 10.30am - 12pm Venue: F4B09a Practice-based Talk Project-based and Problem-based Concepts in Higher Education: The Experience of the Oulu EduLAB Presenter: Dr. Blair Stevenson, Manager at the Oulu EduLAB programme Dr Sivabala Naidu 17 May 8 June Time: 4-5pm Ethical Issues in Doing Research: Some Controversies (by Dr Philip Whitehead, School of Education, UNMC) The Beliefs and Practices in Mother-Child Talk among families of Malay Heritage in Malaysia (by Dr Wong Tze Peng, School of Education, UNMC) (to be presented as part of the School of Education's Research Workshop for the postgraduate taught programmes' students) 13 June Time: 10-11am The Malaysian Education Blueprint: Impact on School Leaders (by Prof. Tony Bush, School of Education, UNUK-UNMC) 20 July Time: 11am - 12pm Assessing Changes in L2 Learners’ Beliefs and Values through Critical Lifetime Events: A Focus on Study Abroad Experiences (by Associate Professor Robert H. Taferner, Hiroshima University) Dr Lee Kean Wah 13 Sep Research Presentions Positive Student Engagement Through Workshops Centred on Developing Intercultural Awareness (by Nabila Shariff Al-Baiti, CELFE, UNMC) Developing a Taxonomic Framework: Design and Methodological Considerations (by Chai Xun Yu, PhD student, School of Education, UNMC) 11 Oct Time: 2-3pm Undergraduate CPD Planning Effective Lessons Using the SIOP Model (by Associate Professor Lee Kean Wah) Dr Lee Kean Wah / Dr Wong Tze Peng This workshop is only for the School of Education's undergraduate students Time: 4 - 5pm Effective teaching of sustainability within a multidisciplinary online context: The University of Nottingham Experience (by Dr Subarna Sivapalan, Department of Management & Humanities, Universiti Teknologi PETRONAS) Inquiry-led learning: Facilitators and Inhibitors (by Associate Professor Lucy Bailey, School of Education, UNMC) 13 Oct How to LAND that Academic/Professional Position: Strategising your Graduate Degree Experience (by Professor Andy Noyes and Professor Tony Bush, School of Education, UNUK) Dr Alefiya Nomanbhoy 30 Nov Venue: TBA by Professor Ganakumaran Subramaniam, School of Education, UNMC, and Associate Professor Choong Wee Kang, Department of Civil Engineering, UNMC Note: Seminar information may be subject to change. Our events are FREE to all and to be held in the Semenyih Campus unless advised otherwise. Seminar invitations will be sent via FASS, nearer the time of each seminar. Topics presented in our past series of research- and practice-based seminars: telephone: +6 (03) 8725 3717 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": [
        "pdf_files/SRPBS-150317.pdf",
        "pdf_files/SRPBS-150317.pdf",
        "pdf_files/SRPBS-290317.pdf",
        "pdf_files/Education-Forum.pdf",
        "pdf_files/SRPBS-120417.pdf",
        "pdf_files/SRPBS-120417.pdf",
        "pdf_files/Workshop-ADHD-210417.pdf",
        "pdf_files/SRPBS-enote-260417.pdf",
        "pdf_files/SRPBS-280417-notice.pdf",
        "pdf_files/SRPBS-170517-enotice.pdf",
        "pdf_files/SRPBS-170517-enotice.pdf",
        "pdf_files/SRPBS-8June-enotice.pdf",
        "pdf_files/SRPBS-8June-enotice.pdf",
        "pdf_files/SRPBS-13June-enotice.pdf",
        "pdf_files/SRPBS-July17.pdf",
        "pdf_files/SRPBS-notice-130917.pdf",
        "pdf_files/SRPBS-notice-130917.pdf",
        "pdf_files/PLANNING-EFFECTIVE-LESSONS-USING-THE-SIOP-MODEL.pdf",
        "pdf_files/SRPBS-11Oct-eNotice.pdf",
        "pdf_files/SRPBS-11Oct-eNotice.pdf",
        "pdf_files/Bush-Noyes-Oct13.pdf",
        "pdf_files/Series-of-Research-and-Practice-Based-Seminars-2016.pdf",
        "pdf_files/Series-of-Research-and-Practice-based-Seminars-2015.pdf"
    ]
}