{
    "url": "https://www.nottingham.edu.my/Education/People/sharimila.ambrose",
    "content": [
        {
            "p": "Assistant Professor, Faculty of Social Sciences Dr. Sharimila Ambrose is an Assistant Professor in the School of Education (Special & Inclusive Education stream) at the University of Nottingham Malaysia Campus. She is a trained Speech-Language Pathologist (SLP) with 25 years of clinical practice and teaching experience in various settings in the United States of America, New Zealand, Malaysia, and United Kingdom. Prior to joining University of Nottingham Malaysia Campus in April 2022, she was an Assistant Professor at the State University of New York at Plattsburgh, USA. She has also held academic positions at the University of Canterbury, New Zealand and Universiti Kebangsaan Malaysia. Sharimila enjoys supporting individuals with special needs, in particular, children and adolescents with communication, speech, language and learning difficulties and their families. She has provided child- and family-centered interventions and has worked with teachers and academic specialists to maximize children's communication, language and learning skills, both in home and school settings. She is also passionate about higher education students' learning skills and is actively finding ways to foster participation, inclusivity and cultural responsivity in the classroom, and is committed to the scholarship of teaching and learning. Sharimila enjoys collaborative research with students and colleagues from various disciplines, including special education teachers, mainstream teachers, and social workers. She has a keen interest on the learning issues that impact individuals from multicultural/multilingual and diverse backgrounds, and factors that influence language development and skills in children. Sharimila has presented a number of research- and academic-based talks and community talks related to her area of expertise to colleagues, teachers, healthcare and medical professionals, students, parents, and the public on various platforms in Malaysia and internationally. Qualifications Postgraduate Previously, I have taught the following modules at the undergraduate and graduate levels My main research areas are centered around: telephone: +6 (03) 8725 3717 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}