{
    "url": "https://www.nottingham.edu.my/Education/Research/Postgraduate-Research-Students.aspx",
    "content": [
        {
            "p": "There are a number of postgraduate students in the department studying for PhD and MPhil degrees in various areas of education. Building and Validating a Conversational Entrainment Methodology to Objectively Quantify & Diagnose Sources of Social Communication Deficits in Children with Neurodevelopmental Disorders. Conversational entrainment is the subconscious coordination of communicative actions such as speech rate, speech rhythm between conversational partners. Entrained behaviour is crucial for conversational success. Past studies showed that poor entrainment skills cause social-interaction problems in adults with neurological disorders but the impact of poor entrainment on children with neurodevelopmental disorders is largely unknown. In the present study, we will compare the process of entrainment in adult-child interaction of typically developing children and children with neurodevelopmental disorders through a semi-structured conversational task. Result from the study help us to develop an entrainment metric to diagnose social communication deficits in children with neurodevelopmental disorders. Exploring the relationship between teachers’ emotional intelligence and students’ language learning. Teaching involves great emotional labour as teachers navigate the emotional intricacies and what we know is emotional intricacies can come in three parts - teacher, student, and teacher-student. Teachers and students are intertwined in this bidirectional relationship where their actions and decisions can create a feedback loop which affects teacher-student relationships, classroom environment and dynamics, and student outcomes. However, existing literature that investigates this relationship has been scarce and the results were mostly mixed and inconclusive. Therefore, my research aims to investigate the relationship between teachers’ emotional intelligence and students’ academic achievement and/or language learning in the Malaysian secondary school context. This study will focus on unfolding this relationship further with hopes of discovering factors that support teachers and students' emotional well-being in Malaysia. kaby6acj@nottingham.edu.my Supervisors: Dr Ashely Ng Yoon Mooi, Dr Michael Hall and the late Professor Ganakumaran Subramaniam Research topic: An investigation of education policy formulation and implementation: A case study of international schools in Sri Lanka. As a response for the legitimate concern of limited scope of research on international schools and to address the gap on the study of educational policy, this study has chosen to focus on the investigation of policy formulation and implementation in international schools . The purpose of the study is to examine the formulation and implementation of policies in international schools in Sri Lanka. From this perspective this case study serves the following goals: it provides data about policy formulation and implementation processes in international schools in Sri Lanka, about the actors’ involvement in effective policy implementation, what happens when policy enters the varied enactment environments. The role of policy actors within their contexts and the relationship between policy and practice. Supervisors: Dr Csaba Z Szabo and Dr Jessica Price Research topic: Evaluating a Cognate List between English and Bahasa Malaysia, Mandarin, and Tamil to Support Teaching through the Medium of English. Vocabulary is an essential component of language acquisition. Despite the significance attached alongside studies suggesting that learners’ first language helps them to make important linguistic, lexical and conceptual connections between their more proficient languages and English, the ways to bolster vocabulary teaching and learning are often overlooked. Hence, this research aims to examine the quantity and quality of cognates between the Malaysian vernaculars and the 10,000 most frequent words of English. This is a controlled experimental study that utilises reaction time and eye-tracking technology to understand whether cognates are recognised by learners faster and more accurately. It is hoped that this research will contribute to theory-building in the Malaysian context. Supervisors: Dr Csaba Szabo and Dr Barry Lee Reynolds Research topic: Exploring the predictive and concurrent validity of the PTE-A for academic achievement: a dual-site study. Officially introduced in 2009, The Pearson Test of English Academic (PTE-A)’s results are increasingly recognised as the language entry requirement for international students to access their tertiary studies in universities and institutions of higher education (HE) where English is the medium of instruction. Therefore, this research project aims to examine: Findings from this study are expected to contribute to further substantiate the importance of general academic English language proficiency in the case of students studying in English medium HE institutions, evaluate the effectiveness of English for Academic Purposes (EAP) courses from a language proficiency perspective and more significantly expand knowledge and empirical evidence concerning the correlations between the receptive vocabulary size of students and the four language skills and the vocabulary section of the PTE-A. Supervisors: Dr Wei Keong Too and Dr Csaba Z Szabo Research topic: An empirical study of verifying the effectiveness of game video on Chinese ESL learners. My research will focus on the influence of \"computer gameplay video watching\" on second language acquisition, and whether the influence of the media has a more efficient and flexible way on learners' learning results. This study will review the process of computer gameplay video production, demonstrate the potential of game video, and argue the possibility of introducing this media into second language learning. According to some studies about computer games, computer games have an effective impact on second language acquisition. So if the content of computer games is transferred to the gaming video, does this positive effect still exist? This project adopts the mixed method in research design, combines the questionnaire, survey, and test results, use specific standards to recruit participants, uses data analysis software and empirical survey to obtain reliable research results. This study aims to explore the feasibility of gaming video as a language aid tool. The purpose of my paper is to explore whether gaming video can guide learners to achieve better language acquisition. sbxyl2@nottingham.edu.my Teachers’ Perspectives on the Impact of Creating an Inclusive Learning Environment Using Project Based Learning (PBL) and Universal Design for Learning (UDL) to Enhance the Academic and Social Outcomes of Students with Diverse Needs. There is a prominent interest in the current educational settings to investigate the impact of adopting new learning approaches on raising the achievement and full participation of learners with diverse needs. PBL & UDL are considered among the evidence-based 21st century learning approaches that are notably used in many mainstream classrooms nowadays. However, evidence for their effectiveness to enhance inclusive education for students with diverse needs is still limited. More research is needed to identify the most effective inclusive practices that can be adopted at both school and classroom levels to enhance the academic and social outcomes of students with diverse needs. This study aims to bridge the existing gap in the current research through exploring teachers’ perspectives (Syrian & Saudi Arabian Contexts) towards the impact of using PBL and UDL in their diverse classrooms and identifying the main factors that can facilitate the implementation process. It will also shed the light on any significant changes in teachers’ attitudes and willingness towards inclusive education after participating in a professional development training program to address the challenges they might encounter when integrating PBL and UDL. The results of the quantitative (Questionnaires) and the qualitative (Interviews, Portfolios & Classroom Observations) methods that will be used in this study will contribute to providing school leaders and policy makers more understanding of the impact of using PBL and UDL in enhancing good quality inclusive education for all learners. sbxra7@nottingham.edu.my telephone: +6 (03) 8725 3717 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}