{
    "url": "https://www.nottingham.ac.uk/education/study/postgraduate-taught/index.aspx",
    "content": [
        {
            "p": "Our postgraduate programmes are designed to support both individual and organisational development and aim to deepen and refine your capacity to reflect critically upon your thinking and practice. Our guide to applying Funding information This course course aims to strengthen your understanding of learning in the digital age and explore how digital technology can transform the teaching and learning experience. It will increase your knowledge of digital technologies as resources for learning. You will evaluate the use of such technologies in educational contexts and assess how new learning technology can be implemented at a variety of levels in both formal and informal education. Available full-time starting in September MA Digital Teaching and Learning This course aims to strengthen and refine your ability to critically reflect upon your own teaching. You will engage with contemporary theories in education and examine how you might apply them to the practice you carry out. We welcome approaches from educational organisations who may wish to develop a bespoke programme for staff working towards the MA Education. MA Education Available part-time starting in September or February MA Education (Online) This course will develop your essential leadership and management skillset. You'll conduct research that drives growth and enhances your professional practice to help you make a positive difference within the classroom or an education organisation. We welcome approaches from educational organisations who may wish to develop a bespoke programme for staff working towards the MA Educational Leadership and Management. MA Educational Leadership and Management MA Educational Leadership and Management (Online) This course enables you to explore what is known about mentoring and coaching in the context of education. You will examine your own, and others’ practices, and develop your professional skills to implement a mentoring plan. Available part-time (10 months) starting in September PG Cert Mentoring and Coaching Teachers This course enables you to gain the theoretical, professional and personal skills needed for effective counselling practice. You will undertake a work placement as a counsellor and be supported by qualified practice educator, allowing you to build practical skills and develop as a counsellor. Available full-time (24 months) or part-time (48 months) starting in September MA Person-Centred Experiential Counselling and Psychotherapy This course looks at how can we best support learners who are struggling with learning, the complexities of inclusive education in a rapidly changing world, the rights of children to be included in schools and how we address the current barriers to inclusivity. It examines the educational needs of children with labels of learning difficulties and disabilities. You’ll consider the importance of communication and literacy and analyse how different countries approach identification and assessments for children with special needs. MA Special and Inclusive Education MA Special and Inclusive Education (Online) This course will deepen your understanding of Chinese language education and set you up for a rewarding international career in this fast-growing area. You will gain the knowledge to successfully prepare, design and deliver Chinese language programmes in local and global teaching contexts. MA Teaching Chinese to Speakers of Other Languages This course has been designed to develop and encourage your critical understanding of the latest developments in TESOL theory and practice. It will enable you to reflect on your own teaching practice/context and help improve your career prospects, whilst preparing you to conduct independent research into teaching and learning. MA Teaching English to Speakers of Other Languages MA Teaching English to Speakers of Other Languages (Online) This course provides you with the core knowledge and theory needed to become a professional in the field of trauma. You'll explore models of psychological trauma and consider how trauma impacts on mind and body. Please note that this course starts every two years - 2024, 2026, 2028... Available part-time starting in September MA Trauma Informed Practice You can access a variety of talks about postgraduate study on our on-demand platform and take a virtual campus tour. Talks and tours We offer pre-sessional English language courses to improve your language level to meet the entry requirements for your degree. There is continued support while you study with us, with courses, consultations and drop-ins available. English language support"
        }
    ],
    "pdf_files": []
}