{
    "url": "https://www.nottingham.edu.my/Education/Eventsrecords/Workshop-on-Supporting-the-Learning-Needs-of-Persons-with-ADHD-Best-Practices-and-Strategies.aspx",
    "content": [
        {
            "p": "Attention Deficit Hyperactivity Disorder (ADHD), is a common neurobehavioral condition seen in classrooms. Despite the high frequency of its occurrence, managing the learning and behaviour needs of persons with ADHD continues to be challenging and sometimes daunting. Skillful management not only requires the collaboration of parents, teachers and communities but also knowledge about research validated best practices. This full day workshop on ADHD is facilitated by a panel of experts. Presentations and discussions will focus on understanding individuals with ADHD as well as discussing practical strategies for teachers and parents. Programme 08:30 Registration 09:00 Welcome 09:15 Understanding children with ADHD by Anne Emerson 10:30 Tea 10:45 ADHD Friendly Strategies by Philip Whitehead 11:45 Brain Smart Techniques by Cynthia Yolanda Doss 12:45 Lunch 14:00 Building Relationships by Jeanette Whitehead 15:00 Pulling strategies together: A multi-tiered approach to support ADHD in schools by Alefiya Nomanbhoy 16:00 16:15 Panel Discussion Workshop presenters profile: Associate Professor Anne Emerson Anne Emerson is Associate Professor of Special and Inclusive Education at the University of Nottingham, UK. She first trained as a speech and language therapist and has worked with children with special needs for over 30 years as well as being a teacher in further education and university lecturer. Dr Philip Whitehead Philip Whitehead is Assistant Professor of Educational Leadership and Management at the University of Nottingham, Malaysia. He has worked in many sectors of the education system in the UK and overseas during a long and varied teaching career. For three memorable years, he worked in the UK with young people with social, emotional and behavioural difficulties, and he retains an interest in this area of education. Associate Professor Cynthia Yolanda Doss Cynthia Yolanda Doss, PhD is a Think Buzan Licensed Instructor. She has conducted numerous workshops for adults and children on the use of Mind Maps as a thinking tool for Teaching and Learning. Ms Jeanette Whitehead Jeanette Whitehead is a study support tutor in Wellbeing & Learning Support, University of Nottingham, Malaysia. Formerly, she was Deputy Head of a high performing U.K. Secondary school with particular responsibility for the Learning Support department. Dr Alefiya Nomanbhoy Alefiya M. Nomanbhoy is Director, Postgraduate Research programmes and is part of the Special and Inclusive Education team at the University of Nottingham, Malaysia. She has extensive experience in the field of learning disabilities and teacher training. She has also served as an educational/clinical psychologist and evaluated and worked with children, adolescents and adults for ADHD and specific learning disabilities, including dyslexia. Details: Date: 21 April 2017, Friday Time: 08:30 to 17:00 Venue: F4B06 Tuanku Zara Building The University of Nottingham Malaysia Campus Jalan Broga 43500 Semenyih Fee: RM120.00* for general participants (parents or professionals) RM90.00* for non-UNMC students RM80.00* for UNMC students and staff telephone: +6 (03) 8725 3717 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": [
        "pdf_files/Campus-map-2016-latest.pdf",
        "pdf_files/Campus-map-2016-latest.pdf"
    ]
}