{
    "url": "https://www.nottingham.edu.my/EGS/Research/TCEL/index.aspx",
    "content": [
        {
            "p": "Southeast Asia has one of the richest biotas in the world but is also the tropical region with the highest deforestation rate that threatens the region with massive extinctions in the imminent future. At UNMC ’s Tropical Conservation Ecology Lab we focus mainly on the ecology and conservation of Asian megafauna, charismatic large mammals such as Asian elephants, rhinos, tapirs, and large cats, that are highly vulnerable to human impacts and whose survival by the end of the 21st century is questionable. in an effective way and assessing the effectiveness of ongoing mitigation strategies such as elephant translocation and electric fencing. Besides urgent issues, we also focus on ecological questions with important but longer-term conservation implications. We believe that megaherbivores and apex predators are highly interacting species with key ecological roles in ecosystems processes. We are particularly interested in the frugivory of elephants, rhinos, and tapirs and its implications for the seed dispersal of megafaunal-syndrome plants (those with very large fruits and seeds that cannot be dispersed by smaller animals), such as mangos and durians. Ultimately we want to understand what are the ecosystem-level consequences of the rapid loss of megafauna throughout the region. Moreover, the lab is open to address other conservation-relevant questions. In recent years we have carried out a number of studies on forest structure and mammal communities in different Malaysian forests, and have participated on studies of sun bears, binturongs, and forest rodents. We investigate policy and governance matters related to wildlife conservation, and even the behavior of conservation scientists themselves. Research interests 1. The Management & Ecology of Malaysian Elephants (MEME) 2. Impact of traditional agriculture on forest structure 3. Terrestrial Ecosystem Assessment & Monitoring Network (TEAM) 4. Science-policy interface for wildlife conservation 5. Project black cloud panther 6. Project pteropod Organising the 3rd Regional Conference of the Society for Conservation Biology, Asia Section http://scbasia2014.org telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}