{
    "url": "http://www.nottingham.edu.my/EGS/index.aspx",
    "content": [
        {
            "p": "We invite you to explore our geography and environmental science courses today! Degree programme offered by the School of Environmental and Geographical Sciences. Learn more about the key areas of research within the school. Our degrees lead to a wide range of diverse and exciting careers. There are no results that match your criteria. Environmental and geographical science have a common focus on studying the environment, its components, and the interactions between humans and the natural world. However, they do differ in many ways. Geographical science comprises the study of the Earth’s physical features, climate, human populations, and the relationships between them. It looks at spatial patterns, explores cultural and social phenomena and analyses the interactions between humans and their environment. Environmental science focuses more on understanding the environment and covers ecosystems, natural resources, and the impact of human activities on the planet. In the search for sustainable solutions, environmental science often combines biology, chemistry, physics and earth science to address environmental issues. UNM’s School of Environmental and Geographical Sciences graduates can pursue various career paths. They can look for positions in environmental consulting, urban planning, conservation organisations, research institutions, governmental agencies and sustainable development initiatives. Yes, our school offers a Geographical Sciences MPhil/MRes/PhD for students interested in advancing their expertise in this field. The entry requirements for each course may vary, so it is best to visit our university’s admissions page or contact the admissions office. Our team will be able to provide detailed information on the application process, the required documents and deadlines specific to the programme you’re interested in enrolling in. We believe that a conducive environment is essential when it comes to learning. Hence, we provide state-of-the-art research facilities, well–equipped laboratories, and field equipment for data collection. Our students can also access study spaces and online journals to support their academic pursuits. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}