{
    "url": "https://www.nottingham.edu.my/EGS/Research/WaterResources/index.aspx",
    "content": [
        {
            "p": "The water resources research group investigates lakes, rivers and wetlands and their importance to human societies at catchment to ecosystem scales. We address questions of how water availability and water quality are affected by human activities and climate change. We apply geospatial tools, models and soft computing techniques to investigate, extract, monitor and model hydrological features and hydrodynamic phenomena. Our research aims to provide sustainable aquatic management solutions. We are active in the following areas We have expertise in geospatial techniques, including GIS & remote sensing, water quality monitoring, sediment core analyses using a range of biological and geochemical proxies, sediment transport modeling and river geomorphology surveys. We are equipped with a GIS laboratory with licensed ArcGIS 10x, ERDAS Imagine10x, Open source GIS (OSGeo) capabilities, Mini UAVs and GPS facilities. The group has strong collaborative linkages with the Geoscience Research Group (School of Geography,UK) and the Geospatial Information Science Research Centre (GISRC) Faculty of Engineering , UPM among others. Lakes in the Arctic carbon cycle funded by NERC Arctic Research Programme Silicon isotope records of recent environmental change and anthropogenic pollution from Lake Baikal, Siberia River diversion as a restoration technique for urban shallow lakes Regional and local drivers of limnological change in lakes of the Windermere catchment http://nottinghamlakebaikal.wordpress.com/ http://arcticlakes.wordpress.com/ http://blogs.nottingham.ac.uk/geography/2011/11/14/matt-jones-and-suzanne-mcgowan-talk-us-through-what-they-got-up-to-in-this-semester%E2%80%99s-fieldwork-week/ Lawal Billa Suzanne McGowan Nicholas Wallerstein Xu Chen Heather Moorhouse Mark Stevenson Sarah Roberts Windermere Catchment Restoration Programme Cemex (UK) Ltd Attenborough Nature Centre UCL Loughborough University Geospatial Information Science Research Center (UPM) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}