{
    "url": "https://www.nottingham.edu.my/EGS/Research/Research-Students.aspx",
    "content": [
        {
            "p": "Computational Modeling of Community Changes in disturbed Virtual Environments (Codename: SEED CAMAS) Biodiversity Governance: Enhancing Science Policy Interface in the Management of Protected Areas and Wildlife in Peninsular Malaysia Malaysia as a mega diverse country is blessed with an amazing array of biodiversity. Like many other nations, Malaysia is faced with the fragile balance of promoting socio-economic development while conserving biodiversity in line with her aspiration to be a fully developed nation by 2020. This project on the initial phase will utilise a stakeholder participatory approach in identifying priority themes and issues that need to be addressed in enhancing the management of Protected Area and Wildlife in Peninsular Malaysia. This will lead to key priority areas to be researched upon to enhance biodiversity governance in these sectors. This research is envisaged to assist Malaysia in taking appropriate and adequate policy measures based on science to ensure the conservation of biodiversity in which sustainable, inclusive and equitable development hinges. Supervisors: Ahimsa Campos Arceiz, Lisa Yon, Michael Stevens, Suzanne McGowan Non-invasive monitoring of stress in wild elephants (Elephas maximus) in Peninsular Malaysia Dung is a goldmine of information for biologists. It contains steroid hormones, parasite eggs, dietary information and also DNA of the animal and its parasites. My project is to examine the possibility using faecal endocrinology and parasitology methods to study and monitor translocated and non-translocated wild elephants in the tropical forest of Peninsular Malaysia. There many hurdles to overcome as there are a lot of confounding factors that we need to pay attention to before making conclusions about the data. As part of my PhD, I have carried out an ACTH (adrenocorticotropic hormone) challenge in captive Asian elephants to validate the enzymeimmunoassay’s ability in measuring faecal glucocorticoid (a hormone closely linked to stress response) metabolites (FGM). I have also conducted a semi-field experiment to look at the exposure of time and environment in affecting the stability of FGM levels in Asian elephants’ dung. For my third year, I am also attempting to link the FGM levels measured in translocated and non-translocated elephants to downstream effects of stress (eg. parasite egg loads, movement data). The management and ecology of Malaysian elephants (MEME) is a 5 year research project to move towards a culture of evidence-based conservation practice in Malaysia. The project is a collaboration with the Department of Wildlife and National Parks (DWNP), The University of Nottingham Malaysia Campus (UNMC) and various important donors. The MEME project has taken a holistic approach and will I contribute to such by monitoring elephants with satellite GPS collars in: i) human-dominated landscapes ii) in natural habitat and iii) translocated elephants (due to human conflict). From the data we aim to analyze how highway roads, forest connectivity, human-dominated and natural landscapes affect the movement choices of Asian elephants in peninsular Malaysia to which conservation decision making can be at an evidence based level. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}