{
    "url": "https://www.nottingham.edu.my/EGS/People/tapan.nath",
    "content": [
        {
            "p": "Professor, School of Environmental and Geographical Sciences, Tapan is an interdisciplinary researcher in the field of Community-based Forest Management (CBFM). His research and teaching span the social science disciplines of conservation social science, human geography, environmental geography, forestry, and environmental science. He graduated from the University of Tokyo with a PhD in forest science. Prior to joining the University of Nottingham Malaysia in 2014, he held academic positions at the University of Chittagong, the Asian Institute of Technology, the University of Tokyo, and Waseda University. Research profiles: Google Scholar; Researchgate ORCID ID: https://orcid.org/0000-0001-6436-1778 SCOPUS ID: 35272474800 Web of Science Researcher ID: ADV-7225-2022 As an interdisciplinary researcher, Tapan applies socio-ecological approaches, frameworks for sustainable livelihoods, and frameworks for natural resource governance for CBFM and the livelihoods of communities in the Global South that depend on forests. His current research examines community participation in peatland restoration and peatland fire management, the connections between urban green spaces and wellbeing outcomes, agroforestry and the UN Sustainable Development Goals (SDGs), and knowledge, attitude, and practise (KAP) studies on waste management and public health. Because of his international collaborations with academics from other nations, including natural scientists and scholars of spatial science, his study also encompasses cross-disciplinary collaboration. His scholarly works have significantly contributed to the global sustainable development because of his multidisciplinary and cross-disciplinary research, which is strongly related to natural resource sustainability, sustainable land use, climate change mitigation, and socio-economic development. I currently teach following four modules: Introduction of Sustainable Development (year 1), Tourism and the Environment (year 2), Forests, Environment and Society (year-2), and Environmental Policy… read more My main fields of research interests include interaction between society and nature toward sustainable management of natural resources and community development. In doing so, I look at context,… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}