{
    "url": "https://www.nottingham.edu.my/EGS/People/sivathass.bannir",
    "content": [
        {
            "p": "Assistant Professor, Dr Sivathass Bannir Selvam is an esteemed academic and researcher in Environmental and Geographical Sciences. He is an Assistant Professor in the School of Environmental and Geographical Sciences. Dr Siva's journey at the University of Nottingham Malaysia began in 2018 when he commenced his present appointment. Prior to his current role, Dr Siva held several notable appointments, demonstrating his commitment to academic excellence. He served as a Part-time Lecturer in the School of Environmental and Geographical Sciences at the University of Nottingham Malaysia. He obtained his Doctor of Philosophy degree in Wastewater Treatment Technology from UTM (Universiti Teknologi Malaysia) in 2017. His research in this area has contributed valuable insights to the field and has the potential to address pressing environmental challenges. With his extensive knowledge and expertise, Dr Sivathass Bannir Selvam continues to make significant contributions to the field of Environmental and Geographical Sciences. Through his combined focus on research and teaching, he aims to inspire and educate the next generation of scholars and practitioners in these vital areas. Dr Siva's dedication to education is further evident in his previous role as a Foundation in Science Chemistry Lecturer at President College. During this time, he played a pivotal role in shaping the minds of aspiring students, fostering their interest in scientific fields. Dr Sivathass Bannir Selvam has played a crucial role as the module co-convenor for various courses in Environmental and Geographical Sciences. Since 2018, he has been actively involved in organizing… read more Dr Sivathass Bannir Selvam is a researcher specializing in the field of environmental pollution and remediation, with a primary focus on microplastics and micropollutants in river ecosystems. With… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}