{
    "url": "https://www.nottingham.ac.uk/engineering/departments/m3/it-equipment.aspx",
    "content": [
        {
            "p": "You will need access to a laptop or device to participate in lessons and complete online learning. Whether you already have a device, or are considering purchasing new IT equipment for your university studies, please check the minimum specification recommended by Digital and Technology Services. We would suggest you use an MS Windows 10 or Windows 11 system for ease of access to our commonly used systems, and to use some of the specialist engineering software for your studies. We would also suggest your device should have a microphone and webcam to interact with staff and students during online support sessions and tutorials. You do not need to purchase any software; Microsoft Office is available to download free of charge to all students for the duration of their studies and specialist engineering software is available in our on-campus computer rooms and through a remote desktop connection. There are computer rooms available on campus and a laptop loan service but both are offered on a first come first served basis and may be at reduced capacity due to Covid restrictions. All students (home, EU, and International) who might struggle with financing IT equipment can apply for support via the Hardship Fund. The University of Nottingham has moved to a \"BOYD\" (\"Bring your own device\") policy for computers and computing. This means you will need a laptop of your own that you will bring into university when needed. We will provide the software and any special equipment needed but you need to own your own device. In product design and manufacture we have embraced this wholeheartedly and have developed highly digital workflow. This document is here to guide you through what requirements your laptop needs to meet. We can only recommend things to you; we cannot tell you what to buy. That's up to you. This might seem an additional expense to you however over the course of your three or four years it will actually save you money. You won't need to buy any paper' marker pens or get anything printed. The cost of your laptop is pretty much all you need to spend on your course. (Unless you want to buy any textbooks!) It's a common misconception that all designers use Apple Macs - this has never been the case. It's true in graphic design that most designers use Apple products but for 3D designers this has never been the case. Not all the applications you will need on the Product Design and Manufacture course run on Apple OS. For this reason, we recommend you buy a Windows-based PC. If you already have a Mac or you \"just have to get one\", it's okay. There are two options for you: You might already have a laptop that doesn't quite meet the above specifications, or you might not want to spend the cost on a PC that meets all of these. So, what should you compromise on? In product design we use large files on graphics on images I have work flows to often means several applications are best open at once. The kind of work we do is often demanding on PCs. Ram is probably the most important specification you meet. Ram allows you to work with large files and have them open at the same time. 8 gigabytes is really the minimum you should go for. 16 gigabytes is great, 32 gigabytes he's marvellous! Processor has a big impact on the speed of things, and i5 will usually suffice. Though if you need something more powerful, we tend to provide virtual computers for you that are well beyond the specification you could afford. So, although nice, a faster processor like an i7 or i9 is not as important. Storage on a hard drive allows you to have more software installed and still be able to save your files directly on the PC. You can go a lot bigger than 256 gigabytes, but I wouldn't recommend going any smaller, as you might not get all the software you want on the machine. SSD solid state drives are quicker, smaller and more reliable than their predecessors. Although SSD is not critical it will keep your laptop current for longer. Screen size. You will be spending a lot of your time on your laptop and screen size makes everything much easier and quicker. You may at a later date decide you want a second monitor to give you more screen real-estate as this really improves productivity. It's easy to think but the biggest screen is the best option but remember \"portability\". A large screen means a large laptop and you will have to carry this into university each day. Battery life gives you added convenience. Although there will be lots of places in university to plug your laptop in sometimes it's easy to forget to do this. Battery life as it is shown in specifications may not actually be what's achieved when you use your laptop. The applications you will be using, use the processor heavily. which will drain the battery quickly. An alternative to a large battery could be to have a spare battery. Ports. Increasingly USB C is being used as the new standard. This type of port though has many different types. Some act just like a standard USB others will provide power even if the laptop is off, others still, will provide power, data and can act as a display port. If possible, get a laptop that can do the latter. Sometimes this is called a USB C alt port or a USB C dp port. Thunderbolt ports although having a slightly different specification will work as a USB C alt port. Its best to have this if possible. If you can't get this type of port, then make sure your laptop has a HDMI and USB 3 Ports. There are pen displays and large format monitors in the design studios that you will be able to connect to, to give you more screen space. You will need a HDMI/Thunderbolt port to do this. There will always be a need for peripherals and additional memory storage devices and for this you will need USB ports. Webcams come built into most laptops now. But if the model you are thinking of getting doesn't include one, this is something you will need to purchase. It is quite likely that in some points in your course, you will still need to have video-based meetings. A webcam is essential for modern IT communication purposes. Mouse. CAD packages need 3 Button Mouse to be used. A laptop's track pad will not do the job. You don't need an expensive wireless mouse. A 3 Buttoned (two buttons and a scroll wheel) mouse is inexpensive and not as easy to lose! Pen enabled touch screens (pen displays). We have these for you at university to use, but most of you will want the convenience of doing work at home. For this reason you will probably need some way to be able to draw digital on your own devices. There is a video where I talk about and show the kind of products you could pick. I recommend watching this as well as reading this document. From first year onwards you'll be learning to draw digitally. You will be using software called Sketchbook pro. It is available on Windows and Apple app stores for a cost of around £16.74. This is the only software you will need to buy yourself. Buy it and download it once you have your laptop. Have a play with it before starting your degree. Digital drawing is quicker to learn and provides better results for less practise. With the increase in availability of touch screens this is where drawing for product design is heading. There are many options or with different advantages and disadvantages. Touch screens on out common however you need to get a touch screen which enables you to use a stylus or pen. Not all touch screen devices allow this, it's best to check this out before you purchase. One option is to buy laptop with a touch screen, this is probably the cheapest option and the easiest to carry round with you. The downside of this is if you are using one device for greater length of time then batteries will drain more quickly, and you can't do two things at once! You may already have a tablet which can be used with a stylus for instance an iPad or an Android tablet like a Samsung Galaxy. These devices are suitable for use as long as the screen is big enough. I wouldn't recommend anything under 10 inches to draw on. Having a separate device to draw on other than your laptop gives some advantages in that you can do two things at once and you're not draining the battery from the one device just to draw. However, it does mean you have more to carry around or the typical day. Also, if you're buying a new tablet, it puts the overall cost up. Using a tablet to draw on has advantages, as tablets are light and easy to work with. The last option is to by your own Pen Display. These range upward in price of £200. At our studios you will have access 24/7 to large 22-inch pen displays. You may want something similar for yourself. Again, watch the video on drawing devices. It will help you select what you need. The University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 95 14081"
        }
    ],
    "pdf_files": []
}