{
    "url": "https://www.nottingham.ac.uk/engineering/departments/civeng/people/luis.neves",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR Assessment of the Accuracy of Terrestrial Laser Scanners in Detecting Local Surface Anomaly (2024) Journal Article Algadhi, A., Psimoulis, P., Grizi, A., & Neves, L. (2024). Assessment of the Accuracy of Terrestrial Laser Scanners in Detecting Local Surface Anomaly. Remote Sensing, 16(24), Article 4647. https://doi.org/10.3390/rs16244647 The surface anomaly is a common defect for structures that resist lateral stresses, such as retaining walls. The accurate detection of an anomaly using contactless techniques, such as the Terrestrial Laser Scanner (TLS), is significant for the reliab... Read More about Assessment of the Accuracy of Terrestrial Laser Scanners in Detecting Local Surface Anomaly. Tunnelling-induced wall damage: an appraisal of elastoplastic constitutive models for the masonry (2024) Journal Article Yu, Y., Franza, A., Ghiassi, B., Canhoto Neves, L., & Marshall, A. M. (2025). Tunnelling-induced wall damage: an appraisal of elastoplastic constitutive models for the masonry. Tunnelling and Underground Space Technology, 156, Article 106240. https://doi.org/10.1016/j.tust.2024.106240 This paper investigates the role of masonry elastoplastic constitutive models on tunnelling induced damage in buildings. A two-stage analysis method (TSAM) is adopted, incorporating input greenfield displacements, 3D masonry walls, and an elastic mod... Read More about Tunnelling-induced wall damage: an appraisal of elastoplastic constitutive models for the masonry. Tunnelling-induced wall damage: An appraisal of elastoplastic constitutive models for masonry (2024) Journal Article Yu, Y., Franza, A., Ghiassi, B., Neves, L. C., & Marshall, A. M. (2025). Tunnelling-induced wall damage: An appraisal of elastoplastic constitutive models for masonry. Tunnelling and Underground Space Technology, 156, Article 106240. https://doi.org/10.1016/j.tust.2024.106240 This paper investigates the role of masonry elastoplastic constitutive models on tunnelling-induced damage in buildings. A two-stage analysis method (TSAM) is adopted, incorporating input greenfield displacements, 3D masonry walls, and an elastic mod... Read More about Tunnelling-induced wall damage: An appraisal of elastoplastic constitutive models for masonry. Behaviour of Textile Reinforced Concrete panels under high-velocity impact loading (2024) Journal Article Esaker, M., Thermou, G. E., & Neves, L. (2024). Behaviour of Textile Reinforced Concrete panels under high-velocity impact loading. Construction and Building Materials, 445, 137806. https://doi.org/10.1016/j.conbuildmat.2024.137806 This study aims to experimentally investigate the impact resistance of Textile Reinforced Concrete (TRC) panels under high-velocity impact loading. 54 control and TRC panels were fabricated using a standard (29 MPa) and a high (101 MPa) compressive s... Read More about Behaviour of Textile Reinforced Concrete panels under high-velocity impact loading. Analytical and Numerical Models for Wind and Seismic Design and Assessment of Mass Timber Diaphragms (2023) Journal Article Rodrigues, L. G., Barbosa, A. R., Sinha, A., Higgins, C., Breneman, S., Zimmerman, R. B., Pei, S., Van De Lindt, J. W., Berman, J. W., Branco, J. M., & Neves, L. C. (2023). Analytical and Numerical Models for Wind and Seismic Design and Assessment of Mass Timber Diaphragms. Journal of Structural Engineering, 150(2), https://doi.org/10.1061/JSENDH.STENG-12265 While the use of cross-laminated timber (CLT) panels for building construction has increased over the last several decades, current standards and existing literature provide limited information regarding the design of CLT diaphragms or the prediction... Read More about Analytical and Numerical Models for Wind and Seismic Design and Assessment of Mass Timber Diaphragms. Impact resistance of concrete and fibre-reinforced concrete: a review (2023) Journal Article Esaker, M., Thermou, G., & Neves, L. (2023). Impact resistance of concrete and fibre-reinforced concrete: a review. International Journal of Impact Engineering, 180, Article 104722. https://doi.org/10.1016/j.ijimpeng.2023.104722 This paper summarises the research carried out to date on the impact resistance of concrete subjected to different impact load regimes, with a focus on high-velocity projectile impact load. An experimental database is compiled on the response of conc... Read More about Impact resistance of concrete and fibre-reinforced concrete: a review. Analysing the impact of local factors on the life cycle of metallic bridge girders (2023) Presentation / Conference Contribution Calvert, G., Hamer, M., Neves, L., & Andrews, J. (2023, July). Analysing the impact of local factors on the life cycle of metallic bridge girders. Presented at Eighth International Symposium on Life-Cycle Civil Engineering (IALCCE 2023), Milan, Italy A fundamental component of a life cycle analysis of a bridge is the modelling of asset condition post-construction. To enhance the accuracy of bridge deterioration models, several studies have calibrated models based on cohorts that incorporate struc... Read More about Analysing the impact of local factors on the life cycle of metallic bridge girders. Uncertainty analysis of life cycle assessment of asphalt surfacings (2023) Journal Article Abed, A., Godoi Bizarro, D. E., Neves, L., Parry, T., Keijzer, E., Kalman, B., Jimenez Del Barco Carrion, A., Mantalovas, K., Buttitta, G., Lo Presti, D., & Airey, G. (2023). Uncertainty analysis of life cycle assessment of asphalt surfacings. Road Materials and Pavement Design, 25(2), 219-238. https://doi.org/10.1080/14680629.2023.2199882 The Life Cycle Assessment (LCA) of asphalt pavements are associated with significant uncertainty resulting from variability in the quantity and impact of individual components, the quality of data for each component, and variability of asphalt durabi... Read More about Uncertainty analysis of life cycle assessment of asphalt surfacings. An Overview Of Strategic Bridge Life Cycle Modelling On The British Railway (2022) Presentation / Conference Contribution Hamer, M. J., Calvert, G. S., & Neves, L. A. C. (2022, July). An Overview Of Strategic Bridge Life Cycle Modelling On The British Railway. Presented at 11th International Conference on Bridge Maintenance, Safety and Management (IABMAS 2022), Barcelona, Spain Bridges are critical assets for the safe, reliable, and functional operation of transportation networks. Infrastructure asset managers are responsible for ensuring that these bridges adhere to rigorous safety standards using the finite resources avai... Read More about An Overview Of Strategic Bridge Life Cycle Modelling On The British Railway. Deduction of ultimate equilibrium limit states for concrete gravity dams keyed into rock mass foundations based on large displacement analysis (2022) Journal Article Pereira, R., Batista, A. L., Neves, L. C., & Lemos, J. V. (2022). Deduction of ultimate equilibrium limit states for concrete gravity dams keyed into rock mass foundations based on large displacement analysis. Structures, 38, 1180-1190. https://doi.org/10.1016/j.istruc.2022.02.049 Concrete gravity dams are mass concrete structures, often built on rock mass foundations, conceived to rely upon their weight for stability. To prevent sliding, these structures are usually keyed/embedded into the foundation, a good construction prac... Read More about Deduction of ultimate equilibrium limit states for concrete gravity dams keyed into rock mass foundations based on large displacement analysis. Incorporating defect specific condition indicators in a bridge life cycle analysis (2021) Journal Article Calvert, G., Neves, L., Andrews, J., & Hamer, M. (2021). Incorporating defect specific condition indicators in a bridge life cycle analysis. Engineering Structures, 246, Article 113003. https://doi.org/10.1016/j.engstruct.2021.113003 Bridges are critical assets for the safe, reliable and functional operation of transportation networks. Infrastructure asset managers are responsible for ensuring that these bridges adhere to rigorous safety standards using the finite resources avail... Read More about Incorporating defect specific condition indicators in a bridge life cycle analysis. Macro modelling of traffic flow using continuous timed Petri nets (2021) Journal Article Ferreira, C., & Neves, L. C. (2021). Macro modelling of traffic flow using continuous timed Petri nets. Transportation Planning and Technology, 44(5), 503-523. https://doi.org/10.1080/03081060.2021.1927304 In this paper, continuous timed Petri nets (CTPN) are used to develop a hybrid traffic model, where the network is modelled as a macroscopic model and calibrated by microscopic models. The concept of CTPN is used to build a modular model, where first... Read More about Macro modelling of traffic flow using continuous timed Petri nets. Assessing the effects of link-repair sequences on road network resilience (2021) Journal Article Sohouenou, P. Y., & Neves, L. A. (2021). Assessing the effects of link-repair sequences on road network resilience. International Journal of Critical Infrastructure Protection, 34, Article 100448. https://doi.org/10.1016/j.ijcip.2021.100448 Disruptions to transport networks are inevitable and detrimental to the functioning of society. Improving the resilience of transport networks to disruptive events has, therefore, a significant impact on society. Although the resilience of a transpor... Read More about Assessing the effects of link-repair sequences on road network resilience. Modelling the interactions between defect mechanisms on metal bridges (2021) Presentation / Conference Contribution Calvert, G., Neves, L., Andrews, J., & Hamer, M. (2021, April). Modelling the interactions between defect mechanisms on metal bridges. Presented at 10th International Conference on Bridge Maintenance, Safety and Management (IABMAS 2020), Sapporo, Japan Bridge asset managers have finite resources at their disposal to minimise the risk of structural failure and ensure bridges are maintained to a suitable safety threshold. Any maintenance strategy must be efficient in its use of resources and deliver... Read More about Modelling the interactions between defect mechanisms on metal bridges. Mechanical Characterization of Iroko Wood Using Small Specimens (2021) Journal Article Cunha, C., Tenório, M., Lima, D. F., Rebouças, A., Neves, L. C., & Branco, J. M. (2021). Mechanical Characterization of Iroko Wood Using Small Specimens. Buildings, 11(3), Article 116. https://doi.org/10.3390/buildings11030116 Using a hazard-independent approach to understand road-network robustness to multiple disruption scenarios (2021) Journal Article Sohouenou, P. Y., Neves, L. A., Christodoulou, A., Christidis, P., & Lo Presti, D. (2021). Using a hazard-independent approach to understand road-network robustness to multiple disruption scenarios. Transportation Research Part D: Transport and Environment, 93, Article 102672. https://doi.org/10.1016/j.trd.2020.102672 Typhoon track simulations in the North West Pacific: Informing a new wind map for Vietnam (2020) Journal Article Owen, J. S., Neves, L. C., Hargreaves, D. M., Franke, J., & Nguyen, C. H. (2021). Typhoon track simulations in the North West Pacific: Informing a new wind map for Vietnam. Journal of Wind Engineering and Industrial Aerodynamics, 208, Article 104441. https://doi.org/10.1016/j.jweia.2020.104441 This paper addresses the need to revise the current Vietnamese design wind map by proposing a new typhoon wind map for the country, based on Monte Carlo simulations of typhoon tracks in the North West Pacific basin. Using historical typhoon data from... Read More about Typhoon track simulations in the North West Pacific: Informing a new wind map for Vietnam. Modelling interactions between multiple bridge deterioration mechanisms (2020) Journal Article Calvert, G., Neves, L., Andrews, J., & Hamer, M. (2020). Modelling interactions between multiple bridge deterioration mechanisms. Engineering Structures, 221, Article 111059. https://doi.org/10.1016/j.engstruct.2020.111059 Bridge asset managers are tasked with developing effective maintenance strategies by the stakeholders of transportation networks. Any presentation of maintenance strategies requires an estimate of the consequence on the Whole Life Cycle Cost (WLCC),... Read More about Modelling interactions between multiple bridge deterioration mechanisms. Using a random road graph model to understand road networks robustness to link failures (2020) Journal Article Sohouenou, P. Y., Christidis, P., Christodoulou, A., Neves, L. A., & Presti, D. L. (2020). Using a random road graph model to understand road networks robustness to link failures. International Journal of Critical Infrastructure Protection, 29, Article 100353. https://doi.org/10.1016/j.ijcip.2020.100353 Disruptions to the transport system have a greater impact on society and the economy now than ever before due to the increased interconnectivity and interdependency of the economic sectors. The ability of transport systems to maintain functionality d... Read More about Using a random road graph model to understand road networks robustness to link failures. Multi-defect modelling of bridge deterioration using truncated inspection records (2020) Journal Article Calvert, G., Neves, L., Andrews, J., & Hamer, M. (2020). Multi-defect modelling of bridge deterioration using truncated inspection records. Reliability Engineering and System Safety, 200, Article 106962. https://doi.org/10.1016/j.ress.2020.106962 Bridge Management Systems (BMS) are decision support tools that have gained widespread use across the transportation infrastructure management industry. The Whole Life Cycle Cost (WLCC) modelling in a BMS is typically composed of two main components:... Read More about Multi-defect modelling of bridge deterioration using truncated inspection records. Showing 1 - 20 of 66 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}