{
    "url": "https://www.nottingham.ac.uk/engineering/research/impact/research-impact-success-stories/monica.aspx",
    "content": [
        {
            "p": "A device monitoring the heart rate (HR) of a mother and her foetus has improved the safety and birthing experience for women worldwide. Accurate foetal HR monitoring during labour is crucial for signalling when critical, clinical interventions are needed enabling lifesaving treatment. The traditional monitoring technique – ultrasound and strain-gauge – is uncomfortable, constrains mothers to a bed and experiences maternal and foetal heart-rate confusion with reduced performance in high Body Mass Index (BMI) patients. The university’s Department of Electrical and Electronic Engineering and its Child Health, Obstetrics and Gynaecology Division jointly researched a solution – Monica. Commercialised by University of Nottingham spin-out Monica Healthcare Ltd, the company created the world’s first wearable and wireless foetal monitor. Its high sensitivity, unaffected by high BMI, increases HR monitoring accuracy, thereby reducing unnecessary interventions. Allowing freedom of movement helps make labour shorter with a much-improved childbirth experience for women. Monica reduced HR confusion to just 0.4% from competitors’ 10% – a tremendous leap forward in safety. Achieving both European Conformitè Europëenne (CE) and USA Food and Drug Administration (FDA) approvals, Monica was licensed to Philips Plc in 2015 and sold to GE Healthcare in 2017. Researcher and spin-out founder, Professor Barrie Hayes-Gill said: “To see our research in maternity wards around the world is a fantastic achievement and culmination of a wonderful journey”. Benefiting mothers at over 1,000 hospitals, it was recognised in 2019 with the Royal Academy of Engineering Colin Campbell Mitchell Award for the ‘Greatest contribution to advancement of any field of engineering within four years prior to the award.’ Explore our Optics and Photonics research group Discover our Centre for Healthcare Technologies Search for an engineering or architecture expert Access resources to collaborate, innovate and grow your business"
        }
    ],
    "pdf_files": []
}