{
    "url": "https://www.nottingham.ac.uk/engineering/research/virginia-tech.aspx",
    "content": [
        {
            "p": "A partnership with the Faculty of Engineering We’re a global university with a collaborative mindset. That’s why, in 2009, we established our partnership with Virginia Tech College of Engineering, USA. Our partnership is built on friendship, connectivity and world-class research. As two universities at the forefront of innovation with complementary research areas, we turn research into reality together. The partnership includes: Every year we host students from the Virginia Tech College of Engineering as part of the International Research Experience for Students (IRES) programme. Students are aligned to one of our research groups to investigate critical areas of research. Co-advised by two faculty mentors – one at the University of Nottingham and one at Virginia Tech – students have access to our experts and sector-leading research facilities. So far, we’ve jointly supervised 15 postgraduate students with Virginia Tech. Find out what our Virginia Tech students thought about their experience: I think collaboration across disciplines and borders can solve some of the world’s most daunting challenges. IRES offers students the chance to collaborate with Professors, allowing for an exchange of ideas and passions. I have always wanted to study in the UK and the University of Nottingham, being a premier research university in power electronics, seemed like the perfect place to be. Maximo DiPret – B.S in Materials Science and Engineering I’m looking forward to exploring the campus and labs at the University of Nottingham, exchanging ideas with researchers, and trying new foods and teas! After the IRES program I hope to continue working with the Human Factors research group to gain experience analysing qualitative and quantitative data and sharing relevant finds with the research community. Mary Pletcher – Master’s in Industrial and Systems Engineering The IRES program is a fantastic opportunity to broaden my research horizons, experience a different academic culture, and expand my network. This exposure can enrich my research and open new avenues for collaboration and innovation. I’m hoping by the end of the six-weeks, I will have collected enough data to publish a research article. Martin Etemadi – PhD in Chemical Engineering \"Partnering with the University of Nottingham has been – and continues to be – very fruitful. We share a global mindset, research excellence and drive to ensure that the next generation of exceptional engineers and researchers can succeed.\" — Dr Nicole Sanderlin, Director of Global Engagement in the College of Engineering, Virginia Tech We turn research into reality. Build on your degree with a masters course. We offer funded and self-funded PhD’s."
        }
    ],
    "pdf_files": []
}