{
    "url": "https://www.nottingham.ac.uk/engineering/departments/abe/success-stories/student-success-stories.aspx",
    "content": [
        {
            "p": "Here at the Department of Architecture and Built Environment, we are proud of the success of our students and alumni and their commitment, hard work and dedication in the field. Here are just a few examples of some success stories and award winning design projects. Study with us Our end of year exhibition Ollie won the RIBA Bronze Award Commendation for his project \"Making Do\" looking at sustainable redevelopment via repair and adaptation of derelict railway warehouses in Nottingham's city centre. The awards were established by the RIBA in 1836 and are considered to be the most prestigious awards in architectural education. Over 400 schools from across the world are invited to nominate entries for the awards. This is the fifth year in a row where University of Nottingham students have been successful in the Bronze Medal Awards having won the award, three Commendations and the Serjeant Prize during this period. Edwin won the Serjeant Drawing Award for Excellence in Drawing for RIBA Part 1. He triumphed over a record 134 other entrants from schools worldwide for his work The Fifth Orchestration, which explored the future of architecture and how we perceive and engage with the fluidity of specific moments in space and time. I went on to work at a local firm in the UK after graduating from the University of Nottingham. Edwin currently works at Mark Foster Gage Architects, New York, as a Part 1 Architectural Assistant. UoN Graduate Jess Tyson won SPAB’s Philip Webb Award 2020 with a beautifully executed and highly appropriate proposal for the reuse of an underused block of buildings in Nottingham City Centre. Spurred on by our current climate emergency, Jess’s project asked why so many buildings sit vacant or are scheduled for demolition when redevelopment through imaginative new design could give them a new lease of life. Jess chose three sites in Nottingham City centre all with distinct characters and in various conditions and reimagined them as a community arts centre and performance venue. Conor was awarded a commendation for his approach to building disassembly in a Leicester-based project, The House of the City. This Design Thesis postulates the significance of Modernist space conception and its continued applicability. The value of Modernism lies in its spatial articulation, belied by its vilified aesthetic. Since graduating from the University of Nottingham in 2019, Matt has worked as a graduate mechanical engineer on a variety of mixed-use projects within the AECOM St Albans team. He coordinates events for the CIBSE HVAC Systems Group, co-leads the AECOM Young Engineers Forum and actively participates in STEM events. Carolina won the Passivhaus competition in 2020 for her Trent Basin Primary School design. This was a real-life design project for a new sustainable community in a regeneration area and its surrounding neighbourhoods. The school concept, developed to fit within the Trent Basin sustainable housing development, is to provide a high-quality learning environment for children, as well as a low energy sustainable building that meets Passivhaus standards and its part of the Trent Basin community energy scheme. The University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 95 14184"
        }
    ],
    "pdf_files": []
}