{
    "url": "https://www.nottingham.ac.uk/engineering/research/areas/advanced-healthcare/index.aspx",
    "content": [
        {
            "p": "Follow us on LinkedIn This is the place pioneering the well-being of humankind. Our experts are developing novel medical technologies and revolutionising the detection and treatment of health issues. We’re turning research into reality to help solve real world challenges including: Our transformative research is addressing the United Nations Sustainable Development Goals and shaping the real world. Our research also informs our courses, from undergraduate and masters degrees, to PhDs. Pioneering 3D printed medicines A new technique - Multi-Material InkJet 3D Printing - for 3D printing medication has enabled the printing of multiple drugs in a single tablet, paving the way for personalised pills that can deliver timed doses. \"Our research into quantum sensors has the potential to revolutionise the way we detect and treat diseases.\" — Professor Melissa Mather Our research shapes society and boosts business. Discover more of our research impact stories. Helping clinicians make quicker, accurate assessments of burn wounds improving outcomes for paediatric patients. World’s first wearable and wireless foetal monitor improves accuracy in heart rate monitoring during labour reducing unnecessary interventions. Wirelessly measuring a baby’s heart rate during resuscitation, using a sensor in a hat, allowing doctors to be hands-free for interventions. Optimising a copolymer structure for a bacteria resistant urinary catheter coating to create a commercially viable product. Pioneering calcium phosphate microspheres, with incorporated stem cells, to help reduce osteoporotic fractures and repair bone. Suvvi is developing a technique to create a colour-neutral pulse oximeter device that will provide equity in care and treatment for all adult and newborns of diverse skin pigmentation types. Charles is using inkjet printing to develop sensors that can be printed directly into wound dressings to detect key biomarkers, signalling infection or non-closure of acute wounds. Search for an engineering or architecture expert Access resources to collaborate, innovate and grow your business"
        }
    ],
    "pdf_files": []
}