{
    "url": "https://www.nottingham.ac.uk/engineering/departments/foundationyear/facilities.aspx",
    "content": [
        {
            "p": "Follow us on LinkedIn Master the fundamentals with our Foundation course facilities Study in our state-of-the-art Advanced Manufacturing Building (AMB) - and learn as ground-breaking research takes place around you. Learning the fundamentals of the STEM (science, technology, engineering, and mathematics) subjects is made easier with our Foundation Engineering and Physical Sciences (FEPS) facilities. With the opportunity to try out the facilities for all our engineering departments, you’ll be able to confidently step up into your undergraduate degree. Please note the exact facilities and equipment you will use depends on the modules you choose. “Studying FEPS familiarised me with the university environment and teaching style. Make the most out of your foundation year, because you are getting a head start!” Hana Makhlouf – Foundation Engineering and Physical Sciences graduate (Technology Analyst, Bank of America) You'll be based at the pioneering £24m Advanced Manufacturing Building on our Jubilee Campus. Home to many cutting-edge research teams in advanced manufacturing, robotics and 3D printing, we also share our space with important industrial partners - such as Rolls Royce, who design and test new technologies in the engineering bay - which is visible from our teaching spaces. It's one of the most prestigious and innovative examples of the university’s architectural projects over the last few years. You'll spend most of your time in our amazing purpose-built lecture rooms, as well as in our state-of-the-art teaching and learning space - which is ideal for group work, projects, laboratories and academic seminars. Benefit from the opportunity to work closely with academic staff, who are readily available to meet on a one-to-one basis throughout the week. You'll also have access to all the facilities and student experiences across engineering and science. Work with academics from the departments you could choose to do your degree in after your Foundation course (Engineering, Physics, Maths and Computer Science). You'll have opportunities to visit facilities in these areas and work there as part of their individual projects. Don't forget you'll also have access to: Visit our campuses in person Explore our virtual campus tour Find our Foundation Engineering and Physical Sciences course"
        }
    ],
    "pdf_files": []
}