{
    "url": "https://www.nottingham.ac.uk/engineering/equality-diversity-and-inclusion/",
    "content": [
        {
            "p": "The Faculty of Engineering's Equality, Diversity and Inclusion (EDI) team has been created to support staff and students and make sure they feel valued. The team's mission is to encourage everyone to recognise their full potential in order to lead themselves to success. They are working closely with people across the University to achieve this and will be running events throughout the year. If you have any thoughts about how to make the Faculty a better place to work, please get in touch with Faculty EDI Coordinator, Emma Hadfield-Hudson. Sam Kingman (he/him) EDI Chair Charlotte Lush (she/her) Faculty Director of People and Equality, Diversity and Inclusion Sarah Wilson (she/her) EDI Coordinator Chris Sprange (he/him) Deputy Director of EDI Katy J. McKenzie (she/her) Deputy Director of EDI Angela Nothofer (she/her) Deputy Director of EDI The Faculty of Engineering EDI Board work to: The EDI's vision statement lies at the heart of the work we do: Health and wellbeing is important to ensure staff and students have a positive experience in the work place and reach their full potential. As well as accessing University sports facilities, including the £40 million David Ross Sports Centre, faculty staff can access wellbeing rescources and take part in activities via the Faculty of Engineering Wellbeing Team. During 2019/20 academic year, the Faculty focused on promoting trans inclusion, culminating in an event to celebrate The International Trans Day of Visibility. To access training rescources from the event, visit Curious About Identity? on Teams. Follow up activities will be planned for our return to campus. The University's training provision includes: Central Short Courses for EDI Leadership and Management EDI Learning & Resources We are delighted to hold an Athena Gold Award for our work in gender equality. You can read more and download our submission by visiting our Athena Gold Webpage If you have any issues that you wish to raise or if you would like to get more involved with EDI work within our Faculty, please contact a member of the EDI Board or email our Faculty EDI Coordinator, Emma Hadfield-Hudson. The University of Nottingham has a network of Dignity Advisers who are available to provide impartial and confidential advice to support staff and students who have issues or concerns regarding harassment, bullying or victimisation. The University of Nottingham University Park Nottingham, NG7 2RD Contacts: Please see our 'Contact us' page"
        }
    ],
    "pdf_files": []
}