{
    "url": "https://www.nottingham.ac.uk/engineering/departments/eee/it-equipment.aspx",
    "content": [
        {
            "p": "You will need access to a laptop or device to participate in lessons and complete online learning. Whether you already have a device, or are considering purchasing new IT equipment for your university studies, please check the minimum specification recommended by Digital and Technology Services. We would suggest you use an MS Windows 10 system for ease of access to our commonly used systems, and to use some of the specialist engineering software for your studies. We would also suggest your device should have a microphone and webcam to interact with staff and students during online support sessions and tutorials. You do not need to purchase any software; Microsoft Office is available to download free of charge to all students for the duration of their studies and specialist engineering software is available in our on-campus computer rooms and through a remote desktop connection. There are computer rooms available on campus and a laptop loan service but both are offered on a first come first served basis and may be at reduced capacity due to Covid restrictions. All students (home, EU, and International) who might struggle with financing IT equipment can apply for support via the Hardship Fund. This page will help guide you through the requirements that your laptop needs to meet. We can only recommend things to you; we cannot tell you what to buy. That's up to you so please read the following carefully. From first year onwards you'll learn how to code in C and C++. You will learn how to develop applications for traditional computers, single board computers and microcontrollers. Some hardware platforms require connecting to a host computer or laptop so that you can develop and upload your application on to the specific platform. We therefore rely on the host computer being compatible with this process and the most predictable and reliable platform for this is currently a Windows 10 based computer or laptop. Throughout the course we will support our teaching using several industry standard software packages which will all be compatible with Windows based computers, but not all will be compatible with MacOS or Linux based platforms. Whilst you will have access to suitable computing facilities to support your learning having your own device will allow you to better manage your time and your studies. We will provide the software and any special equipment, but you own your device should be capable of running the software used and has a pen-enabled touch screen. Purchasing a device with a pen-enabled touch screen might seem like an additional expense. However, over the course of your three or four years of study, it will actually save you money. You won't need to buy any paper or marker pens. Nor will you need to get anything printed. The cost of your laptop is pretty much all you need to spend on your course. Whilst a Mac is a great platform, it is not quite suited to everything we do, especially interfacing to external hardware and will more than likely result in a fair amount of frustration attempting to get things working. Also, not all the applications you will need on the Electrical and Electronic course run on Apple OS. For this reason, we recommend you buy a windows-based PC. If you already have a Mac or you “just have to get one”, it's okay. There are two options for you: 1. Install software like boot camp that allows you to install windows on your Mac (this can often invalidate your warranty). Though this may not be possible on the latest Mac computers and other virtualisation options may not support the hardware you will need to connect to. 2. Use virtual computers, which we will provide for you. As good as the virtual computers are it will mean you will always need Wi-Fi whenever you want to work, and it will make your workflow a little less smooth. However, this will not support the requirements for connecting external hardware. Operating System - Windows 10 or 11 Processor - Intel Core i5, AMD Ryzen 5 or similar RAM - 8GB - 16GB better Storage - 256GB SSD Screen size - 13inch or larger full HD screen Battery – Minimum 6-hour battery life USB - Two or more USB ports or single USB and powered USB hub HDMI – Direct (port) or by a separate adaptor Webcam Pen enabled touch screen if you want to mark-up/annotate or create your own handwritten notes You may have a laptop that meets all the specs above but does not have a pen enabled screen. In this case, there are other options open to you so please read the last section of this page. Alternatively, you might already have a laptop that doesn't quite meet the above specifications, or you might not want to spend the cost on a PC that meets all of these. In EEE a lot of the applications are fairly lightweight in their computational demands and so performance isn’t a big issue, but the ability to interface to external hardware is important. So, what are the key things you need to consider when buying your computer? Ram is probably the most important specification you meet. Ram allows you to work with large files and and/or have multiple applications open at the same time. 8 gigabytes is really the minimum you should go for. 16 gigabytes is great, 32 gigabytes is probably overkill! Processor has a big impact on the speed of things, and i5 will usually suffice. Though if you need something more powerful, we tend to provide virtual computers for you that are well beyond the specification you could afford. So, although nice, a faster processor like an i7 or i9 is not as important. Storage on a hard drive allows you to have more software installed and still be able to save your files directly on the PC. You can go a lot bigger than 256 gigabytes, but I wouldn't recommend going any smaller, as you might not get all the software you want on the machine. SSD solid state drives are quicker, smaller, and more reliable than their predecessors. Although SSD is not critical it will keep your laptop current for longer. You will have access to a significant amount of cloud-based storage as well which should always be used to back up everything you do. Screen size. You will be spending a lot of your time on your laptop and screen size makes everything much easier and quicker. You may at a later date decide you want a second monitor to give you more screen real-estate as this really improves productivity. It's easy to think but the biggest screen is the best option but remember “portability”. A large screen means a large laptop and you will have to carry this into university each day. Battery life gives you added convenience. Although there will be lots of places in university to plug your laptop in sometimes it's easy to forget to do this. Battery life as it is shown in specifications may not actually be what's achieved when you use your laptop. The applications you will be using use the processor heavily, which will drain the battery quickly. An alternative to a large battery could be to have a spare battery. Ports. You will definitely need an HDMI port as well as USB ports. The HDMI port will allow you to connect your laptop to other monitors, TV's and even projectors. There are monitors in the design studios that you will be able to connect to, to give you more screen space. You will need a HDMI port to do this. There will always be a need for peripherals and additional storage devices and for this a number of USB ports or an external and powered USB hub is recommended. Webcams come built into most laptops now. But if the model you are thinking of getting doesn't include one, this is something you will need to purchase. It is quite likely that in some points in your course, you will still need to have video-based meetings. A webcam is essential for modern IT communication purposes. I hope you have found the above information useful in helping you navigate the slightly tricky issue of choosing which devices to buy for your studies at Nottingham and if you still have questions, please feel free to get in touch. The University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 95 14081"
        }
    ],
    "pdf_files": []
}