{
    "url": "https://www.nottingham.ac.uk/engineering/people/ifty.ahmed",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR FACULTIES, SCHOOLS & GROUPS Yttrium-Enriched Phosphate Glass-Ceramic Microspheres for Bone Cancer Radiotherapy Treatment (2024) Journal Article Milborne, B., Arjuna, A., Islam, T., Arafat, A., Layfield, R., Thompson, A., & Ahmed, I. (2024). Yttrium-Enriched Phosphate Glass-Ceramic Microspheres for Bone Cancer Radiotherapy Treatment. ACS Omega, 9(52), 50933-50944. https://doi.org/10.1021/acsomega.4c02825 This study presents the development and characterisation of high yttrium-content phosphate-based glass-ceramic microspheres for potential applications in bone cancer radiotherapy treatment. The microspheres produced via flame spheroidisa-tion, follow... Read More about Yttrium-Enriched Phosphate Glass-Ceramic Microspheres for Bone Cancer Radiotherapy Treatment. Continuous flow synthesis of MOF UTSA-16(Zn), mixed-metal and magnetic composites for CO2 capture – toward scalable manufacture (2024) Journal Article Woodliffe, J. L., Molinar-Díaz, J., Clowes, R., Hussein, O. H., Lester, E., Ferrari, R., Ahmed, I., & Laybourn, A. (2024). Continuous flow synthesis of MOF UTSA-16(Zn), mixed-metal and magnetic composites for CO2 capture – toward scalable manufacture. Journal of Environmental Chemical Engineering, 12(6), Article 114167. https://doi.org/10.1016/j.jece.2024.114167 UTSA-16(Zn) is a zinc and citrate-based metal-organic framework (MOF) which has shown highly promising performance for CO2 capture. However, the transition of this MOF to industrial application has been hindered as a scalable synthesis method has not... Read More about Continuous flow synthesis of MOF UTSA-16(Zn), mixed-metal and magnetic composites for CO2 capture – toward scalable manufacture. Poly-Ether-Ether-Ketone (PEEK) Biomaterials and Composites: Challenges, Progress, and Opportunities (2024) Journal Article Molinar-Díaz, J., Parsons, A. J., Ahmed, I., Warrior, N. A., & Harper, L. T. (2024). Poly-Ether-Ether-Ketone (PEEK) Biomaterials and Composites: Challenges, Progress, and Opportunities. Polymer Reviews, 1-39. https://doi.org/10.1080/15583724.2024.2406965 Polyetheretherketone (PEEK) is a lightweight, bioinert, high-performance thermoplastic that is beginning to see clinical use in orthopedic applications. PEEK outperforms conventional metallic counterparts in terms of reduced stress shielding and impr... Read More about Poly-Ether-Ether-Ketone (PEEK) Biomaterials and Composites: Challenges, Progress, and Opportunities. PDI-Functionalized Glass Beads: Efficient, Metal-Free Heterogeneous Photocatalysts Suitable for Flow Photochemistry (2024) Journal Article Ali, H., Ahmed, I., Robertson, K., & Lanterna, A. E. (2024). PDI-Functionalized Glass Beads: Efficient, Metal-Free Heterogeneous Photocatalysts Suitable for Flow Photochemistry. Organic Process Research and Development, 28(9), 3698-3706. https://doi.org/10.1021/acs.oprd.4c00256 Perylene diimides (PDI) have an extraordinary ability to activate both energy and electron transfer processes upon light excitation; however, their extremely low solubility has hindered their wide use as photocatalysts. Here, we show that the combina... Read More about PDI-Functionalized Glass Beads: Efficient, Metal-Free Heterogeneous Photocatalysts Suitable for Flow Photochemistry. Development of Resorbable Phosphate-Based Glass Microspheres as MRI Contrast Media Agents (2024) Journal Article Molinar-Díaz, J., Arjuna, A., Abrehart, N., McLellan, A., Harris, R., Islam, M. T., Alzaidi, A., Bradley, C. R., Gidman, C., Prior, M. J. W., Titman, J., Blockley, N. P., Harvey, P., Marciani, L., & Ahmed, I. (2024). Development of Resorbable Phosphate-Based Glass Microspheres as MRI Contrast Media Agents. Molecules, 29(18), Article 4296. https://doi.org/10.3390/molecules29184296 In this research, resorbable phosphate-based glass (PBG) compositions were developed using varying modifier oxides including iron (Fe2O3), copper (CuO), and manganese (MnO2), and then processed via a rapid single-stage flame spheroidisation process t... Read More about Development of Resorbable Phosphate-Based Glass Microspheres as MRI Contrast Media Agents. A phosphate glass reinforced composite acrylamide gradient scaffold for osteochondral interface regeneration (2024) Journal Article Younus, Z. M., Ahmed, I., Roach, P., & Forsyth, N. R. (2024). A phosphate glass reinforced composite acrylamide gradient scaffold for osteochondral interface regeneration. Biomaterials and Biosystems, 15, Article 100099. https://doi.org/10.1016/j.bbiosy.2024.100099 The bone-cartilage interface is defined by a unique arrangement of cells and tissue matrix. Injury to the interface can contribute to the development of arthritic joint disease. Attempts to repair osteochondral damage through clinical trials have gen... Read More about A phosphate glass reinforced composite acrylamide gradient scaffold for osteochondral interface regeneration. Self-assembled titanium-based macrostructures with hierarchical (macro-, micro-, and nano) porosities: A fundamental study (2024) Journal Article Wadge, M. D., Agyakwa, P. A., Felfel, R. M., Homer, R., Cooper, T. P., Kudrynskyi, Z. R., Lester, E., Ahmed, I., & Grant, D. M. (2024). Self-assembled titanium-based macrostructures with hierarchical (macro-, micro-, and nano) porosities: A fundamental study. Materials and Design, 240, Article 112835. https://doi.org/10.1016/j.matdes.2024.112835 This study details the novel self-assembly of sodium titanate converted Ti-based microspheres into hierarchical porous 3D constructs, with macro-, micro-, and nanoporosity, for the first time. Ti6Al4V microspheres were suspended into 5 M NaOH (60 °C/... Read More about Self-assembled titanium-based macrostructures with hierarchical (macro-, micro-, and nano) porosities: A fundamental study. Development of samarium-doped phosphate glass microspheres for internal radiotheranostic applications (2024) Journal Article Arjuna, A., Milborne, B., Putra, A. R., Mulyaningsih, T. R., Setiawan, H., Islam, M. T., Felfel, R., & Ahmed, I. (2024). Development of samarium-doped phosphate glass microspheres for internal radiotheranostic applications. International Journal of Pharmaceutics, 653, Article 123919. https://doi.org/10.1016/j.ijpharm.2024.123919 Internal radiotherapy delivers radioactive sources inside the body, near to or into malignant tumours, which may be particularly effective when malignancies are not responding to external beam radiotherapy. A pure beta emitter, 90Y, is currently used... Read More about Development of samarium-doped phosphate glass microspheres for internal radiotheranostic applications. The Use of Microspheres for Cancer Embolization Therapy: Recent Advancements and Prospective (2024) Journal Article Nuzulia, N. A., Mart, T., Ahmed, I., & Sari, Y. W. (2024). The Use of Microspheres for Cancer Embolization Therapy: Recent Advancements and Prospective. ACS Biomaterials Science and Engineering, https://doi.org/10.1021/acsbiomaterials.3c00659 Embolization therapy involving biomaterials has improved the therapeutic strategy for most liver cancer treatments. Developing biomaterials as embolic agents has significantly improved patients’ survival rates. Various embolic agents are present in l... Read More about The Use of Microspheres for Cancer Embolization Therapy: Recent Advancements and Prospective. In vitro immunomodulatory effect of solid versus porous phosphate-based glass microspheres using macrophages (2023) Journal Article Sheela, S., AlGhalban, F. M., Ahmed, I., & Abou Neel, E. A. (2023). In vitro immunomodulatory effect of solid versus porous phosphate-based glass microspheres using macrophages. Heliyon, 9(12), e23059. https://doi.org/10.1016/j.heliyon.2023.e23059 This study aimed to investigate the immunomodulatory effect of two different forms of phosphate-based glass microspheres (solid and porous), on human macrophages. Human THP-1 monocytes were converted to M0 macrophages after being treated with 100 ng/... Read More about In vitro immunomodulatory effect of solid versus porous phosphate-based glass microspheres using macrophages. Rapid microwave synthesis of sustainable magnetic framework composites of UTSA-16(Zn) with Fe3O4 nanoparticles for efficient CO2 capture (2023) Journal Article Woodliffe, J. L., Johnston, A.-L., Fay, M., Ferrari, R., Gomes, R. L., Lester, E., Ahmed, I., & Laybourn, A. (2023). Rapid microwave synthesis of sustainable magnetic framework composites of UTSA-16(Zn) with Fe3O4 nanoparticles for efficient CO2 capture. Materials Advances, 4(11), 5838-5849. https://doi.org/10.1039/D3MA00351E Metal-organic frameworks (MOFs) have shown excellent potential for carbon dioxide capture applications due to their high sorption capacities and selectivities. However, MOFs are typically thermally insulating, and so thermal CO2 regeneration is chall... Read More about Rapid microwave synthesis of sustainable magnetic framework composites of UTSA-16(Zn) with Fe3O4 nanoparticles for efficient CO2 capture. Developing alkaline titanate surfaces for medical applications (2023) Journal Article Wadge, M. D., McGuire, J., Thomas, K. G., Stuart, B. W., Felfel, R. M., Ahmed, I., & Grant, D. M. (2023). Developing alkaline titanate surfaces for medical applications. International Materials Reviews, 68(6), 677-724. https://doi.org/10.1080/09506608.2022.2153217 Improving the surface of medical implants by plasma spraying of a hydroxyapatite coating can be of critical importance to their longevity and the patient’s convalescence. However, residual stresses, cracking, undesired crystallisation and delaminatio... Read More about Developing alkaline titanate surfaces for medical applications. PDI-functionalised glass beads: efficient, metal-free heterogeneous photocatalysts suitable for flow photochemistry (2023) Preprint / Working Paper Ali, H., Ahmed, I., Robertson, K., & Lanterna, A. PDI-functionalised glass beads: efficient, metal-free heterogeneous photocatalysts suitable for flow photochemistry Perylene diimides (PDI) have an extraordinary ability to activate both energy and electron transfer process upon light excitation, however, their extremely low solubility has hindered their wide use as photocatalysts. Here, we show a series of suppor... Read More about PDI-functionalised glass beads: efficient, metal-free heterogeneous photocatalysts suitable for flow photochemistry. Rapid synthesis of magnetic microspheres and the development of new macro-micro hierarchically porous magnetic framework composites (2023) Journal Article Woodliffe, J. L., Molinar-Díaz, J., Islam, M. T., Stevens, L. A., Wadge, M. D., Rance, G. A., Ferrari, R., Ahmed, I., & Laybourn, A. (2023). Rapid synthesis of magnetic microspheres and the development of new macro-micro hierarchically porous magnetic framework composites. Journal of Materials Chemistry A, 11(27), 14705-14719. https://doi.org/10.1039/D3TA01927F Magnetic framework composites (MFCs) are a highly interesting group of materials that contain both metal–organic frameworks (MOFs) and magnetic materials. Combining the unique benefits of MOFs (tuneable natures, high surface areas) with the advantage... Read More about Rapid synthesis of magnetic microspheres and the development of new macro-micro hierarchically porous magnetic framework composites. Process parameter optimisation for manufacturing porous bioactive silicate glass microspheres via flame spheroidisation: The goldilocks effect (2023) Journal Article Islam, M. T., Parsons, A. J., Nuzulia, N. A., Sari, Y. W., Ren, H., Booth, J., & Ahmed, I. (2023). Process parameter optimisation for manufacturing porous bioactive silicate glass microspheres via flame spheroidisation: The goldilocks effect. Journal of Non-Crystalline Solids, 614, Article 122393. https://doi.org/10.1016/j.jnoncrysol.2023.122393 This study investigated the influence of flame spheroidisation process parameters for successfully manufacturing solid (dense) and highly porous microspheres from Food and Drug Administration approved bioactive 45S5 glass and 45S5 with addition of vi... Read More about Process parameter optimisation for manufacturing porous bioactive silicate glass microspheres via flame spheroidisation: The goldilocks effect. Tailoring absorptivity of highly reflective Ag powders by pulsed-direct current magnetron sputtering for additive manufacturing processes (2023) Journal Article Wadge, M. D., Lowther, M., Cooper, T. P., Reynolds, W. J., Speidel, A., Carter, L. N., Rabbitt, D., Kudrynskyi, Z. R., Felfel, R. M., Ahmed, I., Clare, A. T., Grant, D. M., Grover, L. M., & Cox, S. C. (2023). Tailoring absorptivity of highly reflective Ag powders by pulsed-direct current magnetron sputtering for additive manufacturing processes. Journal of Materials Processing Technology, 317, Article 117985. https://doi.org/10.1016/j.jmatprotec.2023.117985 Processing of highly reflective and high thermally conductive materials (Cu, Ag, etc.) by laser powder bed fusion (LPBF) is of increasing interest to broaden the range of materials that can be additively manufactured. However, these alloys are challe... Read More about Tailoring absorptivity of highly reflective Ag powders by pulsed-direct current magnetron sputtering for additive manufacturing processes. Optimisation of the Flame Spheroidisation Process for the Rapid Manufacture of Fe3O4-Based Porous and Dense Microspheres (2023) Journal Article Molinar-Díaz, J., Woodliffe, J. L., Steer, E., Morley, N. A., Brown, P. D., & Ahmed, I. (2023). Optimisation of the Flame Spheroidisation Process for the Rapid Manufacture of Fe3O4-Based Porous and Dense Microspheres. Molecules, 28(6), Article 2523. https://doi.org/10.3390/molecules28062523 The rapid, single-stage, flame-spheroidisation process, as applied to varying Fe3O4:CaCO3 powder combinations, provides for the rapid production of a mixture of dense and porous ferromagnetic microspheres with homogeneous composition, high levels of... Read More about Optimisation of the Flame Spheroidisation Process for the Rapid Manufacture of Fe3O4-Based Porous and Dense Microspheres. Production of Nano Hydroxyapatite and Mg-Whitlockite from Biowaste-Derived products via Continuous Flow Hydrothermal Synthesis: A Step towards Circular Economy (2023) Journal Article Nigar, F., Johnston, A. L., Smith, J., Oakley, W., Islam, M. T., Felfel, R., Grant, D., Lester, E., & Ahmed, I. (2023). Production of Nano Hydroxyapatite and Mg-Whitlockite from Biowaste-Derived products via Continuous Flow Hydrothermal Synthesis: A Step towards Circular Economy. Materials, 16(6), Article 2138. https://doi.org/10.3390/ma16062138 Biowastes from agriculture, sewage, household wastes, and industries comprise promising resources to produce biomaterials while reducing adverse environmental effects. This study focused on utilising waste-derived materials (i.e., eggshells as a calc... Read More about Production of Nano Hydroxyapatite and Mg-Whitlockite from Biowaste-Derived products via Continuous Flow Hydrothermal Synthesis: A Step towards Circular Economy. Optimisation of the Flame Spheroidisation Process for the Rapid Manufacture of Fe3O4-Based Porous and Dense Microspheres (2023) Journal Article Molinar-Díaz, J., Woodliffe, J. L., Steer, E., Morley, N. A., Brown, P. D., & Ahmed, I. (in press). Optimisation of the Flame Spheroidisation Process for the Rapid Manufacture of Fe3O4-Based Porous and Dense Microspheres. Molecules, 28(6), Article 2523. https://doi.org/10.3390/+molecules28062523 The rapid, single-stage, flame-spheroidisation process, as applied to varying Fe3O4:CaCO3 powder combinations, provides for the rapid production of a mixture of dense and porous ferro-magnetic microspheres with homogeneous composition, high levels of... Read More about Optimisation of the Flame Spheroidisation Process for the Rapid Manufacture of Fe3O4-Based Porous and Dense Microspheres. Ferromagnetic Cytocompatible Glass-Ceramic Porous Microspheres for Magnetic Hyperthermia Applications (2023) Journal Article Molinar‐Díaz, J., Woodliffe, J. L., Milborne, B., Murrell, L., Islam, M. T., Steer, E., Weston, N., Morley, N. A., Brown, P. D., & Ahmed, I. (2023). Ferromagnetic Cytocompatible Glass-Ceramic Porous Microspheres for Magnetic Hyperthermia Applications. Advanced Materials Interfaces, 10(11), Article 2202089. https://doi.org/10.1002/admi.202202089 Highly porous, ferromagnetic glass-ceramic P40-Fe3O4 microspheres (125–212 µm) with enhanced cytocompatibility have been manufactured for the first time via a facile, rapid, single-stage flame spheroidization process. Dispersions of Fe3O4 and Ca2Fe2O... Read More about Ferromagnetic Cytocompatible Glass-Ceramic Porous Microspheres for Magnetic Hyperthermia Applications. Showing 1 - 20 of 97 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}