{
    "url": "https://www.nottingham.ac.uk/engineering/research/areas/advanced-manufacturing/index.aspx",
    "content": [
        {
            "p": "Follow us on LinkedIn This is the place where we create cutting-edge tools and technologies. Our experts are developing next-generation materials and revolutionising manufacturing processes. We’re turning research into reality to help solve real world challenges including: Our transformative research is addressing the United Nations Sustainable Development Goals and shaping the real world. Our research also informs our courses, from undergraduate and masters degrees, to PhDs. Diamond quantum sensors Pioneering the next generation of quantum sensors by turning tiny flaws in diamond into incredibly sensitive quantum devices, unlocking new applications in sectors such as healthcare, food security, and defence. \"We need to shift towards sustainable ways of manufacturing fine chemicals. Our research is focused on developing a new chemical reactor using biocatalysts.\" — Dr Parimala Shivaprasad Our research shapes society and boosts business. Discover more of our research impact stories. Developing robots for in-situ maintenance of Rolls-Royce aero engines reducing maintenance downtime from days to hours. Optimising a copolymer structure for a bacteria resistant urinary catheter coating to create a commercially viable product. A revolutionary non-destructive imaging technique that can be used during the manufacturing process to assess the microstructure of materials. Creating a fully-automated pilot-scale manufacturing process for complex composites shapes for the automotive industry. Designing self-adapting manufacturing systems for the cost-effective manufacturing of complex, high-value products at low volumes. Pioneering the use and industrial scale manufacture of metal-organic-frameworks to drive more energy efficient carbon capture for Drax Power Station. We work across a range of research areas within advanced materials and manufacturing. Ebenezer is focused on discovering new materials to produce novel environmental barrier coatings (EBCs) and improving the performance of current EBCs by enhancing the manufacturing process. Karina has developed a methodology to help companies initiate, implement, and measure digital transformation strategies. Search for an engineering or architecture expert Access resources to collaborate, innovate and grow your business"
        }
    ],
    "pdf_files": []
}