{
    "url": "https://www.nottingham.ac.uk/engineering/people/chris.gerada",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR A Hybrid PWM Technique Employing Variable Switching Sequences for Current Ripple Suppression in Dual Three-Phase PMSMs (2024) Journal Article Wang, S., Rivera, M., Golovanov, D., Blissett, J., Moran, J., Davison, P., Ramtharan, G., Gerada, C., & Wheeler, P. (2024). A Hybrid PWM Technique Employing Variable Switching Sequences for Current Ripple Suppression in Dual Three-Phase PMSMs. IEEE Transactions on Industrial Electronics, 1-11. https://doi.org/10.1109/tie.2024.3476911 Dual three-phase electrical machines inherently have lower 6 k ± 1 order harmonic impedance than conventional three-phase machines, particularly in their sensitivity to voltage pulses from a drive in terms of current harmonics. Based on space vector... Read More about A Hybrid PWM Technique Employing Variable Switching Sequences for Current Ripple Suppression in Dual Three-Phase PMSMs. PDIV Modeling for Rectangular Wire Turn-to-Turn Insulation of Inverter-Fed Motors at Different Cruising Altitudes (2024) Presentation / Conference Contribution Naderiallaf, H., Gerada, C., Degano, M., & Gerada, D. (2024, September). PDIV Modeling for Rectangular Wire Turn-to-Turn Insulation of Inverter-Fed Motors at Different Cruising Altitudes. Presented at 2024 International Conference on Electrical Machines (ICEM), Torino, Italy This study develops a predictive model for partial discharge inception voltage (PDIV) in turn-to-turn insulation of form-wound windings for inverter-fed motors considering a range of altitudes, from ground to cruise levels. Emphasis is placed on the... Read More about PDIV Modeling for Rectangular Wire Turn-to-Turn Insulation of Inverter-Fed Motors at Different Cruising Altitudes. On Accelerated Degradation of DC-Link Film Capacitors and Data-based Lifetime Estimation (2024) Journal Article Pena-Quintal, A., Mustafa, U., Gerada, C., & Ahmed, M. R. (2024). On Accelerated Degradation of DC-Link Film Capacitors and Data-based Lifetime Estimation. IEEE Access, https://doi.org/10.1109/access.2024.3474256 Methods to address the lifetime of film capacitors are a new trend, which have come about due to the importance of control algorithms relying on the stability and the reliability of this passive device for controlling ever-increasing power with optim... Read More about On Accelerated Degradation of DC-Link Film Capacitors and Data-based Lifetime Estimation. Analytical-Numerical Model for Synchronous Homopolar Machines (2024) Journal Article Vannini, A., Nardo, M. D., Marfoli, A., Riccio, J., Murataliyev, M., Rocca, A. L., & Gerada, C. (2024). Analytical-Numerical Model for Synchronous Homopolar Machines. IEEE Transactions on Energy Conversion, 1-13. https://doi.org/10.1109/tec.2024.3468720 Synchronous homopolar machines represent a viable solution for applications requiring a robust electro-mechanical conversion system. Their diffusion is hindered by the low power density and by their complex three-dimensional magnetic behavior which r... Read More about Analytical-Numerical Model for Synchronous Homopolar Machines. Distributed Magnetic Equivalent Circuit Modelling of Synchronous Machines (2024) Journal Article Korman, O., Nardo, M. D., Riccio, J., Murataliyev, M., Degano, M., & Gerada, C. (2024). Distributed Magnetic Equivalent Circuit Modelling of Synchronous Machines. IEEE Transactions on Industry Applications, https://doi.org/10.1109/TIA.2024.3462898 This paper proposes a highly accurate and computationally efficient distributed magnetic equivalent circuit (DMEC) model for synchronous electric machines. The model - based on a two directional flux paths cell element - is derived in a general fashi... Read More about Distributed Magnetic Equivalent Circuit Modelling of Synchronous Machines. Design Strategies for Scalable and Modular Aerospace Electrical Machines (2024) Presentation / Conference Contribution Darmani, M. A., Murataliyev, M., Gerada, D., & Gerada, C. (2024, September). Design Strategies for Scalable and Modular Aerospace Electrical Machines. Presented at 2024 International Conference on Electrical Machines (ICEM), Torino, Italy In his study, innovative design approaches for scalable and modular inverter-fed electrical machines, tailored for aerospace applications, are explored with the primary goal of achieving unparalleled power density within powertrain systems. Three dis... Read More about Design Strategies for Scalable and Modular Aerospace Electrical Machines. Fault-Tolerant Dual Channels Three-Phase PMSM for Aerospace Applications (2024) Journal Article Khowja, M. R., Singh, K., Rocca, A. L., Vakil, G., Ramnathan, R., & Gerada, C. (2024). Fault-Tolerant Dual Channels Three-Phase PMSM for Aerospace Applications. IEEE Access, 12, 126845-126857. https://doi.org/10.1109/access.2024.3451705 In safety-critical applications such as aerospace and marine, electrical machines are limited to meet several stringent requirements such as physical, electrical, magnetic and thermal isolation between two three-phase channels, in order to be conside... Read More about Fault-Tolerant Dual Channels Three-Phase PMSM for Aerospace Applications. All-Inorganic Electrical Insulation Systems for High-Power Density Electrical Machines (2024) Presentation / Conference Contribution Kudrynskyi, Z., Connor, P. H., Cooper, T. P., Wadge, M. D., Kerfoot, J., Zheng, X., Felfel, R., Korolkov, V., Kubal, M., Gerada, C., & Grant, D. M. (2024, June). All-Inorganic Electrical Insulation Systems for High-Power Density Electrical Machines. Presented at 2024 IEEE 5th International Conference on Dielectrics (ICD), Toulouse, France This paper introduces the concept of ‘All-Inorganic Electrical Insulation (EI) System’ to enable the next generation of high-power-density electrical machines (EMs) that can operate at extreme conditions, namely high voltages (V) up to 1 kV DC and hi... Read More about All-Inorganic Electrical Insulation Systems for High-Power Density Electrical Machines. Multiphysics Sizing of Interior Permanent Magnet Machines Based on Geometric Methodology (2024) Journal Article Darmani, M. A., Cavagnino, A., Vaschetto, S., Marignetti, F., & Gerada, C. (2024). Multiphysics Sizing of Interior Permanent Magnet Machines Based on Geometric Methodology. IEEE Open Journal of Industry Applications, 5, 283 - 299. https://doi.org/10.1109/ojia.2024.3427863 This study presents a sizing methodology in the frame of the multidisciplinary design of interior permanent magnet synchronous machines. The proposed approach targets at obtaining an initial electromagnetic design of the machine, including diameters,... Read More about Multiphysics Sizing of Interior Permanent Magnet Machines Based on Geometric Methodology. AFPM Machines Equipped with Multilayer Magnets (2024) Journal Article Darmani, M. A., Pošković, E., Franchini, F., Ferraris, L., Cavagnino, A., & Gerada, C. (2024). AFPM Machines Equipped with Multilayer Magnets. IEEE Transactions on Energy Conversion, https://doi.org/10.1109/tec.2024.3420133 This article investigates the manufacturability and applicability of unified multilayer magnets, comprising two different magnetic materials with distinct characteristics, for use in electrical machines. In particular, the self-produced multilayer ma... Read More about AFPM Machines Equipped with Multilayer Magnets. Investigation on the Torsional–Flexural Instability Phenomena during the Bending Process of Hairpin Windings: Experimental Tests and FE Model Validation (2024) Journal Article Mangeruga, V., Barbieri, S. G., Giacopini, M., Giuradei, F., Vai, P., & Gerada, C. (2024). Investigation on the Torsional–Flexural Instability Phenomena during the Bending Process of Hairpin Windings: Experimental Tests and FE Model Validation. Machines, 12(6), Article 396. https://doi.org/10.3390/machines12060396 Modern electric motors developed for the automotive industry have an ever higher power density with a relatively compact size. Among the various existing solutions to improve torque and power density, a reduction in the dimensions of the end-windings... Read More about Investigation on the Torsional–Flexural Instability Phenomena during the Bending Process of Hairpin Windings: Experimental Tests and FE Model Validation. Fast Flux Maps Computation of Synchronous Reluctance Machines With and Without Permanent Magnets Assistance (2024) Journal Article Gallicchio, G., Nardo, M. D., Cupertino, F., Varvolik, V., Buticchi, G., Degano, M., & Gerada, C. (2024). Fast Flux Maps Computation of Synchronous Reluctance Machines With and Without Permanent Magnets Assistance. IEEE Transactions on Industry Applications, 60(5), 6725-6735. https://doi.org/10.1109/TIA.2024.3403967 This paper proposes a computational efficient and accurate hybrid analytical-finite element (FE) performance prediction methodology for synchronous reluctance (SyR) machines. The hybrid procedure consists in solving the d- and q-axis magnetic equival... Read More about Fast Flux Maps Computation of Synchronous Reluctance Machines With and Without Permanent Magnets Assistance. Investigation on the torsional property of hybrid composite/metal shafts at different service temperatures: Experimental and analytical study (2024) Journal Article Qi, W., Xu, Z., Wan, Y., Gerada, D., & Gerada, C. (2024). Investigation on the torsional property of hybrid composite/metal shafts at different service temperatures: Experimental and analytical study. Polymer Composites, 45(12), 11266-11275. https://doi.org/10.1002/pc.28564 Torsional tests were conducted to investigate the influence of service temperature on torsional property of composite/steel hybrid structures. In the experiment, two types of lightweight hybrid composite‐metal shafts were tested at both room temperat... Read More about Investigation on the torsional property of hybrid composite/metal shafts at different service temperatures: Experimental and analytical study. Research on Matching Interpolation Functions and Field Calculation Methods in Multi-Material Topology Optimization of Electric Machine (2024) Presentation / Conference Contribution He, X., Yan, L., Chen, I., Gerada, C., Liu, X., Du, N., & Yang, X. (2024, May). Research on Matching Interpolation Functions and Field Calculation Methods in Multi-Material Topology Optimization of Electric Machine. Presented at 2024 IEEE 7th International Electrical and Energy Conference (CIEEC), Harbin, China The Solid Isotropic Material with Penalization (SIMP) method is highly regarded in the field of topology optimization due to its ease of implementation and conceptual clarity. However, in the realm of multi-material topology optimization for electric... Read More about Research on Matching Interpolation Functions and Field Calculation Methods in Multi-Material Topology Optimization of Electric Machine. A Review of Carbon Emissions from Electrical Machine Materials (2024) Journal Article Zhang, X., Gerada, D., Xu, Z., Zhang, F., & Gerada, C. (2024). A Review of Carbon Emissions from Electrical Machine Materials. Electronics, 13(9), Article 1714. https://doi.org/10.3390/electronics13091714 As the world embarks on a global mission to tackle climate change, reducing carbon represents a key challenge given the escalating global warming. The U.K. is among many other nations that are determined to decarbonise all sectors and strive to achie... Read More about A Review of Carbon Emissions from Electrical Machine Materials. Permanent Magnet Assisted Synchronous Reluctance Machine Design for Light Traction Applications (2024) Journal Article Nardo, M. D., Gallicchio, G., Cupertino, F., Korman, O., Wang, M., Gerada, C., Varvolik, V., Wang, S., & Buticchi, G. (2024). Permanent Magnet Assisted Synchronous Reluctance Machine Design for Light Traction Applications. IEEE Transactions on Industry Applications, 60(4), 6079-6091. https://doi.org/10.1109/tia.2024.3384481 This paper presents a systematic comparative design study of permanent magnet assisted synchronous reluctance (PMaSyR) machines for a light traction application aimed at considering an holistic approach for a given outer envelope and cooling system s... Read More about Permanent Magnet Assisted Synchronous Reluctance Machine Design for Light Traction Applications. Life Characterization of PEEK and Nanofilled Enamel Insulated Wires Under Thermal Ageing (2024) Journal Article Khowja, M. R., Vakil, G., Ahmad, S. S., Ramanathan, R., Gerada, C., & Benarous, M. (2024). Life Characterization of PEEK and Nanofilled Enamel Insulated Wires Under Thermal Ageing. IEEE Access, 12, 39470- 39483. https://doi.org/10.1109/access.2024.3374637 This paper characterizes and develops life models for two different wire insulating materials: Poly-ether-ketone (PEEK) and nanofilled enamel (Allotherm wire). The article focuses on predicting the lifespan of PEEK and Allotherm wire insulating mater... Read More about Life Characterization of PEEK and Nanofilled Enamel Insulated Wires Under Thermal Ageing. Fillet Radius Impact of Rectangular Insulated Wires on PDIV for Turn-to-Turn Insulation of Inverter-Fed Motors (2024) Journal Article Naderiallaf, H., Degano, M., Gerada, C., & Gerada, D. (2024). Fillet Radius Impact of Rectangular Insulated Wires on PDIV for Turn-to-Turn Insulation of Inverter-Fed Motors. IEEE Transactions on Dielectrics and Electrical Insulation, 31(4), 2084-2093. https://doi.org/10.1109/tdei.2024.3355032 This contribution elucidates the impact of the fillet radius, a geometric feature of rectangular insulated wires not commonly considered, on the partial discharge inception voltage (PDIV) in low-voltage machine turn-to-turn winding insulation. Initia... Read More about Fillet Radius Impact of Rectangular Insulated Wires on PDIV for Turn-to-Turn Insulation of Inverter-Fed Motors. Modeling Air Pressure Impact on PDIV for Rectangular Wire Turn-to-Turn Insulation of Inverter-Fed Motors under Different Voltage Waveform Excitations (2024) Journal Article Naderiallaf, H., Degano, M., & Gerada, C. (2024). Modeling Air Pressure Impact on PDIV for Rectangular Wire Turn-to-Turn Insulation of Inverter-Fed Motors under Different Voltage Waveform Excitations. IEEE Access, 12, 176232-176246. https://doi.org/10.1109/ACCESS.2024.3506053 This study investigates the partial discharge inception voltage (PDIV) in turn-to-turn insulation of form-wound windings in inverter-fed motors under nine different air pressures, ranging from 1013 mbar to 10 mbar. The research evaluates three voltag... Read More about Modeling Air Pressure Impact on PDIV for Rectangular Wire Turn-to-Turn Insulation of Inverter-Fed Motors under Different Voltage Waveform Excitations. Additive manufacturing of Nd-Fe-B permanent magnets and their application in electrical machines (2024) Journal Article Wu, J., Korman, O., Di Nardo, M., Degano, M., Gerada, C., Ashcroft, I., J.M. Hague, R., & T. Aboulkhair, N. (2024). Additive manufacturing of Nd-Fe-B permanent magnets and their application in electrical machines. IEEE Access, 12, 138921-138931. https://doi.org/10.1109/ACCESS.2024.3436643 Powder Bed Fusion - Laser Beam (PBF-LB), a form of additive manufacturing (AM) for Nd-Fe-B permanent magnets, is attracting substantial interest for its ability to process functional magnetic materials while capitalizing on AM's design flexibility an... Read More about Additive manufacturing of Nd-Fe-B permanent magnets and their application in electrical machines. Showing 1 - 20 of 430 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}