{
    "url": "https://www.nottingham.ac.uk/engineering/people/rachel.gomes",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR FACULTIES, SCHOOLS & GROUPS Breaking barriers to modelling biotechnologies with machine learning (2024) Journal Article Fisher, O. J., Short, M., Zhang, D., Guo, M., & Gomes, R. L. (2025). Breaking barriers to modelling biotechnologies with machine learning. Resources, Conservation and Recycling, 215, Article 108071. https://doi.org/10.1016/j.resconrec.2024.108071 Water Sustainability and Hydrological Extremes: Quantity, Quality, and Security (2024) Book Kumar, M., Agarwal, V., Gomes, R. L., & Prasad Panday, D. (Eds.). (2024). Water Sustainability and Hydrological Extremes: Quantity, Quality, and Security. Elsevier Water Sustainability and Hydrological Extremes: Quantity, Quality, and Security presents a study for the mitigation of hydrological extremes through case studies. The focus is on the effect of extremes on water quality and the fate of geogenic, micro... Read More about Water Sustainability and Hydrological Extremes: Quantity, Quality, and Security. Interactions between antibiotic removal, water matrix characteristics and layered double hydroxide sorbent material (2024) Journal Article Johnston, A.-L., Lester, E., Williams, O., & Gomes, R. L. (2024). Interactions between antibiotic removal, water matrix characteristics and layered double hydroxide sorbent material. Chemosphere, 367, Article 143546. https://doi.org/10.1016/j.chemosphere.2024.143546 Sorption by layered double hydroxides (LDH) is gaining substantial interest for remediating emerging contaminants, including pharmaceuticals from wastewaters. Findings from a sorbent material performing successfully in lab-based studies using non-env... Read More about Interactions between antibiotic removal, water matrix characteristics and layered double hydroxide sorbent material. Wastewater reuse and pharmaceutical pollution in agriculture: Uptake, transport, accumulation and metabolism of pharmaceutical pollutants within plants (2024) Journal Article Mosharaf, M. K., Gomes, R. L., Cook, S., Alam, M. S., & Rasmusssen, A. (2024). Wastewater reuse and pharmaceutical pollution in agriculture: Uptake, transport, accumulation and metabolism of pharmaceutical pollutants within plants. Chemosphere, 364, Article 143055. https://doi.org/10.1016/j.chemosphere.2024.143055 The presence of pharmaceutical pollutants in water sources has become a growing concern due to its potential impacts on human health and other organisms. The physicochemical properties of pharmaceuticals based on their intended therapeutical applicat... Read More about Wastewater reuse and pharmaceutical pollution in agriculture: Uptake, transport, accumulation and metabolism of pharmaceutical pollutants within plants. Population infection estimation from wastewater surveillance for SARS-CoV-2 in Nagpur, India during the second pandemic wave (2024) Journal Article Acheampong, E., Husain, A. A., Dudani, H., Nayak, A. R., Nag, A., Meena, E., Shrivastava, S. K., McClure, P., Tarr, A. W., Crooks, C., Lade, R., Gomes, R. L., Singer, A., Kumar, S., Bhatnagar, T., Arora, S., Kashyap, R. S., & Monaghan, T. M. (2024). Population infection estimation from wastewater surveillance for SARS-CoV-2 in Nagpur, India during the second pandemic wave. PLoS ONE, 19(5), Article e0303529. https://doi.org/10.1371/journal.pone.0303529 Wastewater-based epidemiology (WBE) has emerged as an effective environmental surveillance tool for predicting severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) disease outbreaks in high-income countries (HICs) with centralized sewage infr... Read More about Population infection estimation from wastewater surveillance for SARS-CoV-2 in Nagpur, India during the second pandemic wave. Zero-valent iron (ZVI) facilitated in-situ selenium (Se) immobilization and its recovery by magnetic separation: Mechanisms and implications for microbial ecology (2024) Journal Article Wang, Z., Lü, C., Wang, Y., Gomes, R. L., Clarke, C. J., & Gomes, H. I. (2024). Zero-valent iron (ZVI) facilitated in-situ selenium (Se) immobilization and its recovery by magnetic separation: Mechanisms and implications for microbial ecology. Journal of Hazardous Materials, 473, Article 134591. https://doi.org/10.1016/j.jhazmat.2024.134591 Selenium (Se(VI)) is environmentally toxic. One of the most popular reducing agents for Se(VI) remediation is zero-valent iron (ZVI). However, most ZVI studies were carried out in water matrices, and the recovery of reduced Se has not been investigat... Read More about Zero-valent iron (ZVI) facilitated in-situ selenium (Se) immobilization and its recovery by magnetic separation: Mechanisms and implications for microbial ecology. Impacts of multi-pollutants on sulfonamide antibiotic removal from water matrices using layered double hydroxide sorbents (2023) Journal Article Johnston, A.-L., Lester, E., Williams, O., & Gomes, R. L. (2024). Impacts of multi-pollutants on sulfonamide antibiotic removal from water matrices using layered double hydroxide sorbents. Environmental Technology and Innovation, 33, Article 103490. https://doi.org/10.1016/j.eti.2023.103490 Remediation of sulfamethoxazole (SMX) present in the aqueous environment requires the development of new advanced wastewater treatment technologies, crucial to reduce the toxicity of such pollutants to the environment, supporting urban water reuse. C... Read More about Impacts of multi-pollutants on sulfonamide antibiotic removal from water matrices using layered double hydroxide sorbents. Rapid microwave synthesis of sustainable magnetic framework composites of UTSA-16(Zn) with Fe3O4 nanoparticles for efficient CO2 capture (2023) Journal Article Woodliffe, J. L., Johnston, A.-L., Fay, M., Ferrari, R., Gomes, R. L., Lester, E., Ahmed, I., & Laybourn, A. (2023). Rapid microwave synthesis of sustainable magnetic framework composites of UTSA-16(Zn) with Fe3O4 nanoparticles for efficient CO2 capture. Materials Advances, 4(11), 5838-5849. https://doi.org/10.1039/D3MA00351E Metal-organic frameworks (MOFs) have shown excellent potential for carbon dioxide capture applications due to their high sorption capacities and selectivities. However, MOFs are typically thermally insulating, and so thermal CO2 regeneration is chall... Read More about Rapid microwave synthesis of sustainable magnetic framework composites of UTSA-16(Zn) with Fe3O4 nanoparticles for efficient CO2 capture. Net zero roadmap modelling for sustainable dairy manufacturing and distribution (2023) Journal Article Malliaroudaki, M. I., Watson, N. J., Glover, Z. J., Nchari, L. N., & Gomes, R. L. (2023). Net zero roadmap modelling for sustainable dairy manufacturing and distribution. Chemical Engineering Journal, 475, Article 145734. https://doi.org/10.1016/j.cej.2023.145734 Energy-derived carbon emissions from dairy manufacturing and distribution are significant. Meeting a net zero carbon target is a global priority, and to that end the dairy industry is engaging an emission-reduction strategy. Modelling tools that can... Read More about Net zero roadmap modelling for sustainable dairy manufacturing and distribution. Lessons for Sustainable Urban Development: Interplay of Construction, Groundwater Withdrawal, and Land Subsidence at Battersea, London (2023) Journal Article Agarwal, V., Kumar, A., Qin, Z., Gomes, R. L., & Marsh, S. (2023). Lessons for Sustainable Urban Development: Interplay of Construction, Groundwater Withdrawal, and Land Subsidence at Battersea, London. Remote Sensing, 15(15), 3798. https://doi.org/10.3390/rs15153798 The capacity of aquifers to store water and the stability of infrastructure can each be adversely influenced by variations in groundwater levels and subsequent land subsidence. Along the south bank of the River Thames, the Battersea neighbourhood of... Read More about Lessons for Sustainable Urban Development: Interplay of Construction, Groundwater Withdrawal, and Land Subsidence at Battersea, London. RNA-Seq of untreated wastewater to assess COVID-19 and emerging and endemic viruses for public health surveillance (2023) Journal Article Stockdale, S. R., Blanchard, A. M., Nayak, A., Husain, A., Nashine, R., Dudani, H., McClure, C. P., Tarr, A. W., Nag, A., Meena, E., Sinha, V., Shrivastava, S. K., Hill, C., Singer, A. C., Gomes, R. L., Acheampong, E., Chidambaram, S. B., Bhatnagar, T., Vetrivel, U., Arora, S., …Monaghan, T. M. (2023). RNA-Seq of untreated wastewater to assess COVID-19 and emerging and endemic viruses for public health surveillance. The Lancet Regional Health – Southeast Asia, 14, Article 100205. https://doi.org/10.1016/j.lansea.2023.100205 Background: The COVID-19 pandemic showcased the power of genomic sequencing to tackle the emergence and spread of infectious diseases. However, metagenomic sequencing of total microbial RNAs in wastewater has the potential to assess multiple infectio... Read More about RNA-Seq of untreated wastewater to assess COVID-19 and emerging and endemic viruses for public health surveillance. Delivering on sustainable development goals in wastewater reuse for agriculture: Initial prioritization of emerging pollutants in the Tula Valley, Mexico (2023) Journal Article Garduño-Jiménez, A.-L., Durán-Álvarez, J.-C., Ortori, C. A., Abdelrazig, S., Barrett, D. A., & Gomes, R. L. (2023). Delivering on sustainable development goals in wastewater reuse for agriculture: Initial prioritization of emerging pollutants in the Tula Valley, Mexico. Water Research, 238, Article 119903. https://doi.org/10.1016/j.watres.2023.119903 Wastewater reuse for agricultural irrigation is a widespread beneficial practice, in line with the sustainable development goals. However, contaminants of emerging concern (CECs) present in wastewater, such as pharmaceuticals, pose... Read More about Delivering on sustainable development goals in wastewater reuse for agriculture: Initial prioritization of emerging pollutants in the Tula Valley, Mexico. Data-driven modelling for resource recovery: Data volume, variability, and visualisation for an industrial bioprocess (2022) Journal Article Fisher, O., Watson, N. J., Porcu, L., Bacon, D., Rigley, M., & Gomes, R. L. (2022). Data-driven modelling for resource recovery: Data volume, variability, and visualisation for an industrial bioprocess. Biochemical Engineering Journal, 185, Article 108499. https://doi.org/10.1016/j.bej.2022.108499 Advances in industrial digital technologies have led to an increasing volume of data generated from industrial bioprocesses, which can be utilised within data-driven models (DDM). However, data volume and variability complications make developing mod... Read More about Data-driven modelling for resource recovery: Data volume, variability, and visualisation for an industrial bioprocess. Fluffy Rivers: How Our Clothes Can Harm Rivers and The Oceans (2022) Journal Article Stanton, T., Johnson, M., Gomes, R. L., Nathanail, P., Macnaughtan, W., & Kay, P. (2022). Fluffy Rivers: How Our Clothes Can Harm Rivers and The Oceans. Frontiers for Young Minds, 10, Article 743943. https://doi.org/10.3389/frym.2022.743943 Microplastics are one of the most well-known types of environmental pollution. A microplastic is any piece of plastic smaller than 5 mm (about the size of one of the circles on top of a Lego® block). Microplastics come in a variety of shapes and they... Read More about Fluffy Rivers: How Our Clothes Can Harm Rivers and The Oceans. Translating wastewater reuse for irrigation from OECD Guidelines: Tramadol sorption and desorption in soil-water matrices. (2022) Journal Article Garduño-Jiménez, A. L., Durán-Álvarez, J. C., Cortés-Lagunes, R. S., Barrett, D. A., & Gomes, R. L. (2022). Translating wastewater reuse for irrigation from OECD Guidelines: Tramadol sorption and desorption in soil-water matrices. Chemosphere, 305, Article 135031. https://doi.org/10.1016/j.chemosphere.2022.135031 Treated and untreated wastewater is often used for agricultural irrigation and, despite the many benefits of this practice, it poses the risk of biologically active chemical pollutants (such as pharmaceuticals, like tramadol) entering the environment... Read More about Translating wastewater reuse for irrigation from OECD Guidelines: Tramadol sorption and desorption in soil-water matrices.. Planet Patrolling: A citizen science brand audit of anthropogenic litter in the context of national legislation and international policy (2022) Journal Article Stanton, T., Chico, G., Carr, E., Cook, S., Gomes, R. L., Heard, E., Law, A., Wilson, H. L., & Johnson, M. (2022). Planet Patrolling: A citizen science brand audit of anthropogenic litter in the context of national legislation and international policy. Journal of Hazardous Materials, 436, Article 129118. https://doi.org/10.1016/j.jhazmat.2022.129118 Anthropogenic Litter (AL) is ubiquitous in distribution and diverse in type and impact. Citizen science AL clean-ups engage citizens with the environment and have the potential to generate data that can inform policy. Here we present a detailed citiz... Read More about Planet Patrolling: A citizen science brand audit of anthropogenic litter in the context of national legislation and international policy. Meta-analysis and machine learning to explore soil-water partitioning of common pharmaceuticals (2022) Journal Article Garduño-Jiménez, A.-L., Durán-Álvarez, J.-C., & Gomes, R. L. (2022). Meta-analysis and machine learning to explore soil-water partitioning of common pharmaceuticals. Science of the Total Environment, 837, Article 155675. https://doi.org/10.1016/j.scitotenv.2022.155675 The first meta-analysis and modelling from batch-sorption literature studies of the soil/water partitioning of pharmaceuticals is presented. Analysis of the experimental conditions reported in the literature demonstrated that though batch-sorption st... Read More about Meta-analysis and machine learning to explore soil-water partitioning of common pharmaceuticals. Mathematical modelling of earlier stages of COVID-19 transmission dynamics in Ghana (2022) Journal Article Acheampong, E., Okyere, E., Iddi, S., Bonney, J. H., Wattis, J. A., Gomes, R. L., & Asamoah, J. K. K. (2022). Mathematical modelling of earlier stages of COVID-19 transmission dynamics in Ghana. Results in Physics, 34, Article 105193. https://doi.org/10.1016/j.rinp.2022.105193 In late 2019, a novel coronavirus, the SARS-CoV-2 outbreak was identified in Wuhan, China and later spread to every corner of the globe. Whilst the number of infection-induced deaths in Ghana, West Africa are minimal when compared with the rest of th... Read More about Mathematical modelling of earlier stages of COVID-19 transmission dynamics in Ghana. Energy management for a net zero dairy supply chain under climate change (2022) Journal Article Malliaroudaki, M. I., Watson, N. J., Ferrari, R., Nchari, L. N., & Gomes, R. L. (2022). Energy management for a net zero dairy supply chain under climate change. Trends in Food Science and Technology, 126, 153-167. https://doi.org/10.1016/j.tifs.2022.01.015 Background: The dairy industry requires substantial energy resources at all stages of production and supply to meet consumer needs in terms of quantity, quality and food safety. The expected future climate change effects will cause serious uncertaint... Read More about Energy management for a net zero dairy supply chain under climate change. From Pollution To Solution: a global assessment of marine litter and plastic pollution (2021) Report McGlade, J., Samy Fahim, I., Green, D., Landrigan, P., Andrady, A., Costa, M., Geyer, R., Gomes, R., Tan Shau Hwai, A., Jambeck, J., Li, D., Rochman, C., Ryan, P., Thiel, M., Thompson, R., Townsend, K., & Turra, A. (2021). From Pollution To Solution: a global assessment of marine litter and plastic pollution. United Nations Environment Programme Outcome from working on the United Nations Environment Programme Advisory Group with the aim to address the UN Environment Assembly’s adopted resolution (UN/EA.4/RES.6) on Marine Plastic Litter and Microplastics by recommending indicators to harmonis... Read More about From Pollution To Solution: a global assessment of marine litter and plastic pollution. Showing 1 - 20 of 66 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}