{
    "url": "https://www.nottingham.ac.uk/engineering/research/impact/research-impact-success-stories/robots.aspx",
    "content": [
        {
            "p": "With 4,500 civil aero engines in service globally and a need to maximise their availability for service, The Rolls-Royce University Technology Centre (UTC) for Manufacturing and On-Wing Technology has developed a new generation of bespoke robots capable of carrying out maintenance without removing engines from the wing. This is no easy feat – aero engines require maintenance to micron-level tolerances, but restricted access to the internal components within a confined, complex and dark engine make in-situ repairs challenging. The solution? A team led by Professor Dragos Axinte has developed robots capable of snaking their way around an on-wing engine to perform in-situ repairs, operating end-effectors at all angles and to precision tolerances. These robots are improving operational efficiency for Rolls-Royce and minimising disruption for air passengers. Based on kinematics modelling and research into calibration methods, advanced actuation, and smart navigation systems, the UTC developed the world’s first teleoperated bore-blending robot, the award-winning REINER. This can carry out complex repairs to engines in remote locations while being controlled by an expert based at Rolls-Royce’s Aircraft Availability Centre in the UK, removing the need for specialist engineers to travel and reducing engine downtime from days to hours. Another development known as FLARE, comprises a pair of snake robots flexible enough to travel through an engine before collaborating to carry out patch repairs to damaged thermal barrier coatings. Explore our Advanced Manufacturing Technology research group Discover our Rolls-Royce University Technology Centre (UTC) for Manufacturing and On-Wing Technology Search for an engineering or architecture expert Access resources to collaborate, innovate and grow your business"
        }
    ],
    "pdf_files": []
}