{
    "url": "https://www.nottingham.ac.uk/engineering/departments/chemenv/facilities.aspx",
    "content": [
        {
            "p": "Follow us on LinkedIn Future-thinking Chemical and Environmental Engineering facilities Get practical experience to be career-ready with fluid mechanics rigs, chemistry labs and more. Please note the exact facilities and equipment you will use depends on your specific course. “Make the most out of your time at Nottingham and utilise all the resources available. You never know what type of opportunity lies ahead of you.” Yousra Hassan – Chemical Engineering MSc graduate (R&D Graduate Program, Henkel) Our range of pilot-scale unit operation rigs are based in our L3 laboratory. These rigs include facilities key to Chemical and Environmental Engineering, such as pumping systems, fluidised beds, large-scale distillation, piping systems, heat exchangers, and batch reactors. You'll focus on laboratory practice, experimental planning, data interpretation and finding and applying technical information and standards. This will extend your understanding of process safety and help further develop professional skills such as teamwork, communication and problem solving. These are all essential skills which are highly sought-after in industry. Our state-of-the-art Chemistry labs are where you'll learn typical wet-chemistry techniques (such as titrations and distillation). You'll use use a range of instruments in hands-on sessions, practicing basic skills and learning how to write lab reports. Health and safety techniques are also a key part of lab work. These labs are used in key modules, including 'Chemistry for Engineers', 'Thermodynamics and Heat Transfer', 'Process Engineering Principles', and 'Fluid Mechanics'. Our research project labs are where our MEng and MSc students carry out their final year design projects, based on a range of topics. You'll have the opportunity to design and implement a project based on a client brief, to solve real-world engineering challenges (such as climate change, food security, biotechnology, plastic pollution, water treatment, waste management and downstream processing). You'll gain real-world experience and develop valuable skills highly sought-after in industry. Access a range of cutting-edge equipment, including Flash Smart Elemental Analyzers, spectrophotometers, and lab scale fermentation systems. You'll be supported by a highly skilled technical team and research groups. Some of the projects are linked to ongoing industrial projects, and you'll have the opportunity to liaise with the industry partner. We have even more facilities for you to take advantage of, including: Visit our campuses in person Explore our virtual campus tour Find Chemical and Environmental Engineering courses"
        }
    ],
    "pdf_files": []
}