{
    "url": "https://www.nottingham.ac.uk/engineering/studentexperience/extra-curricular-opportunities.aspx",
    "content": [
        {
            "p": "The dedicated Student Experience Team, based in the Faculty of Engineering, are here to support students and offer you opportunities to build your skills, enhance your university experience, and meet new people. A number of these opportunities such as peer mentoring and the STEM ambassador scheme can contribute towards the Nottingham Advantage Award. Achieving the award recognises your involvement in extra activities beyond your course. For more information about the Nottingham Advantage Award, visit the NAA website. Outside of your studies, you have the chance to meet new people through societies. Your student union is home to more than 200 societies. These can range from sports, faith, and hobbies to course-based societies. Some of the engineering societies' on offer include: Lego Society, Postgraduate Engineering Society, and Women's Engineering Society. To prepare you for the world of work we are hosting a series of online resources and drop in sessions, to ensure you have the essential skills that employers are looking for, such as comunication or problem solving skills. These will start week commencing Monday 10th October 2022 and finish at the end of February 2023. If you would like to get involved and find out more, please self enrol on our Moodle page here. If you're interested in motorsport, sustainable transport, or are just looking for an opportunity to gets a real-world hands on experience in engineering, why not get involved with our Racing team? The team works to design, build, test and race electric vehicles for Formula Student UK and European competitions. The team were ranked 3rd overall (1st EV) at the UK compeition in 2021. The team is open to all students and has technical and non-technical roles. Our peer mentoring scheme links first year students with students in later years of their course. Peer mentors provide advice and support in a range of different areas to help new students settle into university life. During your time as a student you may be able to apply to study part of your degree at the University of Nottingham Malaysia Campus and University of Nottingham Ningbo Campus. The faculty also has links with a wide ange of partner universities around the world, where you may be able to apply to study, as part of your course. This dedicated fund is there to enhance your student experience. You can apply for funding for events or initiatives that will benefit your experience and the experience of other students. Previously funded initiatives include industrial visits, faculty balls, a group project to build a wind turbine, and wellbeing events. The faculty runs a voluntary scheme called OPAD (Open-source Assistive Devices). Students design devices to help people who have difficulties performing everyday tasks, such as opening jars or buttoning up a shirt. You work in groups, supported by academic staff and PhD students. Volunteers from the public, from care homes, for example, provide feedback on the designs. Student Ambassadors represent the University and the Faculty of Engineering at internal and external events. They share their experiences, inspire the next generation of engineering students, and ensure that visitors to the University receive a high quality and enjoyable experience. By becoming an ambassador, you can build your skills and confidence in speaking and presenting to others. Email us if you have any questions The University of Nottingham University Park Nottingham, NG7 2RD Contacts: Please see our 'Contact us' page"
        }
    ],
    "pdf_files": []
}