{
    "url": "https://www.nottingham.ac.uk/engineering/departments/eee/facilities.aspx",
    "content": [
        {
            "p": "Follow us on LinkedIn Ignite your spark with our Electrical and Electronic Engineering facilities You'll be based right at the centre of our Faculty of Engineering in the Pope and Coates buildings on University Park campus. With a mixture of collaborative teaching and project labs, 'hackspaces', engineering workshops, 3D printing capabilities and project spaces, you’ll have everything you need to excel in your studies. Please note the exact facilities and equipment you will use depends on your specific course. “My time at Nottingham gave me the necessary knowledge and appreciation for engineering which I use today on a day-to-day basis.” Hakeem Dairo – Electrical & Electronic Engineering BEng graduate (Energy Storage Engineer, Jaguar Land Rover) Based in our Pope Building, this is the place where you’ll experiment during our lab weeks, completing your own engineering project. You’ll have access to academics, teaching assistants and technicians, who will support your work and be on hand for any questions you may have. During your first year, you’ll construct an autonomous vehicle complete with an array of sensors. It will have to complete various tasks that you’d expect a car on the road to come up against - a perfect introduction to similar projects that are taking place now within the automobile industry. Developed specifically for Electrical and Electronic Engineering students, you’ll have access to group work facilities (including monitors) to share your work around group desks. You’ll also have access to practical tools required for building your projects and the support needed to complete key tasks. Our electronics workshop supports your lab activities and is the place where you build and tinker with your projects. It’s actively involved in our teaching process, so you’ll get to spend a lot of your time in this practical setting. The electronics workshop will be used throughout your undergraduate journey, and even into any postgraduate studies you decide to pursue. With its 3D printing capabilities and the ability to work on a variety of electronics (including modifying circuit boards, working on control systems and custom build electronics), it's an invaluable resource. Used by third year students, this quieter area is perfect for working on personal projects and doing group work. Full of computers and resources, you’ll be able to complete any work here either alone or in your group without any unnecessary distractions. Students not in their third year can also work here, especially if you want to get out of the hustle and bustle of the collaborative labs. This facility has everything you’ll need to work on your projects without distraction. We have a whole host of other facilities you’ll be able to use. Whether you're completing group work in our design spaces, using our full catalogue of Microsoft software and technical software applications, or delving deeper into one of your projects with designated lab spaces - you’ll have everything you need to excel. Visit our campuses in person Explore our virtual campus tour Find Electrical and Electronic Engineering course"
        }
    ],
    "pdf_files": []
}