{
    "url": "https://www.nottingham.ac.uk/engineering/departments/chemenv/people/academics.aspx",
    "content": [
        {
            "p": "Chemical and Environmental Engineering Follow us on LinkedIn Our leading academics are not just teachers, but also leading researchers who are helping make a greener planet spin a little smoother. Our chemical and environmental engineering experts bring the full package of their skills, knowledge, research expertise and industry experience into their teaching. So you'll get the best possible preparation and insight into your career. Meet some of our academics below and find out about their expertise. You can also view a full list of academics in our Department of Chemical and Environmental Engineering. Vince has coached and mentored 1000s spanning the whole career lifecycle from school to university, executive and board level, and has made it his mission in life to inspire and mentor future generations into STEM, Engineering and Energy careers. He has 40+ years’ of relevant, global business experience incorporating executive management and board positions in blue chip companies including ExxonMobil, Suez, V. Ships, Nalco and P&G and today manages a portfolio career as a consultant in a boutique energy executive search firm, career coach to students at several prestigious UK business schools and trustee/NED positions on several boards including the Women in Engineering Society and other Charities and Trusts in the education sector. Begum has devoted her career to the pursuit of sustainable solutions for environmental challenges. With a wealth of experience in Chemical and Environmental Engineering, Begum is committed to mentoring undergraduate and postgraduate students to become agents of change in the fight against climate change and environmental degradation. Her research has led to significant achievements in green engineering and her students have the opportunity to work on cutting edge projects in her laboratory. Begum is committed to guiding and supporting her students in their academic and professional endeavours. Ellie’s passion for sustainability and the environment is reflected in her innovative research on developing sustainable solutions. She is dedicated to finding new and innovative microwave-based technologies to convert biomass and waste to novel products for the food, pharmaceutical and chemical industries. Ellie’s lab provides an intellectually stimulating environment for undergraduate and postgraduate students interested in sustainability and waste plastics recycling to explore the latest advancements in the field. Ellie is known for her innovative approach to research and teaching, and her commitment to encouraging diversity and inclusivity within the department. George specializes in process engineering and has a track record of working in collaboration with industry. Skilled in the design of microwave heating processes, the dielectric characterisation of materials chemical/biological at microwave frequencies and NDT applications using microwave sensors. Current research involves the development of sensors for real time, in-situ monitoring of chemical and biological systems as well as the design of MW reactors operating in flow to produce novel battery materials. NDT activities using microwave sensors are covering the areas of Food, Pharma, Chemicals, Materials and Composites. Nadia has extensive expertise in materials science and microbial biotechnology, with a particular focus on sustainable and circular economy approaches. Her research interests focus on the development of sustainable biodegradable polymers and bio-based chemicals for the biomanufacturing industry, where sustainable practices are becoming increasingly important in the face of global environmental challenges. Nadia is dedicated to helping her students develop practical and innovative solutions to environmental challenges, aspiring the next generation of engineers, and is committed to promoting a collaborative and inclusive learning environment that fosters creativity and critical thinking. Yanming is an expert in process simulation and optimization, with research interests in areas such reactor design and bioprocess control in the context of industrial biotechnology. He focuses in combining chemical and biological processes to address the challenges of process feasibility and sustainability. Yanming is dedicated to providing his students with a rigorous and stimulating learning environment that prepares them for successful careers in academia or industry with his commitment to excellence inspiring generations of students to pursue careers in chemical engineering. Helena is passionate about remediation and resource recovery from wastewaters and wastes. She has more than ten years of industry experience as an environmental consultant and project manager working on environmental remediation and waste management. Her research has important implications for the chemicals industries move towards a more sustainable and circular economy. Since 2016, she has been organising Soapbox Science events to promote women scientists and their research by allowing them to share their research with the public in an informal setting. As a Teaching & Learning expert, Maryam is focused on understanding the needs and expectations of students and underpin ways to align teaching and tutoring sessions for meeting student expectations. Her research interest is in engineering education. She is leading a project in the Department using Virtual Reality as a tool for active learning and student engagement and she is a webinar organiser for IChemE within the Education Special Interest Group (EdSIG). Fatih is a highly skilled researcher in the Department of Chemical and Environmental Engineering, with expertise in sustainable energy systems, renewable energy, and waste valorization. He is committed to using his knowledge to tackle global environmental challenges and providing his students with practical skills and knowledge that enable them to make a positive impact in their future careers. Gabi’s research is focused on the development of a fundamental understanding of high temperature processing technologies and how these can be transferable and scalable for application in energy and environmental sectors. Her experience working with industrial sponsors has focused on sustainable process intensification with emphasis on the reutilisation and valorisation of wastes to reduce environmental impact including carbon footprint. Additional applications include wastewater treatment, soil remediation, catalyst reformation, energy production, biofuels and additives sectors."
        }
    ],
    "pdf_files": []
}