{
    "url": "https://www.nottingham.ac.uk/engineering/research/impact/research-impact-success-stories/impact-success-stories.aspx",
    "content": [
        {
            "p": "Engineering. Architecture. Design. Our pioneering research is changing the world. We’re one of the leading universities in the UK for translating our engineering and architecture research into real world impact. Our engineers and architects design novel processes, develop revolutionary products and influence policy helping to shape society, boost business, and make a greener planet spin a little smoother. Across transport, healthcare, energy, manufacturing and our cities and environment - we’re pioneering solutions and solving real world challenges. This is the place where we shape the real world. A building airtightness technique, recognised in the UK Building Regulations, to improve the energy efficiency of new and old buildings. Pioneering the use and industrial scale manufacture of metal-organic-frameworks to drive more energy efficient carbon capture for Drax Power Station. Reducing energy consumption in copper extraction by over 20% by using microwave technology to extract copper from its ore. Creating models that underpin five International Aerospace Information Reports on electric power systems used in the aerospace industry. Developing robots for in-situ maintenance of Rolls-Royce aero engines reducing engine maintenance downtime from days to hours. A revolutionary non-destructive imaging technique that can be used during the manufacturing process to assess the microstructure of materials. Helping clinicians make quicker, accurate assessments of burn wounds improving outcomes for paediatric patients. Creating a fully-automated pilot-scale manufacturing process for complex composites shapes for the automotive industry. Wirelessly measuring a baby’s heart rate during resuscitation, using a sensor in a cap, allowing doctors to be hands-free for interventions. Helping European power stations transition safely to non-fossil fuel sources by characterising new renewable fuels. World’s first wearable and wireless foetal monitor improves accuracy in heart rate monitoring during labour reducing unnecessary interventions. Designing self-adapting manufacturing systems for the cost-effective manufacturing of complex, high-value products at low volumes. Creating two innovative high-pressure pyrolysis techniques to characterise organic macromolecules and simulate oil and gas generation. Designing distraction free Human-Machine Interfaces for vehicles to improve safety, driver engagement and driving efficiency. Optimising a copolymer structure for a bacteria resistant urinary catheter coating to create a commercially viable product. Spin-out company Added Scientific are enabling the global commercial exploitation of additive manufacturing. Designing and constructing temporary hospitality pavilions and prestigious exhibitions for art, sport and industry using tensile membranes and cables. Preventing environmental disasters by modelling multiphase flow to validate pipe design models underpinning the oil and gas industry. Using the Dinosaurs of China exhibition in Nottingham to demonstrate the effectiveness of research into enhancing visitors experiential learning. Pioneering calcium phosphate microspheres, with incorporated stem cells, to help reduce osteoporotic fractures and repair bone."
        }
    ],
    "pdf_files": []
}