{
    "url": "https://www.nottingham.ac.uk/engineering/people/pat.wheeler",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR A Hybrid PWM Technique Employing Variable Switching Sequences for Current Ripple Suppression in Dual Three-Phase PMSMs (2024) Journal Article Wang, S., Rivera, M., Golovanov, D., Blissett, J., Moran, J., Davison, P., Ramtharan, G., Gerada, C., & Wheeler, P. (2024). A Hybrid PWM Technique Employing Variable Switching Sequences for Current Ripple Suppression in Dual Three-Phase PMSMs. IEEE Transactions on Industrial Electronics, 1-11. https://doi.org/10.1109/tie.2024.3476911 Dual three-phase electrical machines inherently have lower 6 k ± 1 order harmonic impedance than conventional three-phase machines, particularly in their sensitivity to voltage pulses from a drive in terms of current harmonics. Based on space vector... Read More about A Hybrid PWM Technique Employing Variable Switching Sequences for Current Ripple Suppression in Dual Three-Phase PMSMs. Maximum Efficiency Tracking Control for Omnidirectional Wireless Power Transfer System Based on AdamW Algorithm (2024) Journal Article Chen, Z., Sun, X., Song, W., Wheeler, P., Liu, J., & Ren, B. (2025). Maximum Efficiency Tracking Control for Omnidirectional Wireless Power Transfer System Based on AdamW Algorithm. IEEE Transactions on Power Electronics, 40(3), 4602-4612. https://doi.org/10.1109/tpel.2024.3486048 In order to increase the transmission efficiency of the receiving and transmitting coils of the omnidirectional wireless power transfer (OWPT) system in all-direction wireless transmission, and to reach the system's maximum efficiency output under co... Read More about Maximum Efficiency Tracking Control for Omnidirectional Wireless Power Transfer System Based on AdamW Algorithm. Disturbance‐rejection adjacent vector model predictive control strategy based on extended state observer for EV converter (2024) Journal Article Zhang, J., Cao, Q., Liu, G., Rivera, M., & Wheeler, P. (2024). Disturbance‐rejection adjacent vector model predictive control strategy based on extended state observer for EV converter. IET Power Electronics, 17(15), 2572-2583. https://doi.org/10.1049/pel2.12807 Conventional single-vector model predictive control (MPC) can suffer from low control accuracy, while multi-vector MPC is often criticized for its complexity and heavy computational burden. In order to address these issues, an adjacent vector-based M... Read More about Disturbance‐rejection adjacent vector model predictive control strategy based on extended state observer for EV converter. Study of Constant DC-voltage Control for VIENNA Rectifier under No-load Condition (2024) Journal Article Song, W., Yang, Y., Du, M., & Wheeler, P. (2024). Study of Constant DC-voltage Control for VIENNA Rectifier under No-load Condition. IEEE Transactions on Transportation Electrification, https://doi.org/10.1109/TTE.2024.3469173 VIENNA rectifier has emerged as a promising topology for ac-dc power converter, but it has the problem of the dc-link output voltage surge under no-load condition. In this paper, a high reliability hardware auxiliary circuit and an easy-implement sof... Read More about Study of Constant DC-voltage Control for VIENNA Rectifier under No-load Condition. Current Measurement Errors Compensation Based on Current Ripple Component Decoupling for PMSM Drives (2024) Journal Article Dan, H., Pang, H., Liu, Y., Sun, Y., Su, M., Rivera, M., & Wheeler, P. (2024). Current Measurement Errors Compensation Based on Current Ripple Component Decoupling for PMSM Drives. IEEE Journal of Emerging and Selected Topics in Power Electronics, https://doi.org/10.1109/JESTPE.2024.3468388 Current measurement errors (CME) including offset error and scaling error exist in permanent magnet synchronous motor drive systems. It will cause periodic ripples in the dq-axis currents and motor torque/speed. Thus, this paper proposes a novel meth... Read More about Current Measurement Errors Compensation Based on Current Ripple Component Decoupling for PMSM Drives. Online Harmonic Reduction for Aircraft Electrical Power Distribution System With Global Phase-Shifted Carrier PWM (2024) Journal Article Peng, Q., Sun, J., Yang, J., Buticchi, G., Guenter, S., Tan, N. M., & Wheeler, P. (2025). Online Harmonic Reduction for Aircraft Electrical Power Distribution System With Global Phase-Shifted Carrier PWM. IEEE Transactions on Power Electronics, 40(1), 599-610. https://doi.org/10.1109/TPEL.2024.3467691 The penetration rate of power electronics converters (PEC) within onboard electrical power distribution systems (EPDS) has been rising for years due to the trend of moving towards more electric aircraft (MEA) and all electric aircraft (AEA). Digital... Read More about Online Harmonic Reduction for Aircraft Electrical Power Distribution System With Global Phase-Shifted Carrier PWM. Predictive Voltage Control in Multi-Modular Matrix Converters under Load Variation and Fault Scenario (2024) Journal Article Caballero, D., Toledo, S., Maqueda, E., Ayala, M., Gregor, R., Rivera, M., & Wheeler, P. (2024). Predictive Voltage Control in Multi-Modular Matrix Converters under Load Variation and Fault Scenario. Technologies, 12(9), Article 170. https://doi.org/10.3390/technologies12090170 This paper presents a model predictive control (MPC) strategy to regulate output voltages in a multi-modular matrix converter topology for isolated loads. The converter system harnesses power from a six-phase permanent magnet synchronous generator (P... Read More about Predictive Voltage Control in Multi-Modular Matrix Converters under Load Variation and Fault Scenario. On Optimized Modulation Strategies for Electric Vehicle Integrated On-board Chargers (2024) Journal Article Kougioulis, I., Zanchetta, P., Wheeler, P., & Ahmed, M. R. (2024). On Optimized Modulation Strategies for Electric Vehicle Integrated On-board Chargers. IEEE Transactions on Industry Applications, https://doi.org/10.1109/TIA.2024.3463610 Integration of the on-board charger (OBC) and auxiliary power module (APM) in electric vehicles (EVs) can reduce the overall weight, volume and cost of the on-board charging system, as well as increase efficiency. This paper proposes optimized modula... Read More about On Optimized Modulation Strategies for Electric Vehicle Integrated On-board Chargers. A Low-Complexity Modulated Model Predictive Current Control Scheme for PMSM based Starter Generator Control System in More Electric Aircraft (2024) Preprint / Working Paper Wang, Q., Yu, H., Li, C., Yeoh, S. S., Lang, X., Yang, T., Rivera, M., Bozhko, S., & Wheeler, P. A Low-Complexity Modulated Model Predictive Current Control Scheme for PMSM based Starter Generator Control System in More Electric Aircraft Modulated model predictive control (M2PC) has recently emerged as a possible solution for control in starter generator systems in the more electric aircraft (MEA), due to its advantages of fixed switching frequency, fast response and good performance... Read More about A Low-Complexity Modulated Model Predictive Current Control Scheme for PMSM based Starter Generator Control System in More Electric Aircraft. A Systematic Literature Review on AC Microgrids (2024) Journal Article Gomez-Redondo, M., Rivera, M., Muñoz, J., & Wheeler, P. (2024). A Systematic Literature Review on AC Microgrids. Designs, 8(4), Article 77. https://doi.org/10.3390/designs8040077 The objective of this work is to analyze and compare AC microgrid (ACMG) solutions to introduce the topic to new researchers. The methodology used to achieve this goal is a systematic literature review using five questions: (1) How have ACMGs evolved... Read More about A Systematic Literature Review on AC Microgrids. Energy Harvesting Integrated Sensor Node Architecture for Sustainable IoT Networks (2024) Presentation / Conference Contribution Gopikrishnan, S., Kokila, M., Rivera, M., & Wheeler, P. (2024, January). Energy Harvesting Integrated Sensor Node Architecture for Sustainable IoT Networks. Presented at 5th International Conference on Advances in Distributed Computing and Machine Learning (ICADCML)-2024, VIT-AP University, India Internet of Things (IoT) is a life changing technology which is build on various devices which are connected to the Internet. Wireless sensor nodes (WSN) is one of such devices which plays a major role in deploying IoT in large scale of real-time eve... Read More about Energy Harvesting Integrated Sensor Node Architecture for Sustainable IoT Networks. Virtual Synchronous Generator Control Strategy of Grid-Forming Matrix Converter for Renewable Power Generation (2024) Journal Article Zhang, J., Wang, H., Liu, G., Tian, G., Rivera, M., & Wheeler, P. (2024). Virtual Synchronous Generator Control Strategy of Grid-Forming Matrix Converter for Renewable Power Generation. IEEE Access, 12, 106672-106684. https://doi.org/10.1109/ACCESS.2024.3436552 Matrix converters (MC) have been considered for applications in renewable power generation and microgrids. However, similar to other power electronic converter-interfaced power generation systems, the MC-interfaced system cannot provide inertia or da... Read More about Virtual Synchronous Generator Control Strategy of Grid-Forming Matrix Converter for Renewable Power Generation. Low Output Current Ripple Ultra High Step-Down Two-Phase Buck Converter With Low Switching Losses (2024) Journal Article Ghamsari Esfahani, A., Sadeghi, M., Adib, E., Wheeler, P., Ali Khan, A., & Jamil, M. (2024). Low Output Current Ripple Ultra High Step-Down Two-Phase Buck Converter With Low Switching Losses. IEEE Transactions on Industrial Electronics, https://doi.org/10.1109/TIE.2024.3426035 This article introduces a new two-switch step-down dc–dc converter. By integrating Valley-Fill circuit with coupled inductors, and using the cross-coupled inductor technique, the proposed converter achieves a substantial reduction in the output curre... Read More about Low Output Current Ripple Ultra High Step-Down Two-Phase Buck Converter With Low Switching Losses. On the Synchronous Reference Frame Impedance and Stability Characteristics of More Electric Aircraft Electrical Power Distribution Systems (2024) Journal Article Peng, Q., Yang, J., Guenter, S., Buticchi, G., Tan, N. M. L., & Wheeler, P. (2024). On the Synchronous Reference Frame Impedance and Stability Characteristics of More Electric Aircraft Electrical Power Distribution Systems. IEEE Transactions on Transportation Electrification, 1-1. https://doi.org/10.1109/tte.2024.3433617 In modern aviation electrical power distribution system (EPDS), power electronics converters (PECs) are gaining more prominence, providing a fully-controlled interface between different electrical equipment. In the context of utility ac electrical po... Read More about On the Synchronous Reference Frame Impedance and Stability Characteristics of More Electric Aircraft Electrical Power Distribution Systems. Multi-objective sequential model predictive control for high-power railway induction motor application (2024) Presentation / Conference Contribution Araya, B., Rivera, M., Restrepo, C., Wheeler, P., & Zerdali, E. (2024, June). Multi-objective sequential model predictive control for high-power railway induction motor application. Presented at 13th International Conference on Power Electronics, Machines and Drives (PEMD 2024), Nottingham, England Model Predictive Control (MPC) has demonstrated its effectiveness in several industrial applications, but it grapples with weighting factor (WF) tuning challenges. This paper presents a comparative analysis between conventional MPC and Sequential MPC... Read More about Multi-objective sequential model predictive control for high-power railway induction motor application. Optimized model predictive control with reduced switching states for neutral point clamped converters (2024) Presentation / Conference Contribution Kadhum, H. T., Khera, F., Xie, J., Marco, R., Watson, A. J., Zanchetta, P., & Wheeler, P. (2024, June). Optimized model predictive control with reduced switching states for neutral point clamped converters. Presented at 13th International Conference on Power Electronics, Machines and Drives (PEMD 2024), Nottingham, England The implementation of multilevel converters, particularly the Neutral-Point Clamped (NPC) converter, has risen in modern power electronics owing to its ability to enhance power quality and voltage levels. Model Predictive Control (MPC) has emerged as... Read More about Optimized model predictive control with reduced switching states for neutral point clamped converters. Sequential direct speed predictive control without weighting factors (2024) Presentation / Conference Contribution Zerdali, E., Kilic, C., Riccio, J., Rivera, M., & Wheeler, P. (2024, June). Sequential direct speed predictive control without weighting factors. Presented at 13th International Conference on Power Electronics, Machines and Drives (PEMD 2024), Nottingham, UK Direct speed predictive control (DSPC) provides fast dynamic control with a better disturbance rejection capability but suffers from weighting factor selection. This paper proposes a sequential DSPC without weighting factors for permanent magnet sync... Read More about Sequential direct speed predictive control without weighting factors. Weighting factor-free direct speed predictive control with improved transient performance (2024) Presentation / Conference Contribution Zerdali, E., Riccio, J., Rivera, M., & Wheeler, P. (2024, June). Weighting factor-free direct speed predictive control with improved transient performance. Presented at 13th International Conference on Power Electronics, Machines and Drives (PEMD 2024), Nottingham, England Direct predictive speed control (DSPC) of a permanent magnet synchronous motor (PMSM) offers a non-cascaded control scheme with a fast dynamic response and better disturbance rejection ability. However, similar to other direct model predictive contro... Read More about Weighting factor-free direct speed predictive control with improved transient performance. Matrix converter based compensator for unbalance mitigation in traction system (2024) Presentation / Conference Contribution Kurati, J. S., Mir, T. N., Wheeler, P. W., & Rivera, M. (2024, June). Matrix converter based compensator for unbalance mitigation in traction system. Presented at 13th International Conference on Power Electronics, Machines and Drives (PEMD 2024), Nottingham. UK Modern AC Electric trains are designed as single-phase loads and are operated on the three-phase utility grid which causes load asymmetry and leads to unbalanced current flow in the three-phase grid. Several traction unbalance compensators have been... Read More about Matrix converter based compensator for unbalance mitigation in traction system. An apparent inductance online identification for sensorless control of permanent magnet synchronous motor (2024) Journal Article Yang, G., Weizhang, S., Wheeler, P., & Yang, Y. (2024). An apparent inductance online identification for sensorless control of permanent magnet synchronous motor. Electronics Letters, 60(11), Article e13233. https://doi.org/10.1049/ell2.13233 The model‐based sensorless control of permanent magnet synchronous motor (PMSM) relies on the motor parameters. In practice, the considerable uncertainty of inductance and the difference between the apparent inductance and the incremental inductance... Read More about An apparent inductance online identification for sensorless control of permanent magnet synchronous motor. Showing 1 - 20 of 532 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}