{
    "url": "https://www.nottingham.ac.uk/engineering/research/areas/sustainable-cities/index.aspx",
    "content": [
        {
            "p": "Follow us on LinkedIn This is the place where we design the places of tomorrow. Our experts are pioneering new technologies to decarbonise our buildings and help establish a circular economy to protect the environment. We’re turning research into reality to help solve real world challenges including: Our transformative research is addressing the United Nations Sustainable Development Goals and shaping the real world. Our research also informs our courses, from undergraduate and masters degrees, to PhDs. Kenyan clean energy hubs Improving access to reliable and affordable energy in low-income communities in Nairobi by transforming schools into green energy hubs to generate, store, and distribute renewable energy. \"Our research is reviewing how we can retrofit our homes, looking at cost effective and efficient methods to reduce energy consumption.\" — Dr Lorna Kiamba Our research shapes society and boosts business. Discover more of our research impact stories. A building airtightness technique, recognised in the UK Building Regulations, to improve the energy efficiency of new and old buildings. Preventing environmental disasters by modelling multiphase flow to validate pipe design models underpinning the oil and gas industry. Designing and constructing temporary hospitality pavilions and prestigious exhibitions for art, sport and industry using tensile membranes. Reducing energy consumption in copper extraction by over 20% by using microwave technology to extract copper from its ore. Using the Dinosaurs of China exhibition in Nottingham to demonstrate the effectiveness of research principles developed to enhance visitors experiential learning. We work across a range of research areas within sustainable cities and environment. Melissa is investigating the extent and impact of plastic pollution on water quality and services. Search for an engineering or architecture expert Access resources to collaborate, innovate and grow your business"
        }
    ],
    "pdf_files": []
}