{
    "url": "https://www.nottingham.ac.uk/engineering/departments/civeng/facilities.aspx",
    "content": [
        {
            "p": "Follow us on LinkedIn Create the structures of the future with our Civil Engineering facilities Our civil engineering department has an amazing range of facilities, providing our students with both practical learning so they can see how their studies translate to the field and into the office. With geotechnics and fluid mechanics labs, wind tunnels, CAD, our strong floor, and our road materials testing facility, you’ll be able to start building your future now. Please note the exact facilities and equipment you will use depends on your specific course. “While I specialise in bridge engineering now, the degree at Nottingham has given me a good understanding of other disciplines including geotechnical, transport planning and hydraulics. Learning and understanding the core principles helps when collaborating with other engineers.” Mark Cox – Civil Engineering MEng graduate (Senior Bridge Engineer, AECOM) The Nottingham Asphalt Tester (NAT) is a piece of equipment which is used in the largest road materials testing facility in a UK university. The NAT is a fundemental tool used in asphalt design and specification, as well as research. Ideal for project work, including future-thinking projects, contributing to developing and improving environmentally friendly ‘cold-mix’ asphalt. This pioneering piece of kit was developed by University of Nottingham researchers and has become an industry standard tool for evaluating the properties of asphalt. You’ll be introduced to this on your 'Highway & Pavement Design' module and if you select a related final year project then this is when you'll get the opportunity to use it. Our Broadbent geotechnical centrifuge is one of only a handful in the UK and tests geotechnical (soil) designs at high stress levels by increasing the effective gravity. If you do an individual geotechnical project, you may use it during your final year of studies. It sits within the Nottingham Centre for Geomechanics laboratories, one of the best equipped geotechnical laboratories in any university in the UK. The geotechnical centrifuge enables greater understanding of the merits of prototype testing in geotechnical engineering and the impact of stress on overall soil behaviour. There are even more facilities to take advantage of. With specialist equipment for testing a range of materials in different environments, you'll be well-set to start building your civil engineering career with us. Dedicated teaching labs for structures, geotechnics and fluid mechanics Design studios, Building Information Modelling and CAD Leading-edge GPS, surveying and laser scanning equipment Wind tunnels and earthquake simulators Strong floor facility for major structural testing Visit our campuses in person Explore our virtual campus tour Find Civil Engineering courses"
        }
    ],
    "pdf_files": []
}