{
    "url": "https://www.nottingham.ac.uk/Engineering/Campaigns/careers.aspx",
    "content": [
        {
            "p": "Engineering. Architecture. Design. This is the place where extraordinary careers start. We believe that great minds don't think alike. Here you get the space, support, skills and connections that mean you'll be highly sought after by top employers. Get ready to shape the real world in your chosen career. We open doors that set you on the right path, thanks to our: We've got the keys to unlock to your dream job. The sky’s the limit for engineering and architecture graduates. Our Faculty of Engineering graduates go on to secure jobs in a range of companies including: Rolls Royce, Atkins, AECOM, ARUP, Mott McDonald, PWC, Siemens, WSP, EPR Architects, Jaguar Land Rover and many more. Graduates also work in a range of different sectors including: Advanced Manufacturing, Architecture, Food & Drink, Fast Moving Consumer Goods (FMCG), Aerospace, Automotive, Infrastructure, Renewable Energy, Technology Consulting and multidisciplinary global engineering consultancies. \"The employability and placements teams were great for helping me find a graduate placement, answering all my questions and getting me job-ready for after my studies.\" Abdulquadri Ademakinwa, Architecture and Environmental Design MArch Whether you know what you want to do in the future or not, the Careers team will support you every step of the way with personalised advice. We'll help you discover a world of possibilities. We also have a range of events and schemes to support you to be highly employable, including: Watch our video to find out how we’ll support your career from day one. Get information on study abroad and industrial placements course options. Find out how our university’s Careers and Employability Service can help you. 'Our guide to your career' resource Visit our campuses in person Read about engineering and architecture departments Find a course or PhD Multi-disciplinary research impact"
        }
    ],
    "pdf_files": []
}