{
    "url": "https://www.nottingham.ac.uk/engineering/departments/foundationyear/student-profile.aspx",
    "content": [
        {
            "p": "By studying a foundation year students are able to strengthen skills, knowledge and confidence before progress on to year one of an honour's degree. I came from Egypt and completed my foundation year in 2017. Following this, I went on to study MEng Electronic and Computer Engineering, graduating in 2021. I spent a semester studying abroad at the Polytechnic University of Hong Kong as well as completing a summer internship at Bank of America during my studies. Following a successful summer internship, I now works as a Graduate Technology Analyst for the Bank of America. I initially wanted to study computer science but whilst on the FEPS programme, I became interested in Maths, so I decided to pursue a course that combined computing and maths. Make the most out of your foundation year because you are getting a head start. Join societies and expand your social network as much as you can. As a mature student, I hadn’t studied maths or science since my GCSEs. This put me at a disadvantage compared to other students commencing their engineering degrees, and I was quite nervous when I first embarked on this venture. However, the foundation year provided me with everything I needed and more, to make sure I had the ability and confidence to enter the first year. This year provided solid foundations to begin my engineering career, building strong relationships initially with undergraduates and lecturers. This presented me with a wealth of opportunities I didn’t expect to experience. The course covered a broad range of modules, allowing students to realise their strengths and main interests, thus allowing them to pursue the most suitable engineering discipline. Throughout my degree, I was sponsored by the huge multinational company Siemens and upon graduation, went to work for them as a Project Engineer in their Large Drives Division in Manchester, UK where I have gone on to become a Chartered Engineer. I completed my previous education in Brazil so the Foundation course was a great transition to the UK education system. The course certainly prepared me well to do the engineering degree. In my final year, I worked at Airbus UK for four months, developing my Masters project which resulted in the publication of my work ‘Improvement of Planning and Tracking of Technology Maturity Development with Focus on Manufacturing Requirements’. I was also a finalist in the npower Future Young Leaders of the Year competition 2012. After my degree, I changed focus and joined an investment banking company in New York City, USA and I now works as a highly paid investment banking analyst at the investment banking division of INTL FCStone Securities Inc. I undertook the Foundation Year in 2006 and progressed to an MEng in Mechanical Design, Materials and Manufacture in 2007, graduating in 2011. I am now a Chartered Engineer and works as a Composite Design Engineer for the Lotus Formula One team. The foundation year prepared me in many ways for my MEng in Mechanical Design, Materials and Manufacture. As well as getting me up to speed with the maths and physics required, it gave me very useful knowledge as to how I should tackle university life. Basically it felt like I hit the ground running when I started my first year. The University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}