{
    "url": "https://www.nottingham.ac.uk/engineering/research/areas/sustainable-energy/index.aspx",
    "content": [
        {
            "p": "Follow us on LinkedIn This is the place helping make a greener planet spin a little smoother. Our experts are pioneering decarbonisation trials and developing green fuels for the energy transition. We’re turning research into reality to help solve real world challenges including: Our transformative research is addressing the United Nations Sustainable Development Goals and shaping the real world. Our research also informs our courses, from undergraduate and masters degrees, to PhDs. Embedded motor drive technologies Pioneering embedding Variable Frequency Drive technology within industrial motors enabling the motor to be driven at optimum speed, generating significant energy savings and reducing carbon dioxide emissions at a much lower cost. \"We’re leading the world’s largest trial to evaluate the viability of biochar, a material to store carbon from the atmosphere.\" — Dr Will Meredith Our research shapes society and boosts business. Discover more of our research impact stories. Helping European power stations transition safely to non-fossil fuel sources by characterising new renewable fuels. Pioneering the use and industrial scale manufacture of metal-organic-frameworks to drive more energy efficient carbon capture for Drax Power Station. Creating two innovative high-pressure pyrolysis techniques to characterise organic macromolecules and simulate oil and gas generation. Reducing energy consumption in copper extraction by over 20% by using microwave technology to extract copper from its ore. We work across a range of research areas within sustainable energy. Rajiv is investigating the influence of the solar spectrum on solar panel performance and incorporating these effects into models to forecast solar panel output. Cheryl is developing novel lifecycle assessment models to assess the natural resource and environmental implications of deploying hydrogen-fuelled vehicles - light and heavy duty - in the UK. Search for an engineering or architecture expert Access resources to collaborate, innovate and grow your business"
        }
    ],
    "pdf_files": []
}