{
    "url": "https://www.nottingham.ac.uk/engineering/people/d.gerada",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR PDIV Modeling for Rectangular Wire Turn-to-Turn Insulation of Inverter-Fed Motors at Different Cruising Altitudes (2024) Presentation / Conference Contribution Naderiallaf, H., Gerada, C., Degano, M., & Gerada, D. (2024, September). PDIV Modeling for Rectangular Wire Turn-to-Turn Insulation of Inverter-Fed Motors at Different Cruising Altitudes. Presented at 2024 International Conference on Electrical Machines (ICEM), Torino, Italy This study develops a predictive model for partial discharge inception voltage (PDIV) in turn-to-turn insulation of form-wound windings for inverter-fed motors considering a range of altitudes, from ground to cruise levels. Emphasis is placed on the... Read More about PDIV Modeling for Rectangular Wire Turn-to-Turn Insulation of Inverter-Fed Motors at Different Cruising Altitudes. Design Strategies for Scalable and Modular Aerospace Electrical Machines (2024) Presentation / Conference Contribution Darmani, M. A., Murataliyev, M., Gerada, D., & Gerada, C. (2024, September). Design Strategies for Scalable and Modular Aerospace Electrical Machines. Presented at 2024 International Conference on Electrical Machines (ICEM), Torino, Italy In his study, innovative design approaches for scalable and modular inverter-fed electrical machines, tailored for aerospace applications, are explored with the primary goal of achieving unparalleled power density within powertrain systems. Three dis... Read More about Design Strategies for Scalable and Modular Aerospace Electrical Machines. Mechanical properties and insulation damage of PMSG stator end windings with eccentricity considerations (2024) Journal Article Dai, D. R., He, Y. L., Xu, M. X., Zhang, W., Fu, Z. X., & Gerada, D. (2024). Mechanical properties and insulation damage of PMSG stator end windings with eccentricity considerations. Alexandria Engineering Journal, 105, 156-169. https://doi.org/10.1016/j.aej.2024.06.090 The mechanical properties and insulation damage of stator end windings in permanent magnet synchronous generator (PMSG) are investigated by theoretical analysis, finite element analysis (FEA) and experiment verification. First, a theoretical model of... Read More about Mechanical properties and insulation damage of PMSG stator end windings with eccentricity considerations. Investigation on the torsional property of hybrid composite/metal shafts at different service temperatures: Experimental and analytical study (2024) Journal Article Qi, W., Xu, Z., Wan, Y., Gerada, D., & Gerada, C. (2024). Investigation on the torsional property of hybrid composite/metal shafts at different service temperatures: Experimental and analytical study. Polymer Composites, 45(12), 11266-11275. https://doi.org/10.1002/pc.28564 Torsional tests were conducted to investigate the influence of service temperature on torsional property of composite/steel hybrid structures. In the experiment, two types of lightweight hybrid composite‐metal shafts were tested at both room temperat... Read More about Investigation on the torsional property of hybrid composite/metal shafts at different service temperatures: Experimental and analytical study. PM Synchronous Motor with an Integrated Common-Mode Voltage Filter Considering Parasitic Capacitance Distribution (2024) Presentation / Conference Contribution Zhang, J., Zhang, X., Gu, C., Li, J., Ji, Y., Wang, H., Zhao, H., & Gerada, D. (2024, May). PM Synchronous Motor with an Integrated Common-Mode Voltage Filter Considering Parasitic Capacitance Distribution. Presented at 7th IEEE International Electrical and Energy Conference (CIEEC 2024), Harbin, China The common-mode voltage (CMV) arises from the simultaneous imbalance in the three-phase voltage output of the inverter. It is coupled with parasitic capacitance within the machine structure, which is related to the physical structure of the machine.... Read More about PM Synchronous Motor with an Integrated Common-Mode Voltage Filter Considering Parasitic Capacitance Distribution. A Review of Carbon Emissions from Electrical Machine Materials (2024) Journal Article Zhang, X., Gerada, D., Xu, Z., Zhang, F., & Gerada, C. (2024). A Review of Carbon Emissions from Electrical Machine Materials. Electronics, 13(9), Article 1714. https://doi.org/10.3390/electronics13091714 As the world embarks on a global mission to tackle climate change, reducing carbon represents a key challenge given the escalating global warming. The U.K. is among many other nations that are determined to decarbonise all sectors and strive to achie... Read More about A Review of Carbon Emissions from Electrical Machine Materials. Analysis of Proximity Loss of Electrical Machines Using Mesh-Based Magnetic Equivalent Circuit (2024) Journal Article Yuan, Y., Ahmadi Darmani, M., Bao, Y., Zhang, X., Gerada, D., & Zhang, H. (2024). Analysis of Proximity Loss of Electrical Machines Using Mesh-Based Magnetic Equivalent Circuit. IEEE Transactions on Transportation Electrification, https://doi.org/10.1109/TTE.2024.3383845 In high power density machines, proximity loss presents an unavoidable obstacle due to its significant impact on thermal dissipation and insulation aging. To address the need for rapid and accurate proximity loss prediction, this study presents a nov... Read More about Analysis of Proximity Loss of Electrical Machines Using Mesh-Based Magnetic Equivalent Circuit. Fillet Radius Impact of Rectangular Insulated Wires on PDIV for Turn-to-Turn Insulation of Inverter-Fed Motors (2024) Journal Article Naderiallaf, H., Degano, M., Gerada, C., & Gerada, D. (2024). Fillet Radius Impact of Rectangular Insulated Wires on PDIV for Turn-to-Turn Insulation of Inverter-Fed Motors. IEEE Transactions on Dielectrics and Electrical Insulation, 31(4), 2084-2093. https://doi.org/10.1109/tdei.2024.3355032 This contribution elucidates the impact of the fillet radius, a geometric feature of rectangular insulated wires not commonly considered, on the partial discharge inception voltage (PDIV) in low-voltage machine turn-to-turn winding insulation. Initia... Read More about Fillet Radius Impact of Rectangular Insulated Wires on PDIV for Turn-to-Turn Insulation of Inverter-Fed Motors. Accurate FEA Modeling Approach for Calculating AC Copper Loss for Random Windings (2023) Presentation / Conference Contribution Dave, N., Gerada, D., Langlois, P., Lawton, A., Patel, R., & Gerada, C. (2023, November). Accurate FEA Modeling Approach for Calculating AC Copper Loss for Random Windings. Presented at 2023 26th International Conference on Electrical Machines and Systems (ICEMS), Zhuhai, China With increased interest in transportation electrification, the accurate modelling and analysis technique of AC copper loss plays a crucial role in the design. The distributed wound stator is dominant in electric car motors due to their suitable chara... Read More about Accurate FEA Modeling Approach for Calculating AC Copper Loss for Random Windings. Comparative Study on Stranded and Hairpin Windings for 350kW EV Traction Motor (2023) Presentation / Conference Contribution Jiang, J., Zou, T., Rocca, S. L., Gerada, D., & Gerada, C. (2023, November). Comparative Study on Stranded and Hairpin Windings for 350kW EV Traction Motor. Presented at 2023 26th International Conference on Electrical Machines and Systems (ICEMS), Zhuhai, China Hairpin winding is a key technology for traction motors to meet the step-change requirements on power density and efficiency in electrical vehicle (EV) industry. This winding solution features inherently high slot fill factor and improved heat dissip... Read More about Comparative Study on Stranded and Hairpin Windings for 350kW EV Traction Motor. A Taguchi-LHS-RSM Double-Staged Approach for Design Optimization of Self-Ventilated Cooling Systems Utilized in PMSMs (2023) Presentation / Conference Contribution Zhu, G., Xu, Z., Zhang, F., Gerada, C., & Gerada, D. (2023, November). A Taguchi-LHS-RSM Double-Staged Approach for Design Optimization of Self-Ventilated Cooling Systems Utilized in PMSMs. Presented at 26th International Conference on Electrical Machines and Systems (ICEMS), Zhuhai, China Thermal management is critical for high-power-density permanent magnet synchronous machines (PMSMs). To realize the efficient and effective design optimization of self-ventilated air cooling systems for PMSMs, in this paper, a Taguchi-preconditioned... Read More about A Taguchi-LHS-RSM Double-Staged Approach for Design Optimization of Self-Ventilated Cooling Systems Utilized in PMSMs. Design of Hairpin Winding and Random Winding Stators for High Speed Heavy-Duty Traction Motor (2023) Presentation / Conference Contribution Jiang, J., Zou, T., La Rocca, A., La Rocca, S., Liu, C., Xu, Z., Gerada, C., Zhu, S., Paciura, K., & Gerada, D. (2023, October). Design of Hairpin Winding and Random Winding Stators for High Speed Heavy-Duty Traction Motor. Presented at 2023 IEEE Vehicle Power and Propulsion Conference (VPPC), Milan, Italy Hairpin winding with rectangularly shaped conductors are gradually replacing random winding wound with stranded wires in electric vehicle (EV) industry. As the newgeneration winding technology, hairpin winding features high electromagnetic and therma... Read More about Design of Hairpin Winding and Random Winding Stators for High Speed Heavy-Duty Traction Motor. Experimental Simulation and Electromechanical Characterization of Dynamic Air Gap Eccentricity Faults in PMSG (2023) Journal Article He, Y., Dai, D., Xu, M., Zhang, W., Liu, X., Li, Y., Xing, Y., Zheng, W., & Gerada, D. (2023). Experimental Simulation and Electromechanical Characterization of Dynamic Air Gap Eccentricity Faults in PMSG. IEEJ Transactions on Electrical and Electronic Engineering, 18(12), 1903-1913. https://doi.org/10.1002/tee.23924 This paper presents a designed experimental simulation scheme for dynamic air gap eccentricity (DAGE) faults in permanent magnet synchronous generator (PMSG), along with the testing of their electromechanical characteristics. Unlike previous studies,... Read More about Experimental Simulation and Electromechanical Characterization of Dynamic Air Gap Eccentricity Faults in PMSG. Analysis on Rotor Vibration Characteristics under Dynamic Rotor Interturn Short Circuit Fault in Synchronous Generators (2023) Journal Article He, Y., Jiang, M., Sun, K., Qiu, M., & Gerada, D. (2023). Analysis on Rotor Vibration Characteristics under Dynamic Rotor Interturn Short Circuit Fault in Synchronous Generators. Energies, 16(18), Article 6585. https://doi.org/10.3390/en16186585 A dynamic rotor interturn short circuit fault may occur during synchronous generator operation. However, there is no method to analyze the generator’s characteristics under the dynamic rotor interturn short circuit fault and identify the fault. In or... Read More about Analysis on Rotor Vibration Characteristics under Dynamic Rotor Interturn Short Circuit Fault in Synchronous Generators. Research on the Effect of Heat Pipe Inclination Angle on Temperature Distribution in Electrical Machines (2023) Journal Article Zhao, H., Zhang, X., Li, J., Zhang, F., Zhang, Y., Yan, H., Zhu, X., Niu, Z., & Gerada, D. (2023). Research on the Effect of Heat Pipe Inclination Angle on Temperature Distribution in Electrical Machines. IEEE Transactions on Industry Applications, 59(6), 6745-6755. https://doi.org/10.1109/tia.2023.3310977 Due to high equivalent thermal conductivity with lightweight and small size, heat pipes (HPs) are being extensively applied in the motor cooling system to improve its thermal performance. However, when practically installed in electrical machines, th... Read More about Research on the Effect of Heat Pipe Inclination Angle on Temperature Distribution in Electrical Machines. Parameter study for oil spray cooling on endwindings of electric machines via Eulerian–Lagrangian simulation (2023) Journal Article Zhao, A., Duwig, C., Liu, C., Gerada, D., & Leksell, M. (2023). Parameter study for oil spray cooling on endwindings of electric machines via Eulerian–Lagrangian simulation. Applied Thermal Engineering, 235, Article 121281. https://doi.org/10.1016/j.applthermaleng.2023.121281 The demand for larger power density and torque for the power traction motors used in electrified transportation puts forward a requirement for better thermal management methods. Spray cooling is a promising direct liquid cooling technique that has be... Read More about Parameter study for oil spray cooling on endwindings of electric machines via Eulerian–Lagrangian simulation. Analytical Calculation and Experimental Validation of Litz Wires Axial Thermal Conductivity (2023) Journal Article Li, Z., Xu, Z., Zhang, F., Gerada, D., Guo, R., Zhang, H., Corfield, M., Gerada, C., & Zhang, C. (2024). Analytical Calculation and Experimental Validation of Litz Wires Axial Thermal Conductivity. IEEE Transactions on Transportation Electrification, 10(1), 1167-1179. https://doi.org/10.1109/TTE.2023.3262766 Litz wires are widely used in electrical machines with reduced AC losses, compared to traditional random winding. The reduced AC losses can improve both electrical machines electromagnetic performance, such as efficiency and thermal performance. Ther... Read More about Analytical Calculation and Experimental Validation of Litz Wires Axial Thermal Conductivity. Heat Pipe Bending Effect on Cooling Effectiveness in Electrical Machines (2023) Journal Article Zhao, H., Zhang, X., Li, J., Wang, H., Zhang, F., Zhang, H., Zhu, X., & Gerada, D. (2023). Heat Pipe Bending Effect on Cooling Effectiveness in Electrical Machines. IEEE Transactions on Energy Conversion, 38(3), 2011-2021. https://doi.org/10.1109/tec.2023.3249971 Heat pipes(HPs) are being extensively explored in motor cooling scenarios for enhanced cooling capacity. HPs are commonly bent to adapt to the compact structure of electrical machines, whereas the bending effect on motor cooling effectiveness still r... Read More about Heat Pipe Bending Effect on Cooling Effectiveness in Electrical Machines. Experimental Investigation of Heat Pipe Inclination Angle Effect on Temperature Nonuniformity in Electrical Machines (2022) Journal Article Zhang, X., Zhao, H., Li, J., Zhang, F., Zhang, Y., Yan, H., Niu, Z., Gerada, D., & Zhang, H. (2023). Experimental Investigation of Heat Pipe Inclination Angle Effect on Temperature Nonuniformity in Electrical Machines. Energies, 16(1), Article 350. https://doi.org/10.3390/en16010350 Heat pipes (HPs) are gaining increasing popularity in the propulsion motors of transportation electrification due to their remarkable thermal properties. However, the inclination angle affects the HP thermal performance and, thus, results in temperat... Read More about Experimental Investigation of Heat Pipe Inclination Angle Effect on Temperature Nonuniformity in Electrical Machines. Analysis of Stator Vibration Characteristics in Synchronous Generators Considering Inclined Static Air Gap Eccentricity (2022) Journal Article He, Y.-L., Li, Y., Zhang, W., Xu, M.-X., Bai, Y.-F., Wang, X.-L., Shi, S.-Z., & Gerada, D. (2023). Analysis of Stator Vibration Characteristics in Synchronous Generators Considering Inclined Static Air Gap Eccentricity. IEEE Access, 2023(11), 7794-7807. https://doi.org/10.1109/ACCESS.2022.3230907 This paper mainly focuses on the impact of inclined static air gap eccentricity (ISAGE) on the electromagnetic characteristics and mechanical performances (vibration, deformation, strain and stress). Considering different ISAGE fault types in the the... Read More about Analysis of Stator Vibration Characteristics in Synchronous Generators Considering Inclined Static Air Gap Eccentricity. Showing 1 - 20 of 132 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}