{
    "url": "https://www.nottingham.ac.uk/engineering/schoolsandcolleges/student-ambassadors.aspx",
    "content": [
        {
            "p": "Student Ambassadors are employed to represent the University and the Faculty of Engineering at internal and external events. They share their experiences and ensure that visitors to the University receive a high quality and enjoyable experience. Most of our outreach events are aimed at promoting STEM subjects to school children between ages 11 and 18. We want Ambassadors who are passionate about engineering and want to inspire youngsters to follow their footsteps into engineering at higher education and as a career. Our Student Ambassadors are part of a friendly team that work across all the Faculty departments, and also have the opportunity to get involved in wider STEM events with other facultys. Some of these events are paid, whereas others are volunteering opportunities. You can pick and choose the events to suit your individual schedule. The hours worked on outreach activity can also contribute to a module of the Advantage Award. Find out further information about the scheme and how to apply to become a Student Ambassador. Please note that to take part in the Advantage Award module you must be employed as a Student Ambassador, but you can be a Student Ambassador without taking part in the Advantage Award. In recognition of the work that the Faculty of Engineering Student Ambassadors do in their active promotion of STEM subjects - science, technology, engineering and mathematics - the faculty have received a generous donation from Nottingham alumnus Clive Chaplin (Law 1974) to reward excellence by setting up a prize scheme. Prizes of £500 each will be awarded to a maximum of four ambassadors each summer from 2015-2019. Students will need to: Congratulations to this year's winners: For more information on how to be a Student Ambassador: I have been a student ambassador for the university for three years, working within the department of Electrical and Electronic Engineering and for the outreach team, and have enjoyed the variety the role brings. From encouraging 6th formers to consider studying a degree in Engineering or Science, to teaching 7 year olds what Engineers do, there is always a new challenge. Being able to work with such a vast range of people, from so many different backgrounds, has not only helped with aspects such as communication and interpersonal skills, but has also been extremely rewarding. Student ambassador work has aided in my ability to think on my feet and adapt to changing circumstances. I believe this skill set will be of great value in my future career as an Engineer. Being able to share the passion I have for the subject I study with younger people is the biggest motivator as a student ambassador. I have been a STEM Outreach Ambassador for an academic year, and have been involved with just over 30 hours of outreach work. In that time, I have had worked in sessions run for children from the age of 12-18, enabling me to improve on my communication skills as well as having fun. Working with the other ambassadors has enabled me to make new friends, as well as giving me more experience in team-working. Fitting outreach work around my studies has not been an issue, and is often a great motivator for work as talking to visiting pupils about engineering often helps remind me why I decided to study it. I would say that my outreach work has been the most rewarding thing I have done at university, and would encourage any and everybody to get involved. I have been a student ambassador for the University of Nottingham for two years, and will be continuing until the end of my degree. I have been an ambassador for both the Civil Engineering department and the STEM Outreach programme, to inspire and guide younger students. I have gained vital skills from this experience, such as communication and planning skills, where I have applied these to both my everyday life and my studies (such as group presentations). The most difficult aspect of being an ambassador was to create a balance between studies and fulfilling my duty as an ambassador. However, I learnt to adapt to a busy timetable fairly quickly, which will be an asset when I become a Civil Engineer. Being a Student Ambassador has given me the opportunity to not only motivate younger generations towards STEM subjects, but has helped me understand the important role STEM careers play within our society.This was very rewarding experience that can’t be matched! The University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 74 87204 email: engineeringoutreach@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}