{
    "url": "https://www.nottingham.ac.uk/engineering/departments/abe/facilities.aspx",
    "content": [
        {
            "p": "Follow us on LinkedIn Design the future with our amazing Architecture facilities From our unique Creative Energy Homes to modern studio spaces, our facilities will bring out your best design skills. You'll learn in a real-world environment, presenting your work just as you would in an architectural practice. This hands-on learning will give you the blueprint to start designing your passion projects - and with our Centre for 3D Design, model making facilities, and Design+Build studio - you’ll have all the tools you’ll need to succeed. Situated in a stunning location on our beautiful University Park Campus, our architecture department has a unique combination of award-winning English landscape gardens, the Edwardian summer house, period buildings and modern facilities. This diverse location is what makes studying architecture at UoN so stimulating. Please note the exact facilities and equipment you will use depends on your specific course. “Really make the most of the facilities of offer and the staff who are there to teach and support you. It’s a great time to explore and pursue what you enjoy and find interesting.” Sophie Barks – Architecture BArch graduate (Part Two Architectural Assistant, Hopkins Architects) The perfect environment for creative group work. You’ll interact with large touch screens which link to your own devices and hot-desking spaces around the studio. The specialised lighting and pin-up spaces are used for showcasing exhibitions from architectural practices, inspiring you with professional work. During your first year, our Environmental Education Centre studio spaces will become your home from home. The hot-desking spaces are arranged around the studio structure unit, giving an authentic architectural practice feel. The permanent spaces within the building are offered to final year students who wish to remain resident in studio, giving them a designated space to complete their work. You'll be at the forefront of innovation with our award-winning Creative Energy Homes. These buildings are a key resource, particularly when studying micro-smart grids, energy storage, demand-side management, and occupants’ acceptance of innovative technologies. The research collected from these seven buildings has fed into the UK Government’s Green Deal strategy and the Nottingham Community Climate Change Strategy. They also provide a test-site for leading firms - including E.ON and David Wilson Homes - to work with the university, investigating the integration of energy efficient technologies into houses. Used by Architectural Environment Engineering students, you'll take data from buildings used for residential and research purposes. This gives you an understanding energy usage and what’s needed to build affordable, near-zero energy homes. The Centre for 3D Design gives you access to manual and digital methods for model making and design exploration. They serve as a valuable source of advice on different options you can explore when using model work to inform your design thinking. Our technical staff provide expertise in woodwork, wood machining, five axis router, laser cutting, joinery, 3D printing, vacuum forming, foam modelling, construction skills including concrete casting, bricklaying and plastering and small-scale spraying. Architecture students use these facilities whilst creating models of their projects. A key part of the 'Architectural Design Studio 1A' module, it gives first year students an introduction to the understanding and application of this skill. The facilities on offer within our Architecture and Built Environment department will set you on the road to your dream career. There are even more facilities to take advantage of: Visit our campuses in person Explore our virtual campus tour Find Architecture and Built Environment courses"
        }
    ],
    "pdf_files": []
}