{
    "url": "https://www.nottingham.ac.uk/engineering/studentexperience/societies.aspx",
    "content": [
        {
            "p": "The Students’ Union is home to over 200 societies, with a vast range of groups and activities that you can get involved in during your studies to enhance your student experience. Here are the Architecture and Engineering specific societies that you might want to consider joining. OPAD (Open-source Assistive Devices) is a student-led engineering group made up of University of Nottingham students, academics, and researchers who volunteer their time to design and manufacture bespoke assistive devices for individuals with physical impairments. Our groups work directly with their clients to provide design solutions which aim to improve their quality of life. Find out more by following us on social media. LinkedIn Facebook Instagram Students Union As a society we aim to: Create a community of female engineers across all engineering disciplines and related STEM sectors at the University of Nottingham. Promote women in the engineering industry, support women who have already chosen a career in engineering and encourage girls to consider studying engineering at a higher level. Organise social and professional settings so that our members have the opportunity to make contacts with their peers and network with industry sponsors. Host fantastic careers events throughout the year, working directly with the Engineering department to make sure our members are always the first ones to hear about the latest sponsorships, days out in industry, workshops and career opportunities to ensure that you stand out from the other applicants. Find out more by following us on social media: PGES is a society that aims to unite all postgraduate engineering students at the University of Nottingham by creating a sense of belonging and fostering an inclusive community for them and their families. PGES will give you the opportunity to connect and socialise with engineering PGs from different divisions outside of the work environment through a variety of events that will be organised. We will facilitate involvement in university-wide intra-mural sports and other non-competitive sporting clubs and provide support or refer members to existing resources related to non-academic concerns. We will also organise various workshops and training sessions as well as host talks by external speakers. Run by Aerospace Engineering students, we hold socials and events that are the perfect way to socialise with your Aero course mates. We also welcome any students who are interested in aerospace and want to make some new friends and have fun. Check out our social media for more info: The T&G Architecture Society is a student-led group that holds numerous events focused around Architecture and the Built Environment. We combine a series of lectures and events to provide helpful tools within the profession, with social and welfare events, so that students across the whole department can get to know each other and provide a platform for knowledge exchange. This year we aim to continue the popular online and in-person T-Talks to hear from practising architects, and professionals and discuss issues within the architecture community. We also hope to bring back the Architecture Boat Party and other social events that we have missed out on due to the pandemic. Find out more about the T&G Architecture Society through our social media, or our manifesto. The T&G society is a great experience, with regular guest lectures which have helped improve and inspire my our own designs. — Jenni Wilson, Architecture student Find out more by following on social media: Students' Union This is one of the biggest events in any chemical engineering students’ calendar. Every year chemical and environmental engineering students from different universites across the country come together for this massive sporting competition and celebration. During the day you get the chance to represent our university in one of a range of sports from football and rugby, to dodgeball and laser quest, there is something for everyone to do. Then in the evening there is a club night for everyone to socialise. Lady Trent is a formal dinner held toward the end of each year. It’s an amazing opportunity to celebrate with course mate over a three-course meal. The society also has intramural football and netball teams. Find out more by following our social media feeds, and visit us at the Welcome Fair: EEE Soc is a society that caters to students that study in the Electrical and Electronic Engineering (EEE) Department, or to any students that are interested in what we do. Our aim is to help our members broaden their understanding of their possible career in EEE by organising and hosting careers events, trips, and socials. We also aim to create provide networking opportunities within and out of the department. We know that there's a lot of work involved with an engineering degree, so our society provides opportunities for members to unwind and meet new people on their course through socials and sports. Socials: We have a wide range of potential socials we would like to organise. These include pizza & film nights, bowling, and inter-societal BBQs. We will also be hosting pub quizzes and bar crawls. Sports: EEE Soc will be having IMS teams in order to play football as well as various other sports. Careers events: We provide information about any upcoming careers events hosted in the Engineering Faculty. Trips: We organise visits to local engineering firms for you to gain a better feel of the workplace. How to find out more Visit our Instagram or our Facebook to see what we've been up to recently, and feel free to pop us a message on either page if you've got any questions! You can sign up here on the SU Website. Membership costs only £5 for one year which gives you discounted entry and priority tickets to all our activities and events. We at Design Soc are a course based society for Product Design and Manufacture students (but everyone is welcome). We focus on bringing together all years as a community with socials, sport and opportunities. We host some fantastic events such as the Christmas meal and engineering ball and we have many more activities such as guest lectures, bowling, pub quizes, trips, as well as netball and football teams The University of Nottingham University Park Nottingham, NG7 2RD Contacts: Please see our 'Contact us' page"
        }
    ],
    "pdf_files": []
}