{
    "url": "https://www.nottingham.ac.uk/engineering/research/areas/sustainable-transport/index.aspx",
    "content": [
        {
            "p": "Follow us on LinkedIn This is the place making the sustainable obtainable. Our experts are leading the charge in net zero aviation and changing the future of transport electrification. We’re turning research into reality to help solve real world challenges including: Our transformative research is addressing the United Nations Sustainable Development Goals and shaping the real world. Our research also informs our courses, from undergraduate and masters degrees, to PhDs. Our Zero Carbon Cluster Accelerating the translation of zero carbon research into high-impact commercial and policy solutions in partnership with industry and government, enabling the decarbonisation of carbon-intensive industries such as heavy transport. Find our more \"We’re developing new and exciting technologies to make the electrification of transport possible.\" — Professor Chris Gerada Our research shapes society and boosts business. Discover more of our research impact stories. Designing distraction free Human-Machine Interfaces for vehicles to improve safety, driver engagement and driving efficiency. Creating a fully-automated pilot-scale manufacturing process for complex composites shapes for the automotive industry. Creating models that underpin five International Aerospace Information Reports on electric power systems used in the aerospace industry. Developing robots for in-situ maintenance of Rolls-Royce aero engines reducing maintenance downtime from days to hours. Designing self-adapting manufacturing systems for the cost-effective manufacturing of complex, high-value products at low volumes. We work across a range of research areas within sustainable transport and mobility. Ryan is researching the characterisation of abradables and compressor blade-casing interactions within modern gas-turbines. Search for an engineering or architecture expert Access resources to collaborate, innovate and grow your business"
        }
    ],
    "pdf_files": []
}