{
    "url": "https://www.nottingham.ac.uk/engineering/research/research-directory.aspx",
    "content": [
        {
            "p": "Engineering. Architecture. Design. Follow us on LinkedIn This is the place where we shape the real world. Across our research institutes, groups, centres and clusters, we’re turning world-class research into reality. Our internationally leading experts are addressing local issues, solving industrial challenges, and contributing to the United Nations Sustainable Development Goals. We work closely with businesses - from SMEs to multinationals - locally, nationally and internationally. We offer dedicated services for industry through our business engagement units, and opportunities for consultancy, contract and collaborative research, and use of our sector-leading research facilities through our research institutes, groups and centres. Collaborate with us and we’ll help you to discover, innovate and grow. You can search by keyword or filter by a specific category. Categories are split to show our: The Advanced Manufacturing Technology research group is at the forefront of manufacturing technologies and systems research. Working across the aerospace, healthcare and manufacturing sectors, we have expertise in biomedical and digital manufacturing, advanced robotics, metrology, metal forming and material processing, and machine and condition monitoring. The Advanced Materials research group is investigating novel materials manufacturing, processing, and characterisation. Working across sectors including energy, healthcare, aerospace, and automotive, we have expertise in biomaterials, energy materials, microwave process engineering, and surface and interface engineering. The Architecture, Culture and Tectonics research group explores the effects of building design and layout, public realm and landscape on our social and cultural interactions. Working across different scales and contexts, we have expertise in the history and theory of architectural and urban culture, as well as the design, modelling and manufacturing challenges of building systems. The Buildings, Energy and Environment research group focuses on reducing energy use in the built environment, mitigating the impacts of climate change on buildings, and enhancing the well-being and productivity of building users. With expertise in sustainable building design, energy technologies, urban living, and smart and innovative materials, we aim to inform the sustainable practice of buildings and engineering. The Centre for Additive Manufacturing is at the forefront of additive manufacturing - 3D printing – techniques. Undertaking fundamental and applied research, we are investigating the underpinning processes, materials, and computational methods for multi-material and multifunctional additive manufacturing. The Centre for Healthcare Technologies (CHT) address major healthcare challenges through technology innovations, supporting the rapid translation of scientific discoveries into healthcare adoption. A collaboration between the University of Nottingham and Nottingham University Hospitals NHS Trust, the CHT also incorporates the Centre for Healthcare Equipment & Technology Adoption (CHEATA). The Centre for Structural Engineering and Informatics is combining construction with the information technology revolution to extend the lifespan of existing structures and improve resilience against hazards. With expertise in advanced construction materials, engineering design and construction, structural and computational mechanics, and wind engineering and structural dynamics, we are helping to build and connect the cities of the future. The Composites research group is an internationally leading research group. Working across sectors including automotive, aerospace, power generation, wind energy and healthcare, we have expertise in biocomposites, textile composites, composites manufacturing, mechanical and failure analysis, and recycling. The Environmental Fluid Mechanics and Geoprocesses research group has expertise in geology and geoprocesses, natural hazards, oceans and atmosphere, coasts, lakes and sediments, and experimental fluid mechanics. The Fluids and Thermal Engineering research group focuses on understanding fluid flow phenomena with expertise in experimental fluid mechanics, computational fluid dynamics, two-phase flow, heat transfer enhancement, and thermodynamics. We work across a range of industrial applications including flow assurance and control, engines and combustion, refrigeration and air-conditioning, and industrial chemical processes."
        }
    ],
    "pdf_files": []
}