{
    "url": "https://www.nottingham.ac.uk/english/news/2021-22/painting-of-dh-lawrence-at-newstead-abbey.aspx",
    "content": [
        {
            "p": "In commemoration of the acquisition by Nottingham City Museums of the last known portrait of D.H. Lawrence, on Sunday 4 September Dr Andrew Harrison will be delivering a talk at Newstead Abbey that will survey a number of portraits of Lawrence produced during his lifetime, and discuss the biographical context to the new - and previously unknown - painting of him. Date: Sunday 4 September Time: 2pm - 5pm Location: Newstead Abbey, Newstead Abbey Park, Linby, Nottinghamshire, England, NG15 8NA Speakers: Dr Andrew Harrison (University of Nottingham) and Dr Terry Gifford (Bath Spa University) Tickets: £35, follow this link to purchase. The painting of D.H. Lawrence by Dutch artist Joep Nicholas (1897 - 1972) is currently displayed in Newstead Abbey's History House, visitors can attend for £35 which includes admission to the house, the seminar, an afternoon tea, viewing of the D.H. Lawrence painting and car parking. Dr Andrew Harrison, director of the DH Lawrence Research Centre, said: \"The acquisition of Joep Nicolas' 1929 portrait of Lawrence by Nottingham City Museums is excellent news. It underscores the pride that Nottingham as a UNESCO City of Literature feels in Lawrence. This event at Newstead Abbey will give attendees a chance to see the portrait and to hear more about the artist, who was related to Aldous Huxley. My own talk will discuss several of the better-known portraits of Lawrence produced during his lifetime in order to set the new portrait in perspective, and I will also address the biographical context to its creation as a means of deepening our appreciation of it.\" Dr Andrew Harrison also co-curated an exhibition at Lakeside Arts Centre from 3 February to 29 May entitled 'Editing D.H. Lawrence', which explored the ways in which the works of Lawrence were censored throughout his lifetime. You can read more about that here. You can find more information and purchase your ticket by following this link. Trent Building The University of Nottingham University Park, Nottingham NG7 2RD telephone: +44 (0) 115 951 5900 email: english-enquiries@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}