{
    "url": "https://www.nottingham.edu.my/English/Vice-chancellors-award.aspx",
    "content": [
        {
            "p": "In recent years, several members of staff and students have received Vice Chancellor's Awards.The medal recognises exceptional achievements from those studying or working at the University of Nottingham. Winners of the award will have demonstrated: Swetha Siva (English with Creative Writing BA student) Swetha founded the University of Nottingham Malaysia’s Writer's Society, a student organisation that provides a space for conversations about writing. Under her leadership, the society promoted writing on campus and supported new writers through its blog Drafts, writing sessions, workshops on both creative and academic writing, and other events. Swetha writes fiction from marginalised perspectives. A young adult novel she wrote won the competitive The Word Editor-Writer Programme for a mentorship with an editor from Macmillan, and another young adult novel is being published by Meraki Press (as of January 2022). Professor Malachi Edwin Vethamani (Head of School: English) Helped to promote creative writing in UNM and has researched on 60 years of creative writing in Malaysia; produced an anthology \"Malchin Testament: Malaysian Testament\"; won a grant of RM10,000 to organise the first Malaysian Poetry competition, in collaboration with MoHE; organised the first World Poetry Day in UNM in 2018; recognised as a leading Malaysian literary figure. Dinesh A/l Jayabalan (English and Literature BA Hons student, 2017 - 2019) [Recipient of Jan Atkins Award in 2018] Head Trainer of the Debating Club, President of the University’s Toastmasters Club. Spearheaded and organised a Youth Leadership Program for underprivileged kids in Semenyih and is a foundation representative of A Child’s Right to Education Project. Member of the International Council of Malaysian Scholars and Associates. Michelle Beth Chong (English and Literature BA Hons student) UNMC Drama Group (members: Neda Binti Nejim Al-Asedi, Nur Ilyani Binti Hashim, Shamini AP Vasu, Nellie Chan Li, Edmund Khoo, Michelle Beth Chong and Ahmad Danial bin A Ghafar) – The UNMC Drama Group consists of 7 students, all at varying levels of study and from multiple schools. One of the most notable developments at UNMC over the past 3 years has been the emergence of a vibrant theatre and drama scene. These seven students have played key roles in all three of these events. They were performers, producers and organisers, assisting in the adaptation and re-writing of these plays as well the promotion and marketing. Augustine Chay Yew Yoong (English and Literature BA Hons student) Augustine is a BA (Hons) student of English Language and Literature. In year 2015, Augustine has made an extraordinary contribution to student media, notably when he served as Editor-in-Chief of the online newspaper, Ignite, where he created guidance and process documents for all elements of production and writing. Augustine also had a spectacular impact on the tri‑campus creative writing magazine, Particle, of which he was a founder member and lately editor, when he was instrumental in gaining a Cascade grant. telephone: +603 8924 8000 fax: +603 8924 8001"
        }
    ],
    "pdf_files": []
}