{
    "url": "https://www.nottingham.ac.uk/english/alumni/index.aspx",
    "content": [
        {
            "p": "We encourage our graduates to keep in contact and become actively involved in the ongoing development of an alumni community with the school and members of the English Society. Our Instagram and X (Twitter) pages are a great way to keep in touch with the school. There is also a University Alumni Relations Facebook page with events and information for alumni. Email Mari Hughes We regularly hold careers days for our current students, and would love to hear from recent graduates who would be willing to talk about their career to the current cohort of students. We are always looking for student profiles that share information about your course and time at Nottingham or your career progression since graduating. Contact us for more details. We are interested in identifying work placement opportunities and internships for current students and new graduates and we would be keen to hear from you if you think that you are able to offer a work placement or internship. Would you be able to mentor a current student or recent graduate? Please contact us if you are able to offer mentoring opportunities. Whenever you graduated, you may wish to come back to University either to pursue a postgraduate qualification or to attend a public lecture or research seminar. If you would like to attend an event in the school, we would love to welcome you back and can add you to our circulation list for public lectures. If you are thinking about a postgraduate qualification, take a look at our postgraduate taught and postgraduate research pages to find out more. We would reccomend attending an open day so that you can see just what options are available to you for continued study with the School of English. We also offer a distance learning course, English (Online) MA, which lets you develop your specialism and study what you love, without the constraints of a set curriculum. On this programme, 'pods' are taken in place of modules. You can choose from a broad range of pods of study, created by subject experts, to build your own programme. You don't need to decide right at the beginning where you will end up: your final degree depends on studying at least two-thirds of your course in a specialised area, and you will be able to discuss this with your Personal Advisor as you go. Whatever your choices, you will graduate with an MA in English. If your options don’t fit a particular pathway, your degree outcome will be MA English (Applied English). Our online Continuing Professional Development (CPD) courses are designed to help you influence your everyday business communication and achieve your workplace goals, helping with progression or breaking through into a new field. We offer a range of flexible online courses to help you become a communication expert at your own pace. The current CPD offering is provided by Linguistic Profiling for Professionals (LiPP) – our School's research and business unit who specialise in enhancing workplace communication, leadership and teamwork strategy. The Alumni Laureate Award was presented between 2007 and 2022 to celebrate our diverse alumni community and share the stories of how they carry Nottingham’s values into the world and the impact that they make. From 2023 the awards have been renamed as the Your Nottingham Alumni Awards. Trent Building The University of Nottingham University Park, Nottingham NG7 2RD telephone: +44 (0) 115 951 5900 email: english-enquiries@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}