{
    "url": "https://www.nottingham.edu.my/English/Particle-literary-magazine/Masthead.aspx",
    "content": [
        {
            "p": "Co-Editors in Chief Rasha Hamza (she/her and they/them) Rasha is a curious writer and editor. Soon to graduate as a Creative Writing major from UNM, she’s dabbled in freelance content writing but is more interested in curating the creative experience for others. You’ll likely see her digging into queer literature, poetry, and contemporary visual culture. Unrooted and a relentless traveller, don’t be surprised when you find her in a different country next time you hear about her. Syaza Binti Norazharuddin (she/her) Syaza is soon to be graduating from UNM with English with Creative Writing degree. If she is not in her room reading Virginia Woolf’s “A Room Of One’s Own” for the nth time, you will likely find her writing at a park among the trees . Besides writing, she is very fond of painting and playing the guitar. Although an introvert, she has ventured in spoken word poetry and has participated in spoken poetry events on campus. She has also worked as a social media copywriter and content creator in CGS-CIMB for her summer internship. Poetry Junior Editors Sara Mostafa (she/her) Sara Mostafa is an aspiring poet and writer. She has participated in a few local poetry slam nights and fell in love with spoken word poetry and words ever since. She aims to gain more experience in the literary field and publish her work one day. Muhammad Aqil Najhan bin Faris Najhan (he/him and she/her) Aqil Najhan thinks his legal name is a little too long. Currently second-year English Language and Literature student at UNM, he once held the position of head editor for the literary department of his high school’s magazine. His interests include theatre, queer literature, and, of course, poetry. Oh, and his own poetic work is set to appear in an anthology entitled Malaysian Millennial Voices - isn’t that exciting? Nur Hanisa Razalee (she/her) When she is not busy listening to music or planning shots for her next YouTube video, Nisa can usually be found writing or editing poetry. Her poetic works have been compiled into a zine titled Dreams, Delusions, and Made Decisions. Published under Terbitan Langit, the zine has been sold in places such as Kedai Buku Fixi and events such as The Georgetown Literary Festival. Nisa is also the producer at Paper Plane Boy Studio, a Malaysian video production start-up company. Intern Editor Evelyn Patricia Ramli (she/her) Evelyn is a first year English Language and Literature student at UNM. Although not as experienced in writing poetry, she has been an editor of her high school’s literary magazine for the past two years. Evelyn’s interest and passion for poetry, especially editing poetry, has been snowballing. Constantly inspired by her peers, she is determined to do and learn as much as she can, and she is excited for her future in the literary world, wherever it may take her. Fiction Junior Editors Chin Sze Wei (she/her) Sze Wei (Kaitlyn) is a first year student at UNM and an aspiring editor. In her free time, she enjoys books, movies, journaling and writing poetry. Her editing journey began a few years ago when she started doing editing and proofreading for authors online and fell in love with the process. She hopes that her passions and experiences will continue for a long time. Tan Jie Ying (she/her) Jie Ying is a Creative Writing student at UNM and has published several short stories in various Malaysian zines including Nutmag, an annual zine dedicated to stories by Penang-born and Penang-based writers. Her previous work experience includes interning at Areca Books (a small nonfiction publishing company in Penang), and freelancing as a translator at CENT Translation. Farah Nadia Zulkiflee (she/her) Farah is a writer, editor, and currently, a final year Creative Writing student at UNM. She is particularly invested in exploring personal and social issues through contemporary fiction. Her other interests include watching cat videos and enjoying some nice lattes now and then. Wong Li Wen, Rachel (Rei) (they/them) Rei is a UNM final year student in Creative Writing. They have been writing for years and publishing fanfiction under a pseudonym on many different platforms. They’re particularly interested in writing LGBT stories and wishes to one day publish an issue that highlights the LGBT community in Malaysia. Rei was also the PR manager of UNM GSOC, and is currently part of their events team. Apart from being an avid writer, they’re also a passionate gamer and a cosplayer in the local ACG community. Intern Editor Niamh Flannery (she/her) Niamh is an enthusiastic writer and aspiring editor. Despite being an Electrical and Electronic Engineering major, she finds great joy in writing, editing and all forms of art. Prior to this, she has had experience in shadow writing, and has edited earlier editions of her high school’s magazine. Creative Nonfiction Junior Editors Shafiqah Alliah Razman (she/her) Shaf is a passionate English major at the University of Nottingham Malaysia and an editor for the school’s literary magazine, Particle. Previously, she has worked as a content writer for a local news site, WORLD OF BUZZ. Her poetries and fiction have been featured in Particle and UNM Writer’s Society zine, while her creative essay, “Fear Let Me Be Free”, won a competition organized by Empower Malaysia. A shy novice in the field, she aspires to learn and find refuge in the art of writing and editing. She’s also a tsundoku who constantly needs her caramel latte fix. Loh Ji Yen (she/her) Loh Ji Yen (Angeline) is an undergraduate student at the University of Nottingham Malaysia studying Politics, History and International Relations. She helped in editing her school newsletter in secondary school which made her interested in the editing process. She is a minor history buff and cat lover. Artworks & Photography Administrative Team Secretary Sanjana Shah (she/her) Sanjana Shah is a second year finance, accounting and management student who has previously worked for a logistics and services company in Zambia as well as a printing and packaging family company in Dar-es-Salaam. She enjoys the quest of learning things outside her field of study and finds great joy in dogs and designer shopping. In her spare time, she enjoys Belaire Rosé and a good book or podcast. Treasurer Caroline Oon Kai Yuan (she/her) Caroline is currently a second year Finance, Accounting and Management student. Caroline had several roles as a Treasurer in the past. She also loves money. In other words, people call her the loan shark! On the side, she loves to express herself through writing, dancing and also playing the piano. Marketing Director Akmallina Athirah Binti Mohamed Zaharin (she/her) Growing up, Akmallina A. is surrounded with books, thanks to her bookworm family, and has spent her childhood writing fairy tales. Now, she is a final year Creative Writing undergraduate at Nottingham Malaysia, still spending her time writing, reading and listening to music. She’s open to any genre and is willing to explore things that are unknown to her. Akmallina also loves learning new things and will go around sharing them. One day, she hopes that she’ll be able to contribute to the global art scene. Graphic Designers Laisha Fahud (she/her) Currently a final year English Language and Literature undergraduate at UNM, Laisha aspires to work in publishing and eventually publish her own work. As a child, she was recognised as the girl reading books that weighed more than herself. Laisha discovered her passion for designing magazines at age sixteen when she embarked on her two-year journey as co-editor and designer of her high school’s magazine. She has also headed design and marketing teams for various student body committees in UNM. A perfectionist to the core, Laisha may have to be forced away from her work station! Evelyn Patricia Ramli (she/her) Evelyn has been the head (and only) graphic designer for her high school’s literary magazine for two years, which has given her the opportunity to enhance her abilities with InDesign and Adobe as well as her confidence with designing. She also teaches English online and works as an online freelance editor for essays, manuscripts, research papers, and more. When not studiously studying (haha) or watching k-dramas, Evelyn can be found in the dance room or badminton courts! Web Designer Damia Binti Norazharuddin (she/her) Damia is a computer science student whose course makes her well experienced in HTML and web design. She also does digital art and illustrations as a hobby and has years of experience using Photoshop. Her love of digital art translates to her interest in watching animated films and her ideal day off is watching a good Satoshi Kon film and posting movie reviews on Letterboxd. telephone: +603 8924 8000 fax: +603 8924 8001"
        }
    ],
    "pdf_files": []
}