{
    "url": "https://www.nottingham.edu.my/English/documents/MUP-2017-EntryForm.doc",
    "content": [
        {
            "p": "Recently, the UNMC Blue Sky team was awarded £5,000 from CASCADE to fund the UNMC Mobile Tutors Project. CASCADE aims to provide funds for Nottingham students to undertake projects that develop their skills, social awareness and employability while making a significant impact on local and international communities. With CASCADE’s support, the UNMC Mobile Tutor Group will be able to gain more publicity and involvement from the UNMC community in this very special CSR program. The UNMC Mobile Tutors Project was initiated by engineering staff and students to provide free tuition to Rohingya refugee children from Myanmar. The project is run by the Institute of Engineering Malaysia Student Section, IChemE Student Chapter and IMechE Student chapter of UNMC and supported by UNMC’s Faculty of Engineering. Under the current political scenario, the basic survival of refugees, especially children, has been difficult. For instance, refugee children are not allowed to attend Government-funded schools. According to the United Nations High Commissioner for Refugees (UNHCR), out of the 20,000 refugee children in Malaysia with 12,000 of them being of school-age, only 7,000 children are participating in the very basic education programs available in the 126 UNCHR-registered refugee schools in Malaysia. Since May 2016, the mobile tutor group in partnership with UNHCR-Tzu Chi Education Centre have provided a tutoring program for refugee children based in the Ampang and Selayang areas. To date, almost 30 volunteers have contributed their skills and time at these centres every Saturday. One of the volunteers, Ng Mei Xiang, who is a final year PhD student in Chemical and Environmental Engineering, said: “I volunteer in this project because it’s a chance for me to give something back to the community and make a difference to these children.” Sachini S. J. Gedarawatta, a second year undergraduate in Chemical and Environmental Engineering, and Abhay Menon, a final year PhD student in Chemical and Environmental Engineering, said: “This project provides education for the underprivileged and It is only through education that these children can hope to have a better life.” Pledge here to make a donation for Refugee Education. (Article image caption: UNMC student volunteers Ng Mei Xiang (in white t-shirt and Pan Kuan-Ting (in blue t- shirt) at at tutoring session with the refugee children) (Thumbnail image caption: (left to right) Mohammad Reza Ketabchi, Yew Guo Yong, Pegah Jalilian, Rayan Sabra, Nur Syafiqah Binti Ismail, Sachini S. J. Gedarawatta, Sylvia Tan Yen Chuen, Ng Mei Xiang and Abhay S. Menon. — Ends — More information is available from Dr Hii Ching Lik on ching-lik.hii@nottingham.edu.my or Josephine Dionisappu, PR & Communications Manager at The University of Nottingham Malaysia Campus on josephine.dionisappu@nottingham.edu.my. Notes to editors: The University of Nottingham has 43,000 students and is ‘the nearest Britain has to a truly global university, with a “distinct” approach to internationalisation, which rests on those full-scale campuses in China and Malaysia, as well as a large presence in its home city.’ (Times Good University Guide 2016). It is also one of the most popular universities in the UK among graduate employers and the winner of ‘Outstanding Support for Early Career Researchers’ at the Times Higher Education Awards 2015. More than 97% of research at The University of Nottingham is recognised internationally and it is 8th in the UK by research power according to the Research Excellence Framework 2014. It has been voted the world’s greenest campus for four years running, according to Greenmetrics Ranking of World Universities. Impact: The Nottingham Campaign, its biggest-ever fundraising campaign, is delivering the University’s vision to change lives, tackle global issues and shape the future. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}