{
    "url": "https://www.nottingham.ac.uk/english/news/2018-19/george-parfitt-1939-2018-obituary.aspx",
    "content": [
        {
            "p": "George Parfitt, who died in August aged 78, retired as Reader in English Literature in 1991. When George was appointed as Lecturer in 1966 the English Department was headed by James Kinsley, who was of the view that ‘his men’ (sic) should be capable of teaching literature from medieval to modern. George was delighted to do so, enjoying teaching across the range of literature, but particularly relishing his courses on seventeenth-century literature and on the fiction and poetry of the First World War. He published widely on these, and his Penguin edition of the Complete Poems of Ben Jonson has been continuously in print since its appearance in 1975. George was born in Trinidad in 1939 and came to the UK at the age of 14. His devotion to books began in childhood, when he would climb a tree on the Savannah in Port of Spain to escape his five brothers and sisters and read in peace and quiet. His secondary education, begun at Queen’s Royal College, continued at Varndean School in Brighton. It was there that he learnt (among other things) to smoke and skip classes. A notebook survives, recording the books he read between the ages of 16 and 18: novels, plays and poetry, French and Russian works in translation and books of criticism. Already his own teenage critical faculties were at work. Terse comments are recorded beside each title: ‘Magnificent’ (Dostoevsky) and ‘Only mediocre’ (Giraudoux); ‘Most confused & I can’t see why it should be written at all’ (Amis). After reading English at the University of Bristol he worked for the Association of Commonwealth Universities, later claiming that he was responsible for Germaine Greer’s admission to the UK. While working in London, and commuting between London and Brighton, he began a part-time PhD on Ben Jonson, returning to Bristol for a final year full-time. In 1966 he obtained his post as lecturer at the University of Nottingham. From the start George believed that the whole point of being employed by a university was not to hide away and do ‘research’ but to transmit knowledge to others, and in doing so to transform lives. George’s tutorials in a crowded and increasingly smoke-filled room were legendary, his slow quiet manner allowing for others always to participate. No less legendary was all the teaching he did over a pint or three at the local. For George everywhere could be turned into a place to transmit knowledge. This commitment to education led to one of his greatest achievements for the department. Years before anyone had heard of ‘widening’ participation and ‘access’ George successfully pioneered a new departmental policy of what, looking back, was shocking radicalism: that up to 25% of single honours admissions would be of mature students. This opened the door to all sorts of mainly local people who had for various reasons left education too early. George mentored, nurtured, taught (and drank with) his cohorts of mature students, and saw his visionary policy justified as they pretty consistently obtained upper-second and first-class degrees. George’s initiative put Nottingham English years ahead of national thinking about admissions. Another major initiative was the founding, with Simon Shepherd, of Nottingham Drama Texts. The project grew out of a frustration with a curriculum that had to be limited by what publishers chose to deem marketable. Nottingham Drama Texts intended to ignore market forces and make affordable, and thus available for teaching, a number of less well-known plays not otherwise accessible to students, and kicked off with Thomas of Woodstock, edited by George and Simon together. Between 1977 and 1992 more than a dozen editions of plays (and one of poetry) were produced and were made available on a non-profit basis to tutors in other institutions who wanted to broaden their curriculum. For George encouraging student creativity was part of the process of education. A poet himself, he encouraged and supported students’ poetry publications and live events, such as the setting up of Poetry Programme (later Phoenix), Pulp and Zenos. He was even known to have taken part in the rehearsal room when, as a dare, he challenged Simon Shepherd to mount a production of Jonson’s ‘unstageable’ Sejanus His Fall. The dare led to one of the very few modern productions, and one of the earliest, of this fascinating play. A keen sportsman, he played cricket and football for department and university teams. On the football pitch the mild-mannered man turned into a hooligan: long red hair streaming, he launched vicious tackles. In a surviving team photograph he stands, characteristically, fag in hand. A socialist, George was active in CND and was a member of BANG (Beeston Anti-Nuclear Group) and the Labour Party. After his retirement, unable to do more than back-room work, he took to letter-writing: for Amnesty, to local papers and to his MP. He was a school governor both in Beeston and in Birmingham, where he moved in 1992. George’s academic career was cut short by chronic depression. After a second breakdown, and in a university culture increasingly demanding, he decided he needed to retire. He remained in mourning for his lost teaching for the rest of his life. Characteristically, he ‘came out’ about his depression and anxiety long before it was usual to discuss mental health openly, and he supported others through the Depression Alliance. In retirement he continued to write poetry and to read widely on new topics. Although resident most of his life in the UK he remained a proud Trinidadian, and retirement gave him the opportunity to read, think and write about his identity and the experience of life in a colonial society. One result was his book Being Anglo-Caribbean, which combines memoir and literary criticism. Another was that, having amassed a large collection of books about the literature, history and culture of the West Indies, he worked on compiling extensive bibliographies of Caribbean fiction, poetry and drama, and made them freely available as downloads. After a stroke in 2014 writing became increasingly difficult and he decided to find a Caribbean home for his book collection. This home was on the island of Grenada, rebuilding itself after hurricane damage. George followed with delight the progress of his boxes of books on their long journey last year from Newark to Birmingham, and then on to London and by ship to the Grenada Community Library. For this again was a part of what George had always done, transmitting learning to others and ensuring the material means of doing so. In his memory a fund to support the library has been set up at justgiving. He leaves behind his wife, Maureen, his children Stephen, Peter, Elisabeth, Catherine and Jessica, ten grandchildren and four great-grandchildren. George Albert Ekins Parfitt Born 7th November, 1939. Died 17th August, 2018. Trent Building The University of Nottingham University Park, Nottingham NG7 2RD telephone: +44 (0) 115 951 5900 email: english-enquiries@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}