{
    "url": "https://www.nottingham.edu.my/English/Particle-literary-magazine/Home.aspx",
    "content": [
        {
            "p": "Particle is a literary and arts magazine under the School of English of University of Nottingham Malaysia. Publishing biannually, you can find our issues exclusively on this page. We aim to provide a platform in amplifying the voice of both emerging and established writers and artists. Particle offers students the opportunity to gain key experience in assessing, editing, designing, publication and promotion of the magazine. With connections to writers and publishing professionals, Particle offers critical hands-on experience for those pursuing the publishing industry. Our faculty advisor is Dr Shivani Sivagurunathan. For more information, check out our website here where we open for submissions, notify any upcoming events, and publish a blog that features interviews, essays and more! Issue 11: Roots Read this issue We, the Co-Editors in Chief for Particle Magazine’s 21/22 term, would love to give you our biggest thanks for being here with us. This disclaimer is meant to highlight the pre-existence of this issue. All works that have been curated and edited within this issue were done by the magazine’s previous teams. Although it was previously lost in an unfortunate incident, we managed to recover this issue, and a few others - deciding to republish them. We tried to maintain the novelty of this issue, and sincerely apologise for any errors, omissions, missing works and/or authors, that might have occurred. Thank you. telephone: +603 8924 8000 fax: +603 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/Particle-Issue-11-Roots.pdf",
        "pdf_files/Particle-Issue-12-Themeless.pdf",
        "pdf_files/Particle-Issue-13-Paradox.pdf",
        "pdf_files/PARTICLE-Issue-14-Solace-19.pdf",
        "pdf_files/Particle-Autumn-Issue-15.pdf",
        "pdf_files/Particle-Issue-16-Flux.pdf",
        "pdf_files/Particle-Issue-17-Matahari.pdf",
        "pdf_files/Particle-issue-18-ADRIFT.pdf"
    ]
}