{
    "url": "https://www.nottingham.ac.uk/english/news/2021-22/editing-dh-lawrence.aspx",
    "content": [
        {
            "p": "‘Editing D.H. Lawrence’ will explore the ways in which the works of Lawrence were ‘edited’ throughout his life and beyond by editors, literary agents, publishers and printers, and how he involved himself in, and at times circumvented, editorial interventions. Curated by Dr Andrew Harrison from the School of English along with the University of Nottingham Manuscripts and Special Collections department, ‘Editing D.H. Lawrence’ will feature a range of manuscripts, typescripts and rare first editions. Perhaps one of Lawrence’s most famous works, ‘Lady Chatterley’s Lover’ was subject to such sustained censorship and controversy that when Penguin Books sought to publish the full version in 1960, 30 years after Lawrence's death, the matter was taken to court. There, after a six day trial, the jury found Lady Chatterley’s Lover to be 'not' obscene. It was published a month later, and all 200,000 copies were sold on the first day. The Penguin second edition, published in 1961, contains a publisher's message, which reads: \"For having published this book, Penguin Books was prosecuted under the Obscene Publications Act, 1959 at the Old Bailey in London from 20 October to 2 November 1960. This edition is therefore dedicated to the twelve jurors, three women and nine men, who returned a verdict of 'not guilty' and thus made D. H. Lawrence's last novel available for the first time to the public in the United Kingdom.\" Dr Andrew Harrison, director of the DH Lawrence Research Centre, said: “This exhibition has something for everybody.” “Many have the impression that Lawrence was indifferent to editorial matters, which is not the case. In actual fact, Lawrence was extremely hard-working and energetic in the ways in which he tried to avoid censorship: that is one thing that really comes through in the exhibition.” The exhibition will run at the Lakeside Arts Centre from Thursday until 29 May. The exhibition will be accompanied by a series of lunchtime events, including talks from lecturers in the School of English, Dr Andrew Harrison and Professor James Moran. You can find more information on the Lakeside Arts web site: here. Trent Building The University of Nottingham University Park, Nottingham NG7 2RD telephone: +44 (0) 115 951 5900 email: english-enquiries@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}