{
    "url": "https://www.nottingham.ac.uk/english/news/2018-19/emeritus-professor-ronald-carter-1947-2018-obituary.aspx",
    "content": [
        {
            "p": "Ronald Carter, who has died aged 71, was for most of his long career Professor of Modern English Language at the University of Nottingham and has left his influence on the teaching and understanding of English in the UK and across the world. Born in Leeds in 1947, he first became interested in linguistics, and how it might illuminate our understanding of literariness, at the Universities of Leeds and Birmingham, where he studied English and Russian, followed by Comparative Literature and German. His doctoral work was one of the first examples of using discourse stylistics to explore literary texts and their reading. He submitted his PhD thesis on the poetry of W.H. Auden in 1979 and was immediately appointed to a lectureship at the University of Nottingham. The then Head of the School of English was James Kinsley, whose longstanding aim had been to ‘assert the unity of the linguistic-literary English discipline, medieval and modern, in a single school’. Ron Carter could not have been better placed. In the years following, Ron transformed the emerging field of literary-linguistics, establishing the UK as the world’s centre for the linguistically-informed study of literary texts. Dissatisfied both with the overly formal and decontextualised theoretical linguistics of the time, and with aspects of literary theory, Ron became a founder in 1978 and later Chair of the international Poetics and Linguistics Association (PALA), and under his guidance British stylistics enjoyed something of a heyday, its influence spreading across Europe and the world. By the late 1980s, Ron’s interests had widened beyond the literary to encompass language teaching and education, and the use of early forms of digitised text and computers for language analysis. Together with his collaborator Mike McCarthy, he was one of the first to see that the principled exploration of large bodies of examples of real language could provide new insights into how language worked in every-day use, as opposed to relying on abstract, theoretical modelling or prescriptions. Importantly, he saw such understanding as having crucial practical implications, offering new ways to improve the teaching of English, both as a first and second language. Ron was commissioned by the Conservative government (in 1988) under Education Secretary Kenneth Baker to develop material for English teachers to assist them in delivering the newly created National Curriculum. His programme and materials – produced as the LINC (Language in the National Curriculum) project – were subsequently widely regarded by teachers as some of the best professional development tools devised. An innovative element of them was the equal treatment of regional accents and dialects alongside Standard English, as well as an encouragement to pupils to practise linguistic analysis on contemporary political speeches. In the 1990s and into the early decades of this century, Ron continued to develop his research in applied linguistics: with Mike McCarthy, he compiled the Cambridge and Nottingham Corpus of Discourse in English (CANCODE), which was then used to write a new grammar of English. Published in 2006, this work won the British Council Language Innovation Award, and has since been a major influence on the teaching of English from south America to Singapore. Meanwhile, his commitment to interdisciplinary research was recognised in the rare honour of being elected (in 1995) a Fellow of the Royal Society of Arts as well as (in 2002) a Fellow of the Academy for Social Sciences. While for his 1997 Routledge History of Literature in English, revised and updated in 2001, he received, with his co-author John McRae, the Duke of Edinburgh’s English-Speaking Union Award. One of Ron’s more recent, yet perhaps most important areas of interest, a natural progression from his on-going concern with the practical applications of linguistics, was that of widening participation, especially among minority and ethnic groups. And it was recognition of his contribution to this area, as much as his ground-breaking academic research, that brought the award of an MBE for services to local and national higher education in the new year’s honours of 2009. Further recognition followed: an honorary doctorate from the Open University in 2013, and in 2017 he was the recipient of an ELTon, the British Council’s annual Lifetime Achievement Award. Retirement did not slow the pace of Ron’s work, nor the depth of his engagement with the causes, national and local, that mattered to him. These included a long-standing collaboration with Cambridge University Press where, in the later years of his career, and as a member of its operating board and Chair of the Education and ELT Publishing Committee, he continued to shape the direction of linguistics research. Ron was admired by all, not only for the public-facing aspects of his work, but for the private, quiet and unassuming advocacy and advice given to several generations of scholars and students. He had time for everybody, while also maintaining an astonishing work rate that included more than forty books and over a hundred research articles whose influence was wide, encompassing the disciplines of literary stylistics, applied linguistics, computer corpus linguistics, the grammar of English, and the practice of language teaching. School classrooms across the world look and feel and sound as they do in large part due to his influence. This productivity was checked only when illness made writing impossible, and—as was typical—when his death was announced, it was, as he had wished, with ‘no fuss’. The individual care and support, and the kind authority of this ‘gentle, genteel, and genial’ man, as Mike McCarthy aptly described him, will be greatly missed. He leaves behind his wife, Jane, and three children, Matthew, Jennifer and Claire, and their grandchildren. Ronald Allan Carter, academic, born 4 May 1947; died 12 September 2018. Trent Building The University of Nottingham University Park, Nottingham NG7 2RD telephone: +44 (0) 115 951 5900 email: english-enquiries@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}