{
    "url": "https://www.nottingham.ac.uk/esrc-dtc/home-page.aspx",
    "content": [
        {
            "p": "The Economic and Social Research Council (ESRC) funds a national network of institutional and consortia level Doctoral Training Programmes, through which it funds over 500 new postgraduates each year. This network covers the full disciplinary range of the social sciences as well as areas of interdisciplinary research. Since welcoming its first cohort in 2011, ESRC Doctoral Training at Nottingham has supported over 200 students to undertake cutting-edge interdisciplinary research that provide insights into some of the world’s biggest challenges. In 2017 University of Nottingham became a founding member of the ESRC Midlands Graduate School Doctoral Training Partnership (MGS DTP), offering a world-class multidisciplinary environment in which social science research and those undertaking it can flourish. The Partnership was renewed in 2023 and awarded further funding from ESRC to recruit and train Social Scientists of the future. We provide dedicated support for academic research in social sciences along with superb teaching, learning and lifestyle facilities for postgraduates, early career researchers and post-doctoral fellows. The University of Nottingham is a research-intensive university with a global reputation that has yielded major social science breakthroughs in areas such as international human rights law, geospatial technology, ethical business practices, globalisation and economic policy, and citizenship and transnational migration. The DTP fosters interdisciplinary excellence, improves engagement with external partners and enhances our reputation as a world-changing research university. We work with global businesses and regional enterprises to drive innovation into the marketplace and at the heart of everything we do is a commitment to meet the future research needs of society, industry and government. Midlands Graduate School DTP Nottingham DTP Training Programme University Park Nottingham NG7 2RD telephone: +44 (0) 115 951 4708 email: esrc-dtc@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}