{
    "url": "https://www.nottingham.ac.uk/esrc-dtc/training/dtp-training.aspx",
    "content": [
        {
            "p": "Conceptual, general and specialist training underpins all aspects of the Midlands Graduate School (MGS) Doctoral Training Partnership (DTP) vision. The personal, professional and academic training needs of all MGS students are assessed by a Development Needs Analysis which will take place each year. Regardless of the methods students are planning to use in their PhD, the ESRC’s training requirements state that all students should reach a certain standard of research methods training. As a result of their training in research methods the ESRC expects all DTP researchers to be trained in the following areas: All eight institutions in the MGS DTP offer a Masters in Social Science Research designed to meet the ESRC’s compulsory conceptual training requirements for ESRC-funded students. Although students follow different, discipline specific pathways through these Masters programmes, three core modules are common to all pathway. The MGS DTP and ESRC has a number of schemes and award lengths available, based on the extent to which the student/applicant has met the ESRC’s training requirements (outlined above). It should be noted that the standard award length is 3.5 years. This encompasses 3 months for training activities and 3 months for students to undertake a 3-month Research in Practice placement. If a placement is not undertaken, funding will be reduced by 3 months. All eight partner institutions of the MGS each deliver a Masters in Social Science Research (MSSR) as the '1' element of a 1+3.5 award. MGS partner institutions offer a portfolio of training courses available to MGS students to take throughout thier studies. The ESRC funds a range of data and methods services to support research and study. It provides resources needed to access high quality socio-economic data and to develop research skills. University Park Nottingham NG7 2RD telephone: +44 (0) 115 951 4708 email: esrc-dtc@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}