{
    "url": "https://www.nottingham.ac.uk/estates/universitycard/university-card-common-questions.aspx",
    "content": [
        {
            "p": "All students and staff (on the main university payroll) are entitled to apply for a university card. If you are a visitor, contractor, on secondment from another university or directly employed by a school/department and not on the main university payroll then you are not entitled to a university card and instead you need to apply for a key card/associate card. What is the function of my university card? Your university card acts as: a means of identification, a library card, a building access card, a bus card and a sports centre card. It can also be used for online library borrowing and photocopying. To use your card for building access simply hold the card 3-5 cm away from the middle of the reader. If the door is locked, then the LED status will be a constant red. If you then present a university card with valid access, then the LED on the reader will turn green for a short time and the lock on the door will be released. If the LED on the reader flashes red, then you are not authorised for entry. Most external academic doors will be set to automatically unlock within working hours for your convenience. A card takes approximately 8-10 days from when you upload a photo. New cards are printed in the Netherlands and are shipped over to us in batches. Replacement cards are printed in the Security office and we aim to have the card ready within five workings days. At busy periods this is subject to change. We do not provide temporary cards. Some departments manage their own and may be able to provide one to you. We are not able to take photos in the Security Office. If you are unable to upload a photo, please contact universitycard@nottingham.ac.uk. Your access rights are largely determined by the school/department/faculty that you are associated with and whether you are a member of staff, associate or student. Undergraduate students also have some different access rights to postgraduates. As a general rule, your card will be automatically programmed to give you access to the areas in which your school/department/faculty operates. Additional access rights can be allocated to you at the discretion of the university card team and if authorised by your head of school or nominated representative. However, the need for this is rare and your card should give you all the access that you need. To use your university card as a bus card, purchase bus travel from NCT’s Travel Centre or the Students’ Union reception in the Portland Building (students only). The travel will then be loaded on to your university card. Staff are also able to purchase discounted travel passes through Payroll. Read more about this scheme. Many doors on major academic buildings are set to open automatically during the day, and then lock off for access control in the evening and at weekends or during holidays. If you would like certain doors to open automatically at specific times for an event, then you will need to email the University Card team with at least seven days' notice. You will need to be very clear on the building, doors and timings that you would like to alter, as well as providing details about yourself for verification and a full explanation as to why you would like the door unlocking. If you need to book a building attendant for out of hours building cover, you will need to log an Estates Helpdesk online works request. Key cards are normally used by Estates for allowing contractors access to buildings for a short amount of time. Some departments also manage their own should they need them. You can email the University Card team should you require further information on this. The University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}