{
    "url": "https://www.nottingham.ac.uk/estates/joinus/join-us.aspx",
    "content": [
        {
            "p": "Estates & Facilities is the team that looks after the University's buildings, grounds and environments. There are six locations in the UK – University Park, Jubilee Campus, King's Meadow, Sutton Bonington, QMC Medical School, plus our University Hospital sites. For more information on these visit our website. Operations & Facilities is one of the job families within the Estates & Facilities team. You will see this referred to on our online vacancies page. We also have roles within the Administration, Professional and Managerial job family. This team plays a vital role in delivering exceptional service to our diverse customers across our halls of residence, bars, cafes and restaurants. Roles include Catering Assistants, Catering Team Leaders, Chefs, Chef de Parties. Are you enthusiastic, reliable, hardworking and friendly? Do you take pride in your work? If so, check out our catering vacancies. View our catering vacancies This team plays a crucial role in ensuring we deliver a clean, safe and comfortable environment at all times. Responsible for facilities including offices and lecture rooms, laboratories, accommodation, sporting facilities, libraries, shops, bars and restaurants. Are you enthusiastic, reliable, hardworking with a keen eye for detail who takes pride in their work? If so, take a look at our cleaning vacancies. View our cleaning vacancies This team is responsible for looking after the grounds and landscape of our amazing campuses. Roles in this area include all practical aspects of landscape maintenance including planting a wide range of shrubs, perennials, upkeep of ornamental gardens and bedding displays including keeping all areas of work clean, tidy and promoting a welcoming place with a strong emphasis on the environment and health and safety. If you love the outdoors, are enthusiastic, hardworking and take pride in your work, take a look at our grounds vacancies. View our grounds vacancies This team is responsible for the day to day running of University buildings which can inlcude Halls of Residence or teaching environments. They are the first point of contact for visitors, providing information and assistance where required. View our Building Attendant vacancies Earn £11.01-11.25 per hour with excellent holiday allowance. To keep you safe and develop your skills and career. 24/7 advice and support. The University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}