{
    "url": "http://www.nottingham.ac.uk/estates/development/currentdevelopments.aspx",
    "content": [
        {
            "p": "The following are a list of current developments – either on site or progressing through pre-construction phases. You can also follow us on Twitter This year our Hugh Stewart Hall of Residence is closed to students as it prepares for a face lift that will see the bedrooms and facilities transformed into a vibrant, accessible place that caters for our students needs now and into the future. A heritage listed building, Hugh Stewart Hall is one of our larger halls of residence on the northern end of our University Park campus. The refurbishment work will update and invigorate the residence and focus on enhancing the student experience on campus. Building on research and student feedback it will create fully accessible spaces, with communal living areas. The work will allow us to significantly improve the sustainability of the older buildings whilst retaining their heritage. The new amenity block will allow residents and visitors to take in the stunning views across the Downs and provide a vibrant social space with an ability to flex to a variety of uses. The refurbished Hall we reopen in September 2024. For further information about the work at Hugh Stewart Hall please contact Stavros Pourikas in the Development Team. _____________________________________________________________________________________________ The building will house a variety of different research groups and includes different levels of laboratories. It will also include links to Boots Science Building and a link to the remainder of CBS, as well as offices and meeting rooms for all academic and postrgraduate staff. Exterior view Alternate viewView from on campus GF Tomlinson were the main contractor. BuroFour project managers and Gleeds acted as cost managers. The architect on the project is Benoy with DH Squires as services consultant and Collins Hall Green as structural and civil engineer. Should you require any further information please contact James Hale in the Development Team. The latest development at Jubilee Campus is the Power Electronics and Machines Centre (PEMC). This is situated adjacent to the recently completed RAD Building. The facility provides office accommodation, laboratory, workshop space, meeting rooms and ancillary spaces for the Power Electronics, Machines and Control Group within the Faculty of Engineering. If you have any comments/observations please email them to estates-admin@nottingham.ac.uk. The University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}