{
    "url": "https://www.nottingham.ac.uk/estates/security/servicelevelagreement.aspx",
    "content": [
        {
            "p": "The Security section will provide a physical response within 5 minutes to a priority incident and within 60 minutes to non-priority incidents. All incidents will be investigated as required, appropriate reports will be raised, recorded and filed. Annual crime statistics will be circulated to senior management. CCTV cameras with recording equipment are in place. The building and surrounding car parks will be patrolled 7 days a week: Two external building patrols to ensure all outer doors and ground floor windows and other accessible windows are secure. Lockdown to take place between 6pm & 7pm. Two external building patrols to ensure all outer doors and ground floor windows and other accessible windows are secure. It is expected that all building occupiers and users will secure windows, interior doors and set alarms, where installed, in their designated areas when vacated. 7am - 3pm, two external patrols 3pm - 11pm, two external patrols 11pm - 7am, two external patrols Outer doors may be left open out of hours for the duration of authorised large functions in the building. In addition to the above one guard will regularly patrol the surrounding car parks between the hours of 8am and 4pm weekdays to ensure that the University of Nottingham Traffic Regulations are complied with. Crime prevention / reduction advice is available on request through the main Security Office. Security control will be manned 24 hours a day 7 days a week. Parking restrictions apply, visitors must pay and display in the Visitor Car Parks. Patrol Officers will at the discretion of Security Management carry out internal building patrols if deemed necessary. Reporting of crime: Internal 13013 External 0115 951 3013 Emergency number: Internal 8888 External 0115 951 8888 General security enquiries (Main Security Office on west side of Hallward Library): Internal 13557 External 0115 9513557 The University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}