{
    "url": "https://www.nottingham.ac.uk/estates/universitycard/associate-applications.aspx",
    "content": [
        {
            "p": "As an associate to the University of Nottingham you may be eligible for an associate card. You will need to be a registered associate in our IT accounts system to apply for a card. To raise the associate account request, log into BPM using your university username and password Under 'Blank forms' select 'Associate Accounts' or 'Associate Accounts Batch' for multiple accounts Enter details of the request Select the type of associate account needed Select the expiry date for the account (this can be extended) Submit request Once the associate account has been set up the assocoate will receive an automated email titled 'UoN Request for Associate Access' to accept the terms and conditions Fill in details on the form and then click 'Submit' at the bottom of the page An automated email (normally to a personal email address) will be sent from universitycard@nottingham.ac.uk to the associate with details of how to upload a photo for a university card If the email to upload a photo has not been received within one week of the account activation, please email universitycard@nottingham.ac.uk for further guidance. More detailed information on the application process and how to amend account details can be found via the Information Services website. As we are a read-only system, we are unable to make any changes to these accounts. You need: A recent digital passport style photograph of yourself (in .jpg format) The university username and password provided to you via email. The photo needs to be approximately 420x420 pixels in jpg format and comply with the following requirements: Close-up of full head and upper shoulders Facing forward looking straight at the camera No hats or sunglasses Contain no other objects or people Unaltered by filters If your photo does not comply with the above or is otherwise inappropriate you will be liable to pay a £15 replacement fee. Upload photo Please note that it may take a couple of weeks between applying for your university card and it being made ready for collection. You will receive an email when your card is ready for collection at the Security Office, located at the rear of Hallward Library, University Park. The University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}