{
    "url": "https://www.nottingham.ac.uk/estates/universityhouses/home.aspx",
    "content": [
        {
            "p": "Are you a new staff member, researcher, visitor, or postgraduate student seeking accommodation? The University of Nottingham provides a wide range of furnished housing options for both long and short stays. Our properties, located on campus and in the surrounding community, are designed to meet diverse needs, including those of families. Our university housing services are here to support you when you’re new to the university, making your transition smoother and more comfortable. The Xu Yafen Building, situated on the Jubilee campus, provides self-catered, non-serviced accommodation. Residents benefit from complimentary university Wi-Fi and a convenient free hopper bus service to other campuses. The University Park campus is approximately a 15-minute bus journey away. Studio rooms feature a single bed (single occupancy only) or double bed (single or couple occupancy only), wardrobe, desk, and chair. A small kitchenette includes a 2-ring hob, fridge, microwave, and sink. An ensuite shower room offering a shower cubicle, washbasin, and WC. Two flats, suitable for families, each comprising three bedrooms, a lounge with a dining area, and a fitted kitchen. Each bedroom has a single/double bed, wardrobe, desk, and chair. The fitted kitchen has an electric cooker with a 4-ring hob, fridge, microwave, and sink. A private bathroom features a bath with shower over, washbasin, and WC. All accommodations include bedding, towels, and basic kitchen utensils. A communal lounge and laundry facilities are available for residents only. £898PCM For bookings up to 31 July 2025. (Any bookings after this date will be subject to the annual price increase) £1246PCM For bookings up to 31 July 2025. (Any bookings after this date will be subject to the annual price increase) £1593PCM For bookings up to 31 July 2025. (Any bookings after this date will be subject to the annual price increase)"
        }
    ],
    "pdf_files": []
}