{
    "url": "http://www.nottingham.ac.uk/estates/recordstoragefacility/home.aspx",
    "content": [
        {
            "p": "Paper records require a large amount of physical storage space. Records held at the KMC archive storage facility will incur costs associated with handling, asset management, storing and disposal processing. Records should only be submitted to the facility if there is a defined legal or statutory requirement to be kept, or a clearly articulated business need. You do not need to keep a paper record if the record already exists in an electronic format. Master records should only be retained if storing electronically is not an option and the retention period exceeds 3 years. Step-by-step guide to putting a record box into the record storage facility (KMC) Review and return To review a record box within our secure 'Reading Room': To request a return of your record box: Dimensions: (W333 x D390 x H285mm) Amazon - Bankers Box (pack of 10) Product reference: B000JTOX2S (Grey) B00AZUV2QQ (Blue) Banner UK - Fellowes Heavy Duty Bankers Box (pack of 10) Product reference: 0402953 Paper records require a large amount of physical space for storage, this in turn has impacts on the available office space and requires ongoing maintenance to ensure that records are kept for the correct amount of time.The KMC records store has been at capacity for a significant amount of time. The long term future of this storage is also unknown at this point and so the KMC archive should no longer be considered a long term storage solution.In light of this a revised process for any paper materials that either have • A defined legal or statutory requirement to be kept or • Very clearly articulated business need, is required. By following this procedure we can continue to provide a long term cost effective storage solution for the University, whether this be through limited onsite storage, paid for offsite storage or bulk scanning. Please carefully read the Onsite Archiving Deposit Procedure Guide (updated 2023), this will provide an outline of what can be stored within the Record Storage Facility. The facility is able to accept the following types of content for archiving, which have a retention period of three years, or more: Please check the data retention policies section for information relating to how long records should be held for. Any content showing a retention period of less than three years from the UoN Records Retention Guide should be stored locally within your department. The sender completing the submission form is responsible for keeping a secure list of box numbers and contents. This will enable box return and successful communication with the archive department, if required. Please be aware before starting a new submission form, that you have read and that you understand the importance of the universities data retention policies for specific types of contents. This information can be found on the Information Security & Compliance pages, under Records Management. Onsite Archiving Deposit Procedure Guide (Updated 2023) Records Management Policy UoN Records Retention Guide The above information will help you ascertain the correct storage timeframe for your specific content. Please contact the Information Compliance Team if you are unsure. Once you have completed your submission form you will receive your labels by email. Please print and cut into three separate labels and securely attach one label to both of the narrow sides on the outside of the box, and place the third label loose inside the box on top of any content. Please also clearly write your box reference in marker pen onto one of the longer sides of the box please. Finally, if you are not delivering the boxes to us at the Record Storage Facility KMC (Transport & Logistics Office), please submit an Estates Helpdesk request, asking for Transport and Logistics to collect the boxes. This can be done via the following link: Estates Helpdesk To request the return of your record boxes please complete the archive return form, quoting your re-delivery address details. Record Review and Return Form For assistance in completing the form please contact us at archive@nottingham.ac.uk Total storage costs for the retention period of your record box will be charged to your project code on receipt of the box into our record storage facility. An example of fees to store a single box for the minimum of three years: £5.00 per annum (August to July) £10.00 one-off handling Total storage cost = £25.00 There is a potential for scanning records, this would need to be outsourced with an approximate cost of £150 per box. If you would like more information of how to do this, please contact us at archive@nottingham.ac.uk If you have any queries with these forms, you do not receive your labels, or for all other queries, please contact archive@nottingham.ac.uk The University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}