{
    "url": "https://www.nottingham.ac.uk/externalrelations/digital-and-marketing/web-team/contensis/permissions-roles.aspx",
    "content": [
        {
            "p": "Access to the Content Management System (CMS) is only provided if the full CMS training course has been taken. Different positions carry different permissions within Contensis. You can read about the roles below in order to understand what you can and cannot do with the CMS with your current status. In most cases, new users should be added as editors and only become approvers once they have more experience of using the CMS. Permissions are added by the web team through a support request completed by your unit web coordinator or your line manager, after you have been on CMS training. If the unit web coordinator or line manager is changing or is unavailable, the request should come from the School Manager or Head of School (or equivalent for other units). Each department, school etc uses its own user groups (one for each role type). All roles have view access to the shared resources folder, where they have the ability to drag and drop various layouts. Admin rights are usually restricted to unit coordinators who are experienced users of the CMS. Admins may edit the website title and footer. They may also request the ability to create HTML snippets and mini templates within their site. There is usually only one admin per website. Approvers don't generally edit pages. Editors submit work to an approver who approves or declines it. If work isn't suitable for the web, it will be returned to the editor for amends. If it is suitable, the approver will publish it. Approvers are responsible for checking quality, usability and accessibility before publishing. If someone with approver permissions edits a page, they should still submit the page for authorisation to another approver. Approvers should not approve their own work. The majority of users on the CMS are editors. Editors can create and edit content including web pages, images and documents and submit them for approval. An approver then decides whether the work is suitable to be published to the live web. If not, work will be declined and returned for amends. Viewer permissions allow users to view content in selected folders in the CMS, but not to edit. This is useful when someone needs to link to another site. Useful when you want to give a user permission to only work on news and events. Content needs to be submitted for approval. Editors have the same permissions as with regular content."
        }
    ],
    "pdf_files": []
}