{
    "url": "https://www.nottingham.ac.uk/externalrelations/digital-and-marketing/web-team/contensis/getting-started.aspx",
    "content": [
        {
            "p": "Once you have completed training and been given permissions to use the content management system, go to https://cms-uon.cloud.contensis.com to log in. The left-hand side section of the screen is the navigator, which will enable you to view the University of Nottingham website folders, and the large, central section of the screen is the dashboard. When creating or editing a page, the dashboard will become the content area. Different positions carry different permissions within Contensis, and so you are encouraged to read about our permissions and roles in order to understand what you can and cannot do with the CMS with your current status. To request the relevant permissions for you, please ask your unit web coordinator to complete our permissions request form. The University of Nottingham maintains a consistent online identity through the branding and styling of web pages. There are steps you can take that will result in consistent presentation, and many of these steps can be found in our Contensis CMS support pages. Contensis uses a WYSIWYG editor, meaning that what you see in the interface is a visually accurate depiction of what the web page will look like when live. Our style guide helps make our websites look professional and consistent. Please familiarise yourself with the style guide and follow it for all your content. Here are a few main things to look out for when editing web pages: You should consider if you have enough content to require a new web page and where in the website structure it makes sense for it to appear. Check with your unit web coordinator for guidance on this. How to create a new page: Now that your page has been created, you will be able to edit it. In order to edit newly created or pre-existing pages, right click a page in the left-hand navigator and select 'Edit'. Layouts, features and formatting User guides"
        }
    ],
    "pdf_files": []
}