{
    "url": "https://www.nottingham.ac.uk/externalrelations/digital-and-marketing/web-team/contensis/index.aspx",
    "content": [
        {
            "p": "Contensis is a Content Management System (CMS) by Zengenti. Almost everything you see on the University of Nottingham website is created and managed using Contensis. To manage websites in Contensis, it's not essential to know HTML, CSS or any other programming languages (although sometimes it helps). Like with most CMS', you're presented with a \"what you see is what you get\" (WYSIWYG) interface, which is essentially a toolbar (like you'd see in Microsoft Word) and editable areas where you add your content. Although you don't need coding experience, you do need to attend our CMS training course. The one-day training course is aimed at members of staff who have responsibility for creating and editing content on the University of Nottingham website. Please ensure that you have discussed attending the course with your line manager and your unit web coordinator before booking a place. 1. CMS training course Access to the CMS is only provided if the full course has been taken. You'll be provided with trainee login details during your training day. Following this, you need to get your unit web coordinator or line manager to request permissions for the websites you'll be editing. Each department uses its own user groups and different positions carry different permissions within Contensis. 2. Permissions and roles You can then make use of our guidance to get started with editing. Contensis uses a WYSIWYG editor, meaning that what you see in the interface is a visually accurate depiction of what the web page will look like when live. You can also use columns, formatting, features and mini templates as a simple and efficient way to create interesting page layouts. 3. Getting started with the CMS Once you have completed CMS training and got permissions, you can log in to Contensis. The web team are happy to assist staff with any issues and advise on web related queries. Use the button below to find the appropriate request forms to raise a request with our team."
        }
    ],
    "pdf_files": []
}