{
    "url": "https://www.nottingham.ac.uk/externalrelations/digital-and-marketing/web-team/support/index.aspx",
    "content": [
        {
            "p": "To get support updating the University of Nottingham website (nottingham.ac.uk), there are three options: If your support is about one of the following, you may need to contact someone else. Information relating to eStaff profile is currently surfaced on the website. This is managed and owned by Digital and Technology Services (DTS). For technical support with your eStaff Profile, please contact your school admin in the first instant or submit a support request via Digital and Technology Services (DTS) on the DTS self-service portal. For support enquiries relating to profile images, please submit a support request to the web team along with: In 2024, work began to transition data to RIS. If you have any questions relating to this, please reach out to the RIS team via email on ris-enquiries@nottingham.ac.uk If the website was built by DTS, use their self-service portal to request support. If you have an external website built in a different system (for example WordPress or Wix), we can't help you with problems with it. If you want ongoing support, we can help you transfer it into the university's content management system. You can start this process through a project request. The benefits of having your website within the university content management system are: We do not have access to the university blog system, blogs.nottingham.ac.uk. Please select Creative and Content on the request form for support to set up a new blog or to maintain an existing one. This includes uploading video to MediaSpace and YouTube. Please select Creative and Content on the request form. See the brand portal for advice and and good practice around copywriting, design, photography, social media, video, along with the university style guide. You can book this training through the staff short courses system. You need to have approval from your line manager and unit web coordinator before booking the training. Use the web team support request form if you have already had training but: AEM is the new system the university website is moving to. Different teams are currently responsible for different parts of it. Use the correct form for what you want to do: Web addresses that start with nottingham.ac.uk/studywithus/ugstudy/courses/UG/ Web addresses that start with nottingham.ac.uk/studywithus/ugstudy/articles/ Use the request form and choose web from the 'Is this project for the creative and content teams or web?' question, and then web support from the 'What kind of web request?' question for: If you are contacting us about web content that you are currently editing, please check-in all pages so that we can edit them if required. The Marketing and Digital team is focusing its efforts on the new digital experience platform – Adobe Experience Manager. This means we are only able to fulfil project requests on the legacy system (Contensis) that are deemed business critical. We appreciate your patience and understanding during this period. If you have an urgent request or need to escalate anything, please contact Rachael Grimshaw. Thank you for your ongoing support as we work towards delivering this important new platform and enhancing our digital experience. For business critical requests only: Use the request form and choose web from the 'Is this project for the creative and content teams or web?' question, and then web project from the 'What kind of web request?' question for: Complete the request form"
        }
    ],
    "pdf_files": []
}