{
    "url": "https://www.nottingham.ac.uk/externalrelations/digital-and-marketing/web-team/support/new-website.aspx",
    "content": [
        {
            "p": "If your unit, school, department or conference needs a new website on the university's public-facing site, the web team can set this up for you in the university's content management system (CMS). You need to contact the Corporate Marketing team first. Research groups sit under the address nottingham.ac.uk/research/groups/ View an example research group site Conferences have their own template and appear under our main Conferences page. View an example conference site Consider if your site needs any of the following: Does your site need a URL other than nottingham.ac.uk/yoursite? These are only usually needed for sites that our collaborations between Nottingham and other organisations. You will need to contact Digital and Technology Services (DTS) for this. Let us know if you have any current URLs that will still need to work and we can setup redirects. Do you need a staff listing on your site? If so, please contact your eStaffProfile administrator or web coordinator and ask them for your unit ID. Your admin will need this to set up your site's staff listing. The web team are not responsible for setting up your eStaffProfile listing. eStaffProfile is a Digital and Technology Services (DTS) owned system. Guidance on what special functionality can be added to your site and which are unsupported by the CMS. The CMS doesn't currently support the creation of password protected secure areas. Contact Digital and Technology Services (DTS) for advise on using Workspace or SharePoint instead. We recommend using Microsoft forms, which all staff have access to as part of Office 365. You can embed or link to the form within your webpage. You can also set up your event for online booking on the university's online store. Contact store@nottingham.ac.uk to get this setup. This is usually used for conferences that have a fee to attend etc. Many sites link to services such as Eventbrite for online registration. These are not supported by the web team. This is not currently supported by the CMS and would require further development."
        }
    ],
    "pdf_files": []
}