{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/news-listings/improving-highway-maintenance-with-innovative-software-solutions.aspx",
    "content": [
        {
            "p": "XAIS-PTS XAIS-PTS is a highway infrastructure and asset management company providing a range of services and software solutions to local authorities, highway network operators, and international transport organisations. XAIS-PTS was keen to complement its services by creating a software solution that could forecast future condition and maintenance requirements of infrastructure assets. XAIS-PTS recognised that in terms of reputational significance, driver satisfaction and public sector value for money – roads are one of the top priorities for its customers. Through the introduction of a prediction tool, XAIS-PTS’s clients would benefit from a more holistic approach to planning interventions by identifying and prioritising preventative interventions before they evolve into large and expensive emergency repairs. Knowledge Transfer Partnerships (KTPs) are a three-way collaboration between a UK-based business or charity, a knowledge-based organisation, and a qualified graduate known as a KTP Associate who can lead a strategic business project. Over a span of two years, a dynamic partnership unfolded, uniting XAIS-PTS with civil engineer and KTP Associate Dr Leonardo Rodrigues. Guided by the academic prowess of Associate Professor Luis Neves, from the Resilience Engineering Research Group in the Faculty of Engineering at the University of Nottingham, this collaboration was a testament to the power of collective knowledge and expertise. Applying methodologies developed within the Resilience Engineering Research Group and supported by Associate Professor Luis Neves, Leonardo developed an advanced life-cycle model for roadway assets based on Petri nets. By exploiting large datasets, the framework produces prediction scenarios and addresses risks associated with different decisions. The team leveraged cutting-edge machine learning techniques, which enabled them to identify assets with similar deterioration profiles and predict the future condition of assets with absent or poor data. Additionally, Dr Leonardo Rodrigues adapted the earthquake engineering concept of fragility functions to estimate the probability of reaching undesirable limit states over time. This innovation enables a risk-based approach aligned with the Well Managed Infrastructure Code of Practice written by the UK Department for Transport. This collaboration resulted in transforming XAIS-PTS’s XA© Infrastructure Asset Management System (IAMS) and the inclusion of predictive analysis in the web-enabled front end XA© Explorer. Central to XAIS-PTS’s portfolio, the XA© IAMS captures, manages, integrates, and analyses vital information on road infrastructures and presents it in an easy-to-use online dashboard, allowing local authorities and agencies to make key decisions about service levels and delivery. Including the developed advanced modelling framework in XA© Explorer has positioned XAIS as a pioneer in the industry, offering local authorities advanced analyses that forecast road networks' future conditions and maintenance needs. This strategic advancement enriches XAIS-PTS’s offer, directly catering to the pressing need among local authorities for data-driven, evidence-based decision-making tools, saving precious resources and mitigating the impact on road users. This KTP has empowered XAIS-PTS to embrace continuous growth and innovation in infrastructure asset management. By driving service innovation, aligning with industry practices, and fostering client engagement, the KTP significantly contributed to XAIS-PTS’s and its broader group’s strategic vision, setting a foundation for future successes in the evolving infrastructure management landscape. Leonardo went on to win the Future Leaders Category at the National Knowledge Transfer Partnerships Awards in recognition of his innovative approach and commercial awareness. Highly regarded amongst commercial and academic communities alike, a paper based on his research was presented at the Eighth International Symposium on Life-Cycle Engineering (IALCCE), with subsequent papers pending. Leonardo has joined the XAIS-PTS team on a permanent basis as a Senior Infrastructure Analysis Consultant. Finally, the KTP was awarded “Outstanding” by Innovate UK and an independent evaluator in recognition of a “truly impressive KTP project.”"
        }
    ],
    "pdf_files": []
}