{
    "url": "https://www.nottingham.ac.uk/fabs/procurement/documents/referral.docx",
    "content": [
        {
            "p": "Whether you're looking for professional skills and insights or personal motivation and inspiration, we have a great range of alumni activities to help you grow who and what you know. Develop your skills and hear unique insights from our community and industry speakers on a wide range of topics selected by alumni. Learn how an entrepreneurial mindset can lead to better outcomes, potentially greater profitability and more rewarding workplace relationships. Join the Deans of our UK, China and Malaysia campuses for this online event to wrap-up Nottingham University Business School's 25th anniversary celebrations Join university expert Dr Maria Toledo-Rodriguez to learn how to train your brain into a 'growth mindset' and embrace opportunities which come your way. Personal Performance Coach Julie Littlewood (Biomedical Sciences, 1999) explains how to build confidence in your own abilities and take the next step, wherever you are in your career. Hear from a panel of expert alumni as they delve into the rapidly growing world of financial technology and its impact on the global economy. Anna Mosley (Management and French, 2005), a leading Performance & Mindset Coach, lends a fresh perspective to overcoming imposter syndrome. Our alumni expert Jacky Francis Walker (Counselling Studies, 1999) shares the tell tale signs of burnout and provides techniques to prevent it happening at all. Learn how to set goals which align to your nature with insights from writer and motivational speaker Shivali Bhammer (Economics and Philosophy, 2008). In this session learn more about NUBS's unique new programme to help businesses prepare for a digital future from Dr Andrew Callaghan. Explore the concept of growing a workplace strategy based on kindness. Explore the benefits and challenges of different working styles. Cadro co-founder Jordan Buck (Geography, 2009) discusses his experiences starting a fintech company and shares his thoughts on the latest themes in the sector. Discover how to solve problems and influence change across organisational boundaries. If you can innovate, and spread innovation in health care, you can innovate anywhere. Could screwing up be the secret ingredient to your success? The workplace changes introduced in response to Covid-19 have provided the opportunity to reset team dynamics. Our latest webinar series, Grow, features alumni from a wide range of sectors who share their top tips to help you to develop your professional skills and build your personal attributes. Michael Skok shares his insights, gained over 40 years as an entrepreneur. Fast-track your career with IJ Samuel's top tips. View more Our alumni programme is here to help you to grow and thrive professionally and personally. There’s so much more to come – here are some of the highlights of our upcoming programme. Our seminars promote the latest in research and thinking from Nottingham University Business School. Hear from our inspirational speakers, with unique insights you won't find anywhere else. Learn a new skill with our immersive masterclasses, hosted by experts in their field."
        }
    ],
    "pdf_files": []
}