{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/keiawards24/programme/nominations-faculty-of-science.aspx",
    "content": [
        {
            "p": "Project lead: Mr Thomas McInally, School of Chemistry Fibrosis is the result of scar tissue build up on an organ of the body and is believed to cause up to 45% of deaths in the industrialised world. Idiopathic pulmonary fibrosis (IPF) currently has no cure. 50% of patients receiving drugs to slow progression discontinue treatment due to side effects A collaboration between GlaxoSmithKline and the university to teach undergraduate chemists how to design new drugs, focussed on IPF. Novel compounds developed at the university were screened in GlaxoSmithKline and identified a potential treatment for IPF. A spin-out company, Alevin Therapeutics, was formed in April 2022 to develop safe and effective treatments for IPF and fibrotic diseases. This project demonstrates the benefit that can arise from knowledge exchange between academia and industry, in order to address significant unmet clinical need. Project team GSK team Further contributors Project lead: Dr Sarah Cassidy, School of Psychology Our research has shown that up to 42% of the 5,500 people who die by suicide in the UK each year are possibly autistic, but not diagnosed. However, there was little research and no policy relevant to preventing suicide in autistic people. Working in partnership with autistic people to identify priorities for suicide prevention, research and policy, in 2021 we published our recommendations in a policy brief: “Autism community priorities for suicide prevention”. In 2023, we successfully supported an evidence submission to the DHSC to ensure that autistic people were included in the new suicide prevention strategy. Autistic people are now included as a high-risk group for the first time. This is a significant step towards saving the thousands of autistic lives lost through suicide. Newcastle University University of Cambridge University of Glasgow Project lead: Professor Stephen Jackson, School of Psychology Tic disorders like Tourette's Syndrome greatly impact the lives of individuals. Options to control their conditions are limited to pharmaceuticals, behavioural therapy or, in some parts of the world, invasive brain surgery. Looking for a better way, the Nottingham team demonstrated electrical stimulation of the peripheral nervous system could alter brain activity linked to the initiation of movements, thus reducing tics and the urge to tic in individuals. In 2021 Neurotherapeutics Ltd was spun out the university to develop the Neupulse wearable device. Raising £4m investment to date, in 2023 Neurotherapeutics worked with the team on a UK-wide clinical trial demonstrating successful tic reduction in a home setting. When the Neupulse device goes on sale within two years, individuals will be empowered to take control of their brain health conditions and reduce their symptoms at the touch of a button. Neurotherapeutics Ltd team Get in touch: research.innovation@nottingham.ac.uk Jubilee Conference Centre Jubilee Campus Triumph Road Nottingham, NG8 1DH"
        }
    ],
    "pdf_files": []
}