{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/keiawards24/programme/nominations-faculty-of-medicine-and-health-sciences.aspx",
    "content": [
        {
            "p": "Project lead: Dr Sarah Rodgers, School of Medicine PINCER is a pharmacist-led IT based intervention to reduce medication errors. GP clinical systems are searched using computerised prescribing safety indicators to identify patients at risk from their prescriptions. Once identified, the problems are addressed with pharmacist support. PINCER was developed and tested by researchers at the Universities of Nottingham, Manchester and Edinburgh and has been proven to substantially reduce hazardous prescribing. During 2018-2022, the Nottingham team worked with all 15 Academic Health Science Networks in England to roll out PINCER to more than 2,800 (41%) GP practices in England with funding from the Health Foundation, NHS England and the AHSN Network. As part of the national rollout the team provided a comprehensive training package to support primary care pharmacists to deliver the PINCER intervention and more than 2,500 health care professionals have now been trained. Project team Project lead: Stacy Johnson, School of Health Sciences The Reverse Mentoring Practice Ltd is the first spin-out company from the School of Health Sciences. Our vision is to eliminate discrimination, one conversation at a time, through the power of Reverse Mentoring for Equality, Diversity and Inclusion – ReMEDI - where leaders are mentored by people in more junior positions or marginalised groups like disabled people or minority ethnic groups. Originally developed to address workplace inequalities in the NHS, ReMEDI has now been implemented in higher education, research councils, local government and the private sector. The positive impact on inclusive cultures has been recognised widely – we have worked with 61 organisations and facilitated 127 cohorts of reverse mentoring, which totals 14,000 game-changing inclusion conversations, providing wide-reaching societal benefit. RMP team Project lead: Professor Pip Logan, School of Medicine Falls in care home residents are common and can result in fractures, bruising, skin tears and reduced mobility, often leading to hospital admission. Created and co-developed by the Nottingham team, our Action Falls programme trains care home staff in small groups to assess situations where there is a risk of falls occurring and to take preventative action. Training is given to everyone in the care home, from owners to carers and visitors. In the last three years this cost-effective programme has produced a measurable change in more than 200 care homes, impacting 2,000 residents and 1,500 staff, in some of the most deprived areas of the UK. In the largest UK care home it reduced falls by 43%. The government has committed to fund a national roll out of action in winter 2023, reaching 15,000 care homes. Co-applicants Further contributors Get in touch: research.innovation@nottingham.ac.uk Jubilee Conference Centre Jubilee Campus Triumph Road Nottingham, NG8 1DH"
        }
    ],
    "pdf_files": []
}