{
    "url": "https://www.nottingham.ac.uk/fabs/getting-in-shape/index.aspx",
    "content": [
        {
            "p": "The vision for the Lean Team is that it will contribute to a strong, effective and engaged organisational culture by helping to remove pain points, improve processes and reduce waste to invest our time and resources in ways that will address our challenges and build on our strengths. Like any other university service here at Nottingham, we are dedicated to delivering positive change to the Universities Culture and Habits, Organisational Efficiency and Financial Stewardship. Subsequently, there are no financial targets attached to the Lean Team as the plan is to balance effort and resource to achieve all of these objectives. Our purpose is to enable Continuous Improvement across the organisation. We are using the principles and methodologies of Lean thinking to enable that delivery. Here you will find an overview of how we structure our support to enable and develop a continuous improvement (Lean) culture in your area. This will also help you understand how our joint commitment will strengthen your improvement journey in the long-term. Our work aligns with three themes; Culture and Habits, Organisational Efficiency and Financial Stewardship. We have introduced three modes of delivery to underpin these. We can support your team through bespoke or standalone training courses or can work with several cross-university teams to tackle a complex issue. Training and supporting teams to identify and tackle issues Working with teams to tackle an issue within their department or cross-university teams Developing and connecting practitioners across the University to amplify organisational effectiveness How our 3 modes work together 1 2 3 Based on work you have already undertaken individually, as a team or broader group, you may feel ready to act and make your identified changes. In some cases, particularly where there is complexity, the next steps may not seem so clear. If you would like some support, please get in touch with the Lean Team. Contact Us form for internal staff"
        }
    ],
    "pdf_files": []
}