{
    "url": "https://www.nottingham.ac.uk/fabs/procurement/supplier-zone/modern-slavery-act-2015-msa.aspx",
    "content": [
        {
            "p": "The University of Nottingham is taking steps to ensure transparency in its supply chains and is committed to acting ethically and with integrity in all its business dealings and relationships. The University of Nottingham already has in place an Ethical Framework that comprises a set of principles, structures, policies and procedures that underpin and demonstrate the ethical standards that the University sets across all of its activities. In addition a number of policies govern how the University conducts its business operations, to include sustainable, environmental, economic and social considerations in its purchase of goods and services. In particular the University of Nottingham is taking action to comply with the requirements of section 54 of the Modern Slavery Act 2015 which came into force on 29 October 2015. Section 54 requires certain commercial organisations which supply goods or services and carry on a business in the UK to produce and publish an annual slavery and human trafficking statement. The government guidance requires such a statement to be published within six months of the organisation’s financial year end. The University of Nottingham’s financial year end is 31 July. The University of Nottingham is currently taking steps to identify sections of the University where the business and supply chains may pose particular risks in terms of slavery and human trafficking, and where such risks are identified, to assess what steps need to be taken to prevent, monitor and mitigate such risks. The University is also looking to incorporate a modern slavery and human trafficking policy and arrange appropriate training for staff. The University of Nottingham supports avoidance of child labour, respecting human rights, avoiding exploitation and ensuring transparency in its supply chain. Director of Procurement June2016 University Governance, Regulations and Procedures King's Meadow Campus Lenton Lane Nottingham, NG7 2NR For queries please email procurement@nottingham.ac.uk."
        }
    ],
    "pdf_files": []
}