{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/news-listings/university-of-nottingham-partnership-sparks-innovation-in-clean-energy.aspx",
    "content": [
        {
            "p": "A partnership that pairs researchers from the University of Nottingham with a UK manufacturer is set to strengthen the company’s competitive edge, by creating new capability and in-house-expertise in clean energy. Kingsmill Industries Ltd is one of the leading manufacturers and suppliers of earthing materials, lightning protection products and equipment for global markets. The North Nottinghamshire-based firm has partnered with the university to help expand its portfolio and enter a new market through two Knowledge Transfer Partnerships (KTPs). KTPs are a three-way collaboration between a UK-based business or charity, a research organisation, and a qualified graduate known as a KTP Associate who has the capability to lead a strategic business project. Applying research developed within the university’s Power Electronics, Machines and Control (PEMC)Research Group, based at the Jubilee Campus, KTP Associates Shah Meeran Zia and Shangkun Li will work alongside Kingsmill’s existing workforce, taking the lead and injecting know-how and expertise in power electronics and software, to create electric vehicle supply equipment (EVSE) with smart functions. The KTP will develop a UK-made electric vehicle charger with a supporting cloud-based portal, enabling Kingsmill’s customers to benefit from variable-tariff regimes and incorporating clean energy as a source of the charger's power supply. This activity will support Kingsmill in its expansion in the clean energy sector by developing an in-house manufactured product to serve the increasing demand fuelled by the growing adoption of electric vehicles. Professor Sumner continued: “A good example of the function of the new EV charger is in using the battery of an EV to support the local grid at peak times, and then recharging the EV overnight when there are fewer demands on the grid. The portal will support system management and facilitate remote interactions by end users and provide a secure infrastructure to support innovative ‘Smart Grid’ technologies.” The second KTP partners Kingsmill with Nottingham University Business School (NUBS) and KTP Associate Pischanath Ariyapolkanoksin and will see the creation of an innovative and bespoke material requirements tool and work-flow management module. The module will be capable of supporting rapid growth in the volume of transactions, while managing customer expectations, optimising inventory and human resource. David Thorpe, Kingsmill’s Managing Director, said “We are no strangers to Innovate UK’s KTP scheme, having successfully completed one in 2023, which enabled us to take huge steps forward in our ability to carry out sophisticated modelling of earthing and lightning projects. These two new projects with the University of Nottingham are very exciting for us and will enable us to hone our competitiveness through improved operational ability, as well as take us into exciting new markets in the renewables sector.” Both projects aim to future-proof Kingsmill’s business strategy as it expands into a complex and demanding new market. With the support and expertise from researchers at the University of Nottingham, Kingsmill is on the front-foot in response to a global need for clean and renewable energy, while also putting the needs of its customers first. More information is available from Sarah Connor, at the University of Nottingham, at sarah.connor@nottingham.ac.uk; or Danielle Hall, Media Relations Manager at the University of Nottingham, at danielle.hall@nottingham.ac.uk or 0115 846 7156. Notes to editors: About the University of Nottingham Ranked 32 in Europe and 16th in the UK by the QS World University Rankings: Europe 2024, the University of Nottingham is a founding member of the Russell Group of research-intensive universities. Studying at the University of Nottingham is a life-changing experience, and we pride ourselves on unlocking the potential of our students. We have a pioneering spirit, expressed in the vision of our founder Sir Jesse Boot, which has seen us lead the way in establishing campuses in China and Malaysia - part of a globally connected network of education, research and industrial engagement. Nottingham was crowned Sports University of the Year by The Times and Sunday Times Good University Guide 2024 – the third time it has been given the honour since 2018 – and by the Daily Mail University Guide 2024. The university is among the best universities in the UK for the strength of our research, positioned seventh for research power in the UK according to REF 2021. The birthplace of discoveries such as MRI and ibuprofen, our innovations transform lives and tackle global problems such as sustainable food supplies, ending modern slavery, developing greener transport, and reducing reliance on fossil fuels. The university is a major employer and industry partner - locally and globally - and our graduates are the second most targeted by the UK's top employers, according to The Graduate Market in 2022 report by High Fliers Research. We lead the Universities for Nottingham initiative, in partnership with Nottingham Trent University, a pioneering collaboration between the city’s two world-class institutions to improve levels of prosperity, opportunity, sustainability, health and wellbeing for residents in the city and region we are proud to call home. More news… The University of Nottingham YANG Fujia Building Jubilee Campus Wollaton Road Nottingham, NG8 1BB telephone: +44 (0) 115 951 5798 email: pressoffice@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}