{
    "url": "https://www.nottingham.ac.uk/fabs/finance/old-contact.aspx",
    "content": [
        {
            "p": "Thank you for contacting the University of Nottingham finance department. The Finance office will be working remotely until further notice as a result of government guidance on COVID19. Purchasing Process During COVID-19 Where costs and services were incurred prior to 20 March 2020, the payments services process (for invoices) and expenses processes will be operating as normal. All new spend should follow the process as set out below. Spend Type What To Do Email To: Ongoing Estates, Catering and Hospitality service contracts: Examples: Utilities, Rent, waste disposal, Sodexo Complete a non-standard payment request form with approval from an Estates Director. Send invoice and non-standard payment request form to Payment Services NSP@nottingham.ac.uk IS Contracts: Examples: Infosys, Xerox Complete a non-standard payment request form with approval from an IS Director. Approved Estates business cases (that has not been paused) Estates team only. Follow the normal process: raise a requisition on Agresso with normal approvals – confirm that necessary approvers are available before placing the requisition N/A Food and accommodation provision for students Nicola Penn’s team only. Follow the normal process and payment methods. Research Subcontractor invoices Send to relevant R&I Project Coordinator for approval. Project Coordinator completes non-standard request payment. Sends invoice and non-standard payment form to Payment Services Nottingham Research Fellows All queries to Catherine Jew Catherine.jew@nottingham.ac.uk Recruitment through Unitemps / Tempzone / agency / fixed term contracts (new and extensions) Casual Recruitment through HR Permanent Recruitment All recruitment requests will be reviewed and approved by the Emergency Finance Group. This includes all research recruitment and contract extension requests. Please send an email describing the recruitment / contract extension need and rational, including approval from your relevant FPVC or UEB member, to the Emergency Finance Group inbox. The request will be considered at the next sitting of the Emergency Finance Group. Next steps to recruit can only be taken upon receipt of approval from this group. Please raise an ATF, which must be approved by a member of UEB (or nominee) For Permanent staff, please raise ATF in Vacancy Manager in line with the usual process. BB-Emerg-FinanceGrp (emergencyfinancegroup@nottingham.ac.uk) Strategic Investment Approval through PRC and other UEB sub-committees in line with normal University process and delegated authorities. All other spend requests (including non-pay research expenditure) Consider whether expenditure is essential – see Essential expenditure guidelines below. Complete the Critical Purchase requisition form and obtain approval for planned expenditure: For expenditure up to £500: Obtain approval from your relevant Head of School, Director of Operations or Directors of Professional Services by email Head of School/Directors of Professional Services to forward the spend request and approval to Critical Purchasing Team For expenditure between £500 and £1,000: Obtain approval from your relevant Head of School, Director of Operations or Directors of Professional Services by email. Obtain approval from your relevant Faculty Pro Vice-Chancellors, or relevant UEB budget holder by email. FPVC or UEB Member to forward the spend request and approval to Critical Purchasing Team For expenditure above £1,000: Complete spend requisition form, including justification for this being critical spend Obtain approval from your FPVC or UEB member on email and append this to the requisition Send the requisition and FPVC/ UEB member approval to the Emergency Finance Group by email. The request will be considered at the next sitting of the Emergency Finance Group and next steps to purchase can only be taken i.e. requisition or purchase card order upon receipt of approval from this group. All approved items will be forwarded to Critical Purchasing Team (or Procurement team – as relevant) for processing by the administrators supporting EFG. The originator will be provided with feedback on the approval outcome by the administrators supporting EFG. BB-FM-CriticalPurch (bb-fm-criticalpurch@nottingham.ac.uk) Loan of laptops Staff should complete the laptop request form to request the loan of a University laptop for home working. There are only a limited number of laptops, so these can only be offered to staff who: - Have roles that are critical to the continued operations of the University - Do not have a work laptop - Do not have a personal device at home that they can use Requests will be reviewed on a case-by-case basis and will be subject to approval by the Head of Faculty/Department and Information Services. Complete the laptop request form. Home internet Access There are some staff that hold critical roles but do not have internet access at home to enable them to continue working during the current isolation period. A process has therefore been set up to provide financial support so staff can purchase an internet service and can claim the incurred charges through expenses. If you have staff in your teams that are vital to the current operations of the University and do not currently have internet access at home, please ask them to complete the internet service request form. After we receive submissions: Staff should look at short-term contracts for their internet service, such as monthly contracts, and we will reimburse them for the setup and monthly charges they incur for working at home. Please note that this only applies to requests that have been approved through the process above. Complete the internet service request form Essential expenditure guidelines Reviews, approvals or refusals for applications for essential expenditure will be judged against the following guidelines: Additional equipment required for home working – Health and Safety In exceptional circumstances, there may be a requirement for the University to provide additional equipment (non IT) to employees who are working home working from a health and safety perspective. Where this is the case, the following procedure must be adopted: email list: Please see our contacts page"
        }
    ],
    "pdf_files": []
}