{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/news-listings/69.5m-funding-is-testament-to-the-quality-of-our-research-and-knowledge-exchange.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy October 31, 2024, by Rob Ounsworth Research update by Professor Sarah Metcalfe, Deputy Pro-Vice-Chancellor for Research and Knowledge Exchange I am delighted to share news that the university is to receive £69.5m in quality-related research funding (QR) for the 2024/25 academic year. This is our largest source of public funding for research and is the university’s share of the £2bn allocated to universities each year by Research England. The majority of our QR allocation is linked to the university’s performance in the 2021 Research Excellence Framework and includes Higher Education Innovation Funding (HEIF), which supports knowledge exchange between our sector and the wider world. During a challenging time for universities, as confirmed in yesterday’s budget, this £69.5m award is hugely positive news for our research community and testament to the quality and power of research at the University of Nottingham. What does this mean for our research community? Our £69.5m award will support the delivery of the university’s research and knowledge exchange strategy, with a focus on building research income and further developing our excellence in research as we prepare for the next REF in 2029. To support these strategic goals, we are determining how to further develop our key strengths in research and knowledge exchange, and how to gain leverage from these to build our reputation for addressing global challenges, grow revenue and respond to funding and partnership opportunities. It is worth emphasising that the exceptional research conducted at faculty, school and group level is also hugely significant in building the university’s reputation – our exercise in mapping our institutional strengths is identifying opportunities to bolster such activity and its impact on Nottingham’s profile. Despite some of the challenges we’re facing, we know that a little can go a long way. To that end, the university executive has earmarked £1.3m of the uplift funds to support research activities and development. This will be split evenly between programmes such as Unicas, which brings together cross-disciplinary groups and provides funding for novel research projects, and the International Research Collaboration Fund (IRCF), and support for REF. Supporting interdisciplinary research We are committed to building the university’s capacity for interdisciplinary research, and to encouraging and supporting our researchers in forming exciting, collaborative partnerships across the university. This is a pillar of our vision for research and key to our ability to address complex challenges. We are looking at ways to support the forging of cross-disciplinary partnerships and to bring people together to share ideas, offer solutions and raise awareness of the tremendous work that goes across our research community. Improving the researcher experience We remain committed to delivering programmes designed improve the researcher experience. On behalf of Professor Tom Rodden and all the research leadership team, our thanks once again go to the faculty and Research and Innovation (R&I) teams who have delivered real progress in this area. A vibrant, welcoming research culture We pledge to build an inclusive and supportive research culture where colleagues are enabled and empowered to achieve their potential. This is the cornerstone of our vision for a successful research ecosystem. Professor Katherine Linehan, Pro-Vice-Chancellor for People and Culture, is leading on engagement programmes to enrich the environment for all colleagues involved in the delivery of our research. Research Leadership Programmes Our Research Leadership Programmes equip researchers with essential skills to thrive in collaborative, interdisciplinary environments. Not only will you advance your own career, but you will also be positioned to mentor, inspire, and lead others. Helping our researchers develop and achieve excellence in a supportive environment will create a ripple effect that enhances the entire research ecosystem. Professor Jeanette Woolard, Associate Pro-Vice-Chancellor for the Researcher Academy and Research Culture Development, is leading this key pillar of our research strategy. International vision for research The university is committed to delivering international research and KE that will help transform lives and achieve a sustainable future. We recognise that working with international partners is central to doing this and to our identity as a global university. We’re committed to supporting all staff across our campuses in the UK, China and Malaysia in delivering our vision for research, as reflected in our recently finalised International Research and Knowledge Exchange (IRKE) strategy. This focuses on delivering excellence, collaborating to deliver global sustainability by making a meaningful contributions to the United Nations Sustainable Development Goals and building collaborations across our three campuses Achieving our goals The key and underlining message behind the £69.5m allocation of funding is our commitment to the delivery of exceptional discoveries, and support for the exceptional, dedicated people who make this happen. The research webpages are meanwhile being updated to better reflect our strengths and make our vision for research more compelling and engaging for our stakeholders, partners and potential collaborators. New-look team as VC says farewell As we say farewell to Professor Shearer West as Vice Chancellor and President, we welcome colleagues in new interim roles. From 1 November, Professor Jane Norman, Deputy Vice-Chancellor and Provost, will serve as Interim VC. Professor Sam Kingman will serve as interim DVC and Provost. Professor Chris Tuck has been appointed Interim Pro-Vice-Chancellor for the Faculty of Engineering, while Professor Kingman serves as interim DVC. Sam will oversee strategic and operational planning and continue to work with faculty colleagues to ensure the delivery of our world-changing research. Professor Jane Norman appointed to UKRI Board Professor Jane Norman has meanwhile been appointed as a new non-executive director to the UK Research and Innovation (UKRI) Board. Professor Norman will join members of the UKRI Board in supporting and challenging the country’s largest public funding body for science, research and innovation, to ensure the organisation achieves its strategic objectives. UniCore update for researchers We are in the Unicore cutover period. This transition phase will last until 25 November, when our new HR, Finance and Procurement system will go live. Please read this update, aimed at researchers and colleagues who support research. The cutover period will inevitably cause some disruption to our usual ways of working. If you have any immediate concerns, please talk to your local team for support. Thank you for your ongoing understanding and support. For more detailed information, please visit the R&I SharePoint site. Training resources are available on the UniCore training webpage. Get ready for Researchfish 2025 submission Researchfish is an online platform that allows researchers to showcase the outcomes and impact of their funded research. By reporting through Researchfish, we help demonstrate the value of over £45bn in funding to universities from government, donors, and stakeholders – key to supporting our university’s research strategy. The 2025 Researchfish submission window runs from Monday, 3rd February to 4pm on Thursday, 13 March 2025. The University of Nottingham has been using Researchfish since 2012 to report on the breadth and depth of our partnerships with funders. I would like to thank all colleagues for their continued support and recognition of the vital role Researchfish plays in demonstrating the outputs and impacts of our world-class research. Research operations team win international recognition Congratulations to the Research Operations team within R&I, which has been recommended for independent certification to ISO 9001 (Requirements for Quality Management Systems). This milestone highlights the team’s dedication to continual improvement and the implementation of a robust quality management system that meets international standards. It reflects R&I’s commitment to streamlining operations and meeting the needs of our researchers. Research governance: enhanced guidance The new Research Governance SharePoint site is a comprehensive resource designed to support our research community. The site provides a wide range of information, tools, and guidance to help navigate the research governance process. Welcome to postgraduate researchers Finally, the university is delighted to welcome a cohort of new postgraduate researchers. Starting as a postgraduate researcher can be both exciting and daunting and transitioning to PhD study brings new academic expectations and challenges. The Researcher Academy and Faculties offer a range of inductions, training sessions, and social activities to welcome our new researchers, ease their transition and support them throughout their studies. With thanks and best wishes Professor Sarah Metcalfe Deputy Pro-Vice-Chancellor for Research and Knowledge Exchange No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}