{
    "url": "https://www.nottingham.ac.uk/fabs/htmlsnippets/about-section-page.htm",
    "content": [
        {
            "p": "Headed up by the Chief Financial Officer (CFO), Margaret Monckton, Finance and Infrastructure (F&I) incorporates a number of services and sections covering the University's financial and business facilities and infrasture as well as various aspects of financial and procurement governance: The Commercial team has overall responsibility for all aspects of commercialisation, whilst mitigating operational, commercial and compliance risk. The Digital and Technology Services (DTS) team provides IT services and support to staff and students at the University's UK and the International Campuses The Financial Control (FC) team informs financial policy decisions and provides financial accounting (including Treasury) and ensures the service delivery for all income collection and payments to all customers (students, employees and suppliers), ensures the University is tax compliant, has responsibility for all insurance and travel and expenses claims/queries. The team also has responsibility for procurement including the delivery of value for money through good procurement practice in Schools and Departments. The Getting in Shape (GiS) team enable continuous improvement across the university through the development of Organisational Efficiency, Culture and Habits and Financial Stewardship. Our team of experienced Practitioners work to build Lean Capability, Enable Improvements and Embed Lean thinking with our colleagues. Further details can be accessed via their internal SharePoint site. The Internal Audit Service (IAS) team provides an independent appraisal of the University's activities and provides assurance on the arrangements for risk management, control and governance The Research and Innovation (R&I) team aims to deliver business engagement and knowledge transfer objectives as set out in the University's Strategic Plan 2020. Supporting the development and delivery of the University's Research and Knowledge Transfer Strategy, and contributes expertise and guidance across the full spectrum of the University's research and doctoral training policies and activities. The R&I team also offers a range of services to corporate partners, small and medium sized businesses, and support for academics who want to engage with industry."
        }
    ],
    "pdf_files": []
}