{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/keiawards24/programme/nominations-faculty-of-engineering.aspx",
    "content": [
        {
            "p": "Project lead: Professor Dragos Axinte, Manufacturing Engineering Rolls-Royce UTCs are long-term partnerships between a university and Rolls-Royce in a key technology area. The Manufacturing and On-Wing UTC not only addresses challenging research questions, but it engages with the real world by developing solutions to industrial problems, trains the next generation of industry-ready engineers, and is helping Rolls-Royce transition to net zero. The UTC was established in 1999 and this nomination recognises success over a sustained period. Achievements include: Project team Rolls Royce team Further contributors Project lead: Dr Christopher Wood, Department of Architecture and Built Environment Air leakage, or airtightness testing, is important for understanding the energy efficiency of a building and its ventilation requirements, which is essential for ensuring good air quality for occupants at low energy cost. Reducing carbon emissions by improving the energy efficiency of the UK’s 27 million existing homes is a key contributor to our net zero targets. The Nottingham team developed a disruptive new technology to measure airtightness and ventilation in residential buildings using a novel pulsed air methodology. Following an Innovate UK project to further develop the technology, our industrial collaborators formed start-up company Build Test Solutions Ltd to commercialise the technology, licensed from Nottingham. To date, hundreds of Pulse Test units have been sold to customers worldwide with more than 40,000 Pulse tests carried out in commercial applications. Build Test Solutions Project lead: Dr Liliana de Lillo, Department of Electrical and Electronic Engineering OCTOPUS was an Innovate UK-funded consortium of leading international experts tackling the challenge of creating a single component drivetrain for electric vehicles, with UoN and spin-out TTPi Ltd working together to develop the power converter element. The UoN/TTPi convertor reduced weight and material usage and equal or better performance when compared to top-of-the-range commercial power converters. The overall integrated motor design will disrupt the industry by delivering a lower cost and more recyclable automotive motor, with similar performance to the state of the art. Project partners Bentley Motors and the wider VW group are now developing the technology further and investigating options for commercialisation. Spin-out TTPi Ltd was awarded ‘Best R&D Project’ at the 2023 Engineering and Manufacturing Awards for their contribution. TTPi Ltd Team Get in touch: research.innovation@nottingham.ac.uk Jubilee Conference Centre Jubilee Campus Triumph Road Nottingham, NG8 1DH"
        }
    ],
    "pdf_files": []
}