{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/keiawards18/categories.aspx",
    "content": [
        {
            "p": "There are nine awards available to recognise outstanding knowledge exchange activities amongst academic colleagues across all three campuses of the University of Nottingham. All shortlisted entrants will be invited to attend the awards dinner on the evening of Thursday 22 November 2018 at the East Midlands Conference Centre. Please note the application deadline for all awards is now closed. Applicants are invited to submit entries which demonstrate collaborations that have made a significant impact or has the potential to create significant impact, on a specific business, or a group of businesses in one or more industrial sectors. Alternatively, entries may focus on work which has had a major impact on society or a specific group of the public, or on public policy. The panel of judges will be looking for entries which demonstrate how a project has met each aspect of the criteria. The entries will be short-listed based on the following criteria: These Media Awards celebrate academics based on all campuses who have successfully promoted their work through the media. They must be nominated by their school, faculty or a media relations manager. Judges of this category will select one winner from a shortlist of three for each award, namely: We invite nominations made by a senior member of staff at faculty or school level or by a member of the Media Relations team. Please liaise with the Media Relations team before submitting your nomination. The panel of judges will be looking for entries which demonstrate how the academic and/or team has met each aspect of the criteria. The entries will be shortlisted based on the following criteria: For more information about these awards, please contact Liz Cass. This award recognises outstanding academics based on all campuses whose research findings and communications have influenced the formation or implementation of public policy. This may be through working with politicians, civil servants or any other type of policymakers or influencers at any geographical location. We invite both self nominations and nominations made by a senior member of staff at faculty or school level or by a professional services staff member. Entries must demonstrate how the academic and/or team has met each aspect of the criteria. Applications will be judged against the following core criteria: For more information about this award, please contact Leonie Mathers This award recognises an academic who, over the course of their career, can clearly evidence a sustained engagement in knowledge exchange for the benefit of industry and commerce and/or society. Entrants for this award can be nominated by others, or may choose to self-nominate via the entry form online. There will be one award winner for this category. The panel of judges will be looking for evidence of: Each Faculty will convene a judging panel for the awards chaired by the relevant faculty Pro-Vice Chancellor. The Vice Chancellor's Knowledge Exchange Award will be judged by a panel chaired by Professor Dame Jessica Corner. The Media Awards will be longlisted by faculties and a final shortlist of three will be selected by a panel from the External Relations team. Jubilee Conference Centre Jubilee Campus Triumph Road Nottingham, NG8 1DH telephone: +44 (0) 115 748 4555 fax: +44 (0) 115 823 2181 email: keiawards@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}