{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/keiawards24/programme/nominations-faculty-of-social-sciences.aspx",
    "content": [
        {
            "p": "Project lead: Dr Stephanie Coen, School of Geography Anterior cruciate ligament rupture is a sports injury that occurs up to six times more frequently in females than males. It has detrimental impacts on short- and long-term physical activity levels and musculoskeletal health. Attempts to explain and remedy this disparity have focused on sex-based characteristics such as female anatomy, physiology and hormones, The team developed a novel ‘gendered environmental approach’ published in the British Journal of Sports Medicine which has moved the conversation from a primary concern with women’s biology to an interest in environmental factors such as access to and experiences with sport and training. It has been used by Football Australia and FIFPRO in their injury prevention and workload policies and we have delivered invited presentations to elite sport organisations, including the European Club Association, Crystal Palace FC and the UK sports institute. Project team Dr Stephanie Coen University of Manitoba, Canada Dr Joanne Parsons University of Bath Dr Sheree Bekker Project lead: Dr Helen McCabe, School of Politics We have centred the survivor voice in work to end modern slavery including human trafficking and forced marriage, as well as other forms of violence against women and girls. This has involved: We have translated these into educational tools and engaged the expertise of front-line staff to better understand prevalence, practice and the impact of government policy. This work has impacted survivors through development of activism and survivor support organisations; third sector organisations through policy and practice via co-developed research; local government knowledge and practice via training programmes; and the public through exhibitions and education. University of Birmingham Project lead: Professor Doreen Boyd, Rights Lab. The UN and 193 countries set the goal of ending modern slavery by 2030. But if you can’t see a problem, you can’t generate solutions. Pixel by pixel, acre by acre, we have shone a light into modern slavery's darkest corners: the most hidden industries and prevalent forms. Since 2017 we have delivered the world’s first comprehensive geospatial analyses of modern slavery sites, mapping slavery’s forms and locations, extent and root causes, and established that nearly half of all the world’s slavery can be seen from space. This work has fast-tracked interventions for multiple governments, intergovernmental groups and NGOs. More people have come to freedom because the team has shown where and why slavery occurs and how best to eradicate it. Launched during the 50th anniversary of the Space Race, this is the anti-slavery moon-shot. Professor Doreen Boyd Dr Bethany Jackson Dr Edgar Rodríguez-Huerta Albert Nyarko-Agyei Dr. Renoy Girindran Cristina Vrinceanu Professor Giles Foody Get in touch: research.innovation@nottingham.ac.uk Jubilee Conference Centre Jubilee Campus Triumph Road Nottingham, NG8 1DH"
        }
    ],
    "pdf_files": []
}