{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/keiawards24/programme/nominations-faculty-of-arts.aspx",
    "content": [
        {
            "p": "Project lead: Professor Heike Bartel, School of Culture, Languages and Area Studies. Focussing on patient-centred narratives, our projects on ‘Eating Disorders in Men and Boys’, ‘Long Covid’ and ‘Gender Based Violence’ show the perspectives of under-represented groups living with and seeking care for complex mental and physical health issues. Multi-disciplinary collaborations drawing on these narratives have led to a suite of arts-based illness/trauma testimonials and five unique multi-media online training tools. Available in five languages and informed by clinical practice, these training tools are benefitting GPs, nurses, medical and nursing students and educators and third sector organisations, nationally and internationally. Impacts of the work include substantial policy changes in the second-largest UK eating disorders charity and changes in HEI teaching and GP training. Crucially, this work has led to patients reporting feeling heard, recognised, and valued. Project team Project lead: Professor Alex Mullen, School of Humanities LatinNow is an interdisciplinary project rewriting the social history of the Roman West. We investigated and illuminated precisely how, when, and why Latin all but replaced the patchwork of other local languages in the north-western Roman Empire and confronted large-scale socio-cultural issues concerning identities, life and languages. The project challenged assumptions about the spread of Latin and showed the importance of local languages and lesser-heard voices, generating new understanding of the Roman world, with implications for the modern. Outputs include a six-country, six-language touring exhibition, multilingual school materials and outreach, an open-access website (Roman Inscriptions in Britain Online; 195,000 users and millions of hits monthly), and webGIS. Museum staff have used the tour and the associated training to change their practices, and the team continues to work with them on LatinNow-inspired projects. Further contributors Project leads: Professor Helen Kennedy, School of Cultures, Languages and Area Studies Live, Experiential and Digital Diversification (LEADD:NG) was led by Arts and Computer Science and delivered by a ‘talent pool’ of more than 20 researchers from across the university. This depth and breadth of expertise was activated to support local and regional SMEs, artists, freelancers, and performers in their engagement with powerful immersive technologies such as VR, AR, ambisonic sound and projection mapping. More than 150 individuals and organisations were engaged, with 65 benefitting from support through workshops, hackathons, mentoring and prototyping sessions and 36 supported to develop new services, products, and experiences. The project has created a rich network of new KE relationships and has inspired nationally significant new artistic and commercial interventions, putting Nottingham on the Creative Industries map as a significant cluster with considerable potential for investment in the burgeoning immersive experience economy. . Get in touch: research.innovation@nottingham.ac.uk Jubilee Conference Centre Jubilee Campus Triumph Road Nottingham, NG8 1DH"
        }
    ],
    "pdf_files": []
}