{
    "url": "https://www.nottingham.ac.uk/fabs/contacts.aspx",
    "content": [
        {
            "p": "Headed up by the Chief Financial Officer, Finance and Infrastructure is comprised of individual sections which help and support staff, students and suppliers to the University as well as covering some of the major infrastructure teams across the business. Please read the descriptions below carefully to make sure your query is directed to the correct section. The Estates and Facilities Management team provides strategic and operational services support to the University infrastructure, buildings and landholdings. This function also includes the Nottingham Hospitality and Nottingham Conferences Tel: +44 (0) 115 95 16666 (Estate Office helpdesk) Further information can be found on the Estates and Facilities Management website The Financial Management provides timely and accurate financial information, business partnering and services and advice to support and inform effective and efficient management and control of the University t: +44 (0) 115 84 67116 further information can also be found on the Finance Department website The Financial Control is responsible for all finance transactions handled by the University incl, bank, cash, paying and raising invoices, payroll, pensions, the online shop, travel and expenses, debt management and insurance. t: +44 (0) 115 95 15651 The Information Services Department provides IT services and support to staff and students at the University's UK and the International Campuses t: +44 (0) 115 84 68555 f: +44 (0) 115 84 68244 further information can also be found on the Digital and Technical Services website The Internal Audit Service (IAS) provides an independent appraisal of the University's activities. Our role is to give assurance on the arrangements for risk management, control and governance and to give advice to support the achievement of good practice t: +44 (0) 115 84 67116 e: ias@nottingham.ac.uk further information can also be found on the Internal Audit Service website The Procurement Department has overall responsibility to facilitate the delivery of value for money through good procurement practice in Schools and Departments, whilst mitigating operational, commercial and compliance risk. t: +44 (0) 115 95 13634 e: procurement@nottingham.ac.uk further information can also be found on the Procurement Department website Research & Innovation (R&I) supports the development and delivery of the University's Research and Knowledge Transfer Strategy, and contributes expertise and guidance across the full spectrum of the University's research and doctoral training policies and activities. It is also responsible for business engagement and knowledge transfer and contribute expertise and guidance across the full spectrum of the University's innovation activities t: +44 (0) 115 95 15670 f: +44 (0) 115 95 13633 Further information can also be found on the Research and Innovation website For any other queries, please call the office of the Chief Financial Officer on +44 (0) 115 82 32480 Chief Financial Officer Room A18 Trent Building University Park Nottingham, NG7 2NR Telephone: +44 (0) 115 82 32480 Contact details for the each of the separate divisions that comprise the Finance and Infrastructure team can be found on our contacts page."
        }
    ],
    "pdf_files": []
}