{
    "url": "https://www.nottingham.ac.uk/fabs/procurement/sustainability/procurement-sustainability-strategy.aspx",
    "content": [
        {
            "p": "The University of Nottingham is committed to sustainable procurement. Purchasing decisions have a major socio-economic and environmental implications, both locally, nationally and globally, now and for generations to come. The University aims to ensure that its activities meet the diverse needs of students, the economy and society. The University has developed a Sustainable Procurement Policy that links to the wider Corporate Social Responsibility Agenda and the objectives below are an integral part of that wider policy. Act in a sustainable environmentally responsible way Continue the University’s contribution to advancing the environmental agenda with both the region and the Higher Education sector Engage with the University’s suppliers and contractors to ensure that goods and services are sustainably procured and meet the University’s environmental standards and, in turn, that they demonstrate and progressively improve their own sustainable environmental performance Specify sustainable environmentally friendly products wherever appropriate Ensure where appropriate sustainable environmental criteria are used in the award of contracts Consideration should be given to the whole life costs and benefits of environmentally preferable products and services alternatives, such as: Manufacture, delivery, installation Operating costs including energy, water usage and maintenance End of life costs including decommissioning and disposal Suppliers’ sustainable environmental credentials should be, as far as practicable, considered in the suppliers’ appraisal process. Promote where appropriate and practical sustainable Fair Trade buying principles. Work with key suppliers to bring about changes and spread sustainability improvements throughout the supply chain. These will include: Avoiding products with particularly harmful substances Favouring economical products with recycled content or that are biodegradable Forestry Stewardship Council) Buying products using recognised labelling schemes e.g. FSC or EU Eco label Encourage suppliers to achieve environmental credentials such as environmental systems for ISA14001 or EMAS (ECO Management Audit Scheme) Key Performance Indicators (KPIs) Progression on the Governments's Framework. Government's Sustainable Procurement Flexible Framework Sustainability - UoN Policy and performance King's Meadow Campus Lenton Lane Nottingham, NG7 2NR For queries please email procurement@nottingham.ac.uk."
        }
    ],
    "pdf_files": []
}