{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/news-listings/knowledge-exchange-and-impact-awards-2024-inspirational-winners-show-research-impact.aspx",
    "content": [
        {
            "p": "February 6th, 2024 A pioneering wristband that could help alleviate symptoms of Tourette’s Syndrome, an innovative method to reduce carbon emissions by improving UK home energy efficiency, and a training scheme to prevent falls in care homes, are just some of the exciting projects that were recognised at a recent research awards ceremony. The event was described as an awe-inspiring showcase of the impact of research and knowledge exchange at Nottingham and was a fantastic way to celebrate people and their success. Several colleagues behind these ground-breaking – and often life-changing – initiatives were among the winners at the Knowledge Exchange and Impact (KEI) awards on Thursday 1 February 2024. More than 250 people – including researchers, industry and civic partners– attended the awards at University Park campus’ East Midlands Conference Centre, to shine a light on Nottingham’s amazing research and Knowledge Exchange (KE) output. Organised by the IP and Commercialisation team’s Dr Susan Huxtable, Director of IP Commercialisation, and Mrs Maxine Lazzari, IP Team Administrator within the university’s Research and Innovation department, the awards honoured all five university faculties – Arts, Engineering, Social Sciences, Medicine and Health Sciences, and Science – whilst a separate category recognised up-and-coming “rising stars” in their respective research fields. Professor Stephen Jackson, School of Psychology, won the KEI award for the Faculty of Science, for the development of a wearable device called Neupulse that can alleviate symptoms of Tourette’s Syndrome. The wristband uses electrical stimulation of the nervous system to alter brain activity and help reduce physical tics and the urge to tic. From the Faculty of Social Sciences, Professor Doreen Boyd from the university’s Rights Lab picked up the award, for a project that conducted a detailed analysis of modern slavery. Entitled “Slavery from Space: Using Satellites for Human Rights and Sustainable Development” the research is designed to support a goal set out by the United Nations and a partnership of 193 countries to end modern slavery by 2030. Professor Boyd said: “Pixel by pixel, acre by acre, we have shone a light into modern slavery’s darkest corners: the most hidden industries and prevalent forms. Since 2017 we have delivered the world’s first comprehensive geospatial analyses of modern slavery sites, mapping slavery’s forms and locations, extent and root causes, and established that nearly half of all the world’s slavery can be seen from space.” This work has fast-tracked interventions for multiple governments, intergovernmental groups and NGOs, and more people have been given their freedom because the team has shown where and why slavery occurs and how best to eradicate it. Among other announcements on the night was the award for the Faculty of Arts, which went to Professor Heike Bartel, School of Culture, Languages and Area Studies, in recognition of her work to highlight the perspectives of under-represented groups with complex mental and physical health issues. Dr Christopher Wood, Department of Architecture and Built Environment, triumphed in the Faculty of Engineering category. His team developed a disruptive new technology to measure airtightness and ventilation in residential buildings, which led to the creation of a start-up company – Build Test Solutions Ltd – to commercialise the technology. To date, hundreds of pulse test units have been sold to customers worldwide with more than 40,000 pulse tests carried out in commercial applications. Meanwhile, for the Faculty of Medicine and Health Sciences, the care home safety-focused project by Professor Pip Logan took the award. Entitled “Action Falls: reducing falls in people living in care homes, the research developed a training programme – Action Falls – to train staff to better assess situations where there is a risk of falls occurring and to take preventative action. The ceremony was introduced by Professor Shearer West, Vice Chancellor, while Professor Tom Rodden, Pro-Vice Chancellor for Research and KE, compered. Professor West also closed the ceremony with the Vice Chancellor’s award; a special accolade in honour of a lifetime of achievement. She announced the winner was Dr Vicky Kemp from the School of Law for her work on access to justice and including improving legal safeguards for suspects. Vicky’s research interests lie in the areas of access to justice, law and technology, the criminal process, youth justice, and clinical legal education. Her research has led to revisions to Parliamentary acts, while her ground-breaking work reviewing different models of clinical legal education has encouraged several universities to expand their involvement in clinical work. Presenting the award, Professor Shearer West said: “Dr Kemp’s long and distinguished career has been characterised by a passion for connecting research to real world outcomes. Her work to help to identify and create improved outcomes for countless people within the legal system is both transformational and inspiring. That dedication to discovery is in our DNA at Nottingham, but Vicki’s research also illustrates both her and our passion for translating those discoveries into, policies, products and practices that change lives. “This mission – and Vicki’s own remarkable achievements – would never have been realised without our other passions: for forging partnerships with industry and collaborators; and for exchanging knowledge and insights with our friends and partners.” You can find a list of all winners at the KE Hub SharePoint site. Tags: Knowledge Exchange and Impact Awards, Knowledge Exchange and Impact Awards 2024 Other Need news? See you on SharePoint After 14 years of service, Campus News is being retired as the university’s staff news platform. […] Read more... Roads and car parks closed for refurbishing work As part of ongoing road improvements at the university, works will be taking place to resurface […] New mark sheets for reassessment period – improved and ready for use Appraisal Development Conversations (ADC) training for staff Hallward building: water heater installation"
        }
    ],
    "pdf_files": []
}