{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/news-listings/farm-grown-spirits-crafted-with-nature-boosted-by-science.aspx",
    "content": [
        {
            "p": "Warner’s Distillery Warner’s Distillery is a world leading premium farm-born spirits producer. Its spirits are crafted using natural ingredients directly from the botanical gardens, hedgerows, and natural springs on its farm estate in Harrington, Northamptonshire. Established in 2012, the family-run business was keen to develop a deeper understanding of the interactions between botanical ingredients in the gin distilling and post-distillation process. Passionate about investing in R&D, the company's long-term goal was to become market leaders and category innovators within the spirits industry, by driving product development, increasing consumer engagement and sales. Watch a film with Warner's Distillery Knowledge Transfer Partnerships (KTPs) are a three-way collaboration between a UK-based business or charity, a research organisation, and a qualified graduate known as a KTP Associate who has the capability to lead a strategic business project. Taking place over three years, the University of Nottingham partnered Warner’s Distillery with KTP Associate Rachel Sutherland and Dr Rebecca Ford, Associate Professor in Sensory and Consumer Science at the Sensory Science Centre in the School of Bioscience at the University of Nottingham. Fulfilling the science knowledge gap at Warner’s Distillery, the partnership focused specifically on flavour chemistry, seasonal variation in raw materials, quality testing and sensory capabilities. Key natural ingredients were analysed to identify and address the potential for flavour ‘drift’ over multi-batch and multi-year cycles. Samples from across the company’s product range underwent an accelerated shelf-life study, assessing the impact of temperature and light, to measure the flavours lost over time, resulting in the development of a predictive model for shelf-life for UK and international export. Working with members of the sensory team at the university, Warner’s developed robust and practical sensory assessment methods for measuring flavour in high alcohol products. Finally, the partnership saw the creation of the UK’s largest gin sample set to date, carried out by the University of Nottingham’s International Flavour Research Centre and currently has an academic paper set for publication in 2024 focusing on the behaviour of gin volatile compounds throughout distillation. Following the completion of the KTP, Warner’s went on to win multiple gold awards across the globe including The Gin Masters, Footprint Drinks Sustainability Awards, and the San Francisco World Spirits Awards. Warner’s are leading the way in artisan spirit production and are now B Corporation Certified, solidifying their commitment to making business decisions that create positive impact for the environment, customers, suppliers, employees, and the community. They have also used the knowledge transferred from this KTP to launch a new brand, Trash & Treasure spirits. The partnership exceeded all aims and objectives established at the outset of the KTP and was awarded an Outstanding grade, enhancing Warner’s reputation as market leaders. They have presented the KTP results and findings at high profile national and international spirits conferences, including the Craft Distilling Expo, The Gin Guild’s, and the Worldwide Distilled Spirits conference 2023. Finally, KTP Associate Rachel Sutherland has remained at Warner’s as their Liquid and Innovation Manager. During her time as a KTP Associate, Rachel benefitted from professional development activities facilitated by the university, including leadership courses, a PG Cert in Sensory Science, a IBD certified Brewing Science Diploma and associated statistical analysis course. Rachel also attended sensory courses, networked at industry events including The Gin Guild Banquet in London, and is now an international spirits judge."
        }
    ],
    "pdf_files": []
}