{
    "url": "https://www.nottingham.ac.uk/fabs/research-innovation/meettheteam/min.rose",
    "content": [
        {
            "p": "Deliver research and knowledge exchange impact with China and Asia, and maximise the value of our global footprint through UNNC and UNM, Financial & Business Services Min joined the University of Nottingham in 2011 at the Asia Business Centre which is dedicated to support the University's knowledge exchange activities with China and Asia. Min has 22 years of frontline professional experience of promoting UK-China collaboration across trade, investment, civic, education and cultural collaboration, both at delivery and strategic levels. She was the China Business Advisor for Leicestershire and then the East Midlands China Business Bureau between 2004 and 2011, and has supported 500 companies and institutions in the East Midlands region to develop business links with China. She worked as a civil servant and a lead interpreter (English) for Sichuan Provincial Government in the Foreign Affairs Office between 1997 and 2002, working across different roles ranging from consular services, foreign expert management, protocol and European and American Affairs. Min led on the 'Sino-UK Global Screen Industry Education and Skills Collaboration Pilot Programme' funded by Prosperity Fund managed by British Council in 2017, which explored the skills gap in China's creative industry. She is a member of the AHRC funded 'UK-China Creative Industry Partnership project for 'CREATURE'. The Asia Business Centre, of which Min is a member, won Times Higher Education Leadership and Management Award in 2013 and 2017 in the 'International Strategy' category. Min was commended for the 2014 Mulan Award which recognise Chinese women's achievements in the UK (Contribution to Public Service and Community). Min won the Vice-Chancellor's Award in 2016, and was the winner of Female Employee of the Year East Midlands Chamber Enterprising Women Award 2017. Get in touch: research.innovation@nottingham.ac.uk Jubilee Conference Centre Jubilee Campus Triumph Road Nottingham, NG8 1DH"
        }
    ],
    "pdf_files": []
}