{
    "url": "https://www.nottingham.ac.uk/facts/index.aspx",
    "content": [
        {
            "p": "FACTS is a leading analytical, consultancy and training service for food and bioscience industries, offering a high quality response whether needs are confidential or time sensitive. Our mission is to be a centre of excellence for university-based analysis and consultancy, with a particular focus on food chemistry and flavour chemistry. FACTS is designed to complement the world leading research carried out within Biosciences at the University of Nottingham - read more about our Flavour Research group here. Telephone: +44(0)115 95 16037 Mobile: +44 (0) 777 6456118 Email: Service Director ian.fisk@nottingham.ac.uk Follow us on: Twitter @UoNFoodFlavour Linkedin Through FACTS he has developed novel flavour delivery systems for large multinationals, supported patent protection and infringements cases for industry, provided analytical support and offered technology road mapping and research strategy development. Dr Ni Yang leads our consultancy work as well as conducting research and teaching. Dr Yang's research aims to shape a sustainable flavour system by embedding flavour science from soil and plant, processing and production, to consumption and health. Her current research includes tea and coffee flavour chemistry and trigeminal stimulus linking chili/spicy sensations. FACTS is extremely well equipped, hosting a range of separation and mass spectrometry equipment (HPLC/MS-MS; SPME/GC/MS; DI/GC/MS; GC-O) in addition to its unique service offering of triple quadrupole real-time mass spectrometry (MS-NOSE APCI/MS; MSMS-NOSE APCI/MS-MS). Through collaboration within the University of Nottingham, FACTS also has access to a wide range of analytical tools (TEM, SEM, X-ray Micro-CT) and service facilities (sensory science) Read about some of our recent work and publications here. Read about the positive impact our research partnership with Pipers Crisps has had on their products and business. Join our intensive 5 day training course in Food Flavour. Ideal for product developers and new or experienced scientists wanting to understand the science and application of flavour technology, and how flavours can be generated, analysed, delivered and commercially exploited. The 2024 course will run in April featuring a mix of electures and videos, live interactive classes with leading academics, and quizzes to check understanding of the material. Find out more and sign up here . FACTS has hosted two major conferences - Trends in Food Flavour 2015 and Food Oral Processing 2018. The conferences brought internationally renowned global experts together to debate trends in the food and flavour industry, with a focus on food oral processing, changes in the global food markets, novel product applications, healthy eating and new technology developments. Food Sciences Building Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 95 16037 mobile: +44 (0) 777 645 6118 fax: +44 (0) 115 95 16142 email: Email the Service Director"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/facts-case-study.pdf"
    ]
}