{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/202324/fee-regulations.aspx",
    "content": [
        {
            "p": "These are the fee regulations defining the fees that you will have to pay. The tuition fee you pay includes registration, tuition, initial examination and graduation. It also includes membership of the Students' Union and the University of Nottingham Alumni Association, though you can opt out of membership of either of these if you wish. If you do opt out of membership of the Students' Union or Alumni Association, there will be no reduction in the tuition fee. Other fees and sums due to the University include: See other fees you may have to pay for further details Any reference to fees means fees which are due between 1 August and 31 July of the relevant academic year. Fees are charged according to whether you are a UK home or an international student. Students from the Channel Islands and the Isle of Man will be treated as home students for fees purposes. The definition of these categories is determined by government legislation, specifically The Education (Fees and Awards) (England) Regulations 2007 (as amended). The category you fall into, based on this legislation, is determined by an appropriate member of staff of the University under delegated responsibility from the Registrar. Please note that as a result of the change in UK government policy, EU students entering the University from the 2021/22 academic year onwards will be treated as international students for fee purposes. The fees for UK home and international students for each course are given in the fee tables. Fees are published annually. If you are an international student at one of the University of Nottingham UK campuses, the fee will be fixed at the level you were charged for the first year of your course except in the following cases: If you are on a course which starts at one of the University's campuses in Asia and then continues in Nottingham, you will be charged the appropriate international fee for your period of study in Nottingham. This will be charged at the rate which applies in the year you started your course at the campus in Asia. If you start a course wholly based at one of the University's campuses in Asia and are permitted to transfer to Nottingham, you will be charged the appropriate international fee for your period of study in Nottingham. This will be charged at the rate which applies in the year you start in Nottingham. If you start a course at one of the University's campuses in Asia, come to Nottingham for a semester or year abroad and then are permitted to transfer to Nottingham to continue your course, you will be charged the appropriate international fee for your period of study in Nottingham. This will be charged at the rate which applies in the year you start studying in Nottingham. If the fee paid to the campus in Asia for the semester or year abroad was less than this fee, you will be required to make up the difference for that year. If you are a full-time student, you will be charged the appropriate fee as given in the fee tables in each year of your course. There are a few exceptions to this, such as students on a year abroad, which are listed in the exceptional fees table. Your fee will be displayed on your student account once you have completed module registration. If you are a part-time student, a part-course student, or a student undertaking non-award bearing study, you will normally pay a fee that is proportional to the amount of study you are undertaking. If you are an undergraduate student, your fee will be calculated based on the number of credits you are undertaking as a proportion of the expected full-time credit load (normally 120 credits). Your fee will be displayed on your Student Account once you have completed module registration. Any exceptions to this are listed in the exceptional fees table. In some circumstances you may be permitted to register for a full-time undergraduate course but study part-time. If this applies to you and you register for 60 or more credits but fewer than 100 credits, then you will charged a proportion of the appropriate fee that is the same as the proportion of 120 credits you are undertaking during the year. If you are a postgraduate taught student, your fee will be calculated based on the number of credits you are undertaking as a proportion of the expected full-time credit load (normally 180 credits). Your fee will be displayed on your student account once you have completed module registration. If you are a postgraduate student and you have been granted Recognition of Other Learning, this will be taken into account in the calculation of the fee. If you are a postgraduate research student studying part-time, you will normally be charged half of the appropriate full-time fee. Full-time and part-time status may change and the fee will be updated on a monthly basis. Any exceptions to this are listed in the exceptional fees table. The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}