{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/202425/postgraduate-taught.aspx",
    "content": [
        {
            "p": "The below table gives the fees for full-time students. Part-time and part-course students will pay a proportion of the stated fee for each year of the course depending on the amount of study they are undertaking. For full details, please refer to the fee regulations. ABack to the top MSc Drug Discovery with Industrial Training (two-year) ^ The fee shown is for year one of the course; the fee for year two will be 50% of the year one fee applicable in the year that year two is taken. MA Person-Centred Experiential Counselling and Psychotherapy ^ This course is a two-year full-time course (240 credits) and the fee shown applies to year one only; fees are likely to rise in each year of study. Part-time fees are pro rata per year. MSc Behavioural Economics, MSc Development Economics, MSc Economics, MSc International Economics ^ Students on this course in partnership with Universität Konstanz or Universität Tübingen will pay two-thirds of the fee shown. PGCEi Education (International), PGCE Primary (School Direct), PGCE Secondary (School Direct), PGCE Secondary (Teach First) ^ For further information, contact the School of Education. MSc Sustainable Transportation and Electrical Power Systems (Erasmus Mundus) ^ Fees for this course are paid to the University of Oviedo. For details, see the EMMC website. Health Sciences ^ This cost covers the dissertation fee for the MSc. You must complete the PGDip qualification at the University of Nottingham first. MSc Computer Science (2 years) ^ The fee shown is for year one of the course; the fee for year two will be 50% of the year one fee applicable in the year that year two is taken. MSc Cyber Physical Systems (2 years) ^ The fee shown is for year one of the course; the fee for year two will be 50% of the year one fee applicable in the year that year two is taken. The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}