{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/202122/exceptional-fees.aspx",
    "content": [
        {
            "p": "These are fee regulations outlining exceptional fees and other sums due to the University. Full-time UK home or EU undergraduate students who commenced their course before 2012/13 £3,465 n/a Full-time UK home or EU undergraduate students who commenced their course from 2012/13 to 2016/17 Work placement year in the UK – students commencing 2012/13 to 2016/17 (see also entries for biosciences and engineering industrial placement students below) £1,800 50% of the relevant international fees Work placement year in the UK – students commencing 2017/18 or later Work placement year outside the UK – students commencing 2012/13 to 2016/17 £1,350 50% of the relevant international fee Work placement year outside the UK – students commencing 2017/18 or later £1,385 Engineering industrial placement – students commencing in 2014/15 £500 £550 Biosciences or engineering industrial placement – students commencing in 2015/16 £600 £650 Architecture Year in Industry £300 Year abroad from a Nottingham-based undergraduate course (including a year abroad on an Erasmus programme and a year at the Malaysia or China campus), students commencing in 2012/13 to 2016/17 Year abroad from a Nottingham-based undergraduate course (including a year abroad on an Erasmus programme and a year at the Malaysia or China campus), students commencing 2017/18 or later Year abroad from a Nottingham-based undergraduate course on an EU Erasmus programme, students commencing before 2012/13 £0 A year which includes a semester out from a Nottingham-based undergraduate course (the semester out may be a semester at the Malaysia or China campus, or elsewhere), students commencing in 2012/13 to 2016/17 £6,300 75% of the relevant international fee A year which includes a semester out from a Nottingham-based undergraduate course (the semester out may be a semester at the Malaysia or China campus, or elsewhere), students commencing in 2017/18 or later £6,480 Independent study-related year out £65 Students from elsewhere studying at Nottingham on the study abroad programme Most relevant course fee £15,300 (full year); £8,300 (semester) Malaysian-Nottingham Doctoral Programme Normally 87.5% of the relevant international fee Academic partner PhD International PhD 50% of the relevant international fee and 50% of the relevant fee at the partner institution Visiting international postgraduate research students Full-time first degree and undergraduate diplomas or certificates (except social work repeated placement) £80 Part-time first degree and undergraduate diplomas or certificates (except social work repeated placement) £40 Full-time taught postgraduate courses (except social work repeated placement and PGCE practical teaching) and the taught elements of full-time research degrees £130 Part-time taught postgraduate courses (except social work repeated placement and PGCE practical teaching) and the taught elements of part-time research degrees Pharmacy (with integrated pre-registration scheme) repeated placement (applies to students commencing in 2018/19 or later) £315 per week Social work repeated placement (either undergraduate or postgraduate, full or part-time) £420 PGCE practical teaching (full or part-time), without registration or eligibility for Student Loans Company funding PGCE practical teaching (full or part-time), with registration and eligibility for Student Loans Company funding £1,380 MPhil, MRes (full or part-time) £160 PhD, AMusD, DAppPsy, DArch, DBA, DM, EdD (research element), NursD (full or part-time) £220 Other doctoral degrees and staff candidates for PhD and MPhil (full or part-time) £920 All non-award bearing courses (full or part-time) £90 Additional examination or re-examination fee for examinations taking place outside the UK £150 Registration for thesis-pending period Extension to thesis submission date Submission after agreed submission date £350 per month or part month Late registration fee £60 Payment administration Late payment fee £30 per due date missed If you are studying for a PhD at any of the University's campuses, you may apply to spend up to one year at one of the other campuses. If you are accepted onto an inter-campus exchange programme, you will continue to pay the normal fee for your home campus throughout your study. If you are not part of an inter-campus exchange programme, then the following applies: In all cases, for periods of study less than one year the fee charged will be an appropriate proportion of the full year fee for the course. If you are a member of staff of the University based in Nottingham, you may register for a postgraduate degree in an area relevant to your employment at the UK home rate of fee (even if you would normally be eligible for the international rate) if, at the start of your period of study, you hold an employment contract amounting to at least 0.5 fte. If you would normally be eligible for the international rate and you stop being a member of staff during the course, your fee status will revert to international from the start of the next academic term. If you are a member of staff of the University of Nottingham Malaysia or the University of Nottingham Ningbo China and you register for a research degree at the University of Nottingham UK campus, you will be charged the Malaysia and China campus staff registration fee (which will normally be the same as the relevant UK home rate of fee at the University of Nottingham UK). If you stop being a member of staff or your contract falls below 0.5fte, you will revert to the normal fee from the next term. If you are registered for the degree of Doctor of Medicine, are employed full-time at the Nottingham University Hospitals NHS Trust or the Derby Hospitals NHS Foundation Trust, and you have been ordinarily resident within the UK for at least three years at the start of your course but are nonetheless classed as an international student for fees purposes, you will be charged the special 'DM International Working Doctors' rate of fee. If you stop being a member of staff of one of the Trusts mentioned above or stop being employed full-time, you will revert to the normal international fee from the next academic term. In all the above cases, you will be expected to provide evidence of your employment. The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}