{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/201415/index201415.aspx",
    "content": [
        {
            "p": "2014/15 tuition fee tables The 2014/15 tuition fee tables include: The University of Nottingham’s 2014-15 fee regulations define: Regulations for fees and other sums due to the University Some students, known as ELQ students, are not included in the arrangements for Government funding of higher education. This applies to students on certain courses who are studying for a qualification that is equivalent to or lower than a qualification they already possess. For example, a student studying for a first degree who already possesses a degree will usually be an ELQ student (though there are a small number of exceptions). If you are an ELQ student you may be charged a supplement to the normal tuition fee to take account of the fact that the University does not receive any Government funding for you. The undergraduate and postgraduate taught fee tables indicate whether the supplement is payable for the course you are studying. The Exceptional Fees and Other Sums due to the University table gives the amount of the ELQ supplement. However, regardless of the course, if you are in receipt of the Disabled Students Allowance (DSA) you will not have to pay the supplement. For undergraduate students, please note that the support available from the Student Loans Company (SLC) is different for ELQ students. This applies to all ELQ students whether or not you are required to pay the University’s ELQ supplement. So, if you want to know whether the SLC will treat you as an ELQ student, you need to check with the SLC. Whether you are charged a supplement by the University is not a reliable guide to the decision of the SLC. If you are unsure whether you will need to pay the supplement, please contact the Admissions Office. Please note, this ELQ policy does not apply to postgraduate research students or to international students. The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}