{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/202526/postgraduate-research.aspx",
    "content": [
        {
            "p": "The below tables give the fees for full-time students. Part-time and part-course students will pay a proportion of the stated fee for each year of the course depending on the amount of study they are undertaking. For full details, refer to the fee regulations. For the fees charged for an inter-campus PhD (a PhD where the period of study is at more than one of the university's campuses), please see exceptional fees. Back to the top ^ International fee: £32,400 or £38,400 depending on the nature of your project. An assessment will be made on receipt of your project proposal and confirmed in your offer letter. For details, contact biosciences-research@nottingham.ac.uk. ^^ International fee: £32,400 for low-cost projects, £38,400 for high-cost lab-based, £44,000 for technically intensive or specialised projects with high consumable costs, or £56,400 for exceptional technically intensive or specialised projects with high consumable costs. An assessment will be made on receipt of your project proposal and confirmed in your offer letter. For details, biosciences-research@nottingham.ac.uk. ^ International fee: £32,400 or £38,400 depending on the nature of your project. An assessment will be made on receipt of your project proposal and confirmed in your offer letter. For details, contact chem.admissions@nottingham.ac.uk. ^ International fees: £23,000 for social sciences based or £30,750 for science based. ^^ The fee for the joint Nottingham/Ningbo PhD will be based on the relevant fees at Nottingham and at Ningbo. Typically, it will be calculated at 50% of the Nottingham UK fee and 50% of the Nottingham Ningbo fee. ^ International fees: £24,300 for low-cost, £32,400 for lab-based, £38,400 for high-cost lab-based or £44,000 for exceptional technically intensive or specialised projects with high consumable costs. For details, contact life-sciences-pgr@nottingham.ac.uk. ^ Successful applicants for this course are employed by the NHS as trainee clinical psychologists and course fees are covered by the funding body. For details, contact medicine-pgr@nottingham.ac.uk. ^^ International fees: £23,000 for low-cost, £28,200 for medium-cost in applied psychology and paediatric pharmacology, £32,400 for lab-based, £38,400 for high-cost lab-based, £44,000 for technically intensive or specialised projects with high consumable costs or £56,400 for exceptional technically intensive or specialised projects with high consumable costs. For details, contact medicine-pgr@nottingham.ac.uk. ^ International fees: £28,200 for research in the Division of Pharmacy Practice and Policy or £32,400 for other research. For details, contact pharmacy-enquiries@nottingham.ac.uk. ^ Applicants who are resident in the UK can apply for funding through the Clearing House for Postgraduate Educational Psychology courses, which is administered by the National College for Teaching and Leadership, part of the Department for Education. For details, contact ruth.keetley@nottingham.ac.uk. ^ International fees: £28,200 for low-cost, £32,400 for lab-based, £38,400 for high-cost lab-based or £44,000 for exceptional technically intensive or specialised projects with high consumable costs. For details, contact veterinary-enquiries@nottingham.ac.uk. The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}