{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/202021/index2020-21.aspx",
    "content": [
        {
            "p": "To make sure you find the right information on these pages, please read the definitions section. For information about fees, whether they will change and what happens if you don’t pay, see fee regulations. For new students, the fee for your course or period of study in 2020/21 will be contained in your offer letter. For course fees at our campuses in China or Malaysia, please contact the campus directly. The UK government has confirmed that EU students starting in the 2020/21 academic year will pay the same fees and have the same eligibility for loans and grants as UK home students for the duration of their course. Following the UK’s exit from the European Union, EU students starting from 2021/22 will pay the same fees as international students. Irish nationals living in the UK or Republic of Ireland will be treated as UK students for fee purposes. See our EU referendum information or funding for EU students. These are the formal fee regulations for the University. These rules set out what fees must be paid to the University and what may happen if they are not paid. There are some exceptions to the general rules for fees. The University reserves the right to increase tuition fees by inflation (RPI excluding mortgage interest payments) and/or the maximum permitted by law or government policy (which may exceed the rate of inflation) in the second and subsequent years of your course. If we intend to exercise this right to increase tuition fees, a notification will be placed on these web pages by the end of June in the academic year before the one in which we intend to exercise that right. Undergraduate courses 2020/21 Tuition fees for postgraduate taught courses vary depending on the course. The University reserves the right to increase tuition fees in the second and subsequent years of your course. For continuing students, increases will be no more than 5% or 3% above the Retail Prices Index (RPI) at the time the decision is made, whichever is the higher. Postgraduate taught courses 2020/21 Tuition fees for postgraduate research courses vary depending on the course. The University reserves the right to increase tuition fees in the second and subsequent years of your course. For home students undertaking a PhD, the fees are currently linked to the maximum fee determined by Research Councils UK and this is likely to continue. If this policy does not continue, and for other continuing students, increases will be no more than 5% or 3% above the Retail Prices Index (RPI) at the time the decision is made, whichever is the higher. If we intend to exercise this right to increase tuition fees, a notification will be placed on these web pages by the end of June in the academic year before the one in which we intend to exercise that right Postgraduate research courses 2020/21 Tuition fees for international students vary depending on the course. You can find which fee applies to you by following the relevant link below. Fees for international students are normally fixed at the level charged in the first year of the course. Exceptions to this are outlined in about tuition fees. Preparatory English courses Prospective students with queries about fees should contact the Student Recruitment Support Hub. A home student is defined as a student who meets certain residency conditions (the same conditions apply to eligibility for UK government student financial support). Usually this means you have an unrestricted right to enter and remain in the UK and you have been ordinarily resident in the UK for three years prior to the start of your course. None of this time must have been spent in the UK wholly or mainly for the purpose of receiving full-time education. Up to 2020/21, if you are an EU national and meet the residence requirements within the EEA or Switzerland, you will be eligible for home fee status. However, the situation in 2021/22 will change in line with UK government policy following the UK’s proposed exit from the European Union. More information is on our EU referendum pages. If you do not fall under the home UK or EU fee definitions, then you will be classed as an international student. If you are unsure about which fee category you fall into, please contact the Student Recruitment Support Hub. If you are taking an undergraduate course, you will pay the undergraduate fee as outlined in the undergraduate courses list. If you are taking a postgraduate course, you will pay the postgraduate fee as outlined in the taught or research list. The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}