{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/201415/feeregulations201415.aspx",
    "content": [
        {
            "p": "This page contains the Fee Regulations for the University. These are the formal rules setting out what fees must be paid to the University and what may happen if they are not paid. The Fee tables, setting out the rates of fee for each course, can be found by following the links to the left of this text. If you would like to know the fees for a course at the University of Nottingham Malaysia or the University of Nottingham China you should contact the campus directly. The underlying fee bands are available (for University staff only) at Fee bands. Please note the following: The Regulations and associated fee tables given here are those that apply in 2014-15. (A small number of fees have not yet been decided. These are clearly indicated in the Fee Tables, usually by the abbreviation 'TBC'). For other years you need to refer to the regulations and fee tables for those years. Fees for years after 2014-15 will normally be higher than those for 2014-15. A ─ Tuition fees B ─ Other sums due to the University C ─ Non-payment of fees 1.1 The tuition fee you pay includes registration, tuition, initial examination, graduation, and membership of the University Association. It also includes membership of the Students Union, though you can opt out of membership if you wish. If you do opt out of membership of the Students Union there will be no reduction in the tuition fee. 1.2 Other fees and sums due to the University include: registration for a thesis-pending period (Section B2) extension of the submission date for postgraduate research students (B2) late registration (Section B3) There may also be other charges not listed above. 1.3 Where this document refers to fees for a session, this means fees which are due between 1 August and 31 July of the relevant academic year. 2.1 Fees are charged according to whether you are a Home, an International or an Island student. The Island category covers students from the Channel Islands and the Isle of Man. The definition of these categories is determined by government legislation, specifically The Education (Fees and Awards) (England) Regulations 2007 (as amended). The category you fall into, based on this legislation, is determined by an appropriate member of staff of the University under delegated responsibility from the Registrar. 2.2 If you are classed as a Home student and are studying for a qualification equivalent to or lower than one you already have, you may be required to pay a higher fee than other Home students. Some courses, and students who receive the Disabled Students Allowance, are exempt from this. Whether you have to pay this additional fee is determined by an appropriate member of staff under delegated responsibility from the Registrar. 3.1 The fees for home and international students for each course are given in the Fee tables. The fees for Island students are given in the Exceptional fees and other sums due to the University table. 3.2 The level of fee may change from year to year and you will normally be charged the rate for the current year. 3.3 If you are an international student at the Nottingham UK campus (and not on an MBA programme), the fee will be fixed at the level you were charged for the first year of your course except in the following cases: 3.4 If you are on a course which starts at one of the University's campuses in Asia and then continues in Nottingham, you will be charged the appropriate international fee for your period of study in Nottingham. This will be charged at the rate which applied in the year you started your course at the campus in Asia. 3.5 If you start a course wholly based at one of the University's campuses in Asia and are permitted to transfer to Nottingham, you will be charged the appropriate international fee for your period of study in Nottingham. This will be charged at the rate which applies in the year you start in Nottingham. 3.6 If you start a course at one of the University's campuses in Asia, come to Nottingham for a semester or year abroad and then are permitted to transfer to Nottingham to continue your course, you will be charged the appropriate international fee for your period of study in Nottingham. This will be charged at the rate which applied in the year you start studying in Nottingham. If the fee paid to the campus in Asia for the semester or year abroad was less than this fee, you will be required to make up the difference for that year. 4.1 If you are a full-time student, you will be charged the appropriate fee in each year of your course. There are a few exceptions to this, such as students on a year abroad, which are listed in the Exceptional fees table. 5.1 If you are a part-time student, a part-course student, or a student undertaking non-award bearing study, you will normally pay a fee that is proportional to the amount of study you are undertaking. This calculated fee may be rounded up to the nearest £10. 5.2 If you are an undergraduate student, you will normally be charged a proportion of the appropriate fee that is the same as the proportion of 120 credits you are undertaking during the year. For example, if you are taking 40 credits of study, you will normally be charged one third of the appropriate fee for the course. Any exceptions to this are listed in the Exceptional fees table. 5.3 In some circumstances you may be permitted to register for a full-time undergraduate course but study part-time. If this applies to you and you register for 60 or more credits but fewer than 100 credits then you will charged a proportion of the appropriate fee that is the same as the proportion of 120 credits you are undertaking during the year. 5.4 If you are a postgraduate taught student, you will normally be charged a proportion of the appropriate fee that is the same as the proportion of 180 credits you are undertaking during the year. For example, if you are taking 60 credits of study, you will normally be charged one third of the appropriate fee for the course. In some cases this fee is calculated in a different way and, if this applies, you will be informed individually. 5.5 If you are a postgraduate student and you have been granted Accreditation of Prior Learning, this will be taken into account in the calculation of the fee. 5.6 If you are a postgraduate research student studying part-time for the whole year (unless you are studying for a taught doctorate in which case 5.3 applies) you will normally be charged half of the appropriate fee. If you studying for part of the year, you will be charged according to the number of months of study. 6.1 You must pay your tuition fees in each academic session in the amounts specified in these Regulations. 6.2 You must pay in UK pounds sterling. The University will not accept liability for any differences or charges arising from foreign currency payments. 6.3 The University will tell you when you must pay your fees and how you should do so. Full details are available from the Tuition Fee Services Team. 6.4 If some or all of your fees are paid by a recognised sponsoring body (such as the Student Loan Company, a Research Council, or a national government), you must be able to provide confirmation of this when requested. If you cannot provide this confirmation or the sponsoring body fails to pay at the right time, then you will be required to pay all of your fees. 6.5 If you want to pay your fees in a different way to the methods normally available, the University may require you to pay an administrative charge (see section B3). 7.1 If you withdraw, or interrupt your studies or session, you will be liable for fees as specified in sections 7.2 to 7.6, below. If you or your sponsor has already paid more than this, then the excess will be refunded to the fee payer. If you want the refund to be sent to anyone else, then written confirmation from the fee payer will be required. 7.2 For the purposes of these Fee Regulations, the date of withdrawal is defined as the date on which you submit the relevant form notifying the University of your withdrawal from a course or your request for a interruption of study. Notification by any other means (eg verbal communication with a Personal Tutor, Module Convenor or School Administrator) will not constitute full withdrawal or interruption of studies and will not, therefore, affect your fee liability. You will find the relevant forms in the Quality Manual. 7.3 If you are a new home undergraduate student, or a new home student studying for PGCE, and you withdraw before the end of the third week of the first term, then no fee is payable. If you withdraw after the end of the third week of the first term but before the start of the second term, 25% of the fee is payable. If you withdraw after the start of the second term but before the start of the third term, 50% of the fee is payable. If you withdraw after the start of the third term, 100% of the fee is payable. In all cases, the dates of terms are the standard term dates published on the University website regardless of the dates of study of any particular course. 7.4 If you are a continuing home undergraduate student, or a continuing home student studying for a PGCE, and you withdraw before the start of the first term of a subsequent year of your course, then no fee is payable. If you withdraw after the start of the first the first term but before the start of the second term, 25% of the fee is payable. If you withdraw after the start of the second term but before the start of the third term, 50% of the fee is payable. If you withdraw after the start of the third term, 100% of the fee is payable. In all cases, the dates of terms are the standard term dates published on the University website regardless of the dates of study of any particular course. 7.5 If you are a taught student who is not included in section 7.3 or 7.4, above, and you withdraw before the end of the third week of the first semester, no fee is payable. If you withdraw after the end of the third week of the first semester but before the end of the third week of the second semester, half of the full fee is payable. If you withdraw after the end of the third week of the second semester, the full fee is payable. 7.6 If you are a research student and you withdraw during the first three weeks of any year of your study, no fee is payable. If you withdraw after the first three weeks, you will pay for any months of study wholly or partially completed. 7.7 Any debt you owe to the University will be subtracted from any refund of fees. 7.8 The University may, at the discretion of the Director of Finance, make an administrative charge to recover the cost of making the refund and reduce the size of the refund by that amount. The University tuition fees for a given academic year include the fees for initial examination in that year. If you are required to undertake re-examination and are permitted to, or are required to, undertake further study before a re-examination then the fee you pay for this further study will include the re-examination fee. Otherwise, you must pay for any re-examination, or for any initial examination where a University tuition fee has not been paid. Details of examination and re-examination fees are given in the Exceptional fees and other sums due to the University table. If the examination takes place outside the United Kingdom, an additional examination or re-examination fee must be paid. In addition, the British Council or other agency acting on behalf of the University may impose additional local charges for the hire of rooms, invigilation, etc. The University will tell you when you must pay your examination or re-examination fees and how you should do so. If you don’t pay in the required time, then Section C on the non-payment of fees will apply. Postgraduate research students registering for their thesis-pending period and for an extension of the permitted submission date for a thesis must pay an additional fee. Details of these fees are given in the Exceptional fees and other sums due to the University table. If you fail to register for your course by the deadline you have been given without a good reason, you may be charged a late registration fee. If you pay your fees in a way or at a time differing from how you are told, you may be required to pay a payment administration fee. Details of these fees are given in the Exceptional fees and other sums due to the University table. The University may set other fees and charges, such as for accommodation, field trips, attendance at graduation ceremonies, library deposits and sports facilities. You will be notified of the amounts, payment requirements and other conditions at the appropriate time. 1. If you do not pay your tuition fees, or any other sums due to the University, within 21 days of the due date - 2. If more than a calendar year has passed since the date of your interruption of studies or non-registration under these Regulations, the University will not guarantee your re-admission to the course as the course may have changed significantly. In order to return you must pay the fees or other sums due in full and obtain permission to re-register through the Student Services Centre. You may only re-register at the beginning of an academic year. 3. If you have not paid your fees or any other sums, or have any debt to the University - 4. If you have not paid your fees or other sums in full at least three weeks before you are due to graduate or to be awarded a diploma or certificate, you will not be permitted to graduate or be awarded any diploma or certificate until those fees are paid in full. 5. The Registrar or his or her nominee may, in the light of your individual circumstances, decide that some or all of the sanctions listed above will not be applied. 6. If any of these sanctions for debt are applied, you may appeal in writing, within 10 working days of the final demand, to the Registrar. 7. The University reserves the right to take reasonable steps to recover all fees due and also any fees, charges or legal costs incurred in that recovery action. 8. A debt to any campus of the University, including the campuses outside of the United Kingdom, will be considered as a debt to the University. 9. If you are a returning international student seeking a Confirmation of Acceptance for Studies (CAS) Certificate from the University and you have previously failed to pay your fees on time (that is, by the date given on your fees invoice), the University may ask you to pay a proportion of your next year’s fees in advance before a CAS certificate is issued. The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}