{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/202526/index.aspx",
    "content": [
        {
            "p": "These webpages set out details of tuition fees and regulations for the 2025/26 academic year. For course fees at our campuses in China or Malaysia, please contact the relevant campus directly. Following the UK’s exit from the European Union, students from the EU, EEA and Switzerland (except those mentioned below) starting their programmes of study at the university any time on or after 1 August 2021 will pay international tuition fees. See our funding for EU students. Irish nationals living in the UK or Republic of Ireland or students who have 'settled' or 'pre-settled' status under the EU Settlement Scheme will, subject to meeting eligibility criteria, be treated as UK home students for fee purposes. UK nationals living in the EU, EEA and Switzerland will, subject to meeting eligibility criteria, also continue to be eligible for UK home fee status, when entering courses at UK universities any time up to and including 31 December 2027. For further information from the UK government regarding fee status regulations, please refer to the government website. A home student is defined as a student who meets certain residency conditions. The same conditions apply to eligibility for student financial support from the UK government. Usually this means you have an unrestricted right to enter and remain in the UK and you have been ordinarily resident in the UK for three years prior to the start of your course. None of this time must have been spent in the UK wholly or mainly for the purpose of receiving full-time education. If you do not fall under the home UK fee definitions, then you will be classed as an international student. EU students entering the university will be treated as international students for fee purposes, except for Irish nationals living in the UK or Republic of Ireland. If you are unsure about which fee category applies to you, contact the Student Recruitment Support Hub. These are the formal fee regulations for the university. These rules set out what fees must be paid to the university and what may happen if they are not paid. There are some exceptions to the general rules for fees. The university reserves the right to increase tuition fees by inflation (RPI excluding mortgage interest payments) and/or the maximum permitted by law or government policy (which may exceed the rate of inflation) in the second and subsequent years of your course. If we intend to exercise this right to increase tuition fees, a notification will be placed on these web pages by the end of June in the academic year before the one in which we intend to exercise that right. Undergraduate courses 2025/26 Tuition fees for postgraduate taught courses vary depending on the course. The university reserves the right to increase tuition fees in the second and subsequent years of your course. For continuing students, increases will be no more than 5% or 3% above the Retail Prices Index (RPI) at the time the decision is made, whichever is the higher. Postgraduate taught courses 2025/26 Tuition fees for postgraduate research courses vary depending on the course. The university reserves the right to increase tuition fees in the second and subsequent years of your course. For home students undertaking a PhD, the fees are currently linked to the maximum fee determined by Research Councils UK and this is likely to continue. If this policy does not continue, and for other continuing students, increases will be no more than 5% or 3% above the Retail Prices Index (RPI) at the time the decision is made, whichever is the higher. Postgraduate research courses 2025/26 Tuition fees for international students vary depending on the course. You can find which fee applies to you by following the relevant link below. Fees for international students are normally fixed at the level charged in the first year of the course. Exceptions to this are outlined in 'about tuition fees'. The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}