{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/202425/refunds.aspx",
    "content": [
        {
            "p": "These are fee regulations that describe the circumstances in which refunds of fees may be made. If you withdraw or interrupt your studies, you will be liable for fees as specified in the table in section 1.3 below. If you or your sponsor has already paid more than this, then (subject to the University Refund Policy) the excess will be refunded to the fee payer on request. For the purposes of these refunds, the date of withdrawal is defined as the last attendance date noted by the appropriate member of staff following the completion and sign-off of the withdrawal process. Notification by any other means (such as verbal communication with a personal tutor, module convener or school administrator) will not constitute full withdrawal or interruption of studies and will not affect your fee liability. You will find the relevant forms in the Quality Manual. If you have completed academically (in that all teaching sessions and examinations for the course have taken place), no refund will be due regardless of your withdrawal date. The table below gives the fee liability if you withdraw or interrupt your studies. In all cases the dates of terms and semesters are those published on the University website regardless of the particular dates of study on any course. On or before 14 October 2024 No fee payable Between 15 October 2024 and 12 January 2025 25% of the fee for the current academic year Between 13 January 2025 and 27 April 2025 50% of the fee for the current academic year On or after 28 April 2025 100% of the fee for the current academic year On or before 22 September 2024 Between 23 September 2024 and 12 January 2025 34% of the fee for the current academic year 67% of the fee for the current academic year Between 15 October 2024 and 2 February 2025 Between 3 February 2025 and 27 April 2025 Between 23 September 2024 and 2 February 2025 The last working day before or on the 14th day of the calendar month No fee payable for the month After the 14th day of the calendar month Full fee payable for the month Courses 10 weeks or shorter 100% of the fee once registration is complete Courses longer than 10 weeks: by Friday of week one No fee payable for the current ten week block Courses longer than 10 weeks: by Friday of week five 50% of the fee for the current ten week block Courses longer than 10 weeks: after Friday of week five 100% of the fee for the current ten week block Any debt you owe to the University will be subtracted from the refund of any payments made. Refunds will be processed in UK Pounds Sterling. The University may, at the discretion of the Financial Controller, make an administrative charge to recover the cost of making the refund and reduce the size of the refund by that amount. If you receive funding from an organisation external to the University, that organisation may also have terms and conditions that could affect any refund (for example, over-borrowing/repayment regulations for US Federal Aid). The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}