{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/201415/exceptionalfees201415.aspx",
    "content": [
        {
            "p": "If you are studying for a PhD at any of the University's campuses you may apply to spend a period of time, up to one year, at one of the other campuses. If you are accepted onto an inter-campus exchange programme, you will continue to pay the normal fee for your home campus throughout your study. If you are not part of an inter-campus exchange programme then the following applies: In all cases, for periods of study less than one year the fee charged will be an appropriate proportion of the full year fee for the course. If you are a member of staff of the University based in Nottingham, you may register for a postgraduate degree in an area relevant to your employment at the home rate of fee (even if you would normally be eligible for the international rate) if, at the start of your period of study, you hold an employment contract amounting to at least 0.5 fte. If you stop being a member of staff during the course, your fee status will revert to international from the start of the next academic year. If you are a member of staff of the University of Nottingham Malaysia or the University of Nottingham Ningbo, China, and you register for a research degree at the Nottingham campus, you will be charged the Malaysia and China Campus Staff Registration Fee (which will normally be the same as the relevant home rate of fee at Nottingham). If you stop being a member of staff or your contract falls below 0.5fte, you will revert to the normal fee from the next charging period. If you are registered for the degree of Doctor of Medicine, are employed full-time at the Nottingham University Hospitals NHS Trust or the Derby Hospitals NHS Foundation Trust, and you have been ordinarily resident within the UK for at least three years at the start of your course, but are nonetheless classed as an international student for fees purposes, you will be charged the special 'DM International Working Doctors' rate of fee. If you stop being a member of staff of one of the Trusts mentioned above or stop being employed full-time, you will revert to the normal international fee from the next academic year. Home/European Union full time students who commenced their course prior to 2012-13 £11,000 (full year) £6,000(semester) Malaysian-Nottingham Doctoral Programme Fee The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}