{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/201718/index201718.aspx",
    "content": [
        {
            "p": "The tuition fees for the first year of your course will be £9,250. Fees may increase in later years as UK Government policy changes, but we'll always let you know by the end of June in the academic year before they do. Read more information about these changes. All EU students starting in 2017 continue to be eligible for any relevant student loans and grants for the duration of their course, even if the course ends after the UK has left the EU. If you accepted a place for 2016 entry but applied after 8 August 2016 to defer entry to 2017, you'll pay fees as if you were a new UK/EU undergraduate in 2017. Tuition fees will remain at £9,000 for the duration of your course, in line with the offer that you received from us. All postgraduate research students who qualify as home students under the current rules will continue to do so when starting a course in 2017. These students will be able to apply for research council funding support for the duration of their course, even if the course ends after the UK has left the EU. Taught postgraduate EU students starting in 2017 will continue to be eligible for any relevant student loans and grants for the duration of their course, just like undergraduates. The University of Nottingham’s 2017/18 fee regulations define: Regulations for fees and other sums due to the University It has now been confirmed that EU students will continue to remain eligible for undergraduate, masters, postgraduate and advanced learner financial support in academic year 2018/19. All of the information regarding loans, grants and funding for EU student 2017 entry will continue to apply for 2018 entry. 2018/19 fee tables will be available over the summer vacation. The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}