{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/201819/index201819.aspx",
    "content": [
        {
            "p": "In order to make sure you find the right information for this page please read the Definitions section to determine which student category you fall under and then use the fees tables in the relevant section under Fees to see the tuition course fee. For the consequences of not paying your fees, see the Fee Regulations. Please also read the news items in the Important news section for latest developments. The tuition fees for the first year of your course wil be £9,250. Fees may increase in later years as UK Government policy changes, but we'll always let you know by the end of June in the academic year before they do. If you are an EU home student starting in 2018 or 2019 you will continue to be eligible for any relevant student loans and grants for the duration of your course, even if your course ends after the UK has left the EU. Tuition fees will remain at £9,000 for the duration of your course, in line with the offer that you received from us. If you are an EU home student starting in 2018 or 2019 you will be able to apply for any relevant student loans and grants, including research council funding, for the duration of your course, even if your course ends after the UK has left the EU. The fee status of EU students in future years may be affected by UK Government policy following the outcome of any negotiations regarding the UK’s proposed exit from the European Union. For the latest information please see our EU referendum pages. The tuition fees for the first year of your course will be £9,250. The University reserves the right to increase tuition fees by inflation (RPI excluding mortgage interest payments) and/or the maximum permitted by law or Government policy in the second and subsequent years of your course. If we intend to exercise this right to increase tuition fees, we will let you know by the end of June in the academic year before the one in which we intend to exercise that right. The University in addition reserves the right to increase tuition fees to the maximum permitted by law or Government policy where this exceeds the rate of inflation. If we intend to exercise this right to increase tuition fees, we will let you know by the end of June in the academic year before the one in which we intend to exercise that right. Tuition fees for postgraduate taught courses vary depending on the course. Postgraduate taught courses 2018-19 The University reserves the right to increase tuition fees in the second and subsequent years of your course. For continuing students, increases will be no more than 5% or 3% above the Retail Prices Index (RPI) at the time the decision is made, whichever is the higher. If we intend to exercise this right to increase tuition fees, we will let you know by the end of June in the academic year before the one in which we intend to exercise that right. Tuition fees for postgraduate research courses vary depending on the course. Postgraduate research courses 2018-19 The University reserves the right to increase tuition fees in the second and subsequent years of your course. For home students undertaking a PhD, the fees are currently linked to the maximum fee determined by Research Councils UK and this is likely to continue. If this policy does not continue, and for other continuing students, increases will be no more than 5% or 3% above the Retail Prices Index (RPI) at the time the decision is made, whichever is the higher. If we intend to exercise this right to increase tuition fees, we will let you know by the end of June in the academic year before the one in which we intend to exercise that right. Tuition fees for international students will vary depending on the course. You can find which fee applies to you by following the relevant link below. Undergraduate courses Postgraduate taught courses Postgraduate research courses Preparatory English courses Fees for international students are normally fixed at the level charged in the first year of the course. There are a small number of exceptions to the general rules for fees and these are listed here. Exceptional fees The University of Nottingham’s 2018-19 fee regulations define: Regulations for fees and other sums due to the University Prospective students with queries about fees should contact the Student Recruitment Enquiries Centre. Student Recruitment Enquiries Centre Marketing, Communications and Recruitment Room A154 King's Meadow Campus Lenton Lane Nottingham NG7 2NR telephone:+44 (0)115 951 5559 or +44 (0)115 95 13710 (option 2) fax: +44 (0)115 846 8062 For further information please use our enquiry form A home student is defined as a student who meets certain residency conditions (the same conditions apply to eligibility for UK Government student financial support). Usually this means you have an unrestricted right to enter and remain in the UK and you have been ordinarily resident in the UK for three years prior to the start of your course. None of this time must have been spent in the UK wholly or mainly for the purpose of receiving full-time education. Visit the Directgov website for further information. You are an EU national, or the relevant family member of a non-UK EU national, who is in the UK as a self-sufficient person or as a student, or the relevant family member of a UK national. You must have been ordinarily resident in the European Economic Area and/or Switzerland and/or the overseas territories for the three years before the first day of the first academic year of the course. You must not have been resident wholly or mainly for the purpose of receiving full-time education. If you do not fall under the home UK or home EU fee definitions, then you will be classed as an international student. If you are taking an undergraduate course, you will pay the undergraduate fee as outlined in the undergraduate courses list. If you are taking a postgraduate course, you will pay the postgraduate fee as outlined in the postgraduate taught courses or the postgraduate research list. EU referendum pages Funding for EU students Parliament.uk The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}