{
    "url": "https://www.nottingham.ac.uk/fees/tuitionfees/201920/index201920.aspx",
    "content": [
        {
            "p": "In order to make sure you find the right information for this page please read the Definitions section to determine which student category you fall under and then use the fees tables in the menu below to see the course fee. Information about fees, including whether they will change and what happens if you don’t pay, are in the Fee Regulations section, below. For new students, the fee for your course or period of study in 2019-20 will be contained in the offer letter you receive from the University. If you would like to know the fees for a course at the University of Nottingham Malaysia or the University of Nottingham Ningbo China you should contact the campus directly. EU students in 2019-20 EU home students starting in the academic year 2019-20 will pay the same fees and have the same eligibility for loans and grants as UK home students for the duration of their course. The situation for students starting in 2020-21 is not yet known and may be affected by UK Government policy following the outcome of any negotiations regarding the UK’s exit from the European Union. More information is on our EU referendum pages. These are the formal Fee Regulations for the University. These are the rules setting out what fees must be paid to the University and what may happen if they are not paid. There are a small number of exceptions to the general rules for fees and these are listed here: The University reserves the right to increase tuition fees by inflation (RPI excluding mortgage interest payments) and/or the maximum permitted by law or Government policy (which may exceed the rate of inflation) in the second and subsequent years of your course. If we intend to exercise this right to increase tuition fees, we will let you know by the end of June in the academic year before the one in which we intend to exercise that right. Undergraduate courses 2019-20 Tuition fees for postgraduate taught courses vary depending on the course. The University reserves the right to increase tuition fees in the second and subsequent years of your course. For continuing students, increases will be no more than 5% or 3% above the Retail Prices Index (RPI) at the time the decision is made, whichever is the higher. If we intend to exercise this right to increase tuition fees, we will let you know by the end of June in the academic year before the one in which we intend to exercise that right. Postgraduate taught courses 2019-20 Tuition fees for postgraduate research courses vary depending on the course. The University reserves the right to increase tuition fees in the second and subsequent years of your course. For home students undertaking a PhD, the fees are currently linked to the maximum fee determined by Research Councils UK and this is likely to continue. If this policy does not continue, and for other continuing students, increases will be no more than 5% or 3% above the Retail Prices Index (RPI) at the time the decision is made, whichever is the higher. If we intend to exercise this right to increase tuition fees, we will let you know by the end of June in the academic year before the one in which we intend to exercise that right Postgraduate research courses 2019-20 Tuition fees for international students will vary depending on the course. You can find which fee applies to you by following the relevant link below. Fees are normally fixed at the level charged in the first year of the course; a few exceptions to this are given in the About Tuition Fees section. Undergraduate courses Postgraduate taught courses Postgraduate research courses Preparatory English courses Fees for international students are normally fixed at the level charged in the first year of the course. There are a small number of exceptions to the general rules for fees and these are listed here. Exceptional fees Prospective students with queries about fees should contact the Student Recruitment Enquiries Centre. A home student is defined as a student who meets certain residency conditions (the same conditions apply to eligibility for UK Government student financial support). Usually this means you have an unrestricted right to enter and remain in the UK and you have been ordinarily resident in the UK for three years prior to the start of your course. None of this time must have been spent in the UK wholly or mainly for the purpose of receiving full-time education. Up to 2019-20, EU home students were defined as follows. You are an EU national, or the relevant family member of a non-UK EU national, who is in the UK as a self-sufficient person or as a student, or the relevant family member of a UK national. You must have been ordinarily resident in the European Economic Area and/or Switzerland and/or the overseas territories for the three years before the first day of the first academic year of the course. You must not have been resident wholly or mainly for the purpose of receiving full-time education. However, the situation in 2020-21 and beyond may be affected by UK Government policy following the outcome of any negotiations regarding the UK’s proposed exit from the European Union. More information is on our EU referendum pages. If you do not fall under the home UK or home EU fee definitions, then you will be classed as an international student. If you are taking an undergraduate course, you will pay the undergraduate fee as outlined in the undergraduate courses list. If you are taking a postgraduate course, you will pay the postgraduate fee as outlined in the postgraduate taught courses or the postgraduate research list. EU referendum pages Funding for EU students Parliament.uk The content of these pages is administered by: Engineering & Science Learning Centre University Park Nottingham, NG7 2RD For details about who to contact for queries regarding student tuition fees and financial support, please visit the Student Finance contact us page."
        }
    ],
    "pdf_files": []
}