{
    "url": "https://www.nottingham.edu.my/Foundation-Programmes/images-multimedia/HomeRotate/M-CampusDSC6707.jpg",
    "content": [
        {
            "p": "At the University of Nottingham Malaysia, choose from several versatile foundation programmes aimed at helping you prepare for various undergraduate degree programmes. Our foundation programmes provide a solid academic grounding and are tailored to meet the requirements of various disciplines. Gain essential academic skills and knowledge, such as critical thinking, research, and problem-solving. Whether you aspire to pursue a degree in business, engineering, arts, or science, we have a foundation programme that will set you on the right path towards achieving your academic goals. Additionally, explore our diverse scholarship options to support your academic journey and unlock opportunities for financial assistance. We provide two foundation intakes every year, once in April and another in September. Do take a look at the schedule for application deadlines and registration. Our foundation programmes are pre-university level programmes designed to enhance the subject basics and learning skills essential for undergraduate study. We run four distinct programmes divided by subject. Successful completion of your chosen foundation programme will allow you to progress directly onto your selected undergraduate degree. You will get the chance to study a variety of subject areas that the Faculty has to offer. This will give you an idea of what degree you may like to progress on to while developing the valuable learning skills necessary to pursue it. The university foundation programme runs full-time for either two or three semesters. This is suitable if you have completed at least 12 years of formal education but need to enhance your skills in order to undertake an undergraduate degree. This is ideal if you have completed a minimum of 11 years of formal education. After you have successfully completed the foundation programme you can go on to study one of our undergraduate degree programmes. Apply now An entry route to degree programmes offered especially in English, education, international communications and more. An entry route to degree programmes offered especially in business, education, finance and more. An entry route to degree programmes offered especially in civil engineering, software engineering, chemical engineering and more. An entry route to degree programmes offered especially in computer science, biotechnology, psychology, pharmacy and more. Please note that the Foundation fees as listed below are on a per semester basis. Contact this school's list of academics. Contact this faculty's list of academics. Contact our friendly counsellors to know more about the Programmes we offer. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}