{
    "url": "https://www.nottingham.edu.my/future-students/index.aspx",
    "content": [
        {
            "p": "Conveniently located in Menara Axis, Petaling Jaya, the Future Students Centre serves as a central hub where prospective students and parents can gather information about the University of Nottingham Malaysia. Our expert and dedicated counsellors are available to answer your queries about our programmes, scholarships, exchange and transfer opportunities, and graduate outcomes. Accommodation Showroom: Discover the comfort and modernity that defines the UNM student experience at our Accommodation Showroom. Step into our single bedroom to imagine what the residential experience could be like! Campus Scale Model: Take a bird’s eye view of our 48-hectare grounds featuring state-of-the-art facilities and a lively campus environment through our Campus Scale Model. This sophisticated representation offers a preview of our beautiful campus. Plus, you’ll see why it’s been voted one of the most beautiful campuses in the region! Event Space: The Future Students Centre presents a spacious and stylish venue for gatherings of up to 100 people. Whether it’s an intimate event, power meeting, or interactive workshop, we offer versatile seating arrangements and modern technology to make it a success. Keen to explore our vibrant Semenyih campus? Take a tour with our Notts Express shuttle bus service, departing from FSC every Saturday. Meet our counsellors and academic staff to explore the right course for you. Walk-ins are welcome too! We are open 7 days a week from 9am – 5.30pm (except on public holidays). Book now Mezzanine Floor, Menara Axis, 2, Jalan 51A/223, Seksyen 51A, 46100 Petaling Jaya, Selangor. Monday - Sunday | 9am – 5:30pm (Except on Public Holidays) Directions via Waze Conveniently situated along the Federal Highway, our centre is just a 20-minute drive from Kuala Lumpur city centre. If you’re traveling from the UNM campus in Semenyih, expect a journey of approximately 50 – 60 minutes. Parking is available inside Menara Axis with a weekday rate of RM3 per hour and a weekend flat rate of RM5 per entry. Alternatively, you can utilise the outdoor parking space next to Menara Axis for a rate of RM6 per day. You can take the Kelana Jaya Line LRT and get off at Asia Jaya LRT station. Menara Axis is a mere 300m walk from the station, making your journey convenient and accessible. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}