{
    "url": "https://www.nottingham.ac.uk/geography/events-list/research-seminars/2024-25/school-research-seminar-20-nov-2024.aspx",
    "content": [
        {
            "p": "Lakes are important ecosystems and provide essential ecosystem services for society. However, lakes are increasingly impacted by anthropogenic activity including climate change and pollution. For example, global warming is causing ice-margins to retreat producing multiple new lake systems in proglacial regions. However, these lake systems remain poorly understood despite being new ecosystems and sites of biogeochemical cycling. Lakes in urban and densely populated catchments receive large volumes of plastic pollution and microfibre pollution. The presence of plastic in lakes presents a new substrate for colonisation by biofilms (assemblages of bacteria, algae, and fungi) and sites for biogeochemical cycling and impacts the fate of plastic and fibres in the lake system. Contemporary changes in lake systems must be considered in light of historic, long-term changes, using the lake sediment record. Over time, lakes accumulate sediments which contain biological and geochemical proxies that can be used to reconstruct how lakes, their catchments and their ecosystems have responded to environmental change. Lake sediment records can be used to reconstruct historic pollution trends and in pristine lakes, free of anthropogenic impact, how lake development over time (ontogeny) would look. Here I present research using a range of paleolimnological and limnological techniques to investigate how lakes evolve over time in the absence of anthropogenic impact, how can lake sediment records can be used to highlight historic microfibre pollution trends and how plastic pollution is impacting contemporary lake ecosystems. Antonia was awarded a BSc in Physical Geography from the University of Nottingham in 2005, an MSc in Quaternary Science from Royal Holloway University of London in 2006 and a PhD in palaeolimnology from Loughborough University in 2012. Antonia joined the School of Geography at the University of Nottingham in July 2024. Prior to this, she was a Senior Lecturer at Keele University. Her research focuses on one of the biggest environmental challenges facing society today; the impact of anthropogenic activity, including climate change and pollution, on freshwater systems. She uses a range of limnological and palaeolimnological techniques to understand how lake systems have changed in response to environmental and anthropogenic stressors over different timescales, from the past through to the present day. The Casarabe Culture of the Monumental Mound Region (MMR) of Amazonian Bolivia spanned from 600 – 1600 kcal BP and is the most complex pre-Columbian society yet discovered in Amazonia. The network of monumental mounds and interconnecting canals points to low-density urbanism, but little is known about its land-use practices or its impact. Here, we present palaeoenvironmental data from sediment cores from two basins of contrasting sizes. A 62 cm core from Laguna Peroto reveals a 2,500-year history of land use at a regional landscape scale, with two phases of rapid sedimentation, which we evaluate in the context of climate change and anthropogenic earthwork construction. We find evidence for maize cultivation and anthropogenic burning of savannas, but no evidence for regional-scale changes in forest cover. A 50 cm core from the palaeo-river channel bordering the previously excavated Loma Salvatierra captures local-scale land use on this site over the past 1000 years. A high abundance of maize indicates cultivation at Loma Salvatierra and supports the hypothesis of a maize-based economy, while charcoal abundance is very low, indicating that Loma Salvatierra remained forested. Our data imply that a complex society was able to develop for a millennium without the need to remove valuable forest resources. I have a BSc in Biological Sciences from the University of Guarulhos (2006), an MSc in Geoenvironmental Analysis also from the University of Guarulhos (2009), and a PhD in Biological Sciences from the Florida Institute of Technology, USA (2017). I was a postdoctoral researcher at the University of Amsterdam (2018-2019) and the University of Reading (2020-2023). My research interests are in the fields of Palaeoecology and Ecology, with a focus on the Quaternary Palynology of Brazilian and Bolivian ecosystems. In my research, I use fossil pollen and non-pollen palynomorphs, such as coprophilous fungi, phytoliths and algal remains in palaeoecological reconstructions. All welcome. Sir Clive Granger Building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}