{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/prc.aspx",
    "content": [
        {
            "p": "The Planning and Resources Committee is a committee of the University Executive Board. Its main purposes are the conduct of the higher level planning and resource management of the University, to monitor, measure and provide challenge to Faculties and Professional Services in the progress of key performance measures and to facilitate effective risk management. Without limiting the general responsibilities as described above: To oversee the business planning process. To monitor the performance of the University against its KPIs and targets. To provide effective challenge and support to the Faculties and Professional services in the achievement of KPIs and targets. To report progress adverse to the achievement of KPIs and targets to University Executive Board and include recommendations to improve performance. To oversee the development of the University’s budget and recommend it to University Executive Board and Council for approval. To approve resource allocations within the constraints of the University’s budget and financial plans including temporary and time limited budget uplifts. To make recommendations to University Executive Board on additional investment priorities and opportunities. To monitor the delivery of the strategic change portfolio and the governance of programme delivery. To oversee the management of risks to the delivery of business plans, KPI activity, and targets, including to receive reports on and copies of strategic and operational risk registers. To recommend University annual student number targets to University Executive Board where these depart from agreed size shape plans. To establish such sub-groups as may be required to deliver specific areas of the Committee’s remit. To receive reports and updates from its sub-committees and where relevant from other University Executive Board committees. To receive from and deliver reports to University Executive Board as required. The Chair of the Committee is accountable for the decisions of the Committee which includes but is not limited to decisions with a financial impact and will liaise with the chairs of other committees and other budget holders where there is overlap in responsibility. The delegated financial authority of the Committee is £5 million or as stated in the Financial Regulations. Deputy Vice-Chancellor Faculty Pro-Vice-Chancellors Pro-Vice-Chancellor, Research and Knowledge Exchange Pro-Vice-Chancellor, Education and Student Experience Registrar Chief Financial Officer Director of Planning, Performance and Strategic Change Chief Marketing and Communications Officer One member of Human Resources One to be nominated by the Students' Union Three Heads of School to be selected through the Committee Membership Selection Process. One Faculty Operations Director to be selected through the Committee Membership Selection Process The Committee will be convened and chaired by the Deputy Vice-Chancellor. The Secretary will be supplied by Governance and Executive Support. The Committee will meet monthly with Planning and Performance Panels taking place quarterly. The Chair shall call additional meetings where necessary. The Committee shall delegate activity to sub-groups or committees as appropriate. The membership of the Planning and Performance Panels shall include a sub-set of the membership of the Committee. Members of the Committee are not able to nominate a deputy to attend the meeting on their behalf. A quorum will be half the regular membership plus one. The term of office for the members selected by the Committee Membership Selection Group is two years. Some of these members may be reappointed for a further year with the agreement of the Chair in order to maintain an appropriate balance between turnover and experience on the Committee. The term of office for the representative nominated by the Students’ Union is one year. Other members are ex officio. The Committee will report to University Executive Board. The effectiveness and the membership of the Committee will be reviewed annually. The following groups will report into the Committee: Commercial Governance Board Flexible Investment Fund Panel Reputation and Recruitment Committee The Committee will also receive reports and papers from other committees where relevant including but not limited to Digital Strategy Committee, Estates and Infrastructure Committee and Research Committee. (Terms of Reference apporved at PRC on 12 September 2022) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}