{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/academicappealscommittee.aspx",
    "content": [
        {
            "p": "The Academic Appeals and Academic Misconduct Committee is a sub-committee of Quality and Standards Committee (QSC). Terms of Reference 1. Under agreed University procedures, to provide an opportunity to any individual to appeal against a final decision of an academic body charged with making decisions on student progression, assessment and awards, including the outcome of a Fitness to Practise Committee or Practice Assessment Panel. 2. Under agreed University procedures, to hear the case of any individual where the School is satisfied that academic misconduct has taken place. 3. Under agreed University procedures, an Academic Appeal Panel (AAP)/Committee (AAC) or an Academic Misconduct Committee (AMC) will be able to substitute a decision on behalf of the University, including an action outside Regulations, subject to at least one current member of QSC being on the AAP, AAC or AMC. If a current member of QSC is not part of the AAP, AAC or AMC the recommendation will need to be referred to a member of QSC for endorsement. The Chair of QSC may also substitute a decision on behalf of the University. 4. Should a School or Department wish to make a revised recommendation outside Regulations as part of its response to an Academic Appeal, the completed School Response Form will be forwarded to a member of QSC for approval before the decision is communicated to the student. 5. To monitor the outcomes of individual cases. 6. To report on trends and issues, including any need for policy change arising from consideration of an individual case or cases. 7. To keep under review the above procedures, and from time to time to make recommendations on improvements. Constitution Academic Staff Membership: The Committee will comprise the membership of the Quality and Standards Committee and selected School Examination Officers. The Committee may also include members of Academic Staff nominated by Heads of School/Department, whose nomination is approved by the Chair of Quality and Standards Committee. Ningbo and Malaysia campuses may also make local appointments subject to the approval of the Chair. Student Membership: Student delegates nominated by the Students' Union, or equivalent body on international campuses, will be eligible to sit on appeals and misconduct hearing panels. The Chair of the Committee will be the Chair of Quality and Standards Committee and will have overall responsibility for actions of the Committee under the Terms of Reference. The Committee will not meet as one group but its terms of reference will be actioned through the Chair, Vice-Chairs, Deputy Chair(s), members of panel hearings and members of Quality and Standards Committee with responsibility for academic appeals and academic misconduct, as appropriate. The Committee will be serviced by a Secretary who is not a member. Chair: Chair of Quality and Standards Committee Deputy Chair (UNUK): Deputy Chair of Quality and Standards Committee Vice-Chair (UNNC): Vice-Provost for Teaching and Learning Vice-Chair (UNMC): Vice-Provost for Teaching and Learning Academic Appeal Committees In cases where an academic appeal committee hearing is required, the panel will be drawn from the Academic Appeals and Academic Misconduct Committee and will include: 1. At least two staff members of the Committee, one of whom shall act as panel Chair. Neither of them will have been involved in the original decision at any stage, nor be from the same School or Department as the student. 2. A student delegate nominated by the Students' Union. If no student delegate is available, the panel shall instead include a sabbatical officer of the Students' Union, or corresponding organisation on an International Campus. In the event that no student delegate and no sabbatical officer of the Students' Union is available, the panel will include a third staff member of the Committee. The student has the right to insist that the third member is a student delegate. 3. For an appeal against the decision of a Fitness to Practise Committee or Practice Appeal Panel there will additionally be two members of the relevant Faculty, one of whom must be a clinically active member of the same professional discipline as the appellant. These additional members will be appointed by the Faculty and will have no previous involvement in the case at any stage. The Chair of the Academic Appeals and Academic Misconduct Committee will not sit on academic appeal committee hearings. The academic appeal committee hearings will be serviced by a Secretary who is not a member, but will be present throughout the proceedings. For further information, please see: Academic Appeals Procedure Academic Misconduct Procedure (updated May 2022) Return to Committees List Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}