{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/audit.aspx",
    "content": [
        {
            "p": "A. To review and advise the Council on: (i) The adequacy and effectiveness of the University's arrangements for risk management, control and governance; (ii) Arrangements for ensuring sustainability, promoting economy, efficiency and effectiveness; (iii) The arrangements for the management and quality assurance of data submitted to the Higher Education Statistics Agency, Office for Students, Student Loans Company and other funding bodies; (iv)The audit of the draft Financial Statements. B. To consider and advise Council on the provision of external and internal audit for the University. Review the effectiveness of the management of risk with a focus on the most important areas of risk, including governance, management, quality, reputational and financial, and report to the Council. Support the University in its identification and management of risk. Review progress by the University in reducing and mitigating key risks. Review the effectiveness of the University's systems and procedures for ensuring that it obtains value for money from all its expenditure, and report to the Council. Review the effectiveness of the University’s policies and procedures for protecting against any loss or irregularity including being notified of any action taken under those policies. Ensure that all significant losses have been thoroughly investigated and that the internal and external auditors – and where appropriate the regulator – have been informed. Advise the Council on the appointment and remuneration of the external auditor, the provision of any non-audit services by the external auditor, and any questions of resignation or dismissal of the external auditors. Annually review the performance and effectiveness of external auditors and make recommendations to Council concerning their reappointment. To discuss the nature and scope of the external audit with the external auditors before it begins and review reports received from the external auditor, where required consulting and being consulted by the external auditor direct. To receive a report from the Finance Committee on the Financial Statements. To review and make a recommendation to Council on the audit aspects of the draft annual financial statements. The audit aspects include the external audit opinion, the Chief Financial Officer’s report on the annual financial statements, the statement of members’ responsibilities, the statement of internal control, corporate governance statement and internal control and risk management statements and any issue raised in the external auditors’ management letter. The Committee will maintain oversight of the resources made available for internal audit to assure itself that these are enough to meet the institution’s needs (or make a recommendation to the University Executive Board or Council as appropriate). Review and approve the scope of Internal Audit's work, including the strategy, planning and implementation of the work and reviewing internal audit reports and investigations and management's responses, the internal audit annual opinion, and annually monitoring the performance and effectiveness of internal audit. Review reports and management responses on matters arising from internal audit work undertaken (either by University of Nottingham UK Internal Audit Service or local counterparts) at the University of Nottingham Malaysia and the University of Nottingham Ningbo China. Investigate any activity within its terms of reference. Advise the University's Council on the selection and appointment of the internal auditor, and any questions of resignation or dismissal of the internal auditor. At least once a year the Committee should meet with the external and internal auditors without any officers present. The external auditors or Director of Internal Audit may request a meeting if they consider it necessary. The Committee should periodically (and at a minimum of every four years) undertake a review of its terms of reference and its own effectiveness and recommend any necessary changes to the governing body. The Committee will report regularly to Council on the matters it considers, including an annual report stating the Committee’s opinion on the adequacy and effectiveness of the University’s internal control, risk management, governance, economy, efficiency and effectiveness, and management and quality assurance of data. Secretary: Senior Governance Manager The quoracy for the Committee is two external Council members. (Terms of Reference approved on 27 September 2022) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}