{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/financecommittee.aspx",
    "content": [
        {
            "p": "A. Make recommendations to the Council on the University's annual revenue and capital budgets, within the strategies and plans approved by the Council, and monitor performance in relation to approved budgets to ensure the long term financial sustainability of the University. B. To approve revenue and capital projects in line with the limits outlined in the Delegated Authority Policy; such limits to be reviewed from time to time and adjustments to be approved by Council. To approve revenue and capital projects. C. To review the Financial Statements. Review and recommend to the Council the University's annual revenue, operating cost andcapital budgets and thereafter monitor performance against these budgets. Review and approve the University's systems and procedures for accounting and exercising financial control, taking account of the report of the Audit and Risk Committee. Advise the President and Vice-Chancellor as the University's Designated Officer on the financial status of the University. Review and recommend to Council appropriate funding arrangements to underpin financial sustainability. Review and recommend to Council a medium-term financial plan. Receive, review and consider generally the Chief Financial Officer’s report on the draft annual financial statements of the University and its subsidiary companies and entities, and the draft annual financial statements themselves, specifically, in relation to ‘going concern’ status. Following such review and consideration, to make recommendations within a report to the Audit and Risk Committee. Formulate responses to relevant Audit and Risk Committee reports that have been submitted to the Council for review and approval by the Council, and monitor implementation of approved actions. Review and approve the University's investment policy in the light of advice from the University's professional investment advisers, subject to the approval of the Council as required. Ensure proper oversight of strategic initiatives. Establish expert and working groups as necessary to consider proposals in detail and receive their reports. Consider reports on relevant financial matters relating to the University of Nottingham Malaysiaand the University of Nottingham Ningbo China. The quoracy for the Committee is five to include two external Council members. (Terms of Reference approved on 27 September 2023) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}