{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/estatesandinfrastructure.aspx",
    "content": [
        {
            "p": "1. Purpose The Committee has executive responsibility for the development and implementation of the University’s Estate Strategy and for the effective management of the University’s estate. 2. Responsibilities Without limiting the general responsibilities as described above: 1. The development, implementation and oversight of the University’s Estate Strategy for approval by UEB including: (a) using analysis of the size and shape of the University portfolio to inform current and future estates planning and capital investment; (b) approving all estate capital projects within budget and delegated authority and approving estate capital projects outside budget or delegated authority for onward consideration by the appropriate committee. (c) advising on the estates requirements for research and knowledge exchange, education and student experience, and professional services; (d) assessing reports from Project Management Groups (for approved capital developments) and monitoring progress of these capital investment projects. (e) receiving post audit reports from the Capital Projects Finance team and monitoring action plans arising; (f) approving/advising on acquisitions and disposals; 2. To oversee the effective management and use of the University estate including reporting on: (a) condition/standards management and compliance (b) functionality - fit for purpose now and future (c) management utilisation and allocation of space (d) environmental and sustainability impact - carbon management including transport and car parking policies. (e) value optimisation – efficient use of non-operational space in order to maximise income. (f) undertaking periodic valuations 3. To advise UEB on external innovation, new ways of developing, designing and utilising space and alternative capital funding options through market intelligence. 4. To recommend to UEB submissions to external agencies (e.g. UKRPIF) and statutory reporting on estates matters. 5. Estate risk management - monitoring the estate risk register ensuring appropriate mitigation is in place 6. To receive and deliver reports and updates to the University Executive Board as required including an annual report. 7. To establish such sub-groups as may be required to deliver specific areas of the Committee’s remit. 8. To receive reports and updates from its sub-committees and where relevant from other University Executive Board committees 9. The Chair of the Committee is accountable for the decisions of the Committee which includes but is not limited to decisions with a financial impact and will liaise with the chairs of other committees and other budget holders where there is overlap in responsibility. 3. Delegated Authority The delegated financial authority of the Committee is £5 million, within the budget allocated to the Committee, or as stated in the Financial Regulations. 4. General 4.1 Membership Chair Deputy Vice-Chancellor Academic Membership Faculty Pro-Vice-Chancellor Engineering Pro-Vice-Chancellor for Education and Student Experience Professional Services Chief Financial Officer Director of Estates and Facilities Director of Health and Safety Deputy Registrar Student Representative To be nominated by the Students’ Union Nominated Members Two to be selected through the Committee Membership Selection Process Where relevant to a particular agenda item, UNNC and/or UNM will be invited to feed into the Committee’s work either by correspondence or video conference as appropriate. The Chair of the Sustainability Committee will be in attendance at meetings as appropriate but is not a member of the Committee. 4.2 Chair and support The Committee will be convened and chaired by the Faculty Pro-Vice-Chancellor, Engineering. The Secretary will be supplied by Governance and Executive Support. 4.3 Frequency of meetings The Committee will meet monthly and the Chair shall call additional meetings where necessary. The Committee shall delegate activity to sub-groups or committees as appropriate. 4.4 Deputies Members of the Committee are not able to nominate a deputy to attend the meeting on their behalf. 4.5 Quorum A quorum will be half the regular membership plus one. 4.6 Term of Office The term of office for the members selected by the Committee Membership Selection Group is two years. Some of these members may be reappointed for a further year with the agreement of the Chair in order to maintain an appropriate balance between turnover and experience on the Committee. The term of office for the representative nominated by the Students’ Union is one year. Other members are ex officio. 4.7 Reporting and Review The Committee will report to University Executive Board. The effectiveness and the membership of the Committee will be reviewed annually. (Terms of Reference ratified at Estates and Infrastructure Committee 22 May 2023) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}