{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/globalengagementcommittee.aspx",
    "content": [
        {
            "p": "1. Purpose The Global Engagement Committee is a committee of the University Executive Board. The Committee will oversee the development of the University’s Global Engagement Strategic Delivery Plan (SDP). 2. Responsibilities Without limiting the general responsibilities as described above: 3. GENERAL 3.1 Membership Chair Pro-Vice Chancellor Global Engagement Academic Member APVC Industrial Strategy, Business Engagement and Impact Faculty of Arts; Global Engagement Director Faculty of Engineering; Global Engagement Director Faculty of Medicine and Health Science; Global Engagement Director Faculty of Social Sciences Global Engagement Director Faculty of Science; Global Engagement Director Professional Services Chief Marketing and Communications Officer Director of Advancement Associate Director, Global Opportunities, Visas and Immigration Associate Director of Careers and Employability Associate Director for Global Engagement Strategy Support UNM Representative Global Engagement Strategy Lead UNNC Representative Chair of UNNC Global Engagement Committee Student Representative Nominated by the Students’ Union Nominated Members One member chosen through the Committee Membership Selection Process The Strategic Delivery Lead and Director of the Asia Business Centre will attend meetings as appropriate but are not members of the Committee. 3.2 Chair and support The Committee will be convened and chaired by Pro-Vice-Chancellor, Global Engagement. The Secretary will be supplied by the Governance and Executive Support. 3.3 Frequency of meetings The Committee will meet quarterly and the Chair shall call additional meetings where necessary. The Committee shall delegate activity to sub-groups or committees as appropriate. 3.4 Deputies Members of the Committee are not able to nominate a deputy to attend the meeting on their behalf. 3.5 Quorum A quorum will be half the regular membership plus one. 3.6 Term of Office The term of office for the members selected by the Committee Membership Selection Group is two years. Some of these members may be reappointed for a further year with the agreement of the Chair in order to maintain an appropriate balance between turnover and experience on the Committee. The term of office for the representative nominated by the Students’ Union is one year. Other members are ex officio. 3.7 Reporting and Review The Committee will report to University Executive Board as required. The effectiveness and the membership of the Committee will be reviewed annually. Sub-committees and task and finish groups will report into the Committee as required. (ratified by Global Engagement Committee 28 September 2023) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}