{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/people-and-culture-committee.aspx",
    "content": [
        {
            "p": "The People and Culture Committee is a committee of University Executive Board. The Committee has executive responsibility for the development and implementation of an inclusive People strategy in alignment with the University’s overall strategy and Performance Framework. The Committee shall ensure that there is an integrated, proactive approach to equality, diversity and inclusion that meets the University’s public sector equality duties, is informed by sector best practice and supports the achievement of the University’s values and objectives. The Committee recognises both the impact of individual characteristics as well as the role of intersectionality in inclusion. The Committee will give support to the Director of Human Resources and University Executive Board regarding strategic items of business. Without limiting the general responsibilities as described above: To develop and review the University’s People Strategy and UNUK’s Human Resources strategy and to drive and oversee the University’s commitment to and progress on their delivery. To report to University Executive Board on the operational effectiveness of Human Resources and plan, review and approve annual reports on the overall delivery of the People Strategy. To monitor and report on the University’s compliance with equality, diversity and inclusion legislation. To ensure that rigorous and transparent employee policies, procedures and systems are in place and are kept under review, including but not limited to recruitment, terms and conditions of employment, induction, pay, pensions, promotion, training, grievances, discipline, capability, performance management framework, employee relations and succession planning. To review and develop the University’s approach to the systems for performance management and reward and guide the University's approach to relevant charter mark activities. To make recommendations and support University staff and students in implementation of institutional level equality objectives and to monitor progress annually towards achieving these objectives. To make recommendations for sharing best practice across the University. To champion diverse representation on all institutional committees. The committee should oversee the identification, mitigation, management of risks associated with the key business of the committee (e.g. delivery of the People Strategy) and ensure appropriate escalation of high scoring, key risks to the Planning and Resources Committee for resolution, oversight and to inform decision-making, as required. To establish and monitor such sub-groups as may be required to deliver specific areas of the Committee’s remit. To receive reports and updates from its sub-groups and where relevant from other University Executive Board committees. To receive from and deliver reports to University Executive Board as required. Coordinate with parallel activities as required at UNM and UNNC. The Chair of the Committee is accountable for the decisions of the Committee which includes but is not limited to decisions with a financial impact and will liaise with the chairs of other committees and other budget holders where there is overlap in responsibility. The delegated financial authority of the Committee is £2m or as stated in the Financial Regulations. Director of Human Resources A Faculty Pro-Vice-Chancellor Associate Pro-Vice-Chancellor for the Researcher Academy and Researcher Career Development Senior University Tutor Director of Estates and Facilities Director of Communications and Advocacy Associate Director of Campus Life Equality Diversity and Inclusion Director of Libraries University Director of Technical Strategy Nominated by the Students' Union Two members selected through the Committee Membership Selection Process The Strategic Delivery Lead EDI will be in attendance at Committee meetings but is not a voting member of the Committee. The Deputy Director of Human Resources, Director of Organisational and People Development and Director of HR Digital, Systems and Shared Services will be invited to be in attendance at meetings as appropriate but are not members of the Committee. The Committee will be convened and chaired by the Pro-Vice-Chancellor, Equality, Diversity and Inclusion and People. The Secretary will be supplied by Governance and Executive Support. The Committee will meet four times per year, and the Chair shall call additional meetings where necessary. The Committee will delegate activity to task-forces and professional service departments as appropriate. Members of the Committee are not able to nominate a deputy to attend the meeting on their behalf. A quorum will be half the regular membership plus one. The term of office for the members selected by the Committee Membership Selection Group is two years. Some of these members may be reappointed for a further year with the agreement of the Chair in order to maintain an appropriate balance between turnover and experience on the Committee. Other members are ex officio. The Committee will report regularly to University Executive Board including an annual reports which will detail progress in the delivery of the University’s Equality, Diversity and Inclusion strategy and the overall delivery of the People/HR Strategy. These SDPs will be replaced by one People SDP in August 2023. The Committee will receive reports from its sub-groups and including the following: Intersectionality and Inclusion Steering Group Joint Consultative Committees Leadership Management Academic Steering Group. The effectiveness and the membership of the Committee will be reviewed annually. (Terms of Reference Approved on 09 February 2023) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}