{
    "url": "https://www.nottingham.ac.uk/governance/universitycalendar/introduction.aspx",
    "content": [
        {
            "p": "The antecedents of The University of Nottingham were the Adult School, established in 1798, and the University Extension Lectures inaugurated by the University of Cambridge in 1873 – the first of their kind in the country. In 1875 an anonymous donor provided £10,000 to establish this work on a permanent basis, and the Corporation of Nottingham agreed to erect and maintain a building for this purpose and to provide funds to supply the instruction. The foundation stone of the original University College building in Shakespeare Street was laid on 27 September 1877, and the building was opened in 1881 by HRH Prince Leopold, Duke of Albany, although the Charter incorporating the University College of Nottingham was not granted until 1903. In 1881 there were four professors – of Literature, Physics, Chemistry and Natural Science. New departments and chairs quickly followed: Engineering in 1884, Classics combined with Philosophy in 1893, French in 1897 and Education in 1905; in 1905 the combined Department of Physics and Mathematics became two separate entities; in 1911 Departments of English and Mining were created, in 1912 Economics, and Geology combined with Geography; History in 1914, Adult Education in 1923 and Pharmacy in 1925. After the First World War the College outgrew its buildings, and the constriction imposed by its site was removed when Sir Jesse Boot, afterwards Baron Trent, provided the spacious grounds some three miles west of the city on which the present buildings stand. The building which he provided, now known as the Trent Building, was opened by His Majesty King George V on 10 July 1928. Apart from its physical transfer to surroundings which could not be more different from its original home, the College made few developments between the wars. The Department of Slavonic Languages (later Slavonic Studies) was established in 1933, the teaching of Russian having been first introduced in 1916. In 1933-34 the Departments of Electrical Engineering, Zoology and Geography, which had been combined with other subjects, were made independent; and in 1938 a supplemental Charter provided for a much wider representation on the Governing Body. But further advances were delayed by the outbreak of war in 1939. In 1945 an impetus to expansion was given, partly by the need to provide courses for returning ex-servicemen, but even more by the changed attitude in the country towards university education. Both these factors applied to all university institutions, but in the case of Nottingham their effect was augmented by the grant of the Royal Charter on 20 August 1948, founding the University of Nottingham, as the result of a petition submitted to the Privy Council in June 1947. Student numbers, which were less than 700 in 1944, rose to over 1,000 in 1945, and to over 2,000 in the session following the achievement of full university status. This period saw other important developments. In 1945 the evening and part-time courses in technical education, which from its inception had been the responsibility of the University College, were transferred to the Nottingham and District Technical College; in 1947 an Institute of Education was established, and the Midland Agricultural College at Sutton Bonington was merged into the University College, becoming the University College School of Agriculture from 1 April 1947. Separate Chairs or Departments of Law, Theology, Philosophy, Economics and Social Administration were established in 1946-47. The period from 1948-1958 was devoted to consolidating advances made in the previous four years. Industrial Economics, Spanish and Metallurgy became independent departments in 1954. New Chairs were instituted in Geography, Zoology, Christian Theology and Agricultural Chemistry in 1949, in Music in 1954, in Horticulture, Civil Engineering, Spanish and Industrial Economics in 1958. The appointment of a Professor of Medieval History in 1952 made the History Department the first to have two Chairs – which became three with the appointment of a Professor of Economic History in 1958. The doubling of Chairs in departments was extended when the University appointed Professors of Applied Mathematics in 1953, of Physical Chemistry and Agricultural Botany in 1954, and of Theoretical Physics in 1958. In the session 1953-54 two magnificent gifts provided for four new Chairs. Mr C T Cripps, MBE, and Mr C H Cripps, MA, endowed a Chair of Metallurgy (filled in 1954) and a Chair of Production Engineering (filled in 1964). T o commemorate the services of the second Lord Trent, who resigned the Chancellorship in March 1954, Boots Pure Drug Co. Ltd. endowed a Lord Trent Chair of Pharmaceutical Chemistry and a Lady Trent Chair of Chemical Engineering, both filled in 1960. An important feature of the period of consolidation was the acquisition of land. Starting with 135 acres in 1948, by 1958 the University owned 306 acres on its main site, most of the land required for its future development. The Portland Building, in solving the problem of overcrowded dining and common room accommodation, removed one of the main hindrances to further expansion. Soon afterwards, the University was asked by the Government to expand its student numbers – at that time 2,300 – to 4,000 in the following ten years. Planning took on a new urgency and intensity in 1957, in preparation both for the academic implications of the increased numbers and for the physical task of erecting new buildings. Academically, new degree courses in Chemical Engineering, Production Engineering, Food Science, Archaeology, Theoretical Mechanics and Architecture were planned and launched. In September 1970 the first undergraduate students were admitted to the Medical School. In the following year the Chairs of Therapeutics, Genetics, Psychiatry, and a third Chair in Physics were established, followed in 1972 by the Chairs of Tumour Biology, Child Health, and Obstetrics and Gynaecology. The University pursued a policy of steady expansion, initially in the Faculties of Arts, and Law and Social Sciences, throughout the 1980s. In 1989 it adopted an ambitious plan to expand to approximately 10,000 full-time students by the mid 1990s. This was achieved by the 1992-93 session. In that period new appointments were established, often with external support, including the Hind Chair of Commercial Law, the Herbert Smith Chair of Commercial Law, the Spicer & Oppenheim Readership in Accounting and Finance, the Standen Readership in Psychology and the British Gas Chair in Architectural Technology and Energy. The Department of Nursing Studies was established, recruiting its first undergraduate students in 1990. On 1 August 1995 the Mid-Trent School of Nursing and Midwifery merged with the University creating a School of Nursing with some 2,000 students, also incorporating the Schools of Physiotherapy and Audiology. In the same year the University brought into the mainstream the vast majority of its continuing education (formerly adult education) courses. In September 2000, the University of Nottingham campus in Malaysia welcomed its first students. The campus, which was located initially in Kuala Lumpur, the capital of Malaysia, is a joint venture involving the University and its Malaysian partners. It launched with courses in three academic divisions (Business and Management, Computer Science and Information Technology, and Engineering) and offers full undergraduate courses leading to degrees of the University. At postgraduate level, the MBA was offered at the outset. Student numbers have grown progressively. Staff are either seconded from the University in England or appointed in Malaysia. All deliver teaching to the University’s normal standards. All courses are subject to the University’s quality assurance procedures and to the requirements of the Malaysian accreditation authorities. Five years later a new purpose-built parkland campus opened at Semenyih, between Kuala Lumpur and Kuala Lumpur International Airport. It is an important centre for higher education not only in Malaysia but also in the region. The University continues to maintain a presence in the centre of Kuala Lumpur, and across both sites has more than 2,800 students from over 50 countries. The campus is now expanding its research portfolio and is competing successfully for research funding within Malaysia. The University of Nottingham Malaysia Campus marked its 10th anniversary in 2010, celebrating a decade of international educational provision and research excellence. Since first opening its doors in Kuala Lumpur in 2000 with just 90 students, the student body at UNMC has grown to a community of more than 3,500, based at its 125-acre dedicated campus site in Semenyih. The University of Nottingham is also a partner in a joint venture with the Wanli Education Group (WEG) - The University of Nottingham Ningbo China, in the Zhejiang province of China. The new campus was the first to be opened in China by a UK university and followed new legislation approved by the Chinese government on Sino-Foreign educational enterprises. The first students registered in September 2004, as the UK Prime Minister, Rt Hon Tony Blair, looked on. In February 2006 the campus, modelled on University Park in Nottingham, was opened formally by Madame Chen Zhili of the Chinese national government, and the Deputy Prime Minister of the United Kingdom, Rt Hon John Prescott. The range of subjects available to the 4,000 students registered at The University of Nottingham Ningbo China in 2009-10 expanded at postgraduate as well as at undergraduate level. New courses included four postgraduate degrees in the area of sustainable and renewable energy, a new Bachelor of Engineering in Architectural Environmental Engineering, and a range of courses offered in English Studies. The costs of studying at Malaysia Campus and at The University of Nottingham Ningbo China are approximately half of the UK international fee, and living costs in Malaysia and China are currently considerably lower than in the UK. This has brought the possibility of a UK education to new generations of outward looking, talented and ambitious students who otherwise could not necessarily afford to study overseas. Chinese applicants to The University of Nottingham Ningbo China are amongst the most talented of their generation, from 23 different provinces in China, all with level 1 attainment in the national GaoKao qualification. This places the institution firmly in the top-tier of China's elite institutions. The University of Nottingham Ningbo China is also establishing new centres for high-quality research in which academic staff collaborate with colleagues in Nottingham UK, with academics in the Asia-Pacific region, and internationally. The most recently established academic schools at campuses in the United Kingdom are the School of Graduate Entry Medicine and Health, based in Derby, the country's first new School of Veterinary Medicine and Science in half a century, at Sutton Bonington Campus, and the first academic school in British higher education dedicated wholly to the study of modern China - The School of Contemporary Chinese Studies. Combining the United Kingdom campuses, the Malaysia Campus, and the University of Nottingham Ningbo China, the University's registered students now total more than 39,000. There are today more than 13,000 international students from over 140 nations, and 6,700 staff. Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}