{
    "url": "https://www.nottingham.ac.uk/governance/documents/data-processing-agreement-may-18.doc",
    "content": [
        {
            "p": "The University Records Storage Facility provides a full service for the collection, retention, return and confidential disposal of University semi-active records. The service is managed by the Estates Department. To use this facility please ensure you have read and understood the University Storage and Archives Policy which lays down the terms and conditions for using this service. Access the Records Storage Facility here. Based at Kings Meadow Campus, Manuscripts and Special Collections are part of the Libraries, Research and Learning Resources Department at The University of Nottingham. The University has been actively collecting manuscript and archive material for over seventy years and there are now over 3 million records in over 700 archive and manuscript collections. New collections are actively sought, to build on strengths and in support of research and teaching. The University Archives The University Archives are one of the collections held and contain the historical records of the University of Nottingham and its predecessor, University College, Nottingham. The Archives constitute the corporate memory of the University and have both an evidential and legal value as well as being an integral part of University’s academic and cultural heritage. Do you have University Records to send to The University Archives? In accordance with the University Retention Schedule, there are certain University records that should be kept for permanent preservation to ensure we keep a rich and diverse history of our University for the years to come. These include a range of records such as committee minutes, annual reports, accounts, architectural drawings and plans, photographs, prospectuses and publications and press cuttings. Please see Annex A to this guidance document for a list of University records that should be routinely sent to the University Archives. Do you know of other records that may be of interest to the University? As well as those listed in the Retention Schedule you may discover other records that you think should be kept for permanent preservation. Manuscripts and Special Collections recently received student paper records dating back to the 1950’s, in years to come they will invaluable to researchers including family historians. The Data Protection Act does allow personal data in these circumstances to be permanently preserved for historical purposes. If you have any questions please contact: mss-library@nottingham.ac.uk For further information about Manuscripts and Special Collections, please visit their webpages: MSS Webpages Annex A: Typical records that should go the Manuscripts and Special Collections Department Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}