{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/environmentalsustainabilitycommittee.aspx",
    "content": [
        {
            "p": "The Committee is a Committee of the University Executive Board. The Committee has executive responsibility for the development and implementation of environmental sustainability across the University. This will include providing strategic direction, accountability, and authorisation. The Committee shall ensure there is an integrated, proactive approach to environmental sustainability across the University that is informed by best practice, and supports the achievement of the University’s values, objectives and strategy. The Committee will work in close partnership with other parts of the University’s governance structures. Without limiting the general responsibilities as described above: The delegated financial authority of the Committee is £2m or as stated in the Financial Regulations. Pro-Vice-Chancellor for Research and Knowledge Exchange Faculty Associate Pro-Vice-Chancellor for Education and Student Experience (Medicine and Health Sciences) Pro-Vice-Chancellor for Research and Knowledge Exchange Two academics with a research focus on sustainability Head of Finance (Professional Services and Strategic Programmes) Director of Estates and Facilities Development and Sustainability Director Head of Procurement One representative from both UNM and UNNC To be nominated by the Students' Union Two to be selected through the Committee Membership Selection Process The Head of Sustainability may be in attendance at meetings but is not a member of the Committee. Specialist members of staff may be invited to be in attendance at meetings as appropriate. The Committee will be convened and chaired by a Pro-Vice Chancellor. The Secretary will be supplied by Governance and Executive Support. The Committee will meet quarterly and the Chair shall call additional meetings where necessary. The Committee shall delegate activity to sub-groups or committees as appropriate. Members of the Committee are not able to nominate a deputy to attend the meeting on their behalf. A quorum will be half the regular membership plus one. The term of office for the members selected by the Committee Membership Selection Group is two years. Some of these members may be reappointed for a further year with the agreement of the Chair in order to maintain an appropriate balance between turnover and experience on the Committee. The term of office for the representative nominated by the Students’ Union is one year. Other members are ex officio. The Committee will report to University Executive Board. The effectiveness and the membership of the Committee will be reviewed annually. The Committee will receive reports from its subgroups: (Approved by Environmental Sustainability Committee on 01.11.2022) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}