{
    "url": "http://www.nottingham.ac.uk/governance/records-and-information-management/records-management/retentionschedule.aspx",
    "content": [
        {
            "p": "Retention schedules are used to determine how long records should be kept. The University Records Retention Schedule follows the JISC Model but the UoN has adopted a big bucket approach to simplify retentions. UoN Retention Guide and Related Retention Guidance can be found here (internal only) This is not an exhaustive list, but is meant to cover the basic types of records stored by the University. In general, the Limitations Act (1980 c.58) sets a time limit of current year plus 6 years for seeking legal redress and this informs the retention schedule. If you aren’t certain about a group of records or they aren’t listed here, keep them 6 years from the time they were created, or contact the Records Manager. The Schedule gives the expected “final record holder” for each record type listed. For administrative reasons, one unit may need to keep duplicates of records held by another unit (e.g. Schools may wish to keep copies of correspondence relating to academic appeals). These duplicates should not be kept for longer than the retention period listed in the schedule. To use the Retention Schedule effectively it is essential that records are dated and that they are filed or stored in some manner that identifies the date or (at a minimum) the year of creation. There can be some confusion as to whether ‘year’ relates to the UK fiscal year, the University financial year, the ‘academic’ year or the calendar year. Some record sequences relate directly to an academic year, in the event of the schedule stating that the (academic year) records can be disposed of after (for example) three years it is advisable to take this to be ‘after the end of the calendar year, three years after the end of the academic year’. For example, a record created on 5 November 2012 in the academic year 2012/13 with a ‘three-year retention period’ could be considered for disposal after 31 December 2016. It is suggested that users read the additional guidance on the records retention schedule in conjunction with this document. If you have any questions about implementing the policy or would like additional advice please contact the Information Compliance Team. Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}