{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/research-and-knowledge-exchange-committee.aspx",
    "content": [
        {
            "p": "1. Purpose Research and Knowledge Exchange Committee will deliver the University’s RKE strategies and drive the performance of research and knowledge exchange initiatives. It will direct resources and deliver a best in sector RKE environment that supports the University to meet its objectives as set out in the Performance Framework. The Committee is responsible for all research activity including that of staff and postgraduate students and has a critical role in gathering intelligence on the external RKE environment and ensuring the University is adequately prepared to take advantage of the opportunities available and manages any risks. 2. Responsibilities The responsibilities of the Committee are: Strategy 1. To direct, support and advise on the development of institutional RKE strategies and policy at the University in support of the University’s strategy and achievement of its key performance indicators and ensure that Faculty RKE strategies align to those institutional RKE strategies. 2. To advise on and support the development of the institutional approach to the Research Excellence Framework (REF), the Knowledge Exchange Framework (KEF) and any future research quality assessment exercises. 3. To work with the relevant committees to ensure that other University strategies including education and student experience, digital, civic, global, environmental sustainability and people and culture are appropriately reference, reflect and intersect with the University’s RKE priorities. 4. To direct the detailed prioritisation of the RKE investment portfolio in support of the delivery of RKE strategies, including internal funding, HEIF and occasional awards from Research England. Performance 5. To take responsibility for the delivery of University RKE strategies and performance including oversight of the progress of initiatives that will deliver RKE strategies in line with the University’s Performance Framework with reference to key performance indicators, to direct and implement changes where they are within the remit of the committee, and to and make appropriate recommendations to senior committees to support delivery where the changes are not within remit. 6. To maintain active scrutiny and oversight of high-level RKE risks, including quarterly review of the committee level risk register. 7. To ensure all risks relating to the delivery of RKE objectives, priorities and key performance indicators are clearly identified, owned and reported. Risks may be identified by the Committee, a sub-committee or senior committee. 8. To consider key risks in Committee decision-making and determine actions to mitigate risks and ensure that risks are escalated to the University strategic level or delegated to RKE sub-committees or appropriate management boards for decision-making and oversight where appropriate, in line with the University Risk Management Framework. Knowledge Exchange 9. To promote the importance of knowledge exchange activities, and in ensuring institutional processes and incentives actively promote KE activities, including but not limited to research impact. 10. To oversee the development of strategic research partnerships with business and industry. 11. To oversee the capture, development and exploitation of intellectual property opportunities, staff exchange, and relevant research related services. Culture and Environment 12. To promote a vibrant research culture across the University working together with faculties, Research and Innovation and other Professional Services and create the appropriate environment and associated infrastructure to support the success of the University’s RKE strategies. 13. To promote collaboration and interdisciplinary research both internally and externally, nationally and internationally. 14. To promote Equality, Diversity and Inclusion across all RKE activities, including in relation to the Committee’s operation and decision making. 15. To oversee the development and implementation of the University’s approach to the Concordats to which it is a signatory. 16. To ensure the University has effective strategies and structures in place for the support, development and training of researchers, including postgraduate research students. 17. To provide oversight of institutional investment into research including equipment, research studentships and other match, to direct related policy and monitor its effectiveness. Compliance and Policy 18. To oversee the development and implementation of institutional policy, procedure and guidance relating to RKE and where appropriate act as the University approval body for these. 19. To advise and input into broader University policies which incorporate RKE elements to ensure the delivery of effective and aligned practice in RKE that meets the expectations of the Committee and the standards and governance requirements of funders and regulators. 20. To oversee and receive assurance of compliance with key regulatory and statutory obligations relating to RKE and to monitor and manage systemic risks that would have impact on the University’s ability to undertake RKE activities, delivery its Strategy or institutional reputation. Engagement 21. To identify, promote and disseminate good practice in the management of research within the University, and also to steer the promotion of research, engagement and impact successes internally and externally. 22. To support international RKE collaboration and the development of international partnerships which align with RKE strategies. 23. To ensure that the structures and approaches supporting research impact and the delivery of Patient Public Engagement and Involvement / Public and Community Engagement are suitable. 24. To agree University responses to relevant consultation processes from external bodies. 25. To monitor the internal and external developments and trends in RKE and take account of them in the development of future RKE strategies and policies. 3. Authority 1. The Committee operates under the delegated authority of Senate and it is empowered to make decisions relating to research and knowledge and to make recommendations and/or refer items to Senate, UEB, and other University committees as appropriate. 2. On behalf of the Research and Knowledge Exchange Committee, the Chair is authorised to approve urgent business which must be conducted between scheduled meetings of the Committee. 3. The Chair will notify the Committee of any action taken under delegated authority between meetings, at the next meeting of the Committee. 4. The Committee has delegated authority of £2 million to approve spending from the Research Strategy budget. 5. The Committee may delegate its responsibilities to sub-committees or groups as appropriate. 6. The Chair of the Committee is accountable for the decisions of the Committee which includes but is not limited to decisions with a financial impact and will liaise with the chairs of other committees. 4. Membership and Term 1. The membership of the Committee shall comprise: Chair Pro-Vice-Chancellor Research and Knowledge Exchange Academic Membership 1 Associate Pro-Vice Chancellor, Researcher Academy and Researcher Career Development 5 Faculty Associate Pro-ViceChancellors for Research and Knowledge Exchange 1 Deputy Pro-Vice Chancellor for Research and Knowledge Exchange 1 Vice-Provost for Research, UNM 1 Vice-Provost for Research, UNNC Professional Services Chief Financial Officer Director Research and Innovation Operations Director Research and Innovation Strategy Director of Libraries Director of Planning, Performance and Strategic Change Student Representative Students’ Union Officer (to be determined by the Students' Union) Senate Members 2 Senate members (to be determined by Senate) 2. The Research Strategic Delivery Lead is invited to attend the Committee. 3. Other relevant colleagues may be invited to attend the Committee at the discretion of the Chair for all or part as is appropriate for the requirements of the meeting. 4. The term of office for the members of Senate is three years and for the Students’ Union Officer it is one year. Other members are ex officio. 5. Operation 1. The Committee shall be chaired by the Pro-Vice-Chancellor Research and Knowledge Exchange and in their absence by the Vice-Chair. 2. The Vice-Chair shall be the Deputy Pro-Vice-Chancellor Research and Knowledge Exchange. 3. The Secretary shall be a member of the Governance team. 4. The quoracy for meeting is half the regular membership plus one. 5. Deputies are not permitted. 6. The Chair will determine the frequency of meetings, but it is expected that meetings will be once a quarter. 7. The Committee is a committee of Senate and reports of meetings and copies of minutes shall be submitted to Senate. Reports and minutes will shall also be submitted to UEB. 8. The Committee may convene sub-groups or committees as it deems necessary to deliver its responsibilities. Any such groups or committees shall report to the Committee. 9. The following sub-groups or committees currently report and submit minutes to the Committee: (a) Research and Knowledge Exchange Operations Committee (b) Post-Graduate Research Committee (c) Research and Knowledge Exchange Futures Advisory Group (d) REF Strategy Committee 10. The Faculty Research and Knowledge Exchange Boards shall also report to the Committee. 6. Review and Assessment The effectiveness of the Committee shall be reviewed after one year of operation. Thereafter it will be considered every three years and include a review of the membership of the Committee. (Terms of Reference approved January 2024) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}