{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/educationandstudentexperiencecommittee.aspx",
    "content": [
        {
            "p": "1. Purpose Education and Student Experience Committee will deliver the University’s ESE strategic delivery plan and has executive management and decision-making responsibility for any underlying strategic, compliance and regulatory matters as delegated to the Committee by Senate and Council. It will direct resources and deliver a high-quality ESE environment that supports the University to meet its objectives as set out in the University strategy and the supporting key performance indicators. The Committee is responsible for all matters relating to education, the continuous improvement of teaching and curriculum, student experience, including wellbeing and career development. The Committee is responsible for ensuring that students are able to engage in educational and service improvement and that they feel their voices are heard. As well as providing a forum for the sharing of best practice across the Institution, the Committee will also have a critical role in considering intelligence on the external ESE environment and ensuring the University is adequately prepared to manage the risks and the opportunities arising from this. 2. Responsibilities The responsibilities of the Committee are: Strategy 1. To direct, support and advise on the development of institutional ESE strategic delivery plans and policy in support of the University’s strategy and achievement of its key performance indicators. 2. To ensure that international campus and Faculty ESE strategic delivery plans align to the institutional ESE strategic delivery plan. 3. To advise on and oversee the development, maintenance and implementation of an academic regulatory framework that effectively supports and underpins the academic rigour of the University, and is in turn supported by the key professional service departments. 4. To work with the relevant committees to ensure that other University strategic delivery plans including research and knowledge exchange, digital, civic, global, environmental sustainability and people and culture are appropriately referenced, reflect and intersect with the University’s ESE priorities. Performance 5. To take responsibility for the delivery of the University ESE strategic delivery plan and performance indicators including oversight of the progress of projects and initiatives in support of these. 6. To direct and implement changes where they are within the remit of the committee, and to make appropriate recommendations to senior committees to support delivery where the changes are not within remit. 7. To maintain active scrutiny and oversight of high-level ESE risks, including quarterly review of the committee-level risk register. To consider key risks in Committee decision-making and determine actions to mitigate risks and ensure that risks are escalated to the University strategic level or delegated to ESE sub-committees or appropriate management boards for decision-making and oversight. 8. To ensure all risks relating to the delivery of ESE objectives, priorities and key performance indicators are clearly identified, owned and reported. Risks may be identified by the Committee, a sub-committee or senior committee. 9. To prioritise strategic projects to enable the effective allocation of funds and resources. Student Experience 10. To promote the importance of the enhancement of student experience activities, and to ensure institutional processes and incentives actively promote ESE activities. 11. To monitor performance in the National Student Survey (NSS) and other relevant gauges of student experience, including the Nottingham Student Experience Survey or similar as used at UNNC and UNM. 12. To support, encourage and enhance student feedback mechanisms at a course, School/Department and Faculty level. 13. To steer professional services to effectively support delivery and enhancement of student experience. 14. To actively engage with the Students’ Union, and Student Associations to ensure the student experience is effectively represented in decision making across all campuses.Culture and Environment 15. To promote the continuing professional development of staff engaged in teaching and student support across the University. 16. To promote collaboration in educational enhancement and service development both internally and externally, nationally and internationally. 17. To promote Equality, Diversity and Inclusion across all ESE activities, including in relation to the Committee’s operation and decision making. 18. To provide a bi-annual review of the Access and Participation Plan. 19. To ensure the University has effective strategies and structures in place to support students to achieve their potential. 20. To provide oversight of institutional investment into ESE including physical and digital infrastructure, service re-design, and other relevant initiatives; to direct related policy and monitor its effectiveness. Compliance and Policy 21. To oversee the development of and ultimately consider, scrutinise, and approve proposals relating to new or revised academic policy and regulation, ensuring it is only introduced where necessary and is suitably accessible to relevant stakeholders. 22. To ensure authority is delegated to the most appropriate sub-committees including, but not limited to, Education Delivery Board, Student Experience Delivery Board, and Quality and Standards Committee, allowing for expertise to be consulted and utilised where appropriate as per their terms of reference. 23. To advise and input into broader University policies which incorporate ESE elements to ensure the delivery of effective and aligned practice in ESE that meets the expectations of the Committee and the standards and governance requirements of funders and regulators. 24. To oversee and receive assurance of compliance with key regulatory and statutory obligations relating to ESE and to monitor and manage systemic risks that may impact the University’s ability to undertake ESE activities, to deliver against strategic priorities and to maintain institutional reputation. Engagement 25. To identify, promote and disseminate good practice with regards to education and student experience and to steer the promotion of ESE success internally and externally. 26. To support ESE collaboration internally and with partners and identify and share relevant resources to augment education or student experience. 27. To agree University responses to relevant consultations from external bodies. 28. To monitor internal and external developments and trends in ESE and take account of them in the development of future ESE strategies and policies. 3. Authority 1. The Committee operates under the delegated authority of Senate and is empowered to make decisions relating to education and student experience, and to make recommendations and/or refer items to Senate, UEB, and other University committees as appropriate. 2. On behalf of the Education and Student Experience Committee, the Chair is authorised to approve urgent business which must be conducted between scheduled meetings of the Committee. 3. The Chair will notify the Committee of any action taken under delegated authority between meetings, at the next meeting of the Committee. 4. The Committee has delegated authority of £2 million to approve spending from the ESE budget. 5. The Committee may delegate its responsibilities to sub-committees or groups as appropriate. 6. The Chair of the Committee is accountable for the decisions of the Committee which includes but is not limited to decisions with a financial impact and will liaise with the chairs of other committees and other budget holders where there is overlap in responsibility. 7. Faculty Associate Pro-Vice-Chancellors (UK campus), Vice-Provosts (UNNC and UNM) and the Associate Pro-Vice-Chancellor, Researcher Academy are responsible for ensuring two-way communication flow between ESEC and the executive accountable officers for the Faculties, international campuses and RKE portfolio to support ESEC’s decision making. 4. Membership and Term 1. The membership of the Committee shall comprise: 2. The ESE Strategic Delivery Lead, Access and Participation Strategic Delivery Lead and Associate Director of Educational Excellence are invited to attend the Committee but are not members of the Committee. 3. Other relevant colleagues may be invited to attend the Committee at the discretion of the Chair for all or part as is appropriate for the requirements of the meeting. 4. The term of office for the members of Senate is three years. Other members are ex officio. 5 Operation 1. The Committee shall be chaired by the Pro-Vice-Chancellor Education and Student Experience and in their absence by the Vice-Chair. 2. The Vice-Chair shall be the APVC Teaching and Curriculum Leadership 3. The Secretary shall be a member of the Governance team. 4. The quoracy for meeting is half the regular membership plus one. 5. Deputies are not permitted. 6. The Chair will determine the frequency of meetings, but it is expected that meetings will be once a quarter. 7. The Committee is a committee of Senate and reports of meetings and copies of minutes shall be submitted to Senate. Reports and minutes will also be submitted to UEB. 8. The Committee may convene sub-groups or committees as it deems necessary to deliver its responsibilities. Any such groups or committees shall report to the Committee. 9. The following sub-groups or committees currently report and submit minutes to the Committee: 6 Review and Assessment The effectiveness of the Committee shall be reviewed after one year of operation. Thereafter it will be considered every three years and include a review of the membership of the Committee. (Terms of Reference Approved on 14 November 2024) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}