{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/teachingandlearningcommittee.aspx",
    "content": [
        {
            "p": "1. To identify and set priority areas in relation to the education and curriculum elements of the University Strategy and the Education and Student Experience Strategic Development Plan (ESE SDP), and to inform the deployment of resources to meet those strategic objectives. To monitor progress with the teaching and curriculum components of the ESE SDP Action Plan. 2. To oversee the development and implementation of policies necessary for the development and leadership of teaching and the curriculum, the assurance and enhancement of quality and standards, and the delivery of outstanding student experience and outcomes as measured by external benchmarks such as the Teaching Excellence Framework (TEF) and the Access and Participation Plan (APP). 3. To monitor relevant internal and external developments and take account of them in the development of strategy and policies. 4. To agree University responses to relevant consultation proposals from external bodies. 5. To promote the student voice and work with the Students’ Union to enhance the education and student experience of all taught students across the institution. 6. To make regular reports to the Education and Student Experience Committee (ESEC) on its activities and plans. 7. To inform and be advised by stakeholders in Careers, Estates, External Relations, Digital and Technology Services (DTS), Governance and Assurance, Human Resources and Professional Development, Libraries, and Registry and Academic Affairs on matters related to education and student experience. 8. To consult with the Student Experience Committee (SEC) on matters relevant to both committees. 9. To receive reports and recommendations from, and commission work from, Quality and Standards Committee (QSC) with regards to quality assurance. 10. To receive reports and recommendations from, and commission work from, the Senior Tutors Network with regards to academic and pastoral support for students. 11. To receive reports and recommendations from, and commission work from, its principal steering groups on curriculum transformation, learning environment (estates and digital), and the professional development of teaching. 12. To consult with other temporary and permanent networks, working groups, task and finish groups on matters of strategic importance. 13. To consider the above in respect of the University’s commitment to equality, diversity and inclusion. Chair - University Associate PVC for Teaching and Curriculum Leadership (Chair): Mark Bradley Academic Representation Faculty Associate Pro-Vice-Chancellors (APVCs) for Education and Student Experience: Chris Woodard (Arts); Mark Gillott (Engineering); Michael Randall (Medicine & Health Sciences); Katharine Reid (Science); Helen Williams (Social Sciences) Vice Provosts for Teaching and Learning: University of Nottingham Malaysia (UNM): Hazel Melanie Ramos University of Nottingham Ningbo China (UNNC): Cohen Tan Chair of Quality and Standards Committee: Kim Edwards University Senior Tutor: Andy Fisher University Digital Learning Director Coordinator/ Chair of Learning Environment Steering Group: Cristina De MatteisUniversity EDI Representative: Jasmeet Kaler Professional Services Representation Careers and Employability: Nalayini Thambar, Director of CES Digital and Technical Services (DTS): Chris Parry, Associate Director – Partnership and Innovation Estates: Andy Nolan, Director of Development and Sustainability External Relations: Emma Szembek, Deputy Director of Student Recruitment Governance and Assurance: Alison Reeves, Associate Director of Education Excellence Support Human Resources and Professional Development: Helen McNamara, Director of Organisational and People Development Libraries: Sue Ackermann, Director of Libraries Registry and Academic Affairs: Chris Hulse, Director of Registry and Academic Affairs Students’ Union: River Butterworth, Students Union Education Officer Secretary: Dean Lymath, Educational Enhancement Manager, Amy Pickering, Executive Support Assistant The PVC Education and Student Experience is invited to attend TLC meetings as an observer. Notes Frequency: one per month (two hours) Reports to: Education and Student Experience Committee (ESEC) Reports from: Quality and Standards Committee (QSC); Senior Tutors Network (STN); Curriculum Transformation Project Steering Group (CTPSG); Teaching Development and Recognition Steering Group (TDRSG); Learning Environment Steering Group (LESG); Educational Excellence Group (EEG); Education and Student Experience Network (ESEN); Academic Representation Group (ARG); PGT Strategy Group (PGTSG); Accessibility Working Group. updated 09/02/2023 Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}