{
    "url": "https://www.nottingham.ac.uk/governance/universitycalendar/physical-development.aspx",
    "content": [
        {
            "p": "A very large building programme was begun in 1958 which concentrated simultaneously on teaching buildings and student residences. Cripps Hall for men – a further gift from Sir Cyril Cripps – was completed in 1959 and in 1960 buildings for Chemistry, Social Sciences and Education were finished; further stages of Engineering buildings were also brought into use. In the session 1962-63 Lincoln and Derby Halls for men were occupied, and so was a building for Physics and Mathematics. In 1963-64 were completed the Science Library, more Engineering laboratories, and a third hall for women students. Rutland and Sherwood Halls were brought into use in 1964-65 and Lenton Hall and more buildings for Engineering were completed. Cavendish Hall was opened in 1965 and Ancaster Hall in October 1966. A new Social Science Building was completed as well as a block for Geology, Psychology and Cell Biology in 1966-67. By 1969 extensions to Hugh Stewart Hall, Cripps Hall and a Student Health Centre were finished. In 1970 a large new teaching building was completed for the School of Agriculture at Sutton Bonington; the Medicine/Pharmacy building opened for temporary use by the new Medical School; Atlantic House was opened at Bramcote for postgraduate students; Ancaster and Rutland Halls were converted for use as mixed Halls and a large new indoor Sports Centre was opened. A policy of extending existing halls rather than building new ones was adopted and additions to Florence Boot, Willoughby and Bonington Halls were completed in 1972-73. Blocks of flats in Beeston were built as a new feature of the plans to meet the accommodation problem and were completed by late 1973. The new Library was started in 1970 and opened in August 1973. It was named The Hallward Library, in honour of the University's founding Vice-Chancellor, Dr Bertrand Hallward. During 1974 an extension to Derby Hall was completed and this Hall, together with Willoughby Hall, was converted for use as a mixed Hall. By far the largest building project of the 1970s was the new Medical School and associated teaching hospital, the construction of which began in 1971. On 28 July 1977 Her Majesty The Queen and HRH the Duke of Edinburgh visited the site during the Silver Jubilee Tour and Her Majesty named the complex of buildings Queen’s Medical Centre. The past two decades have seen much development on campus in the areas of research, teaching, student accommodation and cultural provision. The new Magnetic Resonance Building for Physics was completed in 1991. It now bears the name of Emeritus Professor Sir Peter Mansfield, who shared the Nobel Prize for Medicine in 2003. In 1995 the Institute of Engineering Surveying and Space Geodesy was completed. Much of the existing teaching accommodation has been refurbished. A complex of self-catering flats for students adjacent to the West entrance to the campus, now known as Broadgate Park, was completed in 2005. Early in 1995 HRH The Duchess of Kent opened the completed £5 million University Arts Centre, funded largely through public subscription. The acclaimed Centre houses the Djanogly Art Gallery, the Djanogly Recital Hall, the Angear Visitors Centre, the School of Music and Department of Art History, and Cafe L. The D H Lawrence Pavilion, which houses the Djanogly Theatre and the Weston Gallery, together with a cafeteria, opened its doors in the Autumn of 2001. The original arts centre and the new Pavilion comprise the integrated Lakeside Arts Centre, with facilities open to the public on a daily basis and heavily used. A day nursery offering accommodation for the children of students and staff opened in September 1995 and a new swimming pool for students and staff in the Autumn of 1996. The £50 million site, on former industrial land at Triumph Road, Nottingham, was named the Jubilee Campus in the summer of 1999, marking the culmination of a year-long programme of events to celebrate the fiftieth anniversary of the 1948 grant of the Royal Charter conferring full university status. Jubilee Campus was formally opened by Her Majesty The Queen, accompanied by HRH The Duke of Edinburgh, in December 1999. Covering thirty acres, Jubilee Campus was designed by Sir Michael Hopkins and Partners. The first students were welcomed in September 1999. The campus houses the Nottingham University Business School, the School of Computer Science and the School of Education. There is residential accommodation for 600 undergraduate students in two undergraduate halls of residence, Newark Hall and Southwell Hall, and 150 self-catering places in Melton Hall, which is for postgraduate students. The Jubilee Campus design pays particular attention to environmental issues and is fully landscaped, with a lake, to capture the best features of University Park. The Jubilee Campus continued to develop and the new National College for School Leadership was occupied in August 2002. Nottingham’s bid to host the College was chosen by Government in competition with other universities. In 2006 a new building for Nottingham University Business School was opened by the Minister for Science and Innovation, Lord Sainsbury. In 2008 the University installed the United Kingdom's tallest free standing work of public art, Aspire on a site adjacent to Jubilee Campus. The towering steel structure, inspired by bicycle spokes and intertwining Nottingham lace, was a gift to the University by an unnamed benefactor. It is designed by Ken Shuttleworth, whose architectural consultancy - Make - designed signature buildings at the new Jubilee Campus Second Phase, which includes a new innovation park. The Second Phase was officially opened by HRH The Duke of Gloucester KG GCVO in March 2009. New additions to the Jubilee Campus in 2010 including the Nottingham Geospatial Building, a £9m state-of-the-art facility for Global Navigation Satellite Systems (GNSS). The building is home to GRACE, the GNSS Research and Application Centre of Excellence, which is focusing on the growth in applications for satellite navigation and positioning systems such as the American Global Positioning System and the European Galileo system. The centre will also provide new technology transfer and business development opportunities. Large-scale development of purpose-built student accommodation in areas surrounding the United Kingdom campuses has been undertaken in association with housing associations and other organisations. In the spring of 2002 work began on an ambitious redevelopment of the central area of University Park Campus, including an extension to Portland Building. The extension was completed in September 2003. Other major recent development work includes a new research wing for the Law and Social Sciences Building and the new Centre for Biomolecular Sciences linked to the Medical School. This enables interdisciplinary collaboration between medics, social scientists, pharmacists, scientists and engineers, and teams are undertaking pioneering work in areas such as nanotechnology, tissue engineering and infection control. The University's new Medical School at Derby, situated at the Derby City General Hospital site, welcomed the first 91 students to its graduate entry course in September 2003. In 2005, the University acquired the King's Meadow Campus in Nottingham, formerly the ITV Studios, which provided a new location for a range of professional support services, and also enabled space to be released on University Park Campus for academic activities. The King's Meadow site was remodelled and has also been extensively landscaped. Her Royal Highness The Princess Royal opened the new School of Veterinary Medicine and Science at Sutton Bonington Campus in April 2007, with purpose built facilities for both research and teaching. Other School facilities include twelve stables for student horses, an indoor menage and a student smallholding. Staff and students also have access to the University farm dairy, sheep and pig facilities on the 1,000 acre campus. A new Sports Centre was also opened at Sutton Bonington in 2007, alongside new halls of residence. At University Park, social facilities for students at Portland Building were extensively redesigned, and a year later a Centre for Student Services, integrating essential services for students, was established within the same building. In September 2008 the University's fifth Vice-chancellor, Professor Sir Colin Campbell, opened the Centre for Sustainable Energy Technology at The University of Nottingham Ningbo China. The building is shaped like a traditional Chinese paper lantern, and its principal benefactor is Mr Kin Kwok Chung. Off-campus, the University's commitment to the local community and to widening participation was underlined with the opening of the Nottingham University Samworth Academy (NUSA) in September 2009. The Academy has places for 650 pupils from an inner-city area of historically low educational achievement, and will eventually cater for 950 including a 200-strong sixth form. September 2010 saw the opening of NUSA's new £24m building, with outstanding facilities including: suites of Apple Mac computers, video editing equipment and PCs; a recording studio; a 220-seat, university-style lecture theatre; a suite of music technology rooms; and excellent sports facilities including a fully-fitted multigym. The new building has been created to be as environmentally-friendly as possible, with a green 'living' roof, rain water recycling and a biodiesel boiler which uses renewable energy. Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}