{
    "url": "https://www.nottingham.ac.uk/governance/records-and-information-management/records-management/records-management-framework-policy.aspx",
    "content": [
        {
            "p": "Introduction The Records Management Framework, or ‘RM Framework’, is a network of Records Officers who will support the University in delivering its aims and responsibilities under the Records Management Policy. Through the work of the Records Officers, the RM Framework will broadcast all relevant policies and guidance across the University, and support staff in following best practice guidance in records management. Aim The aim of this policy is to explain the scope and remit of the RM Framework and define the responsibilities of the key roles within it. Framework Scope The RM Framework will operate alongside an annual programme of planned records management activities designed to target awareness of best practice. The Records Manager will identify developmental areas in records management and design tailored annual programmes each year. The annual programme will be an academic year cycle. Records Officers will be introduced at selected schools and departments across the University by the Records Manager. The Records Officer role will be fulfilled by staff members alongside their primary roles. The School Manager or Head of Department is to ensure this role is allocated to an appropriate individual who will be a suitable advocate of the RM Framework. The Records Officers will be the link for all records management issues between staff in their school or department and the Records Manager, and will enable the University to improve its records management practices through better training and awareness. Roles and Responsibilities The Registrar is the head of the Records Management Framework and responsible for overseeing all aspects of the Records Management Framework and providing final sign off for all policies and guidance. The Records Management Steering Group is responsible for reviewing and signing off all policies, guidance and communications that the Records Manager proposes. The Records Manager is responsible for the successful management of the Framework; planning and delivering the annual records management programme, producing and amending all policies, guidance and communications and managing the Records Officers. The Records Officers are responsible for disseminating all policy and guidance materials provided to them by the Records Manager and for acting as the first point of contact for records management issues within their schools and departments. A detailed role profile is provided as in Appendix A to this policy. All Managers are responsible for supporting the designated Records Officers within their schools and departments and for encouraging best practice in records management to all staff. All staff are responsible for adhering to all policies and guidance provided to them by The University. Training and Awareness All Records Officers will receive initial training in fulfilling their roles as Records Officers. There will also be regular meetings with the Records Manager to ensure best practice in records management is captured and shared amongst the Records Officers. The Records Management Framework will also provide a programme of training for all University staff to access. Records Management webpages will be the primary source of information for all staff at the University regarding records management and will be updated regularly by the Records Manager. Further Information For further information about the Records Management Framework please contact the Information and Records Manager. Jennifer Rochfort Information and Records Manager The University of Nottingham Jennifer.rochfort@nottingham.ac.uk Appendix A to Records Management Framework Policy Records Officer Role Profile Purpose of the Role: Records Officers will provide a vital link between the Records Management Steering Group and their School or Department. They will be the nominated point of contact for records management in their working areas, and will play an important role in advocating the RM Framework and the benefits of good records management practice. Main Responsibilities: Each Records Officer will be required to: Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}