{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/civicandregionalcommittee.aspx",
    "content": [
        {
            "p": "1. Purpose The Civic and Regional Committee is a committee of University Executive Board. The Committee has oversight of the University’s civic and regional engagement and develops strategy to direct our civic and public value contribution. The oversight remit of the Committee will extend across the full breadth of the University’s current interactions at the civic and regional level, including the City, County, East Midlands and Midlands Engine. R&I (Business and Local Partnerships) and External Relationswill be responsible for monitoring progress against our strategy as well as ensuring that civic and regional engagement is effectively aligned with other University core strategies. Updates will be provided to the University’s Executive Board and other relevant Executive Board committees. The Chair will report at least once a year to the Vice-Chancellor’s Partnership and Stakeholder Engagement Forum about the status of relationships at the civic and regional level. 2. Responsibilities Without limiting the general responsibilities as described above: 3. General 3.1 Membership Chair Faculty Pro-Vice-Chancellor Arts Civic Leads Five Civic Leads, one from each Faculty Professional Services Thematic lead for Community: Registrar CARO: Director of Advancement External Relations: Deputy Director, Advocacy (Public Affairs) Research and Innovation: Deputy Director, Research and Innovation Public Engagement: Director of the University of Nottingham Institute for Policy and Engagement Careers: Director of Careers and Employability Student Representative To be nominated by the Students’ Union Nominated Members Four members selected through the Committee Membership Selection Process The Strategic Delivery Lead, Civic Affairs Manager and the Senior Project Manager (Planning, Performance and Strategic Change) will be in attendance at meetings as appropriate but are not members of the Committee. Observers (agenda dependent) The following thematic leads and members are staff are not members of the Committee but shall be invited to attend on an ad hoc basis and will receive reports and papers of the Committee and have the opportunity to feed into the work of the Committee wherever appropriate: 3.2 Chair and support The Committee will be convened and chaired by the Faculty Pro-Vice-Chancellor, Arts and the Deputy Director, Advocacy (Public Affairs) will act as Executive Lead. The Secretary will be supplied by the Governance and Executive Support. 3.3 Frequency of meetings The Committee will meet quarterly, and the Chair shall call additional meetings where necessary. The Committee will delegate activity to task-forces and professional service departments as appropriate. 3.4 Deputies Members of the Committee are not able to nominate a deputy to attend the meeting on their behalf. 3.5 Quorum A quorum will be half the regular membership plus one. 3.6 Term of Office The term of office for the members selected by the Committee Membership Selection Group is two years. Some of these members may be reappointed for a further year with the agreement of the Chair in order to maintain an appropriate balance between turnover and experience on the Committee. The term of office for the representative nominated by the Students’ Union is one year. Other members are ex officio. 3.7 Reporting and Review The Committee will report to University Executive Board. The effectiveness and the membership of the Committee will be reviewed annually. The Committee will receive reports from the Civic and Regional Group. (Terms of Reference ratified at Civic and Regional Committee 26 September 2023) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}