{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/safetycommittee.aspx",
    "content": [
        {
            "p": "Terms of Reference To consider, comment on and approve the University health and safety strategy, policies, and management arrangements, to ensure that the University meets all legislative requirements and best practice standards. To seek assurance in relation to health and safety performance and promote a positive health and safety culture. To act as the formal consultative forum for the University in relation to health and safety. It is important to note that, whilst an important function, the Committee does not merely exist as a consultative forum but is established to ensure that significant actions are identified and implemented in such a way as the University can demonstrate that Health and Safety are being effectively managed as a strategic priority. Attendees at Committee are expected to add value to the process and contribute to the outputs produced as a result of the Committee’s activities. The Health and Safety Committee, in line with university policy, has the ability to form and disband sub-committees as required. Main Activities The Committee shall be responsible for the overseeing of strategic Health & Safety Management, and will have functions including, though not restricted to: Sub-Committees The University also seeks to achieve best practice around health and safety and so: Measures and Outputs Constitution Chair Faculty Pro-Vice-Chancellor (Engineering) Faculty Pro-Vice-Chancellors Faculty Pro-Vice-Chancellor (Arts) Faculty Pro-Vice-Chancellor (Medicine and Health Sciences) Faculty Pro-Vice-Chancellor (Science) Faculty Pro-Vice-Chancellor (Social Sciences) Registrar Chief Financial Officer Director of Estates and Facilities Estates Operations Director Director of Human Resources Operations External member of University Council Director of Health and Safety 8 Health and Safety Representatives as follows reflecting the spread of workplace hazards UCU (2 representatives): UNITE (3 representatives): UNISON (3 representatives): Secretary The Director of Governance and Assurance will attend meetings but is not a member of the Committee. Deputies Faculty Pro-Vice-Chancellors are permitted to nominate either their Faculty Operations Director or Associate Pro-Vice-Chancellor to attend meetings on their behalf in exceptional circumstances only and to be agreed with the Chair. Union representatives can send a deputy on their behalf in exceptional circumstances only and from a pool of pre-submitted persons. Other members are not able to nominate a Deputy to attend on their behalf. Quoracy A quorum will be half the regular membership plus one. Organisation Legislation The University recognises its legal duty to consult with staff and trade union representatives. Relevant legislation includes: Reports to Audit and Risk Committee 2 times per year at six monthly intervals and onward to Council. (membership updated 20 November 2023) Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}