{
    "url": "https://www.nottingham.ac.uk/governance/records-and-information-management/policies-and-guidance/general-data-protection-regulation-faq.aspx",
    "content": [
        {
            "p": "The General Data Protection Regulation (GDPR) is a new, European-wide law that replaces the Data Protection Act 1998 (DPA) in the UK. It places greater obligations on how all organisations, including universities, handle “personal data”. It must be implemented in the UK by 25 May 2018. The GDPR is an evolution of the existing law and so many of the GDPR’s concepts and principles are similar to those in the DPA, however there are new elements which require additional documentation to be produced and kept by the University to enhance transparency. GDPR is going to affect every part of the University. We need data protection to be at the forefront of your mind. Everyone has a responsibility to determine how they will be affected by GDPR and the steps they need to take to ensure the University’s compliance. Please read the rest of these FAQs which have been designed to take you through the key concepts of the GDPR and the documents which we need you to complete in order to ensure that the university is compliant with the GDPR by 25 May. All the aims and objectives of the Eight Principles of the DPA are addressed by GDPR, but only six are specifically references as two more (Data Subject Rights and Data Transfers) are covered by other parts of the GDPR. The Principles are as follows: This means personal data should be processed lawfully, fairly and in a transparent manner in relation to the data subject. Transparency and fairness is achieved via your privacy notices, which are explained in greater detail in the “Fair Processing?” FAQs. This means personal data should only be collected for a specified, explicit and legitimate purpose and not be further processed in a manner that is incompatible with those purposes. You should specify the purpose in your privacy notice. This means personal data should be limited to what is necessary in relation to the purpose for they are being processed, e.g. if you are only sending an e-newsletter, you will probably only need an individual’s name and email address. This means that you should take reasonable steps to keep personal data up to date and ensure that personal data that is inaccurate, having regard to the purpose for which they are processed, are erased or rectified without delay. This means personal data should be kept in a form which permits identification of data subjects for no longer than is necessary. This means you should decide how long it is necessary to retain information give the purposes that it was collected for and securely delete information when it is no longer needed for those purposes. This means personal data should be processed in a manner that ensures appropriate security of that personal data, such as protection against unauthorised processing, accidental loss, destruction or damage. You should be guided by these principles when you process personal data. If you are processing data about criminal convictions, criminal offences or related security measures, you also need both a lawful basis for processing, which are set out in the Data Protection Act 2018 (currently a Bill going through parliament) and which are similar to the bases above. You should document both your lawful basis for processing and your criminal offence data condition so that you can demonstrate compliance and accountability. If no lawful basis applies to your processing, your processing will be in breach of the GDPR. You will need to produce a privacy notice to let individuals know what data you will be processing and the basis for doing so. We have produced a skeleton template, with accompanying guidance notes, which we can share with you to help you do this. Failure to adequately conduct a DPIA where appropriate is a breach of the GDPR and could lead to fines of up to 2% of an organisation's annual global turnover or €10 million – whichever is greater. This is only applicable from 25 May and is not historical. A DPIA should be undertaken before beginning any new “high-risk” processing activity, for example processing sensitive data or profiling activities. This is both an institutional and an individual responsibility. The statutory fine for a breach of this element of the GDPR up to EUR 10,000,000, or up to 2% of annual worldwide turnover, whichever is higher. It is, therefore, important to regularly assess privacy compliance, by, for example, conducting regular Data Privacy Impact Assessments (DPIAs). The practical steps that need to be taken will depend on the likelihood and severity of the risks to privacy, the state of the art and the costs of implementation. The penalties for data breaches have increased significantly under the GDPR and so it more important than ever for everyone to be taking appropriate security measures and report any security breaches. For (mainly) a breach of record keeping, contracting and security clause: For (mainly) a breach of basic principles, data subject rights, transfer to third countries: There is no need to do anything now, but it is important that you are quick and reactive in the event of a suspected data breach. The level of fine will depend on any remedial action University takes and its willingness to co-operate with the ICO. Most contracts will already include clauses which address data protection issues; even if these are simply to codify that each party will comply with their respective obligations under the current Data Protection Act and the Privacy and Electronic Communications Regulations. However, it is highly likely that many contracts at the time they were completed would not have made provision for the possibility of the DPA being superseded, never mind the requirements of GDPR. It is vital that you review your existing contracts which will still be live by the time the GDPR is in force and check the data protection clauses within them. It is highly likely the clauses within these contracts will need to be updated to ensure that the data protection obligations reflect the GDPR requirements. Equally, any contracts currently being negotiated should contain provisions which incorporate the GDPR. Otherwise, you run the risk of breaching the GDPR as soon as it applies. This: Please visit the GDPR workspace pages for the template information asset return and guidance. Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}