{
    "url": "https://www.nottingham.ac.uk/governance/universitycalendar/ordinances/ordinance-xv-powers-of-the-senate.aspx",
    "content": [
        {
            "p": "The Senate shall have the following powers:- 1. To oversee education, assessment and the student experience across all campuses – in the UK, China and Malaysia – and to consider reports from time to time on the delivery of the University’s education and student experience strategies and KPIs as delegated to Senate Committees concerned with education and student experience. 2. To promote research and knowledge exchange across all campuses – in the UK, China and Malaysia – and to consider reports from time to time on the delivery of the University’s research and knowledge exchange strategies and KPIs as delegated to Senate Committees concerned with research and knowledge exchange. 3. To report to the Council annually on the assurance of quality and standards as required by regulators and on any other academic matter. 4. To delegate to Senate Committees concerned with education, quality and standards, the making of all regulations for giving effect to the Ordinances of the University relating to education, assessment and the award of Degrees (other than Honorary Degrees) Diplomas and Certificates. 5. To suspend normal regulations relating to education, assessment and the award of Degrees, Diplomas and Certificates and implement alternative arrangements in the interest of students as a last resort should University business be disrupted and to report any such action to Council. 6. To delegate to the Senate Committees concerned with education, quality and standards, the appointment of External Examiners as delegated by the Council. 7. To review, amend, refer back or disallow any act of any of its sub-committees and to give directions to any such sub-committee. 8. To report on any matter referred to or delegated to the Senate by the Council. 9. To make regulations for: (a) student conduct which allow, among other things, for the suspension or expulsion of students; (b) support (fitness) to study which allow, among other things, for the suspension, exclusion, interruption, or permanent withdrawal of students on health, safety and/or wellbeing grounds. Actions under the regulations in each case may be taken by the Registrar, nominee, or properly constituted panel or committee or other person authorised by the regulations and will be reported to the relevant Senate Committees concerned with education and student experience. 10. To appoint members of the Senate to be members of the Council. 11. To report to the Council on proposed changes of Statutes or Ordinances. 12. To receive the names of recipients of Honorary Degrees subject to procedures prescribed by Ordinance. 13. To exercise all such powers as are or may be conferred on the Senate by the Charter, Statutes, Ordinances and Regulations and to do such other acts and things as the Council shall authorise. 14. To receive and comment on major schemes for the organisation of the Faculties and Schools. 15. As delegated by Council to confer subject to conditions prescribed by Ordinances XXVI and XXVIII the title of Emeritus Professor or Honorary Professor, Associate Professor, Assistant Professor or Fellow of the University. As approved on 9 May 2023 Return to Ordinances list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}