{
    "url": "https://www.nottingham.ac.uk/governance/office-for-students/office-for-students.aspx",
    "content": [
        {
            "p": "The University is an Approved (fee cap) provider with the Office for Students (OfS). As part of its conditions of registration, the University must comply with legal, statutory and regulatory requirements. Access to policies, documents and advice in key areas of the University's registration can be found below. The Vice-Chancellor is the Accountable Officer to the OfS for the University’s registration. The Vice-Chancellor is supported in this work by colleagues including the Registrar, Director of Governance and Assurance, Legal Counsel and the Chief Financial Officer. The Regulatory Compliance team is responsible for oversight of the University’s responsibilities and ensuring our wide-ranging obligations including submission of statutory reports and responses to consultations are met with the support of various Professional Services Teams. If you have any questions regarding the University’s obligations to the OfS, please contact the Regulatory Compliance Team. Details can be found below. Reportable Events The OfS requires universities to report certain events as part of its conditions of registration. For more information on reportable events and the process to support the investigation and reporting of such events please contact reportable.events@nottingham.ac.uk. Access and Participation Plan (APP) The University's Access and Participation Plan 2020-2025 can be found here. Transparency Information The Office for Students (OfS) requires the University to publish data showing attainment data in a prescribed format. The University of Nottingham data can be found here. Other Information For more information on the Office for Students please visit the OfS webpage. Contact Information For further information regarding the University's compliance with its OfS conditions of registration, please contact Angela McDonald, Associate Director of Risk and Assurance. Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}