{
    "url": "https://www.nottingham.ac.uk/governance/records-and-information-management/documents/publicationschemeclasstwo.aspx",
    "content": [
        {
            "p": "What we spend and how we spend it In this section you can find information about the University's management of its financial resources. Much of this is set out in our annual Financial Statement. Please note that information is excluded from this scheme where release could prejudice the University's commercial interests. Annual Financial Statement Annual Statement of Accounts Financial Statements Revenue Budgets Capital Expenditure Budgets Financial Audit Reports Capital Expenditure Plans Current capital developments Recent capital developments Salary Scales Administrative, Professional and Managerial Job Family Technical Services Job Family Research and Teaching Job family Operations and Facilities Job Family Senior roles above Level 6 are on a spot salary on a personal basis above £55,259 set and reviewed by the Vice Chancellor and remuneration committee Senior staff expenses Conditions of Contract Model_Invitation_to_Tender Supplier_Performance The University of Nottingham’s Procurement Department place contracts with suppliers who offer the best value for money with high levels of service, quality and delivery. Whenever possible we contract under collaborative framework agreements, either Government Procurement Service, HE consortium or other Public Sector bodies such as YPO/ESPO. We also make full use of a number of local collaborative working arrangements and procurement ‘hubs’ such as the SUPC agreements, to ensure we are constantly seeking best value. The HE Sector, in common with other public sector organisations and government departments, must meet the requirements of EU public procurement directives which ensure open and fair competition. Under these directives, we must advertise all contracts with a value over £173,934 (for supplies and services) or £4,348,350 (for works) in the Official Journal of the European Union (OJEU). These adverts enable suppliers to express an interest in the majority of our contracts. Suppliers can view a list of current/forthcoming tender opportunities via the following link on our website: http://www.nottingham.ac.uk/fabs/procurement/supplier-zone/tenders.aspx here you can register interest in contracts and apply online. The University of Nottingham has a policy of ensuring companies which tender for contracts meet agreed Equality and Diversity standards. Funding Systems and Guidance Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}