{
    "url": "https://www.nottingham.ac.uk/governance/universitycommittees/student-experience-committee.aspx",
    "content": [
        {
            "p": "1. Purpose The Student Experience Committee is a committee of the Education and Student Experience Committee. Its main purposes are to have oversight of the implementation of the University’s strategy and policies relating to Student Life, support the teams working in these areas, and advise on the development of future student life strategies. 2. Responsibilities Without limiting the general responsibilities as described above: 3. Delegated authority The Committee has no delegated financial authority. 4. General 4.1 Membership Chair Deputy Registrar Academic Membership Two academic members to be selected through the Committee Membership Selection Process. Professional Services Malaysia Campus Registrar, Malaysia Campus China Campus Director of Campus Life, China Campus Director of Sport and Physical Exercise, China Campus Head of Counselling and Wellbeing, China Campus UK Campuses Director of Estates Chief Marketing and Communications Officer Director of Student and Campus Life Director of Careers and Employability Director of Libraries Director of Sport Director of Registry and Academic Affairs Head of Residential Life One Faculty Operations Director Senior Digital and Technology Services Representative Researcher Academy Representative PVC for Equality, Diversity and Inclusion and People In order to support effective engagement across our global University, the chair may co-opt up to three further staff from China or Malaysia. Student Representatives Two Students’ Union student nominees to include at least one sabbatical officer. Other Parties in Attendance The Chair may invite the Chief Executive Officer of the Student Union or other appropriate SU senior role to be in attendance. 4.2 Chair and support The Committee will be convened and chaired by the Deputy Registrar. The Secretary will be the Student Services Manager, Deputy Registrars Department. 4.3 Frequency of meetings The Committee will meet once per term, and the Chair shall call additional meetings where necessary. The Committee will delegate activity to taskforces and professional service departments as appropriate. It is anticipated that occasional joint meetings with Teaching and Learning Committee will be arranged to share ideas and knowledge. 4.4 Deputies Members of the Committee are not able to nominate a deputy to attend the meeting on their behalf. 4.5 Quorum A quorum will be half the regular membership plus one. 4.6 Term of Office The term of office for the members selected by the Committee Membership Selection Group is two years. Some of these members may be reappointed for a further year with the agreement of the Chair in order to maintain an appropriate balance between turnover and experience on the Committee. The Students’ Union shall nominate its student representatives annually, with a maximum term of two years. 4.7 Reporting and Review The Committee will report to the Education and Student Experience Committee. The effectiveness and the membership of the Committee will be reviewed annually. Return to Committees list Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 115 951 5761 fax: +44 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}