{
    "url": "https://www.nottingham.edu.my/GS/COVID-19/Dear-New-Postgraduate-Students.aspx",
    "content": [
        {
            "p": "We appreciate this is a challenging time for all of our postgraduate research students at this time, especially if you have just joined us. While University of Nottingham Malaysia’s new model of business-as-usual shifts to a web-based existence and the laboratories are closed, we are aware that our postgraduate research students need caring support and clear guidance. We’ve put together some guidance notes that we hope you will find useful. Prof Jessica Corner, Pro-Vice Chancellor (Research and Knowledge Exchange), has written a blog on the impact of COVID-19 on UK research activities. The needs of the postgraduate community are at the heart of what we do at the Graduate School. Our network of specialist staff delivers transformative opportunities for postgraduate students who wish to excel in their chosen field. Our exclusive training and development provision includes over 60 specialist courses and researcher mobility funding. We also provide a training and development hub which offers dedicated social and study spaces for postgraduate students. From facilitating public engagement events to providing the highest quality training and development support for postgraduate students, our Graduate School staff aim to cultivate a supportive culture in which you can advance and thrive. We are here to support you and ensure you have a rewarding postgraduate experience. Learn more about our programmes and opportunities by clicking on the links below: Our virtual postgraduate induction is an opportunity for new postgraduate students to hear about how we can support you with training and development opportunities and what funding opportunities are available to support your research mobility and interdisciplinary collaborations. Welcome presentations are delivered by our senior members of staff from the Graduate School which introduce you to the additional facilities and resources available to postgraduate students. There are also interactive opportunities to hear and gain valuable insights from key members of staff from various faculties. Introductory presentations & sharing sessions are delivered by our Students’ Association (SA) Postgraduate Officer, who is also leading the Postgraduate Students’ Network (PGSN), and some of our senior postgraduate students. These are great avenues to learn more about communal support and guidance available for postgraduate students. There is also an opportunity to learn more about the “buddy system” which aims to help new postgraduate students to adjust to postgraduate life at the University and assist them with challenges associated with the early stage of their postgraduate journey, especially in these unprecedented and challenging times. Postgraduate Students’ Network (PGSN) is a representative body of postgraduate students at University of Nottingham Malaysia. A network of postgraduate students, by the postgraduate students, they aim to create greater community engagement and provide quality support services as well as effective representation of postgraduate voice at the University. If you would like to find out more about Postgraduate Students’ Network and their support to postgraduate students, please get in touch via email. You can also follow their Facebook page. Live chat is a great platform for you to communicate and interact with us. We welcome you to ask us questions! We look forward to meeting you soon at our induction session. email:graduateschool@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}