{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2021/Graduate-School-Newsletter-Nucleus-Issue-0121-41.html",
    "content": [
        {
            "p": "Nucleus Issue 01/21 (41) Read on for all the latest news from the Graduate School. Don't forget you can get in touch with us via Facebook or by email at graduateschool@nottingham.edu.my. We remain as dedicated as ever to delivering the highest quality training and development support for our postgraduate students and early career research staff amidst the ongoing pandemic. We have been monitoring updates on COVID-19 closely and in light of the extension of CMCO (conditional movement control order), we are maintaining our online delivery of training and development provisions until further notice. As a postgraduate research student, you may start your research degree at different times of the year. We send out a welcome email upon request to new postgraduate researchers which contains information about registering on Moodle, university support services and upcoming events as well as training and other opportunities. As an early career research staff or a research supervisor, we welcome you to engage with us as we offer a range of research and supervision workshops to help you enhance your personal and professional development. We are offering the following RDP courses in January 2021, via Microsoft Teams. These are aimed at postgraduate students. The joining instructions and guides are available on the sign up page. Understanding How to Use Mendeley Wednesday 6 January 2021, 10am - 12nn This course will inform students on how to create, populate and use Mendeley, a bibliography manager in organising their literature review. Understanding How to Use Endnote Wednesday 13 January 2021, 10am - 12nn This course will inform students on how to create, populate and use Endnote, a bibliography manager in organising their literature review. What Do I Want to Get Out of a Conference Tuesday 19 January 2021, This course will discuss key issues when choosing a conference and how to maximise participation when attending a conference. Planning Research and Time Management Thursday 21 January 2021, 2pm - 4pm This course will support the development of good time management and enable students to plan their research development more efficiently. Creative Thinking Monday 25 January 2021, 2pm - 4pm This course will introduce the techniques to enhance creative thinking and subsequently promote critical thinking. Preparing for Your Annual Review Tuesday 26 January 2021, This course will discuss the elements of the annual review process and consider the possible structures of an annual review report. Effective public speaking Journal editorial Improving scientific presentation Researcher Academy and how it connects to us Introducing Graduate School to the new postgraduate research students Look out for our next issue of Graduate School Bulletin next month! In the meantime, please continue to observe and follow the safety advice and precautionary measures by our local authorities and University. Graduate School University of Nottingham Malaysia"
        }
    ],
    "pdf_files": []
}