{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2021/Graduate-School-Newsletter-Nucleus-Issue-0221-42.html",
    "content": [
        {
            "p": "Nucleus Issue 02/21 (42) Graduate School newsletter The needs of the postgraduate and early career researcher community are at the heart of what we do at the Graduate School. Read on for all the latest news from us. U21 PwC Innovation Challenge Showcase your critical thinking and share your ideas with PwC and their clients to win a 7-day trip to Dubai and some exclusive world-class training and professional development opportunities. Disclaimer: Travel will only take place when it is safe to do so and will be in accordance with global travel guidelines. Researcher training courses Find out our training and development provision for April. Researcher Development Programme (RDP) Preparing for your annual review Tuesday 6 April 2021 10am - 12nn This course will discuss the elements of the annual review process and consider the possible structures of an annual review report. Preparing for the viva Thursday 8 April 2021 This course will delve into the main purposes of viva, its process and criteria as well as some key skills to consider in the lead up to, and during the viva itself. Using posters to communicate research Tuesday 13 April 2021 2pm - 4pm This course will introduce and support the creation and design of a poster that communicates research work in an innovative and informative manner. Introduction to the skills of teamwork Thursday 15 April 2021 This course will highlight the benefits of teamwork as well as identify and analyse the features of an effective team. Getting published Tuesday 20 April 2021 This course will highlight the importance and purpose of publishing paper. It will also offer guidance and tips on the journey of publishing. Research ethics & integrity Wednesday 28 April 2021 This course will study the importance of research ethics and integrity, and further outline the ethics procedures in UNM. Supplementary workshops Time to write Thursday 22 April 2021 This session will assist in structuring periods of writing and limiting distractions while providing the necessary guidance and motivation to write efficiently and effectively. MS Teams: A practical guide Monday 26 April 2021 10am - 11am This session will explore the many functionalities of MS Teams. Participants will learn how to compose their own Teams and integrate files, notes and apps. Additional resource on online presentation skills Tips for presenting online The Researcher Academy recently produced a video providing tips and advice for delivering online presentations. Although this video is targeted to support the upcoming online 3MT competition, it is also relevant to all other online presentations. On our blog See what's new on our Graduate School Blog. Writing and editing Discover more on academic writing and editing, and get to know some of our training and development courses that are specifically designed to developing and improving your writing skills as a postgraduate researcher. A network by Students' Association for postgraduate students Find out more about Postgraduate Students' Network (PGSN) and their support to postgraduate students at UNM. Welcoming new postgraduate students Learn more about our dedicated support services and transformative training and development opportunities for postgraduate students. PhD Comics Remind me Empowering your postgraduate and research ambition #unmgraduateschool Look out for our next issue of newsletter next month! In the meantime, please continue to observe and follow the safety advice and precautionary measures by our local authorities and University. This is an internal email and not intended for external distribution."
        }
    ],
    "pdf_files": []
}