{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2020/Graduate-School-Newsletter-Nucleus-Issue-0120-37.html",
    "content": [
        {
            "p": "Nucleus Issue 01/20 (37) Read on for all the latest news from the Graduate School. Don't forget you can get in touch with us via Facebook or by email at graduateschool@nottingham.edu.my. First started in 2014, our annual photography competition challenges postgraduate students to capture people's interest and enthuse them about their postgraduate experience at the University. The competition was held in November 2019 with the theme Endgame. The participants showed what is their ultimate goal out of the postgraduate course that they are doing, what do they want to achieve and where do they want to end up in their career. Winner Kumbirai Ivyne Mateva School of Biosciences Runner Up Mak Yin Ying Department of Biomedical Sciences People's Choice Nguyen Nhat Tan Nottingham University Business School Participation is still being welcomed. This is an opportunity for postgraduate students to showcase their skills to PricewaterhouseCoopers (PwC) and its client base, via a short 3-minute video clip response to a pre-set challenge. The next awareness session is scheduled for Thursday 9 January 2020 at 10am - 11.30am in H1B13. Closing date: Friday 24 January 2020 Our annual Chinese New Year celebration for postgraduate students is scheduled for Wednesday 15 January 2020 at 1pm - 2pm in H1B12. Join in the merriment of stirring and tossing Yee Sang while wishing for a year filled with auspiciousness! We are offering the following RDP courses in January 2020. These are aimed at postgraduate students. Preparing for Your Annual Review Monday 6 January 2020, 2pm - 4pm, H1B13 This course will discuss the elements of the annual review process and consider the possible structures of an annual review report. Understanding How to Use Mendeley Monday 13 January 2020, 10am - 12noon, GD14 This course will inform students on how to create, populate and use Mendeley, a bibliography manager in organising their literature review. Preparing for the Viva Wednesday 15 January 2020, 10am - 12noon, H1B13 This course will delve into the main purposes of viva, its process and criteria as well as some key skills to consider in the lead up to, and during the viva itself. Understanding How to Use Endnote Monday 20 January 2020, This course will inform students on how to create, populate and use Endnote, a bibliography manager in organising their literature review. Further Presentation Skills Thursday 23 January 2020, 10am - 1pm, H1B13 This course will identify and analyse the features of effective presentations. Participants will get an opportunity to practise explaining their research and receive feedback on their presentation. We are offering the following RAD workshops in January 2020. These workshops are aimed at academic staff. Future Food Beacon in International Agricultural Development Thursday 16 January 2020, 11am - 12noon, H1B13 This is an awareness session to support the call for the Nottingham-Rothamsted Future Food Beacon Studentships in International Agricultural Development. Target audience All Future Food Malaysia academic staff Mapping Your Research Career: Vitae's Researcher Development Framework (RDF) for Early Career Researchers Tuesday 21 January 2020, 10am - 12noon, H1B13 This workshop will consider ways of supporting own continuous researcher development in the RDF context. Academic staff, in particular early career researchers Postgraduate Christmas & Year End celebration Deepavali celebration for postgraduates Postgraduate Welcome Programme Teh Tarik session 6/2019 Teh Tarik session 5/2019 Coffee & Cake session 6/2019 Coffee & Cake session 5/2019 Managing complaints Examining a doctorate Research programme funding Turning food waste into compost overnight Green economy and waste management Visit for research collaboration opportunity Look out for our next issue of Graduate School Bulletin in February! Graduate School University of Nottingham Malaysia"
        }
    ],
    "pdf_files": []
}