{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2020/Graduate-School-Newsletter-Nucleus-Issue-0420-40.html",
    "content": [
        {
            "p": "Nucleus Issue 04/20 (40) Read on for all the latest news from the Graduate School. Don't forget you can get in touch with us via Facebook or by email at graduateschool@nottingham.edu.my. Yoong Xin Pang from the Ningbo Campus (UNNC) was awarded the highest score in the tri-campus 3MT速 and has been selected to represent UoN in the global online U21 3MT速. Voting in the U21 3MT速 People's Choice is still open and we would like to encourage all our University community to take part in the voting. To support Yoong Xin Pang, you can cast your vote via the button below. Closing date: Monday 5 October 2020 Nevertheless, well done to our UNM 2020 Virtual 3MT速 winner, Swaraj Sunilkumar Dube. We are extremely proud of his effort and commitment. This is an opportunity for all new postgraduate research students to hear about how we can support you with training and development opportunities. It features welcome talks and presentations by senior staff from the Graduate School introducing a range of support services, training programmes, public engagements and activities for postgraduate research students. The next induction is scheduled for Friday 9 October 2020 at 3pm - 4pm. Use this code to join the session in Microsoft Teams: booxq0d We are offering the following RDP courses in October 2020, via Microsoft Teams. These are aimed at postgraduate students. The joining instructions and guides are available on the sign up page. Planning Research and Time Management Thursday 1 October 2020, 2pm - 4pm This course will support the development of good time management and enable students to plan their research development more efficiently. Creative Thinking Friday 2 October 2020, 10am - 12noon This course will introduce the techniques to enhance creative thinking and subsequently promote critical thinking. Philosophy of Science Tuesday 6 October 2020, This course will explore the critical and independent thought on sciences; its foundations, methods and implications. Introduction to ORIS for New Postgraduates Wednesday 7 October 2020, This course will introduce the use of information sources in our library and develop the skill sets and knowledge in information searching. Introduction to the Skills of Teamwork for Researchers Thursday 8 October 2020, This course will highlight the benefits of teamwork as well as identify and analyse the features of an effective team. Understanding How to Use Mendeley Monday 12 October 2020, This course will inform students on how to create, populate and use Mendeley, a bibliography manager in organising their literature review. Understanding How To Use Endnote Tuesday 13 October 2020, This course will inform students on how to create, populate and use Endnote, a bibliography manager in organising their literature review. Light Your Fire - Motivational Tools for Researchers Wednesday 14 October 2020, 10am - 12noon This course will explore procrastination and discuss time management techniques. Preparing for the Viva Tuesday 27 October 2020, This course will delve into the main purposes of viva, its process and criteria as well as some key skills to consider in the lead up to, and during the viva itself. We are offering the following RAD workshops in October 2020, via Microsoft Teams. These are aimed at academic staff, in particular early career researchers. The joining instructions and guides are available on the sign up page. Managing Complaints Wednesday 21 October 2020, 2pm - 4pm This workshop will give an overview on the process of handling student complaints in accordance to the Student Complaint Procedure at UNM. Journal Editorial Wednesday 28 October 2020, 2pm - 4pm This workshop will delineate the steps of the publication process from choosing the journal to the acceptance of the manuscript. *This workshop is also open to postgraduate students. Recent trends in nanomaterials and technological applications Introduction to the Code of Research Conduct and Research Ethics An introduction to creating surveys with Qualtrics Supporting career development of early career researchers Welcoming our new postgraduate research students A conversation with our postgraduate research students Contemporary issues in supervising research students Managing research students' progression Examining a doctorate Look out for our next issue of Graduate School Bulletin in November! In the meantime, please continue to observe and follow the safety advice and precautionary measures by our local authorities and University. Graduate School University of Nottingham Malaysia"
        }
    ],
    "pdf_files": []
}