{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2019/Graduate-School-Newsletter-Nucleus-Issue-0319-35.html",
    "content": [
        {
            "p": "Nucleus Issue 03/19 (35) Read on for all the latest news from the Graduate School. Don't forget you can get in touch with us via Facebook or by email at graduateschool@nottingham.edu.my. 3MT® challenges research students to communicate the significance of their research to a non-specialist audience in just 3 minutes. Our annual 3MT® was held on 26 June 2019. The winner will now progress to the video round to compete against the other Nottingham campuses. The overall winner will then represent the entire University of Nottingham at the Universitas 21 (U21) Final. Winner & People's Choice Mitchell Lim Shyan Wei Department of Chemical & Environmental Engineering Runner Up Kumbirai Mateva School of Biosciences The University of Nottingham Postgraduate Prize Awards recognise accomplishments in research, publications, conferences and contribution to the postgraduate community. The awards were presented to some of the University's top postgraduate research students by Professor Sivakumar Manickam, Associate Dean of Research and Knowledge Exchange for Faculty of Science and Engineering in a tri-campus awards presentation ceremony on 15 May 2019. Prize Winner Chew Kit Wayne Department of Chemical and Environmental Engineering Tan Pui Yee Premanand Krishnan School of Pharmacy The Career Development Initiative Fund is still open for applications. Two awards are available worth up to RM5,000; one for postgraduate research students and one for early career researchers. Closing date: 1 July 2019 The Pecha Kucha competition challenges early career researchers to showcase their research work in 6 minutes and 40 seconds. Stand a chance to win conference funding worth up to RM3,000! Closing date: 5 July 2019 We are offering the following RDP courses in July 2019. These courses are aimed at postgraduate students. Applying for Academic Jobs Tuesday 2 July 2019, 10am - 4pm, H1B13 This course will explore the important elements of a job application in academia. Light Your Fire: Motivational Tools for Researchers Wednesday 3 July 2019, 2pm - 4pm, H1B13 This course will explore procrastination and discuss time management techniques. Preparing a Press Release Monday 8 July 2019, This course will outline the pivotal elements in preparing well written press releases. Academic Job Interviews Wednesday 10 July 2019, This course will delve into the interviewing process in academia. Funding Workshop Monday 15 July 2019, 10am - 12noon, H1B13 This course will introduce the different types of funding by the Graduate School. Using Posters to Communicate Research Friday 19 July 2019, 10am - 12noon, BA18 This course will discuss the features of an effective poster and how best to use it to communicate research outputs. Presentation Skills: Building Your Confidence Monday 22 July 2019, 10am - 3pm, BA18 This course will outline the key elements to focus upon when preparing a presentation. Further Presentation Skills Wednesday 24 July 2019, 10am - 1pm, BA18 This course will identify and analyse the features of effective presentations. Structuring Your Thesis Monday 29 July 2019, This course will consider ways of drafting and structuring a thesis. Preparing for Your Annual Review Wednesday 31 July 2019, 2pm - 4pm, H1B13 This course will discuss the elements of the annual review process. We are offering the following researcher workshop series in July and August 2019. This series of workshops is aimed at academic staff, in particular early career researchers. How to Publish in High Quality Journals Monday 1 July 2019, 10am - 5pm, H1B13 This workshop will assist academics, particularly early career researchers, to improve their chances of getting their papers published in high quality journals. Constructing Your Argument - An Essential Skill Thursday 4 July 2019, This workshop will introduce some of the essential skills for effective scientific communication and give researchers a chance to put these into action with one or two interactive activities. Professional Networking for Researchers Tuesday 9 July 2019, This workshop will highlight the importance of networking and provide researchers with tips for building strong professional networks for their continuous career development. Word vs LaTeX - Which One is the Best to Write Your Journal Paper Thursday 11 July 2019, This workshop will explore and compare the two typesetting tools, enabling researchers to make an informed decision on which is the best to write their journal papers. Authorship vs Acknowledgements Demystified Thursday 18 July 2019, This workshop will discuss authorship and enable researchers to be aware of the criteria for determining author contributions. How to be an International Researcher Thursday 1 August 2019, 10am - 1pm, H1B13 This workshop will share tips and traits to becoming an international researcher. Success stories will also be shared. Our annual Raya celebration for postgraduates was held on 19 June 2019. Our second mini induction for new postgraduates was held on 28 May 2019. Our second and third Coffee and Cake sessions were held on 29 March and 26 April 2019 respectively. The second instalment of our Research Supervisory Seminar Series was held on 29 April 2019. The session was delivered by Dr Ho Jee-Hou, Associate Professor at the Department of Mechanical, Materials and Manufacturing Engineering. A sharing of experience by Wong Xin Yi, PhD student at the Department of Chemical & Environmental Engineering. Graduate School University of Nottingham Malaysia"
        }
    ],
    "pdf_files": []
}