{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2021/Graduate-School-Newsletter-Nucleus-0321-43.html",
    "content": [
        {
            "p": "Nucleus Issue 03/21 (43) Graduate School newsletter The needs of the postgraduate and early career researcher community are at the heart of what we do at the Graduate School. Read on for all the latest news from us. Winners announced in Tri-Campus Awards 2021 These prestigious awards celebrate our outstanding postgraduate researchers and research supervisors, and recognise accomplishments in research, publications, conferences and contribution to our postgraduate research and teaching community. The virtual awards ceremony was streamed live across all three campuses on Tuesday 25 May 2021. Present your research at our virtual 3MT® Can you explain your doctoral thesis in just three minutes? The Three Minute Thesis competition (3MT®) is a great way to develop your presentation and communication skills, build your confidence, access networking opportunities, raise your profile and get your research noticed! This year, the competition will take place online where you will present your research live to a panel of judges. Join us at our next postgraduate induction Our postgraduate induction features welcome talks and presentations by our staff member at the Graduate School introducing a range of support services, training programmes, public engagements and activities for postgraduate students. The next one is scheduled for Friday 9 July 2021 at 3pm - 4pm. Researcher training courses Researcher Development Programme (RDP) Find out our training and development provision for postgraduate students in July. Using posters to communicate research Thursday 1 July 2021 10am - 12nn This course will introduce and support the creation and design of a poster that communicates research work in an innovative and informative manner. Communicating your research: Dealing with media Tuesday 6 July 2021 2pm - 4.30pm This course will discuss the importance of wider public engagement in the research process and explore how to elicit media interest in your work. Preparing for your annual review Tuesday 13 July 2021 This course will discuss the elements of the annual review process and consider the possible structures of an annual review report. Philosophy of science Thursday 15 July 2021 This course will explore the critical and independent thought on science; its foundations, methods and implications. What do I want to get out of a conference Tuesday 27 July 2021 This course will discuss key issues when choosing a conference and how to maximise participation. Supervisory research seminar series Find out our training and development provision for research supervisors in July. Managing research students' progression Wednesday 14 July 2021 2pm - 4pm This session will share information on supervisor's role in meeting the university requirements and project management requirements to ensure satisfactory progression and completion of research projects. On our blog See what's new on our Graduate School Blog. Mastering interview skills Get useful insights into industrial job hunting and interview. Getting to grips with literature review Learn more about our pilot course on literature review and academic writing for postgraduate students . Connecting with new postgraduates Know more about our dedicated support services and transformative training and development opportunities for postgraduate students. Exploring and examining research supervision Learn more about our training and development provision for research supervisors from our previous supervisory research seminar series. Getting published and making an impact Explore the publication topography and get started on the right foot with academic writing and publishing. Steering clear of predatory publications and delving deep into Vitae's RDF Learn more about predatory publications and Vitae's Researcher Development Framework (RDF). PhD Comics Painstaking Empowering your postgraduate and research ambition #unmgraduateschool Look out for our next issue of newsletter next month! In the meantime, please continue to observe and follow the safety advice and precautionary measures by our local authorities and University. This is an internal email and not intended for external distribution."
        }
    ],
    "pdf_files": []
}