{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2019/Graduate-School-Newsletter-Nucleus-Issue-0219-34.html",
    "content": [
        {
            "p": "Nucleus Issue 02/19 (34) Read on for all the latest news from the Graduate School. Don't forget you can get in touch with us via Facebook or by email at graduateschool@nottingham.edu.my. In VPRKE blog post 6, Professor Deborah Hall gives an update on initiatives undertaken by the Graduate School in striving to improve its services for all registered postgraduate students, on taught and research programmes as well as early career research staff. Our newly revamped postgraduate induction programmes are an opportunity for all new postgraduates to hear about how the Graduate School can support with training and development opportunities. The programmes also offer a great chance to meet other postgraduates over coffee and cake. Do you struggle to explain your research to friends and family? Is talking about your PhD a conversation killer? This competition is a great way to help you communicate your research and its impact to a non-academic audience, improve your public speaking skills, and access networking opportunities. Join us for a two-hour information session on Monday 13 May 2019 at 2pm - 4pm in H1B13 to get you started. We are offering the following RDP courses in April 2019. Editing Academic Writing Monday 1 April 2019, 10am - 12noon, H1B13 This practical workshop will explore the different components of editing academic writing. It will also explore some of the challenges commonly faced and identify the different types of editing. It will be particularly useful to those who have begun to draft and write their thesis and those in later stages of the doctoral process (pre-submission). Creating a Strong Argument for Your Thesis Wednesday 3 April 2019, 10am - 12noon, H1B13 This practical workshop will discuss the background to the nature of arguments. It will also consider the thesis as an 'argument' and its structure. It will be particularly useful to those who are working on their thesis and have completed (or are very close to completing) their data collection and analysis. Friday 26 April 2019, 3pm - 4pm, H1B14 This is a platform for postgraduates to temporarily get way from their work and catch-up with fellow postgraduates whilst enjoying free refreshments. All postgraduates (both postgraduate research and taught students) are welcome! We organised two back-to-back workshops for early career research staff on 23 and 24 January 2019. Research @UNM workshop addressed the ongoing development of research at the University while Supervisory Research Seminar Series workshop discussed the challenges faced by PhD supervisors. Dr Tissa Chandesa, Research Training Development Manager, was invited to do a workshop titled 'Getting started! A quick guide to maximising your postgraduate journey' for postgraduate taught students from the Faculty of Arts and Social Sciences on 23 February 2019. This workshop covered several important elements that are essential to a postgraduate's journey. Our first mini induction for postgraduates was held on 22 February 2019. This induction was for postgraduates who were not able to attend our main postgraduate welcome programme last October or have joined the University thereafter. Our first Coffee and Cake session this year was held on 22 February 2019. We had a great turnout comprising of new and senior postgraduates. This casual session was indeed an ideal meeting platform for all postgraduates whilst enjoying some free refreshments. Graduate School University of Nottingham Malaysia"
        }
    ],
    "pdf_files": []
}