{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2020/Graduate-School-Newsletter-Nucleus-Issue-0220-38.html",
    "content": [
        {
            "p": "Nucleus Issue 02/20 (38) Read on for all the latest news from the Graduate School. Don't forget you can get in touch with us via Facebook or by email at graduateschool@nottingham.edu.my. We have been monitoring updates on C0VID-19 closely and in light of the restricted movement control order nationwide as well as campus closure from 18 March to 14 April 2020, we are suspending all Graduate School events and classroom based courses. We appreciate that this is a worrying time and recognise many of our postgraduate students and early career researchers are understandably anxious, given the unprecedented circumstances that we face with the current pandemic. Nonetheless we remain as dedicated as ever to delivering the highest quality training and development support for our postgraduate students and early career researchers in these most difficult of times. We have prepared a revised programme of digitally supported guided learning, which commenced smoothly on 23 March 2020. The revised learning consists of a varying monthly schedule drawn from the current training programmes and will be updated from time to time as additional training courses are reconceived for this digital mode of learning delivery. Read on for more information. If you are unable to engage with the digitally supported guided learning for any reason, please contact us via email to graduateschool@nottingham.edu.my (for postgraduate students) or RAD@nottingham.edu.my (for early career researchers) so that we can work on how best to support you. IRCA is a competitive award to promote research mobility by enabling the award recipients to undertake a research visit to a leading international research institution of their choice. This year we offered two awards for postgraduate research students and two inaugural awards for early career researchers, worth RM15,000 each. In the current situation with C0VID-19, we regret to inform that all the planned research visits are ceased indefinitely. We are corresponding with the award recipients on a feasible postponement plan in accordance with the University's policy and advice. Recipient Dr Marieke De Vries Assistant Professor, School of Psychology Dr Anurita Selvarajoo Assistant Professor, Department of Chemical & Environmental Engineering Karen Thivya Lourdes PhD student, School of Environmental & Geographical Sciences Yew Guo Yong PhD student, Department of Chemical & Environmental Engineering We are pleased to introduce our newest addition to the Graduate School team, Dr Revathy Sankaran, Research and Training Assistant Manager. Please join us in welcoming Revathy and wishing her success in her new role. Microsoft Teams: A Practical Guide Friday 3 April 2020, 10am - 11am This new course will explore the many functionalities of Microsoft Teams and experiment with the basic functions when in a live meeting. You will know how to compose your own Teams and integrate files, notes, apps in Teams. *Use this token in Microsoft Teams to join the course: kta33e1 We are offering the following RDP courses in April 2020, via Microsoft Teams. These are aimed at postgraduate students. The joining instructions and guides are available on the sign up page. Anatomy of a Good Journal Paper Wednesday 1 April 2020, 10am - 12noon This course will explore the structure of the various components of a journal paper and provide an insight into the necessary skills required to develop and write a good journal paper. Preparing for the Viva Monday 6 April 2020, This course will delve into the main purposes of viva, its process and criteria as well as some key skills to consider in the lead up to, and during the viva itself. Preparing for Your Annual Review Wednesday 8 April 2020, This course will discuss the elements of the annual review process and consider the possible structures of an annual review report. Introduction to the Skills of Teamwork for Researchers Wednesday 15 April 2020, This course will highlight the benefits of teamwork as well as identify and analyse the features of an effective team. Using Posters to Communicate Research Tuesday 21 April 2020, This course will introduce and support the creation and design of a poster that communicates research work in an innovative and informative manner. What Do I Want to Get Out of a Conference? Thursday 23 April 2020, This course will discuss key issues when choosing a conference and how to maximise participation when attending a conference. Recognise and build your digital capabilities This new and very timely module enables you to explore your ‘digital capabilities’ and find out how you can develop and enhance your digital practice. Through answering the questions in the Discovery tool you will: We are offering the following RAD workshop in April 2020, via Microsoft Teams. This is aimed at academic staff, in particular early career researchers. The joining instructions and guides are available on the sign up page. Introduction to Doing Statistics in R Tuesday 7 April 2020, 10am - 3pm Repeat session: Tuesday 28 April 2020, 10am - 3pm This workshop will provide a hands-on experience in using R which is an open source programming language for advanced statistics and graphics. *This workshop is also open to postgraduate students. C0VID-19: Information for early career researchers (27 March 2020) C0VID-19: Graduate School updates (26 March 2020) A brief glimpse of students’ engagement on online learning Online teaching – No easy feat but it’s the way forward! C0VID-19: Graduate School updates (25 March 2020) C0VID-19: Information for postgraduate research students and supervisors (21 March 2020) C0VID-19: Graduate School updates (20 March 2020) Coffee & Cake Session 1/2020 U21/PwC Innovation Challenge 2019/20 A session on research supervision Mapping your research career Awareness on Future Food Beacon in International Agricultural Development Greeting 2020 Look out for our next issue of Graduate School Bulletin in May! In the meantime, please observe and follow the safety advice and precautionary measures by our local authorities and University. Above all, we wish you well and fine, wherever you are. Graduate School University of Nottingham Malaysia"
        }
    ],
    "pdf_files": []
}