{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2022/Graduate-School-Newsletter-Nucleus-Issue-0122-45.html",
    "content": [
        {
            "p": "Nucleus Issue 01/22 (45) Graduate School newsletter The needs of the postgraduate and early career researcher community are at the heart of what we do at the Graduate School. Read on for all the latest news from us. A new chapter Get to know our new Associate Dean We are pleased to introduce Dr Maniam Kaliannan as our Associate Dean of Graduate School. Dr Kaliannan, an Associate Professor of Human Resource Management and Leadership, has been with Nottingham University Business School since 2011. Drawing on his substantial background and extensive experience in academia, Dr Kaliannan strives to strengthening our postgraduate experience and research excellence. Delivering our renewed commitment The recommendations from our recent internal review by an independent board under the purview of the Research and Knowledge Exchange Committee, provide us with a framework for the delivery of a high-performing, inclusive postgraduate research ecosystem. Under the leadership of Dr Kaliannan, ambitious endeavours are underway to transform the Graduate School into a vibrant community for postgraduates and researchers. This transformative initiative aims to better support the postgraduate research progression, administration and management as we strive to contribute to the University's new research strategy, supporting delivery plans in the relevant areas. This academic year, like the last two, will once again be impacted and shaped by the ongoing Covid-19 pandemic. Despite the challenges ahead, we are optimistic with all the interesting and exciting initiatives in place and look forward to having a great year to share with all our postgraduates and researchers. Join our town hall Building an inclusive, supportive postgraduate research environment Our virtual town hall events are proving to be a highly valued forum to discuss how we work together to grow and develop our plans and strategies amidst the ongoing pandemic. Our next virtual town hall is scheduled for Friday 28 January 2022 at 3pm - 4.30pm. We encourage our whole postgraduate community to join us as we will give an update bringing together a number of recent developments of our role beyond supporting your research training development. This virtual town hall also follows the first step of our recent survey approach in understanding the issues affecting postgraduate research progression. We will update you on the findings and address the delivery of targeted actions. Researcher training courses Find out our training and development provision for postgraduate students this month. Researcher Development Programme (RDP) What do I want to get out of a conference Wednesday 12 January 10am - 12nn This course will discuss key issues when choosing a conference and how to maximise participation. Using poster to communicate research Thursday 20 January This course will introduce and support the creation and design of a poster that communicates research work in an innovative and informative manner. Light your fire - Motivational tools for researchers Wednesday 26 January This course will explore procrastination and discuss time management techniques. On our blog See what's new on our Graduate School Blog. Don't forget you can stay in touch by subscribing to our blog. Our induction for new postgraduates Explore our transformative training and development opportunities for postgraduates. PhD Comics What have you accomplished? Empowering your postgraduate and research ambition #unmgraduateschool Look out for our next issue of newsletter next month! In the meantime, please continue to observe and follow the safety advice and precautionary measures by our local authorities and University. This is an internal email and not intended for external distribution."
        }
    ],
    "pdf_files": []
}