{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2019/Graduate-School-Newsletter-Nucleus-Issue-0419-36.html",
    "content": [
        {
            "p": "Nucleus Issue 04/19 (36) Read on for all the latest news from the Graduate School. Don't forget you can get in touch with us via Facebook or by email at graduateschool@nottingham.edu.my. Pecha Kucha is a form of presentation where the presenter presents with 20 slides, 20 seconds each. It was designed by Astrid Klein and Mark Dytham in February 2003. Our inaugural Pecha Kucha competition was held on 17 July 2019. It was a challenge for early career researchers to creatively communicate their research work. Winner Dr Vasanthi Sethu Department of Chemical and Environmental Engineering Runner Up Dr Valerie Shang School of Pharmacy IRCA is a competitive award to a funded visit, of up to two months duration, with a maximum of MYR 15,000, at a host organisation anywhere in the world that may act as a collaborator for a research project. This year, we offered two doctoral training awards to promote research mobility by enabling the award recipients to undertake a research visit to a leading international research institution of their choice. Recipient Nur Izzati Ridzuan School of Biosciences Wong Zheng Wei We are offering the following RDP courses in October 2019. These are aimed at postgraduate students. Nature of the PhD and the Supervision Process Tuesday 1 October 2019, 10am - 12noon, H1B13 This course will introduce the expectations of doctoral study and provide an understanding of the roles of supervisors and research students. Introduction to Development Needs Analysis 2pm - 4pm, H1B13 This course will introduce the tool to evaluate and plan personal, professional and career development. Planning Research and Time Management Wednesday 2 October 2019, This course support the development of good time management and enable students to plan their research development more efficiently. How to be an Effective Researcher Thursday 3 October 2019, 10am - 5pm, H1B13 This course will explore the many different aspects of the research degree process to develop the effectiveness of research students using a broad range of activities. Creative Thinking Friday 4 October 2019, This course will introduce the techniques to enhance creative thinking and subsequently promote critical thinking. Philosophy of Science Tuesday 8 October 2019, This course will explore the critical and independent thought on sciences; its foundations, methods and implications. Introduction to ORIS for New Postgraduates Wednesday 9 October 2019, 10am - 12noon, GD14 This course will introduce the use of information sources in our library and develop the skill sets and knowledge in information searching. Introduction to the Skills of Teamwork for Researchers Friday 11 October 2019, This course will highlight the benefits of teamwork as well as identify and analyse the features of an effective team. Understanding How to Use Mendeley Monday 14 October 2019, This course will inform students on how to create, populate and use Mendeley, a bibliography manager in organising their literature review. Understanding How to Use Endnote 2pm - 4pm, GD14 This course will inform students on how to create, populate and use Endnote, a bibliography manager in organising their literature review. Light Your Fire - Motivational Tools for Researchers Tuesday 15 October 2019, This course will explore procrastination and discuss time management techniques. Word Essential for Researchers - Beginners Wednesday 15 October 2019, 10am - 12.30pm, GD14 This course will introduce the basic built-in features of Microsoft Word. Word Essentials for Researchers - Advanced Wednesday 15 October 2019, 2pm - 4.30pm, GD14 This course will introduce the ways on how to configure Microsoft Word in preparing a dissertation/thesis or journal/conference paper. Research Ethics and Integrity Friday 18 October 2019, This course will discuss the importance of research integrity, the necessity to consider ethics when studying human participants, and the ethics application procedure. Structuring Your Thesis Monday 21 October 2019, 2pm - 4pm, H1B13 This course will consider ways of drafting and structuring a thesis. Drafting a Chapter of Your Thesis Wednesday 23 October 2019, 10am - 12noon, H1B13 This course will identify the features of good academic writing, discuss effective writing plan, and consider techniques for starting and finishing a thesis chapter. Creating a Strong Argument for Your Thesis Friday 25 October 2019, This course will discuss the background to the nature of arguments and consider the thesis as an 'argument' and its structure. Editing Academic Writing Wednesday 30 October 2019, 2pm - 4pm, H1B13 This course will explore the different components and types of editing academic writing as well as some of the challenges commonly faced. Boosting the Impact and Citations of Your Research Portfolio A Rough Guide to Research Supervision at University of Nottingham Malaysia Networking: Creating a Credible Personal Impact Managing the Middle Stage of an Academic Career How to be an International Researcher Professional Networking for Researcher Authorship vs Acknowledgements Demystified Constructing Your Argument - An Essential Skill Managing Research Students Progression Look out for our next issue of Graduate School Bulletin in November! Graduate School University of Nottingham Malaysia"
        }
    ],
    "pdf_files": []
}