{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2019/Graduate-School-Newsletter-Nucleus-Issue-0119-33.html",
    "content": [
        {
            "p": "Nucleus Issue 01/19 (33) First started in 2014, our annual photography competition challenges postgraduate students to capture people's interest and enthuse them about their postgraduate experience at University of Nottingham Malaysia (UNM). The Images of Postgraduate Experience photography competition was held in November 2018 with motivation as the theme. The participants showed what does motivation mean to them, what keeps them going, what makes them stay excited or passionate about their research and studies, and even what stops them from giving up. Winners were announced during a prize-giving session on 6 December 2018. Winner Hsin-Yuan Chen, School of Psychology Runner Up Mohammad Saad, Department of Mechanical, Materials & Manufacturing Engineering People's Choice Denesh A/L Sooriamoorthy, Department of Electrical & Electronic Engineering We hosted an early Christmas and Year End Celebration for our postgraduate students on 6 December 2018. It was also a joint celebration of the Graduate School's 10th year anniversary at UNM. Some alumni were also present in commemoration of the decade-long milestone. FameLab Malaysia 2019 is still open for applications and we would like to encourage our postgraduate students to take part in the competition. Stand a chance to win prizes valued up to RM3,000 and a place to compete in FameLab International at the Cheltenham Science Festival! Closing date: 12 January 2019 U21 (Universitas 21) in collaboration with PwC (Price Waterhouse Cooper) are challenging postgraduate students to respond to a contemporary, globally-important work-related issue. The prize includes a 7-day trip to Dubai, exclusive world-class training and internship opportunity with PwC or one of their locally based clients. Closing date: 10 February 2019 We are offering the following RDP courses this month. Preparing for Your Viva Date: 7 January 2019 Time: 10am - 12noon Venue: H1B13 Introduction to ORIS for New Postgraduates Date: 9 January 2019 Venue: Library CR3 (GD14) Understanding How to Use EndNote Date: 14 January 2019 Time: 2pm - 4pm Understanding How to Use Mendeley Date: 16 January 2019 Communicating Your Research - Dealing with Media Date: 25 January 2019 Creating a Poster in PowerPoint Date: 28 January 2019 Time: 10am - 12.30pm Using Posters to Communicate Research Date: 30 January 2019 We are also offering the following RAD workshops this month. Teh Tarik Session: Research @UNM - why, what & how *for postgraduate research students & early career researchers Date: 23 January 2019 Time: 10am - 11.30am Supervisory Research Seminar Series #1 *for postgraduate research supervisors Date: 24 January 2019 Time: 2.30pm - 4.30pm Our annual Chinese New Year Celebration for postgraduate students is scheduled for 23 January 2019 at 1pm - 2pm in H1B12. Join in the merriment of stirring and tossing Yee Sang while wishing for a year filled with auspiciousness! A statistics workshop conducted by Dr Weang Kee Ho was held on 13 December 2018. This workshop was very unique as it was driven mainly by the participants’ questions about statistics. Instead of taking the normal route which is presenting a syllabus driven class, this workshop’s content was built on the foundation of the participants questions. It is not enough to write a scientific paper, you also want it to be read and be cited. In this age of social media, promoting your paper should not be difficult. Our annual Deepavali Celebration was held on 14 November 2018. Through it, we hope to promote and foster the spirit of unity and solidarity among members of the postgraduate community at the University. The final Coffee and Cake session of last year was held on 26 October 2018. It was a casual session where postgraduate students met and established rapport with one another whilst enjoying coffee and cakes. Our annual welcome event for new and returning postgraduate students was held on 1 October 2018. What are the expectations of postgraduate research supervisors? This was the question we delved into during a session with supervisors held on 1 October 2018. We had organised another round of SWIRL session on 1 October 2018. The informal sharing session and forum was aimed for new postgraduate students to find out about life at UNM from a panel of three senior postgraduate students. Have an idea or experience to share? Send to us! We invite you to write a one page article on your life as a postgraduate student at UNM. We would like to capture and showcase the experience of our postgraduate students through our blog and newsletter. There is no limit to what you can write about - it can be a sharing of experience or knowledge, postgraduate life, internal or external engagement, etc. This is a platform for you to practise and enhance your writing skills. Graduate School University of Nottingham Malaysia"
        }
    ],
    "pdf_files": []
}