{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2021/Graduate-School-Newsletter-Nucleus-Issue-0421-44.html",
    "content": [
        {
            "p": "Nucleus Issue 04/21 (44) Graduate School newsletter The needs of the postgraduate and early career researcher community are at the heart of what we do at the Graduate School. Read on for all the latest news from us. Showcasing the breadth and diversity of our postgraduate research We are proud of the impact of our world-class postgraduate research and we enjoy gathering together some of our most engaging researchers to showcase their work to a wider audience. Our annual Postgraduate Showcase is a great opportunity for our postgraduate researchers to share and highlight the importance and impact of their research work to a general audience. This year, the competition went virtual in view of the ongoing Covid-19 restrictions. Despite the unconventional circumstances, 13 of our postgraduate researchers competed in a virtual setting on Wednesday 8 September 2021. A panel of judges decided the winner and runner ups. Winner Tee Wan Ting Department of Chemical & Environmental Engineering 1st Runner Up Azrina Ely Ahmad Azhari School of Pharmacy 2nd Runner Up Stella Matthews School of Biosciences Communicating research in just under 3 minutes The average doctoral thesis would take 9 hours to present. They only have 3 minutes! Our annual Three Minute Thesis (3MT®) competition went virtual again this year. Nevertheless, the online setting allowed 10 of our doctoral researchers to compete in our Virtual 3MT® Live! on Thursday 12 August 2021. A panel of judges decided the winner and runner ups while the audience vote decided the People’s Choice winner. Chong Yuet Tian 1st Runner Up & People's Choice Angela Paul Peter Nurul Syahirah Mat Aron Tri-campus winner Our UNM winner progressed to the video round to compete against the other Nottingham campuses. We are pleased to inform that Samantha Harrison from the School of Medicine, UK campus, was awarded the highest score in the tri-campus round and has been selected to represent the University of Nottingham in the global online U21 3MT® competition. Nevertheless, well done to our UNM winner, Chong Yuet Tian. We are extremely proud of her effort and commitment. You can watch her video presentation which is now made available for your viewing pleasure. U21 3MT® People’s Choice Voting in the U21 People’s Choice online competition is now open and will close on Monday 4 October 2021. We would like to encourage all our University community to take part in the voting. Join us at our next postgraduate induction Our postgraduate induction features welcome talk by our Vice-Provost for Research and Knowledge Exchange and introductory presentations by our staff members at the Graduate School on a range of support services and development opportunities for postgraduate students. The next one is scheduled for Friday 22 October 2021 at 3pm - 5.30pm. This time, key members from the faculties will also join us in guiding and preparing you to start your postgraduate journey. The inclusion of a session with your respective faculty will make sure that you receive the support, information and supervision that you need. Coming soon: A survey for postgraduate research students We will be running a survey for our postgraduate research students (PGRs) to understand the issues affecting your research progress. This new internal survey will be launched early October 2021. A virtual town hall with our Vice-Provost for Research and Knowledge Exchange will follow to provide a much needed platform for direct and meaningful communications as well as look at the interventions and drivers needed to best support our PGR community. Researcher training courses Find out our training and development provision for postgraduate students in October. Researcher Development Programme (RDP) Research ethics and integrity Tuesday 5 October 2021 2pm - 4pm This course will study the importance of research ethics and integrity, and further outline the ethics procedures in UNM. Nature of the PhD and the supervision process Monday 25 October 2021 10am - 12.30pm This course will introduce the expectations of a doctoral study and provide an understanding of the roles of supervisors and research students. Planning research and time management Tuesday 26 October 2021 10am - 12nn This course will support the development of good time management and enable students to plan their research development more efficiently. Creative thinking and problem solving Wednesday 27 October 2021 This course will explore how to associate creative thinking with problem solving and develop critical thinking. Introduction to development needs analysis Thursday 28 October 2021 This course will introduce the tool to evaluate and plan personal, professional and career development. Philosophy of science Friday 29 October 2021 This course will explore the critical and independent thought on science; its foundations, methods and implications. Postgraduate Student Teachers (PST) programme Small group teaching Friday 1 October 2021 This course will give advice on ways of designing, planning and leading small group teaching sessions such as seminars and tutorials. Presentation skills - Theory Monday 11 October 2021 This course will consider and discuss the skills of preparing an effective presentation. It is a prerequisite to the practical sessions. Presentation skills - Practical Session #1 - Tuesday 12 October 2021, 10am - 12nn Session #2 - Wednesday 13 October 2021, 10am - 12nn Session #3 - Thursday 14 October 2021, 10am - 12nn These practical sessions will provide a friendly platform to practise and improve the skills of delivering an effective presentation. Please make sure you have met the prerequisite before attending the session. You can choose one of the three available practical sessions. On our blog See what's new on our Graduate School Blog. Sharpening the practice lens of research supervision Learn more about our training and development provision for research supervisors from our previous supervisory research seminar series. Welcoming new postgraduate students Explore our dedicated support services and transformative training and development opportunities for postgraduate students. PhD Comics What to do when the internet goes down Empowering your postgraduate and research ambition #unmgraduateschool Look out for our next issue of newsletter next month! In the meantime, please continue to observe and follow the safety advice and precautionary measures by our local authorities and University. This is an internal email and not intended for external distribution."
        }
    ],
    "pdf_files": []
}