{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2018/Graduate-School-Newsletter-Nucleus-Issue-0318-31.html",
    "content": [
        {
            "p": "Nucleus Issue 03/18 (31) Up until 2017, we had been organising an annual event called the Research Showcase; a poster and presentation competition for postgraduate research students to communicate their research projects to a non-research lay audience. However, for 2018 we decided to be inclusive of the entire postgraduate community. Therefore, the event was re-branded to Postgraduate Showcase and participation was welcomed from both taught and research postgraduate students. The poster round competition was held on 3 May 2018. It enabled us to showcase the breadth and originality of the research undertaken by our postgraduate students. Best Poster: 'Electricity from Photosynthesis - A Reality?' by Phon Mun Haeng, Department of Chemical and Environmental Engineering Best Press Release, Best Communicator & Overall Winner: 'Allopurinol Use for Gout Treatment: A Double-edged Sword! No More!' by Anusha Devi Nawoor, School of Biomedical Sciences Do you know someone who has gout and takes allopurinol? You probably do! Billions of people worldwide have gout, a disease caused by the build-up of uric acid in the bloodstream. The most effective treatment given to patients is allopurinol. Little do people know that this drug is a double-edged sword; it has a high efficiency of lowering the uric acid level but it also causes severe adverse drug reactions (ADRs) and leads to death! So how do we prevent this? Who is at risk? “As postgraduate students, we are always cooped up in lab or in front of our laptops as we strive for daily progress in our research. Event like this gives us the opportunity to get out of our bubble and hone our interpersonal skills with the public.” – Anusha Devi Nawoor, Overall Winner & recipient of the Best Press Release and Best Communicator awards, Postgraduate Showcase 2018 Shi Ting Lee, a PhD student from the School of Pharmacy, has won the Sparrho Early Career Researcher Price for May 2018. Sparrho will support Shi Ting's trip to the 9th World Congress on Biosensors and Bioelectronics scheduled for 29-30 August 2018 in Tokyo, Japan. We are offering the following Researcher Development Programme (RDP) course this month. This course will be delivered by Professor Dominic Foo. Title: Anatomy of a Good Journal Paper Date: 18 July 2018 Time: 2pm - 4pm Venue: H1B13 We are also offering the following writing workshops for all academic staff, especially early career researchers, and postgraduate students. These workshops will be delivered by Professor Graham Kendall and Dr Tissa Chandesa. Title: Word Vs. LaTeX - Which One is the Best to Write Your Journal Paper? Date: 10 July 2018 Time: 9.30am - 4.30pm Title: How to Publish in High Quality Journals? Date: 25 July 2018 We are also offering the following specialist training to help participants with their presentation skills. Title: Presentation Skills Date: 4 July 2018 Time: 10am - 12noon Title: What Do I Want to Get Out of Conference? Participation is currently being welcomed for this year's 3MT® competition. 3MT® competition challenges research students to communicate the significance of their projects to a non-specialist audience in just three minutes. The competition is open to active doctoral students who have successfully passed their first year confirmation review milestone (including thesis under submission). You can stand a chance to win prizes worth RM2,500. If you are interested to participate in this competition, please sign up for the compulsory briefing scheduled for 6 August 2018 at 10am in H1B13. Have an idea or experience to share? Send to us! We invite you to write a one page article on your life as a postgraduate student at UNMC. We would like to capture and showcase the experience of our postgraduate students through our blog and newsletter. There is no limit to what you can write about - it can be a sharing of experience or knowledge, postgraduate life, internal or external engagement, etc. This is a platform for you to practise and enhance your writing skills. Please email your article to us at graduateschool@nottingham.edu.my. We are pleased to invite all staff and students to attend our Postgraduate Showcase scheduled for 26 July 2018 at 9am in the Great Hall. LINK is a student-led interdisciplinary research conference by postgraduate students, for postgraduate students. The goal of this conference is to empower postgraduate students to share and celebrate their research in a positive, constructive and collaborative space while facilitating the development of interdisciplinary connections and networks. Our fourth Coffee and Cake session of this year is scheduled for 27 July 2018 at 3pm - 4pm in H1B14. We welcome all our postgraduate students to attend this casual yet interactive session. Our annual Hari Raya celebration was held on 27 June 2018. This festive gathering was well attended by both local and international postgraduate students. The third Coffee and Cake session for this year was held on 27 April 2018. It was a casual session for postgraduate students to temporarily get away from their work and catch-up with fellow postgraduate students whilst enjoying coffee and cakes. Our third series of Teh Tarik session was held on 25 April 2018. This session featured a talk by Dr Jim Chai on Photovoice – a qualitative method used for community-based participatory research to document and reflect reality. Graduate School University of Nottingham Malaysia"
        }
    ],
    "pdf_files": []
}