{
    "url": "https://www.nottingham.edu.my/GS/documents/Nucleus/2018/Graduate-School-Newsletter-Nucleus-Issue-0218-30.html",
    "content": [
        {
            "p": "Nucleus Issue 02/18 (30) The Universitas 21 (U21) Travel Award is a competitive award to support high quality doctoral students to develop their professional profile via a month long visit to any U21 universities. Md Amirul Islam was announced the winner of 2017/2018. Amirul is a second year PhD student from the Department of Civil Engineering, under the supervision of Professor Andy Chan and Dr Matthew Ashfold. Amirul will utilise his U21 Travel Award to support his month long visit to the University of New South Wales (UNSW), Australia. During his visit, he will network and build collaboration with researchers at UNSW as part of his ongoing research project. In conjunction with the Nottingham Research Leaders Programme (NRLP) delegation visit, we are pleased to invite all postgraduate students and academic staff on campus to attend the workshops listed below. These workshops will be delivered by Mr Parmjit Dhugga (Head of Research Development, UK Graduate School) and Dr Jiin Woei Lee (Research Training Development Manager). Date: 16 April 2018 Time: 12noon - 1pm Venue: BA05 Audience: Postgraduate students Date: 18 April 2018 Time: 10am - 12noon Venue: F3C07 (tentative) Audience: Postgraduate students and early career researchers Time: 1.30pm - 4pm Audience: Academic staff Our third Coffee and Cake session of this year is scheduled for 27 April 2018 at 3pm - 4pm in H1B14. We welcome all our postgraduate students to attend this casual yet interactive session. We are pleased to invite all staff and students to attend our Postgraduate Showcase scheduled for 3 May 2018 at 10am in H1B11. This showcase aims to promote public engagement, open discussion and exchange of views and opinions with a wider audience, who are not necessarily acquainted with the research topic or field. LINK is back again this year! Full details will be announced soon. LINK is a student-led interdisciplinary research conference by postgraduate students, for postgraduate students. The goal of this conference is to empower postgraduate students to share and celebrate their research in a positive, constructive and collaborative space while facilitating the development of interdisciplinary connections and networks. The first and second Coffee and Cake sessions for this year were held respectively on 26 January and 23 March 2018. These social gathering sessions were great avenues for postgraduate students to temporarily get away from their work and catch-up with fellow postgraduate students whilst enjoying coffee and cake. The Postgraduate Students' Network (PGSN) organised its inaugural Games and Pizza Night on 9 March 2018. This new initiative aimed to provide an opportunity for the postgraduate students to socialise, network and play games as well as to have the platform to meet members of PGSN in a casual setting and further discover the spaces, resources and assistance that are available to them. Our annual Chinese New Year celebration for postgraduate students was held on 7 February 2018. The highlight was stirring and tossing of Yee Sang, also known as Spring Toss. Our second Teh Tarik session was held on 7 February 2018. The session was delivered by Professor Khong Kok Wei, Associate Dean of Research for Faculty of Arts and Social Sciences. It examined the selection criteria for the Newton-Ungku Omar Fund (NUOF) for Mobility Grants and Advanced Fellowships. A meeting session was held on 26 January 2018 between postgraduate taught and research student representatives and members of the Graduate School. This was the first catch-up meeting and a major part of this session was for the reps to provide feedback that they had collated from fellow postgraduate students about their postgraduate experience on campus. By Dr Tissa Chandesa, Research Training Development Manager. By Arun Prabhakar, a postdoctoral researcher at the Gas Turbines Transmissions Research Centre (G2TRC), University of Nottingham (UK). By Saira Riaz, a postgraduate student from the School of Education, undertaking Masters in Educational Leadership and Management. Have an idea or experience to share? Send to us! We invite you to write a one page article on your life as a postgraduate student at UNMC. We would like to capture and showcase the experience of our postgraduate students through our blog and newsletter. There is no limit to what you can write about - it can be a sharing of experience or knowledge, postgraduate life, internal or external engagement, etc. This is a platform for you to practise and enhance your writing skills. Please email your article to us at graduateschool@nottingham.edu.my. Graduate School University of Nottingham Malaysia Campus"
        }
    ],
    "pdf_files": []
}