{
    "url": "https://www.nottingham.edu.my/GS/Graduate-School-Community/Index.aspx",
    "content": [
        {
            "p": "The Graduate School is a thriving community where you can come and relax with a coffee, have a break from work of study, meet other fellow postgraduates and early career researchers as well as develop a constructive network of friends and colleagues. The Graduate School provides a year round programme of social and academic events as well as personal and professional support. The Graduate School Administrative and Facilitators offices are located on Ground Floor of Block B (room BA02a and BA61, respectively). The Postgraduate Hub is located on the First Floor of Block H1 (above the food court). The Postgraduate Hub is divided into three sections: Both the learning hub and social space are accessible to all postgraduates and early career researchers at all times. Please ensure you bring along your University ID to access the main door entrance at H1B12. Training room (H1B13) which seats up to 24 people. To book this room, please contact Graduate School. Learning Hub (H1B12a) Social Space (H1B14) The Graduate School Reward Scheme rewards postgraduates who attend Graduate School training and development workshops. Simply collect a Reward Scheme card from one of the Graduate School's facilitators and ask them to initial and date one of the empty spaces everytime you attend one of the training and development workshop. Once your card is complete, you can exchange it for one of the available rewards at our administrative office (BA02a). Graduate School T-Shirts, commemorating University of Nottingham Malaysia 15 years anniversary GS Pendrive 2017 Graduate School Umbrella and Notebook The Graduate School is for postgraduate and research staff and led by postgraduates and research staff. Your input is vital to the work of the Graduate School, so if you have ideas for a specific workshop or social event, please let us know. Through sharing your ideas and enthusiasm you take an active role. You will also be invited to help plan and direct events and learn some really useful skills in the process If you would like to discuss how we might support your ideas for workshops, conferences and other events and socials, please get in touch with Graduate School. email:graduateschool@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}