{
    "url": "https://www.nottingham.edu.my/GS/Postgraduate-Prize-Awards/index.aspx",
    "content": [
        {
            "p": "The University of Nottingham Postgraduate Prize Awards recognise accomplishments in research, publications, conferences as well as contribution to the Postgraduate Community. Students are nominated by their Schools for excellence across a number of areas. 2015 marked the first time this awards ceremony was introduced at the branch campuses and showcased concurently across all three campuses in UK, Malaysia and China. 2016 marked another first as the Postgraduate Teaching Award was introduced at University of Nottingham Malaysia. The Postgraduate Teaching Award recognises and celebrates examplars of innovative teaching and support of learning. Applicants may support teaching and learning through a wide range of activities, including: demostrating in laboratory classs, distance learning, playing a leading role in seminars or tutorials, supporting project work or lecturers as well as marking, assessing and giving feedback on student work. This award is given to applicant who can show innovative and reflective practice by improving effectiveness in teaching and support of learning, making appropriate changes in learning activities or techniques as well as evaluating and reflecting on the impact of intervention and possibilities for further development. 2021 marked yet another first as the Best Supervisor Award was introduced at University of Nottingham Malaysia. The Best Supervisor Award is designed to recognise academics who demonstrate sustained activity and interest in the supervision of doctoral students as a primary supervisor and have at least 80% timely completion rate of doctoral students registered at UNM. Graduate School would like to congratulate all the winners on their commendable achievements and for archieving such prestigious awards! The tri-campus presentation ceremony which was scheduled to take place on 6 May 2020 was unfortunately cancelled due to the pandemic outbreak. Despite the limitations, we still wanted to celebrate our award winners and hence a tri-campus digital presentation was produced as a concerted effort by all three campuses. On behalf of Prof. Deborah Hall, Vice Provost (Research and Knowledge Exchange) and the Graduate School, we would like to wish all award winners many congratulations and all the very best in your future endeavours! Apurav Krishna Koyande Chemical & Environmental Engineering Supervisors: Dr. Show Pau Loke & Dr. Cheng Foh Le Nhat Quang Yen Education Supervisors: Dr. Lee Kean Wah & Dr. Csaba Szabo Or Oi Ching Environmental & Geographical Sciences Supervisors: Prof. Ahimsa Campos, Dr. Wong Ee Phin & Dr. Varun Goswami Denesh Sooriamoorthy Electrical & Electronic Engineering Supervisors: Dr. Anandan Shanmugam & Dr. Marwan Nafea This year was special for the organizing committee of the tri-campus awards as the event which took place on 25th May 2021 was hosted “live” virtually through Microsoft Teams for the very first time. Joining links were circulated earlier and the ceremony brought together close to 200 award winners, colleagues, students, friends and family from across the three campuses to celebrate the achievements and outstanding contributions of the award winners. Professor Andy Chan (interim Vice Provost, Research and Knowledge Exchange) in his opening address acknowledged how difficult and disruptive it had been to conduct research amidst the pandemic since last year but how the researcher community should always look forward to adapt under the new set of norms and culture to remain relevant. He went on to highlight that this year’s award is special as winners were not only chosen for their own research excellence or resilience but on the basis of their contribution towards the research community that is standing on the edge on a daily basis. To quote Prof. Andy Chan’s congratulatory remark, “Our winners showed what true human spirit is about, showing strength during this unprecedented times, to rally the people around them, organize the community and to think progressively and to bring the resources together so that the community continues to thrive”. Supervisors: Prof. Ts. Ir. Dr Pau Loke Show, Dr Ianatul Khairoh Supervisors: Prof William Case, Prof Katharine Adeney (UK campus), Dr Khairil Izamin Supervisors: Dr Wong Jing Ying , Prof Andy Chan email:graduateschool@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}