{
    "url": "https://www.nottingham.ac.uk/help-and-support/home.html?path=L2NvbnRlbnQvdW9uL2diL2VuL3N0dWR5d2l0aHVzL3Vnc3R1ZHkvZmluZC11b24vamNyOmNvbnRlbnQvcm9vdC9jb250YWluZXIvY2Fyb3VzZWxfODc3NjE4ODEz&variant=c3RhdGlj&title=SGVscCBhbmQgc3VwcG9ydA==",
    "content": [
        {
            "p": "Welcome to the University of Nottingham help and support hub - here you will find articles, guidance and frequently asked questions which may help resolve your query. Applying Admissions A-Z Accommodation Disability support services Scholarships, bursaries and financial support International students We can help you pick from over 300 courses across 54 subjects. Browse our online prospectus for 2025. Interested in undergraduate study at Nottingham? Here's our guide to submitting your application. Get familiar with your university halls - from where to collect parcels to how to do laundry Scholarships and bursaries Discover information that may help you fund your study at the University of Nottingham. Student experience As a member of the UK's prestigious Russell Group and the Universitas 21 global network of research-intensive universities, we deliver the highest standard of education, recognised worldwide. The University of Nottingham, University Park, Nottingham, NG7 2RD Whether you've already applied or thinking about submitting an application to study with us, dive into what student life is like in Nottingham. UON British higher education combines tradition and academic study, with cutting-edge thinking and a global perspective. For entry requirements, see the undergraduate course pages: https://www.nottingham.ac.uk/studywithus/ugstudy/See_all_courses.html or the postgraduate course pages:courses Our student enquiry centre can help you Guidance from student ambassadors You can filter and search for your query in our FAQ hub, which contains answers to frequently asked questions you may come across during the application process. Register for Find Your Nottingham where you can bookmark content, save your questionnaire results and access your personal study options. You can sign-in and browse at any time."
        }
    ],
    "pdf_files": []
}