{
    "url": "https://www.nottingham.ac.uk/hr/equality-diversity/equality-law/equality-act/equality-act-key-changes.aspx",
    "content": [
        {
            "p": "The new definition of direct discrimination extends protection based on association and perception to include: • Age • Disability • Gender reassignment • Sex • Pregnancy and maternity This is already applicable to race, sexual orientation and religion or belief. This change means that those providing case for someone due to a protected characteristic would be protected because of their association. Protection for disabled people has been extended: • Indirect discrimination will be extended to disability • A new protection for discrimination arising from disability will be introduced • The duty to make reasonable adjustments for disabled people has been extended to when a disabled person experiences a ‘substantial disadvantage’. The previous duty applied when it was ‘impossible or unreasonably difficult’ for a disabled person to work, study or use a service The default retirement age (that was set at 65) was abolished from 6 April 2011. It will be no longer possible to subject employees to compulsory retirement on or after 1 October 2011, unless the retirement can be justified in the particular circumstances. The University is no longer able to reject job applications from external candidates who are over 65; such applicants should be treated in the usual way. Age-related factors must not be used as a criteria for non-selection. A woman who is breastfeeding is now explicitly protected from unfavourable treatment in the areas of education and provision of services. This covers unfavourable treatment within a period of 26 weeks from when she has given birth. Outside of this 26-week period, a breastfeeding woman may be protected by the sex discrimination provisions. The new provisions made it unlawful for an employer to ask about the health of a job applicant: • Before offering work to an applicant • Before including an applicant in a pool of shortlisted candidates from which the employer intends to select a person to offer work to The Equality Act 2010 introduces protection for people from victimisation by their employer if they discuss their pay with colleagues with a view to establishing differences in pay that may exist because of a protected characteristic. Employers will not be able to enforce any terms of employment or appointment that prevent or restrict discussions relating to pay."
        }
    ],
    "pdf_files": []
}