{
    "url": "https://www.nottingham.ac.uk/hr/equality-diversity/equality-law/equality-act/key-principles-of-equality-law-.aspx",
    "content": [
        {
            "p": "Direct discrimination is the legal term that applies if a person treats someone less favorably than they would another because of a protected characteristic they have or are thought to have or because they associate with someone who has a protected characteristic (see discrimination by association and perception below). It is not possible to justify direct discrimination, so it is always unlawful (except in cases of single sex institutions that only admit applicants of one gender and in certain limited cases relating to religion or belief, e.g. where there is a genuine occupation requirement for a job). The Equality Act 2010 extends protection based on association and perception already applicable to race, sexual orientation and religion or belief to include age, disability, gender reassignment, sex and pregnancy and maternity. • Associative Discrimination – whereby a person is treated less favourably because of his/her association with someone who has a protected characteristic. For example, a employee is overlooked for promotion because their partner has undergone gender reassignment • Perceptive discrimination – whereby a person is treated less favourably because he/she is mistakenly believed to have one of the protected characteristics. For example, an employer decides not to promote a female employee because senior staff believe her to pregnant irrespective of whether she is pregnant or not This occurs when an organisation (for example, the University, or a member of staff at the University) makes a decision, or puts in place a particular policy or practice, which, on the face of it appears to treat everyone equally, but which actually, in practice, leads to people from a protected group being treated less favourably than other people. This is unless the person applying the provision can justify it as a proportionate means of achieving a legitimate aim. All the protected characteristics except for pregnancy and maternity are covered. Indirect discrimination may occur if, for example, an employer who requires staff to commit to working from 8pm to 11pm every evening indirectly discriminates against women, who are more likely to be primary carers of children, unless this can be objectively justified as above. Harassment on the basis of age, disability, gender reassignment, race, religion or belief, sex and sexual orientation is unlawful. It does not apply to pregnancy and maternity and marriage and civil partnership. Complaints of harassment can be made regardless of whether or not the harassment was intentional. Victimisation (defined in Section 27 of the Equality Act 2010) takes place where one person treats another less favourably because he or she has asserted their legal rights in line with the Act or helped someone else to do so. In order to protect and support members of the University from harassment, the University has a Dignity within the University policy. This policy provides guidance on behaviour which may constitute harassment, information and advice for victims of harassment and informal dispute resolution through a trained network of advisors. Positive action is a range of measures allowed under the Equality Act 2010 which can be lawfully taken to encourage and train people from under-represented groups to help them overcome disadvantages in competing with other applicants. For example, the University often has a low rate of applications from women for academic and academic-related offices in certain subjects, such as science, engineering and technology. In order to improve this, initiatives, such as WiSETI or targeted actions may be undertaken. Positive action must not be confused with positive discrimination which is unlawful, e.g. the setting of quotas (as opposed to targets, which are lawful) or any form of preferential treatment. Where positive action has been taken to encourage applicants from disadvantaged groups to apply, every applicant must be considered on individual merit and selection for interview and appointment must be based strictly on the agreed selection criteria. The Equality Act 2010 does permit reasonable adjustments which may give preferential treatment to an individual with a disability. The Government Equality Office has produced guidance on positive action."
        }
    ],
    "pdf_files": []
}