{
    "url": "https://www.nottingham.ac.uk/hr/equality-diversity/equality-law/equality-act/equality-act.aspx",
    "content": [
        {
            "p": "The new Equality Act came into force on 1 October 2010. The Equality Act brings together over 116 separate pieces of legislation into one single Act. Combined, they make up a new Act that will provide a legal framework to protect the rights of individuals and advance equality of opportunity for all. In addition to prohibiting direct and indirect discrimination, the Equality Act has extended scope to: • inclusion of discrimination by association or based on perception; • indirect discrimination extended to disability and gender reassignment; • hypothetical comparators now allowed in some gender pay claims; • restrictions on health questionnaires in recruitment; • wider tribunal powers to make recommendations The Act’s employment provisions largely reflect the current law and cover all workers. As with current legislation the scope of the Act is broad enough so that protection from discrimination may extend to people who are not necessarily employees. This could include contract workers and, in some circumstances, volunteers. An employee or agent (someone who works for you on your behalf) of the University are personally held accountable for acts of discrimination, harassment or victimisation. At the corporate level, the University Council is ultimately responsible for any breaches of the Equality Act, unless it can show that it took ‘all reasonable steps’ to prevent the discrimination, harassment or victimisation from taking place. A summary overview of the Act can be found below, with further guidance available on the Equality and Human Rights Commission (EHRC) website, and the full version of the Act on the Government website: Protected characteristics are the grounds upon which discrimination in employment, education and provision of goods and services is unlawful. This covers the University’s staff, students and other service users/customers. The protected characteristics under Section 4 of the Equality Act 2010 are: All protected characteristics (with the exception of marriage and civil partnership) are subject to general public sector equality duty from April 2011 which require us to have due regard to: The specific duties are designed to help organisations meet and show they have met the general duties require HEIs to publish: One or more equality objectives by 6 April 2012, and thereafter updated at least every four years. Equality objectives must be specific and measurable and relate to the achievement of the equality duty Information to demonstrate their compliance with the equality duty by 31 January 2012 and thereafter, at least annually. The specific duties were drafted by the previous government. The Coalition Government has reviewed and delayed the enforcement of the specific duties. The Home Office has announced that there is a debate in House of Lords likely to be held in September 2011, and the duties should then come into force following parliamentary approval. Further information is available on the Home Office website. Updates on the Equality Act can be found at: Equality Challenge Unit or ACAS website."
        }
    ],
    "pdf_files": []
}