{
    "url": "https://www.nottingham.ac.uk/hr/equality-diversity/pay-gap-reports/reducing-gender-pay-gaps.aspx",
    "content": [
        {
            "p": "The university will also continue to operationalise the People and Culture Strategic Delivery Plan implementing initiatives to support the reduction of our pay gaps across leadership development, wellbeing, employee engagement, embedding values, performance measurement and reward mechanisms. We will: Carry out more detailed and timely analysis of pay gap data for the next reporting period of April 2024, improving our approach to monitoring and reporting progress against our action plans. Develop a pay strategy will set out how the University will use reward policies, practices and processes in a fair and equitable way to support reduction of our pay gaps. Review our Flexible Working Arrangements Policy to bring in line with new regulatory requirements and ensure that it reflects best practice and serves the needs of our university community. Continue to explore options to provide and embed reverse mentoring to enable senior staff to better understand the day-to-day experiences of more junior staff from diverse backgrounds which are currently underrepresented at senior levels (which contributes to the pay gaps) and offer promotions workshops to encourage reward applications from staff in underrepresented groups. Review and refine recruitment processes to make these as inclusive as possible, including but not limited to considering where vacancies are promoted; how job descriptions are written; and how interviews are organised. Review our approach to open conversations to empower line managers and employees to have trusting and constructive conversations about reasonable adjustments for disabled staff. Review pay gap data at a faculty/department level to determine local trends which might be driving the university-level data and put local initiatives in place to address these as appropriate. Continue to support faculties with workforce planning considering underrepresented groups and initiatives to encourage improvements in representation. Athena Swan commitment - The Athena Swan charter encourages and recognises commitment to gender equality including advancing the careers of women and for trans staff and students in higher education and research. As an Athena Swan gold award holder, we are committed to the delivery of our Athena Swan action plan and continuing our commitment to the Athena Swan principles within our policies, actions plans and working culture. Race Equality Charter Commitment – The Race Equality Charter is designed to improve the representation, progression and success of minority ethnic staff and students within higher education. We want our staff to be confident that racial equality is taken seriously and we achieved the Bronze Race Equality Award in 2021. This gives us a framework in which to identify, explore and consider issues affecting the representation, progression and success of minority ethnic staff at the university. We are committed to delivering the actions identified in our Race Equality Charter action plan and driving culture and process change institution wide. We cannot reduce our pay gaps without having a culture which supports a diverse workforce and one where minority groups are included and treated equally. Our values include inclusivity, fairness, openness, ambition and respect and are being embedded within everything we do. EDI Annual Activity Report - This report summarises all the activities and achievements the university has made, all of which help embed EDI into the university culture. Disability Confident Scheme – The University of Nottingham is a registered Disability Confident committed (Level 1) employer. Increasing employee diversity is important to us and we are committed to the aims of Disability Confident."
        }
    ],
    "pdf_files": []
}