{
    "url": "https://www.nottingham.ac.uk/hr/financial-wellbeing/financial-wellbeing.aspx",
    "content": [
        {
            "p": "This web page signposts staff to resources which may help them to feel secure and in control of their finances. We know that many people find it difficult to talk about financial concerns. Reaching out and seeking advice and support early can be a positive step to help avoid problems spiralling out of control. This web page signposts sources of support available and is broken down into sections to aid navigation. Please note that the University is unable to offer financial advice to employees. Anyone who gives specific, personalised financial advice in the UK is required by the financial regulator, the Financial Conduct Authority, to be registered with them and able to conduct a detailed fact-finding process with individuals before being able to give such advice. The University raised the maximum pay spine for 2022/23 to provide a 3% uplift for all colleagues at Levels 4-7 who are currently on the standard maximum points of their pay scale. This is in addition to the 3% national pay rise negotiated by UCEA. The University is also implementing a three-year pay offer for staff at Levels 1-3 averaging 8.2% from 2022/23. This includes and an average uplift of 18.5% across the three years, which exceeds other offers available in the higher education sector. This is in addition to reforms that will also see these staff receive increased annual leave, pension benefits and enhanced pay rates for Bank Holiday and University closure days. Speak to your manager Speaking with your line manager will help them understand challenges that you may face, and they may be able to arrange some support for you. This could include signposting you to some of the resources offered by the University or external organisations summarised on these web pages. Employee benefits As well as your salary, the University offer a range of benefits which can be accessed via our Employee Hub. The Hub includes access to a wide range of staff discounts including at supermarkets to help you save money on your weekly shop. Notts and Lincs Credit Union You can find information about the Notts and Lincs Credit Union here. The University of Nottingham entered into an agreement with Notts & Lincs Credit Union (NLCU) so that staff can benefit from a range of straightforward saving products and fair, manageable loans, with the option to save or make repayments directly and easily by salary deduction through payroll. Help with utility bills One of the largest rises in the cost of living has been to utility bills. Visit your supplier’s web site to see what help is available if you are struggling with your bills. Useful links: Severn Trent Trust Fund – support for those in arrears on their Severn Trent bills Big Difference Scheme - help for Severn Trent customers on a low income British Gas Energy Trust – independent charitable trust supporting those in energy debt, you don’t need to be a British Gas customer to apply for help Cost of living payments The Government recently announced a package of measures to help low-income households tackle the dramatic cost of living increases. It is important that employees receive what they are entitled to. For more details of the scheme and how payments will be made, please click here. Department for Work and Pensions benefits Depending on earnings and personal/family circumstances, employees may be able to claim Universal Credit. The way benefits are paid have changed in recent years to encourage people back to work and Universal Credit doesn’t always stop because someone has started work, as it is designed to support individuals on low incomes. To check eligibility, please visit the Government’s Universal Credit web site. It includes a calculator to check eligibility for a range of benefits based on personal circumstances. Money and Pensions Service The Money and Pensions Service is an organisation sponsored by the Department for Work and Pensions with a legal objective to develop and co-ordinate a national strategy to improve people’s financial capabilities. The service provides impartial, free, money and pensions guidance directly to consumers online and by telephone. In summary, their services include the following: These resources can be accessed here and using the drop-down menu entitled “Our Work” at the top of the page for details of the support available. Free shower facilities You can keep your home energy bills down by using our free shower facilities at various locations across our campuses. The interactive maps show the locations of showering facilities across campus. Broadband for low income families Many of us rely on our internet service to carry out our day-to-day activities. This can be costly and put additional pressure on household finances. However, there are low-cost packages available for low-income families. The Money Saving Expert and uSwtich web sites have more information on this. Cheaper, sustainable food options The University has partnered with Too Good To Go, an organisation that offers cheaper food which also helps to tackle food waste, leading to a more sustainable environment. Download the app to buy unsold fresh food at a great price. At the University, collections are currently available at: Travel to work costs There are a number of University initiatives that can help with the cost of travelling to campus. Mental health and wellbeing The University offers employees support through the Employee Assistance Programme (EAP), which is sourced through an external organisation called Care First. The EAP service offers expert advice and compassionate guidance 24/7, covering a wide range of issues, including counselling, and legal and debt counselling support. It is completely independent of the University and, therefore, confidential. If you wish to access this service, full details can be found here. You can also call Care First on 0808 168 2143. Contained within the site is a budgeting calculator which you may find useful, this can be accessed here. In addition to the EAP, the University also offer a wealth of advice and guidance around wellbeing, which can be accessed through our web pages here and the Wellbeing hub. Citizens Advice - can help people manage debt to enable them to achieve financial independence Turn2Us - helps people in financial need gain access to welfare benefits, charitable grants and other financial help – online, by phone and face-to-face through our partner organisations The Bounce Back checklist through the British Gas Energy Trust - this details the main benefits and schemes to help individuals get support and maximise their income, whether they are working or not Education Support - supports individuals and help schools, colleges and universities to improve the mental health and wellbeing of their staff StepChange Debt Charity - or call 0800 138 1111 - is the UK's leading debt charity. Get free, confidential advice and practical solutions to help deal with debts National Debtline - or call 0808 808 4000 - will talk individuals through options and give clear advice on how to take back control PayPlan - or call 0800 280 2816 - offer a supportive, non-judgemental team of advisers help thousands of people beat their debts every year and treat all calls with the strictest confidence Financial Wellness Group - or call 0161 518 8285 - provides free advice and solutions for people struggling with money, debt and budgeting. They have 27+ years’ experience supporting people to find a route to become debt free Debt Advice Foundation - or call 0800 622 61 51 - is a national debt advice and education charity offering free, confidential support and advice to anyone worried about debt"
        }
    ],
    "pdf_files": []
}