{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/performanceatwork/clinical-academic-staff/documents/job-plan-(clinical-academics---new-consultant-contract).doc",
    "content": [
        {
            "p": "The University recognises the substantial benefits that can accrue to individuals, schools, and the University, as a consequence of Research and Teaching staff having periods of study leave. Such leave is desirable to maintain the vitality and creativity required for successful and original teaching, scholarship and research throughout an academic career. This guidance seeks to provide some broad principles for schools to follow to gain some consistencies as there are a variety of practices across the University. Both full-time and part-time members of staff within Levels 5 to 7 of the Research and Teaching job family (whose main focus is research, teaching or research and teaching) are eligible to apply for study leave for the purpose of furthering research/teaching or other study related to their duties in the University. Study leave is defined as a sustained period of time in which the normal duties of a member of academic staff are wholly or substantially reduced with the approval of the Head of School. Whilst study leave forms an important component of academic career development, the proposed area of research/teaching should fit in with the overall strategic objectives of the school, and timing of any proposed study leave must take account of pressures on the school concerned at the time. Study leave should be used principally for the purposes of one or more of the following developments: The University feels that it is reasonable for a member of the academic staff to apply for study leave after either six semesters of service or a gap of six semesters since their last period of study leave. The duration of the study leave can be up to one semester. This expectation of leave should not be regarded as an entitlement and the proposals made for the study leave must: Study leave will normally be on full salary, but can be granted as unpaid leave. The University's normal contractual arrangements will apply to any period of study leave. Those granted leave will be expected to free up time on research, teaching, examining and other duties during the period of leave. Whilst the member of staff is on study leave they are still employed by the University and must still be contactable during their leave. For any unpaid period of study leave, individuals should pay particular attention to pension arrangements. Employees should contact the University Pensions Administrator to discuss the options available during any unpaid period of study leave to ensure that any implications for their pension membership and benefits are understood. Staff can also contact the relevant pension scheme helpline direct, details of which can be found on the Payroll and Pensions web page. It may be possible for employees (subject to scheme rules allowing for this) to continue to make payments to the scheme during the unpaid period, such that membership may be continuous. If unpaid leave is to be granted the line manager must inform Payroll of the relevant start and end dates. In general, the University expects that the financial arrangements for study leave will be kept to a minimum because costs will be covered either by the internal rearrangement of teaching and other duties within a School, or by the hiring of replacement staff from money awarded externally for that purpose. The University encourages staff to secure external funding for study leave where ever possible to help with full replacement of duties. All applicants must discuss taking study leave with their line manager. The discussion should take place at least 6 months prior to the leave commencing, but it is up to individual schools to determine the timings. The discussion should include the following: a) the dates of any previous study leave undertaken (if appropriate) b) what were the agreed goals of the previous study leave and were they achieved. It is at the discretion of the Head of School/Department to accept the application if previous leave did not achieve the set goals c) outline of plan for the study leave; the scheme of work proposed; what specific targets are being set; where the leave will be based c) a statement of the benefits that will accrue to the individual, school and University as a result of the leave d) how normal duties might be covered in their absence e) external funding that is available (if any) If helpful to the staff member and line manager, this information can be captured in the study leave application form. The following are valid reasons for refusing study leave. a) If the staff member on study leave has not completed all marking and other examination and assessment responsibilities (including re-sits) arising from the previous semester, along with any other materials and information necessary to be provided for in the semester following the study leave, by the due dates and without imposing on other colleagues; b) The study leave will not be of benefit to the school/individual and does not fit within the school's goals and objectives c) It would not be possible to run a particular module or research project due to the staff member being off on study leave. d) Because of the number of staff on leave at any one time, it is not possible to cover the teaching, research or administrative workload. Applicants for study leave should first consult with the relevant members of their school to see if the leave would be feasible and relevant. The line manager will then submit the request in UniCore, selecting Study Leave as the absence type. Alternatively, the line manager can submit the completed application form and submit this to HR, via the Helpdesk in UniCore. HR will then enter the request in UniCore, selecting Study Leave as the absence type. This is then submitted in UniCore to the Head of School/ Department for approval. The Head of School/Department will indicate whether the proposed area of research/teaching is in line with the school's overall strategic objectives, add any further comments, and approve or not. Once approved, the line manager will receive a notification within UniCore and the line manager can then liaise with the school office to co-ordinate letters of notification to the applicants, in liaison with their HR Business Partner if necessary and a copy (along with the application) should be sent to HR, via UniCore selecting HR Helpdesk to be placed in their personal file. It would be the responsibility of the Head of School/Department to feed back to the applicant on the decision made. If the request is turned down, the feed back should explain the reasons why it has been rejected. Once the study leave has been completed, the individual must submit a report (approximately 2 pages of A4) to the Head of School/nominee detailing the outcomes of the work that has been undertaken within one month of competition. The Head of School or nominee will need to have: The report should be retained by the school/department locally and securely, this can then be destroyed in line with the General Data Protection Regulations (GDPR). Alternatively, the Head of School/Department can submit the report to HR to store on the employee’s file using the Document of Records section in UniCore. The above arrangements for study leave are not intended to prevent additional arrangements, such as the re-scheduling of teaching duties to allow completion of a particular piece of research by a staff member, where these can be made within available resources in a manner which is beneficial both to the individual and to the school concerned. The University values the diversity of its people and is committed to promoting equal opportunities and eliminating discrimination. Therefore, staff will apply and operate this scheme fairly and in doing so ensure that there is no discrimination on the grounds of gender, race, disability, age, religious or political belief, sexual orientation, trade union membership/activity or marital status. Contact your Employment Services team at hr@nottingham.ac.uk."
        }
    ],
    "pdf_files": []
}