{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/worklifebalance/specialleave/adviceinsevereweatherconditions.aspx",
    "content": [
        {
            "p": "In cases where we experience severe weather conditions, the University would like to offer guidance in relation to managing such situations. Should employees be unable to travel to their place of work due to severe weather conditions, they should contact their line manager (or nominee) prior to their normal start time (or as soon as possible thereafter). Subject to approval and operational needs, employees may be able to work from home (there will be roles that cannot be completed from home). Alternatively, the manager and employee would agree annual leave, unpaid leave or other arrangements as appropriate. In certain situations where employees are required to provide unexpected care for their dependants, the ‘Special Leave for Unplanned and Urgent Domestic, Personal and Family Reasons’ policy may apply. For example, the school or nursery (attended by the children of staff) makes a decision to close on the morning that the employee is due in work without any prior warning, and the employee contacts their line manager to request to take ‘Special Leave’ on that day, in order to make arrangements for alternative childcare. Line managers may use their discretion to grant such leave in line with the policy. Should the employee know that the school or nursery (attended by the children of staff) would be closed for a second consecutive day, they should request to take annual leave or unpaid leave as normal. Special leave should only be granted at the start of the employee’s working day, or as soon as is reasonably practicable, and should not normally be granted retrospectively. Any local arrangements for taking this leave should be followed. Heads of School/Department should be made aware of any circumstances where employees are not able to travel to work in order to ensure consistency of approach by line managers across the School/Department. Heads of School/Departments are advised that when we experience severe weather, it does not necessarily mean that all employees should work from home or leave work early, but discretion should be used to ensure that employees are safe in their journeys to and from work."
        }
    ],
    "pdf_files": []
}