{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/universitycodesofpracticeandrules/refreshmentsandbreaksforstaffduringtheday.aspx",
    "content": [
        {
            "p": "The purpose of this operational guidance is to: For details of contractual entitlement to breaks during the working day see the Breaks during the Working Day web pages on the Human Resources web site. The Statutory entitlement to breaks under the Working Time Regulations, if required, can be found at the following link: http://www.direct.gov.uk/en/Employment/Employees/WorkingHoursAndTimeOff/DG_10029451. Under the harmonised Terms and Conditions of employment, there is no entitlement to a paid break during the working day for staff in any Job Family. There should therefore be no scheduled paid breaks, of any type, to allow staff to have access to refreshments during the working day, other than the Health and Safety breaks detailed further in this guidance. There is no contractual or statutory entitlement for staff to have access to or be provided with refreshments during the normal working day. However, the University considers that it is reasonable to allow staff access to a drink where it does not impact on the delivery of their work. There are locations throughout the University where staff are able to make a hot drink or access drinking water. A large proportion of staff can acquire a drink at these locations and take the drink back to their work station. However, it is acknowledged that in some work environments e.g. laboratories the ability to take a drink to these locations may not be permitted due to Health and Safety reasons. In addition, staff may not work the required hours per day to be contractually entitled to an unpaid meal break (more than five hours per day). The University recognises that it is generally beneficial to allow staff access to refreshments during the working day. The below operational solutions have therefore been suggested and may be implemented by the School/Department. The following suggested operational solutions may be helpful in facilitating staff having access to refreshments. This list is not exhaustive and there may be alternatives. Not all of the suggestions may be suitable in every situation and will be dependent up on operational requirements. It is recommended that any proposed solution is implemented through consultation and agreement with the staff member/s affected. It is important, where implementing any solution/s that staff are treated reasonably and fairly. The relevant Employment Relations Adviser can help and support in implementing any operational solutions. Arrangements could be made for staff who are not allowed to take refreshment at their work station, to undertake designated work elsewhere for a period of time during the working day, where they could have refreshments. Existing breaks, during the working day, could be re-designed to include a work element such as team briefings. Staff contractually entitled to an unpaid meal break could split this out during the working day. For example, a full-time member of staff working 9.00 am – 5.15 pm, is contractually entitled to a one hour unpaid meal break. This one hour unpaid meal break could be taken as a 15 minute break in the morning and afternoon with a 30 minute break at lunch. Staff may request to extend their working day in order to have an unpaid break during their working day e.g. by arriving at work earlier or finishing later. Where operational solutions are implemented, it is important that these are set out and readily available to staff. Any written statement should clearly include reference to the arrangements not being contractual, that they may be subject to change and are not a paid break. The process of agreeing the local arrangements should not be treated as a flexible working request under the Flexible Working Arrangements Policy. It is recognised that following the normal process of Health and Safety risk assessments, the need for specified breaks during the working day may be identified. Health and Safety breaks will generally be in such circumstances as staff working in more extreme working conditions e.g. very high or low temperatures or in very physically demanding jobs. The Safety Office has produced a guidance note for managers which provides more details of these Health and Safety breaks. Any questions should be directed to the relevant Employment Relations Adviser or the Safety Office, as appropriate. Human Resources Department May 2009"
        }
    ],
    "pdf_files": []
}