{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/universitycodesofpracticeandrules/intellectual-property-ip-policy.aspx",
    "content": [
        {
            "p": "The following Code of Practice pertains mainly to inventions and patents but includes all forms of intellectual property, including know-how. Under the Copyright, Designs and Patents Act of 1988, the University as the employer is the owner of intellectual property (IP) created or produced by employees in the course of their employment, or as a result of duties specifically assigned to them. This includes all forms of IP, including Copyright and Know-how, and the revenue sharing arrangements arising from successful commercialisation apply to all such IP. Where an employee makes a discovery or accumulates a body of know-how which they believe has commercial potential they shall first contact the IP Commercialisation Office before seeking to take action to protect or to commercialise the IP. In certain instances, the operation of law is moderated by a long-standing and widely accepted academic practice in the Higher Education sector, whereby the employer waives assertion of copyright ownership of scholarly texts in favour of the academic author, this includes research papers and textbooks. Further information may be found in the Copyright policy. Further information on other forms of Intellectual Property, protection and routes to commercial exploitation may be found on the web pages of the IP Commercialisation office. Inventions are divided into two categories as follows: A. Inventions by members of staff not involving an outside body When members of staff make an invention which, in their opinion, it is desirable to protect by a patent, they shall first contact the IP Commercialisation Office, provide a disclosure and discuss the nature of the invention and possibility of securing patent protection. Staff shall provide sufficient information for the IP Commercialisation Office: In reaching its decision, the IP Commercialisation Office shall consider any evidence submitted in writing or, in person by the individuals. If the IP Office’s recommendations differ from the expressed wishes of the individuals, any difference may be brought to the attention of the Director of IP Commercialisation. Whenever appropriate, the fullest opportunity will be given to the inventors to participate in the exploitation of their patented invention. The inventors will be required to provide technical assistance with the patent prosecution and review of examination reports. Patent prosecution fees are shared 2/3rds:1/3rd between the IP Commercialisation Office and the inventor(s) schools or divisions. Any costs incurred by the University in supporting the application, including patent fees, development costs and the purchase of technical advice, shall be the first charge of any income arising from successful commercial exploitation. The division of the remaining revenue shall be determined by reference to the scale approved by Council. In the case of an invention made in special circumstances, the Council of the University, by resolution and with the agreement of the inventors, may vary the terms of the division of revenue between the University and the inventors. B. Inventions involving the University, members of staff and any outside body The terms of contract governing the support given by an outside body must be approved by the University and shall include provisions relating to: Various Government Agencies require the exploitation of any inventions to be the subject of an agreement, usually in a standard form between the University, the members of staff and the sponsoring body. The conditions, which apply to industrially supported work, are normally the subject of discussion and contractual agreement between University and the sponsor. In the case of Research Council support, the University is authorised to undertake the exploitation of inventions arising from research funded by the Research Councils on the understanding that the University will look to identify, protect and seek a commercial return from intellectual property that shows commercial promise and to share the net revenue with the inventors. The University IP Commercialisation Office has to provide such undertaking on grant applications to Research Councils and charities. When members of staff make an invention, which, in their opinion or that of the sponsoring body, it is desirable to protect by a patent, they shall, inform the IP Commercialisation Office which shall undertake as appropriate evaluation, protection and subsequent commercial exploitation as outlined above. The division of any revenue which results shall be determined by reference to the scale approved by Council but any costs borne by the University shall be a prior claim on any proceeds. In the case of an invention made in special circumstances, the Council of the University by resolution and with the agreement of the inventors may vary the terms of the division of revenue between the University and the inventors. Where the invention has been made in collaboration with members of other research institutions the IP Commercialisation Office will negotiate with collaborating institutions and if a collaboration agreement has not already been executed will determine which institution leads on IP protection and commercialisation. The distribution of royalties arising from exploitation of intellectual property rights is as follows: The first £25,000 of the aggregate net revenue shall be apportioned: Thereafter, the aggregate net revenue shall be apportioned: Further to the recommendations laid out in the University Spin-out Terms (USIT) guide (2023), in the event a spin-out company is formed to commercially exploit intellectual property the initial equity distribution shall normally be: This distribution is based upon the University licensing the relevant intellectual property to the company. The University may also elect to license the relevant intellectual property for either; a) a mix of equity and royalties, in which case the University’s equity stake may reduce, or; b) royalties only. A process will be applied to determine where substantial University resource or other (including public or charity) funding has been fundamental to the generation of IP, which will be taken into consideration when defining an opportunity in the latter ‘IP-light’ category. In all cases, pre-existing agreements with funders or research partners will be taken into consideration. Where IP is jointly-owned with a third party organisation, or a joint venture is being created with a third party, the above equity model will reflect the distribution between the Inventor(s) and the University attributable to the University’s IP or other contributions to the venture. Inventors may receive equity in the spin-out company in exchange for renouncing any further call on the University’s revenue arising from exploitation of the intellectual property. Inventors may receive options to additional equity for participation in the on-going growth and development of the company – further information on spin-out companies is available on the IP Commercialisation Office web pages. At the University’s discretion, the net revenue arising from realisation of the University’s equity stake in intellectual property based businesses may be divided: Academic members of staff may also wish to form companies around the provision of specialist services, and expertise. Permission to form such a vehicle and to be a Director must be sought from the University through the IP Commercialisation Office. In the event that permission is granted the University may require an equity stake in the vehicle depending on the background, business proposition and links with the University. The amount of equity will be dependent upon the nature of the vehicle. In cases where there is any reliance on the use of University facilities a commercial agreement between the Company and the University will need to be put in place. All work done for spin-out, service and consultancy companies by University staff is subject to the terms of the University’s External Work Policy unless there is a specific commercial agreement with the University that covers the activity. Further information is available on the IP Commercialisation web pages."
        }
    ],
    "pdf_files": []
}