{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/healthandwellbeing/occupational-health/occupational-health.aspx",
    "content": [
        {
            "p": "The University of Nottingham has contracted with Optima Health Ltd for the provision of Occupational Health services to staff and students. If you have concerns about your health and how this is impacting on your work, or if you have concerns about a team member, then seeking OH support and advice may help. The HR Employment Relations team can provide advice on making a referral and assist you with managing health issues in the workplace. To contact the HR Employment Relations team, email: hrer@nottingham.ac.uk. The Occupational Health team also provide a health surveillance and vaccination service for both staff and students. For more details, please contact your School Safety Officer or the Health and Safety Team. An employee may be requested to attend Occupational Health by their manager or Human Resources, they may also request to be referred through their manager. Occupational Health advice is given to help employees and their managers understand any health conditions that might be impacting on their work and how employees can be supported in the workplace. Reasons for making a referral may include, but are not limited to: Health surveillance may be required for certain groups of workers in relation to specific process hazards on the basis of risk assessment. This may be on an individual basis or organised for groups of workers. There is substantial evidence to support the effectiveness of early intervention for musculoskeletal and mental health related problems and managers are encouraged to seek early assistance from Occupational Health if an employee is either struggling in the workplace or absent from work for either of these reasons. A candidate who is successful in securing employment with the University will be asked to complete a health questionnaire, as a condition of their employment offer. The completed questionnaire will be reviewed by the Occupational Health team to understand if there are any existing health conditions that may require support in the workplace. A Research Passport is the mechanism for non-clinical University staff to obtain an Honorary Research contract or Letter of Access when they propose to carry out research in the NHS. The Health and Safety Team provides advice and guidance on the management of health and safety at work, including statutory health surveillance requirements for work with a variety of hazardous substances and processes. Please refer to the Health and Safety Team web site for further information. Staff or students who are unhappy with the service they receive from the Occupational Health Service should raise this directly with Optima Health by email: UON@optimahealth.co.uk. Should this not result in satisfactory resolution of the issue, then staff may contact the University's Human Resources Team at hr@nottingham.ac.uk and students have a range of options outlined on the Student Services Help and Support web page."
        }
    ],
    "pdf_files": []
}