{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/complaintsgrievanceanddignity/complaintsprocedures-universityguidance.aspx",
    "content": [
        {
            "p": "The University aims to represent itself in a professional manner in its dealings with staff and students but recognises that occasionally things can go wrong. In many cases issues, problems or misunderstandings can be dealt with by discussion between the parties involved but in other instances, it may be appropriate to pursue the matter in a more formal way. These notes are intended as a guide on the way that complaints should be generally pursued, and are intended to help resolve problems in an effective way. Those making a complaint can expect their complaint to be dealt with promptly and fairly and in accordance with the appropriate procedure. The University is committed to working in an open and accountable way that builds the trust and respects all members of the University community. This document defines what we mean by ‘complaints’ and outlines the University procedures for dealing with them. Some complaints will require a full investigation to be carried out and other complaints can be successfully dealt with by an explanation of why something has happened and/or an apology. In whichever case, the University will seek to give a satisfactory response to any concerns raised. A complaint may be defined as “an expression of dissatisfaction or concern that needs a response”. The expression of dissatisfaction or concern may take the form of an informal verbal complaint, an informal or a formal written complaint. A complaint is more than purely an objection to the merits of a decision or action by the University, its students or its staff. Examples of complaints can be claims of impropriety, irregularity, misconduct, poor performance or ineffectiveness. In other words, a complaint is concerned with the manner in which a decision has been made or action taken, rather than with the decision or action itself. Should you wish to make a complaint relating to an equality and diversity matter your complaint should be addressed to the HR Department who will either deal with it or forward the complaint to the relevant department. You will be contacted within five working days with an acknowledgment of you complaint and confirmation of who is dealing with it. The following are other complaint mechanisms which exist within the University and you are advised to read these before submitting a complaint to determine which is the most appropriate complaint mechanism for you to use. All complaints will be handled confidentially and sensitively and treated seriously and the University will endeavour to deal with all complaints promptly. Complaints that are made frivolously, vexatiously or maliciously, will not be investigated by the University."
        }
    ],
    "pdf_files": []
}