{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/absenceandannualleave/sicknessabsence/sickpayscheme/calculationofsickpay.aspx",
    "content": [
        {
            "p": "Payment during sickness absence is dependent on entitlement derived from length of service on the first day of absence. Qualifying entitlement is as follows: John commenced at the University on 1 January. His first day of sickness was 31 March and continued for 3 days. He returned to work on 3 April. None of the absence was paid as John had not completed 3 months' service on the first day of absence. If an individual is off for a long period and their length of service entitles them to a different level of entitlement, this is not activated until their return to work. Julie commenced at the University on 1 October 2006. Her first day of sickness was 21 September 2009 and continued for 4 months, returning on 4 January 2010. At the start of her absence, her entitlement was 13 weeks' full pay and 13 weeks' half pay. Even though her entitlement changed on 1 October 2009, to 21 weeks' full pay and 21 weeks' half pay, she was only paid 13 weeks' full pay (and 4 weeks' half pay). She did not progress to the next level of entitlement until she returned to work. Entitlement is calculated on a rolling 12 month basis, so all sickness absence in a 12 month period is included for the purposes of the calculation. Sarah commenced at the University on 1 August 2005. She was off sick on 3 September 2006 until 3 October 2006 when her entitlement was 13 weeks' full pay and 13 weeks' half pay. In the 12 monthd prior to her first day of absence, she had been off sick, at different times, for a total of 11 weeks. During her sickness she was, therefore, only paid for 2 weeks at full pay and the rest at half pay. Statutory Sick Pay (SSP) is paid up to a maximum of 28 weeks. Unless the absence is linked i.e there has been absence in the previous 8 weeks, the first 3 days are not paid and are termed waiting days. During periods of full pay SSP is paid concurrently. During half pay, SSP is paid in addition to Occupational Sick Pay (OSP). If an individual has exceeded both their full and half pay entitlement - for example 8 weeks' full pay and 8 weeks' half pay - SSP continues to be paid up to 28 weeks."
        }
    ],
    "pdf_files": []
}