{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/universitycodesofpracticeandrules/accesstohumanresourcesrecords.aspx",
    "content": [
        {
            "p": "The Human Resources Department holds your personal and employment history details in a manual (paper-based) form which will normally include details of your application, terms and conditions of employment and other relevant documents. It also holds your personal and contractual details on a computerised human resources information system, which is integrated with the computerised system used by the Payroll Office. An important role of the Human Resources Department is to maintain accurate computerised employee information for administrative purposes. Also to satisfy the University’s and other external agencies (such as the Higher Education Statistics Agency (HESA) and the Higher Education Funding Council of England (HEFCE)) need for management information. For the reasons outlined above, it is very important that you advise the relevant University departments when there are changes to your personal details which affect University records. Such key information is set out below: The Human Resources Department is responsible for taking all necessary steps to ensure that the University maintains accurate and confidential information relating to its staff. This is a legal requirement under the Data Protection Act. This responsibility is discharged through: Staff employed by the University may have a paper copy of their computerised record. All manual (paper-based) records of employee details must be stored in locked cabinets and regarded as strictly confidential. No one may have access to your record without the authority of the Head of Department/School or the Head of HR Employment Services responsible for holding such records. If you wish, you may request an appointment with your Head of Department/School or the Head of HR Employment Services for the purpose of inspecting your manual (paper-based) record. Any document such as references, recommendations and medical records, which have been supplied to the University in confidence, will be removed from your file before you are given access to it. You will be accompanied by your Head of School/Department or a member of the HR Employment Services team whilst you read any details in your manual file. You will not be able to take the file out of the office but you may ask for a photocopy, for which a charge may be made. The University will normally keep your paper-based records for 6 years (longer for Level 7 staff) from your date of leaving."
        }
    ],
    "pdf_files": []
}