{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/universitycodesofpracticeandrules/meeting-times-guidance.aspx",
    "content": [
        {
            "p": "The University has made a commitment to avoid holding key internal meetings at the start and end of the day as part of a broader commitment to good employment practice, ensuring we offer equal opportunity and access to meetings to staff with diverse working patterns and out-of-work responsibilities as far as reasonably practicable. The University’s Athena SWAN Board has agreed that internal meetings should occur, where possible, between 9.30 am - 4.00 pm, and on days of the week when the majority of affected/invited staff are due to be working at the University. Individual Schools and Departments may have local arrangements in place which further define these times to suit their needs. The guidance should be applied to key University, Faculty, School or Departmental meetings eg Management Committees, Teaching Committees, staff meetings, open meetings. It is also intended to be applied to staff-centred seminars, training events and workshops. It is not essential to hold meetings between small groups or individuals between 9.30 am - 4.00 pm or on days of the week when the majority of staff are due to be working, as long as there is agreement between the parties and all parties are empowered to influence the agreed meeting time. When such meetings are held outside of these times, there must be sensitivity as to how individuals can openly raise objections to a suggested meeting time or suggest an alternative or additional time (for example, if the meeting is a developmental activity which could run more than once). Such requests could be on the basis of caring responsibility, religious observance, health grounds or other factors which may be sensitive, so it may not be appropriate for meeting time discussions to be held during a meeting, in which case there should be opportunity for these to be raised privately instead. Decisions/changes to previously proposed meeting times should then be circulated without reference to identifiable individuals or their circumstances. We recognise that it may not always be possible to hold meetings between 9.30 am - 4.00 pm, due to the required length of meetings, the need for international engagement, or other factors. Some staff, such as those in Operation & Facilities or Technical Services roles, may have different work patterns requiring some alternative consideration. In recognition of potential challenges, a checklist has been developed which can be used when considering holding meetings outside these times. Chairs of meetings and event organisers are asked to apply the checklist of questions. Where after applying the checklist it is still considered necessary to hold meetings, workshops, seminars and training events outside 9.30 am - 4.00 pm, the following actions should be taken: Principles of good meeting management should mean that most meetings will not run past the agreed end time; however, where a meeting due to finish at 4.00 pm does overrun it should be recognised that staff members may need to leave at the scheduled end time. Meeting attendees will also often benefit from having short breaks incorporated into meetings lasting longer than an hour."
        }
    ],
    "pdf_files": []
}