{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/healthandwellbeing/psychologicalwellbeing/arrangementsforconductingareturn-to-workriskassessmentforstress.aspx",
    "content": [
        {
            "p": "The main purpose of this risk assessment is to support a staff member's return to work following a period of sickness absence, the cause of which is diagnosed by a medical practitioner as being due to work-related pressure (or stress). The assessment is intended to help identify whether there are any features of the role holder's work that could have led to the development of the work-related stress. Appropriate measures should then be agreed to prevent these from reoccurring. It is recommended that the assessment is also used as a tool to support the staff member in their return to work where stress has been diagnosed but not specifically in relation to work. The assessment should be completed jointly by the role holder and their line manager, or if appropriate with the manager at the next level up. Where possible this should be developed over the period leading up to the person's return to work, during the contact whilst absent discussed in the University sickness absence policy. This will ensure that appropriate adjustments, where required, can be put into place prior to the return to work. There is no requirement for the role holder to participate in this process although this should be strongly encouraged. Should the role holder decline the opportunity to participate then the manager should make a note to this effect. A copy of the assessment should be retained by both parties and reviewed periodically until it is agreed that no further actions are required. Further information and guidance is available from the Health and Safety Executive. They have developed extensive resource material to assist in identifying and managing stress. This material includes Management Standards, which represent a set of conditions that reflect high levels of health, wellbeing and organisational performance. The aim is to assist in identifying and closing the gap between current performance and these conditions. The following information is provided as guidance to assist in completing the assessment (see: Risk Assessment Form). The University has a statutory duty of care to its staff and through a variety of published policies establishes a framework of procedures that ensure a safe and healthy working environment within which staff can operate. A range of policies addressing specific issues that can be related to factors associated with stress are contained in the HR Guides and Support web pages. See also the University's Management of Work Related Stress Policy. The Sickness Absence Policy details procedures relating to sickness absence. In any environment, both at home and at work, people are subjected to external pressures. Not all pressures on an individual are adverse. Some people enjoy and thrive with a lifestyle that is more pressured than that which will be tolerated by others in a similar situation. These contented individuals are working within their capacity to cope. However, exceeding that capacity to cope in any individual will lead them to become stressed. is the adverse reaction displayed by a person to pressures and demands placed upon them. Stress will reduce a person's ability to function effectively and if prolonged may damage their psychological wellbeing. Stress can present many difficulties for risk assessment for the following reasons: See the list of typical sources of stress arising from work. However there are many potential sources of stress external to their role at the University, for example arising out of their personality, relationships, life events, socio-economic factors, other work activities or employment, health state etc. These need to be taken into consideration when reviewing the demands arising from their role at the University. Interventions such as counselling, stress management training, physical exercise and other \"self-help\" activities are useful to individuals but they do not eliminate the source of stress and are therefore unlikely to achieve long-term success. Examples of possible strategies to reduce stress in the workplace are:"
        }
    ],
    "pdf_files": []
}