{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/workingintheuk/academic-technology-approval-scheme.aspx",
    "content": [
        {
            "p": "As of 21 May 2021, international researchers applying to enter or remain in the UK under the Skilled Worker, Government Authorised Exchange (Temporary Work) (GAE), or Visitor visa routes must obtain an Academic Technology Approval Scheme (ATAS) certificate. This requirement applies to specific nationalities and research roles in fields where the UK government assesses potential risks related to the development of Advanced Conventional Military Technology (ACMT), weapons of mass destruction (WMDs), or associated delivery systems. It also extends to research that could enable the Intangible Transfer of Technology (ITT) relevant to WMD or ACMT programs that threaten UK national security. To be subject to the ATAS requirement, all of the following criteria must be met. All new and existing staff applying under the following visa routes must obtain ATAS clearance: No other visa routes currently require ATAS clearance. *Note: ATAS clearance is also required for time-limited visas if the individual is pursuing an ATAS-relevant in the UK (see step 4). An ATAS certificate is not required for individuals whose nationality is listed on the exempt nationalities list available here. For Skilled Worker and GAE visa applicants, the following SOC codes are subject to ATAS requirements: Additionally, the following roles are in scope, but only if the individual will conduct PhD-level research as part of the role: Managerial Teaching Technicians For university visitors applying for a Standard Visitor visa (business or academic category), the following activities require ATAS clearance: ATAS is not required for visitors attending conferences, meetings, interviews, or workshops. The field/programme of research must be classified under one or more of the following CAH3 codes: The faculty/department is responsible for providing the applicant with a completed Statement of Research for their ATAS application. As the information provided will appear on the ATAS certificate, accuracy is essential. The form must be completed in English, including the names of any overseas educational or employer institutions. New staff members requiring a Skilled Worker or GAE visa must obtain an ATAS certificate before a Certificate of Sponsorship (CoS) can be issued Existing staff members extending their stay or switching to an ATAS-required immigration route may, in some cases, receive a CoS before the ATAS certificate is available. For guidance, please contact the HR Staff Immigration team. An ATAS certificate is not required at the time of submitting a Visitor visa application. However, the visit cannot begin until the certificate is provided to the host faculty/department."
        }
    ],
    "pdf_files": []
}