{
    "url": "https://www.nottingham.ac.uk/hr/guidesandsupport/universitycodesofpracticeandrules/volunteeringschemeforstaff.aspx",
    "content": [
        {
            "p": "As part of its commitment to staff development and the local community, the University has developed a staff volunteering scheme to support, encourage and develop staff by facilitating their involvement in a wide range of local community groups, schools and similar not-for-profit sector organisations. This scheme applies to all staff groups throughout the University. The scheme has been designed to enable individual members of staff to be proactive in identifying suitable voluntary placements when, for example, they may feel they need to improve certain skills, to help them develop and progress in their role within the University. However, managers and teams can also take the initiative and consider participation in volunteering and community activities as a valuable alternative to the more traditional approach to staff development and training. Volunteering or community activities identified by a manager as meeting an individual’s or team’s specific development need may be dealt with outside of the ‘matched time’ arrangements. For example, many academic staff (and also research, administrative and technical staff) are being encouraged, through various funding councils, to enter into public engagements, as part of a school’s outreach strategy. Where Heads of Academic Units can identify voluntary work as part of such public engagement/outreach activity, it should be dealt with outside of this arrangement. The experience gained in many organisations using volunteering schemes clearly demonstrate their potential benefits to individuals and to the University. Such schemes have been shown to enhance professional and transferable skills in areas such as communication, time management, coaching and listening skills, project management, as well as increased self-esteem, confidence and pride (both in their community and in the University). Consideration will be given to releasing an individual staff member for up to 20 hours (pro rata for part-time staff) of paid time per year (paid at base rate), to participate in voluntary placements, on the condition that this is matched by the individual giving an equal number of voluntary, unpaid hours, at a time when they would normally have been at work. This means that, in any year, staff may be able to participate in voluntary placements for up to 40 hours (eg 20 hours paid, 20 hours unpaid), at a time when they would normally have been at work. Any preparation time required, prior to taking part in the placement, can also be included in these 40 hours. Staff must have been in employment at the University of Nottingham for at least one year to receive paid time off to participate in a volunteering placement. If they have been employed for less than one year they can volunteer for a placement, but all participating hours during their normal working day will be unpaid. Where the agreed voluntary placement takes place within the individual’s normal working day, the individual must have prior approval from their manager for the days/hours they can be released from work. The individual will normally arrange with their manager to ‘make up’ the hours, at a time agreed between them. Only if it were not possible to make up this time, would a manager arrange for the unpaid hours to be deducted from the individual’s next salary payment. In both above examples, the exception is where the time cannot be ‘made up’. The individual will then have the appropriate time (eg in example 1 above – 1.5 hours and in example 2, 30 minutes) deducted from the next appropriate salary payment (this deduction must be agreed between the individual and their manager). Where staff do not have regular working hours or a regular working pattern specified in their contracts, they should agree with their manager when they will undertake the placement. In such an arrangement the appropriate personal voluntary ‘unpaid’ contribution time must also be identified and agreed between the individual and their manager. The cost to the School/Department, as well as the release of staff from work to participate must be balanced against other demands and priorities of the School/Department and as such, paid or unpaid time-off for this purpose,is not an entitlement. Where an individual considers that participating in a voluntary placement may provide job-related experience and development, which helps them to meet an identified development need linked to their role, they should first have an informal chat with their line manager to confirm this and explore how the volunteering placement may work in practice, ie agree days/hours when they can be released from work, how they will make up the hours, etc. Following the informal chat, the individual will submit a request for volunteering leave through UniCore. The individual’s line manager will need to approve the leave. This must be done in advance of any voluntary placement. If the individual does not have access to UniCore, then their line manager or designated person can enter the leave on the individual’s behalf. The individual (or where applicable manager/team) should also identify the development needs/learning objectives which they hope will be met through taking part in any voluntary placement. Professional Development can offer support for anyone wishing to have a conversation about how the voluntary activity might support meeting a development need. After discussion with the individual/team members, the manager will make the final decision as to whether the proposed voluntary activity is an effective tool to address the identified staff development need. It should be noted that participation in the scheme should be jointly agreed by both parties ie the individual and the manager. Both the manager and the individual are encouraged to look flexibly at working arrangements to enable participation in a voluntary activity to take place. Managers should give all requests to link an identified staff development need of an individual with participation in a voluntary placement serious consideration and should manage voluntary placements in as flexible a way as possible. The volunteer placement agreed upon by the individual and their manager must then be agreed, and arranged, by the individual. In the case, of team participation in a volunteering activity, it might be more appropriate for the manager to be involved in finalising the details of the activity. A review of the volunteering placement should be undertaken to ensure that it is achieving the desired development needs/learning objectives. Where the placement is long-term, regular scheduled reviews should be put in place. There may of course be business/operational reasons for refusing a request, which the manager should explain to the individual. The individual may see if an alternative placement or time can be arranged and bring this back to the manager for further discussion. There may also be instances where an individual has commenced a placement but, due to operational difficulties, it is no longer feasible for the individual to continue, or the outcome of a review demonstrates that the placement is not addressing the identified development needs. In these circumstances, the manager and the individual should discuss the situation, looking at the available evidence. The final decision to commence, continue or cease a placement is at the discretion of the manager. UniCore must be updated with any changes."
        }
    ],
    "pdf_files": []
}