{
    "url": "https://www.nottingham.ac.uk/hr/pensions/joining-the-university.aspx",
    "content": [
        {
            "p": "Upon joining the University, all staff are entitled to pension membership and will be enrolled (either contractually or under Government auto enrolment rules) to the appropriate pension scheme. You will then have a choice of either remaining in the scheme or of opting out from contributing. For all schemes operated at the University, any contributions made into a scheme can be refunded for the first 3 months. Where you have been auto enrolled, all the relevant details will be sent to you at this time. After this, it will depend on which scheme you have been enrolled in: Please note that where you requested to have your contributions refunded, only your own personal contributions will be refunded and you will lose any contributions made by the University. For further details about this, please contact the Payroll & Pensions team, who will be able to take you through this in more detail and guide you as appropriate. Under the Pensions Act 2008, every employer in the UK is required by law to put its staff into a workplace pension scheme and contribute towards it. This is called “automatic enrolment”. This automatic enrolment into a pension scheme must take place both at the start of your employment at the University and then on a 3-yearly cycle, which falls in line with the University’s agreed cycle (which may not fall exactly 3 years after your first auto enrolment into a pension scheme). Under these obligations, the University of Nottingham completes its auto enrolment process for all staff, with the next main cycle (called the cyclical auto enrolment date) on or around May 2022. Whilst the University must enter you into the appropriate scheme at this date, you can subsequently choose to either remain in the scheme (see individual scheme details for contribution rates, etc) or to opt out. For all schemes, we are able to refund the first 3 months contributions. After this point, scheme rules and how contributions are made will impact any future ability to refund deductions. Please be aware that paying via salary sacrifice will mean that, from that point, contributions cannot be refunded. Information will be provided nearer the time detailing exactly what this means for you and what your specific options are, but if you have any further questions please contact the Payroll & Pensions team who will be able to support you."
        }
    ],
    "pdf_files": []
}