{
    "url": "https://www.nottingham.ac.uk/hr/pensions/saving-extra.aspx",
    "content": [
        {
            "p": "All of our pension schemes offer the option to pay additional contributions to provide extra benefits on retirement. Additional Voluntary Contributions (AVCs) are a way to save money for your retirement in addition to your main pension. For the University of Nottingham pension schemes, any AVCs will be deposited into a defined contribution (DC) pension scheme. Unlike a defined benefit (DB) scheme, where the benefit you receive is defined by the scheme rules, in a DC scheme, AVCs are invested so they have the potential to grow over time. It also means the value of your investment can go down as well as up and you may get back less than you put in. The specific options available to you will depend on the pension scheme you are in. For more details, please contact your pension scheme provider. The Lifetime Allowance (LTA) is a limit on the amount of pension benefit that can be drawn from your pension scheme(s), whether through a lump sum or retirement income, which can be paid without triggering an extra tax charge. The lifetime allowance for the tax year 2021/22 is £1,073,100. While most people are not affected by the lifetime allowance, you should take action if the value of your pension benefits is approaching, or above, the lifetime allowance. As pensions are normally a long-term commitment, what might appear modest today could exceed the lifetime allowance by the time you want to take your benefits. It may be necessary to take your pension early or stop contributing to the scheme/plan, even though you have not retired, to avoid your benefits exceeding the lifetime allowance. The test for the lifetime allowance is done each time you access a pension benefit. You can also find more information about when the lifetime allowance applies and how it may affect you, on the Gov.uk web site. The annual allowance is a limit to the total amount of contributions that can be paid to defined contribution pension schemes and the total amount of benefits that you can build up in defined benefit pension schemes each year, for tax relief purposes. The annual allowance is currently capped at £40,000 (2021/22) although a lower limit of £4,000 may apply if you have already started accessing your pension. The annual allowance applies across all of the schemes you belong to. It is not a ‘per scheme’ limit and includes all of the contributions that you or your employer pay or anyone else who pays on your behalf. If you exceed the annual allowance in a year, you will not receive tax relief on any contributions you paid that exceed the limit and you will be faced with an annual allowance charge. The annual allowance charge will be added to the rest of your taxable income for the tax year in question when determining your tax liability. Alternatively, if the annual allowance charge is more than £2,000, you can ask your pension scheme to pay the charge from your benefits. This means your pension scheme benefits would be reduced. You may be able to bring forward any unused annual allowances from the previous three tax years, to either reduce your annual allowance charge to a lower amount or reduce the annual allowance charge completely. More details are available on the web site of your pension scheme."
        }
    ],
    "pdf_files": []
}