{
    "url": "https://www.nottingham.ac.uk/hr/your-benefits/a-z-of-benefits/benefits-a-z.aspx",
    "content": [
        {
            "p": "Dependent on length of service, we offer enhanced adoption leave and pay above what we are required to by law. See our Maternity web pages for more information. You are entitled to a generous annual leave entitlement which is summarised on the Annual Leave web page. You are also entitled to 8 statutory public holidays and 5 discretionary days, customarily taken between Christmas and New Year. This is pro-rated if you work part-time, or full-time for only part of the year. The Annual Leave Purchase Scheme is due to be launched in August, with a 6-week enrolment period running from Monday 16 August to Friday 24 September. Eligible staff will be able to purchase up to 1 week of additional holiday (pro-rata for part time staff) for the 2021/22 holiday year. Back to A-Z listing All campuses provide retail outlets, with most having banks and a range of shops. An extension to the Portland Building on University Park campus has ensured that the building is a hub of activity, housing shops, banks, bars and restaurants. Information on cycling at The Univeristy and the bike schemes available can be found on the Cycling web page. There are Blackwell's bookshops located on most campuses, offering a 10% discount on all purchases for staff. Just show your staff card at the till. The University provides a regular hopper bus service for staff and student travel between campuses. From the latest research and industry collaborations to staff and student achievements, Campus News features news and views from across the University. Please log-in to the Employee Hub for more details. Our online Car Share Scheme enables University staff to search for someone who goes their way so they can share their journey to work. It’s free to join, and by taking part, you can make significant savings on the cost of travel and help to reduce congestion and pollution. Career breaks are typically used to pursue personal interests, such as travelling, volunteering or personal development. They can also be used to provide a period of care for a dependant. See the Career Breaks web page for more information. This policy enables staff to provide substantial full-time care for a dependant relative. See the Long-term Carers Leave we bpage for more information. A range of onsite catering and bar facilities serving hot and cold dishes, sandwiches, snacks and drinks are available. There are also vending machines at many locations across campus. Although we are a secular organisation, we respect the right to freedom of religious belief. Our Chaplaincy offers spiritual and religious advice and information for people from all world faiths. We offer staff access to quality child care services, provided by the University's child care services located on campus. To support staff with child care costs, we offer Child Care Extra (a childcare voucher scheme) in conjunction with Edenred (UK group) Limited - this provides parents with a tax-efficient way of paying for child care. The University closes in the week between Christmas and New Year. See the Bank Holidays web page for details. Find out more about the wide range of IT and Library services available to students and staff at the University of Nottingham. From setting and changing your password and setting up wireless on your smart phone, to finding electronic resources and library opening times, you can find out more on the Information Services web page. The Counselling Service is a free service for staff and students of the University of Nottingham. The service can provide support through offering confidential, professional help with personal, emotional or mental health problems. The University's Health Service is based in Cripps Health Centre, which also contains a dental practice, occupational health and a Boots pharmacy. We are committed to creating a positive workplace and learning environment and have a range of practices and policies to support this aim. See the Dignity within the University Policy for more information. We offer staff the opportunity to purchase reduced price bus, tram and rail travel passes via monthly salary deductions. For more information, see the Discounted Staff Travel web page. We've teamed up with Sodexo, one of the UK's leading voluntary benefits providers, who have negotiated withleading high street retailers to give staff access to exclusive discounted products and services. Staff can take advantage of a range of special offers and discounts available on an extensive range ofproducts and services including clothing, home entertainment, holidays and travel. See the Employee Hub for more details. The Employee Hub gives you access to an improved range of discounts and benefits. We are committed to becoming a leading green university. We are building on our teaching, research and operational excellence to achieve this. See the Sustainability web page for more. We value diversity and are committed to maximising disabled access and maintaining an environment which is free from bullying and harassment. We actively promote equality and diversity via face-to-face training, an e-learning programme and regular events. See the Equality and Diversity web page for more information. We have teamed up with Boots opticians to offer free eyesight tests for users of display screen equipment. We host a range of events from academic seminars, to campus walks. Staff can pay University of Nottingham course fees in instalments. See the tuition fees web page for more information. We are committed to the promotion of a healthy worklife balance for all staff and recognise that flexible working arrangements can help to provide a positive working environment and more flexible workforce. There are many varied free events and activities throughout the year - from guided campus walks to lectures and speakers. Find out what's going on through notice boards and Campus News. We offer a reduced tariff for staff organising University events on campus and on venue hire for organising private events, which are due to take place within the next 6 months. Contact Gayle Timmins, Events Manager, for more information. We are proud of our award-winning campuses and continual investment in our surroundings ensures that the working experience is the best it can be. Find out more at the Grounds and Gardens web page. We are committed to sustainable development and are actively reducing our carbon-footprint, promote recycling and encourage walking, cycling and use of public transport. We run a Cycletowork scheme and a Ucycle scheme, as well as offering several other resources for cyclists. Other initiatives include interest-free loans on annual rail passes, and a number of discounts on bus travel. The University offers voluntary healthcare schemes with the assistance of an external healthcare consultant and have negotiated a discount with PHC, part of the AXA group. If it is a cash plan you would prefer, the University offer Westfield Health. For more information, or to apply online, visit Westfield Health and enter the code DPXJ when prompted, or call 0845 602 1629. See 'Annual Leave' At Nottingham we are proud that the philanthropic gifts we receive are used to benefit the lives of so many people, from our students on campus to poor communities in the developing world. This is due to the crucial support we receive every day from our alumni, friends and staff. Staff giving is an important part of any university fundraising campaign and Impact: The Nottingham Campaign is no different. Apart from the obvious ways of donating, staff have a number of additional methods. Find out more on the Impact web site. This fund is designed to financially assist all members of staff undertaking vocationally relevant courses/qualifications, where no equivalent internal provision is available. Various forms of insurance are available for when on University business. These include travel insurance, computer insurance and car insurance. Private medical insurance and private dental insurance can also be taken out as a voluntary benefit at a discounted rate. Find out more about the wide range of IT and library services available. From setting and changing your password and setting up wireless on your smart phone, to finding electronic resources and library opening times, you can find out more at the Information Services web page. The University provides a wide variety of courses from beginner to advanced level. These are open to all staff and research postgraduates and are free to attend. We support job sharing and have a job share policy in place. Our dedicated jobs site updated daily. We are committed to providing all our staff with appropriate development opportunities to help staff develop the skills, knowledge and competencies you need to contribute fully to the continued success of the University. For more information, visit our Professional Development web pages. Our Languages for All (LFA) programme offers a range of reasonably priced foreign language courses. These range from beginners to degree standard and are held at a variety of times to suit you. There are 8 libraries across the University's UK campus, plus those in Malaysia and China. Staff need a University or Library Card to use the collections and facilities at all libraries. A long service award scheme exists for staff members who have completed 25 and 40 years' service with the University. For more information, contact Human Resources. Dependent on length of service, we offer enhanced maternity, adoption and maternity support pay above what we are required to by law. For more information see the Maternity web pages. Find out more about our in-house Mediation Scheme - an informal and confidential service for handling and resolving any workplace disputes or conflicts. We offer discounted rates on private medical insurance, private dental insurance and health screening. From time to time, we also offer medical services such as flu jabs, osteoporosis testing, etc at highly competitive rates. Staff Networks are open to all staff and form an important part of the consultative process across a wide range of workplace issues. Networks are independent of HR, led by members of staff, and seek to provide information and support to colleagues who might appreciate an informal, confidential, peer-run environment. We currently have five Staff Equality and Diversity Networks: Occupational Health provide independent specialist medical advice to staff and their managers on the relationship between work and health, eg managing medical conditions to remain at work, return to work, or managing a disability. Our campuses have car parking facilities. Dependent on length of service, we offer enhanced maternity support pay above what we are required to by law. See the Maternity web pages for more information. We aim to develop and implement a transparent reward strategy to ensure that all staff are paid a fair and competitive salary as well as non-pay benefits. Our Nottingham Reward Scheme rewards exceptionalperformance as part of our reward strategy. Pay awards to recognise cost of living increases are negotiated nationally, through the Employers' Association UCEA and national trade unions. Depending on your grade, you can join one of two final salary pension schemes: No results As part of its commitment to sustainable travel, the University will fund an interest free season ticket loan (up to £5,000) on Annual Rail Passes for those employees who travel to work by train. We recognise the importance of career progression and giving you opportunities to excel in your chosen career. We believe that employees who are given the opportunity to excel in their careers, in turn have higher levels of job satisfaction and contribute to a positive working environment. Our re-grading and promotions procedures demonstrate our commitment to support you in your career aspirations. In certain circumstances, staff are given financial assistance towards the cost of moving house to come to work at the University. If you qualify for this, it will be detailed in your contract of employment. The Safety Office is responsible for providing advice and support to all Schools/Departments, to ensure a safe working environment for all staff, students and visitors. All campuses provide retail outlets, with most having banks and a range of shops. A recent extension to the Portland Building on University Park campus has ensured that the building is a hub of activity, housing shops, banks, bars and restaurants. We provide considerable support to all staff in times of sickness and personal difficulties and offer competitive sick pay above the statutory minimum, which increases with your length of service. We have an extensive range of sports facilities which are open to staff and their families. Our sports centre (which includes a fitness suite) has competitive membership rates and caters for a wide variety of track, field and team sports. All University staff can purchase a card that gives them access to numerous exclusive offers and discounts from many popular retailers. Click here for details. We are committed to working in partnership with recognised trade unions and you have a right to belong to a trade union of your choice. We are committed to providing all our staff with appropriate development opportunities to help staff develop the skills, knowledge and competencies needed to fully contribute to the continued success of the University. For more information, visit our Professional Development web pages. The University has excellent transport links by road, rail and air. We are committed to widening participation in higher education. To help achieve this, we offer a wide range of activities for schools, parents and teachers. The wireless network allows anyone with a University of Nottingham username and password to get wireless internet access from any of the Wireless Hotspots across campus. We acknowledge that flexibility to balance both work and home life are seen as a vital aid to the recruitment and retention of skilled and competent employees, as well as promoting job satisfaction and staff commitment. Worklife balance empowers employees to fulfil their career aspirations at the University as well as meet their responsibilities outside of work. The University hosts a wide range of Public Lectures, Exhibitions, Music, Theatre and Dance. All details can be found on Campus News."
        }
    ],
    "pdf_files": []
}