{
    "url": "http://www.nottingham.edu.my/HTML-emails/Alumni/Life-Cycle-Malaysia-3.aspx",
    "content": [
        {
            "p": "It’s time to mark your calendar for cycling! We are organizing Life Cycle Malaysia 3 for the third consecutive year in Malaysia. The Nottingham Life Cycle is an annual community charity bicycle ride initiated by the Vice-Chancellor of University of Nottingham, Professor Sir David Greenaway, in 2011. Inspired by the significant change the event brought to research in UK, we are organizing Life Cycle Malaysia 3 to support education of the disadvantaged communities. As one of the top 1% of Universities worldwide, the University of Nottingham is proud to be providing outstanding educational opportunities for students worldwide, to empower them to “change the world”. We are firmly committed to making such opportunities available to all those who can benefit from them and who can truly make a difference to our society. Improving access to higher education for disadvantaged communities in Malaysia and beyond will enable them to make a positive impact in society and in the world at large. We are pleased to invite you to join the UNMC’s Senior Management, staff, students, friends, family and alumni to participate in Life Cycle Malaysia 3, scheduled as below: Date : Saturday, 15 October 2016 Time : 6.30am-11am (flags off at 8am) Venue : Trent Building, University of Nottingham Malaysia Campus (UNMC) LET’S GO THE EXTRA MILE TO SUPPORT THE EDUCATION OF THE DISADVANTAGED! Join us for a leisurely and enjoyable 12km or 20km easy bicycle ride through the scenic route around the University. The registration fee for cyclist is RM30 (without tee-shirt) and RM60 (with tee-shirt), and it includes a light refreshment and the awesome ride! Due to popular demand, we are extending the registration date to 25 Sept 2016. Sign up now! Check out the amazing video and gallery for: Life Cycle 1 (2014) – Video | Gallery Life Cycle 2 (2015) – Video | Gallery Life Cycle 3 (2016) – Join us! Meanwhile, do check out Life Cycle 6 Nottingham UK in support of breast cancer research. Help us by donating to make a difference; to empower disadvantaged communities by providing access to education. For further information, call us at: 03-8924 8305 or 03-8725 3665. We look forward to hearing from you soon. Yours sincerely, Alumni & Donor Relations Office Copyright Terms & Conditions Privacy and Data Protection Accessibility"
        }
    ],
    "pdf_files": []
}