{
    "url": "https://www.nottingham.ac.uk/humanities/departments/history/facilities/facilities.aspx",
    "content": [
        {
            "p": "Our history department is situated near the west entrance of University Park Campus in Lenton Grove, an attractive Grade II listed, 18th-century building. The building was refurbished for the Department of History, to provide staff offices, teaching rooms and a computer suite. Today, most teaching takes place in Lenton Grove with some classes happening in the adjacent Humanities building. The Digital Transformations Hub in based in the Humanities building. It provides resources, expertise and support in using digital methods for learning, teaching and research. Resources include book scanning, a slide library, design software, and digital equipment which can be borrowed by students. More about the Digital Transformations Hub Manuscripts and Special Collections is the University of Nottingham's library archive containing mediaeval manuscripts, maps, posters, photographs, rare printed books and music. It is based at Kings Meadow Campus which you can get to in 10 minutes from University Park via the free Hopper Bus. More about Manuscripts and Special Collections Our main library is Hallward Library, located in the centre of University Park Campus, 7 minutes walk from Lenton Grove. Our libraries offer a range of virtual and physical facilities including study spaces, books, e-books, journals, e-journals, articles and databases. More about our libraries All students have access to a computer suite situated in Lenton Grove, offering PCs and a laser printer. This facility is accessible 24 hours a day. There are additional computer facilities in the Humanities building. The university also provides students with access to general IT facilities as well as those with specialised equipment such as text and image scanners, colour printing and high powered Unix workstations. Such areas are located around the university in the libraries, and in a number of Smart Bars which offer in-person or virtual IT support to help students resolve queries on the spot. The house is a plain stucco villa, built probably in the 1790s by Francis Evans, a Nottingham attorney. Homes such as these were for wealthy local business people, built on country house principles with a limited surrounding acreage. More recently, Lenton Grove has been altered, with irregular classic, neo classic and Victorian additions. In the 1950s, alterations were made for the then occupants, the School of Music. These included an extension to the original stable block by the addition of a simple two-storey brick construction, which housed a music auditorium. The Department of History moved to Lenton Grove in 1995. Contact details Twitter"
        }
    ],
    "pdf_files": []
}