{
    "url": "https://www.nottingham.edu.my/Humanities/People/nabila.shariff",
    "content": [
        {
            "p": "Assistant Professor, Student Experience Officer, Nottingham Advantage Award Academic Lead (Malaysia), Faculty of Arts Nabila teaches modules at the Foundation level. Before becoming a part of CELE at the School of Education, she taught at Harmony Language Centre in Kuala Lumpur in the capacity of ESL Instructor and teacher trainer. She taught and supervised EAP courses for pre-University students. Prior to that she held the post of Lecturer (also teaching pre-University EAP modules) at the International Islamic University in Malaysia, which is also where she obtained her Masters Degree in TESL. Nabila has a Cambridge teaching certificate (CELTA), which she successfully completed shortly after her Masters. Nabila is currently deeply invested in the mental wellbeing of Arts Foundation students as a Personal Tutor. She is part of the Personal Tutoring programme that affords students a tutor to aid/guide them in setting academic targets and in successfully achieving these targets.She is working closely, as are her colleagues, with the current Disability Liaison Officer to ensure students with special needs are given provisions to enable them to reach their full academic potential in an encouraging and non-threatening environment. Nabila's research focus for her Masters was on educational software used to promote and stimulate more effective learning at primary school level.The areas she was particularly interested in were comprehensive reading skills for younger students, and how this could be enhanced and made more effective (as well as interactive) using specific kinds of software. Nabila currently convenes the following modules: ARTFF002 Written Communication and Study Skills (compulsory) ARTFF015 Foundations in Educational Technology (optional) She also teaches other Foundation modules that are centered around Writing, Speaking and Listening. Apart from Foundation modules, Nabila convenes and teaches Intercultural Awareness, a four-session course among the Nottingham Advantage Award (NAA) modules. telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}