{
    "url": "https://www.nottingham.edu.my/Humanities/People/natrah.noor",
    "content": [
        {
            "p": "Assistant Professor, Research & Knowledge Exchange Committee, Faculty of Arts Natrah has taught a range of courses from foundation to undergraduate modules in public and private universities in Malaysia and abroad. She was previously affiliated with King AbdulAziz University (KAU) in the Kingdom of Saudi Arabia, the International Islamic University Malaysia (IIUM), and SEGI University Malaysia. Natrah holds a PhD from the National University of Malaysia and a Master's Degree from the University of Malaya. Natrah's research interests are broadly focused on the use of language beyond context, particularly in the representation of marginalised group. She is particularly interested in applying the Critical Discourse Studies (CDS) approach to explore and investigate the ways in which systemic power, dominance, and inequality are enacted, reproduced, and resisted through language. Natrah Noor, and Bahiyah Abdul Hamid, Normalis Hamzah (2022) The Myth of Choice in Maryam Lee's Unveiling Choice. GEMA Online Journal of Language Studies., Vol. 22 Issue 4, p59-75. 17p. Natrah Noor, and Bahiyah Abdul Hamid (2021) Cyberbullying in the name of God : critical discourse analysis of online responses to the act of de-hijabbing in Malaysia. 3L; Language,Linguistics and Literature,The Southeast Asian Journal of English Language Studies., 27 (4). pp. 215-229. ISSN 0128-5157 Natrah, N. and Hamid, B.A. (2019) Representation of Sex Workers in Malaysian Media: Critical Discourse Analysis. In: Proceeding of International Conference on Humanities (ICH 2019) Natrah, N. (2018) Beyond Language Support: The Impact of English Mentoring Programme on Tertiary-Level Student Mentors. In: Proceeding of 27th MELTA International Conference Natrah, N. (2015) Self-Other Representation of Sex Workers in Malaysia (Unpublished master's dissertation), University of Malaya, Malaysia telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}