{
    "url": "https://www.nottingham.edu.my/Humanities/CentrefortheStudyofCommunicationsandCulture/CSCCResearch/Watching-the-Watchdog-2018.aspx",
    "content": [
        {
            "p": "The Centre for the Study of Communications and Cultures (CSCC) at the University of Nottingham Malaysia Campus will monitor media coverage of the 14th general elections in collaboration with Universiti Sains Malaysia.The one-month long project will gauge media performance in its treatment of political figures and parties as well as key policy and economic issues, electioneering and gender representation, among others. It will cover the period between the dissolution of Parliament and a week after the election results are announced. The independent monitors, who are made up of volunteers from all over Malaysia including members of the public, academics, and students, will also analyse the framing of identity politics during the elections. The main objective of the project is to assess the contribution of the media in encouraging a more critical and discerning Malaysian citizenry, especially with the growing influence of internet-based information related to politics and governance. The project builds on the 2013 Watching the Watchdog initiative with the Centre for Independent Journalism, which analysed the coverage of 28 news sources from the state and private media, including online news portals. The current project is targeted at maintaining the similar scale of coverage to ensure adequate representation of information sources in four languages – English, Bahasa Malaysia, Mandarin and Tamil. The 14th general elections in Malaysia will be an interesting site for analysis of how the sources of information will compete, complement or even clash with each other in drawing the attention of voters and other audiences against the backdrop of the recently tabled Anti-Fake News Law. Concerns about disinformation and fake news are expected to dominate the political narrative, making it even more urgent to understand media and society relations during this crucial period. It is vital that we use an evidence-based method to document media performance and accountability over the years and provide information that can be used by the public as well as the media to raise the standards in reporting. The news media sources that will be analysed include TV1, TV2, Astro Awani, TV3, ntv7, 8TV, TV Okey, New Straits Times, The Star, The Sun, Harian Metro, Sinar Harian, Utusan Malaysia, China Press, Oriental Daily, Sin Chew Daily, Makkal Osai, Malaysian Nanban, Daily Express Sabah, Utusan Borneo, See Hua Daily, Borneo Post, Malaysiakini, Malay Mail Online, and Bernama. The project expects to release interim findings to the public ahead of election day. The full data set will be analysed and a comprehensive report published after the elections. For more information, please contact Gayathry Venkiteswaran (019-7257970) or Lim Hong Siang (016-2267977). For information on the 2013 project, click here. telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}