{
    "url": "https://www.nottingham.edu.my/Humanities/Language-Centre/Modules/Japanese.aspx",
    "content": [
        {
            "p": "Japanese courses have been offered at UNM since 2005, and over 600 students have studied Japanese, and some graduated students are continuing to study their own specific areas in Japan. The Japanese tutors’ approach is to combine the four skills in each class to establish language skills as well as to input cultural content to explore real-Japanese exploiting multimedia resources such as the Language Labs and Moodle which are used to expand our teaching methodologies and encourage the students to acquire not only communication skills but also academic learning technics capable of enhancing their career options in their professional lives after graduation. Japan have assimilated a lot of culture from China and have also been influenced by other countries and created their own culture. To find similarities and differences with Japanese culture through learning the Japanese language may lead you to develop a more global perspective. While considering the various dimensions of Japanese society in Asia and the world, studying Japanese at UNM also offers the chance to develop skills and competencies in a broad range of social and cultural areas of interest that include for example Japanese custom, cinema and popular culture. Therefore, we offer outside of class activities to build up the Japanese language learners’ community to encourage students who are willing to get extra knowledge and further experiences. みなさん、こんにちは。ノッティンガム大学マレーシア校へようこそ！ The Japanese Department of the School of Media, Languages and Cultures (SMLC), University of Nottingham Malaysia (UNM) has received a grant from Toshiba International Foundation (TIFO), Japan, to promote the reception of Japanese literature among university students in Malaysia for the fiscal year of 2023-24. Through the grant, hundreds of Japanese literary books are made available for the public. The collection of Japanese literary books procured comprises all sorts of genres, such as fiction, novels, short stories, essays, and history; written by authors from the early 20th century to the contemporary era. For instance, the complete works of notable writers such as Akutagawa Ryūnosuke, Miyazawa Kenji, Dazai Osamu, and Kawabata Yasunari; as well as winners of the Akutagawa Prize and Naoki Prize. Students at the UNM will be able to explore the exciting world of Japanese literature through accessing these books at the UNM library; while students and public outside of the UNM community can borrow the books in hard copies for 2-6 weeks via inter-library loan. Inter-library book loans are free of charge, but delivery fees will be charged accordingly. After searching for the book on the UNM Library website, please contact Dr Leong Yut Moy (yutmoy.leong@nottingham.edu.my) with the info of the item. Please feel free to explore the items on the book list available below as well. (Book list will be updated according.) The Japanese Department of SMLC is passionately committed to enhancing Japanese literary awareness and reception within the Malaysian higher education community. We hope to reach out to as many academic institutions as possible through the TIFO grant. Should you have any queries about the TIFO Japanese literary book collections, please do not hesitate to contact Dr Leong Yut Moy (yutmoy.leong@nottingham.edu.my). Book List (Please refer to the book list word file) (Book list will be updated accordingly) 9784101002415 川端康成 掌の小説 (新潮文庫) telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}