{
    "url": "https://www.nottingham.ac.uk/humanities/departments/classics-and-archaeology/facilities/facilities.aspx",
    "content": [
        {
            "p": "As well as the excellent general facilities available to all students, we also have some specialist ones for Classics and Archaeology students. This includes six laboratories, where you can get valuable hands-on experience with human, animal, plant and material culture remains. Emily LeHegarat, Archaeology BSc Read more about Emily's experience We have an impressive suite of facilities dedicated to research and teaching in archaeology. They were fully refurbished in 2023, including the installation of some state-of-the-art analytical equipment. You will receive training in a range of archaeological science techniques and develop advanced analytical skills, depending on your interests. Used by all staff and students for practical classes, small group teaching, seminars and networking. This lab is the heart of our archaeological community. It is a focus for knowledge sharing, and our informal hang-out. Dedicated study and lab group sessions allow staff and students to share the latest research, work through problems, and share news and events. This lab houses our zooarchaeological reference collection – come and learn how to analyse animal bones from the archaeological record, and why this is such an important source of information about the past. This is where you will learn about ancient technologies, from the earliest stone tools to the development of ceramics, metal and glass material cultures around the world. You will also learn about dyes, pigments and perfumes and how these were created in the past. You will learn through experimentation, replication and analysis – there are opportunities to knap flint, fuse glass, fire pottery and create your own perfumes, depending on the modules you choose. Alongside our kit for analysing ancient materials, we also have a suite of equipment that allows us to analyse soils, sediments and peats to interpret ancient environments. This space is dedicated to the imaging and visual analysis of archaeological materials. In it, you will learn to create publication quality photographs and digital 3D models, visualise and analyse ancient landscapes, and use X-rays in non-destructive techniques to analyse a range of evidence. It houses a number of collections we use for research and teaching, including our growing plant, stone tool and ceramic reference materials. This is where you will learn to analyse human and non-human remains, understanding activities, health and behaviours of past people and animals. Looking at a range of species together, and analysing them in the same ways, is revolutionising our understanding of the past, because it means we are not always focussing solely on the human story; we have always shared the planet with other living things! It is set up for small group, practical teaching, which means that everybody gets to participate and learn. Our teaching resources will help you become familiar with skeletal materials, so that you understand what these can tell us about the past. This lab allows us to prepare samples for isotope analysis – techniques that tell us about the diets and movements of people and animals in the past. Here you can help create data that allows us explore how human-animal-environment relationships have changed, why, and with what consequences for the future. This lab has a full suite of equipment that allows us to prepare samples for isotope geochemistry and radiocarbon dating. We take samples from bones and teeth, and isolate the materials in them that can show us you really are what you eat. In addition to our dedicated labs, we also have a collections room, containing artefacts used in research, practical sessions and other teaching throughout our modules. The University of Nottingham Museum is home to a collection of archaeological artefacts of all periods from Nottinghamshire, Derbyshire, Lincolnshire and Leicestershire. The Museum collections are a valuable resource for research, teaching and learning in the department. You will enjoy visits to the exhibits, learning from the museum professionals and analysing the collections in our labs. Visit the Museum website The Digital Transformation Hub provide resources, expertise and support in using digital methods for learning, teaching and research to Faculty of Arts staff and students. Visit the Hub website Heritage Science is a fast growing, interdisciplinary field where cutting-edge scientific techniques are used to study cultural and natural heritage. University of Nottingham is nurturing a new network of heritage science services, technologies, capabilities, and collections. The Nottingham Materials and Environment Science and Heritage Laboratories are known as the N-MESH Labs. N-MESH is a partnership between the Department of Classics and Archaeology, with its newly refurbished labs and equipment, and other facilities across the University, including laboratories and capabilities in Life Sciences and in Medicine and Health Sciences. Find out more about N-MESH Contact details Archaeology twitter Classics twitter"
        }
    ],
    "pdf_files": []
}