{
    "url": "https://www.nottingham.ac.uk/humanities/edi/equality-diversity-and-inclusion.aspx",
    "content": [
        {
            "p": "The work of the School's Equality, Diversity and Inclusion (EDI) team aims to encourage staff and students to recognise their full potential, feel valued, and lead successful and fulfilled lives. \"We're in the process of setting up the committee for this year and determining our priorities. We're really keen to hear from staff/students in the School with any thoughts you have about how we can make Humanities a more welcoming and inclusive place; please fill in our anonymous form (responses will be available on the EDI Sharepoint page) or email jonathan.robson@nottingham.ac.uk or sasha.garwood1@nottingham.ac.uk with your ideas.\" Katie Monk, Sasha Garwood and Jon Robson We are responsible for implementing EDI initiatives across the School, within the context of University and Faculty EDI policies, collaborating with other groups in the School and further afield. These include: The Committee meets termly and has several affiliated working groups. The Faculty of Arts EDI Board (FEDIB) meets three times a year. It is chaired by the Faculty PVC Professor Jeremy Gregory. School EDI Directors report to FEDIB, and this board reports to the Faculty Executive Board. The Faculty’s Director of EDI is Laura Todd (CLAS) and Mosina Susiwala is Faculty EDI Coordinator. Professor Katherine Linehan is PVC for EDI. Read Katherine's blog. Lorna Collison, Personal Assistant to Head of School Aoife Conroy, Faculty Education and Student Experience (ESE) Lisa Dearing, School Management and Research Office (SMRO) Sasha Garwood, Joint School Director of EDI and Foundation Year EDI lead Ally Heery (she/her), Operations Manager Chris King, School Director of Education and Student Experience Duncan MacLeod, Disability Liaison Officer Katie Monk, Joint School Director of EDI and Philosophy EDI lead Kate Packer, Faculty Education and Student Experience (ESE) Hannah Thuraisingam Robbins, Centre for Black Studies Lauren Robinson, Access and Participation, Education and Student Experience Jon Robson, Joint School Director of EDI Will Skinner, School Management and Research Office (SMRO) EDI lead Jonathan Tallant, Head of School School Student EDI Project Group. Coordinators Robin Melvin (they/them) and Tobi Soyannwo (he/him) The School of Humanities has been granted an Athena Swan bronze award. The Athena Swan Charter is a framework which is used across the globe to support and transform gender equality within higher education (HE) and research. Find out more about the Athena Swan charter. Contact details"
        }
    ],
    "pdf_files": []
}