{
    "url": "https://www.nottingham.edu.my/Humanities/Language-Centre/Learn-Korean/main.aspx",
    "content": [
        {
            "p": "Have you ever wondered what the circle looking shape ㅇand the square looking shape ㅁ mean in Korean language? Have you ever thought they rather look like math symbols or drawings than an actual language? Wonder no more! We offer you a basic level of Korean course, teaching you from A to Z ( I mean from ㄱ toㅎ ! eh-hem!) Also, if you wanted to join the elective Korean 1 modules but could not due to the limited seats, this is a good chance for you to come – and here you do not need to worry about tests! Follow steps to be able to do the final assignment at the end! Plus, watch some clips, and learn together, what fun will it be! This course consists of 15 lessons. Each lesson includes a lecture, exercises, and video clip watching. There will be supplementary materials for students to do as homework. We strongly recommend completing all the worksheets for each section. Research has shown that doing homework after learning a concept will help the student learn the material quicker. What will I get out of this course? On successful completion of this course, you will be able to: PDF files of textbooks, along with exercises (also PDF files) will be provided, and students are strongly recommended to do homework as the teacher instructs. Visual materials will also be provided. At the end of the course, students have to present on a topic (3-5 mins) in Korean as a final assignment. Class will start from 31 May 2021 to 30 June 2021 Duration: 4 weeks: 2 hours x 15 times, every Mondays, Wednesdays, and Friday mornings (tentatively 10am-12pm) RM750.00 Fees are inclusive of all course teaching material & certificate of completion (All files are online format via email/MS Teams). Email: Seungyeon Lee at Seungyeon.Lee@nottingham.edu.my Faculty of Arts & Social Sciences School of Media, Languages and Cultures (SMLC) The University of Nottingham Malaysia Campus Jalan Broga 43500 Semenyih Selangor MALAYSIA Fax: +6(03) 8924 8012 Registration Payment telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}