{
    "url": "https://www.nottingham.edu.my/Humanities/People/yutmoy.leong",
    "content": [
        {
            "p": "Assistant Professor in Japanese Literature, Faculty of Arts Dr Leong Yut Moy （レオン・ユットモイ）is a Japanese literary researcher at the School of Media, Languages and Cultures (SMLC). She was the Deputy Head of School in 2013-2023; Head of Language Programmes in 2010-2013, and Director of Teaching in 2015-2019. She was a Japanese Government (Monbukagakusho, MEXT) Scholar in Japan for six years. She earned her MA and PhD in Japanese Literature from Hiroshima University, Japan. Her literary research ranges from the period of Meiji, Taisho, Showa to contemporary Japanese Literature, and comparative studies between Japanese, English and German Literature, especially regarding the works of Natsume Soseki, Robert Louis Stevenson, George Meredith and E. T. A. Hoffmann. Other than undertaking literary research, Dr Leong has been involving in various forms of Creative Writing in Chinese and Japanese as well as literary translation. She has been composing award-winning Japanese short novel (2007) and poetry (2009) in Japan and award-winning Chinese poetry in Malaysia (2009, 2010). Dr Leong's Japanese translation works are published in Gendaishi Techo (Japan), and her award-winning poem is selected in the World Poetry Almanac 2009 and 2010 (Mongolia). Her translation of poems of the well-known Chinese and Japanese poets has been presented on international poetry festivals in China, Japan, Iceland etc. Dr Leong is interested in learning different languages and she enjoys the excitement and fulfillment of language acquisition immensely. In addition to the global lingua franca, she strongly believes that mastering of a foreign language not only improves employment potential but also broadens one's global perspective, and brings many more priceless experiences beyond one's expectation. Selection of curriculum: Essay Black Rubber Boots〈黑胶靴〉was selected over 15 years in the Chinese textbook/curriculum of Chinese independent high school by the United Chinese School Committees Association of Malaysia. (《华文》初三下册, 马来西亚华校董事联合会总会) Award: Lord Dearing Award 2012 Teaching Development Fund 2013 (Offered a Nottingham Advantage Award module under the collaboration with colleagues from Faculty of Science and Faculty of Engineering.) Excellence in Teaching and Learning Award 2019 Qualification and experience: Research Ethics Reviewer, Faculty of Arts and Social Sciences, University of Nottingham Malaysia. MoU Coordinator, Japanese universities. Certified Primary Invigilator for Hanyu Shuiping Kaoshi (HSK), an internationally regconised Chinese Proficiency Test. External Examiner, MA dissertation, University of Malaya. Campus Teaching Committee Visiting scholar, Ritsumeikan University, Kyoto, Japan. Internal Auditor, University of Nottingham Malaysia Campus, Foundation in Arts and Education, MSc Environmental Monitoring and Management, MSc in Investment and Islamic Finance. Membership: International Comparative Literature Association (ICLA) Japan Comparative Literature Association (JCLA) Hiroshima University Modern Japanese Literature Association Dr Leong's teaching interests range from language subjects (Mandarin and Japanese), to humanity courses such as Japanese literature, Japanese culture and society, comparative literature and creative… read more Natsume Soseki, George Meredith, Robert Louis Stevenson telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}