{
    "url": "https://www.nottingham.ac.uk/humanities/departments/music/facilities/facilities.aspx",
    "content": [
        {
            "p": "The Department of Music is based in a modern purpose-built building. We have excellent facilities on campus, including: We also have a vibrant musical culture on campus, as well as strong links with venues and spaces in the rest of Nottingham. Please see below for links to the activities happening across Lakeside and the various music-related societies: Nottingham Lakeside Arts 'What's On' Lakeside and Society Activities See below for further details on the different rooms and the booking process for each. All bookings for the Djanogly Recital Hall and the Rehearsal Hall should be made to music-bookings@nottingham.ac.uk. Practice rooms can be booked online using the process below. Enquiries about other rooms should be directed to music-bookings@nottingham.ac.uk. The 200-seat hall hosts professional concerts by outstanding international musicians, and student lunchtime concert series, rehearsals and recital examinations. It was acoustically designed by David Kenton Jones, a world leader in concert-hall acoustics. It was listed in 2012 as one of the UK’s top 10 venues for chamber music by Classical Music Magazine, and is used by the Department of Music and also by Nottingham Lakeside Arts. First year recital pianists can book one hour per week on the Steinway piano in the Djanogly Recital Hall in the summer term only. Second and third year recital pianists can book two hours per week on the Steinway piano and are particularly advised to book rehearsals in the Recital Hall in advance. Please note that a series of professional concerts take place in the Recital Hall on most Thursdays and Saturdays and that there are regular ensemble rehearsals on most evenings during term time. External bookings are available. All booking requests for the Djanogly Recital Hall should be made to music-bookings@nottingham.ac.uk. Our orchestral-size Rehearsal Hall opened in 2011. It is principally intended for rehearsals of our larger ensembles, including the University Philharmonia and Choir. The hall is also used for occasional concerts, performance workshops and teaching. It also stores our extensive collection of instruments. Contains state-of-the-art sound insulation and an adjacent live room. This arrangement means students: Students can explore everything from synthesis to recording, to syncing audio in visuals in an extremely flexible and creative way. It is not open for external hire as studio time is strictly reserved for Music Technology students who require the facility in order to complete their coursework portfolios. The digital composition studio supports our Digital Composition module and other composition and music technology-related teaching. We have 13 purpose-built practice rooms, in addition to the Recital Hall and Rehearsal Hall. Each is spacious and well-lit and includes upright or grand piano. The practice rooms are now open for all students and academics. Music students can book up to two hours per day, between 8am until 10pm, seven days a week, via the Booking Portal. Non-Music students can use the rooms when free but must relinquish the room if required by a Music student or staff member. Further information, including the latest updates for both bookings and ad-hoc use can also be found in the news section of the Booking Portal. Go to the practice room booking portal This specialist library holds a large collection of: Recordings cannot be borrowed but there are comfortable listening booths to allow you to study the material at your leisure. Find out more about the Denis Arnold Music Library Many of our large lectures take place in the Arts Centre Lecture Theatre, adjacent to the Department of Music. The lecture theatre offers state-of-the-art screening and audio facilities, and amphitheatre-style raked seating. The University of Nottingham Lakeside Arts Centre University Park Nottingham, NG7 2RD Admission enquiries All other enquiries - Telephone: +44 (0)115 951 5841 - Email: music-enquiries@nottingham.ac.uk Twitter"
        }
    ],
    "pdf_files": []
}