{
    "url": "https://www.nottingham.edu.my/Humanities/CentrefortheStudyofCommunicationsandCulture/index.aspx",
    "content": [
        {
            "p": "The Centre for the Study of Communications and Culture (CSCC) is located within the School of Media, Languages and Culture at the University. This Centre was founded in 2010 by Professor Zaharom Nain, Professor of Media and Communication Studies of UNM. In this age of convergence and digitalisation, and the increasing expansion of the wider multimedia industry, there is an ever-greater need for more research focused on the areas of communications and culture in order to make sense of their implications for society. The CSCC facilitates the provides a platform for a substantive research programme of this nature, yielding results which will be of great benefit and consequence to academia, policy makers, and the wider society. Researchers at the CSCC are dedicated to carrying out interdisciplinary research into the role and politics of communication and culture in an era of hypermediation and globalisation. In-line with the our mission to operate as an international, regional and national centre of expertise, generate impact within academia and beyond, and enable knowledge-transfer and the generation of high-quality research, we foster an intellectual network for researchers, postgraduate students and professionals in the fields of media, communication and culture, as well as engaging with the governmental, non-governmental, and civil societal sectors. The first of its kind in Malaysia, the CSCC connects local and global research communities, and operates in a setting designed to produce results that will inform discourse and action at the societal and policy levels. The CSCC fills a critical national and regional research void in the area of communications, culture, and media research, at a time when the promises of increasingly digital, global and mobile communications need to be addressed side by side with their impact upon local cultural practices. Furthermore, the CSCC provides a space for critical scholarly and public discussion and debate on the significance of media, communications and cultural infrastructures and practices in the ongoing process of transformation and change occurring within Malaysia, within ASEAN, and on a global scale. For further information, please contact or visit: cscc@nottingham.edu.my The CSCC Facebook Page telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}