{
    "url": "https://www.nottingham.edu.my/Humanities/Language-Centre/Modules/French.aspx",
    "content": [
        {
            "p": "French is spoken by 200 million people in Europe, Africa, North America and Oceania. It is an official language in 29 countries and will open so many doors for you, whether you intend to travel as a tourist or network for your professional career. France boasts some world-famous universities and ‘Grandes Écoles’, and our students can gain access to these prestigious institutions. On a more leisurely note, the knowledge of French will allow you to indulge in an attractive culture, see the classic movies in the original, read the latest fashion news and discover some of the greatest works of art. The French team is dedicated to introducing you to this culture and making your learning as efficient as possible. All tutors have different academic expertise and are well experienced in teaching French as a Foreign Language. Our approach is mainly communicative, and we practice the four language skills (listening, speaking, reading, writing). Level 1 focuses on speaking skills: students are encouraged in speaking from the very beginning of the course. Level 2 focuses on developing students’ listening skills through a variety of media - Radio, TV, etc. Level 3 students focus on formal written production and will further develop their communicative skills. Our aim is to enhance our students’ teamwork and self/peer assessment skills and promote independent learning habits. We offer in-class, out-of-class, and on-line activities, challenging students’ creativity and critical thinking abilities. Our philosophy of teaching is student-centered and we will do everything to help each student fulfil his own potential and reach his own goals. Extra-curricular activities call for students’ active participation: the French team promotes activities such as the movie nights, language corner, group projects etc. We also try to get native French students involved. This gives our students an authentic language experience and the opportunity to practice in an informal context. Once students have reached the necessary skills in French, the Language Centre offers them the chance to prepare for the National French Language Proficiency Examinations namely The Diplôme d'études en langue française, Diploma in French Language Studies (DELF). The DELF and DALF are diplomas awarded by the French Ministry of Education to prove the French language skills of non-French candidates. There are four independent diplomas, which correspond, respectively, to the six levels of the Council of Europe's Common European Framework of Reference for Languages (CEFRL). See more about DELF and DALF exam here. telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}