{
    "url": "https://www.nottingham.edu.my/Humanities/Language-Centre/Learn-German/main.aspx",
    "content": [
        {
            "p": "Learn German for travel, working abroad or just for fun with our German Beginners class. You will cover basic topics, useful for everyday conversation, including talking about yourself and your profession and making hotel or dinner reservations. You will be introduced to various language skills (speaking, listening, reading and writing skills with group exercises and weekly homework) and how to approach some authentic materials. Some transferable skills will also be covered. This course will give you a solid understanding of beginners German, working towards the GOETHE CERTIFICATE A1/2 of the Common European Framework Reference of languages, when it is combined with the beyond German 1.2 beginner course. Also, if you wanted to join the elective German 1 modules but could not due to the limited seats, this is a good chance for you to come – and here you do not need to worry about tests! Follow steps to be able to do the final assignment at the end! Plus, watch some clips, and learn together, what fun will it be! This course consists of 12 lessons. Each lesson includes a lecture, keywords, a sample audio/video conversation, a quiz, and supplementary materials (homework, worksheet and answer keys). We strongly recommend completing all the worksheets for each section. Research has shown that doing homework after learning a concept will help the student learn the material quicker. What will I get out of this course? On successful completion of this course, you will be able to: PDF files of textbooks, along with exercises (also PDF files) will be provided, and students are strongly recommended to do homework as the teacher instructs. Visual materials will also be provided. At the end of the course, students have to present on a topic (3-5 mins) in Korean as a final assignment. Duration: 6 weeks: 4 hours per week, 2 hours per lesson, every Tuesday 10:00 to 12:00 and Thursday 10:00 to 12:00 RM695.00 Fees are inclusive of all course teaching material & certificate of completion (All files are online format via email/MS Teams). Email: Jean-Christophe Graffe at Jean-Christophe.Graffe@nottingham.edu.my Faculty of Arts & Social Sciences School of Media, Languages and Cultures (SMLC) The University of Nottingham Malaysia Campus Jalan Broga 43500 Semenyih Selangor MALAYSIA Fax: +6(03) 8924 8012 Registration Payment telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}