{
    "url": "https://www.nottingham.ac.uk/humanities/departments/philosophy/people/jonathan.tallant",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR The Role of Boundary Spanning in Building Trust: A Place‐Based Study on Engaging Hardly Reached Groups in Community Healthcare Settings (2024) Journal Article Bianchi, L., Kelemen, M., Shivji, A. K., Tallant, J., & Timmons, S. (2025). The Role of Boundary Spanning in Building Trust: A Place‐Based Study on Engaging Hardly Reached Groups in Community Healthcare Settings. Sociology of Health and Illness, 47(1), Article e13870. https://doi.org/10.1111/1467-9566.13870 This paper investigates the impact of boundary spanning activities on building trust as a means of tackling health inequalities in hardly reached communities. Lack of trust has been identified as a barrier to engagement with healthcare services, resu... Read More about The Role of Boundary Spanning in Building Trust: A Place‐Based Study on Engaging Hardly Reached Groups in Community Healthcare Settings. Untrustworthiness (2024) Journal Article TALLANT, J. (in press). Untrustworthiness. Ratio, Discussions of trustworthiness are not ubiquitous in the philosophical literature (compare remarks by Jones, 2012: 61). Nonetheless, there are some attempted analyses and there is excellent work ongoing. The goal of this paper is to focus on trustwor... Read More about Untrustworthiness. Locative grounding harmony (2024) Journal Article Tallant, J., Baron, S., & Miller, K. (2024). Locative grounding harmony. Philosophical Studies, 181, 1971-2001. https://doi.org/10.1007/s11098-024-02171-1 In this paper, we explore locative grounding harmony, according to which the location of the grounds mirrors the location of the grounded. We proceed in three stages. First, we clarify the notion of locative harmony and describe different locative ha... Read More about Locative grounding harmony. Teaching and knowledge: uneasy bedfellows (2023) Journal Article Fisher, A., & Tallant, J. (2023). Teaching and knowledge: uneasy bedfellows. Journal of Philosophy of Education, 58(1), 24-40. https://doi.org/10.1093/jopedu/qhad086 In this paper we explore the connection between the act of teaching and the imparting of knowledge. Our overarching aim is to demonstrate that the connection between them is less tight than one might suppose. Our stepping off point is a recent paper... Read More about Teaching and knowledge: uneasy bedfellows. Presentism: past and future (2023) Book Chapter Tallant, J., & Ingram, D. (2023). Presentism: past and future. In R. Lestienne, & P. A. Harris (Eds.), Time and Science. Volume 1: The Metaphysics of Time and Its Evolution (191-209). World Scientific. https://doi.org/10.1142/9781800613737_0007 Let us begin with a quick primer of views in the philosophy of time. Consider an event that is past, such as Constantine being acclaimed Emperor at Eboracum, an event that is present, such as your reading of this paper, and an event that is future, s... Read More about Presentism: past and future. Presentism and representation: saying it without words (2023) Journal Article Baron, S., Miller, K., & Tallant, J. (2023). Presentism and representation: saying it without words. Synthese, 201(2), Article 36. https://doi.org/10.1007/s11229-022-03987-2 The Triviality Argument against presentism maintains that we should reject presentism because there is no way to define the view that is not either trivially true or obviously false. We suggest that this style of argument over-emphasises purely lingu... Read More about Presentism and representation: saying it without words. Trusting What Ought to Happen (2022) Journal Article Tallant, J. (2024). Trusting What Ought to Happen. Erkenntnis, 89(5), 1887-1902. https://doi.org/10.1007/s10670-022-00608-9 This paper introduces a new account of trust and distrust. The core aim of the paper is to introduce an account of trust that places treats trust and what ‘ought’ to happen as close conceptual companions. Over the course of the paper, I develop the a... Read More about Trusting What Ought to Happen. A Defence of Lucretian Presentism (2020) Journal Article Tallant, J., & Ingram, D. (2020). A Defence of Lucretian Presentism. Australasian Journal of Philosophy, 98(4), 675-690. https://doi.org/10.1080/00048402.2019.1697709 © 2019 Australasian Journal of Philosophy. In this paper, we defend Lucretian Presentism (‘Lucretianism’). Although the view faces many objections and has proven unpopular with presentists, we rehabilitate Lucretianism and argue that none of the obje... Read More about A Defence of Lucretian Presentism. Might Teaching Be Judgement Dependent? (2019) Journal Article Tallant, J., & Fisher, A. (2020). Might Teaching Be Judgement Dependent?. Philosophia, 48, 777–787. https://doi.org/10.1007/s11406-019-00130-3 Our thesis in this paper is that consideration of Wright’s account of what it is to be judgement-dependent leads us to the conclusion that teaching is judgement dependent. We begin with a consideration of Wright’s account of what it is to be judgemen... Read More about Might Teaching Be Judgement Dependent?. Grounding at a distance (2019) Journal Article Baron, S., Miller, K., & Tallant, J. (2019). Grounding at a distance. Philosophical Studies, https://doi.org/10.1007/s11098-019-01374-1 What distinguishes causation from grounding? One suggestion is that causation, but not grounding, occurs over time. Recently, however, counterexamples to this simple temporal criterion have been offered. In this paper, we situate the temporal criteri... Read More about Grounding at a distance. Trust in education (2019) Journal Article Fisher, A., & Tallant, J. (2019). Trust in education. Educational Philosophy and Theory, 52(7), 780-790. https://doi.org/10.1080/00131857.2019.1692304 The philosophy of trust is a relatively small subfield. Nonetheless, it contains within it many important insights. Our contention in this paper is that careful study of this subfield can bring with it many insights that can and should be used to rec... Read More about Trust in education. Temporal Fictionalism for a Timeless World (2019) Journal Article Baron, S., Miller, K., & Tallant, J. (2021). Temporal Fictionalism for a Timeless World. Philosophy and Phenomenological Research, 102(2), 281-301. https://doi.org/10.1111/phpr.12637 Current debate in the metaphysics of time ordinarily assumes that we should be realists about time. Recently, however, a number of physicists and philosophers of physics have proposed that time will play no role in a completed theory of quantum gravi... Read More about Temporal Fictionalism for a Timeless World. Presentism and the spans of time (2019) Journal Article Tallant, J., & Ingram, D. (2020). Presentism and the spans of time. Philosophy and Phenomenological Research, 101(1), 200-214. https://doi.org/10.1111/phpr.12590 Trust: from the Philosophical to the Commercial (2019) Journal Article Tallant, J., & Donati, D. (2020). Trust: from the Philosophical to the Commercial. Philosophy of Management, 19(1), 3-19. https://doi.org/10.1007/s40926-019-00107-y © 2019, The Author(s). This is a paper about trust, with a specific focus on the ways in which trust is investigated in the business literature and the commercial sector. The lens through which the topic is approached is distinctively philosophical.... Read More about Trust: from the Philosophical to the Commercial. You can trust the ladder, but you shouldn’t (2019) Journal Article Tallant, J. (2019). You can trust the ladder, but you shouldn’t. Theoria, 85(2), 102-118. https://doi.org/10.1111/theo.12177 My claim in this paper is that, contra what I take to be the orthodoxy in the wider literature, we do trust inanimate objects—per the example in the title, there are cases where people really do trust a ladder (to hold their weight, for instance), an... Read More about You can trust the ladder, but you shouldn’t. It's one thing to rule them all and another thing to bind them (2018) Journal Article Tallant, J., & Baron, S. (2021). It's one thing to rule them all and another thing to bind them. Synthese, 198(1), 105-115. https://doi.org/10.1007/s11229-018-01983-z In this paper we offer a response to one argument in favour of Priority Monism, what Jonathan Schaffer calls the nomic argument for monism. We proceed in three stages. We begin by introducing Jonathan Schaffer’s Priority Monism and the nomic argument... Read More about It's one thing to rule them all and another thing to bind them. An error in temporal error theory (2018) Journal Article Tallant, J. (2018). An error in temporal error theory. Journal of the American Philosophical Association, 4(1), 14-32. https://doi.org/10.1017/apa.2018.5 Within the philosophy of time there has been a growing interest in positions that deny the reality of time. Those positions, whether motivated by arguments from physics or metaphysics, have a shared conclusion: time is not real. What has not been mad... Read More about An error in temporal error theory. Causation in a timeless world? (2018) Journal Article Tallant, J. (2018). Causation in a timeless world?. Inquiry, 62(3), 300-316. https://doi.org/10.1080/0020174X.2018.1446051 This paper is an attempt to answer the question, 'could there be causation in a timeless world?' My conclusion: tentatively, yes. The paper and argument have three parts. Part one introduces salient issues and spells out the importance of this (initi... Read More about Causation in a timeless world?. Presentism remains (2017) Journal Article Tallant, J. (2019). Presentism remains. Erkenntnis, 84(2), 409–435. https://doi.org/10.1007/s10670-017-9965-4 Here I examine some recent attempts to provide a new way of thinking about the philosophy of time that question the central role of ‘presentness’ within the definition of presentism. The central concern raised by these critics turns on the intelligib... Read More about Presentism remains. Commitment in cases of trust and distrust (2017) Journal Article Tallant, J. (2017). Commitment in cases of trust and distrust. Thought: Fordham University Quarterly, 6(4), https://doi.org/10.1002/tht3.259 There is a well-developed literature on trust. Distrust, on the other hand, has gathered far less attention in the philosophical literature (though there is a burgeoning business literature on the topic). A recent exception to that trend in the philo... Read More about Commitment in cases of trust and distrust. Showing 1 - 20 of 34 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}