{
    "url": "https://www.nottingham.edu.my/Humanities/Language-Centre/National-French-Language-Proficiency/main.aspx",
    "content": [
        {
            "p": "You want to pursue an internationally recognised French language degree valid for life? The DELF DALF is perfect for you! This Diploma in French Language Studies will allow you to demonstrate your French skills, with four tests marked out of 25 (Listening, reading, writing and speaking). The DELF and DALF are diplomas awarded by the French Ministry of Education to prove the French-language skills of non-French candidates. There are six independent diplomas, which correspond, respectively, to the six levels of the Council of Europe's Common European Framework of Reference for Languages (CEFRL). There are also special versions of DELF diplomas for adolescents (DELF junior). These are structured in the same way as the adult versions, but the themes used are chosen to suit preadolescent and adolescent candidates. The DELF DALF examinations presented in Malaysia are: Malaysia, with the experience of subscribing to the DELF DALF since 1998, have been registering more than 28,000 registered candidates and on yearly basis about 3,500 registrations for DELF DALF. DELF Scolaire is at the moment one of the popular international and definitely recognised foreign examination that receives tremendous support from all the parties that are involved in making the DELF a success. Candidates who received the DELF DALF diplomas as an attestation of their level of French acknowledged by the Ministry of Education of France benefits from having a diploma that is: Each examination comprises sections testing the four skills: oral production & reception and written production & reception. Holders of the DELF B2 or DALF diplomas are exempted from language entrance examinations in French universities. Want to know more about the DELF DALF exams? Find out on CIEP website: Description of the examination – DELF A1 A2 B1 B2 Find out which DELF you can sit for, according to the class you are taking! With 100% of success amongst students of UNMC, the best way to find out if you are ready to sit for DELF DALF is to ask your teacher! 04 June 2024, Tuesday (oral) 09 June 2024, Sunday (written) The University of Nottingham Malaysia Campus (Directions) Email: Sandrine Sim Visit the page here Faculty of Arts & Social Sciences The University of Nottingham Malaysia Campus Jalan Broga 43500 Semenyih Selangor MALAYSIA Fax: +6(03) 8924 8012 DELF A1 RM252.00 DELF A2 RM297.00 DELF B1 RM378.00 DELF B2 RM414.00 5 candidates minimum per level in order to have a session. Get ready for exam Registration Payment telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}