{
    "url": "https://www.nottingham.ac.uk/humanities/departments/music/faq/frequently-asked-questions.aspx",
    "content": [
        {
            "p": "Please find some frequently asked questions below. We hope that these will answer your query. If you are still unsure, please contact us at music-enquiries@nottingham.ac.uk and we will aim to reply within three working days. The department runs recitals and lunchtime concerts. Our upcoming lunchtime concerts are listed here, and recitals here. Our performance opportunities can be found on our performance page. If you are a student, you might also be interested in contacting one of the student societies. These are listed in the answer to the next question. What music-related Student Societies are there at University of Nottingham? A Cappella www.su.nottingham.ac.uk/societies/society /RevivalGospelChoir Please direct course or admissions enquiries to undergraduate-enquiries@nottingham.ac.uk or postgraduate-enquiries@nottingham.ac.uk. Alternatively, see our online undergraduate prospectus or postgraduate prospectus and send enquiries through our online enquiries form. Students on performance modules receive 16 hours of one-to-one tuition in the first year, 18 hours in the second year, and 20 hours in the third year. Any further tuition, such as on a second instrument, must be paid for privately. We have students studying electric guitar, folk fiddle, musical theatre and a variety of less conventional instruments. We teach all types of music. Tutors are employed by the University to provide lessons for Music Performance students as part of their course. Many of them also offer private tuition, however this is not arranged or provided by the University. You are welcome to contact our instrumental or voice tutors to check whether they offer private lessons. Their contact details can be found on their profile pages, where provided, or on the “performance” noticeboard by the music administration office. Please note that Music Department facilities can only be used for lessons by members of the University of Nottingham. While some of the tutors do offer tuition to members of the public, these are private arrangements and University facilities cannot be used. Instruments at the University are only for the use of staff, students and established partners and collaborators. If you fall into one of these categories and would like further information, please email music-enquiries@nottingham.ac.uk. Due to misuse in previous years, access to the Steinway piano is restricted. The piano has a fall lock that prevents unauthorised use. The key can be collected from the Music administration office by authorised users. Photo ID must be provided before a key will be issued. It can be used by: Any further enquiries for access should be addressed to Elizabeth Kelly. Due to misuse in previous years, access to the Yamaha piano is restricted. The piano has a fall lock that prevents unauthorised use. The key can be collected from the Music administration office by authorised users. Photo ID must be provided before a key will be issued. Priority for the use of the Music Department facilities is always given to Music students and events, followed by members of the wider University. Some of our spaces are available for external hire. Please see below for further details. The practice rooms within the Arts Centre are available to all University of Nottingham staff and students. Music students take priority and can book up to two hours per day, between 8am until 10pm, seven days a week, via the Booking Portal. Non-Music students can use the rooms when free but must relinquish the room if required by a Music student or staff member. Find out more about the practice rooms and instruments available here. Further information, including the latest updates for both bookings and ad-hoc use can also be found in the news section of the Booking Portal. It is possible to hire our venues for a fee, apart from the recording studio. For further information, and to get a quote for the hiring of any of the Arts Centre venues, please email music-bookings@nottingham.ac.uk. If you would like to use any of the instruments in these rooms or require a specific set-up, please ensure that this information is included in your request. The studio is not available for hire. It is reserved for Music Technology students who require the facility in order to complete their coursework portfolios. There are many local competitively-priced recording facilities in Nottingham that might be able to accommodate your requirements. Some examples are: info@sirkus.co.uk studio@paperstone.co.uk info@roflaudio.co.uk info@mountstreetstudios.co.uk Please send all calls for papers to music-enquiries@nottingham.ac.uk who will circulate these if appropriate. Please email your advert as a poster (A4 or smaller) to music-enquiries@nottingham.ac.uk and we will display this in the department if appropriate. If you would like to send a hard copy, please post it to: Music department office Arts Centre University Park Nottingham NG7 2RD Can anyone from the department play at my event? Please see a table of our student societies who will be able to advise as to whether they are able to play at your event: The University of Nottingham Lakeside Arts Centre University Park Nottingham, NG7 2RD Admission enquiries All other enquiries - Telephone: +44 (0)115 951 5841 - Email: music-enquiries@nottingham.ac.uk Twitter"
        }
    ],
    "pdf_files": []
}