{
    "url": "https://www.nottingham.edu.my/Humanities/CentrefortheStudyofCommunicationsandCulture/CSCCVoicesSeminars/Voices-III.aspx",
    "content": [
        {
            "p": "The third season of the Voices series, entitled 'Questions of Democracy in Culture and Media', was held at the Annexe Gallery and at the Petaling Street Community Art Project space in Kuala Lumpur during April, May and June 2013. As 2013 saw Malaysians going to the polls to exercise electoral democracy, this series took the timely opportunity to ask what democracy in the broadest sense of the word means to various segments of society, some of which have not experienced everyday forms of liberty that the average Malaysian ostensibly takes for granted. For example, since Malaysia is not party to the 1951 Refugee Convention Act, it is not legally obligated to make any humanitarian provisions for asylum seekers. Moreover even those who are recognised by the UNHCR do not have the legal right to work and thus, no right to the already circumscribed protection of workers if they work illegally. The 2012 Peaceful Assembly Act indeed prohibits foreigners from participating in public protest, further diminishing democratic expression and violating individual human rights. How is democracy interpreted and connected to sexuality rights, refugees, the performing arts, higher education in Malaysia and more generally, Islam in Europe? The speakers in this third series took turns to examine the roles of theatre practitioners, university students, Muslims, sexual minority rights activists and refugee advocates in carving out space for democracy. In Western democracies there are growing calls for the recognition of rights of sexual minorities on the basis of ‘sexual citizenship’: that LGBTIQ people are also citizens entitled to participate in various political, economic, cultural and social spheres as other citizens. Should the LGBTIQ movement in Malaysia adopt such a similar strategy? What complications and cultural nuances shade the transposition of these global discourses to the region? Further, with regard to global differences in literary or theatrical genres, is satire and mockery an acceptable art form? This series collectively engaged audience members to ask what the abstract notion of democracy meant for them individually, as a member of a social group, acting at the scale of the neighbourhood, the community, the nation or as cosmopolitan citizens, and how democracy impacted their everyday lives. Speakers included Thilaga Sulathireh, Yante Ismail, Jo Kukuthas, Fahmi Reza, and Professor James Piscatori. You can download the brochure (pdf) from the series to find out more. telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}