{
    "url": "https://www.nottingham.edu.my/Humanities/Language-Centre/Learn-Spanish/main.aspx",
    "content": [
        {
            "p": "Learn Spanish for travel, working abroad or just for fun with our Spanish Beginners class. You will cover basic topics, useful for everyday conversation, including talking about yourself and your profession and making hotel or dinner reservations. You will be introduced to various language skills (speaking, listening, reading and writing skills with group exercises and weekly homework) and how to approach some authentic materials. Some transferable skills will also be covered. This course will give you a solid understanding of beginners Spanish, working towards DELE A1/2 of the Common European Framework Reference of languages, when it is combined with the beyond Spanish 1.2 beginner course. Also, if you wanted to join the elective Spanish 1 modules but could not due to the limited seats, this is a good chance for you to come – and here you do not need to worry about tests! Follow steps to be able to do the final assignment at the end! Plus, watch some clips, and learn together, what fun will it be! This course consists of 12 lessons. Each lesson includes a lecture, keywords, a sample audio conversation, a quiz, and supplementary materials (homework, worksheet and answer keys). We strongly recommend completing all the worksheets along with the quizzes for each section. Research has shown that doing homework after learning a concept will help the student learn the material quicker. What will I get out of this Spanish course? On successful completion of this course, you will be able to: Lesson 1: Introduction, El mundo de habla Hispana.• Greetings and introductions. Lesson 2: Alphabet, writing and spelling Spanish words. Numbers 1-100. Lesson 3: Personal information: occupation, nationalities, languages, (Ser verb) Lesson 4: Physical description. Asking and giving time, dates (Ser verb) Lesson 5: Family (Tener verb) Possessives. Lesson 6: Asking about family members and civil status (Estar verb) Lesson 7: Make friends online, let’s write an email. Lesson 8: At the market, food and drinks Lesson 9: Order at the restaurant. Lesson 10: My city, places (Hay, estar verb) Lesson 11: Prepositions (Estar verb) Lesson 12: Let’s make a plan. Suggest someone to go out, time & location. PDF files of textbooks, along with exercises (also PDF files) will be provided, and students are strongly recommended to do homework as the teacher instructs. Visual materials will also be provided. At the end of the course, students have to present on a topic (3-5 mins) in Spanish as a final assignment. Duration: 6 weeks: 4 hours, 2 hours per lesson on every Tuesday at 10:00 to 12:00 and every Thursday 10:00 to 12:00 RM695.00 Fees are inclusive of all course teaching material & certificate of completion (All files are online format via email/MS Teams). Email: Jean-Christophe Graffe at Jean-Christophe.Graffe@nottingham.edu.my Faculty of Arts & Social Sciences School of Media, Languages and Cultures (SMLC) The University of Nottingham Malaysia Campus Jalan Broga 43500 Semenyih Selangor MALAYSIA Fax: +6(03) 8924 8012 Registration Payment Yes, this course is designed to cater for beginners who have no prior knowledge of the language. This course is open to all students, and there is no specific prerequisite for this course. Our language professors employ a communicative and interactive approach, combining various teaching methods such as group activities, role-plays, multimedia resources, and conversational practice to enhance language skills. Learning a new language requires consistent effort and dedication. The following are some tips to help you learn Spanish quickly: Immerse yourself in the language by watching Spanish TV shows and listening to Spanish music. Practice regularly with native Spanish speakers. Utilise language learning apps to supplement your learning. Set specific goals and create a schedule to stay organised and motivated. Try mnemonic techniques, or flashcards to memorise vocabulary and grammar rules. Join a Spanish language club or Spanish cultural events. The difficulty of learning a new language is rather subjective as it can vary depending on your background, linguistic aptitude and exposure to similar languages. Both Spanish and French are in the Romance language family, and thus, they do share many similarities in vocabulary and grammar. However, English speakers generally find Spanish relatively easier because of its simpler pronunciation and straightforward grammar compared to French. Nonetheless, it is advisable to choose a language based on personal interest and motivation rather than perceived difficulty. This depends on your interests and goals. Some factors to consider include: Relevance - Whether you plan to work in a country where French or Spanish is spoken. Availability of resources such as classes, textbooks and other learning materials. Similarity to other languages you know. For instance, learning Spanish might be easier if you’re familiar with Italian or Portuguese. Personal interest - Choosing the language you’re interested in plays a crucial role in language learning success. In addition to our Spanish course, UNM offers beginner courses in French, German, Japanese, Korean and Mandarin. telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}