{
    "url": "https://www.nottingham.edu.my/Humanities/CentrefortheStudyofCommunicationsandCulture/CSCCResearch/Watching-the-Watchdog-2.0.aspx",
    "content": [
        {
            "p": "GE14 media monitoring report now available Selangor, 7 September 2020 – A report on the key findings from the monitoring of media coverage of the 14th general election is now available. It presents an analysis of how 24 news media outlets across three languages covered the election period – from the dissolution of Parliament on 7 April 2018 until 12 May 2018, three days after the elections were held on 9 May 2018. The report also includes an overview of the legal and ownership structures of media in Malaysia, which has shaped the media landscape for decades. The media monitoring project, called Watching the Watchdog 2.0, was a follow up to a similar initiative during the 2013 general election. It was conducted by the Centre for the Study of Communications and Culture under the School of Media, Languages and Cultures at the University of Nottingham Malaysia. The monitoring, with the help of 50 volunteers, covered a total of 24 outlets from the state and private media. The content was selected from the home/national pages/segments and coded to assess the coverage of 20 categories of information. The team was led by SMLC’s Gayathry Venkiteswaran and Zaharom Nain, together with Wang Lay Kim, a former lecturer at Universiti Sains Malaysia. Below are some key points that emerged from the analysis for the 2018 media coverage: The pro-BN and state media reported as though the coalition was not facing a crisis of credibility among voters and the public. Instead, the media depicted the BN as having widespread support. The study did not conduct audience survey or analyse social media content, still, there is enough evidence to show that the Malaysian public had no trust in the mainstream media, and sourced their information from online social networks, often accepting content shared by trusted individuals or personalities. The election results point to the inability of the mainstream media to respond to public sentiment and to be independent of BN's political hegemony. Findings from the research project and the national and regional collaborations have been used for submissions related to institutional and media reforms to the government in 2018, for paper presentations at several academic conferences, including a regional conference on fake news in Bangkok in July 2019 and and a panel on media and democracy in Taiwan in October 2019. Presentations were also made at the Institut Berdaya Wanita post-GE14 elections forum in January 2019 in discussing the gender perspectives in media coverage of the elections and implications on society. The project team provided data and preliminary observations with civil society groups that were doing real-time monitoring of the elections campaign, specifically on the politicisation of race or ethnic (Pusat KOMAS) and electoral offences (Bersih 2.0). Post-GE14 witnessed resignations in the media, coinciding with the removal of the top leadership in government-linked companies and public offices. It is quite unlikely that an old media – press, broadcasting – made subservient to the dictates of an authoritarian regime, will change, let alone reform overnight or by its own volition. Rather than expecting the media to change itself, the public must demand greater media professionalism and accountability. Up until February 2020, with the election results and the new, reform-minded Pakatan Harapan (PH) government, groups and individuals from Malaysia’s civil society banded together to urge for – and offered assistance towards – reforms, including media reform. The process was going smoothly until the collapse of the PH government. Only time will tell what the future of the media will hold. Malaysia, like other countries around the world, has been on lockdown because of the deadly Covid-19 pandemic. Hopefully, in a post-Covid 19 pandemic future, reform and change can - and will - come about through media re-education for current practitioners; the setting-up of institutions, like the work-in-progress independent, self-regulating media council to monitor and improve standards; and the development and advancement of a public service ethos for media – old, new and social. The project was jointly funded by Open Society Foundations and Bersih and Adil Network Sdn Bhd. The team is grateful to Wang Lay Kim, Dr Joanne Lim and Lim Hong Siang for their support and leadership, and all the volunteers, without whom the project would have been impossible. The University of Nottingham Malaysia provided the ideal environment for conducting much of the data analysis. Project Leader Centre for the Study of Communications & Culture Release 2 Infographic (.pdf) telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": [
        "pdf_files/WtW2-Sept2020.pdf",
        "pdf_files/8TV.pdf",
        "pdf_files/Astro-Awani.pdf",
        "pdf_files/Bernama.pdf",
        "pdf_files/Borneo-Post.pdf",
        "pdf_files/China-Press.pdf",
        "pdf_files/Daily-Express.pdf",
        "pdf_files/Makkal-Osai.pdf",
        "pdf_files/Malay-Mail.pdf",
        "pdf_files/Malaysiakini-BM.pdf",
        "pdf_files/Malaysiakini-English.pdf",
        "pdf_files/New-Straits-Times.pdf",
        "pdf_files/NTV7.pdf",
        "pdf_files/Oriental-Daily.pdf",
        "pdf_files/See-Hua-Daily.pdf",
        "pdf_files/The-Star.pdf",
        "pdf_files/The-Sun.pdf",
        "pdf_files/TV1.pdf",
        "pdf_files/TV2-English.pdf",
        "pdf_files/TV2-Mandarin.pdf",
        "pdf_files/TV3.pdf",
        "pdf_files/Utusan-Borneo.pdf",
        "pdf_files/Utusan-Malaysia.pdf",
        "pdf_files/WTW2-Poster1-2020.pdf",
        "pdf_files/WTW2-Poster2-2020.pdf"
    ]
}