{
    "url": "https://www.nottingham.edu.my/Humanities/Research/Postgraduate-research-students.aspx",
    "content": [
        {
            "p": "Thesis Title: Traditions in Modernity: Studying the performance of the Chinese orchestra in Malaysia as a cultural ecosystem. Elynn Tan is a doctoral candidate in Cultural Studies enrolled on March 2020. Her research interest is the Chinese orchestra in Malaysia, currently exploring its position as a cultural ecosystem. A musician herself, she has a strong passion in exploring alternative means for musical presentations and is open to artistic collaborations. Supervisor: Prof Joanne Lim Co-supervisor: Dr Sergio Camacho Abszra is a doctoral candidate researching Malaysian political communication on Twitter enrolled on September 2018. He uses critical technocultural discourse analysis to examine, what appears to be, an emerging public sphere on the platform. Using the abrupt regime change which saw Pakatan Harapan losing its hard fought victory during the 14th General Election - known as the Sheraton Move, as a case study, Abszra's work deconstructs reactions of political elites, media outlets, and the general citizenry. His research approaches 'big data' analytics, qualitatively and proposes an integrated, critical conceptual framework to provide novel empirical findings to better understand the Malaysian Twittersphere. Gayathry Venkiteswaran is researching media reforms processes in Myanmar and Indonesia during their respective political transitions and democratisation. Her research is informed by a political economy approach as well as an analysis of the changing relationships between the state, media, civil society, and international media organisations. Supervisor: Prof Zaharom Nain Co-supervisor: Prof Joanne Lim Thesis Title: Digital Media Interventions and Strategies for Participatory Governmental Reforms in Malaysia Sing Fei (enrolled June 2022) is studying and researching uses and challenges of new media for participatory governmental practices in Malaysian and Southeast Asian societies. More broadly, he is also exploring uses of various methods and tools in Social Research for public diplomacy and policymaking purposes. Supervisor: Prof Joanne Lim Bee Yin Co-supervisor: Dr Siti Khadijah Zainal Badri Ma Qingyu (enrolled April 2022) is a doctoral candidate researching idol Fan Communities in China. Through qualitative research, her research investigates the questions of how young Chinese women have resurrected the religiosity of fandom by means of their interactions with popular idols or works, fan communities, and higher authorities, explores the socially constructed ambivalence of modern young females and their self-constructed subjectivity, as well as the choices these factors lead young women to make. Supervisor: Dr Khoo Gaik Cheng Co-supervisor: Ms Gayathry Venkiteswaran Thesis Title: Media Setting in Policy Processes Using Narrative Policy Framework on Housing Under the 12th Malaysia Plan (2021-2023) Saiful (enrolled February 2022) is a doctoral candidate in media studies. His research interest focuses on media agenda setting and public policy. He uses narrative policy framework (NPF) to explore on how media is used to propagate public policies. This will lead to better insights on how actors involved in the the public policy formulation understand the roles and importance of media in making it an impactful policy. Supervisor: Prof. Zaharom Nain Co-supervisor: Ms. Gayathry Venkiteswaran Jing Yang (enrolled Sept 2023) is a doctoral candidate investigating the pivotal role of mass media in shaping political discourse and cultural perceptions in today's globalized context. Her study explores the complex interplay between media, politics, and culture, examining how media outlets influence public opinion, political agendas, and intercultural understanding. Supervisor: Prof. Zaharom Nain Co-supervisor: Ms. Gayathry Venkiteswaran Penny Wong (graduated March 2024) was a Master's in Research (MRes) candidate researching Hakka durian farmers in Balik Pulau. She explores the durian farmers' durian cultivation and farm management methods by understanding their dynamic relationships with other durian farmers themselves and durian stakeholders: durian middlemen, durian sellers, agrochemical companies, the government, and fruit associations. Using Practice Theory, this exploration aims to understand the shift in Hakka durian farmers' intergenerational identity. Supervisor: Dr Khoo Gaik Cheng Co-supervisor: Dr Lim Khay Thiong (National Chi Nan University) Sheila Julis (graduated March 2024) was a Master’s in research (MRes) candidate researching property relations, including land demarcation and resource ownership using the Orang Temuan as a qualitative case study. Using durian as a worldview, her research investigates the Orang Temuan’s practice of durian cultivation and management as part of their agroforestry tradition in hope of documenting an alternative memory opposing formal narratives on land management. It aims to provide a counter-narrative to the popular conversations of victimisation and subalternised perspectives, as the community utilises durian as a tool to build resilience, unity, and the reclamation of their communal rights. Supervisor: Dr Khoo Gaik Cheng Co-supervisor: Dr Rusaslina Idrus (Universiti of Malaya) Dissertation Title: Alternatives to Freedom: Expressions of Empowerment in the Malay Female Body Jeannette (graduated on July 2022) was a Master of Research (MRes) candidate researching pornography and sex media in Malaysia, with a focus on the female body. Her dissertation explores a range of Internet platforms including blogs, social media, and video platforms to look at how the Malay/sian female body is deployed and manifests in the three registers of Lacanian psychoanalysis – the Imaginary, the Symbolic, and the Real. Its goal is to examine the contradictions between typical English-language, liberal narratives and Malay-language, supposedly conservative sex discourse taking place online, in order to propose an alternative form of women's empowerment that does not necessarily conform to feminism in general. Supervisor: Dr Ahmad Fuad Rahmat Co-supervisor: Dr Khoo Gaik Cheng Aziff (enrolled Sept 2023) is a doctoral candidate researching the Islamisation of spaces in urban Malaysia. His research concerns how Malay-Muslim communities inhabit and influence spaces and provides counter-narratives to the state's version of Islamic nationhood and identity. Supervisor: Dr Ahmad Fuad Rahmat Co-supervisor: Dr Khoo Gaik Cheng Nur Nadia Lukmanulhakim or more commonly known as Nadia Lukman (enrolled in Sept 2023) is a doctoral candidate conducting research on home, memory and identity among second-generation Rohingya refugees in Malaysia. As displaced people, Rohingya refugees continue to be in protracted displacement with no place to called home. The research aim to explore the way second-generation Rohingya refugees in Malaysia memory and understanding of home and its intersection to identity. Supervisor: Dr Sandeep Ray Co-supervisor: Dr Sumit Mandal Jueling Hu is an interdisciplinary researcher pursuing her Ph.D. degree at the University of Amsterdam (Media Studies) and the University of Fribourg (Human Geography). Her research revolves around the futuristic forms of human-technology-nature relationships in visual and other sensory media, questioning the role of media materiality in affording certain ways to conceive ourselves and our relations to the worlds, in the digital times and an era of global climate change. She is currently an exchange student in the School of Media, Languages, and Cultures, at the University of Nottingham Malaysia. Juliet is a visiting research student from Stanford University (2023-2024). For her doctoral research, she is conducting an “ethnography of meat” in Malaysia and Singapore, Asia’s number one and two chicken consumers per capita. She is studying the relationship between experiences of and preferences for the tastes of different meats, especially chicken. Fieldwork from her MA in Anthropology of Food from SOAS, University of London, inspired this research. She also holds a bachelor’s degree in Economics from Princeton University. telephone: +6 (03) 8924 8693 fax: +6 (03) 8924 8020"
        }
    ],
    "pdf_files": []
}