{
    "url": "https://www.nottingham.ac.uk/icemic/publications.aspx",
    "content": [
        {
            "p": "ICEMiC members publish extensively on issues related to the centre themes in scholarly journals and books, and also in publications that address research-users and the wider public. A full list of the publications of ICEMiC members can be found on their individual webpages. Dr Roda Madziva recently co-edited the following book: Madziva, R., Thondhlana, J., Garwe, E.C., Murandu, M., Chagwiza, G., Chikanza, M. and Maradzika, J. (2021). Internally displaced persons and COVID-19: a wake-up call for and African solutions to African problems – the case of Zimbabwe. Journal of the British Academy. https://doi.org/10.5871/jba/009s1.001. Chikwira, L. and Madziva, R. (2023). Transnational Families and Complex Gender Relations: A Case Study of Zimbabwean Migrant Women Living in the UK. In Brandhorst, R. and Cienfuegos Illanes, J. (Eds). Handbook of Transnational Families Around the World. Springer. Gender, Sexuality and Islam in Contemporary Indonesia explores gender, sexuality and religion in contemporary Indonesia. It is the first book-length analysis of the experiences of queer Muslims in Indonesia, the largest Muslim country and the world's fourth most populous nation, as well as the first monograph exploring the voices of their allies vis-à-vis the role of Indonesian progressive Islam and Islam Nusantara. Class has long been a key focus of sociological and political studies. This book explores what it might mean today in a twenty-first century context. Is class really disappearing? Is class morally justifiable? What impact has globalisation and neoliberalism had on the restructuring of class-based social relationships? These questions and others are explored in this short but lively book. Stevenson reviews a number of normative traditions including anarchist, Marxist, social democratic and citizenship-based forms of understanding of class in order to shed light on the themes of class-based experiences, health and inequality, work, class struggle, social movements and the possibility of developing more egalitarian and just societies in the future. Dr Morteza Hashemi and Christopher R. Cotter of Open University, co-edited the Religion in Fortress Europe: Perspectives on Belief, Citizenship and Identity in a Time of Polarized Politics. How does religion maintain or challenge discourses on national identity? What are the roles that religion plays on all sides – from Islamophobia of the radical right to the Christian alliances on both sides of the Atlantic, to the Islamic beliefs and practices of European citizens as well as migrant communities – in the constitution of Fortress Europe? Are there any alliances shaping between belief and unbelief on either side of the battle for the future of Europe? These questions and more motivate the chapters in this timely interdisciplinary collection, with contributions focusing on diverse contexts throughout Europe involving a broad range of religious identifications and actors. Professor Sarah Dauncey’s new book – Disability in Contemporary China: Citizenship, Identity and Culture – is the first academic work to offer a comprehensive exploration of disability and citizenship in Chinese society and culture from 1949 to the present. Through the analysis of a wide variety of Chinese sources, from film and documentary to literature and life writing, media and state documents, she sheds important new light on the ways in which disability and disabled identities have been represented and negotiated over this time. She exposes the standards against which disabled people have been held as the Chinese state has grappled with expectations of what makes the 'ideal' Chinese citizen. From this, she proposes an exciting new theoretical framework for understanding disabled citizenship in different societies – 'para-citizenship'. A far more dynamic relationship of identity and belonging than previously imagined, her new reading synthesises the often troubling contradictions of citizenship for disabled people – the perils of bodily and mental difference and the potential for personal and group empowerment. The book has been described by academic reviewers working in Chinese Studies and Disability Studies as ‘brilliant’, ‘foundational’, ‘hugely significant’ and ‘essential reading’. Dr Yuwei Xu, Professor Vina Adriany and Professor Deevia Bhana, co-edited the Gendered and Sexual Norms in Global South Early Childhood Education. This volume examines gendered and heteronormative norms embedded within early childhood education (ECE) in the Global South, including Brazil, China, Pakistan, South Africa, and Vietnam. In this book, the contributors explore how gender, culture, religion, masculinity, sport, and conservative politics intersect to perpetuate and resist gendered and sexual norms. The book presents a range of possibilities for disrupting and challenging these norms within early childhood educational contexts. Grounded in colonial and postcolonial discourses, the book emphasises the entanglement of gender and sexuality in ECE with legacies of colonisation and surrounding social and cultural dynamics, highlighting our responsibility to address gender inequalities and injustices. The book will appeal to researchers, faculty, and teacher educators with interests in gender and sexuality in education, international and comparative education, and early childhood education. Read our members' past publications. School of Sociology and Social Policy Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD +44 (0)115 951 5393"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/breaking-bread-the-book.pdf"
    ]
}