{
    "url": "https://www.nottingham.edu.my/International/Offerholders/Visasandimmigration/Pre-arrival-2015.aspx",
    "content": [
        {
            "p": "All international students intending to study in Malaysia must complete the following pre arrival student pass and entry visa requirements before coming to Malaysia. You are strictly advised to follow all the instructions given by the UNM Visa Team. The step-by-step pre arrival process is highlighted below: Non-Malaysian nationals who wish to study full-time at any educational institution in Malaysia must apply for a Student Pass (Visa). This is a requirement of Regulation 13 of the Immigration Regulations 1963. Non-Malaysian nationals holding these passes: are required to apply for a Student Pass. Students are required to cancel the existing pass and apply for their Student Pass until the completion of their studies in Malaysia - Please refer the Visa Office for further assistance. The University will not be liable for any action taken by the Malaysian Immigration Department if you decide to ignore the rulings above. This includes NOT being able to obtain attestation after graduation from the Ministry of Higher Education. Students are required to submit a new Student Pass application and new processing fees for the following circumstances: The processing fees and any additional charges will be borne by the students. The Malaysian Immigration Department requires that UNM applies for the student pass on behalf of each student. Once you have received your conditional/ unconditional offer letter you must submit the following documents to UNM at least four (4) months before the registration date of your course. Please ensure that you follow the requirement guidelines strictly to avoid delays in your visa application. UNM bears no responsibility for late submissions. The following is the list of documents required for the visa application process: The above forms should be filled in and submitted all together via email to Apply.Visa@nottingham.edu.my to The Student Visa Office, The University of Nottingham Malaysia Campus, Jalan Broga, 43500, Semenyih, Selangor Darul Ehsan, Malaysia. Additional documentation for: Students transferring from other academic institutions in Malaysia or have previously studied in Malaysia must submit the following additional documentation: Foundation and undergraduate students (but not Postgraduate students) aged 25 years or above are required by the Malaysian Immigration authorities to submit a resume/CV that includes: Upon receiving your Visa Approval Letter (VAL) from the Immigration Department, UNM's Visa Office shall email a soft copy of your VAL to you or your agent. After receiving your VAL you should apply for a Single Entry Visa (SEV) at your nearest Malaysian Embassy/ High Commision/ Consulate Office before you travel to Malaysia. Please visit the Malaysian Embassy/ High Commission/ Consulate Office for confirmation regarding applying for your SEV to Malaysia or apply for your eVISA online. If you do not comply with the above SEV or Entry Visa requirements, the Malaysian Immigration authorities may not convert your Visit/ Social/ Tourist pass to a Student Pass (visa) although you have entered with a VAL. You are at risk to be sent back to your home country to apply for your SEV and to reenter again. These additional costs will be borne by the student concerned. Note: The University of Nottingham Malaysia will apply for the Student Pass on your behalf and you will be notified by e-mail once you have accepted the offer and made your tuition fee deposit to our Finance Department. All international students who defer, withdraw, terminated, and completed studies are required to shorten/cancel their present student pass before leaving the country. They are required to get advice from the Visa Office on the necessary formalities. This is in line with the directive from the Malaysian Immigration Department guidelines NOT allowing international students to return home before shorten/cancellation is carried out. Any student fail to comply this guidelines will have their passport being blacklisted by the Immigration Department and the University will have no control over this decision. We understand that obtaining the necessary documentation can be a difficult and confusing process. If you have any questions or concerns please contact us at: Student Visa Office General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/Passport-Photo-Specifications-for-EMGS.pdf",
        "pdf_files/YellowFeverV-countries.pdf",
        "pdf_files/Student-Declaration-Form-Rev-6-01-02-2024.pdf",
        "pdf_files/NOC-(2).pdf"
    ]
}