{
    "url": "http://www.nottingham.edu.my/International/LifeinMalaysia/Working/index.aspx",
    "content": [
        {
            "p": "International students who enter Malaysia on a student visa have few opportunities to undertake paid employment. Although technically there are some legal opportunities for students to work, however, the Malaysian Immigration Department has set limitations for international students to undertake any form of paid employment whilst studying in Malaysia ─ see guidelines below. International students are allowed to work part-time, subject to the terms and conditions below. For a maximum of 20 hours per week, International students are allowed to work on a part-time basis during semester breaks only. International students with valid student pass are only permitted to work in 4 sectors such as: 1. International Students who intend to work part-time in Malaysia,must submit: 2. The application to work part-time must be submitted to the Immigration Department for approval. 3. Students will be interviewed, after which the application will be either approved/declined. 4. The passport of students whose application has been approved will be endorsed accordingly. The Director General of Immigration Malaysia has the right to approve or reject any Non-Malaysian student's application to work under section 9 (1) (a) Immigration Act 1959/1963 Amendment 2002. Please contact Visa Office for further clarification. Tel : +6 03 8725 3704 Email : Abdul.Rahim@nottingham.edu.my Hotline : +6 03 8725 3715 The Immigration Department requires the University to forward the student's academic progress report every three months and report students who do not attend classes. The extension of the approval to work will only be given if the student maintains good academic achievement. The University must be informed immediately of any change to employment. For further information about working in Malaysia, please visit us at the Visa Office, Level 1, Block H, Student Services Centre or email at Abdul.Rahim@nottingham.edu.my Foreign students can work for a maximum of 20 hours per week during semester breaks or holidays. You will have to utilise various resources such as online job portals, recruitment agencies and networking events. If you are looking for a job near campus, you can ask your friends if they know of any jobs available, as well as the nearby businesses. Yes, internships are available to international students in Malaysia. These programmes offer valuable work experience and the opportunity to apply classroom knowledge in real-world settings. This depends on the duration and nature of the internship. If the internship is part of your academic programme and is a requirement for graduation, you may not need a separate work permit/student pass. However, you will likely need a student pass if it is not part of the course you’re enrolled in. Yes, UNM provides support services to assist international students with career development. For more on the support services we offer, visit our International Office. Understanding cultural nuances will help you navigate the workplace and build positive relationships with colleagues and employers. Some insights to keep in mind when working in Malaysia include: Respect for hierarchy Politeness and courtesy Importance of positive non-verbal communication Being mindful of conversation tone and adopting a diplomatic approach when addressing sensitive issues. Being punctual and respecting others’ time Dressing appropriately Teamwork and harmony that fosters a positive work environment. Visit our page on Malaysian Culture for a glimpse of what life would be like studying and working in this country. telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": []
}