{
    "url": "https://www.nottingham.edu.my/International/LifeinMalaysia/Culture/Campus-City.aspx",
    "content": [
        {
            "p": "With over 1,000 students living in the accommodation halls, the UNMC campus is a lively place to be day and night. On top of the ample study facilities, here are some things you can expect to find on-campus and in the surrounding areas: Cafes & Restaurants: On-campus, you will be able to find Asian, Western and Mediterranean food, with provisions for vegetarians as well. The 7-11 convenience store is open 24/7 and serves up frozen/ fresh food for students on the go. In Semenyih town, you can sample wallet-friendly Malaysian cuisine or opt for some quick and familiar fast food. Entertainment: On-campus, you will find TV rooms, games rooms ample sporting facilities. The 70 clubs and societies at UNMC, with interest groups ranging from scuba diving to fashion to Model UN, make up the heart and soul of campus life at UNMC and are also the main organisers of group activities. In the Semenyih area, thrillseekers can revel in ATV racing, ziplining, paintball and more at a nearby adventure park. Visit the UNMC Facebook page for current news and events! The Kuala Lumpur city centre is about 45 minutes away from campus, and is abuzz with activities and sights. The most popular sight is the Petronas Twin Towers, the tallest twin buildings in the world, and tourists also enjoy shopping in the high-end malls in Bukit Bintang as well as budget street shopping in Petaling Street. Ask any Malaysian where they hang out on weekends and chances are, it will be a restaurant or cafe. Food in KL is cheap, varied and packed with flavour. Be it Mediterranean, Japanese, fusion or fine dining, KL will serve up some of the best food in the world. Be sure to try some Malaysian favourites like nasi lemak, curry laksa and chicken rice! Kuala Lumpur and neighbouring state Selangor are full of interesting neighbourhoods with their own set of unique attractions. Check out the Time Out KL list of things to do in or around KL for more ideas! telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": []
}