{
    "url": "https://www.nottingham.edu.my/International/Prospective-Students/Region-Specific-Information/Africa1.aspx",
    "content": [
        {
            "p": "Studying in UNM has been a fulfilling journey. As one of the most diversified universities in Malaysia, it provided me with a unique platform to explore various cultures from a different part of the world. I made friends from all over the world some of whom are likely to be lifelong friends. Nottingham has fostered a strong relationship with various professional accounting bodies such as ICAEW and CPA Australia which gave me the advantage of getting exemptions for several papers. This is one of the major reasons I chose to join the university. Vikki Gitata from Kenya, studying BSc (Hons) Finance, Accounting and Management Bénédicte Anthony from Mauritius, studying BA (Hons) International Relations with Spanish Students from Africa are usually required to complete a Foundation programme, prior to entering a degree programme. Download the Foundation international entry requirements here. Students who have completed an international pre-university qualification such as A levels, IB, SATs (both SATr and relevant SAT subject tests) Australian/Canadian matriculation are eligible for first year entry into a degree programme, and can find the relevant entry requirements by searching for their course. Students with other qualifications or transferring students may be admitted on a case-by-case basis. Students holding degrees from universities in Africa may be admitted on a case-by-case basis. Applying for MPhil/MRes/PhD programmes are slightly different. Students have two routes to gaining admission: a) Students can pre-apply, by submitting their research proposal and academic transcript to the supervisor of their choosing (find a supervisor by looking through the 'People' tab under the relevant school or department and putting in an application after the supervisor has approved their research. b) Students who have no preference of their supervisor can put in an application online immediately. The International Officer for Africa is Teoh Tze Imm. Use our online enquiry form for making an enquiry about studying at the University. See our full recruitment event schedule On this website: Other resources: telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": [
        "pdf_files/foundation-africa.pdf"
    ]
}