{
    "url": "https://www.nottingham.edu.my/International/Offerholders/Health-and-insurance/Health-examination.aspx",
    "content": [
        {
            "p": "All students applying for a student pass must declare EMGS Health Declaration form and the related visa documents for the application of Visa Approval Letter to the Visa Office. **EMGS will not be able to process your VAL without the vaccination certificates. Post Arrival/In-Country Medical Screening New International students are required to attend a Medical Screening at an EMGS panel clinic within 7 working days after arrival in Malaysia. This is a mandatory process and failing to complete this check may result in the cancellation of your visa. Please bring along the documents below for the post arrival health screening and proceed to the International Student Support for further information. Students are advised to avoid taking medications containing opioids from 1 month prior to departure . Kindly ask your treating doctors to give alternative medicine which does not contain opioid or issue a medical letter if u have to be treated with only opioid containing medicines due to medical reasons. It is important for you to remember the name of the medication you were taking prior to departure and declare it correctly in your medical forms during the post-arrival medical screening. Any student with positive urine opioid test will fail the medical examination. Students with medical conditions, please check our Guidelines for Certification for Foreign Students. Ms. Rita Vengidesan International Student Support Officer Tel: +6 (03) 8924 8750 Email: international.support@nottingham.edu.my Important : Carefully read the instructions on the first page of the form. All information must be completed with a black ink pen and capital letters All documents pertaining to your health declaration and visa are to be submitted to the Visa Office. Please keep a copy for your own reference. telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": [
        "pdf_files/EMGS-Health-Declaration-Form.pdf",
        "pdf_files/YellowFeverV-countries.pdf",
        "pdf_files/List-of-Approved-Clinicsv-latest.pdf",
        "pdf_files/Letter-of-Undertaking.pdf",
        "pdf_files/Guidelines-for-Certification-of-Foreign-Students-Healthv.pdf"
    ]
}