{
    "url": "https://www.nottingham.edu.my/International/Overseas/indonesia.aspx",
    "content": [
        {
            "p": "Cempaka Mas (HQ) office: Ruko Mega Grosir Cempaka Mas, Block Q, No. 9. Jln Letjen Suprapto, Cempaka Putih Jakarta Pusat 10640, Indonesia Tel: +62 (021) 4288 8411 Email: cempakamas@eduworld.co.id Poins Square office: POINS Square Shopping Mall & Apartment, UG No.91-92, Jl. R.A. Kartini, Lebak Bulus, Jakarta Selatan, 12440, Indonesia. Tel: +62 (021) 7592 1325 Email: poinssquare@eduworld.co.id Gading Serpong office: Ruko Glaze 1 No. A1, Jalan Boulevard Raya Gading Serpong, Pakulonan Barat, Klp. Dua Tangerang, Banten 15810 Tel: +62 (021) 2950 6970 Email: gadingserpong@eduworld.co.id Jl. Raya lenteng Agung No 49 - 50 Rt 001/07, Kelurahan Lenteng Agung, Kecamatan Jagakarsa, Kota Jakarta selatan, Kode Pos 12630 Tel: +62 878-5236-4882 Jl. Malaka No. 25AA (Simp. Jl. Jambi), Medan 20232, Indonesia Tel: +62 811605235 Fax: +62 61 664 3116 or +62 61 453 0395 Email: admissions@globaltotal.co.id SUN Plaza (Head Office): Jalan Raya Meruya Ilir No 20, West Jkt 11620, Indonesia Tel: +62 21 3111 18181 Email: kebonjeruk@suneducationgroup.com Kelapa Gading (Jkt) office: Boulevard Timur Kelapa Gading, Jln Boulevard Timur Raya Block NE1, No.57 Kelapa Gading, Jkt Utara 14240, Indonesia Tel: +62 21 4584 7909 Email: kelapagading@suneducationgroup.com Pondok Indah (Jkt) office: Gedung Pro Arena Jln Metro Pondok Indah, BB III Pondok Pinang Jkt Selatan, Indonesia Tel: +62 21 7592 1388 Email: pondokindah@suneducationgroup.com Senayan STC (Jkt) office: Senayan Trade Centre, Level 1, No. 55-58 Jln Asia Afrika, Jkt Pusat 10270, Indonesia Tel: +62 21 5793 6386 Email: senayanstc@suneducationgroup.com Pluit Timur (Jkt) office: Pluit Jln Pluit Timur Raya, No. 36C Pluit, Jakarta Utara 14450, Indonesia Tel: +62 21 6660 0999 Email: pluit@suneducationgroup.com Tanjung Duren (Jkt) office: Apt Mediterania Garden Tower C, Shop House Blok GCD, Jln Tanjung Duren Raya Kavling 5, Jkt Barat 11470, Indonesia Tel: +62 21 3004 7606 Email: tanjungduren@suneducationgroup.com Alam Sutera (Jkt) office: Jln Ruko Jalur Sutera 29D, NO. 28 Alam Sutera, Serpong Tangerang 15325, Indonesia Tel: +62 21 3110 8050 Email: alamsutera@suneducationgroup.com Bali office: Komplek Pertokoan Kertha Wijaya Blok B26, Jln Diponegoro No. 98, Denpasar 80114, Indonesia Tel: +62 361 222 774 Email: bali@suneducationgroup.com Bandung office: Ruko Paskal Hyper Square, Blok C6 Jln Pasirkaliki No. 25-27, Bandung 40181, Indonesia Tel: +62 22 860 60678 Email: bandung@suneducationgroup.com Batam office: Komplek Ruko Plaza Top, 100 Penuin Block C No.5, Batam 29441, Indonesia Tel: +62 856 6817 4959 Email: batam@suneducationgroup.com Cirebon office: Cirebon Jln. Ciremai No. 14 Pamitraan, Cirebon 45123, Indonesia Tel: +62 231 202725 Email: cirebon@suneducationgroup.com Lampung office: Lampung Jl. Raden Intan 57C, Tanjung Karang Bandar, Lampung 35118, Indonesia Tel: +62 721 255 662 Email: lampung@suneducationgroup.com Makassar office: Jln. H. Bau No. 21, Indonesia Tel: +62 411 852 866 Email: makassar@suneducationgroup.com Medan office: Jln. Prof MH Yamin SH No. 21C, Medan 20234, Indonesia Tel: +62 614 514 850 Email: medan@suneducationgroup.com Pekanbaru office: Pekanbaru Jln. Melur No. 19C Kec. Senapelan, Kel. Padang Bulan Pekanbaru, Riau 28156, Indonesia Tel: +62 823 8715 8000 Email: pekanbaru@suneducationgroup.com Semarang office: Ruko Mataram Square Jln. Karangwulan Utara, No.2 Unit 5, Semarang 50136, Indonesia Tel: +62 24 760 8488 Email: semarang@suneducationgroup.com Surabaya (East) office: Jln. Dharmahusada 141B, Surabaya 60285, Indonesia Tel: +62 31 592 0011 Email: surabaya.east@suneducationgroup.com Surabaya (West) office: Komp Ruko Golden Palace C-7, Jln. HR Muhammad 373 – 383, Surabaya 60188, Indonesia Tel: +62 31 732 2581 Email: surabaya@suneducationgroup.com Other branch offices: Yogyakarta, Palembang, Pontianak, Balikpapan, Samarinda Tangerang Office: Ruko Voronez Blok CA 24 No. 7, Gading Serpong (Dekat Mall Summarecon Serpong), Tangerang 15810, Indonesia Tel: +62 21 5421 0200 Email: info@ican-education.com Pluit Office: Pluit Village Mall, Level 2, No. 1 (Matahari Mall), Pluit Jakarta Utara Indonesia Tel: +62 817 5215 210 Email: pluit@ican-education.com Taman Palem Office: Taman Palem Lestari Blok A3 No. 59 Cengkareng, Jakarta Barat Tel: +62 817 5215 210 Email: palem@ican-education.com Bekasi office: Ruko Asia Tropis Blok AT 16 No. 28. Harapan Indah - Bekasi. Tel: +62 21 88894102 / +62 21 88895272 Email: bekasi@ican-education.com Medan Office: Jl. Labu No.1, Petisah Hulu, Kec. Medan Baru, Kota Medan, Sumatera Utara 20153. Other branch offices: Yogyakarta, Balikpapan, Samarinda, Manado, Batam, Tanjung Pinang, Semarang PT. IDP Consulting Indonesia, Atrium Mulia Building, 3rd Floor Suite 303, Jalan H.R.Rasuna Said Kav. B 10 - 11, Setiabudi, Jakarta 12910, Indonesia Tel: +62 21 2523291 Email: roy.samosir@idp.com telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": []
}