{
    "url": "https://www.nottingham.edu.my/International/Offerholders/Visasandimmigration/New-students-2016-Self-apply.aspx",
    "content": [
        {
            "p": "Important information on how to apply for your student visa. The Student Pass (visa) application is processed by the Immigration Department and Education Malaysia Global Services (EMGS). All international students will have the option of applying for their Visa Approval Letters (VAL) through the following methods: Option A: Applying via the UNM Visa Office Option B: Applying directly to EMGS Option A is the recommended method. However, students who opt for Option B can contact the UNM Visa Office if any assistance is required. All new student passes will be issued for the duration of the student's course however approval is entirely at the discretion of the Immigration Department. If your passport validity is insufficient, your visa will be issued for a duration of 12 months. However, it is recommended to have a passport validity that is beyond the duration of your studies. Please ensure that your passport validity is NO LESS than 18 months from the date of your registration. All international students will not be required to do a pre-arrival medical examination. However, students MUST fill up and on the ‘HEALTH DECLARATION FORM’ and submit it to the Visa Office for their VAL application. All international students who defer, withdraw, terminated, and completed studies are required to shorten/cancel their present student pass before leaving the country. They are required to get advice from the Visa Office on the necessary formalities. This is in line with the directive from the Malaysian Immigration Department guidelines NOT allowing international students to return home before shorten/cancellation is carried out. Any student fail to comply this guidelines will have their passport being blacklisted by the Immigration Department and the University will have no control over this decision. Students will only be required to undergo a post-arrival medical examination after arriving on campus. Any student who fails their post-arrival medical examination will have to return back to their home country and the university will not be responsible for any costs incurred. You are allowed to appeal for your post-arrival medical examination results but it is subject to EMGS approval. Only one appeal will be allowed by EMGS. All new international students must secure a Visa Approval Letter (VAL) before arriving in Malaysia. The application process can take up to three months so you are advised to submit your student pass application as early as possible to avoid any delays. February 2024 intake: 25 December 2023 April 2024 intake: 25 March 2024 June 2024 intake: 13 May 2024 June 2024 intake: 29 April 2024 September 2024 intake: 22 July 2024 September 2024 intake: 12 August 2024 September 2024 intake: 4 June 2024 *Students from Bangladesh, India, Nigeria and Pakistan are advised to submit their visa documents one month earlier to avoid delays in obtaining your Single Entry Visa (SEV). *The above deadlines do not apply to mobility/ exchange students/ students from partner universities. Please refer to your International Office for more information on visa application deadlines or email to International.Support@nottingham.edu.my 1) Create an account on the EMGS website 2) Create a Student Pass application. Required documents for this step are: 3) The EMGS portal will automatically calculate the cost of your visa. You are required to make a payment directly through the EMGS account - please refer to the instructions as indicated in the website. You are not required to transfer this processing fee to UNM Finance. 4) You will be issued with an application number and will be able to visit your account to monitor your application progress. 5) EMGS will ask you to submit additional documents if necessary during this stage and you are required to respond accordingly as instructed for the smooth processing of your VAL application. 6) You are also required to submit one set of all documents, including your full passport pages to the UNM Visa Office to approve your application to process your visa through EMGS, failure to do so will result in a non-approval of your VAL application by the Visa Office. This will halt your VAL application process and causes further delays. Passport attachment guidelines. 7) All international students will be required to pay a visa deposit fee of RM2000 via telegraphic transfer to the University’s bank account in Malaysia. The Visa Office will refund this fee once the students have submitted their passport for visa shortening/cancellation after completion of study or graduation before returning home. You may make the payment via MyNottingham portal. NOTE: All of the above information is accurate as of 9, February 2023 but is subject to change as EMGS/Immigration Dept refines the new online application system. Please refer to the EMGS user guide for further details on managing your application. Need more information? Refer to our guidelines below. Below is the VAL application checklist. Failure to submit any of these documents may result in an incomplete application that cannot be processed. VAL process can take up to five (5) to seven (7) weeks and at times may be slightly longer. All documents should be sent via email to apply.visa@nottingham.edu.my. New students who are holding current active (valid) passes in Malaysia (transferring students/ dependant visa holders/ other elite passes) may have to submit additional documents. Please refer to Special Circumstances for further information. The visa fee for students applying through EMGS varies depending on nationality and preferred insurance package. The EMGS visa fee includes the following: The visa fee does not include: Payment of these fees can be made by: a) CIMB Bank Berhad Payee Name: The University of Nottingham in Malaysia Sdn Bhd Bank account number: 8008306319 Bank Address: No. 17 Jalan Jelok 6, Metro Point, 43000, Kajang Selangor Darul Ehsan Swift code: CIBBMYKL b) Affin Bank Berhad Bank Account number: 100260005567 Bank Address: LTAT Branch, Bangunan LTAT, Jalan Bukit Bintang, 55100 Kuala Lumpur Swift code: PHBMMYKL Refund of visa fees Visa fees are non-refundable once the VAL application has been submitted by the Visa Office to EMGS. Please contact the Visa Office if you would like to withdraw your VAL application, and you will be advised on your eligibility for a refund. Once you have submitted your documents, the Visa Office will send them to EMGS for processing. Once EMGS has vetted through your documents, your application will be sent to the Immigration department for approval and issuance of the VAL. The entire process can take around 5 to 7 weeks and at times may be slightly longer. You can track the status of your application by using the EMGS Track My Application feature. EMGS and the University may request additional documents from you in this period, and delays in submitting the requested documents may affect your VAL issuance. Due to the length of the application processing period, you are not advised to book your flight to Malaysia until your VAL has been approved and sent to you. Once your VAL is approved by Immigration, you should do the following: Upon arrival in Malaysia, you should do the following: *Please note that the VAL and SEV are NOT the Student Pass. Students are responsible for completing the post-medical processes in a timely manner. For assistance and enquiries, please contact the Visa Office at Apply.Visa@nottingham.edu.my at +603 8924 8075 or Hotline +603 8924 8088 General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/Lampiran_B_-_Health_Declaration_Form_For_Applicant.pdf",
        "pdf_files/Student-Declaration-Form-Rev-6-01-02-2024.pdf",
        "pdf_files/Passport-attachment-guideline-002.pdf",
        "pdf_files/User-guide-for-Optional-PurchasesVISA.pdf",
        "pdf_files/Student-Declaration-Form-Rev-4-23-07-2019.pdf",
        "pdf_files/EMGS-Health04-Declaration-Form-updates-21-06-2019.pdf",
        "pdf_files/YellowFeverV-countries.pdf",
        "pdf_files/NOC-(2).pdf",
        "pdf_files/NOC-(2).pdf",
        "pdf_files/MyNottingham-How-to-make-a-payment.pdf",
        "pdf_files/KOMANWEL-Countries-Commonwealth-1.pdf",
        "pdf_files/NEGARA-TIADA-MALAWAKIL-Countries-w-o-Malaysian-Embassy-1.pdf"
    ]
}