{
    "url": "https://www.nottingham.edu.my/International/Offerholders/Arrival/Index.aspx",
    "content": [
        {
            "p": "As an international student there are a number of things you will have to do when you first arrive at The University of Nottingham Malaysia. These include: When you arrive go straight to the Accommodation Office to check-in to your accommodation.... After settling in to your accommodation you will then need to report to the International Student Support... After attending the International Student Support you will need to register with the University... Registration takes place at the start of each new academic year. Students have to sign a registration form which is your agreement to observe the University regulations, please refer to the registration timetable in order to know when and where you should proceed for registration. The registration check list is important to ensure that you have been through a proper and complete registration process. Registration information for current and upcoming intakes can be found in our offer holders section As a new international students you will be required to attend two University welcome programmes... It is compulsory for all new International Students to attend the following welcome programmes. The induction programme will cover all aspects of living and studying in Malaysia including: Please refer to the induction timetable. If you have any questions during the registration week, you are welcome to drop by the International Office or call us on +6 03 8924 8000. The International Student Support Office is responsible to assist all international students. We provide essential documentation such as letters on living expenses and invitations for visas and opening bank accounts. We welcome visits from international students and can advise you on the professional support services offered by The University of Nottingham Malaysia. Feel free to seek advice if you have any problems relating to living and studying in a foreign country. You may drop-in the email to us at international.support@nottingham.edu.my or telephone +6 (03) 8924 8750. telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": []
}