{
    "url": "https://www.nottingham.edu.my/International/LifeinMalaysia/Culture/Festivals.aspx",
    "content": [
        {
            "p": "Arguably, there are two things that define Malaysian culture: the food and the festivals. With a mix of different races, religions and cultures, Malaysians celebrate a variety of festivals. At UNM, we understand that international students coming from diverse backgrounds may have questions about Malaysia and its rich cultural heritage. Here’s a glimpse of what you can expect in this country. Malaysia is a multiracial and multicultural country. The population comprises various ethnicities, including Malays, Chinese, Indians and indigenous groups. This diversity is reflected in Malaysia’s languages, customs, religions, festivals and cuisines. Malaysia also has a history rooted in its indigenous heritage, colonial influences and influences of its neighbouring countries. This can be seen in various art forms, music, dance and craftsmanship. One of the best ways to explore Malaysia’s cultural heritage is to visit its beautifully preserved historical sites, museums, architectural landmarks and UNESCO-listed sites such as Melaka City, Georgetown, and Kinabalu Park. Each offers unique insights into Malaysia’s rich history and diverse cultures. Unique to Malaysia is the “open house” concept where ─ during the various cultural and religious festivals such as Chinese New Year, Hari Raya Puasa, Deepavali and Christmas ─ friends, families and even strangers would visit the homes of those who are celebrating the festival, to wish them well and enjoy the feast prepared by their hosts. Listed below are several religious and cultural festivals celebrated by Malaysians, as well as a handy description of their backgrounds. Hindus celebrate Thaipusam on the tenth month of the Hindu Lunar Calendar. Thaipusam is a Hindu festival celebrated mostly by the Tamil community on the full moon in the Tamil month of Thai (Jan/Feb). The word Thaipusam is derived from the month name Thai and Pusam, which refers to a star that is at its highest point during the festival. The festival commemorates both the birthday of Murugan (also Subramaniam), the youngest son of god Shiva and his wife Parvati, and the occasion when Parvati gave Murugan a vel (spear) so he could vanquish the evil demon Soorapadman. The festival is best witnessed at Batu Caves in Kuala Lumpur and in Penang. The Lunar New Year highlights some of the most fascinating aspects of Chinese tradition and rituals. This festival is celebrated by the Chinese community in Malaysia. It is commonly known as a time for family reunions, firecrackers, the lion dance, mandarin oranges and giving/collecting ‘Ang Pow’ (Red Packets with money in them). The festival, which once also marked the beginning of spring in China, begins on the first day of the lunar calendar year (the first day of the new moon) and ends on the 15th day, known as Chap Goh Meh (the last day of the full moon). Malaysian Christians gather in churches around the country for services to mark the “saddest day” in the Christian calendar. Many churches hold several services, including one at 3pm – the hour Christ is traditionally said to have resurrected. The most significant celebration for Muslims, Eid Ul-Fitri, marks the end of the fasting month of Ramadan. The words ‘Hari Raya’ means day of celebration in Malay language. Known locally as Hari Raya Puasa or Hari Raya Aidil Fitri, the celebration is determined by the sighting of the new moon on the day before the next month on the Muslim calendar, Syawal. Hari Raya Haji literally means the ‘festival of pilgrimage’. This festival is celebrated by Muslims to honour pilgrims who have completed their Haj (pilgrimage) to Mecca. Hari Raya Haji falls on the 10th day of the month of Dzulhijjah, the last month of the Muslim Calendar. Also known as Hari Raya Qurban, which means the festival of sacrifice. Traditionally, a cow or goat is sacrificed as a food offering to the poor. Celebrated by Hindus as the day the evil Narakasura was slain by Lord Krishna. Signifying the triumph of light over darkness and good over evil. Deepavali is also known as Diwali, or the Festival of Lights. Light is significant in Hinduism because it represents goodness. So, during the Festival of Lights, ‘deeps’, or oil lamps, are burned throughout the day and into the night to ward off darkness and evil. The observance of the birth of Jesus Christ on December 25 is celebrated in Malaysia like other parts of the world. It is a time for family and friends, hope and rejoicing, love and understanding, and giving and forgiving. Malaysia commemorates her independence every year on 31 August. This day is celebrated with parades, cultural performances and patriotic displays throughout the nation to showcase national unity and pride. Bahasa Malaysia is the official language of Malaysia. English is widely spoken as well, especially in the cities and in educational institutions. Many Malaysians are also fluent in their ethnic languages, such as Mandarin, and Tamil. Malaysia is a haven for food lovers with a diverse array of culinary delights. The country’s cuisine reflects its multicultural heritage. There is a blend of Malay, Chinese, Indian and indigenous influences. From the national ‘nasi lemak’ dish to ‘roti canai’, ‘laksa’ and ‘curry mee’, the food here will awaken your taste buds. With numerous races and religions, Malaysia also boasts a rich artistic heritage. This can be seen in its intricate batik designs, traditional dances such as the graceful “tarian Zapin” and captivating lion dance, wood carvings, songket weaving and “wayang kulit” (shadow puppetry). Malaysia’s arts and crafts showcase excellent craftsmanship and the cultural nuances of different communities. While Malaysia is a modern nation, respecting local customs and traditions is still vital. Malaysians are known for their warm hospitality, politeness and modesty. Some cultural etiquettes to keep in mind include removing your shoes when entering someone’s home, respecting elders and dressing modestly when visiting religious sites. If you’re an international student studying at UNM, the following are some places in Malaysia that will allow you to soak in the culture and heritage of this country: In Kuala Lumpur: Petronas Twin Towers, Batu Caves, Merdeka Square In Penang: Georgetown, Penang Hill, Kek Lok Si Temple In Langkawi: Pantai Cenang, Lagenda Park, Telaga Tujuh Waterfall, Galeria Perdana In Melaka: A Famosa, Jonker Street, Christ Church Melaka In Cameron Highlands: Mossy Forest, BOH Tea Centre, tea plantations In Borneo (Sabah & Sarawak): Mount Kinabalu, Kinabalu National Park, Bako National Park At UNM, we embrace and celebrate Malaysia’s diversity. We encourage you to immerse yourself in the rich Malaysian culture and hope that you’ll make lifelong friendships and create unforgettable memories during your academic journey in this nation. Feel free to reach out to our international student services office for assistance in exploring Malaysia and making the most of your time at the UNM. Don’t miss out on celebrating the cultural festivals in Malaysia. Some festivals may lead to crowded venues and increased traffic. If you plan to travel during festivals in Malaysia, plan accommodation and transportation in advance. Some services might be limited or have altered schedules during public holidays. Yes absolutely! Many festivals have open celebrations where everyone is welcome to join the festivities, witness cultural performances, taste traditional foods, and experience the vibrant, festive atmosphere. Yes, student clubs and associations often have events to celebrate the many festivals in Malaysia. Local tourism boards, event calendars and official government websites provide information about festival dates, events and locations. Yes, you will be able to stay at your on-campus housing during public holidays if you do not intend to travel or return to your hometown during festivals. Some of the F&B outlets may be closed during these times. Contact us for more accurate and updated information, as details may change depending on the festival being celebrated. telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": []
}