{
    "url": "https://www.nottingham.edu.my/International/LifeinMalaysia/Finance/Banking.aspx",
    "content": [
        {
            "p": "It is advisable to open a bank account whilst you are studying in Malaysia. It is the safest and most convenient way of managing your finances and enables you to: To open a bank account in Malaysia you will need the following: This ATM is available on campus under Affin Bank ─ located at Block H, the Student Association Building. This ATM is linked with MEPS, PLUS, CIRRUS, Maestro. The networks enable you to withdraw money by using ATM cards from other banks with the same network / credit cards from around the country. There are branches of local and international banks in Semenyih and Kajang area. All international students are strongly recommended to go to the nearest bank for your own convenience. Explore the options carefully to find out which one will suit your needs. Ensure that your account is active even if you are not in Malaysia for more than two months and maintain a balance of RM100. Semenyih Malayan Banking Berhad Jalan Pasar 2, Bandar Semenyih Semenyih, Selangor telephone: +6 03 8723 8611 / 8612 / 8613 website: www.maybank2u.com.my Kajang No 1 Jalan KP 1/2 Taman Kajang Prima Kilometer 5 Jalan Kajang-Semenyih 43000 Selangor telephone: 1300 880 181 / +6 03 20507676 website: www.hsbc.com.my Semenyih No. 25, Jalan Besar 43500 Semenyih, Selangor telephone: +6 03 87239609/7605, +6 03 87239571 website: www.ambg.com.my Kajang 36 & 37, Jalan Prima Saujana 1/1A Taman Prima Saujana, Seksyen 1 43000 Kajang, Selangor telephone: +6 03 87397288 website: www.standardchartered.com.my Semenyih 22B & 23, Jalan Besar 43500 Semenyih, Selangor telephone:+6 03 8723 8811 / 8812, +6 03 8736 8895 website: www.publicbank.com.my Kajang No. 14, 15 & 16 Jalan Raja Haroun 43000 Kajang, Selangor telephone: +6 03 8733 5752, +6 03 8733 5754 website: www.publicbank.com.my Semenyih No. 7 & 9, Jalan Pasar Baru 2 Seksyen 3 Bandar Semenyih 43500 Semenyih, Selangor telephone: +6 03 87248639 website: www.hongleong.com.my Kajang 2 & 3 Jalan Saga Taman Sri Saga Off Jalan Sg. Chua 43000 Kajang, Selangor telephone: +6 03 8737 7435 / 7436 / 7437 website: www.affinbank.com.my For further information please contact International Student Support Team in the Enquiry Centre (International Office) at +60389248778. telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": []
}