{
    "url": "https://www.nottingham.edu.my/International/Prospective-Students/Region-Specific-Information/Central-Asia.aspx",
    "content": [
        {
            "p": "Studying at UNMC provides me with an opportunity to get a British education that is valuable all over the world at an affordable price, and is in one of the most beautiful and interesting countries in Asia. I do not have to sacrifice the quality of education. UNMC and its programmes are recognised all over the world with its graduates having better job prospects in comparison to other universities. The study experience at UNMC provides an opportunity to have a memorable, enjoyable student life. It creates a balance between academics and social life. UNMC has all the necessary facilities for the student to enhance the learning experience and the location of the university is set in the outskirts of the city in a calm, serene environment. Asel Ruslan Kyzy from Kyrgyzstan, studying BSc (Hons) International Business Management Studying my Bachelor’s degree at UNM has been one of the most valuable decisions in my life. This international campus, located in peaceful and prosperous Malaysia, gives me an opportunity to get high-quality education from the Russel Group member, to expand an international outlook and to become highly qualified for future careers. I strongly believe that the ecosystem of Nottingham University in aggregation with potential of Malaysia’s working environment will result in future leaders across all industries. One of the main features of Nottingham University is that it has 3 campuses globally. Throughout my 4-year degree I had a chance to represent UNM in Tri Campus competition, which is annually carried in Malaysia, UK and China. Furthermore, I also did my exchange programme to Ningbo (China) and Nottingham (UK) campuses while paying the same fees as for Malaysian campus. In my opinion, UNM has a perfect mix between academic and student life, cultural diversity and pleasant studying atmosphere that further results in experienced and outstanding fresh graduates. Beksultan Tursunkhanov from Kazakhstan, studying BSc (Hons) Finance, Acoounting and Management Students from Central Asia are usually required to complete a Foundation programme, prior to entering a degree programme. Download the Foundation international entry requirements list here. Students who have completed an international pre-university qualification such as A levels, IB, SATs (both SATr and relevant SAT subject tests) Australian/Canadian matriculation are eligible for first year entry into a degree programme, and can find the relevant entry requirements by searching for their course. Students with other qualifications or transferring students may be admitted on a case-by-case basis. Students holding degrees from universities in Central Asia may be admitted on a case-by-case basis. Applying for MPhil/MRes/PhD programmes are slightly different. Students have two routes to gaining admission: a) Students can pre-apply, by submitting their research proposal and academic transcript to the supervisor of their choosing (find a supervisor by looking through the 'People' tab under the relevant (school or department) and putting in an application after the supervisor has approved their research. b) Students who have no preference of their supervisor can put in an application online immediately. The International Officer for Central Asia is Teoh Tze Imm. Use our online enquiry form for making an enquiry about studying at the University. See our full recruitment event schedule On this website: Other resources: telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": [
        "pdf_files/foundation-CA.pdf"
    ]
}