{
    "url": "https://www.nottingham.edu.my/International/Prospective-Students/Region-Specific-Information/SEA1.aspx",
    "content": [
        {
            "p": "Psychology & Cognitive Neuroscience is not a piece of cake but the lecturers are ready to help when we have any doubts. They are active within a global Psychology network acquiring great information to answer our questions. UNM has been able to strengthen my academics with additional support of opportunities available. UNM is surrounded with nature making it a peaceful university that keeps me focused on my studies while knowing there is the availability of shuttle services when there is a need to breathe fresh air away from academics. In-campus offers escape by often brewing a great range of activities from finance, science to creative events open for all to keep you busy in the leisure aspect. I chose UNM to live independently and to study my desired course in a reputable university. Furthermore, it is convenient to have the University experience while being close to home. I would highly recommend studying here as it is an all-in-one campus. Nottingham had given me the chance to develop my interpersonal skills as well as a head-start to my career making it a fruitful journey. To sum it up, UNM is making my years in University live up to the famous quote of, “University is the best time of your life.\" Siti Nur Izzah Binti Alwi from Brunei, studying BSc (Hons) Psychology and Cognitive Neuroscience Throughout my 4 years at the University of Nottingham Malaysia, I obtained various vital skills from my experiences there. Academically, I had the honour to engage with interactive lectures and lab sessions; which were supported by helpful lecturers and seniors. My learning experience was pleasant as there were plenty of decent learning resources/facilities on campus, such as the TCR, Library, and personal tutor system. The abilities that I acquired (such as troubleshooting, critical thinking, and writing skills) have proved useful in the workplace. Furthermore, they have helped me secure offers for postgraduate degrees at respectable universities. Outside of the academic aspect, the Clubs & Societies experience was an invaluable one. I got to expand my social circle from meeting peers from various backgrounds, allowing me to hone my communication skills. In fact, the experience was so great that I decided to contribute more to a club (Nottingham Dance Club) as a committee member for 3 consecutive years. This allowed me to develop my leadership, team management, time management, and task management skills. Besides, it was fun being able to hang out with friends from all over the world, 24/7 on campus (there are plenty of good spots to have long, comfortable conversations at!). Being an international student definitely did not put me at any disadvantages as the local students and staff members were very welcoming and friendly. As an additional point, Malaysia (Semenyih to be exact) is a very livable place. Albeit a little remote, there are viable modes of transportation which allow access to affordable and delicious food and plenty of exciting places around, waiting to be explored. Matteo Putra from Indonesia, graduate of year 2019 in BSc (Hons) Biomedical Sciences Ijazah Sekolah Menengah Umum (SMU) 3 / Ijazah Sekolah Menengah Atas (SMA) / Ijazah Sekolah Menengah Kejuruan (SMK) / Ijazah Madrasah Aliyah : Minimum overall average of 70%, including 70% in required subjects. Students are also required to meet English language requirement. Students who have completed an international pre-university qualification such as A levels, IB, and Australian/Canadian matriculation (or equivalent) are eligible for first year entry into a degree programme. Find the relevant entry requirements by searching for your course. Students who are applying for credit transfer to Year 2 may be admitted on a case-by-case basis. Postgraduate taught programmes: Most of our Masters level programme require at least a second or an upper second class honours degree (or international equivalent). Non-UK qualifications will be assessed against this standard. Postgraduate research (ie. MPhil/MRes/PhD): You will need to make contact with a potential supervisor from the relevant department/school before submitting an application online. Click here for more information. The International Officer for Southeast Asia is Nursahira Mohamad Kamarudin. See our recruitment event schedule On this website: List of international agents UNM in your country Visa and Immigration Life in Malaysia Study abroad opportunities UNM Summer Schools Other resources: telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": [
        "pdf_files/Contacting-Potential-Research-Supervisors.pdf"
    ]
}