{
    "url": "https://www.nottingham.edu.my/International/Offerholders/Visasandimmigration/Returning-student.aspx",
    "content": [
        {
            "p": "All international students who defer, withdraw, terminated, and completed studies are required to shorten/cancel their present student pass before leaving the country. They are required to get advice from the Visa Office on the necessary formalities. This is in line with the directive from the Malaysian Immigration Department guidelines NOT allowing international students to return home before shorten/cancellation is carried out. Any student fail to comply this guidelines will have their passport being blacklisted by the Immigration Department and the University will have no control over this decision. If your visa has expired and you have not renewed it yet, you should immediately visit the Visa Office for consultation. You can also reach the relevant visa officers urgently at +60 3 8924 8257 or Hotline +60 3 8924 8088. Students who are progressing from one year to another of a course (e.g. Year 1 to Year 2 and Year 3) must renew their student pass. However, students who are progressing from Foundation to UG or UG to Masters/ MPhil/ PhD must apply for a new eVAL (see Special Circumstances). Eligibility to renew your Student Pass: The EMGS (Ministry of Higher Education) and Immigration Department will only approve the student pass renewal if students meet the following criteria; The Immigration Department of Malaysia reserves the right to extend or deny any student pass it sees fit. Students are advised to submit their passport for student pass renewal at least four (4) months before the expiry of their current pass. This is to ensure that there is sufficient processing time for external bodies and to avoid applying for the Special Pass or overstaying. There are two main criteria to fulfil in order to renew your student pass; Students can appeal for their student pass renewal if has been denied. however the reserves the right to extend or deny student passes for any period of time. For students having student passes issued for the full duration of their studies (3 years), they MUST renew their i-Kad annually. Failure to do this may lead to revocation of their student pass by the Immigration Department without prior notice, resulting in the student having to be sent back to their home country. i-Kad Renewals are done annually: The Immigration Department reserves the right to extend or deny any i-Kad renewals. Failure to renew will lead to the revocation of the student pass by the Immigration Department and the student being sent back to their home country. Submit the following documents to the Visa Office: Students who are applying from campus are encouraged to submit hard copies of the above documents. Students who are applying for renewal from abroad are allowed to submit soft copies of their documents. Students will be notified to submit their passport to the Visa Office once EMGS has supported their student pass renewal application. The Visa Office shall hand over the student's passport to the EMGS for the student pass (visa sticker) endorsement. The average processing timeline for student pass renewal is around 14-21 working days, at times this can be delayed depending on Immigration Department. You are NOT allowed to make any travel plan arrangements while your passport is being processed at the Immigration Department. The student pass renewal fee of RM1,250 is payable after your student pass (visa sticker) has been renewed and you may make your payment through the MyNottingham portal. Please print the receipt of payment and present during passport collection to Visa Office. Students who DO NOT qualify for the Student Pass renewal include: If you have lost your passport, please do the following: If you have renewed your passport, please do the following: Please make sure to have the visa sticker transferred to your new passport to ensure a smooth process. Failing this process may hamper your travelling plans. UNM's Visa Office can assist you with your visa renewal at any time of the year as long as it complies to Immigration Department's rules and regulations. For consultation: Operational hours: Monday to Friday from 9:30am to 5:00pm (closed on weekends and public holidays). Please visit the Visa Office at Student Services Centre, Block H Email: visarenewal@nottingham.edu.my Call +60 3 8924 8078 or Hotline +60 3 8924 8088 General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}