{
    "url": "https://www.nottingham.edu.my/International/Prospective-Students/Region-Specific-Information/East-Asia.aspx",
    "content": [
        {
            "p": "Nottingham Malaysia provides modules that are really needed by the students for their future work and job. For example, there are not many universities which offer the opportunity to learn Auto CAD in year 1. However, the university teaches it from the first year so that the students have the chance to be familiar with this computer processing program. Moreover, the lecturers of UNMC know how to communicate with the students. They encourage the students to do their best and maintain regular communication with them to enhance the learning quality. Lecturers respond promptly to students’ questions and they are interested in students’ opinions about the lecture topic and how it was conducted. Activity week is a valuable experience that I really enjoy. In this week, group members work together to produce the best result. They plan, study, calculate, process and present about the topics given to them. Students are prepared for work place as professional engineers. Kim Tae Yeon from South Korea, studying MEng Chemical Engineering In 2018 April, I joined University of Nottingham Malaysia as Foundation student in Business school and currently I am taking Business Economics and Management as my major of undergraduate. My first impression of this university is that University of Nottingham has diverse culture and good education system. As we know, there are a lot of international students studying here and each of them have different thought towards lifestyle and studies. I have enjoyed interacting with not just them but even Malaysian friend on and off campus. In terms of education, there is an advantage which I can have British education while staying at Malaysia. Also, UNM provides tutor service which helps me a lot regarding study. For those reasons, I definitely recommend others to study in UNM and get the precious experience here Genta Taguma from Japan, studying BSc (Hons) Business Economics and Management Students from East Asia are usually required to complete a Foundation programme, prior to entering a degree programme. Download the Foundation international entry requirements list here. Students who have completed an international pre-university qualification such as A levels, IB, SATs (both SATr and relevant SAT subject tests) Australian/Canadian matriculation are eligible for first year entry into a degree programme, and can find the relevant entry requirements by searching for their course. Students with other qualifications or transferring students may be admitted on a case-by-case basis. Students holding degrees from universities in East Asia may be admitted on a case-by-case basis. Applying for MPhil/MRes/PhD programmes are slightly different. Students have two routes to gaining admission: a) Students can pre-apply, by submitting their research proposal and academic transcript to the supervisor of their choosing (find a supervisor by looking through the 'People' tab under the relevant school or department and putting in an application after the supervisor has approved their research. b) Students who have no preference of their supervisor can put in an application online immediately. The International Officer for East Asia is Teoh Tze Imm. See our recruitment event schedule On this website: List of international agents UNM in your country Study abroad opportunities UNM Summer Schools Immigration, Insurance & Arrival Information Life in Malaysia Other resources: telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": [
        "pdf_files/foundation-EA.pdf"
    ]
}