{
    "url": "https://www.nottingham.edu.my/International/studyabroad/Outgoing/Fees/Applications.aspx",
    "content": [
        {
            "p": "Students who are interested in participating in the exchange programme for Year 2024/2025 (Full Year / Autumn / Spring) can proceed with the online application. You will need to enter your UNM username and password to access the application form. (It is advisable to use your personal computer/laptop to login and submit the application. Do not use your handphone to do this.) Students are advised to read the application guidelines carefully before start to filling in the online application. Prior to completing the online application, students are required to: Inter-campus Exchange to UK or China Campus Exchange to Selected U21 or Selected University Partners The online application for Inter-campus Exchange & University Partners will be available as below; 2024/2025 (Full Year 2024-2025/ Autumn 2024 / Spring 2025) 1 February 2024 - 28 February 2024 Spring 2025 (2nd Batch Application) 1 August 2024 - 30 August 2024 The online application will be disabled at this date and no further applications will be considered. Inter-campus exchange to UK or China Campus & Selected University Partners (Full Year 2024-2025/Autumn 2024/Spring 2025) Inter-campus exchange to UK or China Campus & Selected University Partners (Spring 2025) Kindly refer to the study aboard opportunities by school. Important Notice: 1. Students are eligible to apply for only one of the following programmes but not both at the same time: 2. Penalty of RM1,000 - No deposit is required for the application, however a penalty of RM1,000 will be imposed and charged to student's tuition account for any withdrawal cases after being accepted by the school except for visa rejection or school rejection. 3. For the international students - if you are applying for the exchange programme, you are fully responsible for your Malaysian student visa requirement. Kindly get assistance from the UNM Visa Office with regards to your Malaysian visa to/from Malaysia. 4. Students from the same nationality as the host campus, are not eligible/qualify to apply for the exchange programme. These students can apply to other host campus as long as not to their home country. For example; British nationality cannot apply to go for the exchange to UK Campus or Chinese China nationality cannot apply to go for the exchange to Ningbo Campus. 5. Extension of the exchange period - Any request for the exchange extension will not be approved/granted once you have submitted the application or while you are on the exchange period at the host campus. 6. Exchange Quota: There are limited quotas for Engineering, Business School & selected schools in Faculty of Science. Quota will be determined by the host campus and subject to change on yearly basis. 7. Please take note that UNM will not be responsible or liable for any changes in the current SOP made by the Government of Malaysia or of the host country, which may prohibit you from going on with the exchange. UNM will continue to assist you with your arrangements as appropriate but you are responsible for any loss/risk that occurred during the process for your exchange. Information stated are subject to change from time to time without prior notice. telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": [
        "pdf_files/Module-Preference-Form-all-2023.pdf",
        "pdf_files/Acceptance-Declaration-Form-2023-All-Schools-website.pdf"
    ]
}