{
    "url": "https://www.nottingham.edu.my/International/Prospective-Students/Region-Specific-Information/Middle-East.aspx",
    "content": [
        {
            "p": "Qussai Swaidan from Jordan, studying BEng (Hons) Civil Engineering I chose Nottingham Malaysia due to the uniqueness of my course, BSc in Applied Psychology and Management. It blends between the psychology and management aspects which are deemed as an important combination for today's world. Not limited to the excellent academic experience I enjoyed, Nottingham offered me a variety of extracurricular activities that cater to all interests. I mostly enjoyed organizing events, working with people and polishing my personal skills. My experience has broadened my views and encouraged me to keep on improving myself. Taiba Hasan Khairalla Mohamed Mohamedi from Bahrain, studying BSc (Hons) Applied Psychology and Management Studies Students from the Middle East are usually required to complete a Foundation programme, prior to entering a degree programme. Download the Foundation international entry requirements list here. Students who have completed an international pre-university qualification such as A levels, IB, SATs (both SATr and relevant SAT subject tests) Australian/Canadian matriculation are eligible for first year entry into a degree programme, and can find the relevant entry requirements by searching for their course. Students with other qualifications or transferring students may be admitted on a case-by-case basis. Students holding degrees from universities in the Middle East may be admitted on a case-by-case basis. Postgraduate taught programmes: Most of our Masters level programme require at least a second or an upper second class honours degree (or international equivalent). Non-UK qualifications will be assessed against this standard. Postgraduate research (ie. MPhil/MRes/PhD): you will need to make contact with a potential supervisor from the relevant department/school before submitting your application online . Click here for more information. The International Officer for the Middle East is Nursahira Mohamad Kamarudin See our full recruitment event schedule On this website: List of international agents UNM in your country Study abroad opportunities UNM Summer Schools Immigration, Insurance & Arrival Information Life in Malaysia Other resources: telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": [
        "pdf_files/foundation-ME.pdf",
        "pdf_files/Contacting-Potential-Research-Supervisors.pdf"
    ]
}