{
    "url": "https://www.nottingham.edu.my/International/LifeinMalaysia/Culture/Adventure.aspx",
    "content": [
        {
            "p": "Malaysia, truly Asia! With magnificent landscapes ranging from pristine beaches to colonial-era hilltop farms, make the most of your time in sunny Malaysia by spending your holidays exploring the country. Here are some of our top picks: Pulau Perhentian Located in the eastern state of Terengganu, this island paradise is frequently found on 'Best Beaches in the World' lists. The crystal clear waters are home to many species of coral, shark and turtle, to name a few. The island is also affordable, making it a favourite haunt of both locals and students alike. Take note: the east coast islands are usually closed to tourists from November to May due to the monsoon, so call ahead! Pulau Langkawi Pulau Langkawi is located westwards, off the state of Kedah. Known for it's cascading paddy fields and traditional Malay homes, Langkawi is a great place to head for a lazy weekend away. Available activities include island-hopping, snorkelling and parasailing. Langkawi is also a duty-free island, so don't forget to go shopping! Pulau Sipadan East Malaysia is rich with beautiful beaches, but the biodiversity of marine life in Pulau Sipadan makes it an internationally recognised standout. Formed by living corals risen out of an ancient volcano, the mainland is covered by rainforest which is home to countless species of bird while scuba divers count hammerhead sharks, parrotfish, manta rays and green turtles as some of the sea creatures one can expect to see in the dazzling waters off the coast. The highest peak in Malaysia, Mount Kinabalu. Or a little closer to home, Broga Hill, which is down the road from UNMC Taman Negara, the oldest tropical rainforest in the world Bako National Park, the Sarawakian habitat of the rare proboscis monkey Mulu Caves, the UNESCO World Heritage Site for seasoned spelunkers Batu Caves, for a cultural experience in a cave telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": []
}