{
    "url": "http://www.nottingham.edu.my/International/studyabroad/Incoming/Study-Abroad-Programme.aspx",
    "content": [
        {
            "p": "Students from outside Malaysia who would like to spend a part of their degree at the University of Nottingham Malaysia may be able to do so through the Study Abroad Programme. Fee-paying students are able to apply from any university. An agreement between The University of Nottingham and your home university is required before an offer is issued. Modules are available across most disciplines and are part of the regular undergraduate curriculum, enabling international study abroad students to study alongside Malaysia Campus home students. A Study Abroad student will be required to pay the tuition fee to cover the cost of tuition as published on University Tuition Fees. Due to the new Ministry of Higher Education and Malaysian Immigration recent ruling, all International students planning to study in Malaysia MUST apply for the Visa approval to study in Malaysia BEFORE entering Malaysia. Failure to obtain this Visa approval letter on time will lead to International students not allowed to enter Malaysia and register with the University. The University will not be liable for any action taken by the Malaysian Immigration Authorities if you do not adhere to this new ruling. Application fee The University charges an application fee of RM200 for international students applying for all courses (foundation, undergraduate and postgraduate/research). All international applicants must complete and attach the application fee form (pdf) as well as proof of payment. Ways to pay: You should contact the Study Abroad Office at your Home University and Faculty Office to get an approval for study abroad. Once you get the approval please proceed with the application. Paper applications Complete and send us the following forms: Also attach the following supporting documents: Nomination from home University: Application deadline : Visa Application deadline : When nominating students, partners must submit an official transcript. All International Study Abroad applicants must be current students at an overseas university or college of higher education and have completed at least one year of study at their home university. The minimum academic requirement is a GPA of at least 3.0 (or equivalent). Students from non English speaking Partner Universities will be required to submit proof of English certificates (e.g. IELTS / TOEFL). For more info, please email INTERNATIONAL SUPPORT Please specify which modules you would like to study whilst you are at UNM. For more information please refer to our course listing. Students should also: All international mobility students studying in Malaysia will be required to obtain a Student Mobility Pass. For more detailed information on steps/payments, please visit our offer holders section. In compliance with the Malaysian Ministry of Education, all full time international students who are planning to study at any higher education institution in Malaysia are required to undergo a health examination without exception. All international students are also required to obtain medical and health insurance throughout their period of study in Malaysia. The University of Nottingham Malaysia has arranged for a Group Hospital and Surgical Insurance Plan to deal with any health emergencies that might arise during your period of study. telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": [
        "pdf_files/Application-Fee-Form.pdf",
        "pdf_files/Applicationfeeform.pdf",
        "pdf_files/Module-Preference-Form.pdf"
    ]
}