{
    "url": "http://www.nottingham.edu.my/International/studyabroad/Outgoing/Opportunities-by-school.aspx",
    "content": [
        {
            "p": "The factsheets below are organised by programme(s) and application deadlines. If your school or department does not appear beneath a certain programme(s), that means your school currently does not participate in study abroad programme. Inter-Campus Exchange: UK Campus & Ningbo Campus, CN International Exchange - University Partners: Concordia University, University of Birmingham, University of Glasgow, University of Queensland, Sciences- Po De Toulouse, Tec De Monterrey, The University of Groningen, The University of New South Wales, Universidad del Desarrollo, Aarhus University, Shiga University, Chung-Ang University and Yonsei University (PG). Full Year / Autumn / Spring Exchange: Applications open on 1 February - 28 February. For more info regarding Chung-Ang University, please click here. All appplications can be made through the Outgoing Exchange Online Application under the International Student Support Department. Spring Exchange: Applications open on 1 August - 30 August. * International Exchange to University Partners (limited seats available) IMPORTANT NOTES: 1. Information on the exchange programme; Please refer to the link below for more info, http://www.nottingham.edu.my/International/studyabroad/Outgoing/Opportunities-by-school.aspx 2. Exchange Online application to UN UK, UNNC and University Partners will be available as below; 2024/2025 (Full Year 2024-2025/ Autumn 2024 / Spring 2025) - 1 February 2024 - 28 February 2024 Spring 2025 (2nd Batch Application) - 1 August 2024 - 30 August 2024 The online application will be disabled at this date and no further applications will be considered. 3. Details of application deadline for 2024/2025: Inter-campus exchange to UN UK, UNNC & Selected University Partners (Full Year 2024-2025/Autumn 2024/Spring 2025) Autumn Semester 2024 (Sept 2024- Jan 2025) / Full Year 2024-2025 (Sept 2024 - June 2025) / Spring 2025 (Jan/Feb 2025 - June 2025) Application starts: 1 February 2024 Application Deadline: 28 February 2024 Inter-campus exchange to UN UK, UNNC & Selected University Partners (Spring 2025) Spring Semester 2025 (Jan/Feb 2025 - June 2025) Application starts: 1 August 2024 Application Deadline: 30 August 2024 4. Courses are NOT eligible for Exchange Programme as below; - BSc (Hons) Applied Psychology and Management - BEng/MEng (Hons) Mechatronics Engineering - MPharm (Hons) Pharmacy (2+2) - School of Mathematical Sciences 5. All undergraduate students (Year 1) are eligible to apply for this exchange and subject to schools’ requirements. For Feb Intake Students - FASS -students can apply in the current month of August to go in Jan/Feb in the following year for 1 semester only (Spring). Apply in Year 2 semester 1 to go in Year 2 semester 2. - FoE (MEng only) - students can only apply in the month of Feb next following year to go in Sept for 1 year. Apply in Year 2 semester 1 to go in Year 3 semester 1. 6. UK Exchange Quota: There are limited quotas for Engineering, Business School & selected schools in Faculty of Science. Quota will be determined by UK Campus and subject to change on yearly basis. 7. Exchange/Mobility and/or transfer may also not be possible due to citizenship, regulatory, or other rules in the destination country. For example; Students from the UK cannot apply for exchange/transfer back to UN UK and students from China cannot apply for exchange/transfer back to UNNC. 8. Extension of the exchange period - Any request for the exchange extension will not be approved/granted once you have submitted the application or while you are on the exchange period at the host campus. 9. Please take note that UNM will not be responsible or liable for any changes in the current SOP made by the Government of Malaysia or of the host country, which may prohibit you from going on with the exchange. UNM will continue to assist you with your arrangements as appropriate but you are responsible for any loss/risk that occurred during the process for your exchange. Should you have any further enquiry, please do not hesitate to contact Ms Nor from International Student Support (ISS) - Outgoing Exchange Coordinator at Nor.Shahila@nottingham.edu.my Information stated here are subject to change from time to time without prior notice. telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": [
        "pdf_files/2019-UK-Chemical.pdf",
        "pdf_files/2019-UK-Civil.pdf",
        "pdf_files/2024-UK-EE.pdf",
        "pdf_files/2019-UK-Mechanical.pdf",
        "pdf_files/2023-UK-NUBS2.pdf",
        "pdf_files/2024-UK-Economics.pdf",
        "pdf_files/2023-UK-SMLC.pdf",
        "pdf_files/2023-UK-PHIR.pdf",
        "pdf_files/2023-UK-English2.pdf",
        "pdf_files/2020-UK-Education.pdf",
        "pdf_files/2023-UK-Biosciences.pdf",
        "pdf_files/2022-UK-EGS.pdf",
        "pdf_files/2022-UK-Computer-Science.pdf",
        "pdf_files/2024-UK-Psychology2.pdf",
        "pdf_files/2024-UK-Biomedical.pdf",
        "pdf_files/2023-UK-Pharmaceutical-HS.pdf",
        "pdf_files/2019-Ningbo-Chemical.pdf",
        "pdf_files/2019-Ningbo-Civil.pdf",
        "pdf_files/2024-Ningbo-EE.pdf",
        "pdf_files/2022-Ningbo-Mechanical.pdf",
        "pdf_files/2023-Ningbo-NUBS2.pdf",
        "pdf_files/2024-Ningbo-Economics2.pdf",
        "pdf_files/2023-Ningbo-SMLC.pdf",
        "pdf_files/2023-Ningbo-PHIR.pdf",
        "pdf_files/2024-Ningbo-Computer-Science.pdf",
        "pdf_files/2024-Civil-Concordia.pdf",
        "pdf_files/2023-NUBS-Concordia2.pdf",
        "pdf_files/2024-Economics-Concordia.pdf",
        "pdf_files/2023-SMLC-Concordia.pdf",
        "pdf_files/2023-PHIR-Concordia.pdf",
        "pdf_files/2024-Chemical2-UoB.pdf",
        "pdf_files/2024-Civil-UoB.pdf",
        "pdf_files/2024-Mechanical-UoB.pdf",
        "pdf_files/2024-Civil-Glasgow.pdf",
        "pdf_files/2024-Mechanical-Glasgow.pdf",
        "pdf_files/2023-NUBS-Glasgow2.pdf",
        "pdf_files/2023-NUBS-UQ2.pdf",
        "pdf_files/2023-SMLC-UQ.pdf",
        "pdf_files/2023-PHIR-UQ.pdf",
        "pdf_files/2023-NUBS-Texas-AM2.pdf",
        "pdf_files/2023-PHIR-SP.pdf",
        "pdf_files/2023-PHIR-TDM2.pdf",
        "pdf_files/2023-DesarrolloChile-PHIR.pdf",
        "pdf_files/2023-NUBS-Groningen2.pdf",
        "pdf_files/2024-NUBS-Bocconi.pdf",
        "pdf_files/2023-PHIR-Aarhus.pdf",
        "pdf_files/2023-NUBS-Aarhus2.pdf",
        "pdf_files/2019-1-Guide-bookfinal.pdf",
        "pdf_files/2023-UK-NUBS2.pdf",
        "pdf_files/2024-UK-Economics.pdf",
        "pdf_files/2023-UK-SMLC.pdf",
        "pdf_files/2023-UK-PHIR.pdf",
        "pdf_files/2023-UK-English2.pdf",
        "pdf_files/2020-UK-Education.pdf",
        "pdf_files/2023-UK-Biosciences.pdf",
        "pdf_files/2020-UK-EGS.pdf",
        "pdf_files/2024-UK-Psychology2.pdf",
        "pdf_files/2024-UK-Biomedical.pdf",
        "pdf_files/2023-UK-Pharmaceutical-HS.pdf",
        "pdf_files/2023-Ningbo-NUBS2.pdf",
        "pdf_files/2024-Ningbo-Economics2.pdf",
        "pdf_files/2023-Ningbo-SMLC.pdf",
        "pdf_files/2023-Ningbo-PHIR.pdf",
        "pdf_files/2023-NUBS-UQ2.pdf",
        "pdf_files/2023-SMLC-UQ.pdf",
        "pdf_files/2023-PHIR-UQ.pdf",
        "pdf_files/Acceptance-Declaration-Form-2023-All-Schools-website.pdf"
    ]
}