{
    "url": "https://www.nottingham.edu.my/International/Prospective-Students/Region-Specific-Information/SA.aspx",
    "content": [
        {
            "p": "During my time as an undergraduate, I had the opportunity of being fully sponsored to participate at a Wilton Park forum in Thailand where I networked with political leaders and governmental representatives of ASEAN and the United Kingdom (UK). After undergoing a competitive application process, I was also fortunate enough to be selected as a student journalist at the UNESCO World Press Freedom Conference in Indonesia and represent UNM at the International Student Summit in the UK where my aptitude for debating and diplomacy was honed. My involvement in these reputable events holds testament to the value-added learning opportunities offered to students of SMLC. The education I received at UNM was certainly an international experience that transcended the boundaries of classroom walls. For students interested in investigating social phenomena, such as ideology, class structures, national formations, gender, and ethnicity, this is the perfect course that will ignite your intellectual curiosity. The pedagogical approach of lectures followed by tutorials held in smaller groups encourage students to think critically, analytically develop their own ideas, communicate their thoughts effectively, and collaborate in projects with peers and professors. Through my classes, I examined how meaning is developed, disseminated, interwoven with systems of power, and created from the social, political, and economic domains within a particular social structure or conjuncture. This knowledge enabled me to successfully secure a position of a political analyst upon graduation at Nanyang Technological University in Singapore. Piya Raj Sukhani from India, graduated with BA International Communication Studies with English Language and Literature My experience in UNM has been amazing and I have no regret in choosing UNM. I always wanted to study in a British university in the Russell Group. It was a dream comes true for me to do so in UNM as it is closer to home, culturally similar and at half the cost of studying in UK. The School of Economics is highly ranked worldwide and the degree will prepare me for graduate study in UK. There is a strong student-lecturer interaction in the School of Economics - the lecturers are personally known to all students in the class, they are always willing to gives us feedbacks, answer questions and they constantly encourage us to fulfil our potential. Everyone knows each other in the class and we are very close, which is something all of us love, as this is the most important part of university! The process of settling down as an international student was very smooth for me. I took the opportunity to explore many extra-curricular activities, from academic clubs to the dance club and even taking part in the annual dance production. These activities helped me develop soft skills such as leadership, teamwork and public speaking. Most importantly, it helped me meet new friends outside the classroom and make my university life much more fulfilling; I have many memorable moments here! Dulashini Sooriyarachchi from Sri Lanka, studying BSc (Hons) Economics Students from South Asia are usually required to complete a Foundation programme, prior to entering a degree programme. Download the Foundation international entry requirements list here. Students who have completed an international pre-university qualification such as A levels, IB, SATs (both SATr and relevant SAT subject tests) Australian/Canadian matriculation are eligible for first year entry into a degree programme, and can find the relevant entry requirements by searching for their course. Students with other qualifications or transferring students may be admitted on a case-by-case basis. Download the Undergraduate international entry requirements list here. Students holding degrees from universities in South Asia may be admitted on a case-by-case basis. Applying for MPhil/MRes/PhD programmes are slightly different. Students have two routes to gaining admission: a) Students can pre-apply, by submitting their research proposal and academic transcript to the supervisor of their choosing (find a supervisor by looking through the 'People' tab under the relevant school or department and putting in an application after the supervisor has approved their research. b) Students who have no preference of their supervisor can put in an application online immediately. The International Officer for South Asia is Leng Sze Liew. Talk to our international agent about your plan to study with us! Sign up here. See our full recruitment event schedule On this website: Other resources: telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": [
        "pdf_files/foundation-SA.pdf",
        "pdf_files/UG-SA.pdf"
    ]
}