{
    "url": "https://www.nottingham.edu.my/International/studyabroad/Incoming/Internationalexchanges.aspx",
    "content": [
        {
            "p": "The International Exchange Programme is designed for undergraduate students from our selected partner universities, including members of the selected Universitas 21 network, who wish to spend a period of time studying in Malaysia, earning credits to transfer back to their home university. Modules are available across most disciplines and are part of the regular undergraduate curriculum, enabling international exchange students to study alongside Malaysia Campus home students. International Exchange students from partner Universities are exempted from paying tuition fee to the University of Nottingham Malaysia. Please check with your home university to confirm if there is a current International Exchange agreement in place between your home university and the University of Nottingham Malaysia. Students must be formally nominated by their home university via email. Your home university is then responsible for sending the supporting documents to complete your application. Kindly contact the Study Abroad Office at your university for further information. Nomination from home University: 1 April for Autumn/Full year 1 September for Spring. Application deadline: 1 May for Autumn or full year intake 1 October for Spring intake Visa application deadline: 1 May for Autumn or for full year 1 October for Spring All International Exchange applicants must be a current student at a university or college of higher education from aborad and has completed one year of study at their home university. The minimum academic requirement is a GPA of at least 3.0 (or equivalent). Choose your UNM modules. For more information please refer to our course listing. Students should ensure that: All international mobility students studying in Malaysia will be required to obtain a Student Mobility Pass. For more detailed information please visit our offer holders section. In compliance with the Malaysian Ministry of Education, it is compulsory for all international students to have a medical insurance coverage throughout their period of study in Malaysia. The University of Nottingham Malaysia has arranged for a Group Hospital and Surgical Insurance Programme to deal with any health emergencies that might arise during your period of study. The estimated monthly expenses for an International Student living in Malaysia is from RM2,500 to 3,500. This includes: telephone: +6 (03) 8924 8778 fax: +6 (03) 8924 8005"
        }
    ],
    "pdf_files": []
}