{
    "url": "https://www.nottingham.edu.my/International/Offerholders/Visasandimmigration/Index.aspx",
    "content": [
        {
            "p": "Important information on student visas for new and returning students. All students undertaking full-time studies in Malaysia are required to obtain a Student Pass (Visa). The process has been in transition from 2013 and changes are frequent. For the most up-to-date information, we recommend visiting the University website regularly. The Ministry of Higher Education and the Malaysian Immigration Department has agreed to issue new Student Passes for the full duration of the course applied by international students (this is subject to the validity of the passport at the point of submission to the Visa Office). For students issued the yearly Student Pass, you will have to continue to renew your visa on a yearly basis. Please visit the Visa Office to find out more about this process or refer to the Returning Students section for more details. You will also receive a monthly email reminder from the Visa Office as part of our initiative. All international students will not be required to do a pre-arrival medical examination based on the circular issued by the Ministry of Higher Education. However, all international students MUST fill up and sign-off on the ‘HEALTH DECLARATION FORM’ and submit it to the Visa Office for the Visa Approval Letter (VAL) application. As such, students will be only doing their post-arrival medical examination upon arriving on campus. Any student who fails their post-medical examination will have to return back to their home country. The university will not be responsible for any cost incurred. You are allowed to appeal your post-medical once but it is subject to the approval by EMGS. Option A: Apply via the UNM Visa Office Option B: Apply directly to EMGS New students | Returning students | Special circumstances | Health and insurance | UNM Visa Office Incoming international students will have the option of applying for their Visa Approval Letter (VAL) through the following methods: Option A is the recommended method. However, students who opt for Option B can contact the UNM Visa Office if any assistance is required. Inter-campus exchange and transfer students may refer to this section to understand the visa application process. Contact your International Office /Study Abroad Office in your respective Universities for further assistance. Current students must renew their visa at least 4 months before their current student pass expires - Please refer to the monthly email reminder sent out by the UNM Visa Office. Students facing one of the circumstances below may have to submit additional documents and undergo a slightly different process of VAL application: Please read more about the Immigration Department of Malaysia's VAL application health checkup requirements and the health insurance coverage provided with your Student Pass here. International students issued a Student Pass for the full duration of their studies must renew their medical insurance on a yearly basis upon i-Kad renewal. It is a prerequisite that all international students hold a valid health insurance coverage during the course of their studies. The UNM Visa Office is the University's in-house provider of Student Pass assistance to international students. All international students should contact the UNM Visa Office for support during their visa application process or for other visa related matters. Email: apply.visa@nottingham.edu.my (new students) or visarenewal@nottingham.edu.my (returning students) Phone: +603 8924 8075 or 8924 8078 Hotline: +603 8924 8088 General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}