{
    "url": "http://www.nottingham.ac.uk/isos/",
    "content": [
        {
            "p": "The Institute for the Study of Slavery (ISOS) — formerly known as the International Centre for the History of Slavery — was established in 1998 by the late Thomas Wiedemann. ISOS now pursues research on historical and contemporary slavery, and forced labour in all parts of the globe and through all periods. The Institute for the Study of Slavery (ISOS) aims to: ISOS organises annual lectures, workshops and a bi-annual international conference. Recent guest speakers have included Professor Trevor Burnard (University of Melbourne) and Professor Ana Lucia Araujo (Howard University, Washington DC). The Institute for the Study of Slavery (ISOS) was formerly known as the 'International Centre for the History of Slavery' and was established in 1998 by the late Thomas Wiedemann. A classicist and professor of ancient history, Prof. Wiedemann’s ideas for the centre were shaped by his formative years spent at the Warberg Institute in London, his former position at Bristol University, and his collaborative work with scholars in Germany, especially the Mainz Academy. At Nottingham, he was able to realise his vision for the kind of international and cross-disciplinary co-operation he had for the centre, but he lived only long enough to see the first of its conferences, on ‘The Body of the Slave,’ held in September 2000. His passing in 2001 was a great loss to the scholarship of slavery studies, but his vision for comparative slavery and collaborative scholarship continued under the leadership for of Prof. Dick Geary, and then Prof. Stephen Hodkinson. Prof. Geary, a historian of comparative twentieth-century labour history, remained committed to the now renamed ISOS, and successfully secured funding for many collaborative projects, including large grants from UK funding bodies such as Leverhulme as well as prestigious Brazilian ones such as CAPES. This funding facilitated numerous workshops and conferences in the UK at Nottingham and in Brazil at UNICAMP, UFF, and UFMG in Brazil. Prof. Geary also established joint projects with the Gilder Lehrman Institute and the University of Virginia in the US. The ISOS conferences were especially international, with colleagues from the Netherlands, Germany, Greece, Israel, China, Australia, South Africa, Ireland, Italy, and Germany participating. The wide-ranging and comparative nature of the conferences did not dilute or diminish the standard of debate: themes were intellectually provocative and research expectations remained consistently high. On slavery in the Anglophone world alone, there were many fruitful collaborations with scholars such as Trevor Burnard, Joseph Miller, Gad Heuman, and James Walvin. Under new leadership, the aims of ISOS remain intellectually ambitious and far-reaching, as is demonstrated by the new book series, \"Histories of Slavery and its Global Legacies,\" which was recently launched by Cambridge University Press with ISOS support. ISOS brings together a range of resources and cross-disciplinary research across the University. Research Resources Dr Sascha Auerbach, School of Humanities Dr Susanne Seymour, School of Geography To sign up to our mailing list, please email Sascha Auerbach Sign up Nottingham's Legacy of Slavery archive This resource, located on the Nottingham Museums website, illuminates and explores the backgrounds of several locally commemorated individuals including Robert Smith, Eric Irons and George Africanus, connected with the transatlantic slave economy. It also contains a useful glossary of terminology for understanding transatlantic slavery and race. A virtual panel discussion exploring university life for Black staff and students in the UK, recorded in 2020 as part of a series of events ISOS curated in response to the resurgence of the Black Lives Matter movement, in the wake of multiple deaths including that of George Floyd. This recording comprises a panel of five Black academics from a range of scholarly disciplines (including history, economics, political science, and anthropology) who will discuss their personal experiences of learning and working at universities across the UK. They deliberate on the types of changes (cultural, structural, administrative) that are most likely to create a more supportive environment in which Black members of staff and students can thrive. Dr James Dawkins (Chair of the Panel Discussion and Research Fellow, University of Nottingham) Dr Jonathan Ashong-Lamptey (Founder & Managing Director of Element of Inclusion) Dr Meleisa Ono-George (Associate Professor and Director of Student Experience, University of Warwick) Toyin Agbetu (Founder of Ligali and PhD Research Candidate, University College London) Lisa Robinson (Director of Bright Ideas and PhD Research Candidate, University of Nottingham) The panel was introduced by the former director of ISOS, Dr Sheryllynne Haggerty. The Institute draws together academic staff, postdoctoral researchers, and postgraduate students from several academic schools within University of Nottingham: Email: Sascha.Auerbach@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}