{
    "url": "http://www.nottingham.ac.uk/iss/",
    "content": [
        {
            "p": "Welcome to the Institute of Science and Society (ISS), a leading interdisciplinary centre for the study of science, technology and medicine. Our research is transforming how we engage with science; expanding public participation in knowledge and innovation; and developing novel ways to influence scientific, technological and policy change. The Institute for Science and Society (ISS) is one of the leading centres in Science and Technology Studies (STS) in the UK, Europe and internationally. We investigate the social, political and ecological aspects of science and technology. This requires transdisciplinary approaches, that bring together the sciences, the humanities and the social sciences. ISS members use a variety of research methods, including qualitative, quantitative, and participatory approaches. Since ISS was established in 1998 we have attracted over £20 million in external research funding, in collaboration with partners across many different disciplines. Our role in the School of Sociology and Social Policy is to bring together staff and students with an interest in STS and aligned fields, support collaboration on funded research activities, and provide high quality teaching and training. We also seek to model positive research cultures, and are strongly committed to supporting new generations of STS scholars, postgraduate research students and early career researchers. Our role in the University of Nottingham is to act as a hub for academics and students who seek to study, problematise or reflect on the past, present and future role of science and technology. In this way, we act as a bridge between the Faculty of Social Sciences, and other faculties in the university, helping to ensure the university succeeds in its mission of being a university ‘without borders’. Our role nationally and internationally is to champion and promote the importance of co-produced scholarship on science and society. We do this by seeking to influence research trajectories, funder priorities, and social and ethical debates. For example, ISS has launched EcoSocieties, a capacity building thematic programme of research committed to facilitate ecological transitions in our societies. Staff and students in ISS study a wide range of topics, including: See all news See all events Institute for Science and Society School of Sociology and Social Policy Law and Social Sciences University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}