{
    "url": "https://www.nottingham.edu.my/IT-Services/computers/print/index.aspx",
    "content": [
        {
            "p": "The Print Service uses Multifunctional Devices (MFDs) which offer printing, copying and scanning. You can release your print or copy job at any MFD across the University. It is your responsibility to abide by all copyright laws. For more information, please refer to our copyright page. To use the service, you will need: Always make sure you log out of the MFD when you have finished to keep your account secure. A document can be sent to print from any computer room/public access PC and is then stored in your personal queue for up to 24 hours. You can then release it for printing from any MFD once you have logged in. Any jobs submitted for printing will be deleted from the queue if they are not released within 24 hours. The default settings are: Mono - Black and white, double-sided A4. The default copy and print settings can be changed to meet your requirements but the cost may differ from standard charges. Items can be photocopied as long as they are within the copyright restrictions. The default setting is: Items can be scanned as long as they are within the copyright restrictions. You can scan documents at any MFD and send them directly to your University email address. You may also scan your documents at standalone scanning stations located on Level B of the IT Services Building (F2) and the Library. Please bring a long a pendrive or portable hard disk drive to save your files into. Scanning is free and saves paper. The following charges apply for printing and copying: No cost is incurred for scanning. Every act of printing or copying reduces the amount of credit in your Print Service account. Unused credit is not refundable or transferable so please manage your account accordingly. Verify your University username at the Print Service portal. You will then be able to see your balance. You can purchase additional credit online via the Print Service portal. telephone: +603 8924 8199 fax: +603 8924 8007 email: itservicedesk@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}