{
    "url": "https://www.nottingham.edu.my/IT-Services/connect/wifi/staff-students.aspx",
    "content": [
        {
            "p": "To connect: If you experience any problems connecting your device, use the Configuration Assistance Tool. It will detect what device and operating system you are running. You should only need to authenticate once, after that you'll automatically connect to eduroam when it is available. You will need to repeat these steps if you change your password. Additional instructions for setting up your mobile with eduroam. Connecting Android 4.4 and above devices to eduroam. You may also be able to use the eduroamCAT application, which will automatically configure your device. Before you proceed with installation on Android systems, please make sure that you have installed the eduroamCAT application. eduroamCAT application is available on Google Play and will use the configuration settings file to set up your device. When prompted for your username (called 'identity' in some versions), enter it as username@nottingham.edu.my Important: Please note that using the eduroamCAT tool will force you to set a PIN code to access your device if you have not already done so. You cannot disable this PIN once set. eduroam configuration settings You can download an automatic eduroam configuration file for iOS devices. Please note you will need to enter your username in the format username@nottingham.edu.my when prompted. If you have a problem connecting your Apple device to eduroam, you may need to upgrade to the latest software: If you have changed your University password since setting up the wireless network you may need to forget the network and re-connect. You can install an automatic configuration file for Apple OS X which will set your computer up to work with eduroam. When prompted for your University username and password, make sure you enter it in the format username@nottingham.edu.my If you have a problem connecting your Mac to eduroam, you may need to upgrade to the latest software. To connect your BlackBerry 10 device to eduroam, install the RADIUS certificate first. You can also connect older BlackBerry devices (such as 9270) to eduroam: You can download an automatic configuration script for some Linux distributions. You will need to enter your username in the format username@nottingham.edu.my when prompted. Some distributions do not support the automatic configuration tool, and should use the manual settings. If you have a problem connecting your laptop, you may need to upgrade to the latest software. Please run your distributions software update mechanism to check this. Connecting your Windows 8/10 device to eduroam automatically. You can download an automatic configuration program for Windows. You will need to enter your username in the format username@nottingham.edu.my when prompted. If you have a problem connecting your laptop, you may need to upgrade to the latest software. Connecting your Windows Phone 8 or Windows Mobile 10 device to eduroam. There isn't an automatic way to connect a Windows phone to eduroam however connection is simple. You can connect other devices to the eduroam wireless service if it supports 802.1X or WPA2-Enterprise encryption. Most devices will need the following information at minimum: For some devices, an automatic configuration tool (CAT) may be available. Not all of these settings may be required for your device, but you may need some of them to connect successfully. You may experience a security or certificate warning when first connecting to eduroam at The University of Nottingham. To ensure your safety, check that the certificate you are presented with matches the following information: You can also install the certificate yourself before connection either using CAT or by downloading and double clicking it to install. When connected to eduroam at a participating institution, you are bound by our Code of Practice and the acceptable use policy of the site you are visiting. Failure to adhere could result in disciplinary procedures. For information about where eduroam is available globally, visit the eduroam website. telephone: +603 8924 8199 fax: +603 8924 8007 email: itservicedesk@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}