{
    "url": "https://www.nottingham.edu.my/IT-Services/itservices/index.aspx",
    "content": [
        {
            "p": "We provide a range of IT services to facilitate staff and students of the University in their pursuit of academic and research excellence. IT Services manages a number of computer rooms offering: IT Services assigns email and storage on the network for every staff and student. Secure protocols for sending and retrieving mails, and extensive spam-filtering are implemented. Access to emails is made easy through a web-based interface. The University Portal provides students easy accessibility to relevant information such as personal details, access to past-year examinations, reading lists and examination results. Workspace is an online collaborative portal that allows staff and students across the university to share information, news and documents. The print, copy and scan services are available in IT computer rooms and the library. It uses your University Card or your University username to store credits which you can charge up at the library circulation counter. Scanning is free of charge. IT Services provides hardware & software support for all University IT assets which includes procurement, maintenance, licensing and disposal. The University provided Windows-based computers are equipped with various software to fulfill the requirements of different schools and departments. Video Conferencing allows face to face communications and meetings to be conducted with remote parties through the Internet or via digital telephony. There are suites across the University's UK, Ningbo and Malaysian campuses. E-Learning materials are created and delivered through Virtual Learning Environments (VLE). VLEs help to facilitate course management, collaborative group projects, self-test exercises and online assessments. The University VLE is provided by Moodle. Wireless access is available for mobile devices via wireless access points installed throughout the campus. Staff and students can connect their mobile devices to the Internet using their University username and passwords. Guests of the University are to contact IT Helpline for temporary access. IT Services also provides: telephone: +603 8924 8199 fax: +603 8924 8007 email: itservicedesk@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}