{
    "url": "https://www.nottingham.ac.uk/it-services/help/it-induction.aspx",
    "content": [
        {
            "p": "Your first step is knowing what to bring with you, read our 'what you need' information below to find out. Next, watch the videos and read our materials online on the Before you start and When you start pages. Completing the steps on these pages will help prepare you for when you arrive and start your studies. Attend your IT Induction and check the help and support we offer, from in-person support in halls to our dedicated Smart Bar and IT Service Desk teams. For more information about digital services available to support your studies, check out the After you start page. IT freshers survey Are you a first year student? We would welcome your feedback on your experience so far. From Monday 7 October, our survey will open. Complete the survey for your chance to win an IT goodie bag (includes Amazon voucher, power bank, wireless mouse and earphones plus much more). Start the IT survey You will need access to a phone, tablet and/or laptop device to set up Multi-Factor Authentication (MFA). MFA will be required for security on university your Microsoft account. We recommend you have a suitable laptop to work on. Check the general specifications on the Equipment advice page and contact your school or department if you have any queries. Get Microsoft Office for free. All students can install the latest Microsoft apps on up to five devices. Access a range of specialist software. Find and install your course software. Use Wi-Fi, printers and PCs on campus. We have eduroam Wi-Fi across all campuses and, printers and PCs are available in many locations. There are a number of ways you can get both 1-2-1 and remote support to help you get up and running with your devices and IT equipment in your first few weeks. Find a Student IT assistant when you arrive on campus or contact our dedicated Smart Bar and IT Service Desk experts to help you resolve IT queries."
        }
    ],
    "pdf_files": []
}