{
    "url": "https://www.nottingham.ac.uk/jobs/moving-to-nottingham/international-applicants/immigration/financial-support-for-visas-and-the-immigration-health-surcharge.aspx",
    "content": [
        {
            "p": "The University of Nottingham provides financial support for immigration-related costs incurred by international staff and their immediate family members during their employment. This includes reimbursement for specific costs such as visas and the health surcharge, as well as interest-free loans for other immigration-related expenses. This is available to international staff across all job families. The University will reimburse the visa application cost for the main applicant for the following visas: The biometric registration fee of £19.20 for UK-based applicants is also covered. The amount you pay depends on the length of your visa and whether you apply from inside or outside of the UK. For current fees, please visit the Home Office Immigration & Nationality Fees web page. The University offers a separate interest-free loan scheme for the dependents of new or existing employees and for employees who would like to spread the costs of other visa related fees. If your external funding covers immigration costs, claim these from the funding body. You will not be eligible for additional reimbursement from the University. Once your application has been approved, the reimbursement will be processed via Payroll and will be visible on your next payslip. It is important to note that the UK tax authority (HMRC) classifies the reimbursement of visa/surcharge fees as earnings, so you will need to be on the University’s payroll for us to reimburse you. For the expenses to be reimbursed free of tax and National Insurance contributions per HMRC regulations, you must: Please note that if you do not meet the above criteria, or if you were previously employed by the University, the payment will be subject to tax and National Insurance contributions per HMRC regulations. The payment and any UK taxes/social security contributions withheld (as applicable per HMRC regulations) will be visible on your electronic pay slip, which you will be able to access via MyView (part of the University's HR system). If employment ends due to contract expiry or redundancy, no repayment is required. If resigning early, reimbursement repayment follows this schedule: *NB: Timeline is calculated from the date when the reimbursement is received This policy applies to new employees starting on or after 1 August 2021 and existing employees renewing visas with start dates on or after 1 August 2021. The University reserves the right to amend or withdraw this scheme at any time."
        }
    ],
    "pdf_files": []
}