{
    "url": "https://www.nottingham.ac.uk/jobs/moving-to-nottingham/support-for-others.aspx",
    "content": [
        {
            "p": "We understand that moving to a new City is difficult, especially for your partner/spouse who may be looking for a new job opportunity in the local area. We want to support them to find the perfect role, and some of the below resources may help. Where to look? Job boards have a range of opportunities across various different sectors, some of the biggest UK jobs boards are; Indeed Reed Total Jobs We also work with some local recruitment agencies, that support us with some of our roles, they would be more than happy to talk you through any available opportunities they may have, as part of a no cost service. Cherry Professional Hays Specialist Recruitment Macildowie When you have found a job, what do you need to do next? For most jobs in the UK, you will need to complete either an application form, or submit a CV (Resume). For best practice on creating a great CV visit; Prospects Do you have international qualifications? If you visit NARIC they will check you qualifications, and give you evidence of the UK equivilent, this will help with your job search. Childcare The University of Nottingham offer an excellent range of childcare services for students and staff to make life with us as easy as possible, for more information about the services listed below please click here. Nottingham City Council (City centre and Clifton only) – Click here or call directly on 0800 4584114. Nottingham County Council Family Support – Click here or call directly on 0300 5008080 Salary Sacrifice We offer several sacrifice schemes so you can tailor your benefits to your individual requirements, as well as allowing you to take advantage of National Insurance and/or tax and National Insurance savings. In particular, for childcare we offer a nursery tax scheme and a childcare voucher scheme. Click here for more information. Most commonly schools in the UK are divided up as follows: Early Years/Pre-School Aged 3-5 years Two Tier System Primary Schools – children aged 4 to 11 Secondary Schools – children aged 11 to 16 Further Education College/Sixth Form – Pupils aged 16-18+ The UK school year runs from September to August, children are eligible to start Primary School in the school year that they turn 5. State School Places When applying for a state school place you should refer to the admissions criteria for the relevant local authority. Please note, you are only allowed to apply for schools in your local authority, this is called a ‘catchment area’ Please use the interactive district map on the link below to determine which schools are available in your area: Interactive map of catchment area Alternatively, your local authority is likely to be either: To search for a school in this area, please click here To apply for an ‘in-year’ school place, please click here To apply for an ‘in year’ school place, please click here These are the links to apply for an ‘in year’ school place which is normally the relevant process when moving in to the UK. How to apply To apply for a school place, you will require evidence of a UK address. Both admissions authorities have advised us that they will accept a temporary UK address for the purpose of the initial application for a school place, but of course this can cause issues if your temporary address is not in the same ‘school catchment area’ in which you intend to find a permanent address and/or is not in the catchment area of your preferred school. We would recommend that you contact the relevant admissions authority as soon as possible to confirm the application criteria. They have advised us that they are willing to help overseas applicants to complete an application over the phone. Please note that many of the more popular schools are oversubscribed and you may not therefore be able to obtain a place at your first choice school. Independent/Fee Paying Schools There are also a number of fee paying schools in the area. Listings of independent schools are available through the Independent Schools Council website, please click here English language classes Our Centre for English Language Education (CELE) offers a range of English language courses for applicants who need to meet the required level of academic English to start their degree, as well as continued support to students throughout their degree. CELE is accredited by the British Council for the teaching of English."
        }
    ],
    "pdf_files": []
}