{
    "url": "https://www.nottingham.ac.uk/jobs/moving-to-nottingham/",
    "content": [
        {
            "p": "Nottingham is the county capital of the East Midlands, attracting people from all over the world. The community is diverse, which results in a wide range of shops, restaurants, culture, festivals and history that caters to all. The range of well known chains, to successful independant outlets and eateries make the city centre a hive of activity. As a city, it has vowed to be carbon neutral by 2028, which will make it the first in the UK, work which the University of Nottingham is working to support (https://www.nottinghamcity.gov.uk/cn2028). The University provides support with relocation to Nottingham from within the UK or from overseas through the Removal Expenses Policy. Relocation flight expenses are not reimbursed as part of this policy; the provisions of the Removal Expenses policy are set out in brief below. A copy of the full policy and claim form will be provided with your contract of employment where this support is offered as part of your appointment Eligibility for support for relocation will depend on the type of contract you have been given. This policy will apply to the staff groups below, only if offered as part of your employment contract, either on a permanent or a fixed term basis (funded from general revenue): Flight expenses are not reimbursed as part of the Removal Expenses Policy. Upon arrival in the UK it may be possible to have a car and driver meet you (and any accompanying family) and bring you to Nottingham. This service is offered at the discretion of the department you are joining. If you would like to take advantage of this offer, please contact the International Employment Services Team at br-staffimmigration@nottingham.ac.uk as soon as possible with details of your flight details, who you will be accompanied by and how much luggage you will have with you, together with your destination address and we will make the arrangements for you."
        }
    ],
    "pdf_files": []
}