{
    "url": "https://www.nottingham.ac.uk/jobs/candidate-guidance/understanding-the-job-requirements.aspx",
    "content": [
        {
            "p": "The document is structured and divided into sections to give you a clear description of what you will be doing in the role and what is required to be successful in the role. We encourage you to read this before you start your application and you can access the role profile via a link at the bottom of the advert page. Job title Job family and level School or department Location - where the role is based Purpose of the role – this is brief description of the role and key aspects of delivery Main responsibilities – in this section we provide details of the primary responsibilities expected to fulfil the role Person Specification - this section contains details of the knowledge, skills, experience, qualifications and statutory, legal or special requirements essential and desirable for the role (we call this the role criteria). Our role criteria are categorised as either essential or desirable but we recognise that you might not meet every single requirement. Research tells us that women and other under-represented groups in many cases are less likely to apply for a job if they don’t meet every requirement listed. As an employer we are committed to building a diverse and inclusive workforce so even if your experience does not exactly match what has been outlined, we welcome your application – you might just be the best person for the job, please just remember to tell us why in the examples that you provide! Key relationships with others - this diagram shows you where the role sits within the team structure to help you understand who you will be working with and who are your key stakeholders. Expectations and behaviours - we believe that every member of staff, irrespective of job role or level, has a critical role to play in the life and work of the University; that’s why we feel that how we approach our work and each other is as important as what we do. The core behaviours section of the role profile gives you an indication of what behaviours we expect from all our staff to ensure that we can build an inclusive culture across our university. Some examples of transferable skills and competencies are, but not limited to: Past experiences in work, education and your personal life can help demonstrate how you have used your knowledge and skills, which in turn helps us see how you might apply these skills in a job. We recommend that when making an application (and preparing for interview) that you consider when and where you have used your skills and draw on examples that showcase these in action. You can learn more about transferable skills by following the link."
        }
    ],
    "pdf_files": []
}