{
    "url": "https://www.nottingham.edu.my/Jobs/Joblistings/Research/PhD-position-in-Biomedical-Sciences-at-School-of-Pharmacy.aspx",
    "content": [
        {
            "p": "All applications will be treated in strict confidence and only shortlisted candidate will be notified. *Pursuant to the Personal Data Protection Act 2010, you are advised to read and understand our Notice and Choice Principle Document which is posted at our website. By submitting your detailed resume, you declare that you have read, understood and accepted our Notice and Choice Principle Document and have consented to providing your sensitive personal data to be processed by us. We are seeking a highly motivated and enthusiastic Ph.D. student to spearhead the development of a novel panel of miRNA biomarkers for breast cancer. Traditional biomarkers have their limitations, often leading to inaccurate prognoses for patients, especially those in advanced stages of cancer. However, recent studies have revealed that specific miRNA molecules exhibit distinct expression patterns in breast cancer tissue compared to normal breast tissue. This breakthrough has paved the way for utilising miRNAs as potential biomarkers for early detection, diagnosis, and prognosis of breast cancer. The successful candidate will play a crucial role in identifying and validating a set of specific miRNA molecules that can serve as reliable indicators of breast cancer. To excel in this role, we require a candidate with exceptional skills in molecular biology. Proficiency in and experience in database research and bioinformatics analysis will be advantageous. Requirements: Financial support Financial support will be provided: Monthly stipend for 3 years and tuition waiver. To apply, please submit your CV, academic transcript, degree certificate, a cover letter outlining your research interests and relevant experience, and contact information for two references to Assoc. Prof. Dr. Ho Wan Yong (WanYong.Ho@nottingham.edu.my). Application deadline: 31 October 2023 Note: Only shortlisted candidates will be contacted for an interview. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: hr@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}