{
    "url": "https://www.nottingham.ac.uk/jobs/moving-to-nottingham/accommodation.aspx",
    "content": [
        {
            "p": "Property in Nottingham is largely affordable, with house prices coming in significantly lower than the UK average. Whether you are looking to buy or rent, there is a great mix of housing available. The Telegraph 2017 article about Nottingham is a great summary guide to the best locations in the area. The Accommodation Office can advise on, and assist with, finding temporary accommodation, which could be located on a University campus*. We have guest/visitor accommodation located on the Jubilee campus and at Eviton House on our Sutton Bonington campus. These studios and flats are available for rental for a minimum period of one month and a maximum of three months, and all are fully furnished with self-catering facilities. * Subject to availability Unipol work in partnership with the University of Nottingham and advertise a selection of the private sector property, ranging from furnished houses to a few self-contained flats. Most University staff choose to find longer-term accommodation in areas close to the University campuses, such as Beeston, Chilwell and West Bridgford. You can find information about many of these areas on Unipol’s “where to live in Nottingham” web page. Estate agents and letting agents can also help you to find suitable accommodation. Ensure that the agency is a member of a professional body, such as ARLA (Association of Residential Letting Agents) or NALS (National Approved Letting Scheme). Both of these organisations require their members to sign up to a code of practice, which guarantees you a certain minimum level of service. The University has a removals policy to support some new members of staff when relocating, for more information click here The best places to look for shared accommodation are on the web (try websites like spareroom.co.uk or easy room-mate), but you'll have better luck once you are here - people like to see their potential flat mates first. Dr Rachael Tarlinton Lecturer, from Australia The letting agents in the UK will require the following to create a letting agreement: If you are a non-EU resident you may also require a UK based guarantor (a person that under a contract, agrees to be held responsible for another’s debt) or pay an additional fee. You may be asked to pay a deposit when you sign your contract; which is usually equal to one month’s rent, to hold your house for you until you move in. This should be returned to you when you move out. Many landlords use a deposit protection scheme which deals with the deposit as an independent third party You can find information about associated costs of living here Useful links:"
        }
    ],
    "pdf_files": []
}