{
    "url": "https://www.nottingham.edu.my/Jobs/Joblistings/Research/PhD-Scholarships-%e2%80%93-Ghana-Malaysia-South-Africa-and-Tanzania.aspx",
    "content": [
        {
            "p": "*Pursuant to the Personal Data Protection Act 2010, you are advised to read and understand our Notice and Choice Principle Document which is posted at our website. By submitting your detailed resume, you declare that you have read, understood and accepted our Notice and Choice Principle Document and have consented to providing your sensitive personal data to be processed by us. We are hiring a cohort of PhD students to join a specially curated Doctoral Training Programme (DTP) as part of FoodE International consortium and a project on ‘Shaping food environments in transitioning economies for sustainable and healthy diets’. The project aims to establish a shared understanding of problems and opportunities to develop solutions to shape food environments in four different transitioning economies to drive nutritious and safe food consumption for better health outcomes. The project will utilise a variety of approaches to study dietary habits, consumer and food supply trends and policies to develop evidence-based policy recommendations for various stakeholders and sectors to transform food environments and consumption patterns, targeting poor urban communities in all partner countries. The DTP students will be part of a transdisciplinary team of international researchers studying food environments. Successful applicants are expected to be based in at least one of the consortium member countries (Ghana, Malaysia, South Africa and Tanzania) and have local knowledge and experience. Main research areas but not limited to Requirements Scholarship awards will cover fees and stipend for three (3) years. The amount will depend on the individual institution, and budgetary arrangements and details will be discussed and agreed upon with successful candidates. Interested individuals are kindly invited to send their CV and a one-page cover letter (letter of motivation) by Monday 31 July 2023 to: director@csir-stepri.org (Ghana) festo.massawe@nottingham.edu.my (Malaysia) MkhizeN34@ukzn.ac.za (South Africa) jkinabo@sua.ac.tz or akwmwanri@sua.ac.tz (Tanzania) Closing date: Monday, 31 July 2023 telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: hr@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}