{
    "url": "https://www.nottingham.edu.my/Jobs/Joblistings/Research/Fully-funded-PhD-studentship-in-Chemical-and-Environmental-Engineering-Biosciences.aspx",
    "content": [
        {
            "p": "All applications will be treated in strict confidence and only shortlisted candidate will be notified. *Pursuant to the Personal Data Protection Act 2010, you are advised to read and understand our Notice and Choice Principle Document which is posted at our website. By submitting your detailed resume, you declare that you have read, understood and accepted our Notice and Choice Principle Document and have consented to providing your sensitive personal data to be processed by us. A PhD studentship is available with a FULL tuition fee waiver and a stipend of RM2800/month for 3 years. The candidate must have a First Class degree or a Master's degree in a related field. If you are interested, please submit your CV and full academic transcripts to Chiew-Lin.Yap@nottingham.edu.my. The closing date is July 31, 2024. You can find the poster for the call at this link. Project Title: Efficacy of Conducting Polymer-Activated Palm Kernel Shell Carbon Composite Electrodes in Microalgae-Microbial Fuel Cell Treatment of Palm Oil Mill Effluent (POME) Project Summary: Malaysia, as the world's second-largest oil palm producer, confronts increasing challenges posed by Palm Oil Mill Effluent (POME). Conventional treatment methods suffer from drawbacks, particularly prolonged treatment durations, extensive spatial requirements, and high energy consumption. Microalgae-microbial fuel cells (MMFC) offer innovative solutions with compact designs, utilizing electrogenic microbes for efficient wastewater treatment and bioelectricity generation, while incorporating microalgae to enhance cathode efficiency. However, scaling MMFC faces hurdles of low bioelectricity generation and expensive anode electrodes (>40% of the expenses). This project aims to address these challenges by gaining insight into the efficacy of new anode electrodes, specifically conducting polymer-activated palm kernel shell carbon (CP-APKSC) composite electrodes, in the MMFC treatment of POME. Successful outcomes potentially scale up MMFC technology and promote oil palm biomass valorisation, holding local and global significance for wastewater treatment, sustainable energy, and circular economy practices. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: hr@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}