{
    "url": "https://www.nottingham.edu.my/Jobs/Current-Vacancies-2/Bahasa-Malaysia-Version.aspx",
    "content": [
        {
            "p": "*Important note* In pursuant to the Personal Data Protection Act, you are advised to read and understand our Notice and Choice Principles statement. By submitting your resume to us, you have declared that you have read, understood and accepted our Notice and Choice Principle Statement and gave us full consent to process your personal information along with your sensitive data. Click here to view our Notice & Choice Principle in English Notis dan Prinsip-Prinsip Pilihan Selaras dengan Akta Perlindungan Data Peribadi (‘Akta’) yang telah berkuatkuasa pada 15hb November 2013 untuk mengawal pemprosesan data peribadi bagi transaksi transaksi komersil, The University of Nottingham Malaysia Campus Sdn Bhd yang wujud sekarang dan/atau pada masa hadapan (selepas ini dirujuk sebagai ‘Syarikat’) adalah komited untuk memastikan pematuhan Akta berkenaan dengan sepenuhnya. Notis ini menjelaskan bagaimana kami mengendalikan data peribadi bakal pekerja yang dikumpulkan, diproses dan disimpan oleh Syarikat, yang wujud sekarang dan/atau pada masa hadapan. Dokumen ini juga bertujuan untuk memberikan anda, selaku subjek data, pengetahuan bagaimana anda boleh mengawal pendedahan data peribadi anda oleh Syarikat. Sila baca dan tandatangan Notis ini beserta tarikh untuk mengesahkan pemahaman dan persetujuan anda akan kandungannya. Kami memproses data peribadi anda Syarikat perlu mengumpul dan memproses data peribadi anda di mana anda adalah/boleh menjadi satu pihak bagi tujuan untuk ditawarkan pekerjaan di Syarikat. Secara amnya, data peribadi anda yang dikumpul dan diproses oleh kami, adalah termasuk tetapi tidak terhad kepada:- Nama, nombor kad pengenalan (K/P), nombor KWSP, nombor PERKESO, nombor cukai pendapatan, alamat, nombor telefon, jantina, kerakyatan, tarikh lahir, tempat lahir, status perkahwinan, ketinggian, berat, butiran keluarga, pendidikan dan pencapaian akademik, kemahiran komputer, penguasaan bahasa/dialek, e-mel peribadi, gambar, nombor pasport, kumpulan darah, data majikan terdahulu, gaji, nombor akaun bank, nama dan alamat bank, perjanjian bon perkhidmatan, nombor lesen memandu, maklumat kenderaan, aktiviti/ minat/ hobi dan lain-lain. Data peribadi sensitif Beberapa data peribadi yang dikumpul dan diproses oleh Syarikat mungkin merangkumi perkara-perkara yang ditakrifkan sebagai ‘data peribadi sensitif’ di bawah Akta dan ini adalah termasuk, tetapi tidak terhad kepada:- Bagaimana kami menggunakan data anda? Secara amnya, Syarikat akan menggunakan data peribadi anda untuk melaksanakan tanggungjawab sebagai bakal majikan anda. Secara khususnya, data peribadi anda boleh diguna dan diproses seperti berikut, tetapi tidak terhad kepada:- Bagaimanakah data anda dikumpulkan? Kesemua atau kebanyakkan data peribadi anda adalah diperolehi dari anda, sama ada dari sumber-sumber berikut dan/atau dari maklumat lain yang dibekalkan oleh anda:- Dalam keadaan tertentu, data peribadi anda mungkin diperolehi daripada sumber-sumber luaran yang berikut, tetapi tidak terhad kepada:- Hak Anda Anda boleh memohon akses kepada data peribadi anda dan boeh memohon untuk meminda data peribadi anda. Untuk melaksanakan hak-hak anda, anda dikehendaki mengemukakan Borang Permohonan Untuk Mengakses/Mengemaskini Data Peribadi. Anda boleh mendapatkan borang ini daripada Jabatan Sumber Manusia, The University of Nottingham Malaysia Campus Sdn Bhd. Butirannya adalah seperti berikut:- Nombor Telefon : 03 – 8725 3455 Nombor Faks : 03 – 8924 8655 E-mel : pdpa@nottingham.edu.my Setiap permohonan untuk melaksanakan hak-hak anda akan diuruskan berdasarkan Akta. Sila maklum bahawa selaras dengan Akta, permohonan anda boleh ditolak dalam keadaan keadaan tertentu. Kepada siapa kami boleh mendedahkan maklumat anda Data peribadi anda akan dirahsiakan akan tetapi boleh diberikan atau didedahkan kepada pihak-pihak ketiga bagi tujuan-tujuan seperti yang dinyatakan di atas. Walaupun kami tidak akan mendedahkan maklumat anda kepada mana-mana pihak ketiga melainkan ianya berada dalam lingkungan pendedahan yang dibenarkan di bawah undang-undang/garis-garis panduan yang sedia ada dan/atau anda telah memberikan persetujuan bagi pendedahan sedemikian, kami boleh mendedahkan maklumat anda kepada pihak-pihak seperti yang disenaraikan di bawah ini, tetapi tidak terhad kepada:- Kami akan memastikan agar langkah-langkah munasabah diambil oleh kategori pihak-pihak yang tersebut di atas untuk melindungi dan/atau mengekalkan kerahsiaan maklumat anda yang mungkin kami dedahkan kepada mereka. Mengehadkan pemprosesan data peribadi Walaupun seperti yang dinyatakan di atas, kami memproses data peribadi anda hanya bagi tujuan yang berkaitan dengan pelaksanaan suatu kontrak pekerjaan, jika data peribadi anda diproses bagi apa jua tujuan lain (dengan persetujuan anda), anda berhak untuk meminta kami untuk menghentikan pemprosesan sedemikian. Anda boleh melaksanakan hak ini dengan menghubungi Jabatan Sumber Manusia, The University of Nottingham Malaysia Campus Sdn Bhd. Hak ini dilanjutkan kepada menghentikan pemprosesan data peribadi anda yang berhubung kait dengan data peribadi individu lain. Peruntukan Berhubung Maklumat Sebagai seorang pemohon pekerjaan, anda berhak untuk memutuskan apakah maklumat yang anda ingin berikan. Walau bagaimanapun, sila maklum bahawa kesemua maklumat yang dipohon oleh kami, seperti yang dinyatakan di atas, adalah maklumat mandatori bagi kami. Sekiranya anda memilih untuk tidak memberikan dan/atau gagal untuk memberikan kepada kami maklumat yang mengandungi data peribadi sedemikian, kami tidak dapat menawarkan pekerjaan di Syarikat kami. Begitu juga, jika anda memutuskan untuk tidak memberikan maklumat mandatori kepada kami, ia bermakna tawaran pekerjaan tidak akan dibuat. Syarikat berhak untuk menyemak semula dan/atau meminda Notis ini dari masa ke masa dan akan memaklumkan mengenai perubahan sedemikian bersama dengan polisi yang telah dikemaskini di laman sesawang Syarikat, dan/atau lain-lain bentuk komunikasi yang sewajarnya sebagaimana yang akan ditentukan oleh Syarikat. Tiada apa pun dalam Notis ini yang akan mengehadkan hak-hak Syarikat dan pekerjapekerjanya di bawah Akta Perlindungan Data Peribadi 2010. I have read, understood and accept this Notice and Choice Principle Statement and gave my full consent to The University of Nottingham Malaysia Campus Sdn Bhd to process my personal information along with my sensitive data. Tidak Setuju Setuju telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: hr@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}