{
    "url": "http://www.nottingham.ac.uk/jobs",
    "content": [
        {
            "p": "Find your career with us. Discover your career The world of the University of Nottingham is defined by our people and the values we share. Our environment is an ambitious vision brought to life across vibrant and forward-thinking global campuses. An ever changing world where open minds and diverse cultures are able to learn, challenge and create. The success of our university is down to our amazing people and at Nottingham we offer more than just a job. We build strong teams and believe in supporting each other. We respect and are respected, with a pioneering spirit that is world-renowned. We are a university without borders. Change starts here, and the future looks like you. Let’s build something great, together. Many of our roles offer hybrid working. Our supportive and flexible environment allows you to thrive to reach all of your goals, both professional and personal. Competitive rates of pay, generous pension, substantial annual leave, reward schemes and discounts. We aim to give you all the support you need to nurture your talent, develop and reach your professional goals and personal career goals. Our university is a supportive, inclusive, caring and positive community. We warmly welcome those of different cultures, ethnicities and beliefs – indeed this very diversity is vital to our success, it is fundamental to our values and enriches life on campus. Delivering world-class research and education leadership. Join a community, our community of defiant pioneers. Make everything happen, from supporting the faculties, sports, student assistance, IT, finance, marketing, and much more, you'll play a crucial role in the life of the university. Join the experts delivering the research and supporting teaching, we are looking for technical specialists across the university. Whether it’s facilities, catering or security, our operations and facilities staff are integral to keeping the university running. Passionately leading others to a world beyond ordinary, you could join our senior staff in shaping the future of our university. We have a number of funded studentships in postgraduate research areas that align to our research interests and expertise. We are a truly international organisation with a strong focus on excellence, founded on a vision that education and research can make a transformative difference to peoples lives. Our diverse network of pioneering campuses and partnerships welcome collaborators to continue shaping the future of our world. The university also places a special emphasis on environmental sustainability, supporting the City of Nottingham’s desire to be a net zero carbon city by 2028 and working with partners in China and Malaysia to improve sustainability within their regions. This is a place where rich minds and diverse cultures are able to learn, challenge and create. Join our warm, family-like community who value the strength of working together to achieve common goals. Whatever part you play, our reputation is built on the impact you make. Our people excel because they enjoy a culture of balance in their working lives. It’s important to give it your all, but we understand that to do this, you need flexibility and support to excel in your personal lives too. From career progression to personal mentoring, you’ll get all the support you need to fulfil your goals whilst keeping your inner-self in peak condition. We recognise that wellbeing at work is really important in ensuring you reach your full potential. We offer a wide range of wellbeing support, services and events. Annual leave starting at 26 days, plus bank holidays, plus 5 University Closure days. We offer staff access to quality child care services, provided by the university's child care services located on campus. We offer highly attractive pension scheme with a flexible payment contribution based on job level. We have a large number of courses run by our internal Professional Development team, helping you develop your skills at work."
        }
    ],
    "pdf_files": []
}