{
    "url": "https://www.nottingham.edu.my/Jobs/index.aspx",
    "content": [
        {
            "p": "The University of Nottingham is pleased to announce jobs in the following areas, as part of its continued development of graduate, under-graduate and research activities in the Malaysia campus. The University of Nottingham is one of the top universities in the UK, with an outstanding international reputation for innovation in teaching, learning and research. Established in 2000, the Malaysia Campus is a full and integral part of the University in the UK. Our growing international reputation for teaching and research makes Nottingham a highly desirable place to work. As part of our continuing success and growth, we welcome applications from people who are results-oriented, innovative, and eager to expand their current skill-sets and wanting to make things happen to join us. Click here to view our Current Vacancies You can apply for a job by visiting the \"Current Vacancies\" section on our jobs page. Here, you'll find a list of available positions. Click on the position you're interested in and follow the instructions to submit your application. After you submit your application, it will be reviewed by our Human Resources Department. If your qualifications and experience match what we're looking for, we'll contact you to arrange an interview. The timeframe can vary depending on the position and the number of applications we receive. However, we aim to respond to all applicants within two weeks of the application deadline. The University of Nottingham Malaysia offers a competitive benefits package to its employees, including health insurance, retirement plans, and paid time off. Specific benefits can vary depending on the position and employment contract. Yes, we are committed to supporting the professional development of our employees. We offer a variety of training programmes and workshops for our employees. Additionally, UNM also encourages its employees to pursue further education and professional qualifications. The University of Nottingham Malaysia is committed to promoting diversity and inclusion in all aspects of our work. We believe that a diverse and inclusive environment enriches our community and contributes to excellence in teaching, learning, and research. We welcome applications from around the world. For international employees, we provide support in areas such as visa processing and relocation. We also offer resources to help you adjust to living and working in Malaysia. If you have any further questions, please don't hesitate to contact our Human Resources department. You can reach us by phone at +6 (03) 8924 8000 or by email at hr@nottingham.edu.my. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: hr@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}