{
    "url": "https://www.nottingham.ac.uk/jobs/howtoapply/index.aspx",
    "content": [
        {
            "p": "Once you have seen a vacancy that you are interested in, you will need to complete an online application and we have a set of guides and resources to make this easy for you. At the University of Nottingham we use an online application system. To make an online application, please follow the 'apply online' button at the bottom of the advertisement. This will take you to a login page within our application system, where: *Due to the data protection law, our system stores your data for up to 12 months. Once you have registered and logged into the application form, you will see a number of sections that you will need to complete. To find out more about our application process, follow ‘understanding our application process’ guide, where we explain our two different types of application routes and what are we looking to see in your responses. In addition, you can read our tips for completing an application within ‘writing your application’ guide. Our online application process gives you the option to: This allows the selection panel to focus solely on the evidence you have provided in relation to your knowledge, skills and experience for the role. The University of Nottingham is proud to be a Disability Confident Committed (Level 1) employer. Increasing the diversity of our employee community is extremely important to us and we are committed to the aims of the Disability Confident Scheme. We understand that some candidates may face barriers applying for the job online and we are happy to discuss reasonable adjustments to help you make an application for a job. Please contact our HR Recruitment Team, Email: hr@nottingham.ac.uk telephone +44 (0)115 748 4800 to discuss further. As part of our commitment to Disability Confident, we ask all candidates (within the Equal Opportunities section of the application form) if they wish to be considered under this scheme should they meet the minimum criteria for the role. By opting-in to this scheme, candidates will be disclosing that they have a disability solely for the purpose of the interview guarantee. We will not assume nor infer that an applicant wishes to disclose or record their disability in any other way. If you require any reasonable adjustments in order to attend the interview or complete any assessments required as part of the selection process, please let us know as soon as possible, ideally within your application. The outcome of your application will be confirmed via email after the job advert closes and we aim to send communication within 2 weeks. Sometimes it may take longer for the outcome to be confirmed, so don't worry if you don't hear from us within this time. We will confirm the outcome to you as soon as possible. For further information about recruitment process at the University of Nottingham please follow our ‘Candidate guidance’ The University of Nottingham is committed to protecting the privacy and security of your personal information. This privacy policy explains how we collect and use your personal data during the recruitment process, in accordance with the General Data Protection Regulation (GDPR) and the Data Protection Act 2018, which can be found on our Use of Personal Data and Privacy website."
        }
    ],
    "pdf_files": []
}