{
    "url": "https://www.nottingham.ac.uk/jobs/candidate-guidance/understanding-our-interview-process.aspx",
    "content": [
        {
            "p": "We use a structured interview approach as our standard method for assessing your suitability for a role. You can expect us to ask questions that relate specifically to the role criteria giving you the opportunity to tell us more about your skills, knowledge and experience and how this is relevant to the role you have applied for. Our managers and panel members will do all that they can to put you at ease and their job is to explore with you how your knowledge, skills and experience match the requirements of the role you are applying for. Where possible we will ensure your interview panel members come from diverse backgrounds because we know that when consideration is given by a group of people who have different perspectives based on their personal experiences, we can demonstrate inclusiveness in our selection process. As a part of our ongoing work towards Equality, Diversity and Inclusion, all our panel members attend mandatory training for interview skills and the management of potential bias in the process. They will follow a consistent approach to carrying out interviews and assessments to ensure all our candidates have opportunity to perform at their best. Our interview questions are designed to seek evidence from you of your past experiences and how you have applied your knowledge and skills in given situations that would be applicable to the role. We will seek to understand not just what you have done in the past but also how you have approached your work and your relationships with other members of your team and people in your workplace. We use competency-based interview questions intended to elicit answers based on previous experience. There is no right or wrong answer as everyone will have different experiences to share. The important thing will be for you to demonstrate how your past experiences will help you to perform well in the role you have applied for. Example questions: Tell me about a time when you needed to manage competing deadlines. Give me an example of when you have worked collaboratively with others to achieve a goal. Describe a time when you have developed or implemented a new idea or process to improve service delivery The panel will use probing techniques to better understand your answers to the questions, asking you how you approached a given situation or task and seeking to understand your reasoning for the actions taken. Examples questions: How did you do this? What approach did you take? And why? Who did you need to consult? And why? What difficulties did you face and how did you overcome these? We may ask these types of questions to test your technical knowledge and there is usually a correct answer. For example: What is the coding for X? You may be given a scenario and asked what the best course of action would be to resolve it. For example, a team management scenario or a customer service scenario. Here, there is no right or wrong answer but your response will help the panel to assess your approach to the given task. We realise that not everyone will be able to call upon past work experience. Hypothetical questions are designed to understand what you might do ‘in a given situation’. What would you do if…...? What do you think the right approach would be for …...? How might you apply your experience to the Higher Education sector or here at Nottingham? Waiting for the interview outcome can be an anxious time. At the end of your interview, the hiring manager will usually let you know how long it will take for them to make a final decision. Our HR Team aim to let you know as soon as the decision is confirmed by the interview panel. We aim to send a communication within 5 working days of your interview. Sometimes it takes longer for the decision to be confirmed, so don't worry if you don't hear from us straightaway. We will always let you know the outcome. Feedback following your interview and assessment is available from a member of the selection panel upon request. If you would like to receive feedback, please request this via our HR Team by either responding to an email with the outcome or BR-HR-Recruitment@nottingham.ac.uk or call +44 (0) 115 748400 Option 3. The hiring manager will focus on the criteria detailed in the role profile and explain how well your responses met or failed to meet the evidence sought, providing comments on your strengths for the role as well as the areas you fell short in. We hope this feedback will help you to identify ways in which you can improve, develop, and take forward when making another application. At the same time, you will have the opportunity to ask questions about your application and interview to aid your understanding. We are hoping that the feedback provided by the hiring manager will be meaningful and add value to your future career, whether you decide to apply for another role at our university or another organisation. We strive for the best experience for our candidates and look forward to meeting you and guiding you through your recruitment journey with us."
        }
    ],
    "pdf_files": []
}