{
    "url": "https://www.nottingham.ac.uk/jobs/candidate-guidance/preparing-for-your-interview.aspx",
    "content": [
        {
            "p": "We all know that an interview can be a nerve-wracking situation, and therefore preparation is key. We hope the following guidance supports you in your preparation and helps you to perform at your best. In preparation for an interview, we recommend that you: Study the role profile and consider the essential knowledge, skills, experience and competencies required. Think about how these relate to you and your experiences / achievements Look at the key responsibilities of the role and visualise yourself delivering these. Think about what you have done in the past that demonstrates your ability to perform these responsibilities Share examples from past experiences that demonstrate your ability to perform in the role you are applying for. Evidence has shown that past success is a predictor of future performance We would recommend you structure your answer using the following STARR technique: Situation - Set the scene for an instance where you have used the specific skill or competency required. Keep it brief with just enough information to provide the context or background. Task - Explain what the task was and your role within the task. Action - Be prepared to answer probing questions that will explore your actions, motives, and ways of working whilst delivering the task. For example: how you went about it, why you took that approach, how you engaged with others, how you dealt with problems, who you consulted with, what decisions you had to make…. Result - Be clear what the outcome / result was – the panel will want to establish how effective you were in the described situation. Reflection - You may be asked what you learnt in the process and whether you might do things differently next time. What we are looking for in your responses: The selection panel will expect that you might be nervous and they will do their best to put you at ease. However, here are some suggestions for helping you to manage any interview nerves. Plan ahead: Tips for calming your mind: For online interviews prepare the environment: Important to note The University of Nottingham is a Disability Confident employer. We recognise that people with disabilities may face barriers and challenges accessing work opportunities and we make every effort to improve our processes to recruit, retain and develop disabled people. We are committed to offering reasonable adjustments to support you to succeed in our interview and assessment process. So, if we can do anything to make our process more accessible for you, please let us know by contacting a member of our HR Team by email to hr@nottingham.ac.uk or call +44 (0)115 748 4800. In addition, if you declare a disability in your application form, and you can demonstrate that you meet the minimum requirements for the role, you will be offered an interview. Unless you ask not to be considered under the Disability Confident commitment. Please note, this information will be used to assist us in monitoring the effectiveness of our policy and will not be taken into consideration for short-listing and interviewing purposes. If you have any support needs to help you perform in the interview and assessment that is not covered under the Equality Act 2010, please contact us to discuss. When attending the interview at our university, make sure you bring evidence of your eligibility to work in the UK. We require this information to comply with provisions which set out employers' responsibilities in relation to the prevention of illegal working in the UK. You can find further information about required documentation on the evidence of right to work website. The University of Nottingham may reimburse travel expenses incurred when attending the interview and selection purposes, where is deemed reasonable, at the discretion of the school or department and in accordance with the university policy. If you are eligible to claim travel expenses to attend the interview at our university, you will be notified of this within an invitation to the interview email. You can find more about the interview expenses claim policy and form website."
        }
    ],
    "pdf_files": []
}