{
    "url": "https://www.nottingham.edu.my/Jobs/Current-Vacancies-2/English-Version.aspx",
    "content": [
        {
            "p": "*Important note* In pursuant to the Personal Data Protection Act, you are advised to read and understand our Notice and Choice Principles statement. By submitting your resume to us, you have declared that you have read, understood and accepted our Notice and Choice Principle Statement and gave us full consent to process your personal information along with your sensitive data. Click here to view our Notice & Choice Principle in Bahasa Malaysia Notice and Choice Principles In accordance with the Personal Data Protection Act 2010 (‘the Act’) which became enforceable on 15th November 2013 to regulate the processing of personal data in commercial transactions, The University of Nottingham Malaysia Campus Sdn Bhd, existing now and/or at a future date (hereinafter referred to as ‘the Company), is committed to ensure complete compliance with the Act. This Notice gives you a good understanding on how we handle potential employees’ personal data that we collect, process and store in the Company and/or its subsidiaries/associate companies/related companies/entities, whether related or associated existing now or at a future date. This document is also intended to give you, as a data subject, knowledge on how you can control our disclosure of such data. Please read the following, then sign and date on this form where shown to indicate your consent and understanding of the contents. We are processing your personal data The Company needs to collect and process your personal data to which you are/may be a party to, in order to generally offer you employment with us (in the event you are a candidate applying for employment with us). Your personal data that we collect and process, include but are not restricted to:- Name, identification number (NRIC/Passport), EPF number, SOCSO number, income tax number, address, contact numbers, gender, nationality, date of birth, place of birth, marital status, height, weight, family information, education, IT skills, language proficiency, personal email address, photo, passport number, blood group, previous employers data, salary, bank account number, bank name and address, employment bond agreement, driving license number, vehicle information, hobbies/interests etc. Sensitive personal data Some of the personal data that we collect and process may include what is defined as ‘sensitive personal data’ under the Act and these include, but are not restricted to:- How do we use your data The Company will be using your personal data to discharge its obligations as your potential employer. Specifically, the purpose for which your personal data may be used and further processed includes, but not restricted to, the following:- How is your data collected Most, if not all, of your personal data was obtained from you, either from the following sources or from any other information you provided:- In some instances, your personal data may have been obtained from external sources including, but not restricted to the following:- Your rights You may request access to and request correction of your personal data. In order to exercise your rights, you will have to submit the Request for Access/Update of Personal Data Form. You may obtain a copy of this Form from Human Resource Department, The University of Nottingham Malaysia Campus Sdn Bhd. Phone Number : 03 – 8725 3455 Fax Number : 03 – 8924 8655 Email Address : pdpa.hr@nottingham.edu.my Any request to exercise your rights shall be administered as per the Act. Please be informed that pursuant to the Act, your request may be rejected in certain circumstances. To whom we may disclose your information Your personal data will be kept confidential but it may be provided or disclosed to third parties for the purposes stated above. Whilst we do not disclose your information to any third parties unless it is within the ambit of permitted disclosures under prevailing laws/guidelines and/or you have consented to such disclosure, we may disclose your information to the categories of parties as listed below but not restricted to :- We will ensure that reasonable steps are taken by the above categories of parties to protect and/or maintain confidentiality of your information that we may disclose to them. Limiting the processing of personal data Although, as stated above, we only process your personal data for purposes related to performing a contract of employment, in the event your personal data is being processed for other purposes (with your consent), you have a right to request us to stop such processing. You may exercise this right by contacting the Human Resource Department, The University of Nottingham Malaysia Campus Sdn Bhd. This right extends to stopping the processing of your personal data which relates to the personal data of other persons. Provision of information As a job applicant, you have the right to decide what information that you wish to provide. However, please be informed that all the information that we request for, as stated above, are mandatory information for us. If you choose not to provide and/or fail to supply us with such personal data (and/or decide not to give us consent to process your personal data, including explicit consent for sensitive personal data), we will not be able to offer you employment with the Company (in the event you are a candidate applying for employment with us). Accordingly, if you decide not to provide the mandatory information to us, it may necessarily mean that an offer of employment will not be made. The Company reserves the right to review and/or amend this Notice from time to time and will communicate such changes along with the updated Policy on the Company’s website, and/or other appropriate communication means as may be determined by the Company. Nothing in this Notice shall limit the rights of the Company and employees under the Personal Data Protection Act 2010. I have read, understood and accept this Notice and Choice Principle Statement and gave my full consent to The University of Nottingham Malaysia Campus Sdn Bhd to process my personal information along with my sensitive data. Disagree Agree telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001 email: hr@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}