{
    "url": "https://www.nottingham.ac.uk/jobs/candidate-guidance/understanding-our-application-process.aspx",
    "content": [
        {
            "p": "We use criteria-based application form for most of our jobs at the university but there are some roles such as research and teaching that utilise the CV-based application form. This type of application is used for most of our advertised roles at the university. It allows the hiring manager to collect information in a structured template seeking examples that allow you to demonstrate your skills, competencies and experience for the role. In all cases we remove access to the sensitive application data for the hiring manager and selection panel (age, religion, sexual orientation, sex, disability, nationality, ethnic origin). We also use anonymous shortlisting for many roles, which means the panel will also not have sight of information such as your: This allows the selection panel to focus solely on the evidence you have provided in relation to your knowledge, skills and experience for the role. The ‘sensitive data’ provided in your application is only visible to our HR Team. We ask that you do not reference any protected characteristic or share personal information in your criteria-based answers or supporting statement. You can find more information about protected characteristics on our Equality, Diversity and Inclusion website. We are continuously working to improve the inclusiveness of our recruitment processes and in most instances our criteria-based application process is anonymised. If you are applying via a criteria-based application, ensure that you give specific examples to support your answers to the questions. We recommend structuring your answers using the following technique to ensure the selection panel have all the information they need to make a shortlisting decision. The STARR technique Think about the question/criteria/competency/requirement you are evidencing and share an example to demonstrate how you meet it. For example; On the criteria-based application, you are asked to give evidence of your customer service skills. Think about a situation where you demonstrated your customer service skills, for example: communication, planning and organising and problem solving. What was the situation? What were you asked to do? Use this to explain the task. What action did you take to support the customer and how did you go about this? Think about the skills you have used and the actions you took to help the customer and highlight those within your response. What was the outcome of your action? Was it successful and why? Was the outcome successful because of the action you decided to take? Did you learn anything which would mean you would have done something different next time? For some roles we use a CV-based application. This application type often applies to our research and teaching roles, where a CV and other supporting documents such as a publication list and a supporting statement/cover letter is required. When making a CV-based application, make sure you tailor your CV to reflect the role requirements, providing details of how you meet the skills and experience asked for in the role profile. The role profile document is always attached to the bottom of the advert page. Key things to include in your CV are: Within the additional information tab on the application form you have an option to provide extra information you couldn’t include within your responses to the specific application questions or that might otherwise have included in your CV. For example, your motivation for applying and why you think you are a good fit for the role. You can also choose to use this section to add a cover letter if you wish, although this is not mandatory. Please ensure you don’t include your name and personal details in your additional information section and please do not include information which should be detailed under the relevant criteria for a criteria-based application. The selection panel will rely on the information in the criteria-based application section to inform shortlisting decisions You may also use the additional information section to explain any gaps in your employment history that you feel may be relevant to include. We recognise that people have varied career patterns and would encourage you to provide any details that you would wish to. For example: you can detail that you took a career break and share your reasons why. Please note, career breaks and any details that you share will not be taken into consideration during the selection process, they are for information only and will not impact the selection decision. The University of Nottingham is proud to be a Disability Confident Committed (Level 1) employer. Increasing the diversity of our employee community is extremely important to us and we are committed to the aims of Disability Confident Scheme. We: As part of our commitment to Disability Confident, we ask all candidates (within the Equal Opportunities section of the application form) if they wish to be considered under this scheme should they meet the minimum criteria for the role. By opting-in to this scheme, candidates will be disclosing that they have a disability solely for the purpose of the interview guarantee. We will not assume nor infer that an applicant wishes to disclose or record their disability in any other way. If you require any reasonable adjustments in order to attend the interview or complete any assessments required as part of the selection process, please let us know as soon as possible."
        }
    ],
    "pdf_files": []
}