{
    "url": "https://www.nottingham.edu.my/Knowledge-Without-Borders-Network/People/Profiles.aspx",
    "content": [
        {
            "p": "Christine Ennew Professor Christine Ennew is Provost and CEO of the University of Nottingham Malaysia Campus and Pro Vice Chancellor at the University of Nottingham. Christine graduated from Cambridge University and completed her PhD at Nottingham. She was appointed to lead UNMC in January 2013 and is responsible for the University of Nottingham’s first international campus which is located to the south of Kuala Lumpur and is home to almost 5000 students and around 550 staff. Over the previous 5 years, she managed the University's ambitious international strategy, which attracted students and academic staff from almost 150 nations to research and teaching campuses in both Britain and Asia. She also serves as the University’s Manager for the Universitas21 network. “For much of my academic career I’ve worked with international students, but my real interest in the broader process of internationalisation in HE goes back about 15 years, to my initial secondment to Malaysia to work on the start-up of UNMC. Since then, I’ve been involved managerially in a range of activities and projects and have increasingly sought to align my academic interests in service industry management and marketing with my managerial practice in the area of international higher education” christine.ennew@nottingham.edu.my Sean Matthews Dr Sean Matthews is currently seconded from The University of Nottingham, UK as Head of School (UNMC) in the School of Modern Languages and Cultures, University of Nottingham Malaysia Campus. With Professor Christine Ennew and Dr Christopher Hill, he coordinates the Knowledge Without Borders Network. His interests in internationalisation of higher education relate both to his academic research – as a literary and cultural critic and intellectual historian he is centrally concerned with the history and theory of postcolonialism, but also with understanding processes of emergence and change in academic disciplines and institutions, the ways in which knowledge is created, curated and disseminated – but above all from his experiences as a university lecturer here in Malaysia, but also in Japan, the United States, Wales (and England) and in continental Europe. \"Coming to Malaysia crystallised my interest in the processes and history of internationalisation, bringing into urgent focus my thoughts about the significance and course of TNE. The past twenty years have seen extraordinarily rapid changes, globally, in the university sector, and my career has, inevitably, in some ways been closely bound up with that history. KWBN offers an opportunity, I hope for many of us, who have experienced these big changes, been subject to these great changes, to contribute to the work of better understanding and, ideally, directing them.\" sean.matthews@nottingham.edu.my Yeong Woon Chin Woon Chin joined the University of Nottingham Malaysia Campus in 2007 after completing her Masters degree in Marketing, at the University of Nottingham, UK. Prior to this she obtained a BA (Hons) in Marketing from Inti College Malaysia, Nilai (now known as Inti International University). Woon Chin worked in the Marketing Office (now known as Malaysian Student Recruitment Team) for the Malaysia Campus until mid-2008 and returned in December 2010 to assume the role of Marketing Executive at the International Office. She has had numerous professional working experiences with organisations such as Federation of Malaysian Manufacturers and Genting Berhad. She is currently the Research & Executive Administrator for Knowledge Without Borders Network and a PhD candidate in the Faculty of Arts & Social Sciences. Her interest in internationalisation is on several levels; for example, her work with Malaysia Campus International Office involved engagement with prospective and current students in the recruitment and marketing area, facilitator for student experience within the international student community on campus. \"My interest in internationalisation of higher education came from working with students (from both Malaysian and international student groups) in an international campus like Nottingham University. I am keen to find out what are the issues related to student experience and expectations of internationalisation, influence of ‘glocal’ marketing and recruitment strategies on their decision to study in a global university brand, impact of cross cultural communication between groups such as students and other stakeholders of the University in an internationalised learning and teaching environment.\" woonchin.yeong@nottingham.edu.my Adrian Mateo Adrian Mateo is Alumni Manager at Nottingham University Business School. He is passionate about education and services to young people having worked in the sector for over 25 years, originally as a Careers Adviser, and subsequently in a variety of marketing roles. Adrian holds an MA in International Higher Education and is particularly interested in the organisational and business dimensions of internationalisation. He has published research on the relationship between marketing and the marketisation of higher education, and the impact of a university’s global brand on staff recruitment, identity and working practices. \"I believe passionately in education as a building block for personal development and a positive force for change in society. Despite the fundamental aims and values of education remaining fairly constant, the landscape in which it operates has changed significantly over recent decades. Increasing competition, new technologies and globalisation have revolutionised the accessibility and delivery of education and the structure of the marketplace itself is unrecognisable from that of even the recent past. Higher Education has become a competitive market choice influenced by complex factors such as individual perceptions, preferred learning approach and institutional achievement and reputation. These new dynamics may challenge traditional approaches and attitudes but also present opportunities to forward thinking organisations who can harness them effectively.\" adrian.mateo@nottingham.ac.uk telephone: +6 (03) 8924 8040 email: kwbn@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}