{
    "url": "https://www.nottingham.edu.my/Languages/People/liyeun.chin",
    "content": [
        {
            "p": "CELFE Director of External Engagement, Faculty of Social Sciences Li Yeun's journey into the world of teaching began with her sights on working with young children. After being awarded a 1st Class Honours degree upon graduation, she found an unexpected vivacity during her experience teaching nursing undergraduates from Masterskill University College of Health Sciences. Working with undergraduates reminded her to embrace both the thrills and challenges that educators face each day. Li Yeun had previously worked at University Putra Malaysia (UPM Serdang campus) where she coordinated and taught some English language courses, namely Introduction to Grammar, Report Writing, Oral Interaction Skills, Public Speaking, and General Writing Skills. While teaching is a worthy profession, Li Yeun pursued her visions to contribute to the functions of a large business consulting organization as a corporate trainer. Her fortitude enabled her to acquire the experience of conducting end-to-end facilitation to ensure all training programmes meet its objectives and deliver a return on investment. Although the change of pace in the corporate environment proved to be considerably fulfilling, it was the lure of the classroom that pulled her back in. At present, Li Yeun is instrumental in peer feedback and educational leadership. 1. Speaking for Academic Purposes 2. Writing for Academic Purposes 3. Written Communication and Study Skills 4. Oral Communication and Study Skills / Oral Communication for Academic Purposes 5. Remedial Grammar 6. Academic Presentation Skills 7. English Language & Study Skills for Science & Engineering 8. Business Email Writing 9. Pronunciation Skills 10. Principles of Education 11. Foundations in Language & Literature 12. Introduction to Perspectives of Learning / Learning How to Learn telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8012"
        }
    ],
    "pdf_files": []
}