{
    "url": "https://www.nottingham.edu.my/Languages/Courses/index.aspx",
    "content": [
        {
            "p": "At the School of Languages, we offer a range of programmes designed to support language acquisition and enhance communication skills for both students and professionals. Explore our offerings below: Our Executive Education programmes are designed to meet the needs of professionals and institutions aiming to enhance language and communication skills. One notable example is our collaboration with Bank Negara Malaysia, where we provided tailored training courses to equip BNM scholars with advanced academic English and study skills. These customised courses ensure participants are well-prepared for both local and international settings, supporting their professional growth and industry relevance. Additionally, the School of Languages fosters connections through strategic partnerships with renowned educational institutions. Our immersive summer and winter programmes, developed with universities in Korea, Taiwan, Japan, and beyond, offer students unique opportunities for intensive language learning and cultural exchange. This programme is designed to broaden linguistic proficiency and cultural understanding while immersing international students to the wonders of Malaysia. Our In-sessional English workshops, available year-round and free of charge, are non-credit bearing sessions open to the entireUniversity of Nottingham Malaysia community. These workshops focus on enhancing English proficiency and academic skills essential for success across diverse programmes. Workshops such as Essential Grammar, Citation and Referencing, Presentation Skills, and Academic Vocabulary are advertised on Moodle, allowing students to view the schedule and register online. Once the full schedule is available, all University of Nottingham Malaysia students will receive an email notification, ensuring prompt access to the semester’s offerings. We also organise bespoke courses tailored to specific departments or schools, such as the School of Pharmacy and School of Engineering. Our Pre-sessional English courses are specifically tailored for students holding Conditional Offer Letters. These courses provide the academic skills and language foundation needed for success in undergraduate or postgraduate studies and to excel in external English tests. We offer four core modules in Pre-sessional English: Each module is available at two levels: Enhance your degree by choosing a language module for credits. Open to students of all disciplines, we offer modules in French, German, Japanese, Korean, Mandarin, and Spanish, ranging from Stage 1 (Beginner) to Stage 3 (Upper Intermediate). These courses focus on practical communication skills and are supported by digital tools like Moodle, virtual classrooms, and our dedicated Language Resource Centre for independent learning. Each language module provides 3-5 hours of weekly contact in speaking, listening, reading, and writing, with the option to audit courses for a modest fee, depending on availability. New students will be assessed and placed at the appropriate level upon arrival, ensuring they start at a point that matches their abilities. Levels and credits 10/semester 20/semester Level 1 3 4 5 6 ✓ French German Japanese Korean Spanish The School of Languages is committed to providing transformative language education, offering opportunities that enhance both academic and professional success in a multicultural world. Explore our programs and discover how they can complement your educational journey at University of Nottingham Malaysia. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8012"
        }
    ],
    "pdf_files": []
}