{
    "url": "https://www.nottingham.ac.uk/law/events/ila-seminar-series/2024-25/ila-seminar-series-dr-ardi-imseis.aspx",
    "content": [
        {
            "p": "Online (Microsoft Teams): Join the meeting now The United Nations and the Question of Palestine Speaker: Dr Ardi Imseis, Associate Professor of Law, Queen’s University Discussant: Dr Victor Kattan, Assistant Professor in Public International Law, University of Nottingham Abstract: Dr Imseis will present his recent book, published by Cambridge University Press in 2023. It is the first sustained and scholarly legal history of the United Nation’s management of the Palestine question. Contrary to conventional wisdom, there has been a continuing though vacillating gulf between the requirements of international law and the UN on the question of Palestine. This book explores the UN's management of the longest-running problem on its agenda, critically assessing tensions between the organization's position and international law. What forms has the UN's failure to respect international law taken, and with what implications? The author critically interrogates the received wisdom regarding the UN's fealty to the international rule of law, in favour of what is described as an international rule by law. This book demonstrates that through the actions of the UN, Palestine and its people have been committed to a state of what the author calls 'international legal subalternity', according to which the promise of justice through international law is repeatedly proffered under a cloak of political legitimacy furnished by the international community, but its realisation is interminably withheld. Speaker Biography: Dr Ardi Imseis is Associate Professor of Law, Faculty of Law, Queen’s University. In 2019 he was named by the UN High Commissioner for Human Rights to serve as a Member of the UN commission of inquiry into the civil war in Yemen. Between 2002 and 2014, he served in senior legal and policy capacities in the Middle East with the United Nations Relief and Works Agency for Palestine Refugees in the Near East (UNRWA) and the United Nations High Commissioner for Refugees (UNHCR). He has provided expert testimony in his personal capacity before various high-level bodies, including the UN Security Council, the UN Human Rights Council, and the UN Committee on Economic, Social and Cultural Rights. Dr Imseis’s scholarship has appeared in a wide array of international journals, and he is former Editor-in-Chief of the Palestine Yearbook of International Law (Brill; 2008-2019) and Harlan Fiske Stone Scholar and Human Rights Fellow, Columbia Law School. Most recently he served as Legal Counsel before the International Court of Justice in the case concerning the Legal Consequences arising from the policies and practices of Israel in the Occupied Palestinian Territory, including East Jerusalem. Dr Imseis holds a Ph.D. (Cambridge), an LL.M. (Columbia), LL.B. (Dalhousie), and B.A. (Hons.) (Toronto). Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}