{
    "url": "https://www.nottingham.ac.uk/law/study/postgraduate-taught/index.aspx",
    "content": [
        {
            "p": "The School of Law offers a variety of specialist masters degrees, which are supported by a diverse range of modules. Our programmes offer a range of subjects to study, with a curriculum that constantly evolves in response to major legal and world developments. We value excellence in teaching, allied to a strong research base, and encourage a culture of interactive learning. This allows our postgraduate students to be directly assisted in their learning and have effective interaction with their teachers. Our guide to applying Funding information Our Master of Laws LLM allows you to tailor your LLM to your interests and gain a broad-based legal education or focus on a specific area. Develop a critical understanding of crime, criminalisation, victimisation, and criminal justice practice. On this course you will engage with the latest ideas and developments in international human rights law, taught by experts. Our International Law LLM allows you to choose from an extensive range of public international law modules, allowing you to tailor your qualification to your academic interests and career goals. Study areas of law related to AI, robotics, copyright, data protection and regulation of the digital economy. This programme offers a comprehensive grounding in the legal aspects of the subject. Discover campus life with 360 degree images and videos on our virtual tour. Experience student life by exploring areas such as accommodation, student services, sport centres, libraries and the Researcher Academy. Visit our virtual tour We offer pre-sessional English language courses to improve your language level to meet the entry requirements for your degree. There is continued support while you study with us, with courses, consultations and drop-ins available. English language support Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}