{
    "url": "https://www.nottingham.ac.uk/library/collections/stock-review-2024.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy This consultation closed on 31 May, after a 16 week consultation period. The book stock review is a collaborative process we undertake to ensure that our collections remain relevant for teaching and research by reviewing titles which have not been borrowed for a certain number of years and which are widely held nationally. We want to work in partnership with academics to make decisions about these titles. We review stock annually in the Spring term. In a typical year, we might buy around 8,000 new print items. Shelves in some locations are too full to add new books, and retention of unused titles makes it both difficult to find specific books and to browse for titles most likely to be of interest. In 2019, we piloted a new approach to withdrawing final copies of low-use books from our libraries and Store. We worked with our academic community to agree a systematic and standard approach to withdrawing material. We repeated the process in 2020, 2022 and 2023, and have been delighted with the level of engagement with the listings of items that we shared. To date, academic comments have allowed us to identify more than 6,400 items which, although low-use, remain important for teaching and research. For the 2023-24 review, we concentrated on low use books in Business Library, Djanogly Learning Resource Centre, George Green Library, Greenfield Medical Library, Hallward Library, James Cameron-Gifford Library, and our off-site Store at King’s Meadow Campus. For Hallward Library, we used a combination of library data and national tools to identify titles which match the following criteria: For James Cameron-Gifford Library, George Green Library and Greenfield Medical Library, we used a combination of library data and national tools to identify titles which match the following criteria: For Business Library and Djanogly Learning Resource Centre, we used a combination of library data and national tools to identify titles which match the following criteria: For Store, we used a combination of library data and national tools to identify titles which match the following criteria: The resulting lists of eligible titles were available to colleagues in academic departments until the end of Friday 31 May, a 16 week consultation period. After reviewing all the comments, over the summer vacation we remove or move stock, update the catalogue and reorganise shelf space. If you have any questions about the process, please contact the Collections Team. Colleagues in academic departments are welcome to identify any titles you want us to keep. We welcome academic engagement with this process so that collaboratively we can make the right decisions about our collections. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}