{
    "url": "https://www.nottingham.ac.uk/library/help/accessibility/enhanced-library-support.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy An enhanced service for disabled students and students with a learning difficulty or long-term health condition. We offer a range of support to ensure that our facilities and services are accessible to disabled students and those with a Specific Learning Difference for example dyslexia, dyspraxia or ADHD. Whilst our Enhanced Library Support service requires a referral from Disability Support Services, a number of other useful services are available on-demand to all students. For information about Disability Support Services and how to get a Support Plan visit the Student Services website. Libraries offer an enhanced service for disabled students. This includes: Assistive technology rooms are bookable spaces within our libraries that provide access to assistive hardware to support your studies, including adjustable desks, magnifiers and more. A range of assistive software is available to all students via the University network. Assistive Technology Rooms can be booked using Click and Study. Dedicated study rooms for students eligible for Enhanced Library Support are available in Hallward Library, George Green Library, James Cameron-Gifford Library and Greenfield Medical Library. These rooms can be booked via Click and Study. This service produces accessible resource materials for disabled students who cannot access standard text. The service can also provide advice and guidance to staff who wish to make their own work more accessible. Students needing AFS support must be referred by Disability Support Services. For general enquiries contact the Alternative Formats Service. Alternative Formats Service Library staff are available to help with searching the catalogue, using databases, finding books and more. You can also book a tour of the library by: Back to the top The following services are available to all students without a referral and are designed to make it easier to access library services, resources and support. Explore tools and support services that could help you study more effectively and find out how the university is working towards greater digital accessibility of teaching and learning materials. Student accessibility King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}