{
    "url": "https://www.nottingham.ac.uk/library/news/2024/dear-sisters-exhibition-opens.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy April 10, 2024, by Sarah Colborne Attendees at the exhibition launch The exhibition was officially opened by Professor Shearer West, the University of Nottingham’s first female Vice-Chancellor, and Vandna Gohil, CEO of Nottingham’s Women’s Centre. Both spoke of the importance of women’s centres which were established in several cities by women’s liberation activists. Nottingham’s Women’s Centre is one of the oldest in the country. The first premises was at Cobden Chambers, Pelham Street, moving to a number of locations before finally securing its current premises on Chaucer Street in 1985, making it the largest in the country at that time. Nottingham Women’s Centre continues to offer support to local women and campaigns on the issues affecting them – pushing for change at a local and national level. Its Chaucer Street location is also home to services such as Nottingham Muslim Women’s Network, Nottinghamshire Sexual Violence Support Services and community ps such as the Heya Arab Women’s Group. Refreshments included Order and Disorder, a collaboration between Castle Rock Brewery and No Half Measures brewed especially for International Women’s Day 2024. For some of the women who attended the launch it was a reunion of sorts and visitors to the exhibition were keen to identify each other in the documents and photographs on display. It is hoped that the exhibition will prompt other women activists to look through their own papers to see if there is anything they would like to contribute to the Feminist Archive. Vandna Gohil speaking at the launch The exhibition’s programme of events got off to a strong start with a sold out talk by Lisa McKenzie ‘A working class woman is something to be’. Lisa grew up in the coal-mining town of Sutton-in-Ashfield. Her very moving talk told her personal story of growing up during the miners’ strike and the powerful “queens” in her family who fought for the survival of their community. Lisa recently featured on the BBC 2 documentary Miners’ Strike: A Frontline Story and was interviewed on Women’s Hour. Lisa brought along some of her mum’s papers which included the issue of Here we go! Bulletin of the Nottinghamshire Women’s Support Groups from January 1985 which is on display in the exhibition. She revealed that the three women from Ashfield we mentioned in the caption, who were arrested for the charge of besetting, were Lisa’s Mum and Aunties! Dr Lisa McKenzie presenting the first lunchtime talk. An exhibition telling the story of the 30 women’s support groups, curated by some of the women involved, opens on 27th April at the Nottinghamshire Mining Museum. The dear sisters exhibition runs until 1st September and the next talk on the 11 June is a panel discussion between members of the Nottingham Feminist Archive Group and their interviewees, drawing out some of the themes which emerged from the interviews: Meet the activists. Photo by Tina Pamplin of contributors to the Feminist Archive at the launch The Feminist Archive (East Midlands) and accompanying Feminist Publications Collection can be accessed in the Manuscripts and Special Collections Reading Room at the University’s King’s Meadow Campus. No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}