{
    "url": "https://www.nottingham.ac.uk/library/events/eventstopic.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Explore our upcoming online training and drop-in sessions by topic. To attend any of these sessions, join the the Libraries Information Skills team on Microsoft Teams. We’ll introduce you to key library resources, including NUsearch and your subject databases, and point you to sources of further help. You’ll also be invited to enrol on ‘Literature Searching and the Literature Review’ – our online course on Moodle – to help you further develop your literature searching skills at your own pace. Sign up for Welcome to Libraries on Central Short Courses Our live Welcome to Libraries sessions for undergraduate and postgraduate students have finished. You can access our library induction materials online: Back to the top This session is suitable for year one undergraduate students in all subjects. Need help getting started using library resources? In this session discover how to find academic information for your coursework. We’ll start with your online reading lists, then show you how to use NUsearch to find print and electronic books and journals. Finally, we’ll look at how to follow up references you find in other sources. You’ll also be introduced to basic literature searching skills to help you find information more easily. This session is suitable for undergraduate and masters students in all subjects. Keen to search web more effectively? In this session discover: This session is suitable for undergraduates (year two onwards) and Masters students studying Arts subjects. Looking to further develop your literature searching skills to find information for projects and dissertations? This session will focus on more advanced literature searching skills and techniques. We’ll explore your subject databases in the Arts and Social Sciences in more detail, along with other sources of information you may not have used before to help you take a broader approach to searching for information. This session is suitable for undergraduates (year two onwards) and Masters students studying STEM subjects. We’ll explore your subject databases in STEM in more detail, along with other sources of information you may not have used before to help you take a broader approach to searching for information. This session is suitable for undergraduate and Masters students doing systematic reviews for projects or dissertations in STEM subjects. Doing a systematic review for a project or dissertation? Expand your knowledge of the literature searching process in this session, to help you structure and perform a focused, methodical and rigorous search for your systematic review. Tips on hand-searching and using grey literature will also be included to help you conduct a wide-reaching search to find your evidence. Looking to further develop your literature searching skills and knowledge of resources to find relevant information for your research? These session will focus on advanced literature searching skills and techniques, and will explore a range of databases and specialist resources in your subject area to help you search effectively for your research. We are running individual sessions for each faculty. Advance booking is required. Follow the link below to sign up on Central Short Courses. Links coming soon. Join the Student Academic Skills team to explore different study strategies to help you find new ideas and refresh your study routines. The following dates and times are for Arts and Social Sciences students. Visit our Moodle Hubs for sessions for: Links will be added soon. Please add the date and time to your diary and check back soon. These sessions are suitable for all students. These sessions are suitable for final year undergraduate and masters students. These sessions are suitable for final year undergraduate and masters students This session is suitable for all University of Nottingham students. Finding it hard to focus? Join our online study sessions for two hours of structured study time alongside other students from across the University. Our online study sessions take place every Wednesday from 11am - 1pm on Microsoft Teams. To take part: Study with us Want to develop your academic skills? Drop in to our online study pop-ups for help with essay writing, referencing, note making, presentation skills and much more. How to join a study pop-up Our website live chat will be available from 21 September Join us on Microsoft Teams on Fridays between 2-4pm Join us on Instagram every Wednesday between 2-4pm King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}