{
    "url": "https://www.nottingham.ac.uk/library/research/training.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Explore our training resources, which are delivered through a number of different routes including Microsoft Teams and Moodle. Select a session below to find out more, including how to register. SciVal is an Elsevier-owned research analytics tool which provides data at the level of individual publications, groups of publications, individual researchers, groups of researchers and institutions. This course covers the data which can be viewed and analysed via SciVal, including research volume, citation metrics and policy mentions. Participants will learn how to access SciVal, navigate its modules and understand their own publication data that is available via the tool. Book session via Central Short Courses View the course materials Ensuring your research outputs are available open access (OA) enables them to reach a broader audience, increasing the impact of your research and potentially boosting numbers of citations. This course introduces open access, considers the options available to make outputs OA and explores how to access OA publications. The course also touches on: the implications of licensing; funder expectations; copyright; and the impact of Plan S, which requires outputs to be made openly available immediately on publication. This course is run by the Libraries Research Support Team. Book via Central Short Courses This course will introduce you to the key issues, requirements, and strategies associated with research data management, and teach you how to manage your data throughout the research data life-cycle by helping you to write a data management plan (DMP). You can self enrol on the course via Moodle. Research Data Management on Moodle To provide an overview of advanced search techniques and specialist information resources to improve literature searching activities in your research area. This is an online course and there are Faculty specific sessions. This online session provides an overview of researcher profile tools and will discuss digital identity health and the benefits of a researcher profile. We offer two separate sessions for PGRs and staff, with the staff session also covering research profiles in RIS. We therefore ask that you sign up to the relevant session depending on your status. This course is delivered by the Research Intelligence Librarians. Book PGR session via Central Short Courses Book Staff session via Central Short Courses Developed by the Libraries' Learning Development team, this online interactive resource guides you through the process of undertaking a systematic review. It covers all stages of the review: from defining your research question to extracting the data from the selected studies. This Xerte toolkit is available to University of Nottingham students and staff and forms part of the 'On Course for your Masters' NOOC (Unit 4.3). Searching for Evidence for a Systematic Review (Xerte) The Library offers an 'Introduction to EndNote' course for early career researchers. There are also online videos and guides available which cover how to: Managing References A systematic review is a rigorous process of searching, critically appraising and synthesising evidence in relation to a specific research question. This in-person course is delivered by the Libraries Research Support Team and covers searching the literature for evidence, ensuring the methodology used is comprehensive, transparent and reproducible. Many researchers know of ORCID iD as a unique identifier, but your ORCID page can also act as a profile tool to maximise the discoverability of your research and professional online presence. This online session, run by the Libraries Research Support Team, will cover how to make the most of ORCID to manage your information and choose how to present yourself. It will also address how to connect your ORCID profiles to other systems to save you time in the long term. This online session covers searching the grey literature and citation searching, and gives examples of tools that can be used to manage the systematic review (SR) process. You will learn about the different types of grey literature (including how to approach searching these resources) and how generative AI is starting to be used in some parts of the SR process. You’ve probably heard of the H-index, JIF or Altmetric Attention Score – but what do those numbers really mean? Can they be trusted? How can they be used? This session introduces research metrics, including citation-based indicators and alternative metrics such as counts of policy and social media mentions. It will enable you to evaluate the strengths and weaknesses of metrics and understand their implications. The training will be informed by the University of Nottingham Guiding Principles for Use of Metrics in Research Assessment so attendees will be confident they can follow university policy and best practice. Would you like to better understand whtat research output data is available on SciVal? Using SciVal Benchmarking allows you to compare the research performance of an entity (researcher(s), institution(s), countries etc.) of interest to others. The Collaboration module is useful to identify which institutions are collaborating, this information can be used to scope new potential partnerships on a subject-specific scale. Support on this is available on request from the Research Intelligence service. Book a consultation using the link below Book a consultation King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}