{
    "url": "https://www.nottingham.ac.uk/library/help/copyright/teaching/index.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy As a member of staff you will need to photocopy, scan, and download information from books, journals and web resources to support your teaching. You may want to include, or reuse these materials in teaching resources and on reading lists. This material will almost certainly be covered by copyright and under UK law there are limits to what you can legally copy and reuse. The teaching resources that you produce will also be protected by copyright. The University of Nottingham has Copyright Database Rights and Associated Issues guidance. This distinguishes between research publications and textbooks, where the author retains copyright; and teaching materials, where the University asserts its ownership of copyright. To learn more about copyright see the Basics section. Our staying compliant checklist outlines the main ways you can use copyright materials within the law. The most relevant to you are: We have licences from the Copyright Licensing Agency, Newspaper Licensing Agency and Educational Recording Agency which cover use of text-based works, newspapers and television/radio broadcasts. Exceptions allow you to copy a “fair” proportion of a work without the prior permission of the copyright owner. For teaching the main exceptions you can use are: It is also important to be aware of variations in copyright rules for different types of materials, e.g. music, images, as this can affect what you can do. See the Materials section for further advice. More advice: Copyright home Self-directed training resources King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}