{
    "url": "https://www.nottingham.ac.uk/library/news/2024/advocates-for-animal-welfare.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy February 9, 2024, by Sarah Colborne Dorothy Hegarty, founder of FRAME, with Michael Balls, holding the FRAME logo. 1995. MS 1016/3/5/38 In our previous blog in this series, ‘Advocates for animal welfare: The Three Rs’, we introduced the ‘The Principles of Humane Technique in Experiments on Animals’ by William M.S. Russell and Rex Burch, which was to have such an impact on the career of Michael Balls, OBE, Emeritus Professor of Medical Cell Biology at the University of Nottingham. We also mentioned briefly the establishment of The National Anti-Vivisection Society and the British Union for the Abolition of Vivisection by Frances Power Cobbe (1822-1904), anti-vivisection activist and campaigner for women’s suffrage. Another advocate for animal welfare, Dorothy Hegarty, co-founded the Fund for the Replacement of Animals in Medical Experiments (FRAME) in 1969. She had had no formal education but was a passionate believer that confrontation between animal researchers and anti-vivisectionists would be fruitless, and instead what was needed was the development of practical alternatives to replace animals in scientific experiments. Michael Balls was invited to become a Trustee of FRAME after presenting at a symposium on the use of alternatives in drugs research. Hegarty also invited him to represent FRAME on their Toxicity Committee which had been established to consider the use of alternative methods to replace routine animal tests. Balls was elected Chair of the Committee and went on to become Chair of the Trustees in 1981 when Dorothy Hegarty stepped down. In order to facilitate FRAME’s active involvement in research on the development and application of alternative methods, Balls moved FRAME’s headquarters from London to Nottingham (he was a senior lecturer in the Department of Human Morphology at the University of Nottingham). Recommendations regarding the use of non-human primates for the reform of the 1876 Act, 1986. PMB 7/1/O 62a FRAME was part of a ‘Triple Alliance’ which began to meet in 1981 and sent proposals for the reform of the 1876 Act to the Home Office in 1983, which influenced the government’s White Paper. Through regular meetings, acting as advisor to the Government, through all stages of what became the Animals (Scientific Procedures) Act. On the day the Act came into force, FRAME and CRAE presented the Home Secretary with a report on non-human primate use, which made 17 suggestions (all but one of which were accepted), helping to end the use of wild chimpanzees in research. In 1984, FRAME received the first grant to be given by the British Government specifically for research into replacement alternatives and in 1986 FRAME was awarded the first Marchig Animal Welfare Award of the World Society for the Protection of Animals. FRAME collaborated with scientists from universities and industry to develop and validate a number of tests which employed cell cultures rather than live animals to assess the toxicity of chemicals, and established the ERGATT/FRAME database of alternative test methods, INVITTOX. Rt Hon Ed Balls PC MP, Secretary of State for Schools and Children at the opening of the refurbished FRAME Alternatives Laboratory, University of Nottingham Medical School, 2007. MS 1016/12/2/N 60 A succession of University of Nottingham medical students have benefitted over the years from research opportunities in the FRAME Alternatives Laboratory, based at the University’s Medical School. The Vice-Chancellor at the time, Colin Campbell, became a patron of FRAME. This long-lasting working partnership between FRAME with the University still exists today. Descriptions of the animal welfare collections held by Manuscripts and Special Collections can be explored via the Manuscripts Online Catalogue: The papers themselves can be accessed in the Reading Room at King’s Meadow Campus and digital gallery of images from the collections can be found on the Manuscripts and Special Collections website. Visit the website for the Fund for the Replacement of Animals in Medical Experiments to find out more about FRAME’s current work. No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}