{
    "url": "https://www.nottingham.ac.uk/library/support/welcome.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Your introduction to University of Nottingham Libraries Book a library tour These online sessions will provide a useful introduction to our library services and help you get started with visiting our libraries, finding resources and more. All sessions will take place online on Microsoft Teams unless otherwise stated. Please check the induction schedule from your School or Faculty for more details. Don't worry. You can explore our online induction guide at any time. Welcome to Libraries - Undergraduate Students Please check the induction schedule from your School or Faculty for the joining link. Don't worry. You can explore our online induction guides at any time. Welcome to Libraries - Postgraduate Taught Students Join our online course for all taught postgraduate students. It's been designed to support your transition to postgraduate study, your engagement with the scholarly resources you need to succeed in your studies, and your preparation for what comes next whether it be employment or postgraduate research. On Course for your Masters An overview of advanced seach techniques and specialist information resources to improve literature searching results in your research area. Researcher Information Skills for Arts Researcher Information Skills for Engineering Researcher Information Skills for Medicine and Health Sciences Researcher Information Skills for Science Researcher Information Skills for Social Sciences Web versions of our induction sessions. Welcome to Libraries - postgraduate researchers Find your subject guide Follow these courses at your own pace. Literature searching and the literature review Referencing your research Your University Card is your library card. Use it to access our libraries, use the printers and borrow books. Our eight libraries are home to subject-specific resources but you're welcome to use any location. How to collect your University Card Libraries and opening times Book a tour NUsearch is the University's library collections discovery tool. Use NUsearch to manage your library account, search our collections, place requests and access thousands of e-resources including ebooks and ejournals. Find the key resources for your subject area in our online subject guides. Discover our collections Finding online resources You can borrow up to 60 print books from our libraries. Pop in to our libraries to browse and borrow or place a request on NUsearch and we'll let you know when your book is available to collect. Borrowing and returning books Our friendly and knowledgeable Library staff are available to answer your questions: If you want to find out how to make the most of our library services and resources: Get in touch Upcoming webinars and drop-ins King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}