{
    "url": "https://www.nottingham.ac.uk/library/using/borrow/borrow.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Everything you need to know about borrowing and returning books. As a member of the University of Nottingham, you have access to our extensive print and online collections. Start your search online with our library discovery tool, NUsearch. You will need your University Card for access to the building and to borrow books using the self-service machines. Use Click and Collect to request and borrow print items from our libraries. Each book in the library will have a classmark, consisting of a series of letters and numbers, that will help you locate it on our shelves. This code is shown on the spine of a book and allows all books on a similar theme to be shelved in the same area. You will find the classmark displayed for each book on NUsearch. Please note, you will be expected to cover the cost of returning items to our libraries. How to request a postal loan You may be asked to return your books to the library if they are requested by another user. You will receive an email to let you know if this is the case. If you have any questions about your loans, please contact the Library Helpline by email, phone or Live Chat. If you have any questions about your fines, please contact the Library Helpline by email, phone or Live Chat. Fines are charged on requested overdue books, the charge is £1 per day. The maximum fine per book is £10. If you lose or damage a book, you will be charged for a replacement copy. More information about fines, charges and how to pay All University of Nottingham Libraries are cashless. Fines can be paid: King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}