{
    "url": "https://www.nottingham.ac.uk/library/accessibility/support.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Explore tools and support services that could help you study more effectively and find out how the university is working towards greater digital accessibility of teaching and learning materials. If you want to have your course materials in a different format, or want to customise your browser to make viewing web pages better for you, then you'll find a range of things here to help. There are lots of ways to personalise your browser to make it easier for you to access and read web content: Here are some of the browser tools you can use: Google Chrome tools Microsoft Edge tools Safari settings You can also make use of a number of tools and settings on your device to help make your life easier, such as changing screen modes, colour contrast, zoom and magnification, and fine tuning audio settings. The links below can help you to find out more: Microsoft accessibility features and tools Android accessibility overview – customise your android device Apple Mac - getting started with accessibility features Apple iPhone - acessibility features If you prefer to have your course materials in a different format – an audio file you can listen to, or a Word document you can personalise to your preferences, here are some tools that can help you to do that: Take a look at some of the tools available to help you navigate and read through course materials more easily: Students with a Disability Support Plan are eligible for Enhanced Library Support which provides access to bookable Assistive Technology Rooms with a range of technology and equipment to make studying easier. This includes magnifiers, adjustable lighting, wrist rests, overlays and much more. These spaces are available at: If you’re looking for support, resources and guidance around your studies and using the tools and resources available to you, we can help. Support is also available from: Academic Language and Communication Skills (ALACS) Researcher Academy We are here to help you if you have a disability, mental health difficulty, long-term medical condition, autistic spectrum condition, or a specific learning difference such as dyslexia, dyspraxia, dyscalculia or ADHD. Disability Support Services Enhanced Library Support service Assistive technology and software The university provides information about how you can take care of your mental health whilst studying as well as information about specialist services if you, or someone you know, is struggling. Student wellbeing The University of Nottingham is committed to supporting all students in reaching their full potential. Part of this commitment is to ensure your learning experiences meet accessibility requirements. This means that learning resources will be designed to present as few barriers as possible for disabled students. Accessible resources benefit all users, especially those users with disabilities. Our goal is to make your university experience as accessible as possible, continually improving the support we offer as best practice and technology evolve. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}