{
    "url": "https://www.nottingham.ac.uk/library/studying/digital/index.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Your digital journey starts here. Follow our step-by-step guide to develop the skills you will need in your studies and future career - from using digital learning tools and managing data to communicating effectively and looking after your wellbeing. New to university? You might have a lot of questions about your course and how you will learn. This short guide will help you get started with digital learning at the University of Nottingham. The first step on your journey is to assess your skills across a range of areas:. After answering a range of questions using the Digital Discovery Tool, you will receive a personal report which will help you to understand your areas of strength as well as those areas which you may wish to work on further. Take the digital skills self-assessment We offer online resources, courses and tools to help you to develop the skills you need across a variety of areas including teaching and learning, programming and coding, communication and wellbeing. The Digital Student course is your digital skills checklist. Through the course you can explore the key digital competencies for students at the University of Nottingham and access online resources to help you develop your skills in those areas. Hosted on Moodle, we recommend you work through the course and checklist across the first year of your time at Nottingham. Join the Digital Student course Data and AI may seem a bit daunting, which is why we’ve gathered a set of high quality, free introductory courses on these topics. These courses are aimed at all students, no matter your area of study. Completing these courses will give you a better understanding of data and AI, whilst also providing you with skills to add to your CV or LinkedIn profile. Gain valuable skills to help you succeed in today’s digital economy with industry recognised certifications to develop the real-world skills that make you more employable. Organised by Nottingham University Business School (NUBS), these certifications are available to all students at the University. For the Microsoft Certifications, the University has agreed with Microsoft that students get a first exam attempt for free. Digital certifications A Nottingham Advantage Award (NAA) module for students who wish to learn the basics of coding but don't have the opportunity to learn this as part of their degree. By the end of this module you will be in a position to confidently start a coding course knowing that you will understand the underlying concepts behind coding. You will develop the knowledge and confidence to engage in workplace conversations about coding with managers, software developers and programmers. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}