{
    "url": "https://www.nottingham.ac.uk/library/support/librariesessentials.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Get started with using our library spaces, services and support. You can use any of our eight libraries. Each is home to subject-specific resources, a wide range of study spaces, IT facilities and space to take a break. Don't forget to bring your University Card for entry and to borrow books. What happens if I forget my card? NUsearch is the University's library collections discovery tool. Use NUsearch to manage your library account, search our collections, place Click and Collect and interlibrary loan requests and access thousands of e-resources including ebooks and ejournals. Looking for a print item? NUsearch will tell you the item's availability and location (classmark and library). NUsearch NUsearch help Looking for a specific book or journal? You will need the item's location and classmark. A classmark contains letters and numbers and groups titles on similar topics. Ask any member of Library staff - they will be wearing a blue lanyard. If you are unable to make it to the shelves or would like us to deliver books your preferred library - place a request on Click and Collect request on NUsearch and we'll let you know when your book is available to collect. Borrow your books using our self-service machines. Drop-in to any of our libraries to use any available non-bookable space or book space in advance online using Click and Study. We offer a range of spaces including quiet, silent, group and postgraduate spaces as well as dedicated study spaces for students who are eligible for Enhanced Library Support. If you book a space, don't forget to check-in within 30 minutes using the code in your confirmation email. Booking study space and checking in We offer a range of free webinars throughout the year to help you develop your study skills including writing, referencing, dissertations, using NUsearch and more. There are no results that match your criteria. Every library has a games zone packed with puzzles, games and crafts for you to take a break from your studies - either on your own or with friends. Study well with Libraries Health and wellbeing support Did you know your Library account gives you access to a wide range of digital resources including TV, film and theatre recordings? Everything you need to know to get started with our libraries. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}