{
    "url": "https://www.nottingham.ac.uk/library/news/2024/gardens-graveyards-and-gladiators-a-victorian-journey-through-italy.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy July 31, 2024, by Chloe Wr D 9/6 Photograph of Edward Wrench with his daughter Diana, c. April 1864 Edward Mason Wrench, who lived between 1833 and 1912, had an extremely colourful life, serving as an army doctor in the Crimean War and then in India, before settling in Baslow and working as a GP – which might sound mundane in comparison with his previous work, but was in fact a position of considerable honour. He acted as the personal physician to multiple successive Dukes of Devonshire, who, confusingly, had their seat at Chatsworth House in Derbyshire– and even attended King Edward VII on his visits there. Wrench’s travels came in the midst of his career, almost 15 years since he had put down roots in the East Midlands – so perhaps he was feeling a a bit of wanderlust after staying in the same place for so long. Grief might also have been a factor, as the trip came in the wake of the death of his father the previous year. Temp Acc 60/1/8 Glass slide featuring a photograph of an aerial view of Chatsworth House. When he set out at the start of February 1876, his destination was clear. While his route took a winding path through the French Alps, it is clear from both the speed and relative efficiency with which he raced through the country towards the Italian peninsula that his interests lay further south, where his travels became both more leisurely and more frequently subject to diversions. Indeed, even after he crossed the border, he progressed at a giddy pace, spending a couple of days at Genoa and an afternoon in Pisa, before pressing on to Rome, where he stayed for a fortnight: perhaps captivated by the remains of the city’s classical past, the southern climate – or perhaps simply exhausted by the pace of his whistle-stop tour. That is not to say that he was completely immune from the charms of the north: he relates with much enthusiasm his visit to a ‘Campo Sancto’ at Genoa and again at Pisa, devoting it more attention than the so-called ‘leaning tower.’ Despite their fanciful name, these ‘holy fields’ are, in essence, large graveyards dotted with statues commemorating the dead. Wrench’s seeming fascination with these monuments might seem a little morbid from a modern perspective, but in the heyday of gothic fiction, in a culture where the proper expression of grief was held up as a virtue, cemetery tourism might have been deemed not only a legitimate source of interest but even as morally beneficial. Wr D 21, Entry for 22 Feb. 1876 from the diary of Edward M Wrench At Pisa, he availed himself of a surprisingly poignant souvenir: a narcissus flower which had been growing in the cemetery, preserved today in the pages of his journal. This too was not an unusual practice at the time: indeed, pressing flowers was a quintessentially Victorian pastime, with single flowers often preserved within diaries or scrapbooks to commemorate special occasions or visits. Earlier in the 19th century, the Colosseum was a particular hotspot for this activity, overgrown as it then was, a lush urban wilderness of over 400 species including a striking pink asphodel which proved popular with tourists. However, in the aftermath of the unification of Italy in 1871, the Colosseum was stripped of its vegetation in a wave of nationalistic fervour, as the nascent state sought to fortify itself on the bedrock of its ancient history. It was time to tear down the tumbledown idyll: the era of the amphitheatre had come again. So, when Wrench arrived half a decade later, he would have looked out upon a view denuded of its verdant wildlife, revealing the scarred remains of the arena, hollowed out in patches as excavators plunged into the underground chambers below. Wr D 21/9a Itinerary of tour to Italy entitled ‘How to Visit Italy’, enclosed in Edward Wrench’s diary for 1876 (front) Yet it seems that the project had not been a complete success. Wrench observed in his diary that ‘the level of the ground has been raised by centuries of occupation by man in a semi civilised state, where homebuilding was a rude affair and the home was built on the ruins of that from before and where many brought things into the city few carried anything out’. In other words, rather than a pristine monument to the revival of classical splendour, he encountered the debris of millennia, piled up in an indeterminable heap. Join us next time to discover what else Wrench made of the Eternal City as he continued his sightseeing tour with an itinerary of both familiar and strange to the modern traveller: encompassing everything from making a wish at the Trevi Fountain to coming face to face with mummified monks. In the meantime, why not book a free spot at our Heritage Open Day talk all about Nottinghamshire’s early tourists? To secure your place, email us at mss-library@nottingham.ac.uk or visit our website to find out more! No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}