{
    "url": "https://www.nottingham.ac.uk/library/using/borrow/ebooks/ebooks.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy How to access our collection of over 300,000 ebooks on and off campus. Go to: Frequently asked questions Search NUsearch Help and support Wherever possible, we buy ebook versions of recommended reading and also offer access to an additional extended collection where the library only pays for those that you choose to read. With most ebooks you can: Back to the top The simplest way to access ebooks is through the University of Nottingham search interface NUsearch. For seamless access to online library resources, download the Library Access browser extension. Ebooks frequently asked questions Like physical books, library ebooks are protected by copyright law, and for many ebooks this is controlled automatically by Digital Rights Management (DRM) software. The amount you can download, copy or print varies from one publisher and title to another. This information is usually displayed when you use each book. Quick reference guide for general advice on some of the main ebook sites used Yes, for most, up to annual usage limit. Some have limits on users. Amount varies by publisher. Hover over green columns next to Copy/Print in ebook for total allowance. Some have limits of up to three users. Amount varies by publisher. Total print allowance shown on ebook home page under Availability. Print or save no more than 10% or 25 pages. Access may be suspended if excessive downloading /printing is identified Copy and Print up to 10% of each ebook. Pop-up box shows print allowance. Can print or save individual chapters as PDF. Copyright restrictions apply Individual pages. Note: If University subscription is cancelled, all copies should be destroyed No Save chapter PDFs or view online only No Digital Rights Management (DRM) restrictions. Chapter PDFs can be saved. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}