{
    "url": "https://www.nottingham.ac.uk/library/news/2024/dead-end-tunnels-under-nottingham-in-fact-and-fiction.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy June 28, 2024, by Chloe Considering the number of manmade caves which lie beneath the streets of Nottingham, it is unsurprising that, over the years, a tangled web of stories has developed which imagines a secret network of tunnels beneath the city. The details vary, with passages variously linking the city centre, the castle, and Wollaton Hall or running instead between the castle and Lenton Priory; but the central myth remains the same: legendary figures in the history of the city, be they aristocrats or bandits, traverse the town under cover of night by means of a hidden tunnel. By far the most famous of these is the tale of Mortimer’s Hole. For those in need of a refresher, Isabella of France, consort of Edward II, conspired with her alleged lover Roger Mortimer to depose her husband in 1327, placing her son on the throne in his stead. However, the teenage King went on to overthrow the treacherous pair just three years later, capturing them by means of a secret rock-cut tunnel at Nottingham Castle, which would go on to be known forevermore as Mortimer’s Hole. Many versions of the story are scattered across our collections – as are visual representations of the scene, such as this vivid illustration. ‘Mortimer’s Hole, Nottingham Castle’; undated. MS240/2/15 However, the reality is more complicated. The name ‘Mortimer’s Hole’ is today associated with a 98m long passage on the castle grounds, but it is not the only candidate for the site of the iconic incident: there are several shorter underground walkways, including one which opens out on to the castle green, which could plausibly have been used. Another tunnel to which the story is occasionally misattributed is definitely out of the running, having been constructed in 1955 to specifically for cave tours! Plan by Frank Lewis, city architect, of the rock cellars under the Castle Rock, Nottingham; 1903. NPE P 4/13/1 There were certainly many subterranean chambers beneath the castle itself, as shown on this plan of the rock cellars beneath Castle Rock, created by Frank Lewis in 1903, but there are no ‘tunnels’ to speak of – though some of the chambers are connected, with entrances either being added to create a larger space, or even accidentally broken through in the process of hollowing out a new chamber. Indeed, the first purpose-built passage beneath Castle Rock would not be constructed until later in the twentieth century, blasted out of the rock with the aid of mining machinery, to enable the space to be used as a rifle range. The same is true of many of the other so-called tunnels beneath the city: while there are ‘networks’ around which it is possible to walk for hours without coming up for air, these caves have countless entrances mere metres apart, suggesting they were initially designed as self-contained cellars. The Park is a particular hotspot for rumours of secret passages, which is perhaps not surprising considering its location, lying in the shadow of the castle in the direction of both Lenton Priory and Wollaton Hall, but similarly there is little basis for this belief. Given the dearth of actual tunnels, it might instead be suggested that the myth has instead arisen from the circumstances surrounding the construction of The Park. If anyone had both the means and cause to build a private network of underground walkways, enabling surreptitious travel away from prying eyes, surely the wealthy industrialists and businessmen who occupied the purpose-built private estate at the heart of the city would be prime candidates. Fortifying these claims was the construction of the (very real) Park Tunnel, which, rather than being a covert passage, rather acts as an ostentatious gateway into the estate from Derby Road. ‘The Park Tunnel’ from Scrapbook containing autograph letters and facsimile letters of royalty and distinguished churchmen, architects, authors, scientists and others; 1647-c.1890, p.29. MS 575/1/164 Designed by TC Hine in the mid-nineteenth century on instruction from the 6th Duke of Newcastle, from it was originally intended to act as a thoroughfare for carriages, as in this prospective drawing from Hine’s scrapbook. However, upon construction, the incline was too steep for horses to manage, so it was relegated instead to merely pedestrian traffic – a purpose which it still retains today. Hine’s scrapbook, along with a range of plans of both the Tunnel and the estate at large, are available to view in our reading room – … though maps of secret passages sadly remain only in the imagination! To find out more, or to book an appointment today, please contact us at mss-library@nottingham.ac.uk. What’s more, you can discover more of the city’s subterranean wonders in an upcoming exhibition, ‘Tales from the Caves: Exploring Nottingham’s underground stories’ which will open in the Weston Gallery at Lakeside Arts this October! No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}