{
    "url": "https://www.nottingham.ac.uk/library/news/2024/page-3-pin-ups-and-double-standards.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy July 10, 2024, by Sarah Colborne Tina Pamplin of the Nottingham Feminist Archive Group, and Sarah Colborne, Archivist at the University of Nottingham, introduce a new addition to the East Midlands Feminist Archive: the ‘For Women Only’ calendar which was produced by Lincoln Women’s Action Group. They compare it to a similar occasion in the University’s history when printers refused to print images of naked men in charity rag mag Chick. In my archiving world one of the highlights of 2023 was the donation of materials from Emma, a member of the Lincoln Women’s Action Group relating to their 1978 calendar. It started as a fundraiser for the campaigns they were supporting around issues like abortion, a women’s refuge, equalities legislation etc. They were all fed up with the calendars of (semi-) nude women on public display in garages, offices, newsagents, the Sun’s Page 3 etc., so it seemed like an opportunity to simultaneously make a campaigning point and raise money. One of the group, Jenny, was a professional photographer. She set up her spare room as a studio. They recruited boyfriends and colleagues as models. It was all fairly local and low key until the Lincoln printer refused to print it and the group went public with press releases, petitions and demonstrations. As Emma said, “We probably wouldn’t have sold many if no one had made a fuss about it because it would have been really hard to pay for advertising”. The Lincolnshire Echo ran the story, the story ‘went viral’ via paper and print and the calendar and re-print sold out. The archive shows how letters and orders came from all over the UK, Ireland, Europe and South Africa from individuals, workplaces and organisations. From a woman in the British Leyland offices at Cowley: “This will, I hope, show the men in mine and other offices how sick we are of their girly calendars”. From Winchester: “It will be going up at work, along with all The Sun Page 3 calendars I have to contend with”. From Southampton: “What is the Women’s Action Group? Could I start one here?” For me there are two truly amazing aspects to this story. The first is the brilliant subversive concept and the imaginative campaigning to expose the prevailing ‘double standards’. The other, equally amazing, is that Emma kept every bit of paper – around 56 letters from the U.K., Ireland, mainland Europe, South Africa; 25 or so press cuttings; the full photographic portfolio; the collaged posters that had adorned placards, still covered in rainproof plastic; the petitions – everything. Chick: Nottingham Students’ Charities Appeal, 1962, 1963 and 1965 University of Nottingham, UoNC, Periodicals Not 5.G14.41.F62 On searching the University of Nottingham Publications Collection for examples of sexism to use in the dear sisters exhibition (I found many!), I came across these issues of student rag mag Chick which were written by students and sold to raise money for local charities. To my eyes they are full of puerile misogynistic humour normalising the molestation of young women, and we found evidence that female students at the time agreed with this perspective. Feminists at Trent Polytechnic are recorded in the Nottingham University’s student newspaper The Gongster demanding that support be withdrawn from the fundraising campaign: “Karnival seemed to many students to be a calculated insult to women and to men who regard women as people rather than as objects for male gratification” (9 December 1975, p.5). Throughout the 1970s the magazine featured photographs of topless and naked women. When feminist students requested, in the name of equality, the inclusion of images of a naked man, the (male) engravers cropped the image. The newly appointed female editor of the The Gongster encountered the same double standards: “Yet the same fate has befallen our man. Without bothering to inform us, the engravers shortened the block and cut him off in his prime. Needless to say, we will NOT be paying the engravers bill after this despicable act of censorship.” (9 December 1975, p.2). Poster for talk by Lisa Clarke, 24 July 2024 Despite the efforts of second-wave feminists, the objectification of women continued. The No More Page 3 Campaign had been started in August of 2012 by Lucy-Anne Holmes. Nottingham nurse Lisa Clarke organised local demonstrations in 2012 in Beeston and Nottingham town centre, collecting over 600 signatures, and in 2013 Lisa was invited by Lucy to join her in running the national campaign. Lisa’s blog for Huff Post about the misogynist comments found below Page 3 pictures on The Star’s website led to The Star disabling the ability to comment below models’ pictures and the deletion of all the comments. In a blog for Nottingham Live, Lisa explained that subsequent crowd sourcing of funds enabled the financial sponsorship of two women’s football teams including Nottingham Forest Ladies, who played with “No More page 3” on their chests – promoting what women’s bodies can do and not just what can be done to them. Lisa will be reflecting on the success of the campaign in a lunchtime talk on Wednesday 24 July 2024, as part of the programme for the exhibition dear sisters: activists archives. Tickets can be booked via the Lakeside Box Office and the exhibition runs until 1st September. Emma’s archive materials are now carefully wrapped in acid free paper and stored in a temperature controlled environment with the rest of the East Midlands Feminist Archive at Nottingham University’s Manuscripts and Special Collections and can be viewed in the reading room at King’s Meadow Campus. For anyone reading this who might have stuff hidden away in cupboards, cellars, attics and sheds or stories to tell – we are still collecting archival material and doing oral history interviews – there’s loads still out there that mustn’t be ‘hidden from history’. We would also really love to document more recent feminist activism at the University, in Nottingham and across the East Midlands, so do get in touch (mss-library@nottingham.ac.uk)! No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}