{
    "url": "https://www.nottingham.ac.uk/library/about/about.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy In Libraries we’re proud to offer our students and academics inspiring spaces for study, research and the opportunity to be part of a thriving learning community. This isn’t just about our buildings, it’s also about our online offer, in an increasingly digital world. Our policies and decision making processes are informed by feedback from student and academic communities which are at the heart of everything we do. In Libraries, our aim is to be a diverse and inclusive community where every person is welcome and valued. In Spring 2021, Libraries set up its Equality, Diversity and Inclusion (EDI) programme, with the aim of improving the experience of staff and building a better working environment and culture for all Libraries staff. Libraries are at an exciting moment, the landscape in which we work is changing, and us with it. That means offering more than just a place to go to collect reading material. As curators and conveyors of information we are at the centre of the University’s information world, delivering everything students and academics need to get the most value from that information while they’re with us. Our breadth of services extends from specialist expertise for the research and academic community to a host of support services for students, including one of the country’s highest rated virtual learning environments. We are committed to delivering the best service for our students and academics, ensuring your needs are met at every stage of your university journey. Sue Ackermann, Director Find out more about our mission and vision Guidance governing the use of our libraries and our collections Our agreement with the users of our library facilities King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}