{
    "url": "https://www.nottingham.ac.uk/library/news/2024/nottingham-feminist-archive-group.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy March 6, 2024, by Sarah Colborne To mark International Women’s Day, find out how the Nottingham Feminist Archive Group have been collaborating with Manuscripts and Special Collections at the University of Nottingham in this guest blog by Group member, Jayne Muir. The upcoming exhibition dear sisters: activists’ archives at Nottingham Lakeside Arts (21st March – 1st September 2024) showcases material from the new Feminist Archive, held at Manuscripts and Special Collections (MSC). The carefully selected exhibits show how the so-called second wave of feminism, which began in the 1960s, galvanised local women into action, campaigning on pay, conditions of employment, health, domestic violence, abortion reform and more. Poster for the exhibition dear sisters: activists’ archives, from a photograph in Red Rag, no. 8, February 1975 Activists worked locally, regionally, nationally and sometimes internationally. They held meetings, wrote newsletters, organised rallies and marches, took photographs, made art, music and headlines. And in these pre-digital times there was a lot of paper. Some was thrown out, some rotted in damp cellars but a lot survived, as women like Nottingham based activist Tina Pamplin were reluctant to let go of material that was so significant to them and to the women’s movement: records of meetings; conferences papers; feminist magazines; plans for protest marches and much more. Tina used her attic as a storeroom and amassed a vast collection of material, as did Margaret Davies. When she downsized her home, Margaret had to downsize her collection, but held on to the important items. As Covid lockdowns began in 2020, she wondered what would happen to her papers should she fall victim to the virus. She left instructions for her family not to dispose of her paperwork, and listed key contacts. By this time, though, Margaret was hopeful of a secure home for her documents, as plans were afoot. Sign placed by Margaret on the cupboard containing her archive with instructions for what to do with it in the event of her death, 2020. FME/3/1/5/1 Tina and Val Wood (who had previously volunteered with Manuscripts helping to catalogue collections and research the significance of women in the University Archives), approached the University of Nottingham knowing that Manuscripts and Special Collections already held the papers of activists such as Fred Westacott and socialist and MEP, Ken Coates. Staff at Manuscripts were enthusiastic about the idea of forming a feminist archive and so an exciting collaboration began. A project team, with representatives from the University and the Women’s Centre, was established in January 2019 to obtain a National Archives Scoping Grant which confirmed the desirability of the proposal and included a survey of the historic materials held at Nottingham’s Women’s Centre. Joined by Lee Harrison, and with support from the National Lottery Heritage Fund, Tina and Val set about capturing the stories of feminists who had been active locally in the 1970s and 80s. One of the interviewees was Margaret and she joined the project, as did Barbara Hewitt. The women they spoke to welcomed the opportunity to share their stories and many handed over material from their own collections for safe keeping in the new archive. Margaret and Tina discussing the curation of the Feminist Publications Collection, 2023 Val, Tina, Barbara, Margaret and Lee volunteered to help the archivists in sorting, cataloguing and describing this material and joined by Jayne Muir attended the necessary training in February 2020. The pandemic intervened at this point but in May 2021 the first delivery of 36 boxes, three rolls of posters and two files finally arrived at the University. The volunteers began work in December 2021 and spent many hours in the Manuscripts Reading Room elbow deep in documents and artefacts. Volunteers often help with collections, but working on your own material and being able to explain the context and background from firsthand experience is quite rare and adds an important dimension to the collection. Knowing that your material is safe from damage or destruction is also of great comfort to those who have donated items. Meanwhile members of the team, with retired archivist Linda Shaw, set about helping the Women’s Centre to sort, list and preserve their collection of feminist magazines, in the process identifying duplicate copies and facilitating the donation of these spare copies to the University to add to the ever-growing Feminist Publications Collection (FPC) which complements the Feminist Archive (East Midlands). The Nottingham Feminist Archive Group stall, ready for an event in Mansfield, 2022 The exhibition highlights the pioneering work of local feminists and acts as a huge thank you to all of the women who have been interviewed or donated items and especially to Val, Tina, Margaret, Lee, Barbara, Jayne and Linda, the Nottingham Feminist Archive Group who partnered with archivist Sarah Colborne and special collections librarian Ursula Ackrill to bring this to fruition. The two new research collections, the Feminist Archive (East Midlands) and the Feminist Publications Collection, can be accessed by all in the Reading Room at the University’s King’s Meadow Campus. Dear sisters: activists’ archives runs from 21st March to 1 September at Nottingham Lakeside Arts. The first event in the exhibition programme is a talk on the 9 April by Dr Lisa McKenzie, who was recently interviewed on Women’s Hour and in the BBC 2 documentary Miner’s Strike: A Frontline Story. The exhibition programme also features an opportunity to meet members of the Nottingham Feminist Archive Group and their interviewees in a panel discussion on the 11 June – tickets will be available via Lakeside Box Office shortly. No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}