{
    "url": "https://www.nottingham.ac.uk/library/help/accessibility/sensusaccess.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy SensusAccess is an automated document conversion service which allows you to convert documents into formats that better suit your individual needs. This includes alternative document formats, eBooks, audio and provides specialist conversions, e.g. DAISY talking books and multiple braille languages. This is an automated, self-service facility available to University staff and students. Conditions of use How to convert files Convert your file Help and guidance There are no restrictions placed on the amount you can convert, provided that the copy is for the use of the print disabled individual only. Files must not be shared with any other party. SensusAccess provides automated reformatting of documents and so the files it produces may contain errors. If the files produced do not meet your needs, please contact Disability Support Services for information on other support provided by the University. SensusAccess may be used to convert files where: For further advice, please contact copyright@nottingham.ac.uk. The SensusAccess document conversion tool can be used to convert files that you have a copy of on your device and files that have been made available to you in Moodle as part of your course. Follow these steps to convert a file: You will receive the new file via email once the conversion is complete. A SensusAccess conversion icon is shown next to all documents uploaded to Moodle modules: You will receive a Moodle confirmation once the conversion is complete, and the converted document will be available for download. Complete the form below or open the form full screen. Please ensure you have read the conditions of use before using this service. You are unable to see the content in this frame. The SensusAccess e-learning course is intended for students, staff, faculty and others who are converting material into alternate formats such as audio books, e-books, digital large-print and Braille, either for themselves or on behalf of others. The course also covers how SensusAccess can be used to improve the accessibility of documents and to make documents easier to work with. For further advice on the use of SensusAccess, please contact Learning Technologies. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}