{
    "url": "https://www.nottingham.ac.uk/library/using/borrow/online.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy How to find and access online library materials wherever you are. Scans | Reading lists | NUsearch and subject guides | Ebooks, databases and journals | Browser extension NUsearch - Search our library collections If you need to access a section of a book or journal, we can provide scans of items available in our libraries, up to the following copyright limits: Please check availability on NUsearch before making your request. Request a scan of a chapter or article Check the reading list for your module for links to digital copies of course materials, where available. Find your reading list Our electronic collections contain over 300,000 ebooks and 20,000 ejournals. Search our library discovery tool, NUsearch to see if we have a digital copy of the resource you need. We recommend logging in to see the full range of resources. You can refine your search to 'Available online' to see digital resources. Visit NUsearch essentials for help with using NUsearch. Do you have questions about using NUsearch and finding resources? Drop in to our regular Ask Libraries sessions for help and support. Our subject guides provide an introduction to the essential resources for your subject including databases and specialist resources. Back to the top Wherever possible, we buy ebook versions of recommended reading. Some ebooks may have restrictions on the number of simultaneous users. If you see an error message, please try again later. How to find ebooks Browse and read ejournals quickly and easily online using the BrowZine website or app. Open BrowZine You can search for databases by title, or browse by subject area, on NUsearch. Browse databases Library Access is a browser extension that makes it much easier to access journals, databases, ebooks or other websites when working off campus. The extension will notify you when you’re on a website that the University has a subscription for. Follow the link to get simple access to all licensed material on that site without having to visit the Library website first. Library Access is available for the following browsers on laptop and desktop computers: Google Chrome, Microsoft Edge, Firefox, Safari or Opera. Get started with Library Access King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}