{
    "url": "https://www.nottingham.ac.uk/library/studying/training.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Explore our programme of webinars and training sessions designed to support you with your studies and research. In these sessions we'll explore how the library can support your time at University from using NUsearch to find resources to who to contact for more help. To attend any of these sessions, join the Libraries Welcome Sessions team on Microsoft Teams. Discover how the library and its resources can support your time at University, from the provision of scholarly information to support your coursework to reading for pleasure to support your wellbeing. We’ll show you how to use NUsearch to find information across the library’s print and digital collections and point you to sources of help so you can get started using the library. Dates and times can be found on: This session is available as an online resource. Welcome to Libraries - Undergraduate Discover all you need to know to get started using library resources. We’ll show you how to use NUsearch to find information across the library’s print and digital collections and point you to sources of help. You’ll also be invited to enrol on ‘On Course for Your Masters’ – our online course on Moodle – to help you further develop your information skills at your own pace. This session is available as an online resource Welcome to Libraries - Masters students Welcome back to Libraries! For a refresher on using the library and its resources to support your studies and research, visit our online guide. We'll re-introduce you to NUsearch and our subject guides to support your learning, as well as our leisure reading collections to support your wellbeing. Welcome back to Libraries - Returning students We’ll introduce you to key library resources, including NUsearch and your subject databases, and point you to sources of further help. You’ll also be invited to enrol on ‘Literature Searching and the Literature Review’ – our online course on Moodle – to help you further develop your literature searching skills at your own pace. Welcome to Libraries - Postgraduate researchers Back to the top Browse webinar topics below or join the Information Skills Team on Microsoft Teams to access regular information skills support sessions. This session is suitable for year one undergraduate students in all subjects. Need help getting started using library resources? In this session discover how to find academic information for your coursework. We’ll start with your online reading lists, then show you how to use NUsearch to find print and electronic books and journals. Finally, we’ll look at how to follow up references you find in other sources. You’ll also be introduced to basic literature searching skills to help you find information more easily. Join the Libraries Information Skills channel This webinar has now finished for this academic year, access the equivalent asynchronous online resource below. Getting started using library resources This session is suitable for undergraduate and Masters students in all subjects. Keen to search web more effectively? In this session discover how to use advanced search functionality on Google and Google Scholar to find relevant information; how to determine reliability of information sourced on the web by applying fact-checking and critical evaluation techniques; how to use social media effectively to keep up to date with research in your subject area. Can't make it to one of our sessions? You can access the equivalent asynchronous online resource. Navigating information on the web This session is suitable for undergraduates (year two onwards) and Masters students studying Arts subjects. Looking to further develop your literature searching skills to find information for projects and dissertations? This session will focus on more advanced literature searching skills and techniques. We’ll explore your subject databases in the Arts and Social Sciences in more detail, along with other sources of information you may not have used before to help you take a broader approach to searching for information. Literature searching: Arts Literature searching: Social Sciences This session is suitable for undergraduates (year two onwards) and Masters students studying STEM subjects. We’ll explore your subject databases in STEM in more detail, along with other sources of information you may not have used before to help you take a broader approach to searching for information. On-demand Literature searching: Engineering Literature searching: Medicine and Health Sciences Literature searching: Science This session is suitable for undergraduate and Masters students doing systematic reviews for projects or dissertations in STEM subjects. Doing a systematic review for a project or dissertation? Expand your knowledge of the literature searching process in this session, to help you structure and perform a focused, methodical and rigorous search for your systematic review. Tips on hand-searching and using grey literature will also be included to help you conduct a wide-reaching search to find your evidence. Searching for evidence for a systematic review This session is suitable for undergraduates (year two onwards) and Masters students. In this session discover how to think critically when reading and evaluating information you find through your literature searches in the your subject, particularly papers found in published journals. You’ll learn why it’s important to critically evaluate information before using it in coursework, and be introduced to a series of questions (who, where, when, why, how) to help you assess the quality and reliability of published literature. Critically evaluating information (Arts) Critically evaluating information (Social Sciences) Critically evaluating information (STEM) These sessions are suitable for undergraduates and Masters students. Want to find out more about using EndNote to keep track of references you find through your literature searches? In this session discover how to import references to EndNote from your database searches, organise and edit the references you save, and use EndNote with Word to create consistent in-text citations and bibliographies in your writing. Using EndNote Desktop Using EndNote Online This session is suitable for students on placements, and final year students who will be transitioning into employment following graduation. Discover how the information skills developed during your degree programme can be used in the workplace. This session will help you consider the importance of gathering information, interacting with information (and other people) online, and keeping up to date, in your professional life. Taking information skills into professional practice (General) Taking information skills into professional practice (Healthcare) These sessions are open to all undergraduate and postgraduate students, as well as faculty and professional services staff. Our spotlight on databases sessions will guide you through a range of key resources, including subject databases, to help you search effectively for information. We'll highlight the key features of each resource and show you how to structure a search using a variety of search techniques to help you get the best results. Join the spotlight on databases channel Can't make it to one of our sessions? You can access a range of database walkthroughs from your subject guide. Subject databases: Arts Subject databases: Engineering Subject databases: Medicine and Health Sciences Subject databases: Science Subject databases: Social Sciences These sessions are open to postgraduate research students, as well as faculty and staff. Looking to further develop your literature searching skills and knowledge of resources to find relevant information for your research? This session will focus on advanced literature searching skills and techniques, and will explore a range of databases and specialist resources in your subject area to help you search effectively for your research. Can't make it to one of our Researcher Information Skills sessions? You can access the equivalent asynchronous online resource. Researcher information skills (Arts) Researcher information skills (Engineering) Researcher information skills (Medicine and Health Sciences) Researcher information skills (Science) Researcher information skills (Social Sciences) This session will help you get started using EndNote Desktop. You’ll be guided through setting up your own EndNote Desktop library and will discover how to use EndNote’s key features to help you import, manage, organise and edit the references you find through your literature searches for your research. We’ll also explore how EndNote Desktop interacts with Word to enable you to reference consistently throughout your writing. Advance booking is required. Please register your attendance by selecting the appropriate session. Future dates will be listed on this page when added: Please be aware that these are in-person teaching sessions: Our 'Spotlight on Digital Skills' sessions will guide you through a range of key resources and digital skills. The digtial skills sessions will focus on tools including Microsoft Word, PowerPoint, Excel, and Forms. The session will involve demonstrations of the key aspects of each application, including accessibility features. Join the spotlight on digital Skills channel Can't make it to one of our sessions? You can access digital skills support on the Digital Student Moodle Module. Digital Student Explore different study strategies and refresh your study routines with our weekly webinars and online study session. Libraries help and support Enhanced Library Support Support for researchers King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}