{
    "url": "https://www.nottingham.ac.uk/library/events/librariesweek.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Join us for activities in libraries and online from Monday 7 – Friday 11 October to celebrate Libraries Week. Libraries Week is an opportunity to explore the many ways University of Nottingham Libraries are here to support you throughout your university journey, from resources and spaces to skills and technology. We'll be hosting events in libraries across our campuses and online: We'll be hiding golden ticket across Business Library and Djanogly LRC. If you find a ticket, take it to the help desk to collect your prize - a UoN Libraries study pack! Follow us on Instagram @UoNLibraries for hints and tips. Business Library Djanogly LRC Have you visited libraries yet? Whether you’re a new student or just need a refresher – pop in for a tour to find out how to make the most of your libraries. You can book online in advance We'll be hiding golden ticket across Hallward Library, George Green Library, Greenfield Medical Library and Denis Arnold Music Library. If you find a ticket, take it to the help desk to collect your prize - a UoN Libraries study pack! Hallward Library George Green Library Greenfield Medical Library Denis Arnold Music Library We'll be hiding golden tickets in James Cameron-Gifford Library. If you find a ticket, take it to the help desk to collect your prize - a UoN Libraries study pack! James Cameron-Gifford Library, Sutton Bonington Campus Take part in our Library Quiz and you could be up with the chance to win an Amazon gift voucher! Spin the Wheel, answer questions and win prizes! Plus explore our diverse leisure reading collections and find out how you can get involved. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}