{
    "url": "https://www.nottingham.ac.uk/library/research/safepod.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Accredited researchers can now access secure datasets from participating data centres across the UK through the SafePod Network The University’s SafePod, based in Hallward Library on University Park, is part of the wider SafePod Network (SPN) funded by the Economic and Social Research Council (ESRC), which is part of UK Research and Innovation. SafePods are designed to provide accredited researchers with access to secure datasets from participating Data Centres across the UK. Access to secure datasets usually involves regular long-distance travel, however, the ESRC aims to open up opportunities for research by providing local access within a safe setting. A SafePod has many features including a door control access system, CCTV, a researcher area for the analysis of datasets, a secure service area, wheelchair accessibility and height-adjustable desk. The SafePod at Nottingham is one of the first to be installed nationally and opened for bookings in August 2021. By late 2023, a total of 23 SafePods are expected to be part of the SafePod Network. Datasets are available from the following data centres: Researchers can browse the ADR UK Data Catalogue, a tool for exploring the growing collection of administrative datasets available from ADR UK partners. Users can filter the metadata in the catalogue by ADR organisation, theme, or spatial coverage. For more information about the SafePod at the University of Nottingham, please email library-researchsupport@nottingham.ac.uk. We advise that if you are starting a project and using the UoN SafePod for the first time, you get in touch to discuss your planned timeframe with us. For general enquiries about the SafePod Network contact 01334 463901 or email safepodnetwork@st-andrews.ac.uk. SafePod is a registered trademark of the University of St Andrews. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}