{
    "url": "https://www.nottingham.ac.uk/library/collections/index.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Explore our extensive print and online collections including Manuscripts and Special Collections. Go to: More search tools | Trials and updates | More Books | Help and support NUsearch is your one-stop shop for searching our collections, accessing online resources, placing requests and managing your library account. Help with using NUsearch NUsearch - Search our library collections Whatever you're searching for, we have the tools to help you find the resources you need. Access the recommended reading for your module Our guide to the key resources for your subject area Search published research from the University Search our manuscript and archive collections Download the Library Access browser extension Back to the top We do not exclude materials because of the ideas or opinions expressed within the content. We recognise our libraries hold material containing language or attitudes which may cause harm by contributing to wider societal prejudices. The presence of any particular material within our collections does not imply our endorsement of the ideas or opinions expressed within. We welcome an open dialogue with our community. If you have concerns about any language used within our discovery tool, NUsearch, or within any particular item in our collections, please make a note of the item’s Barcode and contact us. The latest updates about our collections including trials and new resources. See all news from Libraries Looking for a title that isn't available in our collections? Our More Books service is here to help. We're here to support you with searching and accessing our collections. Email library-helpline@nottingham.ac.uk Videos and guides on getting the most from NUsearch. NUsearch help Help with all aspects of the reseatch lifecycle. Research support How to use materials for study, research and teaching. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}