{
    "url": "https://www.nottingham.ac.uk/library/events/wellbeing.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Looking for health and wellbeing support or something fun or relaxing to do on a break? We're here to help. Events and activities Everyone experiences a 'wobble' at university but we're here to support you and help you find a sense of belonging. Wobble Week takes place from Monday 28 October - Friday 8 November with plenty of events to get involved in across the university. Join us in libraries for a week of activities and events during Wobble Week to help support, inspire, and entertain you, including: Take a break from your studies and join your fellow students and our library team for a relaxed chat with tea, coffee and biscuits! We’ll be placing bookmark making kits in all our libraries for some fun crafting time in your breaks. Find them in our Library Games Zones or at the libraries front desk. We’re encouraging you to design bookmarks for your peers with motivational messages. Leave your bookmark for another student to take away and add some positivity to their day, and take a bookmark that another student has made that brings you some joy! Ever wanted to get hands on experience with ancient artefacts? Our very own University Museum will be visiting our libraries with a selection of historical artefacts for you to handle. Hallward Library, University Park Thursday 7 November, 12:30 - 1:30pm Healthy U notice boards are available in all of our libraries with information about useful services and resources to support your health and wellbeing. We have also collaborated with Healthy U, University of Nottingham Health Service and the Counselling Service on a list of useful health and wellbeing resources and books. Reading Well @ UoN Libraries Health and wellbeing support at UoN Did you know your University account gives you access to a wide range of leisure reading titles as well as TV, film and theatre recordings? Whether you like to read classics, non-fiction, graphic novels, essay collections, contemporary fiction, you'll find your next great read in in our leisure reading collection. You can also borrow from a wide range of fiction titles in Hallward Library. Explore the collection Stream theatre productions online, iincluding popular National Theatre plays such as Frankenstein. Digital Theatre+ Drama Online - NT Live and Shakespeare's Globe Watch TV and film with Box of Broadcasts and Kanopy. Box of Broadcasts Kanopy King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}