{
    "url": "https://www.nottingham.ac.uk/library/help/accessibility/assistive-technology/assistivetechnology.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy We offer a range of support to ensure that our facilities and services are accessible to disabled students and those with a Specific Learning Difficulty for example dyslexia, dyspraxia or ADHD. We provide help and advice on how to use our services and work closely with Disability Support Services where specific adjustments are needed. Please ask any member of staff about how to access these services. We offer some facilities for the use of all students without requiring a Disability Support plan. Find out how to access and use: Share your thoughts on our Assistive Technology Rooms and Enhanced Support Rooms with our feedback form. As a student at the University of Nottingham you have access to a range of assistive software to help you with your studies. The following software packages are available on all networked PCs. There are a number of accessibility features freely available in programs such as Microsoft Word, and across platforms such as smartphones and browsers. For example, did you know that you can: Visit our Student accessibility page to find out how to make the most of the accessibility features in programs, browsers and devices. Back to the top Various assistive hardware is available throughout our libraries. Click on the link to find out more and their location. Some of our libraries have height-adjustable desks available in open access areas (as well as in dedicated rooms). To see a list of spaces available for booking, tick the 'Height-adjustable' box when searching on Click and Study. Some of our libraries offer calm spaces - these are quiet study spaces in less distracting areas of the library. To book a space, select 'Calm Space' when booking on Click and Study. Students who are eligible for our Enhanced Library Support service can book and use the Assistive Technology rooms located in libraries. There are six ATRs across five libraries and each has a mix of facilities. Visit our ATR webpage to find out more. Assistive Technology Rooms should be booked online via Click and Study. This service produces accessible resource materials for disabled students who cannot access standard text. Students needing AFS support must be referred by Disability Support Services. Alternative formats service Enhanced Library Support Disability Support Services King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}