{
    "url": "https://www.nottingham.ac.uk/library/news/2024/feminism-and-sexism-in-the-archives.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy May 13, 2024, by Sarah Colborne This is a guest post by Samantha Brinded, who volunteered with Manuscripts and Special Collections between May 2023 and March 2024. For decades, student magazines have played an integral role in university culture, and the University of Nottingham is no exception. In 1939, students established a newspaper called Gongster following on from the campus arts magazine, The Gong, which had been in circulation since 1885. Gongster persisted until 1978 when it was rebranded as Bias. In 1984, it adopted the name by which it is recognized today, Impact. I was tasked with examining a decade’s worth of Gongster issues, specifically focusing on instances of feminism and sexism within the University. With the 1970s seeing the continuation of second-wave feminism, the emergence of Women’s Liberation groups continued to advocate for social equality and autonomy over their own bodies. An examination of these newspapers reveals Nottingham and its students’ active engagement in this movement and sheds light on the issues they grappled with and opposed. Gongster, 24 June 1971, p.01. University of Nottingham Collection os.X.Periodicals Not 5.G14.8 .F48 In 1971 an issue was printed that included an image that featured key moments from the previous year, titled ‘The fag end of the year’. Amongst men holding up signs such as ‘boner’ and ‘knickers’, is a cartoon of a woman holding a bra with a sign that says “Womans liberation up with skirts”. Gongster also reported on a debate in 1972 which discussed “silly things on the well-worn subject of women’s lib.” with a vote being held to decide whether women should be branded as “second-class citizens”, ultimately the “against” motion won, though only by 1.1. This reception to Women’s Liberation continues to be seen in 1975 when its chosen ‘Quote of the Week’ states “Women’s Lib is all very well, but it would be far more efficient if it were run by men.” Gongster, 11 March 1971, p.01 Looking back again to 1971, Mary Richardson was elected the University’s second-ever female President. Some reactions to this include one student writing, “Mary R – You can carry me over the threshold any time you like!”, while one article tries to make a correlation between her political leanings, “Women’s Lib, that fanatical body of political Thespians” and her being described as a “bitch”. Richardson herself would often take to writing for the Gongster. On the topic of married women’s grants, she notes the disparity in funding “the maximum grant a married woman may receive…regardless of her husband’s income, is £275, and has been since 1951”; she further points out “the social consequences are obvious, the married woman cannot win, no money and no incentive to study anything”. Throughout the decade discussions can be followed that reflect concerns such as sexual health and abortions. As an obvious reaction to the well-protested James White Bill, a Union general meeting was called to discuss disaffiliating from the National Abortion Campaign and what that would mean for women. They declared “This general meeting provides the opportunity for ALL Union members to reaffirm this Union’s belief in the freedom of choice. A WOMAN’S RIGHT TO CHOOSE”. In 1973 feminist students joined a “procession of mourning” held in the city centre by the Nottingham Women’s Liberation Group, memorializing the women who had died during abortions. Gongster, 11 December 1973, p.01 From the 21st of March 2024, until the 1st of September 2024, dear sisters: activists’ archives, a free exhibition, will be held at the Weston Gallery, located within Lakeside Arts. The exhibition is a culmination of years of work and highlights the University’s new Feminist Archive for the East Midlands. It is also a way to acknowledge, thank, and celebrate the work done by those who came before, paving the way for those who came after. More information on the exhibition and the programme of related events can be found here: dear sisters exhibition. Further information on Gongster can be found here. A series of blogs give more information about the Feminist Archive. Gongster and the Feminist Archive (East Midlands) can be accessed in the Manuscripts and Special Collections Reading Room at the University’s King’s Meadow Campus: https://www.nottingham.ac.uk/manuscriptsandspecialcollections/readingroom/introduction.aspx No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}