{
    "url": "https://www.nottingham.ac.uk/library/help/copyright/compliant/checklist.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy There are a number of ways that you can use content without infringing copyright. This checklist introduces the main ways to stay compliant and helps you decide what you can lawfully do. When using this checklist you need to consider: When copying a work in any of the ways below you should always attribute/acknowledge the source. If you are in any doubt, do not copy! You can seek further advice from copyright@nottingham.ac.uk. Copyright works are only protected for a set period of time and if copyright protection has expired then you can copy a work. Older published works may no longer be protected, but care must be taken to check copyright durations carefully. New editions of older works may still be protected as a typographical arrangement for 25 years (i.e. a separate copyright arises in relation to the typeface and layout of the edition). Unpublished materials, in particular, are more likely to remain protected by copyright. The Unpublished materials page provides more advice. An open licence may apply where a copyright owner allows you to copy or reuse their work either freely, or to a certain extent without asking permission. Check the copyright statement for terms and conditions of use associated with a work. Examples of open licences include: Creative Commons licences, and the Open Government licence. There are also websites where you can search for open licensed materials. See Open Licences for more details. The university subscribes to blanket licences from the Copyright Licensing Agency (CLA), Educational Recording Agency (ERA) and Newspaper Licencing Agency (NLA). Provided certain criteria are met, they allow staff to copy books, journals, newspapers and television/radio broadcasts for teaching. See University Licences for more details. UK copyright legislation defines a number of exceptions, in the form of permitted acts. These allow you limited use of copyright works for specific purposes without the permission of the copyright owner. Most have conditions and are subject to a 'fair dealing' assessment for the amount you can copy. See Exceptions to UK Copyright for more details. Online resources that the university subscribes to are subject to licence agreements with publishers and are provided for personal educational purposes. You can normally download, email or print ONE copy of a certain amount for your own use. You should not share, or provide copies to others e.g. photocopying, emailing, or posting them online. For teaching purposes downloaded copies should not be made available on Moodle unless you know this is specially allowed in the licence. It is always best to provide a link to the resource itself. See Library Online Resources for more details. If none of the above cover your intended use then you will need to seek permission from the copyright owner. If permission is granted there may be terms of use, including a fee. You should always keep evidence in writing of any permission granted. See Seeking Copyright Permission for more details More advice: Copyright home Self-directed training resources King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}