{
    "url": "https://www.nottingham.ac.uk/library/you-said-we-did.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Your feedback helps us to improve our support for the university community At University of Nottingham Libraries, we are committed to providing the best experience for students, staff and visitors. We regularly make changes based on feedback received through surveys, emails, social media, whiteboards in libraries, conversations with staff and more. However you share your feedback, it helps us to make continual improvements to our services, spaces, support and resources. Do you have feedback? Look out for the boards in libraries, visit the Have Your Say webpage or email library-helpline@nottingham.ac.uk. We upgraded Click and Study to make it even easier to find study spaces before you visit libraries. We've added images for each space and more descriptive information so you can make an informed decision before you arrive. We adjusted the 24/7 opening pattern for 2024 at James Cameron-Gifford Library to better align with exam periods throughout the year and ensure you have access to spaces during the revision period. In February 2024, we changed the timer to be 30 minutes instead of 15 giving you more time to carry out important tasks. Short stay PCs are available at Business, Djanogly LRC, George Green and Hallward libraries. We have installed student kitchens in a number of our libraries: We have made headphones available to borrow for up to three hours from: Please ask a member of Library staff at the help desk. We have developed interactive online maps for James Cameron-Gifford, Hallward and Greenfield Medical libraries. An interactive map for George Green Library was already available. When browsing NUsearch for a book located in these libraries simply click on 'Find it' and the map will show you exactly where to find the book. We have increased the hours and availability of our Live Chat service. Live Chat is managed by our friendly and helpful Library staff and is available on all pages of the Libraries website and NUsearch. The Live Chat service is now available 10am - 8pm Monday - Friday and 10am - 4pm Saturday and Sunday. In December 2021, we introduced a new policy and process which allows students and staff to use the MyNottingham app for access to the library if you forget your card. You will still need your University Card to borrow books and use the printers. Following student feedback and a review of library usage, we re-introduced 24-hour opening in three libraries for the 2022/23 academic year. This has continued for the 2023/24 academic year. Students can now check availability of, and book, assistive technology and enhanced support rooms online via Click and Study. We now have even more of these spaces available across our libraries. We added Enhanced Support Rooms at James Cameron-Gifford and Greenfield Medical Library as well as refurbing the Assistive Technology Room at Hallward Library. We're continuously updating our Library Games Zones, and in January 2023 we purchased chess sets to add to the popular games supplies in five libraries. Whilst we try to respond to as much feedback as possible, sometimes we're unable to make the suggested changes - whether that's due to time, cost, systems or something else entirely. If there is a problem with the heating system we now have procedures in place to provide temporary heaters. These can sometimes take a few days to arrive but we’ll keep you updated if that’s the case. Meanwhile the Estates team are actively working on a longer term solution for buildings where heating is a particular issue. A Wi-Fi remediation project is underway and both George Green and DLRC have been identified as high priority buildings where the intention is to replace existing Wireless Access Points in order to improve Wi-Fi coverage and resilience. We’ll keep you updated as work progresses. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}