{
    "url": "https://www.nottingham.ac.uk/library/news/2024/victorian-valentines.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy February 14, 2024, by Chloe Traditionally, Valentine’s Day had been associated with poetry – particularly with verse which addressed the object of the writer’s affection. However, as a result of developments in printing, as well as increasing industrialisation in the UK, by the early 19th century paper Valentine’s cards featuring sentimental (or sometimes humorous) designs and rhymes were being mass produced in factories across the country. The valentine received a further boost in 1840 with the introduction of the national Penny Post, which made the sending of cards more widely accessible. Valentine’s card with lace effect edges, addressed to C. Brinsley Marlay, at St Katherine’s Lodge, Regents Park, London, 15 February 1875, My 4275/2 One particularly popular style was the ‘paper lace’ technique, whereby the raised sections of embossed paper are filed away, leaving a pattern comprised of tiny holes. Following its invention in the 1830s, this style of card became wildly popular – but it may not have been successful in this instance, as the recipient of the valentine pictured above, Charles Brinsley Marlay (1829-1912), remained a bachelor until his death. Poem for Valentine’s Day, 14 February 1889, Ga 2 D 3019 The penning of poetic valentines is documented from dawn of the 15th century onwards, and it appears that – despite stiff competition from printed verse – the tradition was still going strong at the close of the 19th century, on the basis of this work, which appears to be unique. Evidence that the poem was written for its subject, Henrietta Eliza, 6th Countess Galway, includes the writer’s unusually specific request that she comes to Venice and (most importantly) the lack of other known surviving copies. Valentine’s card [anonymous], sent to James Thomas Townley Tisdall at 26 Charles Street, Berkeley Square, 14 February 1844, My 1628 Image of wife hitting husband, with comic poem for Valentine’s Day, c.1870s, Ln2268 For those who are tempted to look back on the past with rose-tinted glasses, it is worth mentioning that the Victorian Valentine also had a darker side. The introduction of the Penny Post, which as mentioned above, led to the surge in the popularity of Valentine’s Day cards, also allowed the sending of anonymous letters for the first time, leading to a far more toxic trend: the so-called ‘Vinegar Valentine’. These comic (or often downright cruel) cards were sent either to an unwanted admirer, or simply to someone the writer didn’t like – and were designed to insult the recipient. So, if, like me, you’re planning to spend the evening eating chocolate and watching ‘Titanic’ alone, be content: there are, as it turns out, far worse things in life than not receiving a Valentine. Fancy finding out more about Victorian Valentines? Check out the display currently on show in our Reading Room – or make a booking to see the originals! To find out more, or to book an appointment today, please contact us at mss-library@nottingham.ac.uk. No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}