{
    "url": "https://www.nottingham.ac.uk/library/using/membership/membership.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy How to sign up for membership of University of Nottingham Libraries. All students and members of staff automatically become members of our libraries when they receive their University Card. We also welcome: Borrowing books Libraries and opening times Services for visitors Help and support All NUH staff who require access to Greenfield Medical Library must request approval from the team at City Hospital. Please email library@nuh.nhs.uk for more information. Once approved and registered, you will be able to: SCONUL Access is a scheme which allows many university library users to borrow or use books and journals at other participating libraries. The scheme covers most of the university libraries in the UK and Ireland. To find out more, please visit the SCONUL Access website. This site contains important information whether you are a new or existing user. Please allow up to four weeks for your application to be processed. This is due to the high volume of applications expected. SCONUL recommend that existing users double check whether their library access is still valid and whether the institution you want to visit is participating. External membership allows you to reserve and borrow books. For full details of our corporate membership scheme, please contact the Library Helpline. Register for external membership online Alternatively, visit any library lending desk where our members of staff will be happy to help you to register. Please bring proof of your identity and address plus the fee when you come to collect your card. Alumni also need to bring their University Association Card or confirmation email from the Alimni Office. Our libraries are cashless. We only accept debit and credit card payments. King's Meadow Campus Lenton Lane Nottingham, NG7 2NR Please see our Help and support page for telephone and email contact points"
        }
    ],
    "pdf_files": []
}