{
    "url": "https://www.nottingham.ac.uk/library/news/2024/audrey-beecham-warden-historian-poet-anarchist-feminist-and-champion-of-the-underdog.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy March 1, 2024, by Amy Bowler Audrey Beecham and her dachshunds, from 1953 Florence Nightingale Hall year group photograph, UMP/4/4/2/7 Before coming to Nottingham, she divided her time between Oxford and London, researching Agricultural History and socialising with the bohemian literary set. She lived briefly in Paris as one of the group surrounding the writers Henry Miller, Anais Nin and Lawrence Durrell. Having established a reputation as a poet in her own right, she went on to publish two volumes of poetry: The Coast of Barbary (1957) and Different Weather (1979). Poem by Audrey Beecham, ‘The Devil at Nottingham’, written about the contemporary hall wardens. Found amongst her papers relating to Willoughby Hall. From AB/90/1 Beecham deeply sympathised with the vulnerable and those she saw as political victims. Whilst an undergraduate at Somerville College, Oxford, she volunteered as an ambulance driver during the Spanish Civil War (1936-1939). Unfortunately the Quakers, the pacifist organisation who ran the ambulance service, didn’t approve of Beecham carrying a rifle, so she left to join the Anarchist cause and spent the rest of her time in Spain smuggling guns to the rebels fighting against Franco’s Fascists. She also became involved with Amnesty and assisted Czech refugees during the Second World War. As Warden of Nightingale Hall, Beecham had a reputation for being strict but very protective of her female students. She always took a keen interest in their welfare and was particularly successful in helping those with difficulties, often in an unconventional way. Students suffering from pre-examination nerves were apt to find themselves going jogging with the warden. She was something of an eccentric character, and is often remembered by former students for her outlandish dress, heavy smoking, handiness with a gun, and her dachshund dogs, which had free run of her apartment at Nightingale Hall. During one Rag Week, a group of male students twice invaded the women’s dormitories at night, pretending to be the Yorkshire Ripper. On the second occasion Beecham confronted them in her dressing gown, firing a pistol in the air and shouting “Next time I’m shooting straight”. Needless to say, it didn’t happen a third time! Beecham had a broad range of interests including sports (mainly cricket, squash and tennis, shooting, fencing, judo, and horse riding), the arts, and spirituality Although she was a practising Anglican, she had a keen interest in astrology, folklore and witchcraft. Audrey Beecham’s shooting certificates and paraphernalia, from AB/6/9/4 An ardent feminist, during her career at Nottingham, Beecham used her influence to campaign for equal pay and benefits for men and women. She was an active member of the university’s Women’s Staff Society and Women’s Social Club, and sometime treasurer of the Nottingham Women’s Liberation Group. Of particular interest amongst her papers is a minute book of the Women’s Staff Society starting with the society’s inaugural meeting on 23 November 1920 and containing the minutes of every society meeting until 1968. It is presumed that Beecham acquired the volume when she was elected Chairman (President) of the society for session 1963/64. Minutes of the inaugural meeting of the Women’s Staff Society, 23 Nov. 1920, AB/92/1 By the late-1960s Beecham’s control of her students and events at Nightingale Hall was seen as outdated and authoritarian, including the hall regulations requiring chaperones for residents receiving male visitors after 6.30pm! In 1968, in a climate of student protests, Beecham and other long standing hall wardens were criticised by the students’ magazine, and made the subject of a petition to Senate asking for reforms in the halls of residence. Her papers at Manuscripts and Special Collections span her 30-year career as warden and lecturer at the University of Nottingham, mainly covering the administration of Nightingale Hall, including accounts, staffing, student residents and resident tutors, arrangements for entertainments such as hall parties and reunions, as well as papers of the various hall committees and meetings. Meeting of the Nightingale Hall Domestic Committee, 12 Oct. 1952. The points raised mainly relate to requests for larger portions and second helpings at mealtimes!, AB/23/1 Amongst the copious quantity of correspondence are letters from the University of Nottingham’s Vice-Chancellor, Registrar, academics and former students. Beecham’s active involvement in wider university life and societies is also represented, as well as her membership of other Nottingham based groups including the Midland Group of Artists, Nottingham Playhouse Club and St Peters with St James parochial church council. Unfortunately, the collection at Nottingham contains very little relating to Beecham’s personal life or literary pursuits. The collection is searchable via the Manuscripts and Special Collections online catalogue: https://mss-cat.nottingham.ac.uk/CalmView/Record.aspx?src=CalmView.Catalog&id=AB To find out more, or to book an appointment to view items from the collection, please contact us at mss-library@nottingham.ac.uk. No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}