{
    "url": "https://www.nottingham.ac.uk/life-sciences/people/staff/equality-and-diversity/about.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy The School’s Equality and Diversity Committee is responsible for developing and implementing guidelines and policies for our School to ensure our staff is treated purely on the basis of their merits, abilities and potential regardless of their gender, ethnic/national origin, age, socio-economic background, disability, religious beliefs, sex, sexual orientation or family circumstances. This committee also ensures that University policies in this area are implemented within the School.The committee has representation from all areas of the School including admin, technical and academic as well as from Athena SWAN, staff development and human resources. See the commitee make up and details. If your looking for guidance and support for any matters around Equality Diversity and Inclusion please see our resources section or feel free to contact the committee Wednesday 7th December, 6.15pm, Highfield House, University Park The first in the events for ‘Disability December’ A conversation about the lived experience of anxiety. More events can be found on the People and Culture Blog The University of Nottingham will be hosting a range of events to enhance disability awareness in December 2016. As ‘Disability December’ is a new part of the People and Culture Events Calendar there will announcements on the People and Culture Blog Will take place in February 2017. This will include promotion through the website, social media channels, poster design and will also be promoted through our external partners. If Schools and Departments would like their events and activities for LGBT History Month to be included in this publicity, all final content will need to be sent to External Relations by Friday 9th December. The Daphne Jackson Trust are now advertising for a Daphne Jackson Trust Fellowship that will be hosted by the University of Nottingham. The Trust is dedicated to returning scientists, engineers, technologists and mathematicians to their careers following a break taken for family, caring or health reasons. The Fellowships are part-time over two years and consist of a challenging research project and at least 100 hours retraining per year, and are aimed at individuals returning to research in any STEM subject. For more details see the job advertisement. The EDI committee meeting met on 24th Nov, minutes and details to be published shortly."
        }
    ],
    "pdf_files": []
}