{
    "url": "https://www.nottingham.ac.uk/life-sciences/alumni.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Our school encourages students who have graduated from our school and the previous Schools of Biology, Biomedical Sciences, and Molecular Medical Sciences to keep in contact and become actively involved in the on-going development of an alumni community with the School of Life Sciences. The School has a Facebook Group which you can join and where you can catch up with old friends. We post selected news there. We also have an active LinkedIn group which helps our graduates connect with friends, colleagues, and business contacts. This is a group for alumni of the University of Nottingham that graduated with any kind of degree in the Biological Sciences area. Please provide year of graduation and degree to help with confirmation. Would you be able to come back to the School as a 'visiting' speaker? We would love to include recent graduates from the school who would be willing to talk about their career to the current cohort of students in the school. Please call or email Angus Davison. We are always looking for student profiles that share information about your course and time at Nottingham or your career progression since graduating. Please contact us if you would be willing to be featured in a student profile on our School website and in marketing materials for the school. You can use the alumni webpages to set up a regional network or organise an alumni event. Please help us to identify work placement opportunities/internships for current students and new graduates and contact us if you are able to offer a work placement or internship. Would you be able to mentor a current student or recent graduate. Please contact us if you are able to offer mentoring opportunities. We hope that the alumni webpages will help alumni and the School develop friend and supporter networks, business links and knowledge transfer opportunities. Please encourage your friends and class mates to get involved and keep us up to date with any changes of address/contact details via the alumni webpages. School of Life Sciences University Park Nottingham NG7 2RD t:0115 9513202 f:0115 9513269 Email"
        }
    ],
    "pdf_files": []
}