{
    "url": "https://www.nottingham.ac.uk/life-sciences/news/2022/nottingham-scientists-receive-funding-to-tackle-complex-biological-problems.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy Experts from the University of Nottingham are part of a group of world-class scientists who have received a total of over £19million in funding from the Biotechnology and Biological Sciences Research Council (BBSRC), to support adventurous research aimed at tackling significant fundamental questions in bioscience. Each of these teams - involving 39 investigators from 16 research organisations - will look to advance the frontiers of bioscience knowledge by exploring bold and exciting questions at the forefront of contemporary bioscience. By pursuing world-class ideas and multidisciplinary research, these projects will convene the people, places, and transformative technologies necessary to tackle complex biological problems from a multitude of perspectives. The funding through BBSRC’s strategic Longer and Larger (sLoLa) grants programme aims to catalyse ground-breaking collaborations that to advance our understanding of fundamental rules of life, with potentially far reaching implications for agriculture, health, biotechnology, and the green economy. The team at Nottingham, led by Dr Boyan Bonev from the School of Life Sciences, will work with a group of experts, led by Professor Gavin Thomas at the University of York and in partnership with the Universities of Cambridge and Newcastle. The team seeks to understand how bacteria rescue and repair their cell membranes during acute stress to understand better antimicrobial resistance and to aid industrial biotechnology. Membranes of cells are the interfaces of life. An almost universal response to membrane stress and damage in bacteria uses a primary effector, VIPP, proteins that evolution has selected to rescue and protect membrane function. These ubiquitous ancient proteins were present in the last universal common ancestor (LUCA), as well as in mitochondrial and thylakoid membranes. This BBSRC sLoLa project aims to solve the questions of how these proteins function to protect and repair biological membranes from different stresses. As CI at Nottingham with leadership role in membrane biophysics, together with the talented young investigator, Dr Vivien Yeh, we will use advanced solid state NMR and high performance computing to understand at molecular level the protein-membrane interactions during induced membrane stress and recovery. Dr Boyan Bonev from the School of Life Sciences Dr Yeh, an early career investigator, shared: “This is an amazing opportunity to advance our understanding of how microorganisms repair membrane damage for survival, and an exciting challenge that would allow me to grow and develop as an Early Career Researcher.” Professor Melanie Welham, Executive Chair of BBSRC, said: “Long-term support for discovery science is key to delivering the fundamental breakthroughs that keep the UK at the leading edge of bioscience research. “These five very different projects will each pursue adventurous avenues of investigation at the frontiers of biology by convening the multidisciplinary teams of people, skills and national facilities over the longer timeframes necessary to realise transformational change. “The projects have huge potential to make underpinning discoveries in the life sciences, which could produce future advances to address global challenges – from tackling plastic pollution to treating cancer – and discoveries with commercialisation potential for biopharma, biotechnology and other industries.” More information is available from Dr Boyan Bonev from the School of Life Sciences at Boyan.bonev@nottingham.ac.uk Charlotte Anscombe - Media Relations Manager - Faculty of Medicine and Health Sciences Email: charlotte.anscombe@nottingham.ac.uk Phone: 0115 748 4417 Follow us on Twitter: @UoNLifeSci"
        }
    ],
    "pdf_files": []
}