{
    "url": "https://www.nottingham.ac.uk/life-sciences/news/2023/athena-swan-life-sciences.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy The university’s School of Life Sciences has been awarded a prestigious Gold award in the latest round of Athena SWAN submissions. A Gold award recognises a significant and sustained record of activity and achievement by the School in addressing challenges across the full range of its activities and promoting gender equality within and beyond. The 5 year Gold award to Life Sciences is in addition to our Schools of Health Sciences, Veterinary Medicine and Science, Computer Science and Economics and Education receiving either Silver renewal, new Bronze accreditation or Bronze renewal awards as part of 2022’s and 2023’s submissions. The Equality Challenge Unit’s Athena SWAN Charter was established in 2005 to encourage and recognise commitment to advancing the careers of women in science, technology, engineering, maths and medicine (STEMM) in higher education and research. In May 2015, the charter was expanded to recognise work undertaken in arts, humanities, social sciences, business and law (AHSSBL), and in professional and support roles, and for trans staff and students. The charter now recognises work undertaken to address gender equality more broadly, and not just barriers to progression that affect women. Professor Katherine Linehan, Pro-Vice-Chancellor for EDI and People said: “It’s a fantastic achievement and I’m proud of all our Schools that have been awarded in this submission window. “Life Sciences achieving the Gold award and so many of our Schools also retaining their Sliver or Bronze awards serves to cement the university’s unending commitment to tackling inequality. “These awards are testament to the hard work and focus of the Schools and they will go a long way to championing and promoting good practice within the wider community.” Find more information about the Athena Swan Charter here."
        }
    ],
    "pdf_files": []
}