{
    "url": "https://www.nottingham.ac.uk/lipp/research-projects/summer-research-placements.aspx",
    "content": [
        {
            "p": "In July 2024, two interns were appointed to work with the Knowledge Transfer Partnership team as part of the Faculty of Arts' Summer Research Placement Programme. During this four-week paid placement, Melissa Campbell-Oulton and Katia Thordsen worked alongside our Knowledge Transfer Partnership with law firm, Browne Jacobson LLP, to research inclusive language in workplaces. The programme is designed to provide students interested in a career in research with an opportunity to develop skills in graduate-level research work. The placements also offered our interns the opportunity to investigate why inclusive language matters in a professional workplace and to understand more about what it is like to work within a law firm. The interns participated in meetings based at Browne Jacobson's office on the University's Castle Meadow campus. The placements involved conducting wide-ranging and multidisciplinary mini-projects investigating: The mini-projects have resulted in blogs, literature summaries and posters. Findings will be used to disseminate information and to support publications related to the Knowledge Transfer Project. My name is Melissa Campbell-Oulton, a third year studying Philosophy and Psychology. These subjects seat how and why society functions as a basis for understanding laws and obedience, providing an alternative but holistic route into the legal sector. I wanted this internship specifically for two reasons. 1) To get the necessary experience for a career in law and 2) To ensure this is a field I genuinely want to pursue. Having spoken to people with different specialisations and at different seniorities, I’ve seen the many ways that you can enter the field, with no one size fits all approach. This opportunity has reaffirmed that the legal sector is something I want to go into in the long term, with the next step being a law conversion. Beyond the contacts and the insight, I’ve developed my own professional skills, from analysing and filtering research, to relaying this information in a professional environment. Ultimately, this internship has given an insight into the world I’m working towards. Gender bias permeates the workplace, from recruitment to retention, promotions and derailment. These biases lie in expectations and attitudes, questioning the genuine utility of performance ratings. Metrics like 360 reviews (anonymous evaluations provided by colleagues) theoretically hold more insight than traditional evaluation methods. However, when female performances are evaluated on different measures, efforts towards closing the gender pay gap may be redundant. Harvard Business Review (Katia Roy, 2021) found only 15% of female managers and 24% of male managers had confidence in the objectivity of performance evaluations, with most regarding it as highly subjective and biased, feeding into inequity loops. Similar dissatisfaction was found surrounding evaluations of neurodivergent people, including inadequate support and peer understanding. I will examine bias within evaluation tools, specifically through a gender and autism lens. A meta-analysis by Shawn Khan (2023) collated data from 360 performance evaluations, filtering for common phrases and remarks. In 86% of the studies, women were more likely to be called ‘delightful’ or a ‘team asset’, where men were called ‘exceptional’ or ‘natural leaders’. These peer ratings are problematic even on the surface, as it reinforces harmful gendered stereotypes about behavioural norms and capabilities. However, it has more dangerous consequences. Yale Insights (2022) found that women were 14% less likely to be promoted each year, due to ‘less leadership potential.’ This potential was largely fed through performance ratings and comments; if perception of success is tied to independence of thought, then women are hindered by evaluations that seat them as part of a team, rather than as an individual. Williams and Best (1990) measured workplace stereotypes across 25 countries, with similar results. Women were evaluated communally, on their ability to operate within a group, whereas men were rated agentively, for leading management and self-governance. This mirrors many subsequent studies, suggesting not enough attention has been paid to dismantling these expectations. The problem is cyclical, as if women are consistently derogated and overlooked for more senior roles, it risks becoming a self-fulfilling prophecy, where evaluations might genuinely pick up on performance rather than stereotypes, due to a lack of self-belief. This is far harder to unpick from unsubstantiated bias. To consistently have your name lost under a collective acknowledgement, impacts the likelihood of being noticed, and simultaneously the chance to develop leadership skills. In this way, it’s both the cause and the consequence that limits women from equal access. The convergence of strong and reliable language used for men, who hold more references to power (Fillipou, 2022), curates an image of dedication and reliability that isn’t inspired by affable but non-corporate female terms like ‘delightful’. In this way, the language used in performance ratings incorporates bias into career opportunities, inadvertently setting a glass ceiling for women not meeting higher-positioning buzz words. This puts women in a double-bind, where corporate jobs favour the ability to lead. If they break binary stereotypes, i.e. women not being amenable and negotiable, they are characterised negatively, and deemed unapproachable (Akron, 2017). And yet, to remain within the stereotype is to obscure perfectly attainable promotions, for which women met the criteria. This wasn’t the same for men, who for the same traits, were deemed capable and ‘forward planning’. It is in instances like this that 360 evaluations fall short. The term ‘abrasive’ was found 17 times in 13 different performance evaluations for women yet zero times for men, despite similar credentials. The calculated response saw women demonstrating strong leadership skills, but with humility, remaining a ‘person of the people’. This tactical behaviour serves neither women nor men; whilst it may be effective, by adapting to the problem, it systematically enables the bias to continue. In more insidious instances, it isn’t a calculated performance - women statistically underestimated their achievements (where men overestimated) on tasks they typically equal on. Women that rated themselves with less conviction were evaluated well, as they remained within binary expectations. Whilst technically positive, they were still rated communally, meaning that elections for promotion were still not equally attainable. Those who were aware of their own competence were at greater risk of derailment, with women far more likely to have sponsorships removed if deemed uncooperative and difficult (Braddy, 2019). This bias invokes fear into those thinking of breaching gender boundaries, by showing the lack of security and lasting career implications. Having said this, Heilman (2012) found that women with characteristics stereotypically aligned to their gender are also evaluated negatively. This is predominantly in male-heavy workplaces like the military, where less than a 35% female cohort openly labelled women as supporting equal opportunity. Here, women that don’t match male-stereotyped behaviours aren’t the ideal candidate, and those that do have their actions moralised and negatively amplified. Whilst this is more extreme than much of the data, it demonstrates the complexity of bias, and the need to pin it down. Even though all cases aren’t as clear cut as this, it highlights the damaging and constrictive nature of double-binds, where subjective peer reviews can become suffocating and hold little value. ‘Deference’ in the workplace sees an individual deemed to hold particular knowledge or power, often because they belong to a minoritised group. This can be extremely problematic. The issue of double binds for women remains even with conscious internal change, via becoming the ‘poster girl’ for success - that is effectively unpaid overtime. Specifically, deference sees women becoming the token person and immediate respondent for female campaigning. This creates substantial pressure, similar to celebrities facing backlash for being ‘bad role-models’, despite having an older target audience. It puts psychological and timely constraints on individuals who aren’t necessarily qualified to speak for the collective. Even without the problem of to whom we defer, deference can dangerously reinforce gendered assumptions, incurring apparently ‘valid’ character evaluations. Black women face greater adversity when breaking the communal-centred stereotype, reinserting stereotypes like Black women being ‘angry’, ultimately questioning whether anybody would assume that a white woman would or could represent all women’s experience. Explore the alternative: if companies intentionally appoint the 3% of black females in law into a managerial role, it’s still seated in bias. It fails to recognise the irony in thinking those disadvantaged by evaluation methods should educate others, or be promoted on anything other than merit, over-exhausting the people subjugated in the first place. Harrison (2006) found that in the US these affirmative action policies can make the situation worse, due to a naive belief that diversity quotas have been met, whilst internally perpetuating the problem. This comes down to a lack of objectivity in role expectations, the failure to undertake linguistic bias training, and to recognise where these biases lie within our own attitudes. Even individuals who deem themselves unbiased are at risk for falling into this pitfall, thinking all promotions are positive, and ultimately continuing to evaluate women through more communal phrases. It’s not a new idea that a diverse workforce is good for breaking ‘GroupThink’, the problem of maintaining the status quo through an inability to see alternative approaches. Whilst there is extensive research on organisational accommodations to address this, the research isn’t fully holistic. There is a large gap in exploring how a poor peer reception can impact autistic people’s ability to excel in the workplace - not from restrictions or deficiencies with an autistic mind, but purely because their achievements aren’t sufficiently evaluated. Only around 16% of autistic people (disclosing diagnosis) hold a full-time job, however I’ll look at those who are disadvantaged within the workforce, rather than the majority unable to enter it in the first place. Although autism varies, there is significant convergence on attitudes towards those with the condition, and their perceived abilities. As is seen in the DSM5 diagnostic criteria, an apparent lack of empathy and difficulty in understanding peers’ perspectives is very common; this contradicts with the collaborative ethos that many organisations encourage, so is understandably noticed. However, as Crompton (2019) demonstrated, these issues are exacerbated by a refusal to integrate the neurodivergent world with the neurotypical one. Harbouring a positive working environment alongside autistic people brings the responsibility to adjust the environment that they are working within. One key issue lies within snap judgments, both subliminal and overt. Sassoon (2017) found that autistic people are rated less socially favourable by non-autistic people based on a 5-second video clip, before their diagnosis is even announced. This prejudice is assumed to be surrounding characteristically inexpressive facial animation. The perception of lacking enthusiasm, commitment, or engagement with peers, may result in a more negative appraisal, violating anti-discrimination and equal opportunity initiatives. Most organisations make reasonable adjustments for disabilities, but this may not ensure equal opportunities based on performance evaluations. Instead, aid might look more like an attempt to mask autistic behaviours (like discrete headphones), creating a technically diverse team, that is still focused on maintaining the standard image of a professional workforce. Guaranteed interview schemes can easily become tick-boxing campaigns if these subliminal negative judgements are made, preventing neurodivergent people from entering the workplace, let alone succeeding in it. It’s therefore important to distinguish neurodivergence from genuine workplace concerns, and to pay attention to our own snap judgements, to bring some cohesion and accuracy to evaluations. Milton (2012) looks at the common misconception that autistic people lack empathy, and how this is perceived as callous and uncaring. In reality, they may actually experience heightened empathy, but struggle with appropriate and timely responses largely due to auditory processing issues. If autistic people are consistently misinterpreted, then evaluation tactics like 360-review are skewed in their accuracy and objectivity, despite thinking the environment is inclusive and accommodating. This prevents recognition of success, and perpetuates an imbalance in diversity and employment security, disadvantaging 40% of those with autism who wish for more contracted hours or a promotion (Rosie Cope, 2022). Despite the negative appraisals, research has suggested that an autistic mindset can be advantageous. In a 3-grouped study (Frith, 2003), peer chains between autistic people, non-autistic people and intergroup interactions were measured; these diffusion chains measured how much information is correctly passed between people. The results contradict scepticism about communication efficacy, finding the autistic chain to be the most reliant in retention and accurate relaying. The inter-group chain was predictably worst, demonstrating the gaps in understanding between neurotypical and neurodivergent people, coined the ‘double-empathy problem’. Bias is therefore primarily picking up a lack of understanding, rather than a lack of capability. Due to a lateral thinking style, Frith found that people with autism were better than neurotypical people at pattern recognition and noticing minute mistakes. This is due to looking at the constituent parts, as opposed to the whole picture, noting what is, rather than seeing what should be. In fact, with understanding, support and suitable adaptations, autistic employees were found to outperform other employees in efficiency and scrupulous detail (Smith, 2023). There is training specifically for this purpose, with varying degrees of success. An implicit association task (R Jones, 2021) found that autism acceptance training had limited success; participants looked at negative autistic stereotypes and assumptions, before being tested for subconscious bias. The results found that outward impressions towards autistic people had changed for the better, but implicit attitudes remained negative. Whilst autistic people were positively viewed as more intelligent and trustworthy, this doesn't make the evaluation objective overall. However, the relative failings of this training decreased when presented alongside immersive perspective films. These showed the autistic experience in adapting to the corporate world (within a meeting scenario), from coping with harsh lighting, overstimulating background noise, and the use and limits of small talk. These short films were synced to virtual reality to try and demonstrate how encapsulating autism can be. The results were extremely positive, with increased sympathy for the struggles of relatively mundane neurotypical tasks. Interestingly, some said they too struggled with some of this overstimulation but hadn't been able to articulate it previously. This newfound understanding should correlate to a more tolerant evaluation and perception of autistic peers. It highlighted general practice that isn't necessarily intuitive, increasing responsiveness to autistic peers needing further rationalising. This increase in understanding and commonality suggests that there are active steps companies can make mainstream, including via autism awareness video training. Ultimately, this should incorporate the neurotypical world into the neurodivergent one, beyond 'leniencies’ for disabilities, which can insight animosity from peers not understanding the pervasiveness of autistic minds in the workplace. This neurodivergent research highlights two things: There is no one set solution to removing bias; ultimately it relies on extrapolating who is disadvantaged, in which ways, and adapting inclusion training to reflect organisation culture. There are clear cut things that bring awareness to this problem- namely transparency. Transparency of pay, of rating systems, and significantly how evaluations feed into promotion decisions. This makes a lack of due care harder to hide, and fosters trust between employees. Global PwC survey results (2011) found that 85% of respondents from UK and US offices recognised the need for compensation equity action, but only 2% followed through, and were fully transparent about the salary of all employees. The ambiguity of performance ratings enables these problems to persist, under the naive pretence that it’s based on real-world data. Katia Roy (2021) argued that diversity and inclusion AI might be able to reduce this, by objective hardwired solutions into the evaluation process, hopefully detecting and flagging bias. Organisations such as Brightmine Pay Equity Analytics use software to identify representation gaps in organisational people data, giving insights into progression work and remediation models to address inequality. In this way, there is a difference between genuinely progressive and superficially progressive evaluation tools. In recognising where these differences lie, and who they impact in which ways, organisations can begin to remove biases from within the workplace. Melissa Campbell-Oulton July 2024 My name is Katia Thordsen, and I am going into my third year studying English and History at the University of Nottingham. I am particularly interested in Cold War history and dystopian literature and have a keen passion for research, which initially drew me to the summer research placement. After University I would like to go into the field of law and study to become a solicitor, another key motivator for this placement which provided me with the opportunity to work with the excellent law firm Browne Jacobson. The internship itself has been invaluable to me, I have furthered my research skills, gained knowledge on the topic of inclusive language and met some amazing contacts. I am very thankful to the placement team and my supervisors for helping me through such an enjoyable process. As the age-old saying goes, “sticks and stones may break my bones, but words will never hurt me,” - this could not be further from the truth in the context of the workplace. In line with the professional sector’s growing motivation to act in line with DE&I (Diversity, Equity, and Inclusion) principles, which ensure the inclusion of minoritised groups in the workplace, studies also highlight the silent killer of employee retention: microaggressions. Microaggressions are subtle, often unintentional forms of prejudice, whether that be a comment or joke regarding an individual’s appearance, language, or background status. Microaggressions include: This blog will focus on the damaging effects of microaggressions on both individuals and workplace culture, particularly how these effects can hinder employees’ well-being at work and retention rates in the workplace. There is a fine line between overt racism, sexism and microaggressions, and for this reason they can be difficult to define and acknowledge. So, what is an example of a microaggression in the workplace? A microaggression could be praising someone from UK ethnic minority background for their ‘excellent English literacy,’ interrupting a woman in a meeting or labelling her as ‘bossy,’ or asking inappropriate, invasive questions on an individual’s sexuality. Moreover, some microaggressions are embedded in our everyday vocabulary and for this reason some individuals may be oblivious to the deeper meanings of these phrases. Here are just a few examples of common phrases, with deeper, disrespectful meanings: Whether these micro comments are intentional or not, their impact is macro on those receiving them. Therefore, it is our responsibility to actively try and recognise them. Mistakes are still bound to happen, but the important thing is creating an inclusive workplace where people feel they can speak up and challenge these terms and for people to try to be more thoughtful and inclusive with their language. Microaggressions can be a form of what is coined ‘Linguistic Racism.’ Linguistic Racism is discrimination or prejudice based on a person’s or community’s linguistic background, which as a result normalises uneven linguistic power between social groups. Research conducted with migrant communities in Australia (Dovchin, 2020) has identified ‘ethnic linguistic penalties’ and ‘ethnic name penalties.’ This occurs when organisations discriminate against the CVs of people with non-Anglo-Saxon names. Linguistic racism also occurs when the names of people from minoritised backgrounds are mispronounced, or misnamed, with some people from minoritised groups reporting being called the name of another minoritised individual in the workplace. A name is an identity; therefore, organisations should place greater importance on learning names whether that be through icebreakers, phonetic nametags, or just general conversation. Additionally, LinkedIn provides a service to record one’s correct pronunciation of their name, which could be a useful tool. Overall, this area of study is significantly under researched in the UK and therefore needs better representation to ensure more inclusive workplaces. Microaggressions can have harmful impacts on individuals’ psychological, general health and well-being. Additionally, they can destroy self-esteem and therefore can limit career progression and prevent employees from wanting to attend work. Some Covid-19 studies found that minority groups, particularly ethnic minorities and disabled persons preferred flexible and remote working, as it was considered to be more accessible, and they were less likely to face discrimination. A survey (Boyle, 2021) of 10,000 Black employees in white collar roles supports this, reporting a 26% increase since the pandemic in Black respondents reporting fair treatment at work. Whilst flexible and remote working is becoming more accessible in the professional field, it raises concerns as to why people should feel they need to remove themselves from offices to avoid discrimination? Instead, organisational cultures need to change to better accommodate their people. By the same token, an intersectional study (Holder et al., 2015) was published on race-based microaggressions experienced by Black women in corporate leadership positions in USA and their coping strategies for dealing with them. Interviews were conducted with ten Black women who all had firsthand experiences with microaggressions relating to both their race and gender. The women detailed the following coping mechanisms: religion and spirituality, sponsorship and mentorship and shifting support networks for dealing with respective microaggressions. Black women corporate leaders used these strategies in order to protect themselves against humiliation, frustration, and marginalisation. Black women reported that having strong emotional capacity and ‘sanity checks’ with fellow African Americans validated their feelings. However, the impact felt by the victims transgressed into mental health and general well-being, with the physiological effects of microaggressions including anxiety and depression, paranoia, lack of drive and sleep difficulties. This highlights the significant effects microaggressions can have on the individual. Microaggressions do not solely affect people receiving them, they also impact the environments around them and organisational culture. Workplaces where employees cannot express themselves face detrimental effects such as lack of employee motivation and collaboration. Therefore, organisations miss out on the benefits of a diverse workplace such as avoiding groupthink and allowing all team members to contribute individually. Strong partnerships, support systems and happy workplaces all align with a good organisational culture. Change has to come from within, and it is not just down to senior leaders. In fact the World Economic Forum focuses its research on middle managers who ‘shape the daily experiences of their employees’. Their suggestions include reinforcing a no-tolerance policy for disrespectful behaviour which extends beyond legally actionable behaviours such as microaggressions and sexual harassment. Overall, an inclusive workplace requires inclusive input. Diversity of thought is crucial to a business’ success, and therefore by acting in line with DE&I principles and dealing with microaggressions organisations can flourish. There has been a notable positive correlation between microaggressions and resignation of minoritised groups. The Great Resignation of 2021 in the USA supported this theory, with professional industries undergoing a wave of walkouts, in which the absence of workplace inclusivity was a large contributor (Washington, 2022). Further evidence has been elicited through exit interviews. Exit interviews are meetings between an interviewer and the departing employee. They are often used to learn more about the individual’s decision to leave the organisation and gain valuable insight into their thoughts on the organisation which it can use to make changes. Exit interviews are a great place for employers to examine reasoning for employee sentiment, which could be a result of microaggression or workplace exclusion. However, they are not being conducted consistently or effectively in many professional organisations leading to data gaps and missed opportunities for workplace improvement. A 2017 study by Pace et al. on strategic exit interviewing found that interviews that use employee voice better inform HR and organisational strategy. Additionally, the target of voice and who conducts the exit interview was essential to whether the feedback elicited was honest. To further this, interviews with minoritised groups were conducted with an external consultant, to better learn of the organisational culture. Psychological research suggests that individuals are more likely to be honest and open if the interviewer resembles themselves: gender, race, and experience. Therefore, it is important for organisations to consider these factors when conducting exit interviews in order to maintain diversity of voice and retrieve useful feedback to improve their workplace culture. Microaggressions can affect everybody in a workplace; nobody wants to encounter conflict in the workplace and therefore its vital these incidents are responded to sensibly, sensitively, and strategically. Furthermore, alongside the individual who received the microaggression, workplaces should also consider the individual who made the comment. It is important to evaluate the situation, in some cases the microaggression could be a mistake, or a result of a lack of education and awareness. Avoid designating ‘victim’ and ‘perpetrator’ roles and instead treat it as the people vs the problem, adopting this mindset will ensure effective resolution of the incident whilst protecting the feelings of those involved. Below are some key considerations for both employers and employees in receiving and responding to microaggressions: As far as more senior members and team leaders are concerned, they hold a responsibility to provide training and role-modelling on DE&I expectations, and in the presence of incidents should be responsible for addressing these with individuals. The Financial Times reports that in October 2024 the UK will see the introduction of stronger worker protection laws. New legislation will place a greater duty on employers to take the necessary measures to prevent misconduct, with some professional services already starting to adopt such measures. For example, Law firm Travers Smith has updated its policy on staff reporting concerns about conduct, alongside a training programme for managers. Furthermore Law firm Hogan Lovells has recently launched an online anonymous reporting system to tackle microaggressions. Through this platform, employees will be able to securely log incidents, including those related to race, gender, and sexuality. However, the move to anonymous online reporting has generated both praise and concern from the professional field. Whilst the anonymity of the reporting process can empower marginalised groups within the workplace, it can also harvest an environment of fear as a result of individuals being unknowingly reported, and therefore they may be over sensitised in the way in which they act and speak. In some cases, face-to-face adult conversations between parties may provide more effective resolution. Moreover, anonymity could hinder leadership’s ability to follow up on the reports and therefore while the systems are important, they should be complimented with other systems for employee feedback. Katia Thordsen Centre for Research in Applied Linguistics The University of Nottingham Nottingham, NG7 2RD telephone:+44 (0) 115 748 6360 fax: +44 (0) 115 951 5924 email: lipp@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}