{
    "url": "https://www.nottingham.ac.uk/LiPP/index.aspx",
    "content": [
        {
            "p": "We use our research into how language is used in real-life work environments to inform training, courses and consultancy with the aim of improving global communication. To find out more or to discuss working with us, please contact us. Email Twitter Linkedin Facebook In these innovative degree programmes, you will be introduced to key linguistics concepts and research on professional communication, as well as the means to apply these practically to enhance workplace practice. The below Professional Communication courses are all studied via Web-Based Distance Learning: Health communication Public services communication Global communication Communicating equality Digital communication Leadership communication Workshops Consultancy Online learning Eye-tracking The Trent Building, University Park Campus New funding for Masters degrees Midlands4Cities Nottingham funding for students starting in September 2019. Eligibility: All of Arts and Humanities. Selected themes in Law, Politics and Geography. These awards are available to outstanding students from the UK who wish to pursue a Masters degree (MA or MRes) at the University of Nottingham in any area of the Arts and Humanities or areas eligible for AHRC funding in Law and Social Sciences. Find out how to apply Radical Electric Teaching: A Conference and Showcase Future innovations in teaching and learning will evolve where new thinking in teaching, new approaches to curriculum design and management, and new technology come together in alignment. This two-day conference brings together university teachers and educators, learning technologists, practitioners and students to share the concepts, practices and technical applications that will form the educational settings of the future. Register today Centre for Research in Applied Linguistics The University of Nottingham Nottingham, NG7 2RD telephone:+44 (0) 115 748 6360 fax: +44 (0) 115 951 5924 email: lipp@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}