{
    "url": "https://www.nottingham.ac.uk/manuscriptsandspecialcollections/collectionsindepth/magneticresonanceimaging/sir-peter-mansfield.aspx",
    "content": [
        {
            "p": "Peter Mansfield was born in Lambeth, London, on 9 October 1933. He went to school in Peckham, leaving at age 15 to work as a printer's assistant. Having developed an interest in rocketry, he got a job aged 18 with the Rocket Propulsion Department of the Ministry of Supply. He studied for his A-Levels at night school, then went to Queen Mary College, London, to study Physics, graduating in 1959 and completing his PhD in 1962. He then carried out postdoctoral research with Professor Charles Slichter at the University of Illinois, studying nuclear magnetic resonance (NMR) in solids. In 1964 Mansfield returned to the UK to take up a post as Lecturer at the University of Nottingham, becoming a Senior Lecturer in 1968 and a Reader in 1970. He continued his research into NMR, working on multi-pulse techniques. In the early 1970s he proposed the idea that NMR could be used to study the structure of matter, and this developed into a vision of how NMR could form the basis of a medical imaging technique. This technique was later named magnetic resonance imaging (MRI). One of his earliest important contributions was the invention of a method for selecting and imaging a specific slice through an object. Funded by the Medical Research Council he developed MRI apparatus which produced the first MRI images of a live human finger in 1974, and a live human torso (Mansfield's own) in 1978. He went on to initiate and develop the technique of Echo-Planar Imaging (EPI) in the late 1970s, which allowed extremely fast imaging of dynamic processes such as a beating heart. He was appointed Professor in 1979. Mansfield was instrumental in the construction of the Magnetic Resonance Centre at the University of Nottingham, and was its first Director, from 1991 to 1994. It is now named the Sir Peter Mansfield Imaging Centre. He formally retired in 1994, but continued his research, particularly into the noise levels generated by the MRI process. Mansfield was elected a Fellow of the Royal Society in 1987, and was knighted in 1993. In 2003 he was awarded the Nobel Prize in Physiology or Medicine with Paul Lauterbur 'for their discoveries concerning magnetic resonance imaging'. He died on 8 February 2017. Peter Mansfield lying inside an early mock-up of an MRI scanner (PPM/15/78/11) Mansfield’s research papers form a large part of the collection. They include notes, experimental results and photographs relating to NMR and the development of MRI techniques such as Echo-Planar Imaging, copies of his own published papers and books, drafts of such publications, and papers on NMR and MRI by other authors. Mansfield took out patents on many of his techniques and inventions, and in the collection there is a large quantity of correspondence concerning the drafting and agreement of patents, objections raised, and legal disputes over patent infringement, as well as copies of the patents themselves. The collection also contains Mansfield’s school and university notebooks, papers relating to conferences he attended and lectures he gave, correspondence files, and teaching material from his time at Nottingham. Also included are around 2,700 35 mm slides showing MRI images, experimental results, graphs, scanning equipment, and diagrams explaining the principles of NMR and MRI, together with some videotapes of early EPI experiments. The catalogue of the Peter Mansfield collection is available and searchable through the Manuscripts Online Catalogue: catalogue record Next page: Raymond Andrew Kings Meadow Campus Lenton Lane Nottingham, NG7 2NR telephone: +44 (0) 115 951 4565 fax: +44 (0) 115 846 8651 email: mss-library@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}