{
    "url": "https://www.nottingham.ac.uk/manuscriptsandspecialcollections/learning/heritagelearningprogramme/heritage-learning-programme.aspx",
    "content": [
        {
            "p": "We offer a unique, cross-curricular Learning Progamme for Key Stage 1 and 2 Widening Participation Schools using the collections and expertise at the Museum of Archaeology and Manuscripts and Special Collections. To ask us any questions and find out if your school is eligible for our free workshops and resources, contact the Learning Team and check your school's eligibility here. We are a team of staff and students at the University of Nottingham who provide free on-campus and in-school education workshops and resources for eligible schools. Using collections, facilities, and expertise from the University’s Museum of Archaeology and Manuscripts and Special Collections, we create inspiring learning opportunities for Key Stage 1 and 2 pupils from millions of collection items that the University cares for and researches. We have just launched our programme this year and are in the process of developing more exciting resources. Currently, we have a range of subjects we support for the Key Stage 1 and 2 National Curriculum, including: We are currently developing more subjects and resources and will update this page when they become available. Heritage Learning Officers can deliver sessions in schools or host class trips at the University of Nottingham. There is no charge for either, and we may be able to help with travel costs for eligible schools local to Nottingham city centre. We have a range of widening participation criteria to identify eligible schools. To find out if your school is eligible, please contact our team on HeritageLearning@nottingham.ac.uk who will be happy to advise. Our focus is Key Stage 1 and 2. However, there are sometimes opportunities to work with other year groups, depending on resource and team capacity. Please do email us on HeritageLearning@nottingham.ac.uk for further information. Some of our sessions, such as the Romans and Florence Nightingale, are particularly designed as cross-disciplinary and compliant with the National Curriculum. However, for Local History resources, we will use historic maps and sources that reflect the region of your School. If you have particular requirements or subjects you would like us to cover, please do contact us! Click here to email the Heritage Learning Team. Kings Meadow Campus Lenton Lane Nottingham, NG7 2NR telephone: +44 (0) 115 951 4565 fax: +44 (0) 115 846 8651 email: mss-library@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}