{
    "url": "https://www.nottingham.ac.uk/manuscriptsandspecialcollections/tours-and-talks.aspx",
    "content": [
        {
            "p": "We are happy to provide talks and behind-the-scenes guided tours about the work of Manuscripts & Special Collections and the records we hold. We can host these on King's Meadow Campus, or visit you at your venue. Please contact us to discuss your group/organisation's requirements, giving us as much notice as possible. We will try to tailor events to your specific research interests whenever possible. Our expert staff can deliver public talks on a range of topics, using our rare books and archives, including: Talks last for approximately 45 minutes and include slides. Talks held at Manuscripts & Special Collections include the option to book a free behind-the-scenes tour (lasting an additional 45 minutes). We can travel to venues in and around Nottingham, or deliver talks online. Fee: £45 plus any travel expenses. Contact: mss-library@nottingham.ac.uk We offer free behind-the-scenes tours of Manuscripts & Special Collections to the public a couple of times a year. However, if you would like to book a private tour and display of documents relevant for your group then please email mss-library@nottingham.ac.uk us to discuss availability. The tour and the chance to see some of our most important and exciting rare books and archives lasts about 60 minutes. The group size is normally limited to 12, but we may be able to accommodate larger groups. Fee: £45. Our public exhibition gallery is at Lakeside Arts on the main University Park Campus. The exhibitions change several times a year and information about the current programme is here. We run curator tours as part of the usual programme of events, but if you would like a private tour for your group/organisation then we are happy to arrange this. Tours last approximately 1 hour. The group size is a maximum of 15. Fee: £20. We don't charge for classes, seminars or training provided to staff and students of the University of Nottingham. We can provide general introductions to archival research and how to use Manuscripts & Special Collections, and module-specific sessions with the opportunity to see relevant archival material. Contact us mss-library@nottingham.ac.uk to discuss how we can help. Kings Meadow Campus Lenton Lane Nottingham, NG7 2NR telephone: +44 (0) 115 951 4565 fax: +44 (0) 115 846 8651 email: mss-library@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}