{
    "url": "https://www.nottingham.ac.uk/manuscriptsandspecialcollections/collectionsindepth/introduction.aspx",
    "content": [
        {
            "p": "This series of resources gives in-depth information about particularly significant collections held by Manuscripts and Special Collections, or subject areas featured in our holdings. This is not a comprehensive overview of all of our collections. See All Collections for details about the full range of material that we hold. The archives, rare books and objects held by Manuscripts and Special Collections and the University of Nottingham Museum cover a huge span of time and subject areas. They reflect the attitudes and values of the period in which they were created and collected and of the people who created and collected them. We are aware that users may encounter material which they find uncomfortable or offensive, including outdated or discriminatory language and terminology, instances of bias, and offensive imagery. Other voices are marginalised, misrepresented or absent. In addition some catalogue descriptions were written many years ago and may themselves perpetuate this marginalisation. In line with ongoing work in the heritage sector we are identifying ways that we can address these issues whilst continuing to maintain the historical context in which the collections were created. We are committed to listening to all voices, people and communities. To contact us about items in the collections, or language used in descriptions, please e-mail mss-library@nottingham.ac.uk. View these resources >> This collection is a major research resource for ecclesiastical court history, and touches also on many local issues. Family and estate collections are a valuable resource for British social, political, economic and administrative history. The University holds many materials which are relevant to aspects of the history of health and medical treatment. A major international research resource for the study of this Nottinghamshire born writer. Historical records of The University of Nottingham and its predecessor, University College, Nottingham Collections relating to rivers, water supply and drainage touch on a wide variety of themes. Books, periodicals and other materials on the historic counties of Derbyshire, Leicestershire, Lincolnshire, Nottinghamshire and Rutland. Records of Congregational, Presbyterian, United Reformed, Baptist and Unitarian churches in Nottingham, Mansfield and Retford. Religious service books, poetry, prose tales and works of moral instruction, including the Wollaton Library Collection and the Wollaton Antiphonal. Collections relating to the development of MRI at the University of Nottingham, including the papers of Nobel Prize winner Sir Peter Mansfield. Next page: Archdeaconry of Nottingham resources Kings Meadow Campus Lenton Lane Nottingham, NG7 2NR telephone: +44 (0) 115 951 4565 fax: +44 (0) 115 846 8651 email: mss-library@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}