{
    "url": "https://www.nottingham.ac.uk/manuscriptsandspecialcollections/researchguidance/introduction.aspx",
    "content": [
        {
            "p": "Using original records for the first time can be quite daunting. The handwriting can be hard to read; unfamiliar words and phrases are often used; and it can be difficult to know which documents to use in order to find relevant information. These units give advice relating to using and understanding old records. They use examples from the collections held by The University of Nottingham, but researchers using archives from any English record office will find the advice relevant. Each unit includes a list of further reading for researchers who need a more comprehensive approach. View the resource >> A general introduction to archives, where they are kept, how to find relevant material and what to expect on a visit to an archives office. Advice on how to handle and store archives and rare books safely to keep them in good condition for the future. Explains some of the most common difficulties with interpreting the different dating conventions used in historical documents. A guide to deciphering former English and Welsh units of weights, measurements and money, from the late 16th century onwards. Attempts to demystify the ways used to record monetary transactions, from medieval compoti to twentieth-century balance sheets. Information to assist users in their understanding and interpretation of different types of deeds, with details of reference sources. Following on from the Deeds unit, this is a very detailed guide to reading and understanding old title deeds. A guide to using the various types of documents which were generated by the internal administration of a manor. Maps and plans are a specialist medium and it is not always immediately obvious just what can be learned from them. How books were made in the Middle Ages, including preparing materials, laying out the text, illustrating and decorating, forming quires, and binding. Exploring the format, language, handwriting style and abbreviations used in medieval documents. Includes interactive palaeography exercises. Your feedback on the units mounted so far would be appreciated and will help to inform future developments. Next page: Introduction to using archives Kings Meadow Campus Lenton Lane Nottingham, NG7 2NR telephone: +44 (0) 115 951 4565 fax: +44 (0) 115 846 8651 email: mss-library@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}