{
    "url": "https://www.nottingham.ac.uk/mathematics/people/markus.owen",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR Elementary effects for models with dimensional inputs of arbitrary type and range: Scaling and trajectory generation (2023) Journal Article Rutjens, R. J., Band, L. R., Jones, M. D., & Owen, M. R. (2023). Elementary effects for models with dimensional inputs of arbitrary type and range: Scaling and trajectory generation. PLoS ONE, 18(10), Article e0293344. https://doi.org/10.1371/journal.pone.0293344 The Elementary Effects method is a global sensitivity analysis approach for identifying (un)important parameters in a model. However, it has almost exclusively been used where inputs are dimensionless and take values on [0, 1]. Here, we consider mode... Read More about Elementary effects for models with dimensional inputs of arbitrary type and range: Scaling and trajectory generation. Long-distance hormone transport via the phloem (2023) Journal Article Collis, H. L., Owen, M. R., & Band, L. R. (2023). Long-distance hormone transport via the phloem. Journal of Theoretical Biology, 562, Article 111415. https://doi.org/10.1016/j.jtbi.2023.111415 Several key plant hormones are synthesised in the shoot and are advected within the phloem to the root tip. In the root tip, these hormones regulate growth and developmental processes, and responses to environmental cues. However, we lack understandi... Read More about Long-distance hormone transport via the phloem. In silico evidence for the utility of parsimonious root phenotypes for improved vegetative growth and carbon sequestration under drought (2022) Journal Article Schäfer, E. D., Ajmera, I., Farcot, E., Owen, M. R., Band, L. R., & Lynch, J. P. (2022). In silico evidence for the utility of parsimonious root phenotypes for improved vegetative growth and carbon sequestration under drought. Frontiers in Plant Science, 13, Article 1010165. https://doi.org/10.3389/fpls.2022.1010165 Drought is a primary constraint to crop yields and climate change is expected to increase the frequency and severity of drought stress in the future. It has been hypothesized that crops can be made more resistant to drought and better able to sequest... Read More about In silico evidence for the utility of parsimonious root phenotypes for improved vegetative growth and carbon sequestration under drought. Uncertainty and error in SARS-CoV-2 epidemiological parameters inferred from population-level epidemic models (2022) Journal Article Whittaker, D. G., Herrera-Reyes, A. D., Hendrix, M., Owen, M. R., Band, L. R., Mirams, G. R., Bolton, K. J., & Preston, S. P. (2023). Uncertainty and error in SARS-CoV-2 epidemiological parameters inferred from population-level epidemic models. Journal of Theoretical Biology, 558, Article 111337. https://doi.org/10.1016/j.jtbi.2022.111337 During the SARS-CoV2 pandemic, epidemic models have been central to policy-making. Public health responses have been shaped by model-based projections and inferences, especially related to the impact of various non-pharmaceutical interventions. Accom... Read More about Uncertainty and error in SARS-CoV-2 epidemiological parameters inferred from population-level epidemic models. Modeling root loss reveals impacts on nutrient uptake and crop development (2022) Journal Article Schäfer, E. D., Owen, M. R., Band, L. R., Farcot, E., Bennett, M. J., & Lynch, J. P. (2022). Modeling root loss reveals impacts on nutrient uptake and crop development. Plant Physiology, 190(4), 2260-2278. https://doi.org/10.1093/plphys/kiac405 Abstract Despite the widespread prevalence of root loss in plants, its effects on crop productivity are not fully understood. While root loss reduces the capacity of plants to take up water and nutrients from the soil, it may provide benefits by decr... Read More about Modeling root loss reveals impacts on nutrient uptake and crop development. Modelling the emergence of cities and urban patterning using coupled integro-differential equations (2022) Journal Article Whiteley, T. D., Avitabile, D., Siebers, P. O., Robinson, D., & Owen, M. R. (2022). Modelling the emergence of cities and urban patterning using coupled integro-differential equations. Journal of the Royal Society, Interface, 19(190), Article 20220176. https://doi.org/10.1098/rsif.2022.0176 Human residential population distributions show patterns of higher density clustering around local services such as shops and places of employment, displaying characteristic length scales; Fourier transforms and spatial autocorrelation show the lengt... Read More about Modelling the emergence of cities and urban patterning using coupled integro-differential equations. Exorcising Malthusian ghosts: Vaccinating the Nexus to advance integrated water, energy and food resource resilience (2021) Journal Article Kemp, P. S., Acuto, M., Larcom, S., Lumbroso, D., & Owen, M. R. (2022). Exorcising Malthusian ghosts: Vaccinating the Nexus to advance integrated water, energy and food resource resilience. Current Research in Environmental Sustainability, 4, Article 100108. https://doi.org/10.1016/j.crsust.2021.100108 Water-Energy-Food (WEF) Nexus interactions vary from seemingly negative and intractable wicked problems to opportunities for enhanced sustainability. The aim of this paper is to review the current state of understanding on WEF resource interactions a... Read More about Exorcising Malthusian ghosts: Vaccinating the Nexus to advance integrated water, energy and food resource resilience. Differential biosynthesis and cellular permeability explain longitudinal gibberellin gradients in growing roots (2021) Journal Article Rizza, A., Tang, B., Stanley, C. E., Grossmann, G., Owen, M. R., Jones, A. M., & Band, L. R. (2021). Differential biosynthesis and cellular permeability explain longitudinal gibberellin gradients in growing roots. Proceedings of the National Academy of Sciences, 118(8), Article e1921960118. https://doi.org/10.1073/pnas.1921960118 Control over cell growth by mobile regulators underlies much of eukaryotic morphogenesis. In plant roots, cell division and elongation are separated into distinct longitudinal zones and both division and elongation are influenced by the growth regula... Read More about Differential biosynthesis and cellular permeability explain longitudinal gibberellin gradients in growing roots. Agent-based modelling of juvenile eel migration via selective tidal stream transport (2021) Journal Article Benson, T., de Bie, J., Gaskell, J., Vezza, P., Kerr, J. R., Lumbroso, D., Owen, M. R., & Kemp, P. S. (2021). Agent-based modelling of juvenile eel migration via selective tidal stream transport. Ecological Modelling, 443, Article 109448. https://doi.org/10.1016/j.ecolmodel.2021.109448 Recruitment of temperate eel species Anguilla anguilla, A. rostrata & A. japonica has declined over the last few decades due to human activities, such as overfishing and construction of migratory barriers (e.g. dams, weirs and sluices) and hazardous... Read More about Agent-based modelling of juvenile eel migration via selective tidal stream transport. A Mechanistic Investigation into Ischemia-Driven Distal Recurrence of Glioblastoma (2020) Journal Article Curtin, L., Hawkins-Daarud, A., Porter, A. B., van der Zee, K. G., Owen, M. R., & Swanson, K. R. (2020). A Mechanistic Investigation into Ischemia-Driven Distal Recurrence of Glioblastoma. Bulletin of Mathematical Biology, 82(11), Article 143. https://doi.org/10.1007/s11538-020-00814-y Glioblastoma (GBM) is the most aggressive primary brain tumor with a short median survival. Tumor recurrence is a clinical expectation of this disease and usually occurs along the resection cavity wall. However, previous clinical observations have su... Read More about A Mechanistic Investigation into Ischemia-Driven Distal Recurrence of Glioblastoma. Identifying the spatial and temporal dynamics of molecularly-distinct glioblastoma sub-populations (2020) Journal Article Morris, B., Curtin, L., Hawkins-Daarud, A., Hubbard, M. E., Rahman, R., Smith, S. J., Auer, D., Tran, N. L., Hu, L. S., Eschbacher, J. M., Smith, K. A., Stokes, A., Swanson, K. R., & Owen, M. R. (2020). Identifying the spatial and temporal dynamics of molecularly-distinct glioblastoma sub-populations. Mathematical Biosciences and Engineering, 17(5), 4905-4941. https://doi.org/10.3934/mbe.2020267 Glioblastomas (GBMs) are the most aggressive primary brain tumours and have no known cure. Each individual tumour comprises multiple sub-populations of genetically-distinct cells that may respond differently to targeted therapies and may contribute t... Read More about Identifying the spatial and temporal dynamics of molecularly-distinct glioblastoma sub-populations. Switching behaviour in vascular smooth muscle cell–matrix adhesion during oscillatory loading (2020) Journal Article Irons, L., Huang, H., Owen, M. R., O'Dea, R. D., Meininger, G. A., & Brook, B. S. (2020). Switching behaviour in vascular smooth muscle cell–matrix adhesion during oscillatory loading. Journal of Theoretical Biology, 502, Article 110387. https://doi.org/10.1016/j.jtbi.2020.110387 Integrins regulate mechanotransduction between smooth muscle cells (SMCs) and the extracellular matrix (ECM). SMCs resident in the walls of airways or blood vessels are continuously exposed to dynamic mechanical forces due to breathing or pulsatile b... Read More about Switching behaviour in vascular smooth muscle cell–matrix adhesion during oscillatory loading. Speed Switch in Glioblastoma Growth Rate due to Enhanced Hypoxia-Induced Migration (2020) Journal Article Curtin, L., Hawkins-Daarud, A., van der Zee, K. G., Swanson, K. R., & Owen, M. R. (2020). Speed Switch in Glioblastoma Growth Rate due to Enhanced Hypoxia-Induced Migration. Bulletin of Mathematical Biology, 82(3), Article 43. https://doi.org/10.1007/s11538-020-00718-x We analyze the wave-speed of the Proliferation Invasion Hypoxia Necro-sis Angiogenesis (PIHNA) model that was previously created and applied to simulate the growth and spread of glioblastoma (GBM), a particularly aggressive primary brain tumor. We ex... Read More about Speed Switch in Glioblastoma Growth Rate due to Enhanced Hypoxia-Induced Migration. Effect of loading history on airway smooth muscle cell-matrix adhesions (2018) Journal Article Irons, L., Owen, M. R., O'Dea, R. D., & Brook, B. S. (2018). Effect of loading history on airway smooth muscle cell-matrix adhesions. Biophysical Journal, 114(11), 2679-2690. https://doi.org/10.1016/j.bpj.2018.04.026 Integrin-mediated adhesions between airway smooth muscle (ASM) cells and the extracellular matrix (ECM) regulate how contractile forces generated within the cell are transmitted to its external environment. Environmental cues are known to influence t... Read More about Effect of loading history on airway smooth muscle cell-matrix adhesions. Capturing the dynamics of a hybrid multiscale cancer model with a continuum model (2018) Journal Article Joshi, T. V., Avitabile, D., & Owen, M. R. (2018). Capturing the dynamics of a hybrid multiscale cancer model with a continuum model. Bulletin of Mathematical Biology, 80(6), 1435–1475. https://doi.org/10.1007/s11538-018-0406-6 Cancer is a complex disease involving processes at spatial scales from sub-cellular, like cell signalling, to tissue scale, such as vascular network formation. A number of multiscale models have been developed to study the dynamics that emerge from t... Read More about Capturing the dynamics of a hybrid multiscale cancer model with a continuum model. OpenSimRoot: widening the scope and application of root architectural models (2017) Journal Article Postma, J. A., Kuppe, C., Owen, M. R., Mellor, N. L., Griffiths, M., Bennett, M. J., Lynch, J. P., & Watt, M. (2017). OpenSimRoot: widening the scope and application of root architectural models. New Phytologist, 215(3), 1274-1286. https://doi.org/10.1111/nph.14641 © 2017 The Authors. New Phytologist © 2017 New Phytologist Trust OpenSimRoot is an open-source, functional–structural plant model and mathematical description of root growth and function. We describe OpenSimRoot and its functionality to broaden the b... Read More about OpenSimRoot: widening the scope and application of root architectural models. Root hydrotropism is controlled via a cortex-specific growth mechanism (2017) Journal Article Dietrich, D., Pang, L., Kobayashi, A., Fozard, J. A., Boudolf, V., Bhosale, R., Antoni, R., Nguyen, T., Hiratsuka, S., Fujii, N., Miyazawa, Y., Bae, T.-W., Wells, D. M., Owen, M. R., Band, L. R., Dyson, R. J., Jensen, O. E., King, J. R., Tracy, S. R., Sturrock, C. J., …Bennett, M. J. (2017). Root hydrotropism is controlled via a cortex-specific growth mechanism. Nature Plants, 3(6), Article 17057. https://doi.org/10.1038/nplants.2017.57 Plants can acclimate by using tropisms to link the direction of growth to environmental conditions. Hydrotropism allows roots to forage for water, a process known to depend on abscisic acid (ABA) but whose molecular and cellular basis remains unclear... Read More about Root hydrotropism is controlled via a cortex-specific growth mechanism. Mathematical modelling of cytokines, MMPs and fibronectin fragments in osteoarthritic cartilage (2017) Journal Article Baker, M., Brook, B. S., & Owen, M. R. (2017). Mathematical modelling of cytokines, MMPs and fibronectin fragments in osteoarthritic cartilage. Journal of Mathematical Biology, 75(4), 985-1024. https://doi.org/10.1007/s00285-017-1104-y Osteoarthritis (OA) is a degenerative disease which causes pain and stiffness in joints. OA progresses through excessive degradation of joint cartilage, eventually leading to significant joint degeneration and loss of function. Cytokines, a group of... Read More about Mathematical modelling of cytokines, MMPs and fibronectin fragments in osteoarthritic cartilage. Dynamic regulation of auxin oxidase and conjugating enzymes AtDAO1 and GH3 modulates auxin homeostasis (2016) Journal Article Mellor, N. L., Band, L. R., Pěnčík, A., Novak, O., Rashed, A., Holman, T., Wilson, M. H., Voss, U., Bishopp, A., King, J. R., Ljung, K., Bennett, M. J., & Owen, M. R. (2016). Dynamic regulation of auxin oxidase and conjugating enzymes AtDAO1 and GH3 modulates auxin homeostasis. Proceedings of the National Academy of Sciences, 113(39), 11022-11027. https://doi.org/10.1073/pnas.1604458113 Auxin is a key hormone regulating plant growth and development. We combine experiments and mathematical modeling to reveal how auxin levels are maintained via feedback regulation of genes encoding key metabolic enzymes. We describe how regulation of... Read More about Dynamic regulation of auxin oxidase and conjugating enzymes AtDAO1 and GH3 modulates auxin homeostasis. The spatiotemporal order of signaling events unveils the logic of development signaling (2016) Journal Article Zhu, H., Owen, M. R., & Mao, Y. (in press). The spatiotemporal order of signaling events unveils the logic of development signaling. Bioinformatics, 32(15), https://doi.org/10.1093/bioinformatics/btw121 Motivation: Animals from worms and insects to birds and mammals show distinct body plans; however, the embryonic development of diverse body plans with tissues and organs within is controlled by a surprisingly few signaling pathways. It is well recog... Read More about The spatiotemporal order of signaling events unveils the logic of development signaling. Showing 1 - 20 of 35 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}