{
    "url": "https://www.nottingham.ac.uk/mathematics/people/simon.preston",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR FACULTIES, SCHOOLS & GROUPS Optimising experimental designs for model selection of ion channel drug binding mechanisms (2024) Preprint / Working Paper Patten-Elliott, F., Lei, C. L., Preston, S. P., Wilkinson, R. D., & Mirams, G. R. Optimising experimental designs for model selection of ion channel drug binding mechanisms The rapid delayed rectifier current carried by the human Ether-à-go-go-Related Gene (hERG) channel is susceptible to drug-induced reduction which can lead to an increased risk of cardiac arrhythmia. Establishing the mechanism by which a specific drug... Read More about Optimising experimental designs for model selection of ion channel drug binding mechanisms. Evaluating the predictive accuracy of ion channel models using data from multiple experimental designs (2024) Preprint / Working Paper Shuttleworth, J. G., Lei, C. L., Windley, M. J., Hill, A. P., Preston, S. P., & Mirams, G. R. Evaluating the predictive accuracy of ion channel models using data from multiple experimental designs Mathematical models are increasingly being relied upon to provide quantitatively accurate predictions of cardiac electrophysiology. Many such models concern the behaviour of particular subcellular components (namely, ion channels) which, together, al... Read More about Evaluating the predictive accuracy of ion channel models using data from multiple experimental designs. Modelling the role of enzymatic pathways in the metabolism of docosahexaenoic acid by monocytes and its association with osteoarthritic pain (2024) Journal Article Franks, S. J., Gowler, P. R., Dunster, J. L., Turnbull, J., Gohir, S. A., Kelly, A., Valdes, A. M., King, J. R., Barrett, D. A., Chapman, V., & Preston, S. (2024). Modelling the role of enzymatic pathways in the metabolism of docosahexaenoic acid by monocytes and its association with osteoarthritic pain. Mathematical Biosciences, 374, Article 109228. https://doi.org/10.1016/j.mbs.2024.109228 Chronic pain is a major cause of disability and suffering in osteoarthritis (OA) patients. Endogenous specialised pro-resolving molecules (SPMs) curtail pro-inflammatory responses. One of the SPM intermediate oxylipins, 17-hydroxydocasahexaenoic acid... Read More about Modelling the role of enzymatic pathways in the metabolism of docosahexaenoic acid by monocytes and its association with osteoarthritic pain. Empirical Quantification of Predictive Uncertainty Due to Model Discrepancy by Training with an Ensemble of Experimental Designs: An Application to Ion Channel Kinetics (2023) Journal Article Shuttleworth, J. G., Lei, C. L., Whittaker, D. G., Windley, M. J., Hill, A. P., Preston, S. P., & Mirams, G. R. (2024). Empirical Quantification of Predictive Uncertainty Due to Model Discrepancy by Training with an Ensemble of Experimental Designs: An Application to Ion Channel Kinetics. Bulletin of Mathematical Biology, 86(1), Article 2. https://doi.org/10.1007/s11538-023-01224-6 When using mathematical models to make quantitative predictions for clinical or industrial use, it is important that predictions come with a reliable estimate of their accuracy (uncertainty quantification). Because models of complex biological system... Read More about Empirical Quantification of Predictive Uncertainty Due to Model Discrepancy by Training with an Ensemble of Experimental Designs: An Application to Ion Channel Kinetics. Using many different voltage protocols to characterise discrepancy in mathematical ion channel models (2023) Journal Article Shuttleworth, J. G., Lok Lei, C., Windley, M., Hill, A. P., Perry, M. D., Preston, S., & Mirams, G. R. (2023). Using many different voltage protocols to characterise discrepancy in mathematical ion channel models. Biophysical Journal, 122(3, Suppl. 1), 242a. https://doi.org/10.1016/j.bpj.2022.11.1415 The Kv11.1 protein encoded by the hERG gene forms the primary subunit of a voltage-sensitive ion channel responsible for IKr in cardiomyocytes. Mathematical models of the macroscopic current are fitted to data from patch-clamp experiments - in which... Read More about Using many different voltage protocols to characterise discrepancy in mathematical ion channel models. Uncertainty and error in SARS-CoV-2 epidemiological parameters inferred from population-level epidemic models (2022) Journal Article Whittaker, D. G., Herrera-Reyes, A. D., Hendrix, M., Owen, M. R., Band, L. R., Mirams, G. R., Bolton, K. J., & Preston, S. P. (2023). Uncertainty and error in SARS-CoV-2 epidemiological parameters inferred from population-level epidemic models. Journal of Theoretical Biology, 558, Article 111337. https://doi.org/10.1016/j.jtbi.2022.111337 During the SARS-CoV2 pandemic, epidemic models have been central to policy-making. Public health responses have been shaped by model-based projections and inferences, especially related to the impact of various non-pharmaceutical interventions. Accom... Read More about Uncertainty and error in SARS-CoV-2 epidemiological parameters inferred from population-level epidemic models. Modelling reveals post-transcriptional regulation of GA metabolism enzymes in response to drought and cold (2022) Journal Article Band, L. R., Nelissen, H., Preston, S. P., Rymen, B., Prinsen, E., Abd Elgawad, H., & Beemster, G. T. S. (2022). Modelling reveals post-transcriptional regulation of GA metabolism enzymes in response to drought and cold. Proceedings of the National Academy of Sciences, 119(31), Article e2121288119. https://doi.org/10.1073/pnas.2121288119 The hormone gibberellin (GA) controls plant growth and regulates growth responses to environmental stress. In monocotyledonous leaves, GA controls growth by regulating division-zone size. We used a systems approach to investigate the establishment of... Read More about Modelling reveals post-transcriptional regulation of GA metabolism enzymes in response to drought and cold. Manifold valued data analysis of samples of networks, with applications in corpus linguistics (2022) Journal Article Severn, K. E., Dryden, I. L., & Preston, S. P. (2022). Manifold valued data analysis of samples of networks, with applications in corpus linguistics. Annals of Applied Statistics, 16(1), 368-390. https://doi.org/10.1214/21-aoas1480 Networks arise in many applications, such as in the analysis of text documents, social interactions and brain activity. We develop a general framework for extrinsic statistical analysis of samples of networks, motivated by networks representing text... Read More about Manifold valued data analysis of samples of networks, with applications in corpus linguistics. The Bayesian Spatial Bradley–Terry model: Urban deprivation modelling in Tanzania (2022) Journal Article Seymour, R. G., Sirl, D., Preston, S. P., Dryden, I. L., Ellis, M. J., Perrat, B., & Goulding, J. (2022). The Bayesian Spatial Bradley–Terry model: Urban deprivation modelling in Tanzania. Journal of the Royal Statistical Society: Series C, 71(2), 288-308. https://doi.org/10.1111/rssc.12532 Identifying the most deprived regions of any country or city is key if policy makers are to design successful interventions. However, locating areas with the greatest need is often surprisingly challenging in developing countries. Due to the logistic... Read More about The Bayesian Spatial Bradley–Terry model: Urban deprivation modelling in Tanzania. Gaussian Process Models of Potential Energy Surfaces with Boundary Optimisation (2021) Journal Article Broad, J., Preston, S., Wheatley, R. J., & Graham, R. S. (2021). Gaussian Process Models of Potential Energy Surfaces with Boundary Optimisation. Journal of Chemical Physics, 155(14), Article 144106. https://doi.org/10.1063/5.0063534 A strategy is outlined to reduce the number of training points required to model intermolecular potentials using Gaussian processes, without reducing accuracy. An asymptotic function is used at long range and the cross-over distance between this mode... Read More about Gaussian Process Models of Potential Energy Surfaces with Boundary Optimisation. Gaussian process models of potential energy surfaces with boundary optimization (2021) Journal Article Broad, J., Preston, S., Wheatley, R. J., & Graham, R. S. (2021). Gaussian process models of potential energy surfaces with boundary optimization. Journal of Chemical Physics, 155(14), Article 144106. https://doi.org/10.1063/5.0063534 A strategy is outlined to reduce the number of training points required to model intermolecular potentials using Gaussian processes, without reducing accuracy. An asymptotic function is used at a long range, and the crossover distance between this mo... Read More about Gaussian process models of potential energy surfaces with boundary optimization. Approximate Maximum Likelihood Estimation for One-Dimensional Diffusions Observed on a Fine Grid (2021) Journal Article Lu, K. W., Paine, P. J., Preston, S. P., & Wood, A. T. A. (2022). Approximate Maximum Likelihood Estimation for One-Dimensional Diffusions Observed on a Fine Grid. Scandinavian Journal of Statistics, 49(3), 1085-1114. https://doi.org/10.1111/sjos.12556 We consider a one-dimensional stochastic differential equation that is observed on a fine grid of equally spaced time points. A novel approach for approximating the transition density of the stochastic differential equation is presented, which is bas... Read More about Approximate Maximum Likelihood Estimation for One-Dimensional Diffusions Observed on a Fine Grid. Non‐parametric regression for networks (2021) Journal Article Severn, K. E., Dryden, I. L., & Preston, S. P. (2021). Non‐parametric regression for networks. Stat, 10(1), Article e373. https://doi.org/10.1002/sta4.373 Network data are becoming increasingly available, and so there is a need to develop suitable methodology for statistical analysis. Networks can be represented as graph Laplacian matrices, which are a type of manifold-valued data. Our main objective i... Read More about Non‐parametric regression for networks. Positioning the Root Elongation Zone Is Saltatory and Receives Input from the Shoot (2020) Journal Article Baskin, T. I., Preston, S., Zelinsky, E., Yang, X., Elmali, M., Bellos, D., Wells, D. M., & Bennett, M. J. (2020). Positioning the Root Elongation Zone Is Saltatory and Receives Input from the Shoot. iScience, 23(7), Article 101309. https://doi.org/10.1016/j.isci.2020.101309 In the root, meristem and elongation zone lengths remain stable, despite growth and division of cells. To gain insight into zone stability, we imaged individual Arabidopsis thaliana roots through a horizontal microscope, and used image analysis to ob... Read More about Positioning the Root Elongation Zone Is Saltatory and Receives Input from the Shoot. Invariance and identifiability issues for word embeddings (2019) Presentation / Conference Contribution Carrington, R., Bharath, K., & Preston, S. (2019, December). Invariance and identifiability issues for word embeddings. Presented at NeurIPS 2019, Vancouver, Canada Word embeddings are commonly obtained as optimisers of a criterion function f of 1 a text corpus, but assessed on word-task performance using a different evaluation 2 function g of the test data. We contend that a possible source of disparity in 3 pe... Read More about Invariance and identifiability issues for word embeddings. Discussion: Object-Oriented Data Analysis, Power Metrics, and Graph Laplacians (2019) Journal Article Severn, K. E., Dryden, I. L., Preston, S. P., & Severn, K. E. (2019). Discussion: Object-Oriented Data Analysis, Power Metrics, and Graph Laplacians. Journal of the American Statistical Association, 114(527), 1097-1098. https://doi.org/10.1080/01621459.2019.1635477 Lacunarity of the zero crossings of Gaussian processes (2019) Journal Article Ogunshemi, A., Hopcraft, K. I., & Preston, S. P. (2019). Lacunarity of the zero crossings of Gaussian processes. Physical Review E, 99(6), Article 062109. https://doi.org/10.1103/physreve.99.062109 A lacunarity analysis of the zero-crossings derived from Gaussian stochastic processes with oscillatory autocorrelation functions is evaluated and reveals distinct multi-scaling signatures depending on the smoothness and degree of anti-correlation of... Read More about Lacunarity of the zero crossings of Gaussian processes. Spherical regression models with general covariates and anisotropic errors (2019) Journal Article Paine, P. J., Preston, S. P., Tsagris, M., & Wood, A. T. A. (2020). Spherical regression models with general covariates and anisotropic errors. Statistics and Computing, 30(1), 153–165. https://doi.org/10.1007/s11222-019-09872-2 Existing parametric regression models in the literature for response data on the unit sphere assume that the covariates have particularly simple structure, for example that they are either scalar or are themselves on the unit sphere, and/or that the... Read More about Spherical regression models with general covariates and anisotropic errors. Quantifying age and model uncertainties in palaeoclimate data and dynamical climate models with a joint inferential analysis (2019) Journal Article Carson, J., Crucifix, M., Preston, S., & Wilkinson, R. (2019). Quantifying age and model uncertainties in palaeoclimate data and dynamical climate models with a joint inferential analysis. Proceedings of the Royal Society A: Mathematical, Physical and Engineering Sciences, 475(2224), https://doi.org/10.1098/rspa.2018.0854 The study of palaeoclimates relies on information sampled in natural archives such as deep sea cores. Scientific investigations often use such information in multi- stage analyses, typically with an age model being fitted to a core to convert depths... Read More about Quantifying age and model uncertainties in palaeoclimate data and dynamical climate models with a joint inferential analysis. Parameter inference to motivate asymptotic model reduction: an analysis of the gibberellin biosynthesis pathway (2018) Journal Article Band, L. R., & Preston, S. P. (2018). Parameter inference to motivate asymptotic model reduction: an analysis of the gibberellin biosynthesis pathway. Journal of Theoretical Biology, 457, 66-78. https://doi.org/10.1016/j.jtbi.2018.05.028 Developing effective strategies to use models in conjunction with experimental data is essential to understand the dynamics of biological regulatory networks. In this study, we demonstrate how combining parameter estimation with asymptotic analysis c... Read More about Parameter inference to motivate asymptotic model reduction: an analysis of the gibberellin biosynthesis pathway. Showing 1 - 20 of 39 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}