{
    "url": "https://www.nottingham.ac.uk/medicine/about/units-and-platforms/education-centre/index.aspx",
    "content": [
        {
            "p": "We are the leadership and organisational hub for all undergraduate, post-graduate taught, and post-graduate research activity in the School of Medicine. In partnership with a team of senior academics and professional services staff, we ensure that the teaching delivered is of high quality and that students have a good and fulfilling experience. Embarking on higher education, whether at the undergraduate or postgraduate level, is a transformative experience. It equips students with the skills and knowledge they need to make a difference to not only their lives but to the lives of other people. Within the School of Medicine, we prepare our students for working in industry, academia and as professional medical doctors, ready to alleviate suffering and improve the health and well-being of those around us. As one of the largest schools of medical education in the UK, we are proud of the diversity and astonishing achievements of our student body. Our mission is to develop them as the pioneers and leaders of the future, equipping them with the critical scientific thinking and excellent communication skills they need to be successful. At the undergraduate level, we offer courses in Cancer Sciences and Medical Physiology and Therapeutics as well as Medicine, with three separate entry points including a foundation year (6 year programme), standard entry (5 year programme) and graduate entry (4 year programme). We also offer postgraduate Masters level qualifications in Medical Education, developing a skilled workforce of educators equipped to meet the challenges of training professional and accomplished doctors to meet the demands of the NHS. We also support the other academic units to deliver postgraduate taught courses. These provide students with opportunities to further develop their critical thinking and professional skills, to explore subjects in-depth with world-leading experts in the field and to become confident in the skills needed for the workplace. Finally, we support a highly motivated group of postgraduate PhD research students to become experts in their chosen field of study. We equip them with the skills required to push boundaries, to ask and answer difficult questions and to become the research leaders of the future. Discover our research Discover our people Contacts: Call 0115 823 0031 ext.30031 or please see our 'contact us' page for further details"
        }
    ],
    "pdf_files": []
}