{
    "url": "https://www.nottingham.ac.uk/medicine/people/nikos.evangelou",
    "content": [
        {
            "p": "Clinical Professor of Neurology, Faculty of Medicine & Health Sciences I did my undergraduate studies in Greece and the UK and trained as a Neurologist in Oxford and Nottingham. I gained my DPhil in Oxford studying axonal damage in MS with MRI and histopathology. Since 2003, I have been a Consultant Neurologist at Nottingham University Hospital. In 2012 I became clinical lead for the department of Neurology, at the Nottingham University Hospital. In 2011, I joined the University as a Clinical Associate Professor in Neurology and was appointed as a Clinical Professor of Neurology in 2023. I lead a translational group of clinicians and scientists aiming to better understand the pathophysiology of Multiple Sclerosis. I have participated in most major clinical trials in MS. Clinically, I run regular general neurology clinics, but my clinical expertise lies in Multiple Sclerosis and headache management. My team is interested in clinical trials in MS and I am the Co-Principle Investigator of a large grant to compare in many sites in the UK and USA escalation vs. highly effective treatment in MS. https://www.pcori.org/research-results/2017/determining-effectiveness-early-intensive-versus-escalation-approaches Our current MRI research focuses in facilitating the early recognition of demyelinating disorders and quick diagnosis of MS through the demonstration of the pathogenic central vein in demyelinating lesions. We work on 3T and 7T MRI scanners at the medical school and SPMMR centre. We are currently running DECISIVE, an NIHR funded multicentre trial, comparing the central vein with oligoclonal bands. In addition, we study remyelination in the grey and white matter in vivo using mainly high resolution MTR imaging. Working with academic neuropsychologists and with the help of the NIHR, we also run a programme grant (NEUROMS) where we try to understand how best to screen for cognitive deficits in MS. Part of my team is working with NHSEngland and the UK MS Registry, examining how COVID has affected patients with MS. Current supervisor for 7 PhD students BMedsci homebase join coordinator for Clinical Neuroscience and Psychiatry Clinical trials DELIVER MS : https://www.pcori.org/research-results/2017/determining-effectiveness-early-intensive-versus-escalation-approaches I am also participating in a number of commercial and non-commercial trials as principle investigator in Nottingham. Neuroimaging Investigations trying to understand brain disorders (MS and brain injury) and symptoms (cognition impairment, fatigue) through MRI and clinical trials including: Central veins in MS diagnosis https://clinicaltrials.gov/ct2/show/NCT04024969 The Role of MEG in Assessment and Diagnosis In mTBI (MEGAbIT) https://clinicaltrials.gov/ct2/show/NCT03867513 Neuropsychology of MS Intervention to support individuals around the point of Multiple Sclerosis diagnosis MS society, a study supported by the MS society. https://clinicaltrials.gov/ct2/show/NCT03735056 Member of the research team of NEUROMS, an NIHR programme grant for the neuropsychological evaluation and rehabilitation in Multiple sclerosis https://neuroms.org/ Contacts: Call 0115 823 0031 ext.30031 or please see our 'contact us' page for further details"
        }
    ],
    "pdf_files": []
}