{
    "url": "http://www.nottingham.ac.uk/medicine/people/david.walsh",
    "content": [
        {
            "p": "Director, Pain Centre Versus Arthritis, Faculty of Medicine & Health Sciences David Walsh is Professor of Rheumatology at the University of Nottingham and Consultant Rheumatologist at Sherwood Forest Hospitals NHS Foundation Trust. In 2010 he established the Arthritis Research UK Pain Centre in Nottingham, together with a multidisciplinary research team which includes preclinical neurosciences, psychology, neuroimaging, orthopaedics, genetics, epidemiology and evidence synthesis. The Centre aims to develop new and improved treatments through a translational research programme into the mechanisms by which changes within the joint and in the nervous system interact with psychosocial factors to produce arthritis pain. His preclinical research has focused on structural changes that contribute to joint pain, in particular angiogenesis, nerve growth, inflammation and matrix turnover in the synovium and subchondral bone. His clinical research is defining the spectrum of pain phenotypes in people with arthritis based on underlying pain mechanisms, in order to better target treatments to those most likely to benefit. In 2017 he became the first lead for the Musculoskeletal Theme at the launch of the NIHR Nottingham Biomedical Research Centre and represents Nottingham on the NIHR musculoskeletal Translational Research Collaboration. He was a member of the Guideline Development Group for NICE guidelines on the management of low back pain and sciatica, and continues clinical practice in rheumatology and low back pain. Director of the Arthritis Research UK Pain Centre. A programme of laboratory research complements other activities within Academic Rheumatology, exploring the interdependance of pain and neurovascular plasticity in joint disease. The group uses a range of molecular, histomorphometric and pharmacological techniques to characterise the nature, causes and consequences of blood vessel and nerve growth in the joint's synovial lining, bone and cartilage. Contacts: Call 0115 823 0031 ext.30031 or please see our 'contact us' page for further details"
        }
    ],
    "pdf_files": []
}