{
    "url": "http://www.nottingham.ac.uk/nursing/",
    "content": [
        {
            "p": "Are you looking for a rewarding journey that will shape your future and impact the lives of others? Let's build a future where you, as a nursing professional, can bring hope, healing, and comfort to those in need. Our course prepares you to succeed as a confident and compassionate nurse, making a positive impact on patients and the healthcare community. Through expert teaching and supportive supervision, you will learn how to attend to adult patients' healthcare needs while also focusing on their overall well-being. Our programme nurtures your creativity, critical judgement, and leadership abilities, enabling you to develop essential clinical skills. By the end of the course, you'll have the confidence and competence to excel in your nursing career. You’ll be prepared to face the challenges of being a practising nurse or a healthcare leader. Joint 4th in the UK and 38th in the world for Nursing (QS University World Rankings by Subject 2024) One of only 2 UK nursing courses to offer an optional module choice Wide range of optional modules: choose from diverse modules like Pain and cardiac care, Cancer Care, and Neonatal Nursing. Integrated and interprofessional learning with other care students and academics. Practical learning in a major UK hospital: learn at the largest teaching hospital outside London, with a major trauma unit and MAGNET recognition. Nursing and Midwifery Council (NMC) registration: Outstanding graduate employability: 97.9% of our undergraduates secure graduate-level employment or further study within 15 months of graduation* Student and staff awards: student nursing times 2023: Shortlisted for ‘Student Nurse of the Year: Adult 2022: Shortlisted for ‘Student Nurse of the Year: Adult’ and ‘Outstanding Contribution to Student Affairs’ 2021: Shortlisted for ‘Teaching Innovation of the Year’ and ‘Student Nurse of the Year: Children’ Adult Nursing student, Sonia, talks about what made her choose Adult Nursing, how she's met friends for life, her favourite placements so far and the support she has received studying at the University of Nottingham. *HESA Graduate Outcomes 2020. The Graduate Outcomes % is derived using The Guardian University Guide methodology."
        }
    ],
    "pdf_files": []
}