{
    "url": "https://www.nottingham.ac.uk/paincentre/people/weiya.zhang",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR FACULTIES, SCHOOLS & GROUPS Cohort Profile: The Xiangya Osteoarthritis (XO) Study (2024) Journal Article Li, J., Yang, T., Zhang, Y., Zhang, W., Doherty, M., Xie, J., Wang, Y., Jiang, T., Xie, D., Li, H., Yang, Z., Li, X., Li, W., Xu, B., Zhu, Z., Wang, Y., Weng, Q., Liu, K., Yang, Y., Xu, J., …Lei, G. (2024). Cohort Profile: The Xiangya Osteoarthritis (XO) Study. International Journal of Epidemiology, 53(6), Article dyae156. https://doi.org/10.1093/ije/dyae156 Comparative effectiveness of different placebos and comparator groups for hand osteoarthritis exploring the impact of contextual factors: A systematic review and meta-analysis of randomised trials (2024) Journal Article Balsby, I. M., Nielsen, S. M., Christensen, R., Henriksen, M., Dahl, L. U.-M., Berg, J. I., Tarp, S., Kroon, F., Kloppenburg, M., Zhang, W., Hunter, D. J., Bliddal, H., & Døssing, A. (2024). Comparative effectiveness of different placebos and comparator groups for hand osteoarthritis exploring the impact of contextual factors: A systematic review and meta-analysis of randomised trials. Osteoarthritis and Cartilage, 32(7), 848-857. https://doi.org/10.1016/j.joca.2024.02.947 Objective: To examine the pain relief effects of comparators (placebos and untreated control groups) in hand osteoarthritis trials and the impact of contextual factors. Methods: We systematically searched PubMed, EMBASE and CENTRAL from inception to... Read More about Comparative effectiveness of different placebos and comparator groups for hand osteoarthritis exploring the impact of contextual factors: A systematic review and meta-analysis of randomised trials. Serum levels of hydroxylated metabolites of arachidonic acid cross-sectionally and longitudinally predict knee pain progression: an observational cohort study (2024) Journal Article Turnbull, J., Jha, R. R., Gowler, P. R., Ferrands-Bentley, R., Kim, D.-H., Barrett, D. A., Sarmanova, A., Fernandes, G. S., Doherty, M., Zhang, W., Walsh, D. A., Valdes, A. M., & Chapman, V. (2024). Serum levels of hydroxylated metabolites of arachidonic acid cross-sectionally and longitudinally predict knee pain progression: an observational cohort study. Osteoarthritis and Cartilage, 32(8), 990-1000. https://doi.org/10.1016/j.joca.2024.04.006 Objective: To examine associations between serum oxylipins, which regulate tissue repair and pain signalling, and knee pain/radiographic osteoarthritis (OA) at baseline and knee pain at 3 year follow-up. Method: Baseline, and 3 year follow-up, kne... Read More about Serum levels of hydroxylated metabolites of arachidonic acid cross-sectionally and longitudinally predict knee pain progression: an observational cohort study. Association Between Hyperuricemia and Ultrasound-Detected Hand Synovitis (2024) Journal Article Jiang, T., Weng, Q., Zhang, Y., Zhang, W., Doherty, M., Sarmanova, A., Yang, Z., Yang, T., Li, J., Liu, K., Wang, Y., Obotiba, A. D., Zeng, C., Lei, G., & Wei, J. (2024). Association Between Hyperuricemia and Ultrasound-Detected Hand Synovitis. Arthritis Care and Research, 76(8), 1187-1194. https://doi.org/10.1002/acr.25342 Objective Although hand synovitis is prevalent in the older population, the etiology remains unclear. Hyperuricemia, a modifiable metabolic disorder, may serve as an underlying mechanism of hand synovitis, but little is known about their relationshi... Read More about Association Between Hyperuricemia and Ultrasound-Detected Hand Synovitis. Melatonin is a potential novel analgesic agent for osteoarthritis: Evidence from cohort studies in humans and preclinical research in rats (2024) Journal Article Li, H., Zhou, B., Wu, J., Zhang, Y., Zhang, W., Doherty, M., Deng, X., Wang, N., Xie, D., Wang, Y., Xie, H., Li, C., Wei, J., Lei, G., & Zeng, C. (2024). Melatonin is a potential novel analgesic agent for osteoarthritis: Evidence from cohort studies in humans and preclinical research in rats. Journal of Pineal Research, 76(2), Article e12945. https://doi.org/10.1111/jpi.12945 Melatonin exhibits potential for pain relief and long-term safety profile. We examined the analgesic effects of oral melatonin on osteoarthritis (OA) and investigated the underlying mechanism. Using data from a UK primary care database, we conducted... Read More about Melatonin is a potential novel analgesic agent for osteoarthritis: Evidence from cohort studies in humans and preclinical research in rats. Gut-joint axis in knee synovitis: gut fungal dysbiosis and altered fungi–bacteria correlation network identified in a community-based study (2023) Journal Article Jiang, T., Liu, K., Li, J., Zhang, Y., Zhang, W., Doherty, M., Yang, Z., Yang, T., Yang, Y., Weng, Q., Luo, X., Xie, H., Li, C., Ai, K., Wei, J., Lei, G., & Zeng, C. (2023). Gut-joint axis in knee synovitis: gut fungal dysbiosis and altered fungi–bacteria correlation network identified in a community-based study. RMD Open, 9(4), Article e003529. https://doi.org/10.1136/rmdopen-2023-003529 Objectives: Knee synovitis is a highly prevalent and potentially curable condition for knee pain; however, its pathogenesis remains unclear. We sought to assess the associations of the gut fungal microbiota and the fungi–bacteria correlation network... Read More about Gut-joint axis in knee synovitis: gut fungal dysbiosis and altered fungi–bacteria correlation network identified in a community-based study. Association between hyperuricaemia and hand osteoarthritis: data from the Xiangya Osteoarthritis Study (2023) Journal Article Zhu, Y., Li, J., Zhang, Y., Zhang, W., Doherty, M., Yang, Z., Cui, Y., Zeng, C., Lei, G., Yang, T., & Wei, J. (2023). Association between hyperuricaemia and hand osteoarthritis: data from the Xiangya Osteoarthritis Study. RMD Open, 9(4), Article e003683. https://doi.org/10.1136/rmdopen-2023-003683 Objective The pathogenesis of hand osteoarthritis (OA) remains unknown. Hyperuricaemia, which is related to inflammation, may play a role in hand OA, but evidence is lacking. In a large population-based study, we examined the association between hyp... Read More about Association between hyperuricaemia and hand osteoarthritis: data from the Xiangya Osteoarthritis Study. Association between gut microbiome-related metabolites and symptomatic hand osteoarthritis in two independent cohorts (2023) Journal Article Wei, J., Yang, Z., Li, J., Zhang, Y., Zhang, W., Doherty, M., Yang, T., Yang, Y., Li, H., Wang, Y., Wu, Z., Li, C., Lei, G., & Zeng, C. (2023). Association between gut microbiome-related metabolites and symptomatic hand osteoarthritis in two independent cohorts. EBioMedicine, 98, Article 104892. https://doi.org/10.1016/j.ebiom.2023.104892 Background: Since gut microbiome dysbiosis can cause inflammatory disorders by affecting host metabolism, we postulate that the gut microbiome and related metabolites could play a role in hand osteoarthritis. We characterised gut microbiome-related m... Read More about Association between gut microbiome-related metabolites and symptomatic hand osteoarthritis in two independent cohorts. Causal association between subtypes of osteoarthritis and common comorbidities: A Mendelian randomisation study (2023) Journal Article Thompson, W., Swain, S., Zhao, S. S., Kamps, A., Coupland, C., Kuo, C., Bierma-Zeinstra, S., Runhaar, J., Doherty, M., & Zhang, W. (2023). Causal association between subtypes of osteoarthritis and common comorbidities: A Mendelian randomisation study. Osteoarthritis and Cartilage Open, 5(4), Article 100414. https://doi.org/10.1016/j.ocarto.2023.100414 Objective To investigate the causal association between Osteoarthritis (OA) and five comorbidities: depression, tiredness, multisite chronic pain, irritable bowel syndrome (IBS) and gout.... Read More about Causal association between subtypes of osteoarthritis and common comorbidities: A Mendelian randomisation study. Associations of Muscle Strength with Central Aspects of Pain: Data from the Knee Pain and Related Health in the Community (KPIC) Cohort (2023) Journal Article McWilliams, D. F., Yue, B., Smith, S. L., Stocks, J., Doherty, M., Valdes, A. M., Zhang, W., Sarmanova, A., Fernandes, G. S., Akin-Akinyosoye, K., Hall, M., & Walsh, D. A. (2023). Associations of Muscle Strength with Central Aspects of Pain: Data from the Knee Pain and Related Health in the Community (KPIC) Cohort. Journal of Personalized Medicine, 13(10), Article 1450. https://doi.org/10.3390/jpm13101450 Knee pain is associated with lower muscle strength, and both contribute to disability. Peripheral and central neurological mechanisms contribute to OA pain. Understanding the relative contributions of pain mechanisms to muscle strength might help fut... Read More about Associations of Muscle Strength with Central Aspects of Pain: Data from the Knee Pain and Related Health in the Community (KPIC) Cohort. Heading Frequency and Risk of Cognitive Impairment in Retired Male Professional Soccer Players (2023) Journal Article Espahbodi, S., Hogervorst, E., Macnab, T.-M. P., Thanoon, A., Fernandes, G. S., Millar, B., Duncan, A., Goodwin, M., Batt, M., Fuller, C. W., Fuller, G., Ferguson, E., Bast, T., Doherty, M., & Zhang, W. (2023). Heading Frequency and Risk of Cognitive Impairment in Retired Male Professional Soccer Players. JAMA Network Open, 6(7), Article e2323822. https://doi.org/10.1001/jamanetworkopen.2023.23822 Importance Although professional soccer players appear to be at higher risk of neurodegenerative disease, the reason remains unknown. Objective To examine whether heading frequency is associated with risk of cognitive impairment in retired profe... Read More about Heading Frequency and Risk of Cognitive Impairment in Retired Male Professional Soccer Players. Healthcare utilisation and mortality in people with osteoarthritis in the UK: findings from a national primary care database. (2023) Journal Article Swain, S., Coupland, C., Sarmanova, A., Kuo, C. F., Mallen, C., Doherty, M., & Zhang, W. (2023). Healthcare utilisation and mortality in people with osteoarthritis in the UK: findings from a national primary care database. British Journal of General Practice, 73(733), e615-e622. https://doi.org/10.3399/BJGP.2022.0419 Background The burden of osteoarthritis (OA) in UK primary care has not been investigated thoroughly. Aim To estimate healthcare use and mortality in people with OA (overall and joint specific). Design and setting A matched cohort study of adul... Read More about Healthcare utilisation and mortality in people with osteoarthritis in the UK: findings from a national primary care database.. Comorbidity in incident osteoarthritis cases and matched controls using electronic health record data (2023) Journal Article Kamps, A., Runhaar, J., de Ridder, M. A., de Wilde, M., van der Lei, J., Zhang, W., Prieto-Alhambra, D., Englund, M., de Schepper, E. I., & Bierma-Zeinstra, S. M. (2023). Comorbidity in incident osteoarthritis cases and matched controls using electronic health record data. Arthritis Research and Therapy, 25(1), Article 114. https://doi.org/10.1186/s13075-023-03086-8 Background: Comorbidities are common in patients with osteoarthritis (OA). This study aimed to determine the association of a wide range of previously diagnosed comorbidities in adults with newly diagnosed OA compared with matched controls without OA... Read More about Comorbidity in incident osteoarthritis cases and matched controls using electronic health record data. Cognitive Impairment and Self-Reported Dementia in UK Retired Professional Soccer Players: A Cross Sectional Comparative Study (2023) Journal Article Macnab, T.-M. P., Espahbodi, S., Hogervorst, E., Thanoon, A., Fernandes, G. S., Millar, B., Duncan, A., Goodwin, M., Batt, M., Fuller, C. W., Fuller, G., Ferguson, E., Bast, T., Doherty, M., & Zhang, W. (2023). Cognitive Impairment and Self-Reported Dementia in UK Retired Professional Soccer Players: A Cross Sectional Comparative Study. Sports Medicine - Open, 9, Article 43. https://doi.org/10.1186/s40798-023-00588-2 Background Previous studies based on death certificates have found professional soccer players were more likely to die with neurodegenerative diseases, including dementia. Therefore, this study aimed to investigate whether retired professional male... Read More about Cognitive Impairment and Self-Reported Dementia in UK Retired Professional Soccer Players: A Cross Sectional Comparative Study. Serum Metabolome Analysis Identified Amino-Acid Metabolism Associated With Pain in People With Symptomatic Knee Osteoarthritis – A Cross-Sectional Study (2023) Journal Article Mehta, O., Vijay, A., Gohir, S. A., Kelly, T., Zhang, W., Doherty, M., Walsh, D. A., Aithal, G., & Valdes, A. M. (2023). Serum Metabolome Analysis Identified Amino-Acid Metabolism Associated With Pain in People With Symptomatic Knee Osteoarthritis – A Cross-Sectional Study. Journal of Pain, https://doi.org/10.1016/j.jpain.2023.02.023 Osteoarthritis (OA) is the most common arthritis affecting synovial joints such as knees and hips of millions of people globally. Usage-related joint pain and reduced function are the most common symptoms experienced by people with OA. To improve pai... Read More about Serum Metabolome Analysis Identified Amino-Acid Metabolism Associated With Pain in People With Symptomatic Knee Osteoarthritis – A Cross-Sectional Study. How people with knee pain understand why their pain changes or remains the same over time: A qualitative study (2023) Journal Article Walsh, D. A., Rathbone, J., Akin-Akinyosoye, K., Fernandes, G. S., Valdes, A. M., McWilliams, D. F., Zhang, W., Doherty, M., Hancox, J. E., Vedhara, K., das Nair, R., & Ferguson, E. (2023). How people with knee pain understand why their pain changes or remains the same over time: A qualitative study. Osteoarthritis and Cartilage Open, 5(2), Article 100345. https://doi.org/10.1016/j.ocarto.2023.100345 Objectives Guidelines recommend knee osteoarthritis pain management based on biopsychosocial mechanisms. Treatment adherence and effectiveness may be affected if there is a mismatch between patient perspectives and treatment focus. We therefore exam... Read More about How people with knee pain understand why their pain changes or remains the same over time: A qualitative study. Classification of patients with osteoarthritis through clusters of comorbidities using 633 330 individuals from Spain (2023) Journal Article Pineda-Moncusí, M., Dernie, F., Dell’Isola, A., Kamps, A., Runhaar, J., Swain, S., Zhang, W., Englund, M., Pitsillidou, I., Strauss, V. Y., Robinson, D. E., Prieto-Alhambra, D., & Khalid, S. (2023). Classification of patients with osteoarthritis through clusters of comorbidities using 633 330 individuals from Spain. Rheumatology, 62(11), 3592-3600. https://doi.org/10.1093/rheumatology/kead038 To explore clustering of comorbidities among patients with a new diagnosis of osteoarthritis (OA) and estimate the 10-year mortality risk for each identified cluster. This is a population-based cohort study of individuals with first incident diagnosi... Read More about Classification of patients with osteoarthritis through clusters of comorbidities using 633 330 individuals from Spain. Reply on: International, multidisciplinary Delphi consensus recommendations on non-pharmacological interventions for fibromyalgia (2023) Journal Article Kundakci, B., Hall, M., Atzeni, F., Branco, J., Buskila, D., Clauw, D., Crofford, L. J., Fitzcharles, M. A., Georgopoulos, V., Gerwin, R. D., Kosek, E., Macfarlane, G. J., Neal, C., Rudin, N. J., Ryan, S., da Silva, J. A., Taylor, A. M., Turk, D. C., Whibley, D., Doherty, M., …Abhishek, A. (2023). Reply on: International, multidisciplinary Delphi consensus recommendations on non-pharmacological interventions for fibromyalgia. Seminars in Arthritis and Rheumatism, 59, Article 152162. https://doi.org/10.1016/j.semarthrit.2023.152162 Comparative efficacy of exercise therapy and oral non-steroidal anti-inflammatory drugs and paracetamol for knee or hip osteoarthritis: a network meta-analysis of randomised controlled trials (2023) Journal Article Weng, Q., Goh, S.-L., Wu, J., Persson, M. S., Wei, J., Sarmanova, A., Li, X., Hall, M., Doherty, M., Jiang, T., Zeng, C., Lei, G., & Zhang, W. (2023). Comparative efficacy of exercise therapy and oral non-steroidal anti-inflammatory drugs and paracetamol for knee or hip osteoarthritis: a network meta-analysis of randomised controlled trials. British Journal of Sports Medicine, 57(15), 990-996. https://doi.org/10.1136/bjsports-2022-105898 OBJECTIVE: Clinical guidelines recommend exercise as a core treatment for knee or hip osteoarthritis (OA). However, how its analgesic effect compares to analgesics, for example, oral non-steroidal anti-inflammatory drugs (NSAIDs) and paracetamol-the... Read More about Comparative efficacy of exercise therapy and oral non-steroidal anti-inflammatory drugs and paracetamol for knee or hip osteoarthritis: a network meta-analysis of randomised controlled trials. Occurrence of comorbidity following osteoarthritis diagnosis: a cohort study in the Netherlands (2022) Journal Article Kamps, A., Runhaar, J., de Ridder, M. A., de Wilde, M., van der Lei, J., Zhang, W., Prieto-Alhambra, D., Englund, M., de Schepper, E. I., & Bierma-Zeinstra, S. M. (2023). Occurrence of comorbidity following osteoarthritis diagnosis: a cohort study in the Netherlands. Osteoarthritis and Cartilage, 31(4), 519-528. https://doi.org/10.1016/j.joca.2022.12.003 Objective To determine the risk of comorbidity following diagnosis of knee or hip osteoarthritis (OA). Design A cohort study was conducted using the Integrated P... Read More about Occurrence of comorbidity following osteoarthritis diagnosis: a cohort study in the Netherlands. Showing 1 - 20 of 155 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}