{
    "url": "https://www.nottingham.ac.uk/paincentre/index.aspx",
    "content": [
        {
            "p": "The Pain Centre Versus Arthritis first opened in March 2010 at the University of Nottingham. It investigates the mechanisms that lead to chronic pain in order to improve the treatment of that pain. See the full list of Pain Centre members Pain Centre Versus Arthritis is engaged in a programme of linked studies investigating mechanisms and treatments for arthritis pain in the laboratory, clinic and everyday life, using a comprehensive range of modern research methodologies. Our research spans across 5 major themes; (1) Biomarkers and Novel Therapeutic Targets, (2) Nociplasticity, and (3) Neurocognitive and Psychological Function. We have built upon this increased mechanistic understanding to undertake research that will transform (4) Treatment Efficacy and Real-World Evidence, and (5) Phenotyping and Personalised Medicine. Learn more about our research themes Our resources include datasets, laboratory and clinical assessment tools, cohorts, biorepositories and much more. Details are provided of how you may access these resources for collaborative research. Learn more about our expert resources Learn more about joining the PPAG as a patient partner or requesting PPI support for your research Pain Centre Versus Arthritis organises regular meetings for our members. Our internal scientific meetings are open to all members and are an amazing training opportunity which allows our members to celebrate their research progress, receive feedback, and network with other researchers in the centre. Our external scientific meetings are open to everyone in the university and welcome both national and overseas speakers to present at the events. Senior investigators are invited to join quarterly progress meetings to reflect on the activities of the pain centre and share research updates. Journal clubs, chaired by Weiya Zhang, and Preclinical Meetings, hosted by Victoria Chapman, are another amazing opportunity to deepen your knowledge of pain conditions and mechanisms. See the Pain Centre Meetings Timetable for 2024 Find out more about some conferences we contribute to Pain Centre Versus Arthritis provides training for clinical and non-clinical scientists in research methodology relevant to pain mechanisms and treatment. Find our more on current and past PhD studentship Unfortunately, we are unable to provide clinical advice for the treatment of arthritis and would suggest you contact your doctor. Further information and support regarding arthritis can be found via the Versus Arthritis website. Please contact the Administrative Co-ordinator Tel +44(0)115 8231760 paincentre@nottingham.ac.uk Clinical Sciences Building City Hospital Nottingham, NG5 1PB telephone: +44 (0) 115 823 1766 ext 31766 fax: +44 (0) 115 823 1757 email: paincentre@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}