{
    "url": "https://www.nottingham.ac.uk/paincentre/research/research-themes.aspx",
    "content": [
        {
            "p": "Our mission is to pursue international excellence in multidisciplinary, translational research, thereby enhancing understanding of chronic pain and improving its treatment. The Centre is engaged in a programme of linked studies investigating mechanisms and treatments for arthritis pain in the laboratory, clinic and everyday life, using a comprehensive range of modern research methodologies. Our research spans across 5 major themes; (1) Biomarkers and Novel Therapeutic Targets, (2) Nociplasticity, and (3) Neurocognitive and Psychological Function. We have built upon this increased mechanistic understanding to undertake research that will transform (4) Treatment Efficacy and Real-World Evidence, and (5) Phenotyping and Personalised Medicine. Pain Centre Versus Arthritis is identifying molecular biomarkers of chronic pain through a combination of `-omics’ and targeted approaches, at the level of lipid metabolite pathways, and gene and protein expression. Our biomarker development is linked to pain assessment, in order to optimise prediction or modification of mechanisms that drive pain experience. Biomarkers are selected which reflect key pain mechanisms which might be targeted by existing or novel therapeutics with potential to improve pain. We are developing biomarkers as predictors of need for, amenability to or response to specific pain management approaches. Nociceptive mechanisms are not hard-wired, but rather change across the life course, and with time from disease onset. This nociplasticity may manifest clinically as sensitisation or endogenous analgesia, and is underpinned by changes in both peripheral and central nervous systems. Better understanding the nature, mechanisms and consequences of existing treatments is key to reducing the burden of chronic pain, before new and more effective treatments become available. Pain Centre Versus Arthritis therefore combines experimental medicine studies of existing therapies (for example studies using duloxetine, above), with systematic literature review, observational and cohort studies, and randomised controlled trials of new therapies. Findings in clinical practice may not always replicate those from the highly controlled context of clinical trials, due both to the highly selective nature of participant recruitment and outcome assessment. Better understanding the nature, mechanisms and consequences of existing treatments is key to reducing the burden of chronic pain, before new and more effective treatments become available. Pain Centre Versus Arthritis therefore combines experimental medicine studies of existing therapies (for example studies using duloxetine, above), with systematic literature review, observational and cohort studies, and randomised controlled trials of new therapies. Findings in clinical practice might not always replicate those from the highly controlled context of clinical trials, due both to the highly selective nature of participant recruitment and outcome assessment. Pain management, and its consequences in the real world are determined by more than specific analgesic mechanisms. Our research findings converge with those of others to highlight heterogeneity in pain mechanisms, outcomes and perspectives between different people with musculoskeletal pain, while recognising shared patterns between diagnostic groups. Balance between peripheral nociceptive drive and central pain modulation explains some heterogeneity in pain experience between individuals with osteoarthritis, rheumatoid arthritis or low back pain. Clinical Sciences Building City Hospital Nottingham, NG5 1PB telephone: +44 (0) 115 823 1766 ext 31766 fax: +44 (0) 115 823 1757 email: paincentre@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}