{
    "url": "https://www.nottingham.ac.uk/paincentre/centre-membership.aspx",
    "content": [
        {
            "p": "Members of the Centre are encouraged to participate in our regular series of scientific and strategic meetings. The Centre is a key component of the University of Nottingham’s clinical translational research strategy, and both the University and Nottingham University Hospitals NHS Trust strongly support the Centre’s activities and infrastructure, including patient and public engagement and involvement, staff development, and the Centre’s research agenda. Centre membership is intended to facilitate interdisciplinary and translational research of the highest quality and should be of mutual benefit to both member and the Centre. Collectively the members of the Centre are expected to contribute to sustaining the research goals of the Pain Centre Versus Arthritis via publications, presentations, grant applications and other communications. The Centre will acknowledge and publicise its member’s successes through its reports and this website. Current Centre members are: Clinical Associate Professor of Rheumatology, School of Medicine Dr Abhishek is a Clinical Associate Professor of Rheumatology at the University of Nottingham and Honorary Consultant Rheumatologist at the Nottingham University Hospitals NHS Trust since September 2014. Prior to that he was a Consultant Rheumatologist at the Cambridge University Hospitals NHS Foundation Trust for one and a half years. He completed higher specialist training in February 2013, gaining dual Certification in General Internal Medicine and Rheumatology from East Midlands Healthcare Workforce Deanery. His higher specialist training was interspersed with a PhD at Nottingham University and post-doctoral experience at The University of Birmingham. He has diverse research interests including epidemiology of rheumatic diseases, clinical studies in crystal arthritis, osteoarthritis and fibromyalgia. Over the last 3 years he has had research funding to the tune of £650,000 from Versus Arthritis, National Institute of Health Research, Rosetrees Charitable Trust, AstraZeneca, Oxford Immunotech, Nottingham University Hospitals NHS Trust Charity, and the European League Against Rheumatism. He was the lead for musculoskeletal diseases and disability (MDD) module for undergraduate medical education at the University of Nottingham. Find out more about Abhishek Abhishek Professor of Neuroimaging, Faculty of Medicine & Health Science Dorothee's current research interest is to develop imaging biomarkers in the field of Clinical Neurosciences by using advanced MRI techniques. The aims are (1) to understand the pathophysiology of diseases or complex symptoms across diseases, (2) to improve diagnostic accuracy, and (3) to predict and assess therapeutic interventions. Methods used are MR proton spectroscopy, diffusion tensor imaging, perfusion, relaxometry, high resolution carotid imaging and combined electrophysiological/functional MRI with special interst in brian connectivity analysis. The clinical applications are for prediction of risk of stroke, monitoring neurodegeneration, classification and response prediction in paediatric and adult brain cancer, and understanding the neural basis of pain and depression treatment. Find out more about Professor Dorothee Auer Professor of Analytical Bioscience, School of Pharmacy Dave's expertise are in: Metabolic profiling of biofluids and tissues, lipid analysis, metabolomics, biomarker discovery, mass spectrometry imaging. Find out more about Professor Dave Barrett Associate Professor, School of Psychology Tobias studies the brain mechanisms of cognition and behaviour. To this end, he mainly combines in vivo neurobiological methods with behavioural testing in rodent models. More recently, he has also begun using similar behavioural assays in human participants to facilitate translation of findings from rodent models to people. Tobias’ research focuses on how a brain circuit consisting of the hippocampus, prefrontal cortex and connected subcortical regions mediates and integrates important cognitive functions – including memory and attention – and other behavioural processes (emotional, motivational, sensorimotor). In addition, he studies how dysfunction in this brain circuit causes cognitive and behavioural deficits. Together with colleagues from the Pain Centre, he studies the interaction between chronic pain, brain and cognition. Find out more about Dr Tobias Bast School of Life Sciences, Queen's Medical Centre Interests: Nutrient regulation of carbohydrate and lipid metabolism. Regulation of gene expression by lipids and carbohydrate. Role of steroid hormone transcription factors in health and disease Find out more about Dr Andrew Bennett Professor of Behavioural Medicine, Queen's Medical Centre Holly is a chartered health psychologist and Associate Professor of Behavioural Science at the University of Nottingham School of Health Sciences. Her research primarily focuses on (a) promoting health and wellbeing to prevent chronic disease (e.g. healthy lifestyle and/or psychological intervention); (b) assisting people in the self-management of long-term conditions through health promotion and self-care, psychological approaches, behavioural intervention and education. She is a member of the Centre for Healthcare Technologies and is interested in how we can use technology (e.g. online learning tools, website, email and mobile phone messaging, wearables) to improve services and patient experience, promote health and wellbeing, and help people to manage chronic conditions. Find out more about Professor Holly Blake Professor of Cellular Pharmacology, School of Life Sciences Meritxell is a biochemist/pharmacologist with expertise in the interactions between G Protein-Coupled Receptors (GPCRs) and intracellular proteins, and their consequences for receptor signalling and trafficking. She is a basic researcher with particular interest in the molecular and cellular mechanisms of pain transmission. Meritxell did her PhD in biochemistry at the University of Barcelona, Spain and at Karolinska Institute in Sweden. Her PhD was part of a EU-funded multidisciplinary project that examined the interactions between adenosine and dopamine receptors in Parkinson’s Disease. Dr Canals completed postdoctoral training in a series of leading pharmacology groups. In the laboratory of Prof G Milligan in Glasgow, she focused on the functional consequences of GPCR co-expression and oligomerisation for which she developed novel RET techniques. As a senior post-doctoral fellow in the laboratory of Profs R Leurs and M Smit in Amsterdam, she focused on the regulation, pharmacology and medicinal chemistry of chemokine receptors. In 2010, Meritxell was awarded a Monash Fellowship to start her independent line of research within the Drug Discovery Biology (DDB) Theme at the Monash Institute of Pharmaceutical Sciences (MIPS). In 2017 she took a sabbatical year to work with her long time collaborators at the departments of surgery, psychiatry and pharmacology at Columbia University, New York. At the end of 2018, Meritxell moved to the University of Nottingham, to join the Centre of Membrane Protein and Receptors, (COMPARE) a joined venture between the University of Birmingham and the University of Nottingham. The main focus of her research is peptide receptors involved in pain transmission (opioid, neurokinin and calcitonin gene-related peptide receptors) and immune response (chemokine receptors). While these GPCRs are undisputed targets for the treatment of pain and inflammation, and have an extensive pharmacological toolbox, the use of drugs targeting these receptors is still limited by the development of side effects (such as opioid-induced tolerance or respiratory depression) or by lack of efficacy. Her lab uses sophisticated biochemistry and imaging techniques combined with analytical pharmacology and drug delivery approaches to address these issues and provide a path for improved and safer pain management therapeutics. Find out more about Professor Meritxell Canals Professor of Neuropharmacology, Life Sciences Vicky is Deputy Director of the Pain Centre Versus Arthritis and has responsibility for the management of pre-clinical studies. Her research has contributed to advances in the understanding of peripheral and central processing of nociceptive inputs and the mechanisms associated with the manifestation of aberrant pain responses associated with chronic pain states. She has a background in neuropharmacology (PhD under the supervision of Professor Anthony Dickenson), which provides a strong foundation for her interest in the investigation of disease specific mechanisms of chronic pain responses, and the identification of novel analgesic targets in particular relevant to osteoarthritis pain. Vicky has experience of being PI, managing and delivering on inter-disciplinary research projects, funded by the Welcome Trust, the MRC and pharmaceutical industry. Find out more about Professor Victoria Chapman Anne Mclaren Research Fellow I am fascinated by the intricacies and complexities of neuronal networks involved in chronic pain conditions. Among these networks lamina I projection neurons are believed to play a key role in many pain conditions. They project all the way from the spinal cord to the brain and are therefore considered an important output system of sensory processing in the spinal cord. For example, they send integrated signals of pain, temperature and itch to the brain, where these stimuli will ultimately be perceived by individuals. Although projection neurons are seen as quite a homogenous collection of neurons, it is now clear that subsets exist, which can be defined by their genetics and function. I aim to better understand lamina I projection neuron diversity (especially based on their brain targets) using novel techniques such as in vivo microscopy and chemo/optogenetics. By better understanding their function and genetics during acute and chronic pain, we may be able to uncover pathways that could be targeted in chronic pain treatment. I am also interested in developing new ways to look at the peripheral and central nervous system, mostly through in vivo microscopy – a technique that allows the study of whole networks of cells simultaneously in an intact but anaesthetised animal. This provides a view into systems for which effective replacement models do not yet exist. These and other techniques have allowed me to collaborate with many inspiring groups, looking at diverse pain and neurological conditions. As such I have shared journeys looking at the effect of systemic temperature on the sympathetic nervous system, the way bladder distention is encoded by our sensory nerves, the resilience of interneuron calcium signalling to painful stimuli, the infiltration of immune cells into pathological spinal cord tissues, and the effects of neuromodulation on cortical excitability. I aim to meet many more exciting people, to travel down other scientific paths that can be lit up by in vivo microscopy. Please drop me a line if you are interested in working together or knowing more (kim.chisholm@nottingham.ac.uk). An illustration of the versatility and power of in vivo microscopy: Examples involving the visualisation of calcium transients (indicative of neuronal activity) in neurons of the peripheral nervous system and the spinal cord as well as mitochondrial function in the cortex. Find out more about Dr Kim Chisholm Research Associate, School of Medicine My research interests have always centred around improving health and wellbeing for individuals across the lifespan, with a particular focus on chronic health conditions within the older adult population. I also have an interest in rehabilitation contexts. Whilst my previous research has generally been specific to the context of physical activity and exercise (through disciplines like psychology, sociology and public health), my PhD research has explored stroke in older individuals, along with the perspectives of professionals (i.e., physiotherapists, occupational therapists, exercise professionals). Methodologically, I specialise in qualitative research methods and have experience using a wide range of techniques including interviews, focus groups, digital and creative methods. My overall research goal as part of the Centre is to improve the day-to-day experiences of people with chronic health conditions, like arthritis and other rheumatic diseases, reduce pain, and help people to live as optimally as possible. Clinical Associate Professor in the Care of Older People Jemima was appointed to the role of Clinical Associate Professor in the Care of Older People in 2024, having been an NIHR-funded University of Nottingham Academic Clinical Lecturer prior to this (2021-2023). In her previous role as a post-doctorate Academic Clinical Lecturer, she developed an interest in clinical research in ageing populations with chronic pain. She is currently leading two grants exploring pain phenotyping and the experience of pain, in people living with dementia. Further work in this portfolio will include observational and interventional studies in pain in people living with frailty. Alongside this, she firmly believes in embedding Patient and Public Involvement and Engagement within all stages of the research process, from design to dissemination. Clinically, Jemima is a Consultant Geriatrician at University Hospitals of Derby and Burton NHS Foundation Trust. Associate Professor, School of Life Sciences Federico is a neuroscientist with expertise in the mechanisms that control neuron connectivity. Having studied for his undergraduate degree at the Universidad de la Republica, in Uruguay, Federico moved to the UK to undertake his PhD at the University of Bath and then to a postdoctoral position at the University of Manchester, which culminated in work as Co-Investigator in an MRC funded project. In 2013, he was appointed Assistant Professor at the University of Nottingham, where he formed the Axon Biology Lab at the School of Life Sciences. His work focusses on the cellular and molecular processes that take part in axon development and function, both in the central and peripheral nervous system. Work in the lab investigates signal integration and the regulation of protein levels in the axon, including the study of the mechanisms controlling local protein translation by microRNAs and the specific regulation of axonal protein expression by selective degradation. This work has led to significant advances in the understanding of miRNA function in the development of cortical primary neuronal networks. In pain research, the overarching aim of his lab is to identify those microRNAs that might have a role in the control of nociceptor neuron function and the chronification of pain, to investigate how they work and to understand their potential as targets for pain treatment. Find out more about Federico Dajas-Bailador Associate Professor in RNA Biology, School of Pharmacy Cornelia is Associate Professor in RNA Biology at the School of Pharmacy in Nottingham. Her work focusses on post-transcriptional mechanisms of gene expression, especially mRNA polyadenylation, stability and translation. There is increasing evidence that these processes play a large role in the regulation of inflammation, neuronal plasticity and tissue remodelling, and that they can be targeted in diseases where such processes are dysregulated, such as in arthritis. Her work also has relevance for cancer. Indeed, her work has shown that an inhibitor of polyadenylation, cordycepin, is effective for pain and halts joint deterioration in models of osteoarthritis and reduces cell proliferation. Cordycepin is now under investigation as a lead compound for the treatment of osteoarthritis and cancer. Find out more about Cornelia de Moor Emeritus Professor, University of Nottingham, City Hospital campus Michael is an Emeritus Professor, based in Academic Rheumatology at Nottingham City Hospital. His main research interests are osteoarthritis (OA), gout, calcium pyrophosphate crystal deposition (CPPD), placebo/contextual response and evidence-based medicine. He has expertise in clinical and epidemiological studies, community-based clinical trials, systematic reviews and meta-analyses. He has over 400 original research publications and was awarded the OA Research Society International (OARSI) Clinical Research Award for 2012 and the 2021 G-CAN Gold Medal Investigator Award. He is a past editor of Annals of the Rheumatic Diseases (1992-99), has co-chaired EULAR Task Forces for evidence-based recommendations for OA, gout and CPPD arthritis, and has been involved as a clinical expert in NICE appraisals for OA and gout. He was awarded a Lord Dearing prize for teaching and learning in 2001 and the NUH Trust Undergraduate Educator award for 2020. Professor of Healthcare Research and Occupational Therapist Avril is an occupational therapist by professional background. She is Professor of Healthcare Research in the School of Health Sciences. She is primarily interested in evaluating rehabilitation interventions after joint replacement and in falls reduction and management. Her expertise is in evaluating complex interventions particularly using mixed methods and randomized controlled trial designs. She has recently completed several trials; HippotyHop- evaluating withdrawing hip precautions after hip replacement; CORKA- Community based rehabilitation after knee arthroplasty and OTIS-Occupational therapist home assessment and modification for prevention of falls. Her current trials include OPAL2- Providing Occupational Advice for patients undergoing Arthroplasty of the lower limb: AVERT-Optimising the Care of Older People Hospitalized with an Acute Osteoporotic Vertebral Fracture-A Feasibility Study and FIREFLI - Do safe and well visits delivered by the Fire and Rescue service reduce falls among older people? Find out more about Professor Avril Drummond Research Fellow, LIfe Sciences Dr Eltaher received a PhD in drug delivery and tissue engineering at the University of Nottingham, UK. Since then, she worked on collaborative research projects in drug/gene delivery, tissue and biomedical engineering, and regenerative medicine. At the University of Nottingham in the Axon Biology Lab, she works on mediators of nociception and novel therapeutic targets in OA pain. Find out more about Dr Hoda Eltaher Professor of Health Psychology, University Park campus Eamonn Ferguson (BSc PhD) is Professor of Health Psychology at the University of Nottingham (chartered health and occupational psychologist). His research focuses on the role of personality traits with respect to health outcomes (e.g., symptom perceptions, drug taking, and adherence), pro-social behaviour (charitable donations, blood/organ donation) and medical selection and training. He is the co-founding president of the British Society for the Psychology of Individual Differences (www.bspid.org.uk/). His work incorporates a mixture of lab based experiments using economic games and pain perception, field based work using ecological momentary sampling methods and intervention studies. He also has a long standing interest in the structure and assessment of traits using a variety of psychometric and taxometric procedures. Find out more about Professor Eamonn Ferguson Associate Professor of Biopharmaceutics, School of Pharmacy, University of Nottingham Pavel Gershkovich is an Associate Professor of Biopharmaceutics in the School of Pharmacy, University of Nottingham. His research interests include the following areas: 1. Improvement of the efficiency, selectivity and safety profile of pharmacological therapy based on knowledge of pathophysiology of disease states. 2. Intestinal absorption of drugs, including the mechanisms of intestinal absorption and novel methods to overcome barriers to systemic bioavailability of orally administered drugs. 3. Effects of disease states on pharmacokinetics and pharmacodynamics of drugs. 4. Effect of food and its composition on absorption, disposition, action and toxicity of drugs. Research in his laboratory has direct clinical significance, i.e., translational research. It is accomplished by an active collaboration with medical clinicians, including at hospital interface. Find out more about Dr Pavel Gershkovich Post-Doctoral Research Fellow Dr Rob Goodwin is a physiotherapist with over 30 years of clinical experience. From a clinical perspective, most recently, Rob was the Clinical Lead for the Nottingham city community pain service, hosted by Nottingham CityCare CIC. In this capacity Rob led a multidisciplinary team that provided both individual and group support for widespread, longstanding pain, fibromyalgia and chronic fatigue syndrome. In 2015 Rob won an NIHR CLARC East Midlands stipe-end to conduct a PhD at the University of Nottingham related to the implementation of the first contact practitioner (FCP) role, within general practice. Rob has published several peer reviewed papers on the FCP role and led the qualitative component of the first national evaluation of the FCP role. In 2019 Rob was awarded the Chief Allied Health Professionals Officers “Researcher of the Year” and overall “AHP of the Year” awards for his work related to the FCP role. Rob is currently a post-doctoral research fellow having been awarded a 2-year fellowship by the School of primary Care Research, University of Nottingham. Rob’s current research project is an investigation of the support needs of FCP physiotherapists. Rob’s methodological expertise is in conducting and reporting qualitative research and the application of realist methodological approaches (reviews and evaluations). School of Physics and Astronomy Penny has worked on developing quantitative MR techniques to answer a variety of biomedical questions for more than 30 years. She has particular interests in techniques for structural and functional neuroimaging at 7T, and the interactions of electromagnetic fields with the human body. She has worked at Nottingham most of her career having initially done her PhD at the Institute of Cancer Research in Sutton. Find out more about Professor Penny Gowland Professor of Muscle Metabolism, School of Life Sciences Paul Greenhaff is Professor of Muscle Metabolism in the Division of Physiology, Pharmacology and Neuroscience, School of Life Sciences at the University of Nottingham. He is deputy director of the MRC Versus Arthritis Centre for Musculoskeletal Ageing Research, a member of the Centre for Sport, Exercise and Osteoarthritis Research Versus Arthritis and metabolism strand lead for the musculoskeletal disease theme of the Nottingham NIHR Biomedical Research Centre. Current research interests are centred on the loss of muscle mass and the dysregulation of muscle metabolism in ageing, immobilisation, acute trauma and inflammation and chronic disease, and strategies (including exercise, nutrition and pharmacological interventions) to offset these negative and pathophysiological effects. He has maintaining continuous research funding for nearly 30 years from government, charities and industry, and has published >170 original, peer-reviewed papers to date, and numerous review articles and book chapters. Find out more about Professor Paul Greenhaff Lecturer, Health Sciences, City Hospital Division of Animal Sciences, Sutton Bonington campus Life Sciences, Queen's Medical Centre Assistant Professor, Health Sciences, Queen's Medical Centre Senior Patient and Public Involvement and Engagement Manager, School of Medicine Following a PhD in cell biology and further research and commercialisation experience, Adele has developed expertise in the field of Patient and Public Involvement and Engagement (PPIE). Since 2013, she has fulfilled roles dedicated to PPIE, starting at the NIHR Nottingham Hearing Biomedical Research Unit, which then became part of the NIHR Nottingham Biomedical Research Centre. In 2022, Adele accepted the new post of Senior Patient and Public Involvement and Engagement Manager in the School of Medicine’s Research and Knowledge Exchange team. Adele has published extensively in the field of PPI and has also reviewed many articles for the journal Research Involvement and Engagement. Adele led a working group for NIHR INVOLVE, designing the blueprint for the www.learningforinvolvement.org.uk website. In addition, she established a regional collaboration for PPI training called the Sharebank, bringing together organisations from across the East Midlands to produce and share training opportunities. Adele teaches on the PPI in Research module for medical undergraduate students, having played a key role in designing and launching the module back in 2018. Adele advises researchers, delivers training, assists with grant bids and advises the university on making internal processes suitable for patient and public contributors. She is also building links with local communities to foster new engagement and involvement opportunities. Research Fellow, Nottingham University Business School Basharat Hussain completed his MA in Research Methods and a PhD from University of Nottingham. His PhD research focused on implementation of equality and diversity policy in the NHS service provision. He has worked in the UK and abroad (France, Belgium, Netherlands) on Public Health England, NIHR and EU funded projects. His research interests are in the fields of implementation science, health inequalities, health and social innovations, health technologies and inclusivity, policy analysis, vaccine uptake and hesitancy, systematic reviews and realist evaluations. He has published in high ranked journals including Lancet. Dr Hussain is Associate Fellow of the UK HEA. Research Associate, School of LIfe Sciences Clive Jabangwe is a Postdoctoral Research Associate at the University of Nottingham, investigating the role of potential therapeutic molecules in resolving and managing pain mechanisms in the peripheral sensory nervous system. Clive completed his MSc in Medical Biotechnology in Italy, focusing on the genomic landscape of chronic lymphocytic leukaemia in molecular onco-haematology. He then pursued a PhD in Biomedical Engineering at the University of Porto, Portugal, where his research explored how macrophages modulate the behaviour and innervation responses of peripheral sensory nerves in knee osteoarthritis using microfluidic organotypic cultures. Now at the Pain Centre Versus Arthritis, Clive is leveraging his extensive expertise in molecular biology, biomedical engineering, and pain research to advance the understanding and treatment of chronic pain conditions. Research Fellow, Faculty of Medicine Hannah is a Postdoctoral Research Fellow in the School of Life Sciences. She obtained a PhD in Medicine from the University of Nottingham between 2017 and 2021 in the Children's Brain Tumour Research Centre (CBTRC), following a successful completion of an Oncology Masters of Research program at Nottingham University from 2016 to 2017. Hannah undertook her first Postdoctoral Research Fellowship at the University of Cambridge in the department of pathology from 2021 to 2023. Hannah's research has mainly been dominated by an interest in extracellular vesicles. She began her research career investigating the role of extracellular vesicles in the most prevalent malignant paediatric brain tumour, medulloblastoma. She aimed to understand their role in metastasis and how extracellular vesicles could be exploited as biomarkers to characterise disease and inform clinical phenotypes. At the University of Cambridge Hannah worked on bioengineering small extracellular vesicles as a novel platform for effective SARS-CoV-2 vaccine development- this work was in partnership with Exosis Inc, Florida (https://www.exosis.com/). Hannah's current work is now focusing on understanding how cancer and cancer chemotherapeutics impacts on sensitisation and pain. She is focusing on understanding the ability of extracellular vesicles to transfer biologically active compounds to alter neurodevelopment. Find out more about Dr Hannah Jackson Professor of Health Economics, School of Medicine Associate Professor in Cancer Biology Victoria is a molecular biologist with an interest in the mechanisms that underpin the development and progression of complex disease. Victoria obtained a PhD in genetics from the University of Leicester and pursued postdoctoral training in the fields of molecular and cell biology. She was awarded the prestigious JG Graves Research Fellowship in 2012, which she held at the University of Sheffield Cancer Research UK Centre until joining the University of Nottingham as a lecturer in 2014. Victoria's research is focussed on understanding how cells communicate with each other both locally and distally using different mechanisms of extracellular communication, via RNA and proteins. We aim to utilise this information to better understand disease process, identify novel markers to better stage and predict disease behaviour and the development of novel therapeutic strategies. Find out more about Dr Victoria James Research Fellow Chitra Joseph is a post-doctoral research fellow in the Injury, Recovery, & Inflammation Sciences Academic Unit of the University of Nottingham within the Pain Center Versus Arthritis. She is currently working on a project”, Investigating studies of the expression of pain targets on osteoarthritis tissues and the association of target expression with osteoarthritis pain,” funded by Orion Pharma. Chitra received her PhD from the University of Nottingham (ORSAS and UoN scholarships). During her post-doctoral years, she investigated the molecular and cellular tissue repair mechanisms in response to injury and inflammation, leading to pathological changes in tissues. She is passionate about teaching and currently runs a course for PGRs on Critical Appraisal of Scientific Literature as part of the Medicine and Health Sciences Faculty Training Program. She is a co-founder of the Parents in Science Society at Nottingham University. We offer support, mentorship, and individualized guidance to staff and students with parental responsibility. The society is open to every member of the University of Nottingham Family with the goal of improving career opportunities, providing advice on improving work-life balance, and promoting mental well-being for individuals with parental commitment. Find out more about Dr Chitra Joseph Professor and Head of Primary Care Associate Professor in Clinical Pharmacy Roger is Associate Professor in Clinical Pharmacy Practice at the University of Nottingham and an advanced pharmacy practitioner at Nottingham University Hospitals NHS Trust, where he works as a member of the multidisciplinary pain management service. He is a Council member of the British Pain Society and regularly provides media comment on issues relating to pain management on behalf of the Royal Pharmaceutical Society. Roger’s research interests relate to prescribing of analgesic medicines and associated clinical outcomes and healthcare utilisation. Current research is focussing on understanding the implications of the changes in opioid prescribing over recent years and their geographical variation, together with understanding the impact of recent legislative changes related to controlled drugs. Find out more about Dr Roger Knaggs Assistant Professor in Molecular Pharmacology, Life Sciences Senior Research Fellow, Life Sciences L i qualified as a Bachelor of Medicine and Master of Pharmacology from Sichuan University China, and received his PhD from CRC Academic Unit of Clinical Oncology, University of Nottingham. Li is a senior research fellow worked many years in the area of cancer immunology, gene transcription and cell signalling. Li join the Pain Centre Versus Arthritis from 2015 and is combining his expertise/skill to work on the research project relate to arthritic chronic pain. Li has experience in a broad spectrum of biochemical, molecular and immunological techniques including DNA mutagenesis, siRNA, PCR, reporter gene assay, EMSAs, cell culture and transfection, ELISA, RIA, immunoprecipitation (co-IP and chromatin-IP), Western blotting, immunohistochemistry and fluorescence imaging. Find out more about Dr Li Li Professor and Honorary Consultant of Anaesthesia & Critical Care, Queen's Medical Centre Post-doctoral Research Fellow, City Hospital campus Clinical Research Practitioner, East Midlands Major Trauma Centre, Queens Medical Centre HEE/NIHR Pre-doctoral bridging fellow, University of Nottingham I am an associate fellow at the University of Nottingham completing the HEE/NIHR pre-doctoral bridging programme 2022/2023. My research interest lies in the broad area of injury and recovery. Through working in the East Midlands Major Trauma centre, I have developed a keen interest in chronic pain, particularly identifying patients that are at risk with the aim to develop/adapt interventions during early hospitalisation for the prevention of chronic pain. My current research projects include a systematic review and a service evaluation investigating prevalence and risk factors for chronic pain development following major trauma. The results will be used to support a doctoral application to continue further research in the field of chronic pain following major trauma. I have worked in a research role at Nottingham University Hospitals for three years across a range of clinical departments, gaining professional registration from the Academy for Healthcare Science in 2021. I currently oversee a number of clinical trials day to day within the East Midlands Major Trauma Centre. I’m responsible for patient recruitment, collecting and processing tissue samples, data collection, data input and general study duties and queries. I graduated with an undergraduate degree in Sport and Exercise Science from Nottingham Trent University in 2018 and in the same year, was awarded an academic excellence scholarship fund to undertake a Research Masters in Biomechanics. Applied Physiology, Biomechanics and Exercise Testing and Prescription for Health were modules of particular interest. Work from my Masters was subsequently published in 2021 in the Journal of Applied Ergonomics. Contact Georgia Melia Associate Professor in Life Science and Healthcare, University of Nottingham Ningbo Campus Dr Weihua Meng is a genetic epidemiologist whose main interest is to identify the genetic determinants (including common SNPs and rare variants) of multiple pain phenotypes. He has published genome-wide association studies on broadly defined headache, neck or shoulder pain, knee pain etc. These pain phenotypes were based on UK Biobank questionnaires. More recently, he has extended his research to use single cell RNA sequencing technology to describe the transcriptomic profile of some regional pain phenotypes. He is currently funded by two international collaboration grants from China. Find out more about Weihua Meng Senior Research Technician, Life Sciences Paul is a senior research technician in the Physiology, Pharmacology and Neuroscience Division of the School of Life Sciences and carries out and supports research within the Pain Centre Versus Arthritis. Paul’s current research aims to assess the use of adult mouse dorsal root ganglion neurons in microfluidic chambers. The chambers allow the cell body and nerve ending to be exposed to different medium and stimuli, this in turn models the different environments in the knee. Paul’s previous research involved studying the role of TLR3 in the development and maintenance of inflammatory and neuropathic pain. A major part of Paul’s past research has been centred on the role of cannabinoid receptors and endocannabinoids in modulating neuropathic pain; the research involved the induction of neuropathic pain in a preclinical model and the subsequent study of the modulation of capsaicin evoked changes in intracellular calcium concentration in dorsal root ganglion neurons. Paul has experience in a broad spectrum of laboratory techniques some of which include: the culture of primary cells, calcium imaging in cultured cells, phagocytosis assays, radio-isotope based pharmacological assays, immunohistochemistry, image analysis and is a personal license holder (ASPA) modules I-IV. Paul is also an assistant safety officer and has trained and supervised under graduates, post graduates and members of staff. Find out more about Paul Millns Professor of Clinical Psychology and Neuropsychology, Medicine Roshan das Nair is Professor of Clinical Psychology & Neuropsychology at the University of Nottingham and Senior Research Scientist at SINTEF (Norway). He is a Health and Care Professions Council Registered Practitioner Psychologist. After qualifying as a clinical psychologist from the National Institute of Mental Health and Neurosciences in Bangalore, India, he obtained his PhD from the University of Nottingham. Between 2001-2003, Prof das Nair worked as a Lecturer at the University of Zambia, and until November 2016, he was a Consultant Clinical Psychologist with Nottingham University Hospitals NHS Trust. Prof das Nair's research focuses on the evaluation and implementation of complex interventions within health and social settings. He is specifically interested in the interface between mental and physical health. His work incorporates randomised controlled trials, qualitative methods, systematic reviews, and implementation science. Find out more about Professor Roshan das Nair Associate Professor, Translational Imaging, Medicine Galina is a MR physicist with the expertise in sodium MRI and microimaging (UTE, MQF) at ultra-high field (9.4T), particularly in applying these techniques in exploring new imaging markers in diseases associated with physical stresses i.e. arthritis and injuries in sports medicine. Galina studied for her undergraduate (Soft Condensed Matter Physics) degree at Lomonosov Moscow State University, Moscow, Russia and postgraduate (PhD, Chemical Physics) degree at Clark University, Massachusetts, USA. From there she moved to a post-doctoral position at the National High Magnetic Field Laboratory, Tallahassee, Florida, USA working on MRI of fluid flows in tissues following a second post-doctoral post in MRI of bio-fluid flow in stenotic geometries at Lawrence Berkeley National Laboratory, University of California, Berkeley, USA. She continued as an independent Researcher at Colorado State University developing hyperpolarised MRI methodology for lung studies and sodium MRI methodology for soft tissues characterisation. In 2009 she was appointed as an Assistant Professor at the University of Nottingham, where she continued to work on hyperpolarisation techniques, sodium methodology developments including novel technology of sodium sensing in joints using pocket-sized MRI. She was promoted to an Associate Professor in 2017, her research is currently funded by MRC, BBSRC, EPSRC and charities. She also contributes to UG teaching in the School of Medicine with a module “Physics of the body” and in the School of Physics and Astronomy with 3rd and 4th year research project students. She is currently Postgraduate teaching and training lead for Doctoral Programmes in the School of Medicine. Find out more about Professor Galina Pavlovskaya Assistant Professor, Molecular Pharmacology Chloe J. Peach is an Assistant Professor in Molecular Pharmacology. She completed an undergraduate degree in Neuroscience at the University of Nottingham, before doing a Ph.D. in Molecular Pharmacology and Drug Discovery. Funded by the A.J. Clark Scholarship from the British Pharmacological Society, Dr. Peach identified novel distinctions in the spatial and temporal dynamics of how growth factors interact with a receptor tyrosine kinase (RTK) and a cell-surface glycoprotein involved in tumour angiogenesis. She then moved to the U.S.A. as a postdoctoral fellow in the Department of Molecular Pathobiology at New York University working with Prof. Nigel Bunnett, studying both G protein-coupled receptors (GPCRs) and RTKs involved in chronic pain and how receptor localisation is fundamental in nociceptive signalling. Funded by the prestigious Leon Levy Fellowship in Neuroscience, her postdoctoral work discovered a glycoprotein involved in transmitting pain induced by a neurotrophic growth factor. In 2023, she returned to the University of Nottingham to establish her own research group in the School of Life Sciences. The Peach Lab is interested in how RTK biology (pharmacology) is modulated by their unique local microenvironment (cell biology) - from local glycoproteins to cytoskeleton-associated proteins. With expertise exploring the spatial and temporal dynamics of receptor biology, the group uses fluorescence- and luminescence-based approaches to probe ligand binding, receptor signalling, intracellular trafficking and how receptors signal from subcellular sites in real-time. The ultimate goal is to develop better therapeutics that target RTKs beyond oncology, where neurotrophins are particularly promising as an alternative non-opioid target for the treatment of chronic pain Find out more about Dr Chloe Peach Medicine, Queen's Medical Centre Richard's interest in pain stems from research into osteoarthritis initiated at the Institute of Orthopaedics, Stanmore, Royal National Orthopaedic Hospital. This was subsequently complemented by investigating peripheral and central nervous system repair strategies in the School of Pharmacy (UoN) in collaboration with the National Institute of Medical Research. In 2003, he moved to the Division of Orthopaedic & Accident Surgery, where he commenced his research into osteoarthritic pain. Within the field of osteoarthritic pain, his specialities are primarily in two quite diverse areas; quantified histological change in the osteoarthritic knee and measurement of pain thresholds. He is currently investigating the change in an individual’s sensitivity to pain evoked by exercise. In addition to his pain related research he specializes in the biology of bone repair, osteoarthritis and osteoporosis. Having recently been awarded a Technology Strategy Board – EPSRC grant to develop nano-enabled intranasal delivery of PTH (1-34) for the treatment of osteoporosis. Find out more about Dr Richard Pearson Assistant Professor in Inflammation Biology, Faculty of Science Anna joined the University of Nottingham in 2015 as Anne McLaren Fellow and is now Assistant Professor in Inflammation Biology in the School of Pharmacy. Her research has contributed to advances in the understanding of how endogenous inflammatory molecules that signal tissue damage drive pathological inflammation during chronic joint inflammation in rheumatoid arthritis (Imperial College London 2008-2011; University of Oxford 2011-2015). Recently, Anna has uncovered a novel regulatory mechanism by which molecules of the extracellular matrix, the major component of the cellular microenvironment, influence immune cell behaviour and response to infection by regulating microRNA biogenesis and, thus, inflammatory gene expression. Her research interests include: posttranscriptional regulation of inflammatory gene expression, regulation of microRNA biogenesis by the extracellular matrix, innate immune response to injury and infection and macrophage biology and function. Find out more about Dr Anna Piccinini Senior Technical Specialist, School of LIfe Sciences I obtained a PhD in neurotoxicology and proteomics from the University of Nottingham in 2007 and then undertook postdoctoral training in cellular reprogramming. I then joined Federico Dajas-Bailador’s group in 2012 as a senior technical specialist where I carry out and support the group’s research including research within the Pain Centre Versus Arthritis. Current research includes exploring molecular mechanisms of pain pathways using embryonic mouse dorsal root ganglion (DRG) neurons in microfluidic chambers, and to investigate the viability of human DRGs in culture. I have experience in a broad range of laboratory techniques, which include: the culture of primary neuronal cells and iPSCs, calcium imaging in cultured cells, molecular biology, miRNA functional assays, gene expression by qPCR, chromatography, proteomics and the isolation and characterisation of extracellular vesicles. I also train and supervise undergraduates, postgraduates and members of staff. Find out more about Alex Rathbone Director of Research and Innovation, Nottingham University Hospitals Since June 1994 Dr Ryder has been a consultant Physician in Hepatology and Gastroenterology at the Nottingham Digestive Diseases Centre and Biomedical Research Unit. He became Director of Research and Innovation at Nottingham University Hospitals in April 2016. His major clinical and research interest is hepatitis C infection and large clinical trials in hepatology. He was recognised as one of the leading recruiters to commercial clinical trials in the “NIHR at 10” awards. Dr Ryder was the national lead for the Hepatology Clinical Research Network until 2015 and is the East Midlands lead for Division 6 of the CRN. He is currently Hepatology Vice President of the British Society of Gastroenterology. He graduated from Nottingham University Medical School and trained in hepatology at St Mary’s Hospital and Kings College Hospital London. Find out more about Dr Stephen Ryder Nottingham research fellow. MND Association junior fellow Dan was as appointed as Nottingham research fellow in School of Life Sciences (2022), following time in the School as a Motor Neurone Disease Association fellow (hosted at the Universities of Edinburgh and Nottingham). Dan is establishing a research programme that probes the molecular mechanisms of Motor neurone diseases and related disorders, with an emphasis on understanding non-coding RNA deregulation in this context. To do this, work in the laboratory seeks to develop and exploit patient-derived induced pluripotent stem cell models and multi-omic approaches. Find out more about Dr Daniel Scott Histology Technician, Rheumatology, City Hospital Mohsen works as Histology Technician for both the Pain Centre and the NIHR Nottingham Biomedical Research Centre. He undertakes qualitative, quantitative and semi-quantitative analysis as well as developing methods and techniques of protocols and training aids for histological processes. He also trains students, academic staff and junior technicians in the use of histology equipment and techniques. Find out more about Dr Mohsen (Seyed) Shahtaheri Honorary Assistant Professor, School of Medicine Dr Benjamin Smith is a clinical research physiotherapist based at the University Hospitals of Derby and Burton/University of Nottingham, UK, where he works as AHP/HCS Clinical Academic Lead. Ben has published widely on pain and exercise, both with primary and secondary research. His research interests include the management of persistent musculoskeletal pain and the role of exercise and physical activity in prevention and treatment. In 2016 he won an NIHR Doctoral Research Fellowship to conduct a PhD at the University of Nottingham related to the assessment and management of pain around the kneecap in young adults, particularly concerning exercise prescription. In 2019 he completed his second NIHR Fellowship with an NIHR Clinical Trials Fellowship at the Nottingham Clinical Trials Unit. The programme of work included completing the pre-clinical, phase I and phase II components of the MRC Framework developing a complex physiotherapy led intervention for people with pain around the knee-cap (patellofemoral pain). Ben’s methodological expertise is in the conduct and reporting of clinical trials and systematic reviews (meta-analysis) focusing on epidemiology and treatment effectiveness. He is a member of the International Patellofemoral Research Network (iPFRN) steering committee for their 2019 consensus statement on psychological and pain features of patellofemoral pain. Post-Doc Research Fellow, School of Medicine, City Hopsital Dr Stephanie Smith is a post-doc research fellow within the Pain Centre Versus Arthritis at the University of Nottingham and works on studying pain management in rheumatic and musculoskeletal diseases. Her interest lie in bridging the gap between basic science and clinical applications. She has a particular focus on neuromuscular inhibition, muscle function, musculoskeletal pain, central sensitisation/pain mechanisms and physical activity across rheumatic and musculoskeletal diseases including osteoarthritis and rheumatoid arthritis. Her published work also includes phenotyping and ultrasound in osteoarthritis. She is currently leading the Central Aspects of Pain in Rheumatoid Arthritis (CAP-RA) project. Find out more about Dr Stephanie Smith Assistant Professor in Sports And Exercise Medicine, Faculty of Medicine & Health Sciences Dr Joanne Stocks is a Senior Research Fellow in the Injury, Recovery & Inflammation Sciences Academic Unit of the University of Nottingham and is working on a Versus Arthritis funded study investigating Biomarkers and Joint Pain in Military Osteoarthritis (Bio-Mil-OA). As a member of the Pain Centre Versus Arthritis and the Centre for Sport, Exercise and Osteoarthritis Research Versus Arthritis, she has a research interest in the area of osteoarthritis, pain, healthy ageing and physical activity, and is also the NIHR Nottingham BRC Musculoskeletal theme’s Patient and Public Involvement (PPI) lead. In addition, Joanne is completing a Bioinformatics Scientist Apprenticeship undertaking a MRes Bioinformatics degree combining cell and molecular biology expertise from her PhD with the latest biological data analysis methodology. Joanne is co-investigator of ReStARt (Reducing STiffness After knee ReplacemenT), a study to optimise physiotherapy for arthrofibrosis, and ‘Running Through’ a study of recreational runners, their injuries and performance whilst considering the impact of Covid-19. She was also co-moderator of the community participation working group creating the Research Data Alliance's Covid-19 Recommendations and Guidelines. Joanne is also leading the development of a mobile phone app ‘HealthScout’ and data collection platform to collect Patient Reported Outcome Measures (PROMS) in Nottingham University Hospital’s Musculoskeletal clinics. Furthermore, she is working on several projects as a member of Pain Centre Versus Arthritis, including a collaboration with the OA Trial Bank to identify placebo responders and predictors of response to osteoarthritis treatment using individual patient data. Find out more about Dr Joanne Stocks Pharmacy, University Park Michael is a synthetic medicinal chemist with a PhD in organic chemistry and has over 20 years' experience in preclinical drug discovery in the pharmaceutical industry through his careers at Fisons’ Pharmaceuticals, Astra AB and then AstraZeneca. He has worked in most areas of medicinal chemistry concentrating recent efforts on GPCR-based drug discovery projects. In April 2012, he made the transition into academia and was appointed as Associate Professor of Medicinal Chemistry and is head of the division of Biomolecular Science & Medicinal Chemistry within the School of Pharmacy based in the Centre for Biomolecular Sciences. His research interests centre on pre-clinical drug discovery and the investigation of novel drug delivery systems thus building on his expertise from working in the pharmaceutical industry designing novel, high quality drug-like chemical starting points to allow translational investigation of new biological mechanisms. Specific therapeutic target areas of interest are in GPCR-based drug discovery - for example designing novel antagonists of the chemokine CCR5 receptor for indications in HIV and oncology and using chemical biology methods to design and synthesise molecular probes to unravel cell signalling pathways in, for example, the challenging purinergic P2Y receptor area to enable initiation of new drug discovery projects in areas of unmet medical need. Find out more about Dr Michael Stocks Research Fellow, Life Sciences Jamie is a Research Fellow within the Pain Centre Versus Arthritis studying how the regulation of lipid signalling molecules and endogenous resolution mechanisms contribute to chronic pain states. Jamie completed a BSc in Biochemistry and joined the University of Nottingham in 2018 to undertake a PhD project. Using quantitative approaches which combine molecular, genetic, and pain phenotyping, his research aims to identify novel targets for the treatment of chronic pain. Associate Professor and Reader, Medicine, City Hospital Ana Valdes is a genetic epidemiologist with extensive expertise in osteoarthritis and other complex diseases. She is currently investigating the links between exercise, sleep, cognition and OA pain and within this the role of microbiome, nutrition and metabolic factors that contribute to pain in OA. Understanding these components is key to unravel the discordance between structural disease and pain presence and severity in osteoarthritis and for advancing clinical management of osteoarthritis. Find out more about Dr Ana Valdes Professor, Faculty of Science Michel Valstar is a researcher in Automatic Visual Understanding of Human Behaviour. This encompasses Machine Learning, Computer Vision, and a good idea of how people behave in this world. He studies the relation between medical conditions and expressive behaviour, and what role affective computing and social signal processing can have to help diagnose, monitor, or treat these conditions. (Behaviomedics). Director, Pain Centre Versus Arthritis, Honorary Consultant Rheumatologist David Walsh is Professor of Rheumatology at the University of Nottingham and Consultant Rheumatologist at Sherwood Forest Hospitals NHS Foundation Trust, where he directs the Back Pain Unit which provides diagnostic assessment and multidisciplinary Pain Management Programmes for people with chronic low back pain. In 2010 he established the Pain Centre Versus Arthritis in Nottingham, together with a multidisciplinary research team including preclinical neurosciences, psychology, neuroimaging, orthopaedics and evidence synthesis. The Centre aims to develop new and improved treatments through a translational research programme into the mechanisms by which changes within the joint and in the nervous system interact with psychosocial factors to produce arthritis pain. His preclinical research has focused on structural changes that contribute to joint pain, in particular angiogenesis, nerve growth and inflammation in the synovium and subchondral bone. His clinical research is defining the spectrum of pain phenotypes in people with arthritis based on underlying pain mechanisms, in order to better target treatments to those most likely to benefit. He is Phenotyping Research Area Lead for the Musculoskeletal research theme of the NIHR Nottingham Biomedical Research Centre. Find out more about Professor David Walsh Clinical Professor of Veterinary Anaesthesia and Analgesia, Head of Clinical Sciences Division, Clinical Director, School of Veterinary Medicine and Science Kate is Professor of Veterinary Anaesthesia and Analgesia at the Nottingham University Veterinary School. She’s a consultant veterinary surgeon, double boarded in analgesia and anaesthesia, published extensively, including book chapters on companion animal pain assessment and treatment. Kate teaches physiology, pharmacology, anaesthesia, analgesia, drug legislation, laboratory animal welfare and legislation and safety culture across the curriculum. She is a pain specialist consulting on companion animal pain cases and has led on consensus groups of the use of treatments in canine OA. Her PhD evaluated the effect of anaesthesia in pain pathways in induced models of rodent OA. She is a companion animal OA expert and Pharma consultant having authored and defended detailed and critical summaries on canine OA medications and equine analgesics to the Committee for Veterinary Use of Medicinal Products. She holds a PIL and PPL for OA studies in rodents. In 2019 she became a Fellow of the Royal College of Veterinary Surgeons for Meritorious Contribution to Clinical Practice. Find out more about Professor Kate White Specialist Nurse, Rheumatology Research, Kings Mill Hospital Sherwood Forest Hospital's NHS Foundation Trust Debbie is a Specialist research nurse working at Sherwood Forest Hospitals. She is a member of the Trust’s R&D committee and Clinical ethics committee, Coordinator of the Tissue repository at SFH and responsible for the consent process. Post-doctoral Researcher, School of Life Sciences Steve is a Research Fellow studying spinal mechanisms of arthritis pain in pre-clinical models. Steve completed a Neuroscience MSci at the University of Nottingham and followed onto a PhD with a focus on studying spinal cord mechanisms of pain. He then undertook a 5 year post-doctoral position at the Institute of Experimental Medicine in Budapest, Hungary, where he learned complementary anatomical techniques, including super-resolution microscopy. Now back at the Pain Centre Versus Arthritis, Steve is combining expertise in behavioural, physiological, and anatomical approaches to further study the intricate changes in central neuronal circuitry which underlie arthritic chronic pain states. Find out more about Dr Steve Woodhams Research Fellow, Centre for Sport, Exercise and Osteoarthritis Research Versus Arthritis Laura is a Research Fellow in the Centre for Sport, Exercise and Osteoarthritis Research Versus Arthritis. Laura is currently the study manager and Principal Investigator at Nottingham University Hospitals NHS Trust on the multi-centre Significant Ankle Ligament Injury (SALI) cohort study. The SALI study seeks to identify the prevalence and risk factors for incomplete recovery of normal function and poor patient reports outcome measures following significant ankle injury. In addition to identifying the incidence, and individual risk factors for the development of ankle OA following significant ankle injury. Laura undertook her PhD within the Pain Centre Versus Arthritis and graduated from the University of Nottingham in 2015. Her thesis investigated structural associations of symptomatic knee osteoarthritis. Laura's research interests include causes of pain in osteoarthritis and risk factors for poor patient reported outcomes. Find out more about Dr Laura Wyatt Professor in Musculoskeletal Epidemiology, Medicine, City Hospital campus Weiya qualified as a Bachelor of Medicine (BMed) 1978-1983, and Master of Epidemiology (MEpi) 1983-1986 from Sichuan University Medical School. He received his PhD in Evidence Based Medicine in 1997 from the University of Nottingham. He was jointly funded scholar by the Chinese Education Ministry and British council Technology Scheme and honorary research officer in the WHO MONICA Belfast 1991-1992, research fellow and course tutor 1997-2002 in Aston University. He took up a Senior Lectureship from the University of Nottingham in 2002, became Associate Professor and Reader in 2005, then Professor of Epidemiology since 2015. Weiya is the Research Lead of the Division of Rheumatology, Orthopaedics and Dermatology, and the Head of the Evidence Based Medicine Group in the Pain Centre Versus Arthritis. He has led the development of the European evidence based recommendations for osteoarthritis, gout and CPPD, and the Osteoarthritis Research Society International Treatment Guidelines. He was a member of the NICE osteoarthritis Clinical Guideline Development Committee, a member of the British Society of Rheumatology Gout Working Group, a member of the Versus Arthritis Fellowship Implementation Committee. He is an Associate Editor of BMC Rheumatology and an Editorial Board Member of Osteoarthritis & Cartilage. He has published over 200 papers with a H index of 71 (Google Scholar 16 Dec 2019). Find out more about Professor Weiya Zhang Clinical Sciences Building City Hospital Nottingham, NG5 1PB telephone: +44 (0) 115 823 1766 ext 31766 fax: +44 (0) 115 823 1757 email: paincentre@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}