{
    "url": "http://www.nottingham.ac.uk/paincentre/people/victoria.chapman",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR FACULTIES, SCHOOLS & GROUPS The rat osteoarthritis bone score for histological pathology relevant to human bone marrow lesions and pain (2024) Journal Article McWilliams, D. F., Shahtaheri, M., Koushesh, S., Joseph, C., Gowler, P. R., Xu, L., Chapman, V., Sofat, N., & Walsh, D. A. (2025). The rat osteoarthritis bone score for histological pathology relevant to human bone marrow lesions and pain. Osteoarthritis and Cartilage Open, 7(1), Article 100544. https://doi.org/10.1016/j.ocarto.2024.100544 Objectives Histological osteochondral characteristics of inflammation, fibrosis, vascularity, cartilage islands, vessels entering cartilage, thickened trabeculae and cysts are associated with bone marrow lesions (BMLs) in human knee osteoarthritis (... Read More about The rat osteoarthritis bone score for histological pathology relevant to human bone marrow lesions and pain. Immunomodulation and fibroblast dynamics driving nociceptive joint pain within inflammatory synovium: Unravelling mechanisms for therapeutic advancements in osteoarthritis (2024) Journal Article Wijesinghe, S. N., Ditchfield, C., Flynn, S., Agrawal, J., Davis, E. T., Dajas-Bailador, F., Chapman, V., & Jones, S. W. (2024). Immunomodulation and fibroblast dynamics driving nociceptive joint pain within inflammatory synovium: Unravelling mechanisms for therapeutic advancements in osteoarthritis. Osteoarthritis and Cartilage, 32(11), 1358-1370. https://doi.org/10.1016/j.joca.2024.06.011 Objective Synovitis is a widely accepted sign of osteoarthritis (OA), characterised by tissue hyperplasia, where increased infiltration of immune cells and proliferation of resident fibroblasts adopt a pro-inflammatory phenotype, and increased the p... Read More about Immunomodulation and fibroblast dynamics driving nociceptive joint pain within inflammatory synovium: Unravelling mechanisms for therapeutic advancements in osteoarthritis. Modelling the role of enzymatic pathways in the metabolism of docosahexaenoic acid by monocytes and its association with osteoarthritic pain (2024) Journal Article Franks, S. J., Gowler, P. R., Dunster, J. L., Turnbull, J., Gohir, S. A., Kelly, A., Valdes, A. M., King, J. R., Barrett, D. A., Chapman, V., & Preston, S. (2024). Modelling the role of enzymatic pathways in the metabolism of docosahexaenoic acid by monocytes and its association with osteoarthritic pain. Mathematical Biosciences, 374, Article 109228. https://doi.org/10.1016/j.mbs.2024.109228 Chronic pain is a major cause of disability and suffering in osteoarthritis (OA) patients. Endogenous specialised pro-resolving molecules (SPMs) curtail pro-inflammatory responses. One of the SPM intermediate oxylipins, 17-hydroxydocasahexaenoic acid... Read More about Modelling the role of enzymatic pathways in the metabolism of docosahexaenoic acid by monocytes and its association with osteoarthritic pain. Serum levels of hydroxylated metabolites of arachidonic acid cross-sectionally and longitudinally predict knee pain progression: an observational cohort study (2024) Journal Article Turnbull, J., Jha, R. R., Gowler, P. R., Ferrands-Bentley, R., Kim, D.-H., Barrett, D. A., Sarmanova, A., Fernandes, G. S., Doherty, M., Zhang, W., Walsh, D. A., Valdes, A. M., & Chapman, V. (2024). Serum levels of hydroxylated metabolites of arachidonic acid cross-sectionally and longitudinally predict knee pain progression: an observational cohort study. Osteoarthritis and Cartilage, 32(8), 990-1000. https://doi.org/10.1016/j.joca.2024.04.006 Objective: To examine associations between serum oxylipins, which regulate tissue repair and pain signalling, and knee pain/radiographic osteoarthritis (OA) at baseline and knee pain at 3 year follow-up. Method: Baseline, and 3 year follow-up, kne... Read More about Serum levels of hydroxylated metabolites of arachidonic acid cross-sectionally and longitudinally predict knee pain progression: an observational cohort study. The rat Osteoarthritis Bone Score: a new histological system for scoring subchondral pathology in rat knees analogous to histological correlates of human OA bone marrow lesions (2024) Presentation / Conference Contribution McWilliams, D. F., Shahtaheri, M., Koushesh, S., Joseph, C., Gowler, P., Chapman, V., Sofat, N., & Walsh, D. A. The rat Osteoarthritis Bone Score: a new histological system for scoring subchondral pathology in rat knees analogous to histological correlates of human OA bone marrow lesions. Presented at 2024 OARSI World Congress on Osteoarthritis, Vienna, Austria Purpose (the aim of the study): Bone marrow lesions (BMLs) are detected by MRI in the in human osteoarthritis (OA) subchondral bone and associated with pain. We previously described 7 histological features associated with BMLs from which we developed... Read More about The rat Osteoarthritis Bone Score: a new histological system for scoring subchondral pathology in rat knees analogous to histological correlates of human OA bone marrow lesions. Sustained morphine exposure alters spinal NMDA receptor and astrocyte expression and exacerbates chronic pain behavior in female rats (2024) Journal Article Gonçalves, S. V., Woodhams, S. G., Li, L., Hathway, G. J., & Chapman, V. (2024). Sustained morphine exposure alters spinal NMDA receptor and astrocyte expression and exacerbates chronic pain behavior in female rats. PAIN Reports, 9(2), Article e1145. https://doi.org/10.1097/pr9.0000000000001145 IntroductionSustained opioid use has long-term negative impacts on future pain experience, particularly in women. This study aimed to investigate the underlying spinal neurobiology of this clinical observation in an experimental model of joint pain.O... Read More about Sustained morphine exposure alters spinal NMDA receptor and astrocyte expression and exacerbates chronic pain behavior in female rats. No Evidence for Cognitive Impairment in an Experimental Rat Model of Knee Osteoarthritis and Associated Chronic Pain (2023) Journal Article Gonçalves, S., Hathway, G. J., Woodhams, S. G., Chapman, V., & Bast, T. (2023). No Evidence for Cognitive Impairment in an Experimental Rat Model of Knee Osteoarthritis and Associated Chronic Pain. Journal of Pain, 24(8), 1478-1492. https://doi.org/10.1016/j.jpain.2023.04.002 Although chronic pain states have been associated with impaired cognitive functions, including memory and cognitive flexibility, the cognitive effects of osteoarthritis (OA) pain remain to be clarified. The aim of this study was to measure cognitive... Read More about No Evidence for Cognitive Impairment in an Experimental Rat Model of Knee Osteoarthritis and Associated Chronic Pain. Evaluation of cannabidiol nanoparticles and nanoemulsion biodistribution in the central nervous system after intrathecal administration for the treatment of pain (2023) Journal Article Muresan, P., Woodhams, S., Smith, F., Taresco, V., Shah, J., Wong, M., Chapman, V., Smith, S., Hathway, G., Rahman, R., Gershkovich, P., & Marlow, M. (2023). Evaluation of cannabidiol nanoparticles and nanoemulsion biodistribution in the central nervous system after intrathecal administration for the treatment of pain. Nanomedicine: Nanotechnology, Biology and Medicine, 49, Article 102664. https://doi.org/10.1016/j.nano.2023.102664 We investigated how the biodistribution of cannabidiol (CBD) within the central nervous system (CNS) is influenced by two different formulations, an oil-in-water (O/W) nanoemulsion and polymer-coated nanoparticles (PCNPs). We observed that both CBD f... Read More about Evaluation of cannabidiol nanoparticles and nanoemulsion biodistribution in the central nervous system after intrathecal administration for the treatment of pain. Clinical and Preclinical Evidence for Roles of Soluble Epoxide Hydrolase in Osteoarthritis Knee Pain (2022) Journal Article Gowler, P. R. W., Turnbull, J., Shahtaheri, M., Gohir, S., Kelly, T., McReynolds, C., Yang, J., Jha, R. R., Fernandes, G. S., Zhang, W., Doherty, M., Walsh, D. A., Hammock, B. D., Valdes, A. M., Barrett, D. A., & Chapman, V. (2022). Clinical and Preclinical Evidence for Roles of Soluble Epoxide Hydrolase in Osteoarthritis Knee Pain. Arthritis and Rheumatology, 74(4), 623-633. https://doi.org/10.1002/art.42000 Objective: Chronic pain due to osteoarthritis (OA) is a major clinical problem, and existing analgesics often have limited beneficial effects and/or adverse effects, necessitating the development of novel therapies. Epoxyeicosatrienoic acids (EETs) a... Read More about Clinical and Preclinical Evidence for Roles of Soluble Epoxide Hydrolase in Osteoarthritis Knee Pain. Serum Levels of Proinflammatory Lipid Mediators and Specialized Proresolving Molecules Are Increased in Patients With Severe Acute Respiratory Syndrome Coronavirus 2 and Correlate With Markers of the Adaptive Immune Response (2022) Journal Article Turnbull, J., Jha, R. R., Ortori, C. A., Lunt, E., Tighe, P. J., Irving, W. L., Gohir, S. A., Kim, D.-H., Valdes, A. M., Tarr, A. W., Barrett, D. A., & Chapman, V. (2022). Serum Levels of Proinflammatory Lipid Mediators and Specialized Proresolving Molecules Are Increased in Patients With Severe Acute Respiratory Syndrome Coronavirus 2 and Correlate With Markers of the Adaptive Immune Response. Journal of Infectious Diseases, 225(12), 2142-2154. https://doi.org/10.1093/infdis/jiab632 BACKGROUND: Specialized proresolution molecules (SPMs) halt the transition to chronic pathogenic inflammation. We aimed to quantify serum levels of pro- and anti-inflammatory bioactive lipids in severe acute respiratory syndrome coronavirus 2 (SARS-C... Read More about Serum Levels of Proinflammatory Lipid Mediators and Specialized Proresolving Molecules Are Increased in Patients With Severe Acute Respiratory Syndrome Coronavirus 2 and Correlate With Markers of the Adaptive Immune Response. Serum levels of specialised pro-resolving molecule pathways are greatly increased in SARS-CoV-2 patients and correlate with markers of the adaptive immune response (2021) Preprint / Working Paper Turnbull, J., Jha, R., Ortori, C. A., Lunt, E., Tighe, P. J., Irving, W. L., Gohir, S. A., Kim, D.-H., Valdes, A. M., Tarr, A. W., Barrett, D. A., & Chapman, V. Serum levels of specialised pro-resolving molecule pathways are greatly increased in SARS-CoV-2 patients and correlate with markers of the adaptive immune response Background Specialised pro-resolution molecules (SPMs) halt the transition to chronic pathogenic inflammation. We aimed to quantify serum levels of pro- and anti-inflammatory bioactive lipids in SARS-CoV-2 patients, and to identify potential relation... Read More about Serum levels of specialised pro-resolving molecule pathways are greatly increased in SARS-CoV-2 patients and correlate with markers of the adaptive immune response. The anti-inflammatory effect of bacterial short chain fatty acids is partially mediated by endocannabinoids (2021) Journal Article Vijay, A., Kouraki, A., Gohir, S., Turnbull, J., Kelly, A., Chapman, V., Barrett, D. A., Bulsiewicz, W. J., & Valdes, A. M. (2021). The anti-inflammatory effect of bacterial short chain fatty acids is partially mediated by endocannabinoids. Gut Microbes, 13(1), Article 1997559. https://doi.org/10.1080/19490976.2021.1997559 The endocannabinoid (EC) system has pleiotropic functions in the body. It plays a key role in energy homeostasis and the development of metabolic disorders being a mediator in the relationship between the gut microbiota and host metabolism. In the cu... Read More about The anti-inflammatory effect of bacterial short chain fatty acids is partially mediated by endocannabinoids. Anxiety enhances pain in a model of osteoarthritis and is associated with altered endogenous opioid function and reduced opioid analgesia (2021) Journal Article Lillywhite, A., Woodhams, S. G., Gonçalves, S. V., Watson, D. J. G., Li, L., Burston, J. J., Gowler, P. R. W., Canals, M., Walsh, D. A., Hathway, G. J., & Chapman, V. (2021). Anxiety enhances pain in a model of osteoarthritis and is associated with altered endogenous opioid function and reduced opioid analgesia. PAIN Reports, 6(4), Article e956. https://doi.org/10.1097/PR9.0000000000000956 Introduction: Negative affect, including anxiety and depression, is prevalent in chronic pain states such as osteoarthritis (OA) and associated with greater use of opioid analgesics, potentially contributing to present and future opioid crises.... Read More about Anxiety enhances pain in a model of osteoarthritis and is associated with altered endogenous opioid function and reduced opioid analgesia. Metabolic signatures of osteoarthritis in urine using liquid chromatography‐high resolution tandem mass spectrometry (2021) Journal Article Abdelrazig, S., Ortori, C. A., Doherty, M., Valdes, A. M., Chapman, V., & Barrett, D. A. (2021). Metabolic signatures of osteoarthritis in urine using liquid chromatography‐high resolution tandem mass spectrometry. Metabolomics, 17(3), Article 29. https://doi.org/10.1007/s11306-021-01778-3 Introduction: Osteoarthritis (OA) is a common cause of disability in older people, but its aetiology is not yet fully understood. Biomarkers of OA from metabolomics studies have shown potential use in understanding the progression and pathophysiology... Read More about Metabolic signatures of osteoarthritis in urine using liquid chromatography‐high resolution tandem mass spectrometry. Neonatal complete Freund's adjuvant-induced inflammation does not induce or alter hyperalgesic priming or alter adult distributions of C-fibre dorsal horn innervation (2020) Journal Article Cooper, A. H., Hanmer, J. M., Chapman, V., & Hathway, G. J. (2020). Neonatal complete Freund's adjuvant-induced inflammation does not induce or alter hyperalgesic priming or alter adult distributions of C-fibre dorsal horn innervation. PAIN Reports, 5(6), Article e872. https://doi.org/10.1097/PR9.0000000000000872 Introduction: Inflammation during the neonatal period can exacerbate pain severity following reinjury in adulthood. This is driven by alterations in the postnatal development of spinal and supraspinal nociceptive circuitry. However, the contribution... Read More about Neonatal complete Freund's adjuvant-induced inflammation does not induce or alter hyperalgesic priming or alter adult distributions of C-fibre dorsal horn innervation. Contribution of nerves within osteochondral channels to osteoarthritis knee pain in humans and rats (2020) Journal Article Aso, K., Shahtaheri, S. M., Hill, R., Wilson, D., McWilliams, D. F., Nwosu, L. N., Chapman, V., & Walsh, D. A. (2020). Contribution of nerves within osteochondral channels to osteoarthritis knee pain in humans and rats. Osteoarthritis and Cartilage, https://doi.org/10.1016/j.joca.2020.05.010 © 2020 Osteoarthritis Research Society International Objectives: Subchondral bone may contribute to knee osteoarthritis (OA) pain. Nerve growth factor (NGF) can stimulate nerve growth through TrkA. We aimed to identify how sensory nerve growth at the... Read More about Contribution of nerves within osteochondral channels to osteoarthritis knee pain in humans and rats. Investigating musculoskeletal health and wellbeing; A cohort study protocol (2020) Journal Article Millar, B., McWilliams, D. F., Abhishek, A., Akin-Akinyosoye, K., Auer, D. P., Chapman, V., Doherty, M., Ferguson, E., Gladman, J. R., Greenhaff, P., Stocks, J., Valdes, A. M., & Walsh, D. A. (2020). Investigating musculoskeletal health and wellbeing; A cohort study protocol. BMC Musculoskeletal Disorders, 21(1), Article 182. https://doi.org/10.1186/s12891-020-03195-4 © 2020 The Author(s). Background: In an ageing population, pain, frailty and disability frequently coexist across a wide range of musculoskeletal diagnoses, but their associations remain incompletely understood. The Investigating Musculoskeletal Heal... Read More about Investigating musculoskeletal health and wellbeing; A cohort study protocol. Lipidomic identification of plasma lipids associated with pain behaviour and pathology in a mouse model of osteoarthritis (2020) Journal Article Pousinis, P., Gowler, P. R. W., Burston, J. J., Ortori, C. A., Chapman, V., & Barrett, D. A. (2020). Lipidomic identification of plasma lipids associated with pain behaviour and pathology in a mouse model of osteoarthritis. Metabolomics, 16(3), Article 32 (2020). https://doi.org/10.1007/s11306-020-01652-8 © 2020, The Author(s). Introduction: Osteoarthritis (OA) is the most common form of joint disease, causing pain and disability. Previous studies have demonstrated the role of lipid mediators in OA pathogenesis. Objectives: To explore potential altera... Read More about Lipidomic identification of plasma lipids associated with pain behaviour and pathology in a mouse model of osteoarthritis. Peripheral brain-derived neurotrophic factor contributes to chronic osteoarthritis joint pain (2020) Journal Article Gowler, P. R., Li, L., Woodhams, S. G., Bennett, A. J., Suzuki, R., Walsh, D. A., & Chapman, V. (2020). Peripheral brain-derived neurotrophic factor contributes to chronic osteoarthritis joint pain. PAIN, 161(1), 61-73. https://doi.org/10.1097/j.pain.0000000000001694 Brain-derived neurotrophic factor (BDNF) and the high-affinity receptor tropomyosin receptor kinase B (TrkB) have important roles in neuronal survival and in spinal sensitization mechanisms associated with chronic pain. Recent clinical evidence also... Read More about Peripheral brain-derived neurotrophic factor contributes to chronic osteoarthritis joint pain. Cell type–specific super-resolution imaging reveals an increase in calcium-permeable AMPA receptors at spinal peptidergic terminals as an anatomical correlate of inflammatory pain (2019) Journal Article Woodhams, S. G., Markus, R., Gowler, P. R., Self, T. J., & Chapman, V. (2019). Cell type–specific super-resolution imaging reveals an increase in calcium-permeable AMPA receptors at spinal peptidergic terminals as an anatomical correlate of inflammatory pain. PAIN, 160(11), 2641-2650. https://doi.org/10.1097/j.pain.0000000000001672 Spinal hyperexcitability is a key event in the development of persistent pain, and arises partly from alterations in the number and localization of α-amino-3-hydroxy-5-methyl-4-isoxazole propionate (AMPA)-type glutamate receptors. However, determinin... Read More about Cell type–specific super-resolution imaging reveals an increase in calcium-permeable AMPA receptors at spinal peptidergic terminals as an anatomical correlate of inflammatory pain. Showing 1 - 20 of 49 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}