{
    "url": "https://www.nottingham.ac.uk/paincentre/ppi/index.aspx",
    "content": [
        {
            "p": "Meeting and talking to people, groups and local communities is really important for telling people about our research. We will try and get out and about to meet as many people as we can to share our research news. We will also post information on-line to keep patients and the public up to date with our research. We will regularly post lay summaries of our research studies on our Research Publications page. Our strategy is to support people with chronic pain through a process of open and two-way communication to allow a better understanding of patient needs and priorities for research and quality of life. We will achieve this by facilitating public and patient engagement and involvement throughout all research activities and ensuring their opinions are embedded within all pain research at the University of Nottingham with involvement and collaboration across the School of Medicine and NUH (Nottingham University Hospitals) harmonising patient involvement of each and every pain research team, and across each disease. We will take a proactive approach to make our work as relevant, and our approach to research as transparent, to the public and patients as it is to all other stakeholders in chronic pain research. Our aim will be to support research leaders in the co-design of research by offering opportunities for training in the principals and practice of PPI/E whilst also continuing to grow and diversify our network of lay members to ensure sustainability. Our membership of Sharebank will encourage shared learning and resources to support our advisory group members to perform effectively and with confidence. We will work towards a model of co-production, co-creation of research design and inclusivity of all stakeholders including lay partners, scientists, and practitioners to ensure greater depth of understanding and to capture all opinion to drive innovation in pain research from bench to bedside. There are many ways you can help us and that we can help you. If you are a researcher with Pain Centre Vesrus Arthritis membership, you can request support in patient and public involvement and engagement for your project. Find out more about Patient and Public Involvement and Engagement support for your research If you are a member of the public and want to get involved, you could become a patient insight partner. Find out how to become a patient insight partner If you would like more information about engagement and research, please see our Key Topics pages. Find out more about the PPAG payment and expences policy Clinical Sciences Building City Hospital Nottingham, NG5 1PB telephone: +44 (0) 115 823 1766 ext 31766 fax: +44 (0) 115 823 1757 email: paincentre@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}