{
    "url": "https://www.nottingham.ac.uk/paincentre/studentships/index.aspx",
    "content": [
        {
            "p": "Epidemiology of Chronic shoulder pain and associated risk factors in the United Kingdom: a population-based study of UK primary care data using clinical practice research datalink (CPRD) - Nouf Al-Otaibi Foot and ankle OA (FAO) can significantly impact an individual's quality of life, causing pain, disability, and decreased mobility. However, it is still unclear whether the prevalence of FAO is higher in professional footballers compared to the general population. It is important l to identify the prevalence and risk factors of FAO in footballers to understand the long-term consequences of the sport and to inform the development of potential preventative and treatment strategies. Such information is relevant to football associations, unions, and stakeholders interested in the health of retired and current professional football players. The current study examines whether male retired professional footballers have a higher risk of FAO than control men in the general population. Objectives 1. To compare the prevalence of self-reported FAO, defined by foot and ankle pain, self-reported FAO, and ankle/toe surgery, between male retired professional footballers in the UK and general population control men in the East Midlands using a postal questionnaire. 2. To determine the prevalence of symptomatic and asymptomatic radiographic FAO in a sample of retired professional footballers and general population control men who returned the questionnaire, irrespective of FAO status. 3. To determine football-related risk factors for radiographic FAO in male retired professional footballers. 4. To compare the differences in self-reported quality of life and performance-related functional outcomes (using four square step test and the 10-metre walk test, undertaken in the same participants that underwent radiographic assessment) between male retired professional footballers and the general population control men. Arabic translation, cultural adaptation, and psychometric validation of a measure of patient’s outcome expectations in the musculoskeletal population BSc, MSc in physiotherapy PhD student at the School of Health Sciences, University of Nottingham, Nottingham. Mohamed is a senior lecturer at the Faculty of Medical Technology at Bani Waleed University, Bani Waleed, Libya, in the Department of Physiotherapy. He is a senior physiotherapist working either independently or with a variety of clinics in Libya. He is currently doing a PhD on patient outcome expectations. His research is about translating, cross-culturally adapting, and psychometrically validating a measure of outcome expectations. He is a researcher who is interested in musculoskeletal disorders, rehabilitation, physiotherapy, self-reported measures, psychometric properties, and patient expectations, with experience in systematic reviews. Chronic pain can be difficult to detect and diagnose, as pain levels fluctuate for an individual daily. Therefore, sensors in the home may be suitable for monitoring the effects of pain over a period much longer than a clinical consultation. However, if we are to place sensors within the home, we need to understand how they can collect data which is sufficient to inform the user and clinician about health status, whilst still being acceptable to that end user. If pain can be sensed and understood, there may be the opportunity to develop assistive technology that can then respond appropriately and be integrated with pain management plans. Robotic pain management interventions using distraction or relaxation techniques have shown promise, but little research has been conducted to understand the desires of older adults experiencing pain, despite this being the largest pain demographic. Alongside the PhD industry partner, ExtraCare Charitable Trust, this project will include a series of co-design activities alongside older adults living with pain within retirement villages. Using surveys, interviews, focus groups, and other design workshops, we hope to understand the needs of this demographic to develop assistive robotic technologies for pain management, with a particular focus on acceptability, usability, and accessibility. Immersive virtual reality (VR) is a computer-generated device that covers all the user’s points of view. Immersive VR is utilised to rehabilitate patients with various conditions associated with pain. However, there is growing interest in utilising immersive VR for musculoskeletal pain. This is important as chronic low back pain (CLBP) has been considered a leading cause of disability among adults for three decades, with limited treatment options approved by international guidelines. In addition, the feasibility of new technology is influenced by contextual and sociocultural factors. Moreover, few studies investigated immersive VR's feasibility, acceptability, and tolerability among patients with CLBP and in the Kingdom of Saudi Arabia (KSA). Therefore, this study follows the Medical Research Council’s framework for complex interventions. Initially, an overview of systematic reviews was conducted to investigate the effectiveness of VR in patients with musculoskeletal pain and disability. In addition, patients and public involvement groups played an active role in informing the development of the immersive VR protocol designed to test the feasibility of administering the immersive VR intervention for patients with CLBP in the KSA. Therefore, a mixed-methods, explanatory sequential study design is conducted in a single-centre setting, comprising a one-group pre-intervention and post-intervention feasibility trial. Qualitative semi-structured one-on-one interviews with patients and HCPs follow the quantitative phase. The study is expected to lead future research in the field. Knee pain and multimorbidity in retired male professional football players and general population control men Retired professional footballers have a higher injury rate of lower limbs joints. These injuries might results to short and long-term effects such as chronic pain and osteoarthritis (OA). However, they may be less likely to have other long-term conditions such as diabetes, cardiovascular disease and cancer due to their levels of physical fitness but a higher prevalence of mental health problems. The presence of multimorbidity (≥2 long-term conditions) is increasing within the general population but whether footballers are more or less likely to have multimorbidity remains unknown. The association between professional footballers and risk of long-term health consequences, including OA and multimorbidity after retirement, is an important concern due to its impact on their health, wellbeing and quality of life. The aim of this PhD is to examine the incidence of knee pain (KP) and multimorbidity in male retired professional footballers compared to men in the general population. Personalised approaches to the management of chronic musculoskeletal pain in people with Rheumatoid Arthritis Chronic pain is a major cause of disability worldwide. There is discrepancy between the pain level and the actual tissue damage. Central sensitisation, defined by IASP as increased responsiveness of nociceptive neurons in CNS to their normal or subthreshold stimuli, has been implicated in this discrepancy. Various rheumatological conditions showed features of central sensitisation (CS) such as fibromyalgia, rheumatoid arthritis, and osteoarthritis. Central sensitisation is usually associated with poor treatment outcomes, so it is important to reduce it. Exercise has the potential to decrease CS. This effect is robust in pain-free population, however in people with chronic pain it might be more dependent on exercise dosage. Although the mechanisms underlying exercise-induced hypoalgesia are not completely understood, it was found by many researchers that it has a robust effect on the descending inhibitory pathways. Other studies showed that exercise inhibits the facilitatory pathway by investigating the effect of exercise on temporal summation. Additionally, it was observed by neuroimaging that exercise might have effects on brain neurobiology in a chronic musculoskeletal pain population. My hypothesis is that Exercise reduces central nervous system mechanisms that increase pain in people with rheumatoid arthritis. My aim is to design the optimal exercise program to reduce central sensitisation.I will start my research project by doing a systematic review to underpin the exercise intervention/s types and dosage/s associated with the greatest reductions in indices of CS. After that, an RCT in people with rheumatoid arthritis will be designed comparing exercise with control to explore the effect of the exercise therapy on central sensitisation mechanisms of pain in RA population. Dimitros Amantis Commenced: October 2017 Supervisors: Lucy Donaldson Practically I will aim to understand how pain progresses during the disease specifically in the peripheral nervous system in conjunction with the signalling to the CNS. Moreover, given the inconsistency of the drugs that currently exist against OA, I will focus my research on understanding the basic mechanisms of VEGFA isoforms when used against OA, since there are evidence that targeting VEFGA can reduce pain. However the question of what happens to the inflammation still stands. Moving forward in the next steps of the PhD I will try to tackle the question of how inflammation progresses and alters in conjuction to pain. Wendy Chaplin Commenced: October 2019 Supervisors: David Walsh, John Gladman and Dan McWilliams As the average lifespan increases, the number of years in good health struggles to keep pace. Accumulation of currently incurable conditions with increasing age leads to increasing health impairment and reduced quality of life. Musculoskeletal pain, for example, due to osteoarthritis, is increasingly prevalent, and, as well as directly causing distress, contributes to reduced independence and increases health care and societal costs. Knee osteoarthritis causes severe pain and reduced mobility, and reduced activity and increasing sedentary behaviour contribute to increased morbidity and mortality. Frailty is a vulnerability state seen in older people due to multi-organ age-associated decline and is characterised by homeostatic failure in response to challenge. Understanding the link between musculoskeletal pain and frailty may help develop and target treatments that facilitate healthy ageing. This project takes advantage of the multidisciplinary research environment and patient cohorts developed in Nottingham within the NIHR Nottingham Biomedical Research Centre and Pain Centre Versus Arthritis. The Investigating Musculoskeletal Health and Wellbeing survey is a questionnaire-based research study which collects annual information from people with different degrees of pain and frailty. Ayah Ismail Commented: October 2018 Supervisors: Weiya Zhang, Michael Doherty, Michelle Hall Adrian Haywood Contributions of spinal and supraspinal sites to the pain assocated with osteoarthritis Adele Edwards Developmental changes in neural stem cell responses in the spinal cord and the influence of painful stimulation Amanda Lillywhite Investigation of the influence of innate anxiety on functional connectivity in animal models of osteoarthritis pain Junting Huang Investigation of inflammatory mechanisms in models of osteoarthritic pain Luting Xu (Tracey) The role of TRPV1 signalling in osteoclastogenesis and pain in osteoarthritis Kun Zuo The contextual effect of treatment in osteoarthritis Hamza Alshuft Structural brain changes in chronic pain of knee osteoarthritis Louis Brailsford The role of lipid signalling in osteoclasts: contributions to osteoarthritic pain Xi Chen The placebo effect and its determinants in fibromyalgia Charles Greenspon Postnatal neurophysiological development of nociception: integration and representation into supraspinal networks Fatimah Almahasneh Role of prostaglandins in the periaqueductal gray in the central modulation of osteoarthritis pain Meesawatsom Pongsatorn (Den) Targeting the resolution of inflammation to reduce spinal excitability and pain Lilian Nwosu Structural pain modification in models of osteoarthritis Monica Persson Relative efficacy of topical NSAIDs and topical capsaicin in osteoarthritis and neuropathic pain Laura Stoppiello Structural associations of pain in human knee osteoarthritis Subhashisa Swain Commenced: February 2018 Supervisors: Weiya Zhang, Carol Coupland and Mike Doherty Epidemiology of Osteoarthritis and it’s comorbidities Osteoarthritis (OA) is one of the common chronic conditions in older people and often causes chronic joint pain and disability. Despite the rise in multimorbidity there is little information available on the proportion of people with OA have multiple chronic conditions and how it changes with time. According to a recent research, three out of ten people in the UK have more than at least one long term condition. However, the pattern and association of these conditions with OA is not well understood. This research aims to use advanced statistical techniques to understand the epidemiology of OA in the UK and multiple chronic conditions associated with. Furthermore, the risk, burden and impact of multiple chronic conditions in OA will be studied in detail. Emma Battell Supervisors: Gareth Hathway and Lucy Donaldson Supraspinal centres serve critical roles in producing behavioral responses to pain and modulating the excitability of spinal pain networks. This descending pain modulation system (DPMS) comprises several centres in the brain with the periaqueductal grey (PAG) serving as an integrative centre. The PAG has significant afferent input from the forebrain and limbic system and an efferent projection to the brainstem. Significant postnatal changes occur in the PAG and brainstem that profoundly effect sensory processing. This project aims to detail changes in the function and connectivity of the PAG across postnatal development. Afroditi Kouraki Commenced: May 2019 Supervisors: Professor Ana M. Valdes, Dr Tobias Bast, Professor Eamonn Ferguson This project utilised both advanced statistical analysis and clinical-based research to identify how psychological (anxiety and cognitive ability), social (social deprivation/isolation, education) and biological (genetics and the gut microbiome) factors interact in their contribution to chronic pain. We identified common threads that link cognitive ability and anxiety with social and biological factors regardless of whether we looked at a clinical sample, a longitudinal panel, or genetic and gut microbiome data. These multilevel findings link together the pathways through which psychological, social and biological factors contribute to pain mechanisms and pain-related outcomes and suggest that chronic pain is a complex phenomenon that we have to approach from a holistic point of view. Khalid Yaseen Supervisors: Abhishek Abhishek, Michelle Hall, Mike Doherty and Weiya Zhang Polykarpos Angelos Nomikos Commenced: December 2017 Supervisors: Abhishek Abhishek, Michelle Hall, Roshan das Nair and Ana Waldes Knee OA manifests clinically with pain, stiffness and disability. Knee pain is a common problem, with 25% of the population older than 55 years in age having persistent knee pain and knee pain present on most days of the previous month, is present in one in five adults over the age of 40 years. National Institute for Health and Care Excellence (NICE) have recommended core, adjunctive non-pharmacological and pharmacological treatments for OA. However, core treatments suggested by NICE are under-utilised as both doctors and patients often focus predominantly on pharmacological systemic analgesics alone. Doctors do not appear to be best suited for managing knee pain due to OA. Even enhanced GP consultations based on an OA guidebook followed by referral to a practice nurse-led OA clinic and provision of a written information on OA did not improve several quality indicators for knee OA. The overall purpose of the study is to test the feasibility of conducting a RCT of a nurse-led complex intervention comprising education, non-pharmacological and pharmacological principles of management of OA and knee pain. Gabriela Sandoval-Plata Commenced: October 2018 Supervisors: Abhishek Abhishek and Kevin Morgan Gout is one of the most common forms of inflammatory arthritis, with a prevalence of 2.49% in the UK. It is characterised by abrupt episodes of acute inflammation and severe pain in joints due to monosodium urate (MSU) crystals deposition as a consequence of hyperuricemia. Despite being crucial to gout, hyperuricemia does not necessarily cause the disease, but the reasons underlying the progress from asymptomatic crystal deposition in people with hyperuricemia to gout remains unclear. Moreover, clinical variation among patients with gout in terms of the age of onset, frequency of attacks and the development of tophi is still poorly understood. Based on the fundamental role of the NLRP3 inflammasome and toll-like receptors (TLR) pathway in the immune response to MSU crystals, the aims of the present project is to analyse gene expression of inflammasome and TLR-related genes to: (1) evaluate if it is influenced by serum uric acid levels, (2) evaluate whether a differential expression is associated to the development of symptomatic gout, and (3) explore the expression profile during acute and intercritical gout. In addition, polygenic risk models will be developed to distinguish gout cases vs controls, and to determine risk for gout in people with hyperuricaemia who has not developed gout. Asta Tranholm Supervisor: Cornelia de Moor Sameer Gohir Commenced: January 2018 Supervisors: Paul Greenhaff, Ahbishek Abhishek and Ana Valdes Burak Kundakci Commenced: April 2017 Fibromyalgia (FM) is a common chronic condition that manifests with chronic widespread pain or multiple regional pain, and with other associated core symptoms of fatigue, non-restorative sleep and cognitive dysfunction. After osteoarthritis, FM is the second most common rheumatologic condition, and affects 2-8% of the whole population. Universally guidelines on the management of FM support a multi-faceted approach combining non-pharmacological interventions as first-line therapy and pharmacological interventions as adjunctive treatment, with an emphasis on an individualised patient-centred approach. The overall purpose of the research project is the development of an optimal non-pharmacological treatment package for FM. It primarily aims to estimate the efficacy and relative efficacy of all non-pharmacological interventions, select the most efficacious, accessible and applicable interventions and bring them together as a package of care. Firstly, studies comparing a non-pharmacological intervention versus a non-intervention will be used to calculate overall effect sizes for each non-pharmacological treatment by conducting a conventional meta-analysis. Secondly, these treatments will be prioritised by Network Meta-Analysis using direct and indirect evidence. Finally, a Delphi exercise (consensus building) will be undertaken among patients and healthcare professionals to select the most effective and accessible interventions. Arman Tadjibaev Commenced: October 2016 Supervisors: Dorothee Auer and Sarina Iwabuchi A link between chronic pain and anxiety Incidence of anxiety disorders among chronic pain patients is disproportionately higher than in general population. Anxious pain patients are characterized by decreased pain thresholds, increased pain levels, more daily complaints, poorer quality of life and worse outcome of treatment. Underlying mechanisms of negative influence of anxiety on pain are still poorly understood. The main aim of my research is to understand neural mechanisms of coexistence of two disorders and to suggest new methods of treatment and management of chronic pain conditions with co-morbid anxiety. Commenced: September 2015 Supervisor: Victoria Chapman Matthew Swift Commenced: September 2016 Supervisors: Lucy Donaldson and David Bates Chronic pain is a major worldwide health burden with an asymmetry between prevalence and effective treatments. Additionally, chemotherapy induced peripheral neuropathy (CIPN) is emerging as a major contributor to the aforementioned burden, and a limiting factor in the supply of chemotherapy regimens. Thus, there is a large demand for the rapid development of novel analgesic drugs with which to counter the growing requirement for efficacious therapeutics. One such approach is modulation of Vascular Endothelial Growth Factor (VEGF) synthesis. Different isoforms of VEGF have profound neuroprotective and anti-nociceptive functions. Therefore, my project is centred on developing a series of potential therapeutics that would initiate synthesis of these VEGF isoforms over those that normally predominate in pain states. This provides a new and innovative approach to pain management therapy. Amer Imraish Commenced: October 2014 Supervisor: Gareth Hathway Age-related Changes in the Phenotype of Spinal Microglia Lydia Sinnett-Smith Sara Gonçalves Supervisors: Vicky Chapman, Gareth Hathway and Tobias Blast Emma Dayman Pain pathways mature over the first weeks and months of life in rodents, and years in humans. In early life, thresholds to painful stimuli are lowered and behavioural responses to noxious stimuli are altered. Previous work has demonstrated that inflammatory stimulus leads to different nociceptive responses in the early life, compared with adulthood. My research aims to characterise the ability of various inflammatory stimuli to prime the nociceptive pathways in early life, and identify key differences in immunological and pain responses between neonates and adults. Furthermore, we will determine the impact this has on the response of the nociceptive system to re-exposure to inflammatory signals later in life. This project will use a range of in vivo and in vitro approaches to compare inflammatory processes in response to single and repeat inflammation in cutaneous tissue at different postnatal ages in rats. Techniques including FACS analysis, immunohistochemistry linked to fluorescence microscopy and pain behaviour assays will be utilised. We will also perform quantification of alterations in the expression of key genes involved in inflammatory processing in isolated inflammatory cells. Alexandra Durrant Supervisors: Lucy Donaldson and Nick Beazley-Long Vasileios Georgopoulos Supervisor: David Walsh Vicki Simmonds Commenced: October 2013 Supervisors: John Harris and Carl Stevenson Siew Li Goh Commenced: October 2015 Supervisors: Weiya Zhang, Mike Doherty and Michelle Hall Kehinde Akin-Akinyosoye Commenced: October 2015. Commencted: April 2010 Supervisor: R Dineen Hamza was appointed to investigate the structural brain changes associated with chronic pain of knee osteoarthritis. Up-to-date structural image analysis tools were used to quantitatively analyse high-resolution brain images obtained using advanced MRI scanning techniques. Commencted: January 2011 Supervisor: A Bennett Osteoclasts have an important role in bone remodelling and have been shown to contribute to bone cancer induced pain. Both clinical and preclinical evidence supports a role of osteoclasts in osteoarthritis, which is associated with bone remodelling and chronic pain. This project investigated the signalling pathways which mediate osteoclastogenesis using a combination of molecular biology, primary cell culture, mass spectrometry and fluorescence imaging techniques. The potential interactions of these signalling pathways with peripheral pain mechanisms were assessed in models of osteoarthritic pain. Commencted: November 2011 Supervisor: W Zhang The project investigated the placebo effect in fibromyalgia and its potential determinants in randomized controlled trials. Meta-analysis was used to summarise the placebo and nocebo effects for different types of placebos. The effect sizes were compared between fibromyalgia and osteoarthritis. The duration of the placebo effect and associated factors were examined. Dates: September 2011 - July 2014 Supervisor: V Chapman The contribution of peripheral and central inflammatory responses to pain responses associated with osteoarthritis (OA) will be studied in models of OA pain. Techniques will include behavioural studies of pain responses and ex vivo analysis of tissues from these models. Immunohistochemistry, western blotting and RT-PCR will be used to investigate expression levels of receptors, cytokines and other pro- and anti-inflammatory mediators in these models of OA pain. Dates: October 2010 - Sept 2014 Luting (Tracey) focused on elucidating the mechanism underlying the formation of osteoclast in OA and how it was associated with OA pain. Molecular biology, gene expression analysis and cytohisochemistry techniques were employed. The PhD programme focusses on the TRPV1 signaling pathway, modulation by lipid metabolism and its relationship with pathological bone remodeling in osteoarthritic joints. Dates: October 2011 - July 2014 Kun undertook a project to examine the relative effect of placebo (contextual effect) in complementary therapy in osteoarthritis (OA). The PhD project investigated the effect size of the contextual effect for each complimentary treatment modality. Comparisons were made between treatments, as well as between OA and other chronic painful conditions (fibromyalgia and rheumatoid arthritis). Meta-analysis was used to combine results and different treatment categories and determinants of the contextual effect and related adverse events (nocebo effects) were also examined. Dates: October 2011 - October 2015 Supervisor: D Walsh Laura Wyatt (nee Stoppiello) A comparison of structural and biochemical factors in joint tissues from knees of patients undergoing joint replacement surgery for OA pain with those with similar degrees of chondropathy that have been obtained post mortem from people who have not sought help for knee pain. The development of key structural and biochemical changes with OA disease progression will be determined by comparing human tissues to OA models. Knee joint structural and biochemical changes predicting pain phenotype will be explored. Finally, one key molecular or structural target emerging from these studies will be tested in interventional studies in an appropriately validated model. Dates: January 2015 - May 2018 Supervisor: G Hathway My project aimed to understand fundamental physiological aspects of chronic pain by understanding how both the spinal cord and brain respond and adapt to it. This was done using a model of arthritis so that any discoveries made are relevant to many people who are in pain. The techniques that this project developed should provide a framework for further comprehensive work to be done that may be more relevant in a clinical setting. Furthermore, this project was particularly interested in how the pathways and networks that are relevant to chronic pain develop in adolescence. Significant work was done to measure and understand how neural nociceptive-evoked activity changes over development. Dates: April 2014 - March 2018 Supervisor: L Donaldson The experience of pain in osteoarthritis (OA) is significantly affected by central pathways of pain modulation, where the midbrain periaqueductal gray (PAG) is known to play a crucial role through central sensitization and hyperalgesia. Prostaglandins (PGs) enhance nociceptive transmission both peripherally and centrally, and have been recognized as mediators of PAG-facilitated modulation of pain. This study aims to look into the role of PGs in the PAG in the descending facilitation of nociception in OA using the monoiodoacetate (MIA) model, as well as the complete Freud's adjuvant (CFA) model of inflammatory arthritis, and conduct a comparison between the two models. Techniques such as PCR, immunofluorescence and electromyography (EMG) recording will be used in this project. Dates: October 2013 - September 2017 Reham Baamer Dates: October 2019 - July 2024 Supervisors: Roger Knaggs, Li Shean Toh, Dileep Lobo Postoperative pain assessment and opioid utilisation following colectomy Opioid analgesics have an established role in managing acute pain following surgery and may facilitate recovery. However, several factors have recently contributed to an increase in persistent postoperative opioid use in some countries. These factors include the reliance on unidimensional pain assessment tools, use of different types and formulations of opioids along with varying patterns of opioid prescribing. Persistent opioid use is now widely acknowledged as a surgical complication which can be associated with a range of harms, including physical dependence, tolerance, and opioid diversion. Despite the risk of persistent opioid use after colectomy being assessed in the US and Canada, the extent to which this complication exists within the UK remains unexplored. This PhD project aims to identify trends of opioid prescribing, and the prevalence and predictors of persistent post-discharge opioid use following colectomy using linked electronic healthcare data from England. The project will also include a systematic review to summarise the evidence around pain assessment tools used following surgery and identify novel tools that assess how pain interferes with functional recovery. Catherine Owles Dates: May 2015 - September 2019 Investigations of the origins of altered pain perception in a commercial pig strain This project examined the relationship between degenerative joint disease (osteoarthritis) and pain in commercial breeder pigs. Pain behaviours were evaluated in commercial pigs and the relationship to joint disorders evaluated by assessing joint chondropathy, changes in the phenotype of sensory nerves innervating the affected joint, changes in the spinal cord and changes in the synovium and synovial fluid. The results found in pigs were then compared to a well validated rodent model of osteoarthritis pain, with a secondary aim of the project to evaluate pig joint disease as a model of human osteoarthritis. Dates: October 2015 - September 2019 Supervisors: Weiya Zhang The project aimed to better understand the mechanism of pain in osteoarthritis. It did so by identifying treatment responders, making comparisons between treatments with different mechanisms of action, and between osteoarthritic and neuropathic pain. Conventional, network, and individual patient data meta-analyses of randomised controlled trials evaluating the efficacy of topical NSAIDs and topical capsaicin in osteoarthritis were conducted. The relative efficacy of both treatments was assessed in osteoarthritis, and treatment responders was identified. Comparisons were made with randomised controlled trials of neuropathic pain. Nuria Casanova Vallve Dates: January 2015 - September 2019 Back to Top Clinical Sciences Building City Hospital Nottingham, NG5 1PB telephone: +44 (0) 115 823 1766 ext 31766 fax: +44 (0) 115 823 1757 email: paincentre@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}