{
    "url": "https://www.nottingham.ac.uk/paincentre/training.aspx",
    "content": [
        {
            "p": "Pain Centre Versus Arthritis pursues international excellence in multidisciplinary musculoskeletal research across the translational pathway. We aim to enhance our understanding of pain and arthritis with the goal of improving the treatment and lives of people with these conditions. The Pain Centre Versus Arthritis provides continuous training for researchers at all stages of their career. This training aims to facilitate our researchers’ goal of achieving international excellence in multidisciplinary musculoskeletal research across the translational pathway. Our training aims to provide our researchers with the skills needed to increase fundamental knowledge, increase research impact in musculoskeletal health and wellbeing and improve patient benefit. We provide PhD training for clinical and non-clinical scientists across a wide range of research themes in collaboration with the Musculoskeletal theme of the NIHR Nottingham Biomedical Research Centre and the University of Nottingham Doctoral Training Programmes. Our MSK and pain research training is tailored for the specific programmes of research undertaken, combining study design and technological innovation, knowledge and understanding. Previous and current PhD students have undertaken projects which enhance our understanding of pain and arthritis. Key components: We provide a broad range of topics via our research seminar programmes, which include internal programmes made up of short seminars and research update presentations by members of the Centre. These informal meetings provide an opportunity for researchers at all career stages to develop their presentation style and confidence. These meetings are attended by our Investigators, who provide feedback both on the study design and interpretation of findings in a supportive and constructive manner. We also host external meetings each year. These include invited external speakers and a small number of internal speakers to provide a half-day session on a distinct topic. We fully recognise the importance of making these meetings inclusive and welcoming to all our members and we aim to provide a supportive environment. Investigators and junior colleagues present at these meetings, providing everyone with exposure to a wide range of presentation styles. We encourage junior colleagues to have the confidence to ask questions, which aids their development for when attending external meetings. Our meetings provide an opportunity for discussion over refreshments, and we encourage interactions between all our non-clinical and clinical researchers at all stages of their careers. Our research meetings help our researchers to develop their research knowledge and network of collaborators, planting the seeds of new research ideas and experimental approaches to help them fulfil their research ambition. The Pain Centre Versus Arthritis provides a training platform to deliver the next generation of research leaders in musculoskeletal health, thereby increasing the UK's capacity for research in this important area of unmet clinical need. We achieve this by providing training in innovative research approaches which underpin our current research programmes. Our researchers are made aware of our research capabilities and opportunities to embed innovative technologies into their research programmes via our Internal and External Seminar Programmes, our regular Research Update Meetings and University of Nottingham led seminars hosted by the Schools of Medicine, Life Sciences, Pharmacy and Psychology, and cross Faculty events such as Neurochat. Our investigators have multidisciplinary research expertise in: pain; bone and cartilage biology; rheumatology; imaging; epidemiology and evidence based medicine; biobanks; preclinical modelling; orthopaedics; biomechanics; psychology; genetics; skeletal muscle physiology; metabolism and biochemistry; exercise physiology; rehabilitation; complex intervention development and its evaluation. We are committed to training the next generation of researchers, building capacity in these vital areas. Pain Centre Versus Arthritis School of Medicine School of Life Sciences School of Pharmacy School of Psychology Researcher Academy International Office Versus Arthritis Administrative Co-ordinator tel: +44(0)115 82 31766 School of Medicine postgraduate training information Clinical Sciences Building City Hospital Nottingham, NG5 1PB telephone: +44 (0) 115 823 1766 ext 31766 fax: +44 (0) 115 823 1757 email: paincentre@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}