{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/advanced-building-performance-engineering-msc",
    "content": [
        {
            "p": "Our Building Performance Engineering MSc is designed to provide you with a high level of engineering and technical expertise in energy conversion processes, combined with practical abilities in management-related issues. This programme is tailored towards graduates in engineering, science and related disciplines. The strong emphasis on science, technology and engineering is specifically targeted towards subject areas within the context of renewable and sustainable energy technologies and the built environment and uniquely combines this with effective management skills, economic appraisal and an understanding of the current policies and regulations that can be applied within modern industry in the UK, EU and internationally. This course offers a unique combination of advanced engineering and technology-focused study, combined with management, current regulations and auditing skills. and 5th in the UK for Architecture QS World University Rankings by Subject 2023 in the Russell Group universities for ‘overall satisfaction’ in Architecture The National Student Survey 2022 in Architecture Times Good University Guide 2023 The course comprises 180 credits, split across 120 credits worth of taught modules during autumn and spring semesters, and a 60-credit dissertation on an individually chosen topic completed over the summer period. This will be your opportunity to undertake a major piece of independent research, using the knowledge and experience gained during the course. Students will be able to discuss the design of building systems that provide heating, cooling, lighting, and acceptable air quality for small and large-scale buildings, and estimate their running costs and greenhouse gas emissions. This module introduces the building services technologies and environmental control systems required to control heating, cooling, ventilation, lighting, and the acoustics of large and small buildings. It discusses the reasons for using mechanical over passive systems and design issues relating to: Delivery Assessment method This module equips students with the knowledge and understanding needed to: This module introduces the requirements for information management and 3D modelling. It is based on the primary International and British Standards and Specifications directly associated with BIM Level 2. The module covers information management processes and develops the capability to model and co-ordinate heating and ventilation systems. It also covers the requirements for and purposes of component and systems data for the purpose of asset management. This module provides competence in the use of a range of industry-standard environmental simulation tools and the ability to apply them to inform building design. This module introduces a range of software simulation tools used to explore and develop environmental strategies in buildings. The tools are used to undertake basic site analysis; select an appropriate environmental strategy; consider the effects of solar radiation on heating, cooling, and daylighting systems; to design appropriate ventilation strategies; conduct dynamic thermal and plant simulations; and to predict and reduce the energy demand and carbon emissions of a building. The aim of this module To identify the need for sustainable development and to show how the energy and environmental sustainability of buildings can be determined and improved. Highlight the importance of the internet of things and the development of smart systems. Use a standard assessment procedure to determine the lifetime sustainability of a building. This module begins by discussing current worldwide energy resources and energy demand, international carbon reduction targets, and the need for sustainable development. Within this context, it describes the methods and technologies used to convert those energy sources to usable forms, such as thermal, mechanical, and electrical energies, and used by built environment systems. Their relative performance, economics, and environmental impacts, are considered and improvements are discussed. The ability of environmental systems to record and share performance data can be exploited to improving their performance so that they become smart systems. The Building Research Establishment Environmental Assessment Method (BREEAM) is identified as a method of assessing, rating, and certifying the sustainability of buildings and students will complete training that would allow them to sit the examination (not included) to become a certified BREEAM Assessor. This module enables students to acquire the core skills used in research, and to practice these through exploration of a specialist subject relevant to architecture and the built environment. This module covers the skills and resources needed to conduct independent academic research, including how to present findings effectively. It will cover choosing a research topic, how to shape research literature search techniques, including the use of the web. As a result, students will be able to conduct their own primary research, including quantitative and qualitative methodologies; data collection and simple statistical analysis. Opportunities to practice these skills will be presented through participation in a mixture of lectures, seminars and workshops designed to introduce specialist subject areas relevant to the field of architecture and related disciplines. This module aims to enable students to plan, implement and write up a substantial piece of original research which will make a contribution to the intellectual life of the discipline. This module seeks to enable students to: You will learn by listening to and participating in, lectures, seminars, and design tutorials. You will also be expected to complete self-study. You will have access to on-campus library facilities. You will spend 12 hours a week learning through lectures and/or seminars. This does not include your independent study time. We expect 10 hours of study (which includes contact time) per 1 credit. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Our step-by-step guide covers everything you need to know about applying. University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. Most schools and departments are based here. You will have access to libraries, shops, cafes, the Students’ Union, sports village and a health centre. You can walk or cycle around campus. Free hopper buses connect you to our other campuses. Nottingham city centre is 15 minutes away by public bus or tram. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you may factor some additional costs into your budget, alongside your tuition fees and living expenses. You should be able to access most of the books you’ll need through our libraries, though you may wish to purchase your own copies or more specific titles which could cost up to £100 per year. In addition to this you may spend up to £50 per on printing and up to £50 on model making and drawing equipment. Please note that these figures are approximate and subject to change. Students on this course undertake training that enables them to take exams to become a Passivhaus Designer and a BREEAM environment assessor. Taking these exams isn't required to graduate, however the cost of the exams must be met by students. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Wednesday 24 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}