{
    "url": "https://www.nottingham.edu.my/pgstudy/course/taught/biotechnology-msc",
    "content": [
        {
            "p": "UNM/JPT-N/421/7/0058(10/25)MQA/SWA11731 MSc Biotechnology is a postgraduate taught programme that aims to address global challenges in the area of food security, reduce hunger, bioproduction and bioprocesses for industrial applications, novel drug discovery and therapeutic biotechnology. Students are expected to attend to all lectures and formal teaching sessions as prescribed. All lecture materials will be made available online through Moodle to allow students unlimited access to the programme content both on and off campus. This programme deepens the understanding of fundamental and applied concepts in Biotechnology such as antimicrobial drug resistance, plant/crop improvements, genetic engineering techniques, bioprocessing, synthetic biology and bioinformatics. It embeds an expectation that students will undertake their research projects with an industrial partner, as a significant element of the degree qualification. This aspect would provide an invaluable real-life work-based experience and skills for prospective students. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. At least a second class honours degree (or international equivalent) in Biotechnology, Agricultural Sciences, Microbial Sciences, Medical Sciences, Pharmaceutical Sciences, Genetics, Microbiology, or subjects related to life sciences. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Applicants must have graduated from an approved university. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. MSc Biotechnology graduates go on to work in a diverse range of roles and markets with job titles including the research scientists in institutes and biotechnology companies; lecturers and teachers; technical and sales positions in the biotechnology industry; intellectual property advisers; laboratory officers; advisors in management or consultancy, entrepreneurs and science writers, as well as administrative positions in oil palm state and other plant and food industries. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}