{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/accounting-and-finance-msc",
    "content": [
        {
            "p": "Our MSc Accounting and Finance has developed an excellent reputation for its popularity and impact. It is appropriate for candidates interested in persuading careers in accounting and finance across a wide range of sectors: business, finance, banking, accounting, auditing and consulting. Our MSc Accounting and Finance will build on the business skills you gained in your undergraduate studies and equip you with specialist knowledge in financial accounting, management accounting, corporate finance, financial analysis and corporate governance. In addition to helping in enhancing your lucrative career opportunities in the multinational accounting and finance sector our MSc Accounting and Finance help those who aim to advance their studies into Doctorate of Philosophy (PhD) level and develop a career in academic research. Core modules will help develop an advanced understanding of essential areas, including current issues in accounting, research methods and corporate financial strategy security valuation. You can also choose from optional modules in areas that align with your individual career goals, such as financial statement analysis, international finance and corporate governance. You have the option to take industry-recognised digital qualifications by Microsoft and SAP alongside your course, which will develop your digital skills and help you stand out to future employers. This MSc will enhance your CV and help to bring you to the notice of prestigious employers who are looking for the skillset you will have. As an asset to their organisation, you can put your knowledge and skills into practice, having a real impact on their business. in the world and top 20 in the UK QS World University Rankings: Masters in Finance Rankings 2023 Part of an elite group of business schools worldwide to gain ‘triple crown’ accreditation EQUIS, AMBA and AACSB accredited Business School students have the opportunity to gain digital skills with industry-recognised Microsoft and SAP certifications Watch the video Across the autumn and spring semesters, you will take 120 credits of taught modules. Each module typically consists of 10 two to three hour sessions. You will complete the remaining 60 credits with a 2,000-word proposal and 15,000-word dissertation. You will be allocated an appropriate dissertation supervisor who will oversee your progress. The module covers: The module will cover lectures within each the following two areas: Indicative topic areas include: The module aims to equip you with an understanding of econometric techniques relevant to accounting and finance. Examples of topics covered include statistical distribution theory, and analysing different data sets (time series, cross-sectional, and panel data) using multivariate regression. Equity, fixed income and derivative securities will be considered individually and portfolios. These will be presented as extensions of previously studied material as well as new topics. Among individual security classes topics will be: The module prepares you to analyse the financial performance of companies, to assess their prospects and to estimate their valuation. The module is structured primarily from the point of view of investors and analysts, rather than from a company perspective. The module teaches you both theoretical and practical understanding of the financial performance of companies, and how to apply it for valuation. The module aims to allow you to synthesise, apply, and extend the knowledge you have gained in the taught component of the programme by engaging in primary data collection. Through investigating a current research topic and gathering original data, you will develop a deeper theoretical and practical understanding of contemporary issues in your area, while also enhancing your research, communication, and data analysis skills. The Business Project requires students, working as groups, to undertake research in a topic which is relevant to business, management, marketing, finance, accounting, or information system. You must choose their research topic that is relevant to your named degree programme. The specific topic is subject to a formal approval process. The module is intended for you to apply knowledge, concepts, skills, and techniques, acquired during the taught stage of your programme to real-world, business scenarios. You will be presented with real-word business problems for which you are required to review relevant literature, conduct research, analyse data, and formulate viable solutions. The module will cover some or all of the following topics: This module is aimed at giving you an understanding of behaviour in an economic context. You will learn the use of methods to measure economic preferences as: trust, risk, cooperation, social preferences and social identity. These measures are used in economics and finance to explain human behaviour and decision-making processes. In addition to this you will “play” games in the classroom to get a first hand impression of the structure and meaning of the games used in the lectures. Together we will understand how rational behaviour predictions conflict with human “bounded rational” decision making. You will analyse studies of bounded rational behaviour, labour markets, asset markets, experimental behavioural finance, social dilemmas, preferences, public goods, reciprocity, bargaining and contests. The module starts with early phase of a typical firm’s life cycle with discussion of the role of venture capital in mentoring and leading them to possible exits including Initial public offerings. These will be followed by an in-depth analysis of financial markets with diversity of financial claims issued by both young and matured companies. The module will then also explore corporate restructuring and financial decisions leading to analysis of corporate breakup transactions (divestitures, spinoffs, equity carve outs, tracking stocks), leveraged recapitalizations, and leveraged buyouts (LBOs) and study the value-drivers behind them with both theoretical framework and empirical analysis linking current events. It will also discuss factors that determine cross-border takeover, and the influence of cross-border M&As on corporate shareholders' wealth and corporate governance. Finally topics dealing with corporate social responsibility and its value-enhancing capabilities and the link between corporate political connections (managers, board members, shareholders) and corporate financing activities will be discussed in detail from both theoretical and empirical perspectives. The module provides an introduction to modern econometric techniques for modelling financial data. It covers relatively advanced econometric techniques such as dynamic panel data modelling, generalised methods of moments, discrete choices models and modelling volatility via ARCH/GARCH models. This module examines: This module will cover some or all of the following: SAP S/4 HANA is an in-memory platform for doing real-time analytics and for deploying real-time applications. This module includes: In addition to lectures, some modules have lab sessions, some have workshops and some drop-in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. We offer the opportunity for you to take industry-recognised Microsoft and SAP certifications alongside your degree programme. This will enhance your digital capability, differentiate your CV and help you stand out to future employers. Find out more on our digital professional skills website. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. For a 20 credit module, you are expected to work at least 200 hours over the duration of the course. One example of a break-down of the 200 hours is as follows: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Please note: this is a highly competitive course and there are a limited number of places available. The school reserves the right to close applications when capacity is reached – this may be ahead of the advertised application windows. Early applications are encouraged to avoid disappointment. If you have not yet completed your undergraduate degree, please provide a list of modules to be studied in your final year. Our step-by-step guide covers everything you need to know about applying. Jubilee Campus has eco-friendly buildings, alongside green spaces, wildlife and a lake. This campus is home to our business, education and computer science schools, as well as a sports centre and student accommodation. You can walk to University Park Campus in around 20 minutes or catch a free hopper bus. Nottingham city centre is 20 minutes away by public bus. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you should factor some additional costs into your budget, alongside your tuition fees and living expenses. You should be able to access most of the books you'll need through our libraries, though you may wish to purchase your own copies or more specific titles. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Thursday 13 June 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}