{
    "url": "https://www.nottingham.ac.uk/pgstudy/fees/postgraduate-fees.aspx",
    "content": [
        {
            "p": "Tuition fees vary depending on your fee status, how long your course is and the type of degree you are studying. Fees for 2025 postgraduate courses will be confirmed and updated online in August 2024. UK, EU and international tuition fees are displayed on each postgraduate course page. Search postgraduate courses For full details on tuition fees including fee regulations, see our tuition fee guidance. If you have already received an offer to study with us, the fees for your course will be provided in your offer letter. Tuition fees may increase each year from the second year of study, if your course is longer than a year. There is an application fee of £50 for postgraduate taught and Master of Research (MRes) courses. Your tuition fees are paid in instalments. Once you have received an offer to study with us, payment deadlines for your instalments will be displayed in MyNottingham. Check regularly to see updates to your payment schedule. Find out how to pay your student fees. International students who are planning to start a full-time postgraduate taught course will be required to pay a tuition fee deposit of at least £3,000 as part of the visa process. We will waive the tuition fee deposit requirement for students who are fully sponsored by a recognised sponsor. If you are fully sponsored for your course fees, you must email us a copy of your sponsorship letter, quoting your full name and application ID number. The University will only accept sponsorship letters from recognised sponsors such as governments, international businesses, universities, trusts and charities. Letters from friends or family members will not be accepted. Following the UK's exit from the European Union, students from the EU, EEA or Switzerland starting courses in the 2023/24 index academic year will pay the same fees as international students. Irish nationals living in the UK or Republic of Ireland will be treated as UK students for fee purposes. For further guidance, check our EU referendum information. UK nationals living in the EU, EEA and Switzerland may continue to be eligible for UK home fee status, when entering courses at UK universities until 31 December 2027 (subject to eligibility). You must be able to provide written confirmation if your fees are being paid by an external funding provider. This includes the Student Loans Company, a research council, a national government or any other recognised sponsor. Find out more about how to upload funding and sponsorship letters. If you have a query or need more information about tuition fees, contact us."
        }
    ],
    "pdf_files": []
}