{
    "url": "https://www.nottingham.edu.my/pgstudy/course/research/environmental-and-geographical-sciences-mphil-mres-phd",
    "content": [
        {
            "p": "UNM/JPT-R/421/7/0036(7/26)MQA/SWA0820 UNM/JPT-R/421/7/0035(7/26)A7510 UNM/JPT-R/421/8/0034(7/28)MQA/SWA0822 Research within the School of Environmental and Geographical Sciences is of global and regional significance. Our research into environmental monitoring and management focuses on areas such as remote sensing technologies and applications, spatial analysis and visualisation, geospatial technology applications to human environment interactions and disaster management. Another area of interest is ecology and biodiversity conservation in tropical Asia. The latter research is suited to our Malaysian environment and investigates topics such as the ecology and conservation of Asian megafauna (elephants, rhinos and tapirs), plant-animal interactions, defaunation and its consequences for ecosystem processes and conservation conflicts. We also have research expertise in lake and river environments hydrobiogeo chemistry, hydrological modelling, atmospheric science, agro forestry and landscape ecology. We offer high-quality doctoral training to postgraduate students who wish to pursue an MPhil, MRes or PhD. As a research student you will work under a supervisor who will assist you in your research and thesis design. The school has close ties to the University’s ‘Mindset’ Research Centre which promotes and conducts cross-faculty interdisciplinary research on tropical environmental issues. We are interested in research projects relating to our core areas of research in environmental technology development and ecology along with biodiversity conservation in tropical Asia. Our Postgraduate Programmes are continuously expanding in response to changes in society and the need to integrate the latest research findings. We are committed to educating graduates who are well prepared for the challenges of a knowledge based economy in the 21st Century. Our current research projects include: Within Management and Ecology of Malaysian Elephants we have a number of sub-projects: Research degrees with joint supervision from the Nottingham UK campus are also possible in a number of research areas, including: If you are interested in applying, we would recommend that you familiarise yourself with our research areas and staff expertise and then contact us to discuss your research project proposal with the relevant supervisor in the first instance. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A master’s degree or a master of philosophy degree, plus at least a second class honours degree (or international equivalent) in science, engineering or geography and environment-related subjects. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Or A first class honours degree (or international equivalent) in science, engineering or geography and environment-related subjects. Non-UK qualifications will be assessed against this standard. MPhil An upper second class honours degree (or international equivalent) in science, engineering or geography and environment-related subjects. Non-UK qualifications will be assessed against this standard. MRes At least a second class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. We have postgraduates who progress into career working in government and non-governmental agencies as advisors, policy makers, legal framework developers, conservation officers, and academicians. This content was last updated on 15 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}