{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/advanced-clinical-practice-msc",
    "content": [
        {
            "p": "This course is closed to international applicants for 2025 entry. Accredited by the Centre for Advancing Practice, this course is designed for practitioners to develop in-depth knowledge, skills, and confidence to autonomously manage complex cases within specific areas of practice. You will learn to lead, educate, and develop the research skills synonymous with working as an advanced clinical practitioner and develop key skills to manage complex clinical problems. Focusing on high-quality teaching with plenty of opportunities to develop clinical skills in a practical setting, our programme provides an educational structure that maps to NHS England's Multi-Professional Framework for Advanced Clinical Practice. Our programmes (apprentice, non-apprentice and legacy) are accredited by NHS England's Centre for Advancing Practice. You will be taught by experts in their field who are passionate about advanced practice. They will support you throughout the programme to aid your professional development into a clinically competent practitioner. A key benefit is that you will work alongside students from a variety of backgrounds and specialist fields, giving you the chance to share experiences and best practice across multi-professional teams. This course is not open for international application. is available to fund your Advanced Clinical Practice MSc Find out more about our degree apprenticeships Our teaching faculty comprises practising clinicians (ACPs and Physicians), bioscientists, anatomists, and allied health professionals. This programme is accredited with NHS England's Centre for Advancing Practice. Graduates from this programme will be eligible for an 'Advanced' digital badge. MSc Advanced Clinical Practice is a part-time masters degree over three years. When making an application it is important to ensure you have support from your employer and meet the requirements for working as an Advanced Clinical Practitioner for your situation. It is therefore advisable to contact the Programme Director before making an online application. Take a systematic clinical history, conduct a comprehensive physical examination, recognise and describe abnormal clinical signs and report the findings, when necessary, to a senior clinician in a structured way. Take a systematic history, conduct a physical examination and synthesis data to inform clinical decision making, order appropriate interventions, implement care and evaluate performance. You are taught by experts in their field who are passionate about advanced practice. Students find the course challenging but transformational and appreciate the opportunity to develop the clinical knowledge and understanding that leads to enhanced decision-making skills, ensuring high quality, safe and effective patient-centered care. To complete a module and gain its credits you will need to make sure you attend your timetabled sessions and get over the 50% pass mark. To achieve the MSc, you will need a total of 180 credits. Teaching contact time is approximately 7.5 hours each week. You will also take part in self-guided independent study outside of timetabled contact hours. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. All applicants must be qualified health care professionals, typically with five years of experience in professional practice or longer; applicants join the course with the written agreement of their employer. In negotiation with the course director, you must identify an appropriately qualified clinical supervisor before commencing the course. The application deadline for this course is 1 November 2024. Our step-by-step guide covers everything you need to know about applying. Our Medical School is based in Queen’s Medical Centre, one of the UK’s largest hospitals. There are dedicated clinical skills facilities including a dissection suite and teaching laboratories for medicine and healthcare students. The hospital is located opposite University Park Campus and connected by a footbridge for easy access. Nottingham city centre is 15 minutes away by public bus or tram. All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you should factor some additional costs into your budget, such as printing, alongside your tuition fees and living expenses. You should be able to access most of the books you’ll need through our libraries, though you may wish to purchase your own copies or more specific titles. A degree apprenticeship route is available for this programme. By combining real work with rigorous study, degree apprenticeships help you to develop a highly skilled workforce. Designed with employers, our degree apprenticeships are a cost-effective way to attract, develop and retain talent. Apprentices don’t pay fees; funding comes from the apprenticeship levy or Government co-investment. There are many ways to fund your postgraduate course, from scholarships to government loans. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Monday 09 December 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}