{
    "url": "https://www.nottingham.ac.uk/pgstudy/already-applied/offer.aspx",
    "content": [
        {
            "p": "Congratulations on your offer of postgraduate study. On this page: We recommend you reply to your offer as soon as possible. To keep your offer open, we usually require a response from you within six weeks. Courses with different timescales will be stated on your offer letter. Check the acceptance instructions for your course carefully for any specific deadlines and requirements that might apply to you. You can accept your offer via our online application system, NottinghamHub. Accept your offer Some courses require you to pay a course deposit at the point of accepting your offer. If you would like to accept an offer for one of the following courses, find out how to pay your deposit. Provide scanned copies of your transcript or certificate confirming your qualifications. You can upload scanned documents via our online application system, NottinghamHub. We can accept high-quality photos as copies as long as the document is an official transcript of your marks on headed paper. Any documents you submit must be in English. You can also supply a certified translation if the original documents are not available in English. If you included contact details for your referees in your application, the University will contact them directly to request a reference on your behalf. Alternatively, you can upload electronic copies of your references on official letterheaded paper via the online application system, NottinghamHub. For postgraduate courses starting on other dates during the year, the deadline for providing results and meeting offer conditions is typically eight working days before the course start date, but this may vary for individual courses. You can check the deadline for submitting your results in our online application system, NottinghamHub. If English isn't your first language, you will also need to meet the relevant English language requirements. IELTS requirements are detailed on our course pages, though we also accept alternative English language qualifications. The deadlines for meeting our English language conditions are the same as the deadline listed above for submitting documents. If you require additional support to develop your language skills, you may be able to study a presessional course with the Centre for English Language Education. You've received your offer of postgraduate study – now you can apply for funding. For information on the scholarships we offer, postgraduate student loans and other ways to fund your postgraduate degree, check our funding guidance. Postgraduate funding Credits are a standard way of measuring learning. ROL means you can start your course at the appropriate level through substituting individual modules or reducing the total amount of credits you need to study to gain a qualification. For example, you could use ROL to put towards the total credits you need to complete a masters degree. View more information and apply for ROL If your study plans change and you won't be able to join us this year, we may be able to defer your offer to the next academic year. Find out more about requesting a deferred offer. Deferring your offer What happens when you accept your offer"
        }
    ],
    "pdf_files": []
}