{
    "url": "https://www.nottingham.ac.uk/pgstudy/funding/four-year-masters-and-phd-studentship-in-politics-and-international-relations",
    "content": [
        {
            "p": "The School of Politics and International Relations invites expressions of interest from suitably qualified candidates for a fully-funded study programme leading to a PhD in Politics and International Relations We are actively seeking potential candidates who would like to develop and submit studentship proposals in the area of politics and/or international relations. There are no restrictions on the proposed topic area, but we have identified a number of priority topic areas where we believe a PhD project would be particularly cutting-edge and where we strongly welcome expressions of interest. The topic areas are: International Relations British politics Political theory Comparative politics Prospective candidates should outline their own doctoral research topic, but if you are interested in the priority topic areas listed above, our team will help you develop your ideas, offer feedback on your proposal drafts, and connect you with supervisors. All projects must principally employ a social science methodology (view further guidance on disciplinary remit). Candidates will be expected to demonstrate an excellent record of academic achievement in politics and/or international Relations or a related discipline and potential to complete an original and independent research project. The school will select one or more candidates to co-develop full applications for funding offered through the Politics and International Relations pathway of the Midlands Graduate School (MGS) Doctoral Training Partnership. The MGS is one of 14 UK Economic and Social Research Council (ESRC) Doctoral Training Partnerships (DTPs), and comprises the University of Warwick, Aston University, University of Birmingham, University of Leicester, Loughborough University and the University of Nottingham. Successful applicants will join a team of PhD researchers in the School of Politics and International Relations. You can find out more about our staff, their research interests and current doctoral supervision, as well as the pages of individual academics. The awards include the +3 programme or the 1+3 programme (funding to include an integrated Masters programme that precedes the three-year PhD). The 1+3 programme comprises 1 year of training in social science research methods (to MA level), plus 3 years of research on an original topic in the area of politics and international relations (to PhD level). Candidates who already have an ESRC-accredited MA in politics and/or international relations or a cognate discipline, and/or can demonstrate extensive expertise in social science research methods, may apply for a +3 PhD programme. Candidates without MA degrees and those with a non-ESRC-accredited MA degree may only apply for the 1+3 programme. All awards are available for study part-time. To apply, you must meet the ESRC’s residency requirements. As projects must be based on social science method, please ensure that you read this page before formulating your proposal. Applicants interested in applying for entry October 2022 should contact Professor Andrew Mumford (andrew.mumford@nottingham.ac.uk) and Dr Scott Moser (scott.moser@nottingham.ac.uk) as soon as possible before 6 December 2021. Please send your CV, a one-page note on your preparation and motivation to conduct research to PhD level on a topic in Politics and International Relations using social science methods, and a one-page outline of your proposed research topic. We can advise on your eligibility and the fit of your proposed research with our interests and expertise. If the school agrees to support your application to the MGS, you will then need to submit applications, first, for a PhD place to the University of Nottingham (two academic references will be required) and, subsequently, for funding to the Midlands Graduate School, the deadline for which is 18 January 2022 (23:59 GMT). Offered by Politics and International Relations"
        }
    ],
    "pdf_files": []
}