{
    "url": "https://www.nottingham.edu.my/pgstudy/course/taught/developmental-disorders-msc",
    "content": [
        {
            "p": "UNM/JPT-N/311/7/0114(10/26)MQA/PSA15084 The Master of Science (MSc) in Developmental Disorders (which aligns with the parallel programme in the UK campus) will give advanced theoretical knowledge of the psychological aspects of neuro-developmental, clinical and behavioural conditions that become apparent during childhood and affect a child’s life in several areas. Examples of developmental disorders are Autism, Attention-Deficit/Hyperactivity Disorder (ADHD), Tic Disorders, and Learning Disorders (such as dyslexia or dysgraphia). When completing this MSc, you will have expertise in cutting-edge research methods that are suited to investigating psychological aspects of neuro-developmental, clinical and behavioural conditions; and practical knowledge on aspects of diagnosis and assessment, management strategies and plans to support children with developmental disorder. As such, this MSc combines scientific research with clinical psychological practice. This programme is meant for people with an interest in developmental psychology/ developmental disorders. It will provide foundational knowledge and research training for later professional qualifications in educational or clinical psychology. This MSc will be of interest to people working in clinical or educational fields, and individuals who are interested in pursuing a career in (academic/commercial) research. The course consists of 3 semesters (full-time). The autumn and spring semester include taught modules, and the research project will be done in the summer. Part-time students will complete half of the taught modules in the first year and the other half in the second year, and they will conduct their research project in the summer term of the second year. Teaching methods include workshops, lectures, seminars and research supervision, while assessment includes essays, research reports, literature reviews, case studies and presentations. For questions about the course content, please contact Professor Steve Janssen: Steve.Janssen@nottingham.edu.my Modules (20 credits): Empirical Research Project (60 credits) All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. An upper second class honours degree (or international equivalent) in Psychology or a related discipline. Some prior experience with quantitative research methods and/or statistics will usually be required. Applicants who have obtained a second lower class honours degree will be considered on a case-by-case basis, dependent on their profile of performance or work experience. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Please, get in touch with the MSc course director (Steve.Janssen@nottingham.edu.my) to discuss scholarships and awards. Applicants must have graduated from an approved university. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. This MSc is meant for people with an interest in enhancing knowledge of developmental disorders/research skills, and who are aiming for a career in clinical or educational fields and/or in (academic/commercial) research. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}