{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/applied-sport-and-exercise-medicine-msc",
    "content": [
        {
            "p": "Designed specifically for students from a non-clinical background, Applied Sport and Exercise Medicine allows you to specialise in the theory of managing sports injuries and illnesses, exploring the relationship between exercise and health, and get real-life experience in the field. As part of the course, you'll receive special training courses to allow you to do CPR and first aid as well as taping and sports massage. We want you to be able to go where you want to in your career, whether that be working in a sports team or doing research. We'll help you get there with placements at real sporting events throughout your time with us and teaching from leading clinicians, research scientists, and sports and exercise medicine experts. in CPR and advanced first aid through prosection in our dedicated dissection room in sports taping and massage Gain the knowledge and skills in sports medicine, epidemiology, the relationship between physical activity and health, and the management of sports injuries and illnesses. You'll also learn the theory of how to manage musculoskeletal health as part of a team, and about common sporting injuries and research skills. The course takes place over three semesters: autumn, spring, and summer. Taught modules are usually delivered in the autumn and spring semesters with the summer used for the research project (preparation for this will take place during the autumn and spring semesters). However, this will depend on your mode of study. You'll take all of the compulsory modules and choose from two of the optional modules for a total of 180 credits. This course seeks to create an overview of common sporting injuries including the epidemiology, presentation, prevention and treatment. It will enhance understanding of the aetiology, biomechanical principals and problems associated with sports injuries. Students will review the demands and injury risks associated with specific sports and discuss the current evidence base for management options of a wide range of sporting injuries. The course will also cover the current public health issues relating to physical activity (and physical inactivity) with health and disease from an epidemiological perspective, globally, with respect to prevention and treatment. It aims to explore the intersect of changing public health issues, lifestyle and behaviour. Gain theoretical and practical knowledge and training to work as part of the support team in professional team and event medicine. It will include the material required for the acquisition of a sport-specific pitchside first aid and life support course certificate. This module provides theoretical and practical training and knowledge in the immediate management of an injured athlete, the multidisciplinary approach to sport injury management, anti-doping, and medico-legal and ethical issues in professional sport. You'll also gain an insight into pre-hospital care specific issues associated with a range of sports, and explore other management techniques and alternative tools that can support health and performance. You'll observe and provide pitchside emergency care cover at sports events at the University of Nottingham (compulsory). Placements at a large-scale sporting event will also be arranged for students (optional). This module covers the relationship between physical activity and specific medical conditions; exercise under specific conditions and the practical aspects of medical management in sport. Encompassing internationalisation, physical activity and health and disease in developing countries is also addressed. This module will develop your critical appraisal skills so you can take an evidence based approach to your work. It covers the strengths and weaknesses of different types of study design, the key principals relevant to evaluating research (both quantitative and qualitative), whether a published journal paper or undertaking your own research projects. You'll also be taught how to use statistical software and how to analyse qualitative data. The overall aim of this module is to integrate the knowledge, skills and techniques required for the effective application of anatomy into the applied assessment of sports injuries. This module is aimed at providing the skills needed for designing, undertaking and analysing data from the research project. It will involve the student undertaking a research project on a topic relevant to Sports and Exercise Medicine. Suitable project topics will be proposed by members of the MSc teaching staff. Students are also free to make their own suggestions for projects, which may or may not be deemed acceptable. A project supervisor will be appointed for each project. This allocation is made at the start of the academic year and the student is then expected to work on the project throughout the year (the final year for part-time students). Internationalisation is central to this course. You'll have the opportunity to suggest your own topics for research projects. This means that if you're an international student, you'll have the option to collect data from your home country if appropriate. You'll meet regularly with your supervisor who will guide you during your project and there are a number of deadlines during the year to help you keep on track. Previous student research projects include: The overall aim of this module is to give you a practical grounding in sport and exercise nutrition. It will equip you with the knowledge and skills to advise the public (including different groups of athletes) on nutrition for sports and exercise. This requires you to be able to understand key nutritional concepts and metabolism, develop a critical awareness of evidence, and apply this knowledge to the assessment, monitoring and planning of diets. This module provides an overview of concepts central to all forms of rehabilitation. You'll be introduced to an understanding of disability from different perspectives: models of disability, the biopsychosocial model and the WHO conceptual framework. Links between theory, research and practice in rehabilitation will be considered. The module will cover research issues in rehabilitation research, focusing particularly on complex interventions, evaluating interventions and measuring outcome. The module also explores how research evidence informs approaches to rehabilitation, using examples of rehabilitation in practice in different conditions from psychological and multidisciplinary perspectives. The module also considers the spectrum of rehabilitation, reviewing the broad range of health and social contexts in which rehabilitation occurs Teaching is face-to-face, supported by online materials and independent study. Practical teaching will take place in the clinical skills suites and in the dissection room (module dependent). Along with more traditional classroom-based lectures and/or tutorials. Your work will be assessed during or at the end of each module through a variety of means, depending on your module choices. This includes exams, case study coursework, essays, Vlogs, presentations, OSCEs, dissertation, and viva. To complete a module and gain its credits you'll need to make sure you attend placements, practicals and get over the 50% pass mark. To achieve the MSc, you'll need a total of 180 credits. We encourage our students to think of the course like they would a full-time job and spend around 37 hours on it per week including teaching time. Part-time students should consider it similar to a part-time job. You're expected to work roughly 10 hours for each credit on the course including teaching and independent study, so a 20 credit module should take around 200 hours to complete or around a total of 25 eight-hour days. If you choose to study this course full-time, you'll learn over 12 months (two semesters and the summer). You'll have an average of 10 to 16 hours of contact time each week during the autumn and spring semesters. However, the time and days of teaching will depend on the optional module you choose. Contact time is generally grouped by full days of teaching to minimise travel to campus. Previously teaching has primarily been delivered on Tuesdays and Thursdays. We try to provide you with your timetable for the year by the start of the academic year. Where changes happen, we try to give you six weeks' notice. Non-teaching days are intended for private study (including preparation for presentations and assessments), placements, and research. Part-time students can learn the same course content over a period of 24, 36, or 48 months. Please note, if you choose to study over 36 or 48 months, you'll need to check if you can apply for Student Loan finance. Teaching will usually primarily take place two days a week during the semesters. You'll typically attend teaching one day a week or about four hours per week, depending on the modules you select. If you choose to study over three or four years, you will have less. We try wherever possible to be flexible to help you manage your timetable. You're expected to devote around two and a half days per week to the course including attending teaching, private study (including preparation for presentations and assessments), placements and research. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Your application will be stronger if you've completed work experience with a sports team or with physiotherapists. We may consider applicants with a 2:2 in relevant degrees on a case-by-case basis. Depending on your application there may be an interview or you may need to provide evidence of work experience. We may consider applicants with a 2:2 in relevant degrees, but these applications will be considered on a case-by-case basis. If you have any course-specific questions you can email the course directors, Yasmin Nasir Ajanah and Alan Norrish. Our step-by-step guide covers everything you need to know about applying. Our Medical School is based in Queen’s Medical Centre, one of the UK’s largest hospitals. There are dedicated clinical skills facilities including a dissection suite and teaching laboratories for medicine and healthcare students. The hospital is located opposite University Park Campus and connected by a footbridge for easy access. Nottingham city centre is 15 minutes away by public bus or tram. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you should factor some additional costs into your budget, alongside your tuition fees and living expenses such as accommodation and travel to placements and teaching. You should be able to access the books and resources you need for the course through our libraries. However, you may wish to purchase your own copies or get specific books which may cost up to £80 each. Travel is necessary for some placements, as not all are held in Nottingham. You'll be assigned to a university sports team at the start of the academic year. If you wish to travel with them to away games (which is optional), you'll usually be able to travel for free on the athletes’ bus. We always cover the cost of travel and accommodation (camping) for our placement to the Lake District in the summer. Where we cover one of the UK’s premier Ultra Marathon events. You may incur additional costs for food and drink (if you don’t take your own with you). You may also incur costs if you decide, with your supervisor, to submit your research work to an academic conference. If you're accepted as a presenter, you'll need to register for the conference, travel there, and usually an overnight stay is required. We do have a bursary scheme that you can apply for to cover some/all of these costs if your work is accepted at such a conference. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Tuesday 08 October 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}