{
    "url": "https://www.nottingham.edu.my/pgstudy/course/research/computer-science-mphil-phd",
    "content": [
        {
            "p": "UNM/JPT-R/481/7/0766(7/26)MQA/SWA0819 UNM/JPT-R/481/8/0764(7/28)MQA/SWA0821 The main focus of our research lies in the development of various intelligent systems and computational techniques which can be applied to a wide range of real-world problems. Our multidisciplinary research includes areas in human–computer interaction, computer vision, simulation and modelling, operational research and computational intelligence. Research conducted within the School is generally encapsulated by the aims and scope of the Centre for Intelligent Computing (CIC), which is linked to several University-wide priority areas. CIC complements the four research themes pursued at the UK Campus but also takes full advantage of the specific research expertise of staff involved in cross-campus co-supervision of research projects. We offer high-quality doctoral training to postgraduate students who wish to pursue an MPhil or PhD. As a research student you will work under a supervisor who will assist you in your research and thesis design. Most research programmes are based on the research interests of staff members within the school, however if you are privately funded and wish to pursue research in alternative areas we support the opportunity to consider other projects. Our Postgraduate Programmes are continuously expanding in response to changes in society and the need to integrate the latest research findings. We are committed to educating graduates who are well prepared for the challenges of a knowledge based economy in the 21st Century. Particular research areas of interest are: All new postgraduates who join the school have the opportunity of broadening and updating their knowledge. A taught programme of research and transferable skills will be available to you as well as being able to attend lecture programmes on subjects relevant to your research. All postgraduate students are encouraged to present their work at specialised conferences and to publish papers in major scientific and engineering journals. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A master’s degree with a distinction or merit grade (or international equivalent) plus, an upper second class honours degree (or international equivalent) in computer science or another relevant area. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Or A first class honours degree (or international equivalent) in computer science or another relevant area. Non-UK qualifications will be assessed against this standard. MPhil An upper second class honours degree (or international equivalent) in computer science or another relevant area. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Our postgraduate degrees in computer science and software engineering produce highly employable postgraduates and provide the basis for rewarding and lucrative careers. They will prepare you for careers in a range of technical disciplines including artificial intelligence, machine learning, Internet of Things (IoT), computer vision and software engineering. They are an excellent foundation to pursue academic and industry career opportunities such as computer scientists, data scientists, consultants and R&D software engineers. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}