{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/research/archaeology-mres",
    "content": [
        {
            "p": "If you are looking to prepare for a PhD in archaeology, or for further career development in archaeology and heritage, this course is ideal. You will gain an advanced understanding of specific areas of archaeology, from British and Mediterranean prehistory to medieval houses and castles. You can then enjoy the flexibility to follow your own specialist pathway, supported by our expert staff. Our teaching is drawn from a diverse range of expertise, including: We work closely with the British Geological Survey, University Nanoscale and Microscale Research Centre, and the University Museum, where you can benefit from using the specialist facilities and collections in your research. You are also very welcome to join the activities and events held by our specialist research centres. This course is made up of 180 credits. Full-time students complete 180 credits in a year. Part-time students complete 180 credits over two years. You will complete the taught component of the programme (two core modules and one optional module) in the first year of study. Part-time students are expected to complete the 25,000 word dissertation during the second year of study. Two ‘Special Topic’ modules provide advanced knowledge and understanding of specific areas of archaeology. This may be by period or theme and/or archaeological science (as appropriate). The Director of Postgraduate Studies, Postgraduate Admissions Tutor and your principal supervisor will support you to choose your topics. Topics will be taught individually or in small groups through seminars, tutorials or laboratory sessions. You will be assessed through a combination of written essays and assignments, or practical lab tests and reports, as appropriate to the subject. You might also be taught by participation in undergraduate lectures or practicals, in addition to following a course of guided reading and study under the supervision of a member of academic staff. Potential topics can include: Additional topics can often be created to suit your individual needs and interests. Please contact the department before making your application to discuss your specific requirements, and the topics that might be offered in any particular year. Each Special Topic module is worth 20 credits. You will complete a 25,000-word dissertation during the summer. This will include a major piece of original archaeological research and will be supervised by two academic members of staff with expertise in your chosen field. This module is worth 120 credits. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. 2:1 (or international equivalent) in archaeology. Students with other relevant qualifications (i.e. history, classics, art history) or experience will be considered on an individual basis. Our areas of teaching and research expertise include: Our members of staff research and teach in many different fields of Old World prehistory. We have particular strengths in the study of Neolithic to Iron Age societies in the Mediterranean, and Iron Age communities in Atlantic Europe and Scandinavia. You can study many different aspects of the archaeology of Mediterranean society. We have particular strengths in prehistoric Mediterranean archaeology, from prehistoric Italy (Neolithic to Iron Age), to Bronze Age Aegean (Minoan and Mycenaean archaeology) and the Early Iron Age of Greece. Specialists in this field work with landscape archaeology, burials, and material culture. Nottingham is also the world’s centre of excellence for the study of the archaeology and history of Sparta and the Peloponnese, Greece. We also have specialists in the archaeology of the classical Mediterranean and the Roman Empire, and the period of Late Antiquity and the transition to the early medieval world. You can study a range of different types of archaeological evidence including burials, monuments, landscapes, cities, forts and material culture. You can study many different aspects of the archaeology of the Roman World, from the Mediterranean world and the City of Rome, to Britain and the North-Western provinces, to the Balkans and the eastern Empire. Our teaching and research ranges from the high point of the Roman Empire in the 1st and 2nd centuries, to the transformation of the late Roman Empire and the period of Late Antiquity. Students studying the City of Rome topic (20 credits) have the opportunity to apply to spend one semester at the British School in Rome. We have staff researching and teaching in the periods of both early medieval (Anglo-Saxon and Viking) and later medieval and post-medieval (from the Norman Conquest to the Renaissance), and students can study topics across this range or choose to specialise in one period. We also have expertise in the study of landscape and settlement archaeology, the archaeology of standing buildings, and medieval topics in bioarchaeology. Our department is a recognised centre of excellence in the innovative study of social bioarchaeology and the interaction of humans, plants and animals in their wider landscape and environmental context. Staff specialise in zooarchaeology across regions and time-periods ranging from the Palaeolithic to Roman to Post-Medieval Europe. You are provided with a practical, methodological and theoretical grounding in bioarchaeology. This allows you to develop core practical and analytical skills so you can undertake independent study of environmental evidence for your dissertation and pursue a career as a specialist in the field. You have the opportunity to combine archaeology and science in the investigation of ancient materials and pyrotechnologies. You can study the archaeological, ethnographic and scientific aspects of materials – primarily glass – choosing to specialise in particular methods and techniques or taking a broader comparative approach. To undertake an independent research project in archaeological materials, you will be taught core practical and analytical skills to enable you to undertake primary scientific analysis using a wide range of techniques and approaches. Visit the Department of Classics and Archaeology website to find out more about our research and teaching profile. We encourage you to get in touch with a member of academic staff about your research proposal before submitting an application. They may be able to help you with your proposal and offer support to find funding opportunities in your area. Details of our research expertise. Our step-by-step guide contains everything you need to know about applying for postgraduate research. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA). These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. You'll be able to access most of the books you’ll need through our libraries, though you may wish to buy your own copies of core texts. The Blackwell's bookshop on campus offers a year-round price match against any of the main retailers (i.e. Amazon, Waterstones, WH Smith). There are funding opportunities which are only open to students within the Faculty of Arts. There are many ways to fund your research degree, from scholarships to government loans. Check our guide to find out more about funding your postgraduate degree. As teaching is largely undertaken through individual tutorials or small groups, there is a great deal of flexibility to organise your time around existing commitments. Every week you will attend lectures and participate in small group seminars. During the year, you will have regular meetings (at least 10 recorded ones) with your supervisors to discuss your dissertation. The Researcher Academy is the network for researchers, and staff who support them. We work together to promote a healthy research culture, to cultivate researcher excellence, and develop creative partnerships that enable researchers to flourish. Postgraduate researchers at Nottingham have access to our online Members’ area, which includes a wealth of resources, access to training courses and award-winning postgraduate placements. Our graduate centres are dedicated community spaces on campus for postgraduates. Each space has areas for: You will have access to a range of support services, including: Our Students' Union represents all students. You can join the Postgraduate Students’ Network or contact the dedicated Postgraduate Officer. There are also a range of support networks, including groups for: SU Advice provides free, independent and confidential advice on issues such as accommodation, financial and academic difficulties. Take advantage of our five research laboratories, the large collection of ancient coins and the in-house Digital Transformations Hub. Whether you are considering a career in academia, industry or haven't yet decided, we’re here to support you every step of the way. Expert staff will work with you to explore PhD career options and apply for vacancies, develop your interview skills and meet employers. You can book a one-to-one appointment, take an online course or attend a workshop. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. The University of Nottingham is ranked 7th in the UK for research power, according to analysis by Times Higher Education. The Research Excellence Framework (REF) is a national assessment of the quality of research in UK higher education institutions. *According to analysis by Times Higher Education ** According to our own analysis. This content was last updated on 19 September 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}