{
    "url": "https://www.nottingham.edu.my/pgstudy/course/taught/business-international-management-msc",
    "content": [
        {
            "p": "UNM/JPT-N/345/7/1138(12/26)MQA/PSA15122 The programme provides a theoretical grounding in current concepts and practices of general business and management, within an international context. Through the course, students develop key management skills in executing effective business decisions and operations for success in the global economy. You will be equipped to strategically plan various business ventures, lead a globally diverse talent, identify international business opportunities, and transform those opportunities into success. These skills are important for a global manager, as they enhance your analytical skills and ability to develop a business acumen critical to international management. The global economy is constantly changing; the skills you gain from this degree will equip you with the required competence to think and compete in this landscape. With a global management mindset, your career prospects are expanded across various roles in business development and management, consultancy, management of global talent and innovation development. One year full-time programme comprising of six compulsory modules in Semester 1 and 2. In Semester 3 students complete a dissertation or business project (with presentation). Teaching comprises lectures, some small group teaching lab work and seminars. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A relevant good second class honours degree (or international equivalent) or a relevant professional qualification deemed equivalent to a first degree with honours preferably in business studies or management. Applicants without a business studies or management degree must show they have completed equivalent modules in the relevant discipline. If deemed necessary, applicants may also be required to attend an interview. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Your career in international management is about exploring and embracing a career in any part of the global economy. You will be equipped to plan strategically various business ventures, lead a globally diverse talent, identify international business opportunities and transform them into success. This content was last updated on 02 August 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}