{
    "url": "https://www.nottingham.edu.my/pgstudy/course/taught/finance-and-investment-msc",
    "content": [
        {
            "p": "UNM/JPT-R2/343/7/0197(3/26)A4349 The Finance and Investment MSc course is a popular postgraduate programme in Malaysia. As a rapidly developing country, Malaysia is a hub for financial services in Southeast Asia, making it an attractive destination for students looking to study finance and investment. This is a specialist programme designed to help develop students’ analytical mind-set. Students study and master in-depth practical knowledge in core financial elements based upon the three main classes of capital investment activity; equity markets, fixed interest markets, and derivative markets. MSc Finance and Investment: This programme seeks to cultivate analytical competence in finance and investment and develop an agile mind in order to embrace and adapt to constant changes in the business environment. Students graduating from this course are considered highly by prospective employers due to their unique skill-set and expertise in capital investment activity developed through the use NUBS Financial Trading Room and financial databases. The MSc Finance and Investment is admitted to the Chartered Financial Analyst (CFA) Institute University Affiliate Program. The course is made up of 120 credits of core and elective taught modules, plus a 60-credit dissertation. In semester one, you will take modules in capital market analysis, corporate finance and quantitative research methods for finance. In semester two, you will take two further required modules on derivative investment and fixed interest investment. You will also complete two elective modules from any of the four topics from Behavioural Economics and Decision Making, International Finance, Managing Innovation and Entrepreneurship, and Consulting Skills. After completing your semester two modules, you will undertake a 15,000-word dissertation, with one-to-one support from an expert academic supervisor. This will demonstrate your ability to undertake independent research in the area of finance and investment. The module examines the equity asset class as an example of a long term, generally risky, financial security. Since semester two specialist modules in fixed interest securities and derivatives are available, this module provides only a basic introduction to these other classes of financial instruments. The module looks at the way performance of an investment in equities is characterised, and how such investments have performed in the past. The processes of equity portfolio construction, management and performance measurement are then examined. The perspective adopted is that of the purchaser, not the issuer, of equity. The module covers the traditional content of a corporate finance course: The module provides you with a good understanding of econometrics tools covering topics such as statistical distribution theory, multiple regression analysis for cross-sectional data, time series analysis, panel data and qualitative response models with finance related applications. The module covers : The module covers: Develop the ability to undertake independent research in the area of finance and investment either in the context of further academic research or consultancy. Learning outcomes: This module develops a knowledge and understanding of: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. An upper second class honours degree (or international equivalent). Non-UK qualifications will be assessed against this standard. Applicants must have a first degree in business/economics/management (with a significant quantitative finance and/or econometric component). If deemed necessary, applicants may also be required to attend an interview. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. MSc Finance and Investment: This is ideal for those students who wish to pursue careers in the area of financial advisory, investment management, marketing, mergers and acquisitions, procurement, research, risk assurance, tax consultancy, trading, business development and academia. Yes, the University of Nottingham Malaysia offers a range of scholarships and financial aid options for students, including merit-based and need-based scholarships. The Finance and Investment MSc programme uses a variety of teaching methods, including lectures, seminars, dissertations, and group projects. The course also includes guest lectures from industry professionals. UNM provides a wide range of support services to postgraduate students, including academic and learning support, counselling and mental health services, and career guidance. This content was last updated on 02 August 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}