{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/advanced-materials-msc",
    "content": [
        {
            "p": "This course provides a deep understanding of the processing, nature and properties of a broad range of engineering materials. Only by understanding these can materials be truly designed for purpose. The course seeks to integrate materials behaviour and materials processing relevant to a wide range of industrial sectors, providing students with specific skills suitable for a wide range of careers in UK and international organisations involved in materials and product development. It also provides a firm foundation for a research path in Materials Engineering. You will study the core principals of advanced materials over two semesters, alongside modules in materials categorisation and the mechanisms of failure of materials. This will provide you with a depth of knowledge and skills allowing you to make informed choices concerning applications, selection and design of advanced materials. Our teaching aims to produce graduates able to think and function in an integrated manner across all areas of materials engineering. We offer a good degree of flexibility by combining compulsory modules with a range of electives – this means you can create a programme of study that reflects your individual interests, such as sustainability or knowledge management. UK university QS World Rankings and the THE World University Rankings, 2022 for Mechanical Engineering The Times and The Sunday Times Good University Guide, 2021 This MSc in Advanced Materials programme is a full- time degree studied over a period of one calendar year commencing in late September. Each year of study is divided into two semesters of teaching, while the major individual project is undertaken in the summer session. The basic structure of each taught semester is 11 weeks of teaching followed by a period for revision and examinations. The taught subject programme consists of modules totalling 120 credits, which comprise five compulsory modules and nine optional modules. Students must take 70 credits of optional modules. This module adopts a broad approach, covering the principles underpinning a wide range of materials characterisation techniques, for imaging, structural characterisation and chemical analysis. Emphasis is given to the process, structure, property interrelationship, backed up by appropriate case studies taken from the areas of structural materials, functional materials, biomaterials and nanomaterials. Detailed content underpinning the module includes particle / material interactions and wave / material interactions; the experimental process; crystallography; defects; reciprocal space and diffraction. Consideration is given to instrumentation, vacuum systems, electron sources and detectors etc and described with reference to the techniques of SEM, TEM, XRD, XRF and XPS. An overview of related surface analysis techniques and ion beam techniques is provided. Aspects of sample preparation, including FIB milling are also covered. This module requires personal engagement in the classes and there is no examination. In this way this module is like the Individual Project. It has three cycles each comprising students individually preparing a talk, and report, on a topic within a theme and with a title that has been negotiated with the Advanced Materials Teachers (Professor AB Seddon, Dr X Hou and Dr I Ahmed) straight after the teachers have delivered an introductory lecture on that theme. The point of the module is to improve oral presentation and engineering report-writing skills using advanced materials as a vehicle. The classes are seminars, where good practice is openly discussed and materials' advantages and disadvantages are openly debated. Not to attend classes is not an option or failure of the module at the end is very likely to ensue. This module is designed to deal with a wide range of materials (including advanced metallic, ceramic, glass, composite and polymeric-based materials) for a wide range of applications. Also it considers materials' themes such as: aerospace materials, medical materials, coatings, carbon-based materials and so on. The module deals with the underlying principles behind the suitability of material properties for the targeted applications, the processing of these materials, the effects of processing on their subsequent structure and properties and ultimate performance. Method and Frequency of Class: Method of Assessment: A project-oriented module involving a review of publications and views on a topic allied to the chosen specialist subject. The module will also involve organisation and design of the main project. Skills will be acquired through workshops and seminars that will include: Students will select a further set of specialist seminars from, e.g.: The specialist seminars will be organised within the individual MSc courses. Delivery Assessment method This module focuses on understanding and manipulating of material's microstructure to avoid failure. It addresses the main areas of mechanical failure using specific material system examples to illustrate how materials design is used to develop better materials for particular applications. The four areas are: This project involves students undertaking an original, independent, research study into an engineering or industrial topic appropriate to their specific MSc programme. The project should be carried out in a professional manner and may be undertaken on any topic which is relevant to the MSc programme, as agreed by the relevant Course Director and module convenor. The project has several aims, beyond reinforcing information and methodology presented in the taught modules; the student is expected to develop skills in research, investigation, planning, evaluation and oral and written communication. Final reporting will take the form of a written account including a literature review and an account of the student's contribution. A presentation will be made to academic staff towards the end of the project. There will be a one hour introductory session/session via Moodle . All other activities are arranged on an individual basis between the student and the project supervisor. The project area is flexible and will be supervised by an academic member of staff The module aims to provide students with knowledge of key environmental and sustainability issues of relevance to energy supply and use, materials consumption, and product design/manufacture. Topics include: This module is concerned with the biomedical application of materials. It addresses three key areas: A broad-based module covering the chemistry, material properties and manufacturing methods relevant to polymers. This module introduces the design, manufacture and performance of fibre-reinforced composite materials. Constituent materials including fibres, resins and additives are described. Processing techniques and the relationships between process and design are highlighted. Design methodologies and computer-aided engineering techniques are demonstrated for component design. Case studies from a variety of industries including automotive and aerospace are presented. This module provides an understanding and knowledge of property requirements and key materials for a variety of transport systems (e.g., road vehicles, trains and aircrafts), with particular reference to how to design, select and manufacture of advanced materials to move towards low- and zero-emission transport. Topics typically include: This module examines, in-depth, the processes used for joining metallic (e.g. steel, aluminium and titanium alloys) and non-metallic (e.g. polymers and fibre reinforced composites) materials. Topics covered include: The fundamental characteristics of the various processes are examined along with procedures for practical applications. The origins of defects within joints and methods needed to control or eliminate them are also considered. The mechanical behaviour of joints is analysed, as is the effect of joining on the microstructural characteristics and mechanical properties of the base materials. Other features such as residual stress and distortion are addressed. Attention is also given to appropriate design for manufacture in a modern manufacturing context. In this module students develop understanding of hydrogen vehicle technologies and their role in delivering more sustainable transport and energy sectors. The module covers technologies currently under development and those likely to be used in future vehicle power-train systems, as an energy storage buffer for the grid and as an alternative gas vector to decarbonise heat. Technologies covered include; This module will cover design, processing and material aspects of additive manufacturing and 3D printing technologies, as well as the current and potential applications of the technology in a wide variety of sectors. Topics include commercial and experimental systems, material requirements, design for additive manufacturing, software and systems, as well as case studies in industry and society. A 10-credit module represents approximately 100 hours of student learning, teaching and assessment. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Our step-by-step guide covers everything you need to know about applying. University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. Most schools and departments are based here. You will have access to libraries, shops, cafes, the Students’ Union, sports village and a health centre. You can walk or cycle around campus. Free hopper buses connect you to our other campuses. Nottingham city centre is 15 minutes away by public bus or tram. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, there are no additional costs for your budget, apart from your tuition fees and living expenses. Lab and safety equipment is provided for free by the Department. You should be able to access all of the books you’ll need through our libraries and it is not usual for students to buy their own copies. Any field trips are also funded by the Department. Please note that these figures are approximate and subject to change. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Friday 05 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}