{
    "url": "https://www.nottingham.edu.my/pgstudy/course/taught/english-language-and-literature-ma",
    "content": [
        {
            "p": "UNM/JPT-R2/0231/7/0006(9/29)MQA/SWA0804 UNM’s MA English Language and Literature course provides you with the opportunity for advanced study in contemporary literary studies and applied linguistics. You will gain the theoretical and analytical training required to progress onto a research degree at doctoral level. You will expand your professional and practical skills relevant to working in the fields of teaching English, editing and professional writing. You will develop a specialist knowledge for research methods and practices in the wider field of English. This will be supplemented by specific applications to increase your understanding of language use, enabling you to make the transition from undergraduate study to the higher level required during your Master’s degree. You will cover the range of theoretical approaches making up the contemporary critical terminology of English and English studies. The course will also develop your awareness of practices in language use and their application to various contexts. The course will focus on developing your ability to engage in critical evaluations of current research along with developing your ability to problem-solve in respect of real-world projects and case studies. Our global footprint allows you to draw on the supervisory expertise of over 80 staff specialising in numerous fields of English studies across our three campuses. Located in the UK, Malaysia and China, students are encouraged to spend a period of time at any or all of our campuses worldwide. Postgraduate taught programmes offered in the School of English are eligible for the Faculty of Arts and Social Sciences Postgraduate Scholarship. The scholarship entitles successful applicants to a 25% reduction in the programme fees. Both Malaysian and International applicants are eligible and the scholarships are valid for the entire duration of your programme. The full-time MA English Language and Literature course lasts 12 months and is divided into two semesters and a summer period. You will take four 15-credit modules per semester. You will then complete a dissertation over the summer to be submitted in September. Taught modules are assessed by a 5,000-word assignment or equivalent, and you must also submit a 14,000-word dissertation. To help guide you through your coursework, you will be assigned a personal tutor as well as a dissertation tutor. There are no examinations. This module is a core course in language and linguistics. It introduces and then develops key terms, theories, frameworks, ideological approaches and methodologies required in linguistic study and research. The module includes overviews of the major branches of language and linguistics study, and requires participation in the research community. It includes a research methods component and exemplifies many aspects of professional research dissemination. It also encourages critical evaluation, reflection and response to linguistic thinking and analysis, and provides an opportunity to practise presenting professional research. This 20-credit module addresses the question “What is literature?” by introducing key critical methodologies and theoretical frameworks that have been developed to study literary and dramatic texts. The principal objective is to encourage the students to use a variety of methodologies in the analysis of literary texts and to be reflexive as a literary critic. The module helps you feel confident in your ability to use different critical and theoretical frameworks to read literary texts. For this reason, the range of the module is purposely broad. Each Unit introduces a particular critical methodology or theoretical framework, and works through significant issues by examining a particular author, period or genre, ranging broadly over literatures from the fourteenth century to the present day. This module examines popular literature written in Britain during the late-eighteenth and nineteenth centuries. Students can expect to encounter works from a variety of different genres such as the gothic, detective fiction, early science fiction and/or fantasy. In addition to exploring a range of literary forms (which may include poetry, short and long prose fiction, and/or drama), the module will relate these to other media and cultural activities of the period, including stage spectacle and the visual arts. In addition to considering key works in their cultural and historical contexts, students will also be encouraged to relate module material to social, political and theoretical issues of continued relevance in the twenty-first century (e.g., colonialism and postcolonialism, power and authority, gender and sexuality, as well as attitudes and anxieties over science and technology). In this way, the module will introduce a range of interesting and influential works in a context that encourages critical engagement from different perspectives and that highlights the ongoing social relevance of the material under consideration. This module explores the use of linguistic frameworks to investigate literary texts. Through a series of practical analyses, students will be introduced to a range of linguistic explorations of poetry, prose, and drama from a wide range of historical periods. The course will invite students to use the analyses as an occasion for the critical evaluation of the various approaches to language and literature, to investigate the notions of literariness and interpretation, and to consider the scope and validity of stylistics in relation to literature and literary studies. The range of key research methods and methodologies in stylistics will be studied. This module will explore the relationship between literary texts and cultural concepts of modernity. Students will be introduced to a selection of texts from the 16th century to the present day, and a range of ideas and literary practices relating to innovation and to modernity/ ‘the modern’. Topics for discussion might include: early modern aesthetics; novelty and the eighteenth-century novel; modern gothic; Romantics and revolution; art, industry, and society; modernism; writing about the war. Writers to be considered will vary from year to year. This module focuses on the empirical study of linguistic texts in relation to their contexts of use, with an emphasis on grammatical analysis. It explores how grammar is used as a system of resources for making meaning in context. Essential concepts and categories of grammar from various theoretical perspectives are introduced as analytical tools for exploring how users of a language explore and represent the world around them, interact with each other through the language, and organise what they say or write. Through learning to analyse the grammatical patterns of various texts and how they are organised, students are enabled to make explicit statements about the language in use, taking into account contextual factors related to culture and situation. Applications of such analysis to areas such as critical evaluation of literary and non-literary texts, language pedagogy, academic development, and workplace practices are consequently explored. Students will choose a topic in consultation with the MA Course Convenor and an appropriate supervisor. The topic will normally be based on interests and skills the students have developed in the course of the modules already studied. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A relevant second class honours degree (or international equivalent). Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Malaysians applying as a matured student without the standard entry requirements but with substantial and relevant work experience (and have successfully passed APEL’s assessment through Malaysian Qualifications Agency) at an appropriate level may be considered. Admission is at the discretion of the School. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. The University’s Careers Advisory Services (CAS) support students with the necessary skills and career opportunities using its strong relationship with various employers and industries. The CAS will provide students with essential resources and guidance for career choices, offering many opportunities to develop the skills needed to plan and manage your future. Our Careers Advisory Service will work with you to improve and maximise your employability skills, as well as providing essential resources and guidance that will assist you with job/course applications. They will facilitate searches for appropriate work experience placements and connect you to a wide range of prospective employers and training opportunities. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}