{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/applied-linguistics-and-english-language-teaching-ma",
    "content": [
        {
            "p": "This course is particularly suitable if you are interested in language learning and teaching. You may already have tried teaching languages, or would like to pursue a career in teaching. We explore key issues in English language teaching from multiple perspectives, including: Our compulsory modules will give you a grounding in quantitative and qualitative research methods and key issues central to the understanding of second language acquisition. This course shares some of the same modules as our MA Applied Linguistics, which you can choose as optional modules on this programme. These cover topics including: \"We have great experts in the field, for example in language and business communication, language and health communication. Then we also have leaders in the field of language and gender, and English language teaching. For students on our applied linguistics programmes, we can offer experts across the board.\" Kathy Conklin, Professor in Psycholinguistics Read more from Kathy, including details of her research specialism, and top tips for those considering this area. “My time at the University of Nottingham has been incredibly rewarding. The MA program deepened my understanding of Applied Linguistics and English Language Teaching, and the teaching staff were always inspiring and supportive, encouraging me to think critically and explore new perspectives. Nottingham’s welcoming atmosphere made the experience even more enriching, both academically and personally.” Yousef (MA Applied Linguistics and ELT, 2023 to 24) “I really enjoyed my study life in UoN, because of patient and kind lecturers, helpful and considerate student service, gentle and hardworking classmates and beautiful and quiet university environment. I really love to have a walk and have a picnic in UON because it can refresh my mind. I am totally sure that you, new students, will learn a lot from lectures, and please cherish your one-year study experience which is great enough and is worthy to memorize in your whole life.\" Xiaolu Liang (MA Applied Linguistics and ELT, 2023 to 24) for grade point average among 92 universities, and 7th in the Russell Group. Research Excellence Framework 2021 and attend research events with the Centre for Research in Applied Linguistics (CRAL) Bring together research findings from linguistics, education and psychology as related to second language pedagogy. Pre-arrival reading lists will be sent out with registration information before you join your course, where available. The total credits for this course are 180. Part-time students will typically take three modules each academic year. You can take one in the autumn term and two in spring, or vice versa, depending on your preference and module choice. The dissertation will take place over the final summer of your studies. All classes take place during weekdays. Explore various approaches of collecting and processing data, using both qualitative and quantitative methods. With a focus on the area of applied linguistics, you will be introduced to: This module is worth 20 credits. \"My favourite module was 'Advanced Research Methods in Applied Linguistics'. This module equipped me with the most essential methodological skills for researching applied linguistics and benefited both my MA and PhD studies in this field.\" - Lefan Wang, 2019 graduate This module focuses on Second Language Acquisition (SLA), an area of research which focuses on the process of learning a second language. With many factors determining the success of language learners, we will study this process in detail and gain a better understanding of how second language competence is developed. You will be introduced to the main theories and findings from the field, related to topics such as: We will draw on a diverse body of research to inform our discussion. We also analyse case studies of language learners and specific learning situations. Crucially, you will develop important research skills, culminating in the development of your own research proposal in the area of SLA. You are taught in seminar groups, so there is plenty of opportunity for discussion of ideas and development of our students as researchers. You will attend workshops during the Spring term which go through the challenges of a larger-scale research project and the resources available to masters researchers. In addition, you will be assigned a supervisor in your subject area who will support you in developing your ideas and guide you through the process of preparing your dissertation over the Summer term. Most modules are assessed by written work of varying lengths, corresponding with the content and weighting of the module. Your course tutors provide detailed comments on assignments. Towards the end of your studies, you will complete a 12,000 to 15,000-word dissertation. This is a major piece of independent research, and you will be allocated a supervisor who is a specialist in your chosen area. Your dissertation supervisor will provide advice and guidance to help you select your area of study, and offer close supervision and support as you complete your research. During the taught part of the programme, you will typically have six hours of face-to-face timetabled contact a week. Your tutors will also be available during office hours to discuss your work, address any issues, and help you develop your understanding. One credit is approximately 10 hours of student work, so a 20-credit module will be around 200 hours of work. On average, you will spend around 13 hours per module per week on structured independent study. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Our step-by-step guide covers everything you need to know about applying. We offer: If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. You'll be able to access most of the books you’ll need through our libraries, though you may wish to buy your own copies of core texts. There is a Blackwell's bookshop on University Park campus. There are additional funding opportunities available to you as a Faculty of Arts student. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Monday 09 December 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}