{
    "url": "https://www.nottingham.edu.my/pgstudy/course/research/business-and-management-mphil-phd",
    "content": [
        {
            "p": "UNM/JPT-R/340/7/0681(7/26)MQA/SWA0817 UNM/JPT-R/340/8/0682(7/28)MQA/SWA0825 We offer high-quality doctoral training to postgraduate students who wish to pursue a PhD. You will be assigned at least two academic supervisors who will provide guidance on the formal specification of your topic, the structure and organisation of your thesis and the general direction of your research. To aid you in the transition to independent research and to help you acquire the necessary skills, you will complete a number of assessed taught modules during your first year of full time study, while part-time students normally complete within two years. Typical modules include: All streams: Developing Management Research, Research Design and Philosophy Business and Management stream: Introduction to Research Design and Data Analysis Finance and Risk stream: Contemporary Topics in Finance, Topics in Advanced Econometrics Industrial Economics stream: Advanced Macroeconomics or Advanced Microeconomic Theory (optional), Topics in Advanced Econometrics Students are required to submit an annual review in years one, two and three. You will submit draft literature chapters plus other required chapters along with delivering presentations about your research to a review panel of assessors. In year three, you will also submit a commentary that details how you have addressed the feedback you received from the previous year’s annual review. This will accompany an additional chapter submission and your presentation. If you are interested in applying, we encourage you to contact us to discuss your research project proposal with the relevant supervisor in the first instance. Please refer to the following link: https://www.nottingham.edu.my/business/courses/phd/phd-supervision.aspx to determine if your research interests coincide with those of a potential supervisor. You will be assigned three supervisors appropriate to your field who could be based in Malaysia or the School’s UK and/or China campuses. PhD students have access to the resources and facilities of the Graduate School along with access and use of NUBS Financial Trading Room and financial databases to enhance your postgraduate journey. As it is essential for PhD students to broaden their research outlook through the critical analysis of issues affecting businesses around the world, Nottingham University Business School’s unique global footprint with campuses in the United Kingdom, Malaysia and China enables our PhD students leverage on research resources across all three campuses. An overview of the structure of a typical full-time doctoral timetable is as follows: Year 1 Although a fourth year writing-up period is available, the expectation is that you will submit your thesis within three years. It is important that your research is written up on a continual basis during the three years of registration. Continual writing-up means that you should expect to prepare chapters to be read and commented on by your supervisors on a regular basis. This should help to ensure that when the formal writing-up period begins, you have a first draft of a thesis ready for modification. For your Year 1 annual review, you will submit a draft Literature Review chapter (8,000 words) and make a short presentation about your research to a review panel of assessors, which will include a clear summary of what you have achieved over the previous year, and a timeline for the completion of your PhD. You will also undergo a similar annual review at the end of Year 2 and Year 3. As part of the Year 2 annual review, you will submit a revised literature chapter and a sample chapter, which is likely to be a methods or empirical chapter. You will also be required to present your work to a review panel of assessors. Within your Year 3 annual review, you will submit a commentary that details how you have addressed the feedback received from the Year 2 annual review, and one or more empirical research chapters. You will also be required to present your work to a review panel of assessors. You will be assigned two academic supervisors who will provide guidance on the formal specification of your topic, the structure and organisation of your thesis and the general direction of the research. Regular supervision will help to ensure that your research progresses in the appropriate way. As a full-time doctoral student, you will meet with your supervisors on at least 10 occasions during the year. If you are a part-time student, at least six meetings take place during the year. Please refer to the research interests of our academic staff who supervise PhD research to determine if your research interests coincide with those of a potential supervisor. You may also refer to information on Research at NUBS Malaysia to determine if your research interests correspond with the wider research agenda within the School. Proposal The proposal is an integral part of the application for a position on the PhD programme at NUBS Malaysia. It will allow potential supervisors to look at the applicant’s research and help them decide whether the proposal is feasible for completion and whether they (the potential supervisors) can offer supervision or not. The proposal will also be considered by the School’s Research Committee to determine if there is adequate support for such a topic to be carried out at NUBS Malaysia. The proposal is expected to be 1,000 to 2,000 words long. If the applicant wishes to contact a member of academic staff from NUBS Malaysia to discuss potential supervision arrangements, it is advised that the applicant should either have a proposal ready, or is in the process of preparing a proposal to facilitate the discussion. You may wish to refer to this guide on writing a research proposal. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A master's degree (or international equivalent), with a taught and dissertation average of 65% or above; plus an upper second class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. MPhil An upper second class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Career destinations for our research postgraduates include: This content was last updated on 12 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}