{
    "url": "https://www.nottingham.ac.uk/pgstudy/funding/ahrc-studentship-in-politics-and-international-relations",
    "content": [
        {
            "p": "The School of Politics and International Relations invites expressions of interest from suitably qualified candidates for a fully-funded study programme leading to a PhD in Politics and International Relations. We are actively seeking potential candidates who would like to develop and submit studentship proposals in the area of politics and international relations. There are no restrictions on the proposed topic area, but we have identified two priority topic areas where we believe a PhD project would be particularly cutting-edge and where we strongly welcome expressions of interest. The topic areas are: Prospective candidates should outline their own doctoral research topic, but if you are interested in the priority topic areas listed above, our team will help you develop your ideas, offer feedback on your proposal drafts, and connect you with supervisors. Candidates will be expected to demonstrate an excellent record of academic achievement in politics and/or international relations or a related discipline and potential to complete an original and independent research project. The school will select one or more candidates to co-develop full applications for funding offered through the AHRC-funded Midlands4Cities Doctoral Training Partnership (M4C), which brings together eight leading universities across the Midlands to support the professional and personal development of the next generation of arts and humanities doctoral researchers. M4C is a collaboration between the University of Birmingham, Birmingham City University, University of Warwick, Coventry University, University of Leicester, De Montfort University, Nottingham Trent University and the University of Nottingham. Successful applicants will join a team of PhD researchers in the School of Politics and International Relations. You can find out more about our staff, their research interests and current doctoral supervision by consulting these pages, as well as the pages of individual academics. M4C studentships can be undertaken full-time and part-time. A full-time Open Doctoral Award receives three and a half years funding as standard; a full-time Collaborative Doctoral Award receives four years funding (a maximum of seven years and eight years respectively for part-time study). Find more information about the AHRC’s eligibility requirements. Applicants interested in applying for entry October 2022 should contact Professor Andrew Mumford (andrew.mumford@nottingham.ac.uk). Please send your CV, a one-page note on your preparation and motivation to conduct research to PhD level on a topic in Politics and International Relations using social science methods, and a one-page outline of your proposed research topic. We can advise on your eligibility and the fit of your proposed research with our interests and expertise. If the school agrees to support your application to the M4C DTP, you will then need to submit applications, first, for a PhD place to the University of Nottingham (two academic references will be required) and, subsequently, for funding via the M4C online portal. You can find more details about the application procedure and application writing support available at the University of Nottingham. Offered by Politics and International Relations"
        }
    ],
    "pdf_files": []
}