{
    "url": "https://www.nottingham.ac.uk/pgstudy/funding/developing-solutions-masters-scholarship",
    "content": [
        {
            "p": "Tuition fee scholarships of 50% or 100% for innovative and passionate students who can propose development solutions for their home countries within African, South Asian, and selected Commonwealth countries Developing Solutions is our flagship master’s scholarship, founded in 2001, for students from African, South Asian, and other selected Commonwealth countries. This scholarship programme is designed for international students who want to make a difference to the development of key economic, environmental, structural, social, or political structures in their home country. The University of Nottingham is offering scholarships covering 50% or 100% of full-time masters tuition fees. These one-year scholarships are available to support innovative and passionate students who can successfully demonstrate their ingenuity for developing solutions that will impact their home countries and incite change. To apply for this scholarship, you must: You are not eligible for this scholarship if you: Africa (all nations), Anguilla, Antigua and Barbuda, Bangladesh, Barbados, Belize, Bermuda, British Virgin Islands, Brunei, Cayman Islands, Dominica, Falkland Islands, Fiji, Gibraltar, Grenada, Guyana, India, Jamaica, Kiribati, Malaysia, Maldives, Montserrat, Nauru, Nepal, Pakistan, Papua New Guinea, Pitcairn Islands, Samoa, Solomon Islands, Sri Lanka, St Helena, St Kitts and Nevis, St Lucia, St Vincent and the Grenadines, Tonga, Trinidad and Tobago, Tristan da Cunha, Turks and Caicos Islands, Tuvalu and Vanuatu. * Where study has been undertaken in a country listed as an eligible Developing Solutions country, applications will be considered on a case by case basis. You must apply for and receive an offer to study a full-time masters (including MRes) at the University of Nottingham for 2025/26 before applying for this scholarship. Search for courses and find out how to apply. When you have received your offer to study with us, you can apply through the scholarships section of our application system, NottinghamHub. If you have an offer for an MRes course, email the scholarships team on scholarship-assistant@nottingham.ac.uk for instructions on how to apply. Applicants will be assessed first and foremost on how they can demonstrate their vision, and tangible plan for developing a specific solution that will positively contribute to key economic, environmental, structural, social, or political challenges within in their home country. Strong applicants will be able to link this to the learning outcomes of their course of study, and how this will facilitate their efforts. Where the ethos of Developing Solutions has been clearly evidenced, applications will then be looked at in line with more traditional scholarship criteria, including your reasons for studying at Nottingham and noteworthy achievements. Make sure you have enough time to prepare strong answers. We will assess your responses and academic merit when making scholarship decisions. Please note that there is a strict word count limit for all questions, which is outlined at the end of each question. The system does not automatically limit this, so you would be encouraged to check your application before you submit. Any responses submitted that exceed the outlined word count may not be reviewed. You do not need to respond to your offer before submitting your application for this scholarship, however awards will only be made to students who accept their offer to study with us. We will assess all scholarship applications before making any awards. You may be offered a scholarship of either 50% or 100% of tuition fees. We will contact you at the end of May 2025 to confirm the outcome of your application. If you are awarded this scholarship, it will be deducted from the tuition fees charged to you as a student at the University of Nottingham. We will not pay tuition fee scholarships to you directly. To maximise the reach of the university's scholarships offering, our international scholarships cannot be combined with other competitive University scholarships. Where you are awarded multiple scholarships, the single highest-value award will be applied. Check our frequently asked questions, scholarship application guidance notes and scholarship terms and conditions for further information. Offered by International Student Recruitment"
        }
    ],
    "pdf_files": []
}