{
    "url": "http://www.nottingham.ac.uk/pgstudy/courses/medicine/medical-sciences/sports-and-exercise-medicine-msc.aspx",
    "content": [
        {
            "p": "Whether you've studied medicine, physiotherapy or have a strong clinical background in musculoskeletal health (MSK), our Sports and Exercise Medicine MSc allows you to specialise in managing sports injuries and illnesses, explore the relationship between exercise and health, and get real-life experience in the field. At Nottingham, you'll learn anatomy through prosection, in our dedicated dissection room. Further your understanding through surface anatomy and the use of medical imaging. Take an evidence-based approach to sports injury management, both acute and chronic. And explore the public health aspect of physical activity. Gain pitch-side and clinical experience through placements at real sporting events at University level and with professional teams. You’ll develop your immediate and acute care skills and learn how to identify sporting injuries and illnesses. You’ll learn through practical teaching led by consultant Sports and Exercise Medicine doctors and physiotherapists. An advanced degree from Nottingham enables you to learn the science that underpins the practice of sports and exercise medicine and gives you the pitch-side skills needed to progress into a variety of sports medicine based careers. Earn an additional sport-specific Pre-Hospital Care Trauma Qualification through prosection in our dedicated dissection room You'll have the opportunity to provide real pitch-side emergency care at UoN sport events You'll study a series of core modules that provide you with knowledge and skills in sports medicine, epidemiology, the relationship between physical activity and health, and the management of sports injuries and illnesses. You'll also learn the science that underpins the practice of sports and exercise medicine, together with the pitch-side skills of resuscitation and immediate care, and research skills. The course takes place over three semesters: autumn, spring, and summer. Typically taught modules are delivered in the autumn and spring semesters with the summer used entirely for the research project (although preparation does take place during the autumn and spring semesters). However, this will be dependent on your mode of study. MSc students will take all of the compulsory modules and choose from one of the optional modules for a total of 180 credits. Students taking the Postgraduate Diploma (PGDip) cover the same modules but do not take the Project and Dissertation module, for a total of 120 credits. This module covers the relationship between physical activity and specific medical conditions; exercise under specific conditions and the practical aspects of medical management in sport. Encompassing internationalisation, physical activity and health and disease in developing countries is also addressed. This module will develop your critical appraisal skills so you can take an evidence based approach to your work. It covers the strengths and weaknesses of different types of study design, the key principals relevant to evaluating research (both quantitative and qualitative), whether a published journal paper or undertaking your own research projects. You'll also be taught how to use statistical software and how to analyse qualitative data. The overall aim of this module is to integrate the knowledge, skills and techniques required for the effective application of anatomy into the applied assessment of sports injuries. The overall aim of this module is to integrate the knowledge, skills and techniques required for the effective assessment of sporting injuries. An integrated approach to functional anatomy and the application of specific assessment/examination procedures is adopted. You'll benefit from linking their anatomy theory with their clinical practice. You'll have the opportunity to attend clinics in the region, ranging across Sports Medicine, Orthopaedic and Physiotherapy Specialist Clinics. This module is aimed at providing the skills needed for designing, undertaking and analysing data from the research project. It will see you undertake a research project on a topic relevant to sports and exercise medicine. Suitable project topics will be proposed by members of the MSc teaching team. You are free to make your own suggestions for projects, which may or may not be deemed acceptable. A project supervisor will be appointed for each project. This allocation is made at the start of the academic year and you're expected to work on the project throughout the year (the final year for part-time students). Internationalisation is central to this course. All students are able to suggest their own topics for research projects, which means overseas students have the option to collect data from their home countries if appropriate. This module is not taught per se. You'll meet regularly with your supervisor who will guide you during your project and there are a number of deadlines during the year to help you keep on track. Previous research projects have included: Not All Play Equipment Is Created Equal: Associations Between Equipment at Home and Children’s Physical Activity Factors affecting school physical education provision in England: a cross-sectional analysis A validation of the Nottingham Clavicle Score: a clavicle, acromioclavicular joint and sternoclavicular joint–specific patient-reported outcome measure Does arthroscopic sub-acromial decompression really work for sub-acromial impingement syndrome: a cohort study Normative adductor squeeze tests scores in rugby The overall aim of this module is to give you a practical grounding in sport and exercise nutrition. It will equip you with the knowledge and skills to advise the public (including different groups of athletes) on nutrition for sports and exercise. This requires you to be able to understand key nutritional concepts and metabolism, develop a critical awareness of evidence, and apply this knowledge to the assessment, monitoring and planning of diets. The module provides you with theoretical and practical knowledge and training to work as part of a medical team in professional team and event medicine. This will include the immediate management of an injured athlete as well as the multidisciplinary approach to sport injury management in the medium and longer term. It also covers anti-doping and medico-legal and ethical issues in professional sport. The modules will also provide you with an insight into specific issues associated with a range of sports both pitchside and at large scale sporting events with the practical aspects of medical management. The module will include the material required for the acquisition of a sport-specific Pre-Hospital Care trauma qualification. You'll also have the opportunity to observe and provide pitchside emergency care cover at sports events at the University of Nottingham (compulsory). Placements with professional sport teams will also be arranged for students (optional). This module provides an overview of concepts central to all forms of rehabilitation. You'll be introduced to an understanding of disability from different perspectives: models of disability, the biopsychosocial model and the WHO conceptual framework. Links between theory, research and practice in rehabilitation will be considered. The module will cover research issues in rehabilitation research, focusing particularly on complex interventions, evaluating interventions and measuring outcome. The module also explores how research evidence informs approaches to rehabilitation, using examples of rehabilitation in practice in different conditions from psychological and multidisciplinary perspectives. The module also considers the spectrum of rehabilitation, reviewing the broad range of health and social contexts in which rehabilitation occurs This module aims to equip students with real world skills in the diagnosis and management of clinical conditions in the wilderness, and the management skills necessary for the design and delivery of such a service. Teaching will encompass the range of environments in which wilderness medical staff operate (hot, cold, temperate and altitude environments), and through practical experience, facilitate students joining teams providing such care. Teaching is face-to-face, supported by online materials and independent study. Practical teaching will take place in the clinical skills suites and in the dissection room (module dependent). Along with more traditional classroom-based lectures and/or tutorials. Your work will be assessed during or at the end of each module through a variety of means. To complete a module and gain its credits you'll need to attend clinics, placements, practicals and get over the 50% pass mark. The Emergency Medicine qualification, which is part of the 'Team Medicine' module requires a pass mark of >50% (this will vary depending on the qualification taken). To achieve the MSc, you'll need a total of 180 credits. To achieve the PGDip, you'll need a total of 120 credits. We encourage our students to think of the course like they would a full-time job and spend around 37 hours on it per week including teaching time. Part-time students should consider it like a part-time job. You're expected to work roughly 10 hours for each credit on the course including teaching and independent study, so a 20 credit module should take around 200 hours to complete or around a total of 25 eight-hour days. Full-time students learn over two semesters and a summer period totalling around 12 months. You'll have an average of 10 to 16 hours of contact time each week during the autumn and spring semesters. However, the time and days of your teaching will depend on the optional module you choose. Contact time is generally grouped by full days of teaching to minimise travelling to campus. Previously teaching has primarily been delivered on Tuesdays and Thursdays. We try to provide you with your timetable for the year by the start of the academic year. Where changes happen, we try to give you six weeks' notice. Non-teaching days are intended for private study, including preparation for presentations and assessments, placements, clinics and research. Part-time students can learn the same course content over a period of 24, 36, or 48 months. Please note, if you choose to study over 36 or 48 months, you'll need to check if you can apply for Student Loan finance. Teaching usually takes place on two days a week during the semesters. You'll typically attend teaching one day or about four hours per week, depending on the modules you select. If you choose to study over three or four years, you'll have less. We try wherever possible to be flexible to help you manage your timetable. You're expected to devote around two and a half days per week to the course including attending teaching, private study. This includes preparation for presentations and assessments, placements, clinics and research. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Depending on your application there may be an interview or you may need to provide evidence of work experience. We may consider applicants with a 2:2 in relevant degrees, but these applications will be considered on a case-by-case basis. If you have any course-specific questions you can email the course directors, Yasmin Nasir Ajanah and Alan Norrish. Our step-by-step guide covers everything you need to know about applying. Our Medical School is based in Queen’s Medical Centre, one of the UK’s largest hospitals. There are dedicated clinical skills facilities including a dissection suite and teaching laboratories for medicine and healthcare students. The hospital is located opposite University Park Campus and connected by a footbridge for easy access. Nottingham city centre is 15 minutes away by public bus or tram. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you should factor some additional costs into your budget, alongside your tuition fees and living expenses such as accommodation and travel to placements and teaching. You should be able to access the books and resources you need for the course through our libraries, however you may wish to purchase your own copies or get specific books which may cost up to £80 each. Travel is necessary for placements and clinics, not all of which are in Nottingham. We have placements and clinics in Mansfield, Loughborough, Birmingham etc. Sometimes we are able to pay for travel, for example, where it is a competitively won place at a professional placement, but this varies from year to year. The cost of this will vary depending on which clinics/placements you attend and how many you attend. We always cover the cost of travel and accommodation (camping) for our placement to the Lake District in the summer, where we cover one of the UK’s premier Ultra Marathon event. Similarly, you'll be assigned to a University sports team at the start of the academic year. If you wish to travel with them to away games (which is optional), you'll usually be able to travel for free on the athletes’ bus. Depending on which emergency care qualification you undertake, which will vary based on your undergraduate degree and sports and exercise medicine work experience, you may need to cover the costs of travel to this course. In 2021/22, most students undertook the course in Nottingham, but some travelled to St Georges Park and some to Manchester United Football Club. This year we have been able to grant a bursary to these students to cover the cost of train travel and one night’s accommodation (the course is two days). This is the first year a bursary scheme has been available for students; it is unclear if it will be available on an ongoing basis. You may also incur costs if you decide, with your supervisor, to submit your research work to an academic conference. If you're accepted as a presenter, you'll need to register for the conference, travel there, and usually overnight stay is required. We do have a bursary scheme that you can apply for to cover some/all of these costs if your work is accepted at such a conference. Members of the British Association of Sport and Exercise Medicine are eligible for a bursary when studying this course. This £2,500 award is available for all members of BASEM who meet specific criteria beginning this course full-time or part-time. Find out more about the BASEM Bursary. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Friday 08 November 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}