{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/advanced-electrical-and-electronic-engineering-with-extended-research-msc",
    "content": [
        {
            "p": "The first year of this advanced MSc programme aims to provide you with a Master's level knowledge in Electrical and Electronic Engineering through a wide range of optional modules in order to suit your background, interest and career aspirations. In the second year, you will apply the knowledge and skills acquired to solve contemporary real world problems in an extended year long research project. This aims to further enhance your knowledge and skills base in order to boost your prospect of employment as a professional engineer in this field. The year long extended individual project will form the basis of your written dissertation and further develops your ability to engage in independent learning, prepare you for postgraduate research or careers in industry. The course will develop your ability to: This degree is accredited by the Institution of Engineering and Technology (IET) on behalf of the Engineering Council as meeting the requirements for Further Learning for registration as a Chartered Engineer. Candidates must hold a CEng accredited BEng/BSc (Hons) undergraduate first degree to comply with full CEng registration requirements. for electrical and electronic engineering The Guardian University Guide 2023 research groups in Power Electronics, Machines and Control in the world Power Electronics Research Group This course will be taught full-time over two years. You will complete 120 credits of taught modules in year one, followed by an extended individual project with a dissertation worth further 120 credits in year two. The Holistic Engineering Design module is vital for future engineers as it equips them with the skills and mindset needed to address the complex and multifaceted challenges of the modern engineering landscape. It encourages students to consider ethical, environmental, and societal aspects of engineering design, making them well-prepared to create sustainable and innovative solutions in their future careers. This course fosters creativity, critical thinking, and effective communication, which are essential skills for successful engineers. Assessment Weight Type Requirements Coursework 1 20.00 Laboratory Lab based exercise Coursework 2 15.00 Presentation Poster presentation Coursework 3 5.00 Assignment Poster peer assessment and completion Coursework 4 60.00 Group proposal presentation The Project Design and Development module equips students with the skills and knowledge needed to design, plan, and implement research projects – the module is essential for MSc students in the Department of Electrical and Electronic Engineering that will commence their individual project in the summer. Students will learn about the importance of developing proposals, time plans and project management, as well as the necessity to adequately explain the context and backgrounds of projects through critiquing literature. Students will engage with their assigned project supervisors to aid in this module. 80.00 Coursework Thesis background review (Chapters 1 and 2) Proposal Defence This module covers the development of advanced engineering software projects, spanning a range of application areas. Generic topics to be discussed include: Large-scale software management, robust design and coding techniques, accurate and efficient numerical computing for technological simulations, parallel computing techniques applicable to several classes of parallel computer e. multicore, distributed and graphics processing unit (GPU) based systems, database design and implementation. You’ll have a two-hour lecture each week to study for this module. This module covers a range of advanced control techniques used in a wide range of engineering applications. Typical topics include: Delivery Assessment method Part 1: weight 25%, 25 hours of student effort; assessment of student ability to demonstrate fundamental acquisition of the module's learning outcomes. Part 2: weight 25%, 25 hours of student effort; assessment of student ability to demonstrate application of the module's learning outcomes to realistic engineering design and implement tasks. This module covers the design of power electronic converters for real applications. Both component-level design and the impact of non-idealities on modelling and operation are considered. Exam, 40.0% Coursework 1, 30.0% Coursework 2, 30.0% Coursework: Power electronic systems design exercise that puts module content into practice using modelling and simulation tools. Key Module Topics Advanced modelling and control of power converters Enabling technologies of power conversion (semiconductor devices, packaging, cooling) This module introduces the principles, major algorithms, and implementation possibilities, of digital signal processing at an advanced level. Method and Frequency of Class: Method of Assessment: This module covers the control of AC drives, covering drives for a variety of machine types and control strategies, for example, vector control. This module: Part 1: weight 20%, 20 hours of student effort; assessment of student ability to demonstrate fundamental acquisition of the module's learning outcomes. Part 2: weight 30%, 30 hours of student effort; assessment of student ability to demonstrate application of the module's learning outcomes to realistic engineering design and implement tasks. This module introduces advanced electrical machine concepts and applications in the area of more electric transport, renewable generation and industrial automation. The module will help you to: Part 1: weight 12.5%, 12.5 hours of student effort; assessment of student ability to demonstrate fundamental acquisition of the module's learning outcomes. Part 2: weight 25%, 12.5 hours of student effort; assessment of student ability to demonstrate application of the module's leaning outcomes to realistic engineering design and implement tasks. This module will provide you with knowledge of the fundamentals of artificial intelligence technologies and their relevance to Electronic Engineering applications. It includes selected topics from the field of artificial intelligence with particular focus on the interface with electronic systems. Part 1: weight 30%, 25 hours of student effort; assessment of student ability to demonstrate fundamental acquisition of the module's learning outcomes. Part 2: weight 30%, 25 hours of student effort; assessment of student ability to demonstrate application of the module's learning outcomes to realistic engineering design and implement tasks. The module introduces both the syntax and application of HDL for the design of modern electronics. This includes: You also be introduced to the VHDL syntax and its latest development. The module will use the software tools from both Xilinx and Mentor Graphics to present FPGA based digital system design flow with VHDL. VHDL design project Selected topics from the interface between electronic and optical regimes. Issues regarding component, circuit and system design with applications to communications, material processing, biophotonics and optical imaging. To introduce fundamentals of optical and photonics technologies and their relevance to Electronic Engineering applications. Part 1: 25% weight, 25 hours of student effort; assessment of student ability to demonstrate fundamental acquisition of the module's learning outcomes. Part 2: 25% weight, 25 hours of student effort; assessment of student ability to demonstrate application of the module's learning outcomes to realistic engineering design and implement tasks This module aims to develop an understanding of the design and operation of power systems in aerospace, marine and automotive applications. With the introduction of more electrical technologies in these application areas, the understanding and expected performance of the power system has become a critical platform design issue. Part 1: weight 12.5%, 12.5 hours of student effort; assessment of student ability to demonstrate fundamental acquisition of the module’s learning outcomes. Part 2: weight 12.5%, 12.5 hours of student effort; assessment of student ability to demonstrate application of the module’s learning outcomes to realistic engineering design and implement tasks. This module introduces typical analytical, computational and experimental tools used in the study of Radio Frequency (RF) and high frequency devices and systems. This module will detail the fundamentals of electromagnetic wave propagation and typical RF devices such as antennas, antenna arrays, amplifiers, mixers and metal wave guides. Course Component Number of weeks Number of sessions Duration of a session 11 weeks 1 week 2 hours Lecture Duration 30.00 10 page report and LTspice simulation file Design files and documentation for an RF device Exam 40.00 Written (in person) 2Hr You will be taught and guided by highly experienced academics and professional engineers who are active in their respective areas of work through taught sessions and project-based work. The assessment strategy differs between the taught (120 credits) and individual project (120 credits) modules. A typical module contains both written assignment(s) and an end of semester exam which is mostly weighted as 40%. The individual project module is continuously assessed in year 2 and concludes with the submission of a research paper, as well as an oral assessment based upon the practical demonstration of the proposed engineering design/solution. The pass mark for all the modules is 50%. Your final degree classification will be based upon your aggregated achievement from both the taught and the project stages of 240 credits. You will study a total of 240 credits which consists of 120 taught credits over autumn and spring semesters, with the final 120 credits from a large individual project carried out in year 2. Typical class contact time is 4 hours per week for a 20 credit module. There is typically 11 weeks of class teaching in each taught semester. In addition direct contact with academics, students are expected to put in additional self-study time preparing for lectures, tutorials, labs and assignments. As a guide, one credit is equivalent to 10 hours of total combined effort. Typical class size is approximately 50 students. Teaching for this course usually takes place on Monday to Friday with the exception of Wednesday afternoon when students are involved in extracurricular activities. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Applicants with other relevant Engineering qualifications should demonstrate clear evidence that they have covered sufficient Electrical and or Electronics based subjects in their undergraduate studies. Please ensure that you include any relevant work experience in the personal statement of your application form. Our step-by-step guide covers everything you need to know about applying. University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. Most schools and departments are based here. You will have access to libraries, shops, cafes, the Students’ Union, sports village and a health centre. You can walk or cycle around campus. Free hopper buses connect you to our other campuses. Nottingham city centre is 15 minutes away by public bus or tram. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you should factor some additional costs into your budget, alongside your tuition fees and living expenses. Project equipment and components are normally covered by the department, though some students opt to buy some of their own components up to £100. You should be able to access most of the books you’ll need through our libraries, though you may wish to purchase your own copies or more specific titles which could cost up to £300. Please note that these figures are approximate and subject to change. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Tuesday 16 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}