{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/architecture-march-arb-riba-part-2",
    "content": [
        {
            "p": "This is the place where exceptional architects are created. You’ll study at a world-leading university that’s an expert in sustainable buildings. We’re home to the multi-award-winning Creative Energy Homes and Trent Basin sustainable community. Who is this course for? This course is ideal for ambitious architects who want to take the next step in their career. The MArch Architecture (ARB/RIBA Part 2) is a two-year professional course in architecture leading to an ARB and RIBA accredited degree. When you have completed Part 2 of your ARB/RIBA architecture journey, you’ll be a highly skilled, reflective graduate who will be able to apply your knowledge to the needs of the industry and be ready to register on the ARB/RIBA Part 3 course, the final step needed to complete your architectural education. What knowledge will I gain? You’ll gain cutting-edge knowledge taught by industry-leading and award-winning academics and practitioners, and practice applying your skills in the real-world. You’ll be able to solve global architectural challenges in a social and environmental context and be highly employable. In year one you’ll take a variety of modules covering design, humanities, environment and technology, and professional studies. In year two the emphasis is on independent research and student-centred learning that supports the completion of a major design thesis focused on an area of interest to you. You’ll work with our RIBA award-winning academics and tutors, bringing experience from leading design practices, including 31/44 Architects, Witherford Watson Mann Architects, winners of the RIBA Stirling Prize 2013, 6a Architects, finalist in the RIBA Stirling Prize 2017, and Caruso St John Architects, winners of the RIBA Stirling Prize 2016. You will also work with our honorary professors from RIBA award-winning practices East Architecture and Stephen Taylor Architects. Why should I choose University of Nottingham? We're ranked top 10 in the UK for Architecture and Built Environment (Complete University Guide 2024 and The Times Good University Guide 2023), and we’re ranked first in the Russell Group universities for overall satisfaction in Architecture, with 97% overall satisfaction and 97% teaching on my course (National Student Survey 2022 and 2023) as rated by our MArch Part 2 students. \"UoN students have a well-rounded understanding and skill set that is rooted in reality. They graduate with many of the capabilities that we need in people who can not only design, but also deliver beautiful and meaningful designs in this ever-accelerating world of technological and societal challenges and solutions.\" Mark Taylor, Director (Technical Design) at Allies & Morrison architects We are a global university, with staff and students from over 150 countries. We offer comprehensive support for international students, from scholarships and visa guidance to living here in Nottingham. You'll feel like you belong here, even before you start. We know how to welcome international students and have a comprehensive support package for you, from scholarships and visa guidance to living here in Nottingham (UK). and 5th in the UK for Architecture QS World University Rankings by Subject 2023 in the Russell Group universities for ‘overall satisfaction’ in Architecture The National Student Survey 2022 in Architecture Times Good University Guide 2023 In year one you will complete 120 credits of modules. The autumn design studio is a vertical studio taken together with year two students, supported by modules in architectural theory and environment/technology. In the spring, the design studio project, a complex collective living cohousing proposal, runs alongside professional studies and environment/technology modules; all three being integrated through the design project and structured along the RIBA Plan of Work stages. In year two you will complete a further 120 credits in the form of a design thesis, consisting of autumn design research and a spring design project. The emphasis is on independent research and student-centred learning on an area of interest to you. The course is guided by a set of core themes and shared interests - sustainability, continuity, reuse, construction, tectonics, inhabitation, and social inclusivity. The course seeks to impart a sense of optimism and engages in learning through collaboration and making. By the end of the course, you will have completed two parts of your three-part ARB/RIBA qualification programme for professional architects in the UK. Graduates will typically enter employment within architecture practice and register on an ARB/RIBA Part 3 course to complete their architectural education and gain entry to the profession. This module is a design studio that aims to develop architectural design and critical thinking skills to an advanced level. The studio is project-based, and its activities follow a design process in which analytical investigations and research explorations into a particular theme, site, and research problem are applied to inform the development of architectural proposals. Students have a choice of studio units, each of which embodies a distinct approach derived from their specific research focus and studio methodology, for example continuity, building systems, material language and urban transformation. This module is tutorial and workshop based. This module aims to develop a theoretical and critical understanding of architecture as an interdisciplinary field of research and practice. It will help to situate research in architectural history, theory, culture and criticism within the context of design studio work in relation to the broader culture in which architectural research and practice take place. The overall aim is the development of research skills that will be valuable both academically and in design practice – including the ability to identify a research problem and the methods required to address it, quickly, clearly and rigorously. This module is lecture, seminar and tutorial based. This module aims to develop practical knowledge, critical understanding and competent ability of sustainable environmental and technological aspects of architectural design. The module is designed to support practical applications in the studio, reinforcing skills in the integrative nature of architectural design. This module is lecture and workshop based. The module will give an overview of architectural practice, with particular emphasis on legal frameworks, forms of contract, and structure of architect’s services (RIBA Work Stages). This will cover construction law, building regulations and planning law, with an emphasis on practical application through the design studio project. The scope also includes information management and modelling, estimating construction project cost, procurement routes, forms of contract, design development, and circular economy and whole life costing. The programme has been carefully devised to integrate with the accompanying Architectural Design Studio, so that you can take the benefit of testing many of the professional topics that will be studied as your scheme develops. Areas of statutory compliance, project costs, procurement, fee bidding and client team are all to be based on work you are doing in the design studio. This will not only offer you efficiencies in learning but will also ensure you develop a holistic understanding of the development of a project. This module is lecture and workshop based. This design studio aims to develop the student’s core design, critical thinking and application skills through the production of a complex design proposal. Each student will explore shared housing through a comprehensive design that is integrated across all three spring modules and resolved at a range of scales from wider context to detail. This studio aims to develop skills in housing design, and thereby address one of the pertinent issues today, the housing crisis. The studio’s main project is structured by a rigorous design process that leads progressively from analytical investigations into site, programme and context, through to synthesis of a concept, which is applied to a complex design. Students have a choice of studio units, each with a particular focus and methodology. This module is tutorial and workshop based. The coursework is project-based with each student producing a design portfolio. Following on from Environment and Technology 1, this module aims to develop your practical knowledge and understanding of the environmental, construction, structural and technological dimensions of sustainable architectural design. The module is designed to support practical applications in the studio, reinforcing skills in the integrative nature of architectural design and sustainability. The MArch Architecture (ARB/RIBA Part 2) course consists of a holistic and integrated set of modules that inform each other, culminating in the design thesis, which is your opportunity to explore a topic you are passionate about and to develop your own voice as a young designer. The course emphasises practical problem-solving through research and the application of knowledge. Learning is project based with a focus on making. Technical, professional, and theoretical knowledge is integrated into design projects, so you learn the theory while applying it in practice. You will be guided by expert staff, academics and practitioners, who will support you in developing your interests and knowledge in architecture, as well as core architectural skills required in architectural practice today. Design studios are project-based and taught through tutorials, with supporting workshops, lectures and activities including a field trip. The other modules are taught through a combination of lectures, seminars, tutorials and practical workshops. Submissions for design studio are in the form of a portfolio, and for all other modules a combination of essays and research documents. In year two the autumn and spring portfolios are presented to the tutors at the end of term. Submissions are electronic. The Centre for 3D Design (C3D) is a workshop manned by a dedicated team of skilled technicians with practical construction and fabrication experience, that are available to support you in making physical models and built work. The workshop equipment includes a Five Axis Router, laser cutting, 3D Printing, vacuum forming, foam modelling, small scale spraying, and a wide variety of joinery and woodwork machining tools. Each module has a set of marking criteria aligned with its learning outcomes which reflect the ARB Criteria for the Prescription of Qualifications at Part 2. The marking criteria are used to assess your work via studio reviews, portfolio submissions, essays, and research papers. All marking is moderated across tutors / studios and then independently moderated. You must pass each module with at least 40% to progress. Your final degree classification will be calculated based on the credit weighting of each module, with an overall heavier weighting given to year two. Teaching for this course comprises circa 5 hours of contact time per week for lecture-based modules and circa 9 hours of contact time per week for studio-based modules. This is subject to timetabling and as workshops and activities are not conducted every week contact time may vary; for example, studio-based modules are generally between 6 to 14 hours per week. As a guide one credit is equal to approximately 10 hours of work, and therefore you will be expected to do a significant amount of self-study time. Class sizes vary with the modules. Studios are generally in small groups, usually between 10 and 20. Other modules are around 30 or 40 students but often break down into smaller seminar or tutorial groups of around 10. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. External applicants: Applicants who have completed undergraduate degree at an institution other than the University of Nottingham require: A minimum 2:1 BArch Hons (or equivalent ARB/RIBA accredited degree). Admission will be subject to the submission of a portfolio, transcript, letter of reference (minimum one), and a personal statement. Or A minimum 2:1 Architecture (not accredited). Admission will be subject to the submission of a portfolio, letter of reference (minimum one from practice), and a personal statement plus the completion of 6 months work experience evidenced (by the start of the programme, not by the time of application) through PEDR forms signed by a mentor or a signed letter on letterhead from their employer. Applicants who completed their undergraduate Part 1 degree at the University of Nottingham with a 2:1 standard and a 2.2 in their final year design studio modules gain automatic entry. Those with a 2:2 standard and a 2.2 in their final year design studio module are required to submit a portfolio, transcript and personal statement plus completion of 6 months work experience evidenced (by the start of the programme, not by the time of application) through PEDR forms signed by a mentor or equivalent. Those who have been out for more than 8 months are required to fulfil the same entry requirements as an external applicant above. Applicants that are required to submit a portfolio or personal statement (see above) should note the following. The portfolio enables us to see that you have the core skills required to be successful on the MArch Part 2 course, and to see the range of skills and design projects you have completed as well as your work experience. The portfolio should be submitted with your admissions application in PDF format and be less than 10MB. It should be 15–20 pages and have a front cover which shows your full name. The portfolio should contain examples of your university design projects, year out work experience, and may also include personal artistic work such as sketches, paintings, furniture, built objects, photography, etc. The personal statement should describe your interests in architecture and why you want to study at the University of Nottingham MArch Part 2 course. It should be one page. You can also include a brief biography or elaborate on any experience that might be relevant to your application. Our step-by-step guide covers everything you need to know about applying. University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. Most schools and departments are based here. You will have access to libraries, shops, cafes, the Students’ Union, sports village and a health centre. You can walk or cycle around campus. Free hopper buses connect you to our other campuses. Nottingham city centre is 15 minutes away by public bus or tram. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you should factor some additional costs into your budget alongside your tuition fees and living expenses. You should be able to access most of the books and journals you’ll need through our libraries, though you may wish to purchase your own copies or more specific titles which could cost up to £100 per year. Popular modelling materials as well as travel and accommodation related to compulsory field trips are paid for by the Department of Architecture and Built Environment. In addition to this you may spend up to £50 per year on printing and £50 per year on additional model making and drawing equipment. Submissions are now electronic so printing costs are substantially lower than they used to be, however you may do some printing for tutorials, model-making, and reviews. You are not required to purchase your own computing device however we have found that many students do. Depending upon your preference, allow from £600 for the purchase and also budget for software where this is not available through free student licence agreements. Please note that these figures are approximate and subject to change. For full details see our fees page. The University of Nottingham offers a wide range of bursaries and scholarships. These funds can provide you with an additional source of non-repayable financial help. For up to date information regarding tuition fees, visit our fees and finance pages. In addition to the above, students applying to the Faculty of Engineering may be eligible for faculty-specific or industry scholarships. A High Fliers Scholarships is offered to all those returning students from the University of Nottingham Faculty of Engineering who graduated with a first class undergraduate degree. For more details please see 'High Fliers Scholarship: MArch Architecture - ARB-RIBA Part 2' on our scholarships page. This applies to all campuses, China, Malaysia, and the UK. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Wednesday 20 November 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}