{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/applied-linguistics-ma",
    "content": [
        {
            "p": "Working alongside our expert staff, explore how linguistic research is applied to real-life contexts. You will have the option of studying modules in sociolinguistics, psychology of language, discourse analysis, stylistics, corpus linguistics, first and second language acquisition and teaching English as a foreign language. If you are particularly interested in teaching, please also see our MA Applied Linguistics with English Language Teaching (ELT) programme. We introduce the key ideas and concepts in applied linguistics, training you in relevant research methods including quantitative and qualitative approaches. You also have access to training, software and resources for conducting corpus-assisted studies of language in use. The key features of this course include: \"Our applied linguistics courses offers students an exciting range of topics, taught by world-leading experts in the field. We're dedicated to the application of linguistic knowledge to real-life problems, so our courses are ideal for those fascinated how language works and by its role in society, and for those wanting to use language in their future careers.\" Louise Mullany, Professor in Sociolinguistics “Pursuing my postgraduate studies in Applied Linguistics at UoN is the best decision I made in my academic career. This programme helped me to realise my passion for being a part of impactful linguistic research. I’m happy to say that UoN paved the way for me to become the researcher I ever wanted to be thanks to its academic standards.” Jayanath Tharindu (MA Applied Linguistics 2023 to 24) “I am deeply grateful for the opportunities the MA Applied Linguistics course has provided, as well as the continuous support from the faculty and abundant resources that have enabled me to excel in my field of interest. The course has been instrumental in refining skills that now play a vital role in all my academic, professional, and personal endeavours. The content is both fascinating and widely applicable, allowing you to tailor your learning to your own personal interests and abilities - making it a fantastic choice for those wanting to catalyse their professional development.” Jet Thompson (MA Applied Linguistics 2023 to 24) “My experience of completing the MA in Applied Linguistics at Nottingham University has been transformative. The program offered a wide range of modules, allowing me to explore different areas of language studies. It fuelled my passion with a solid academic foundation and an invaluable set of skills.” Ghadah Alhelail (MA Applied Linguistics 2023/24) for grade point average among 92 universities, and 7th in the Russell Group. Research Excellence Framework 2021 and attend research events with the Centre for Research in Applied Linguistics (CRAL) Attend and present your research at postgraduate student conferences and events, such as the Postgraduate Symposium and English Showcase. Pre-arrival reading lists will be sent out with registration information before you join your course, where available. The total credits for this course are 180. Part-time students will typically take three modules each academic year. You can take one in the autumn term and two in spring, or vice versa, depending on your preference and module choice. The dissertation will take place over the final summer of your studies. All classes take place during weekdays. Explore various approaches of collecting and processing data, using both qualitative and quantitative methods. With a focus on the area of applied linguistics, you will be introduced to: This module is worth 20 credits. \"My favourite module was 'Advanced Research Methods in Applied Linguistics'. This module equipped me with the most essential methodological skills for researching applied linguistics and benefited both my MA and PhD studies in this field.\" - Lefan Wang, 2019 graduate You are taught in small seminar groups, so there is plenty of opportunity for discussion of ideas and development of our students as researchers. You will be allocated a personal tutor, who will monitor your academic progress, provide feedback on your work, help with module choices, and assist with pastoral support if needed. You will attend workshops during the Spring term which go through the challenges of a larger-scale research project and the resources available to masters researchers. In addition, you will be assigned a supervisor in your subject area who will support you in developing your ideas and guide you through the process of preparing your dissertation over the Summer term. Most modules are assessed by written work of varying lengths, corresponding with the content and weighting of the module. You may also be assessed by other means, for example presentations or by original empirical work. Your course tutors provide detailed comments on assignments. Towards the end of your studies, you will complete a 12,000 to 15,000-word dissertation. This is a major piece of independent research, and you will be allocated a supervisor who is a specialist in your chosen area. Your dissertation supervisor will provide advice and guidance to help you select your area of study, and offer close supervision and support as you complete your research. You will typically have six hours of face-to-face timetabled contact a week. Your tutors will also be available during office hours to discuss your work, address any issues, and help you develop your understanding. One credit is approximately 10 hours of student work, so a 20-credit module will be around 200 hours of work. On average, you will spend around 13 hours per module per week on structured independent study. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Our step-by-step guide covers everything you need to know about applying. Labs 1 and 2 have eye-tracking facilities, where you can examine the ways people interact with texts and what aspects of language are more difficult to process. Both labs also have PCs for behavioural research, such as reaction time studies or decision making studies. Lab 3 is our psychophysiology lab, measuring things like moisture levels in the skin and facial muscle movements, which tell us about the degree and type of emotional responses to a text or other stimulus. Find out more about our labs. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. You'll be able to access most of the books you’ll need through our libraries, though you may wish to buy your own copies of core texts. There is a Blackwell's bookshop on University Park campus. There are additional funding opportunities available to you as a Faculty of Arts student. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Monday 09 December 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}