{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/research/american-and-canadian-studies-mres",
    "content": [
        {
            "p": "We are the only department in the UK to combine American with Canadian Studies. Our research in North American histories and cultural expression addresses concerns of race, gender, and sexuality. Our particular areas of research specialism include: Find out more about our research. You will take 180 credits. This is made up of a selection of taught modules (worth 60 credits), and a 25,000-word research dissertation (worth 120 credits). You will also attend research training sessions and regular graduate 'work-in-progress' seminars, led by the research student community. They are an opportunity to present your ongoing research to your peers, supervisors and invited academic staff and research students. You will then receive feedback and support. You will contribute a paper in semester two. This module involves the selection, research and writing up of a 25,000-word dissertation in the field of American and/or Canadian Studies. The dissertation is submitted at the end of the year and is marked by both an internal and external examiner. You will agree the topic with your supervisors (usually two co-supervisors). There is the possibility of a viva to confirm the award. This module is worth 120 credits. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. 2:1 (or international equivalent) in an arts, humanities or social science subject MRes applicants are encouraged to get in touch with the Departmental Director of Postgraduate Research (currently Dr Ruth Maxey) to discuss their areas of research interest prior to submitting their application. Our step-by-step guide contains everything you need to know about applying for postgraduate research. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA). These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. You'll be able to access most of the books you’ll need through our libraries, though you may wish to buy your own copies of core texts. There are funding opportunities which are only open to students within the Faculty of Arts. There are many ways to fund your research degree, from scholarships to government loans. Check our guide to find out more about funding your postgraduate degree. The department offers: We also offer regular conferences and symposia organised by staff and students. You will be encouraged to organise and attend conferences, act as editors for postgraduate journals, and publish book reviews and articles. There are regular opportunities to take part in outreach activities, public talks and departmental events. In addition to serving as Departmental Outreach and Engagement Coordinators and Directors of our LGBT and Black History Month programmes, students are given logistical and financial support in order to run their own conferences and organise a week-long research retreat. You will have two supervisors who are an active part of our established research staff. They will: View staff profiles for the Department of American and Canadian Studies. The Researcher Academy is the network for researchers, and staff who support them. We work together to promote a healthy research culture, to cultivate researcher excellence, and develop creative partnerships that enable researchers to flourish. Postgraduate researchers at Nottingham have access to our online Members’ area, which includes a wealth of resources, access to training courses and award-winning postgraduate placements. Our graduate centres are dedicated community spaces on campus for postgraduates. Each space has areas for: You will have access to a range of support services, including: Our Students' Union represents all students. You can join the Postgraduate Students’ Network or contact the dedicated Postgraduate Officer. There are also a range of support networks, including groups for: SU Advice provides free, independent and confidential advice on issues such as accommodation, financial and academic difficulties. University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. Most schools and departments are based here. You will have access to libraries, shops, cafes, the Students’ Union, sports village and a health centre. You can walk or cycle around campus. Free hopper buses connect you to our other campuses. Nottingham city centre is 15 minutes away by public bus or tram. Whether you are considering a career in academia, industry or haven't yet decided, we’re here to support you every step of the way. Expert staff will work with you to explore PhD career options and apply for vacancies, develop your interview skills and meet employers. You can book a one-to-one appointment, take an online course or attend a workshop. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. The University of Nottingham is ranked 7th in the UK for research power, according to analysis by Times Higher Education. The Research Excellence Framework (REF) is a national assessment of the quality of research in UK higher education institutions. *According to analysis by Times Higher Education ** According to our own analysis. This content was last updated on 19 September 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}