{
    "url": "https://www.nottingham.edu.my/pgstudy/course/taught/special-and-inclusive-education-ma",
    "content": [
        {
            "p": "UNM/JPT-R2/144/7/0005(2/28)A7269 This programme is designed for teachers or other professionals who have an interest in increasing their knowledge and skills in the field of special needs. The MA Special and Inclusive Education is suitable if you are: The programme offers a comprehensive focus on contemporary debates within special and inclusive education including local, national and international policies and approaches. We focus on the specific needs of children with learning difficulties and disabilities, communication impairments, literacy difficulties/dyslexia, autism and ADHD to illustrate the challenges encountered in professional practice. Critical exploration of current theory and research inform consideration of pedagogical approaches as well as the development of effective systems and structures for working with parents/carers and different agencies. This programme provides high quality professional development that offers flexibility for students to pursue areas of interest and specialisms. The internationally respected MA Special and Inclusive Education qualification supports career progression through: For the MA in Education: Special and Inclusive Education, you will need to successfully complete 180 credits. This will be composed of two core modules and two electives of 30 credits each. In addition, you will need to submit a dissertation, worth 60 credits, in a subject related to one of the modules and approved by your tutor. Debating Special and Inclusive Education This module focuses on critical issues in special education and inclusive education across the globe, and application of theories, policies, societal issues, and education and inclusive systems on educational provision for individuals who are marginalised, including those with special needs. Key topics include: Practice Based Inquiry The content will involve you in active critical consideration of participating in and leadership of practitioner inquiry in relation to professional context mapping and workplace learning. These processes will be achieved through: Dissertation This substantive piece of scholarship within the field of the course will normally be based on interests and skills you have developed in the course of the modules already studied. You will choose a topic in consultation with your course leader and an appropriate supervisor. Communication and Literacy This module focuses on the importance of communication and its close links to the development of literacy. This module explores the development of both communication and literacy skills, issues that arise in individuals with communication and literacy difficulties and educational support for communication and literacy development. Responding Mindfully to Challenging Behavior This module focuses on developing a critical understanding of theories on behaviour and relationship management, and reflecting on how these theories influence practical issues concerning the management of individuals with special needs. Please note that we offer only one or two modules at each teaching time point. To maximise your study period, we highly encourage that you align your programme start date with the first module of your choice. Please email the programme coordinator if you need help with module selection. Programme coordinator: Dr Sharimila Ambrose. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A relevant second class honours degree (or international equivalent). Relevant experience may be required for some of the modules. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Malaysians applying as a matured student without the standard entry requirements but with substantial and relevant work experience (and have successfully passed APEL’s assessment through Malaysian Qualifications Agency) at an appropriate level may be considered. Admission is at the discretion of the School. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed via a 6,000 word assignment. The dissertation is an original piece of work and should be of approximately 12,000–15,000 words on an approved topic. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Our graduates embark on successful careers within both education and academia. Many also branch out using their acquired leadership skills to work with international organisations and NGOs. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}