{
    "url": "https://www.nottingham.ac.uk/pgstudy/funding/china-and-malaysia-alumni-scholarship",
    "content": [
        {
            "p": "Masters scholarship covering 15% of tuition fees for alumni from our China and Malaysia campuses Continue your studies at the University of Nottingham in the UK with our masters scholarship for China and Malaysia campus alumni. We're offering scholarships covering 15% of full-time masters tuition fees. These are open to alumni from the University of Nottingham's campuses in China and Malaysia. To apply for this scholarship, you must: You must apply for and accept an offer to study a full-time masters course before applying for this scholarship. Search for courses and find out how to apply. When you have received your offer to study with us, you can apply through the scholarships section of our application system, NottinghamHub. Applications for the China and Malaysia Alumni Scholarship will remain open until the arrival and registration period at our UK campuses. Applications for the scholarship in 2025 will close at midnight (UK time) on Friday 10 October 2025. As part of the award criteria, we will check evidence of successful completion/graduation with the University of Nottingham Ningbo China or the University of Nottingham Malaysia. If you are awarded this scholarship, it will be deducted from the tuition fees charged to you as a student at Nottingham. We will not pay tuition fee scholarships to you directly. To maximise the reach of university's scholarships offering, our international scholarships cannot be combined with other competitive university scholarships. Where you are awarded multiple scholarships, the single highest-value award will be applied. International scholarships are available to self-funded students only. If you are sponsored by an external funding body, e.g. government, business, employer, trust or charity, you are not eligible to apply. Check our frequently asked questions and scholarship terms and conditions for further information. Offered by International Student Recruitment"
        }
    ],
    "pdf_files": []
}