{
    "url": "https://www.nottingham.ac.uk/pgstudy/funding/sports-scholarships",
    "content": [
        {
            "p": "Funding, coaching and support for elite athletes Achieve your sporting ambitions with our range of sports scholarship packages for high-achieving athletes in any sport. Our foundation sports scholarship package covers sports and fitness membership, specialist facilities and support, including physiotherapy support, with a scholarship value of £2,500. Our bronze, silver and gold packages also include financial support of £1,000 to £8,000 towards training and competition expenses, plus a range of other benefits including mentoring, sports psychology and nutrition advice, contributing to a total scholarship value of £4,500 to £13,500. We are also offering International Sporting Excellence Scholarships for international students with outstanding sporting ability, covering £5,000 towards tuition fees. To apply for this award, you must: Apply online through the sports scholarship application form. These scholarships are awarded on an ongoing basis so we recommend applying as early as possible. You do not need to receive an offer of study before applying for this scholarship, but we recommend applying for an academic course as soon as possible Search for courses and find out how to apply. You may be shortlisted for a scholarship after your initial application but you must receive and firmly accept an offer before a scholarship can be awarded to you. Priority is given to sports within the BUCS programme, Olympic, Paralympic and Commonwealth sports, with other sports considered on a case-by-case basis. Sports scholarships can be combined with academic scholarships where students are eligible for both and follow their separate application processes. See full terms and conditions (pdf). Offered by University of Nottingham Sport +44 (0)115 74 87000 Contact the Department of Sport"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/scholar-terms-and-conditions-.pdf"
    ]
}