{
    "url": "https://www.nottingham.edu.my/pgstudy/course/taught/international-development-management-msc",
    "content": [
        {
            "p": "UNM/JPT-R2/313/7/0004(5/27)MQA/SWA0179 Our academic staff are active researchers, pursuing cutting-edge, policy-relevant and curiosity-driven research across a broad spectrum of international development, international relations and politics. Our research and teaching activities are enhanced by the resources from our associated schools in the UK and the Division of International Studies at the University of Nottingham Ningbo China. We host our own seminars in which academics and practitioners share their research findings and work experience. The school’s student society, PHIR-NOTT, supplements these formal activities with its own round-table discussions, guest speaker series and other events. International development is the multidisciplinary study of how communities and states attain the economic, socio-political and other characteristic elements associated with development. This programme is designed to give you the opportunity to develop a comprehensive multidisciplinary understanding of international development along with examining the possibilities for development in a globalising world. It looks at understanding the reasons for the persistence of global poverty and inequality but also how current development paradigms contribute to poverty reduction and human development. The course investigates applying development theory to enhance development practice at the grassroots level and to identify, design and implement appropriate interventions to improve development outcomes. It provides the practical skills required for employment in the development sector, including how to design, implement and manage development projects. We provide a dynamic learning environment that offers you the opportunity to challenge yourself, to question assumptions and to contribute to the way we understand, conceptualize and engage with global political phenomena. You will be required to complete 180 credits over the period of your studies: 120 credits of taught modules and a 60-credit dissertation, based on your own original research. The full-time and part-time evening class variant of the degree is taught at our city centre facility, The Kuala Lumpur Teaching Centre, at the Chulan Tower, Jalan Conlay – a great option for those based in Kuala Lumpur and in full-time employment. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A relevant second class honours degree (or international equivalent). Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Malaysians applying as a matured student without the standard entry requirements but with substantial and relevant work experience (and have successfully passed APEL’s assessment through Malaysian Qualifications Agency) at an appropriate level may be considered. Admission is at the discretion of the School. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. KLTC is a UNM facility located in the heart of Kuala Lumpur. Select postgraduate programmes from business, politics and applied psychology are delivered here to support the flexibility of postgraduate students. The centre also served as a supplementary venue for the University’s external events, seminars and conferences. KLTC is located on the second floor of Chulan Tower, near the Petronas Twin Towers and the Bukit Bintang district. It is easily accessible via the city’s train system, with the building located next to the Conlay MRT station. Free shuttle bus services are also available from the UNM Semenyih campus to KLTC. The University’s Career Advisory Services (CAS) support students with the necessary skills and career opportunities using its strong relationship with various employers and industries. The CAS will provide students with essential resources and guidance for career choices offering many opportunities to develop the skills needed to plan and manage your future. Our Careers Advisory Service will work with you to improve and maximise your employability skills as well as providing essential resources and guidance that will assist you with job/course applications. They will facilitate searches for appropriate work experience placements and connect you to a wide range of prospective employers and training opportunities. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}