{
    "url": "https://www.nottingham.ac.uk/pgstudy/courses/research-courses-explained.aspx",
    "content": [
        {
            "p": "A research course allows you to explore a particular topic in depth. You will conduct a piece of original and independent research, leading to a thesis or dissertation. MRes programmes are usually one-year full-time or two years part-time. They combine research and taught elements with a greater focus on research than an MA or MSc course. Most of your time will be spent working on a research project with support from your academic supervisor(s). PhD programmes are the highest degree awarded by universities in the UK. A PhD provides you with an opportunity to undertake a significant piece of academic research. A PhD is a considerable commitment and, at Nottingham, it typically takes three to four years to complete one full-time, or up to six years part-time. All our PhD programmes provide you with the opportunity to complete additional training and development to support your research and wider transferable skills. You will complete a written thesis of up to 100,000 words, with expert support and advice from your academic supervisor(s). You will also take a verbal examination called a viva voce where you explain your project in depth to an examination panel. Some students choose to complete a Master of Philosophy MPhil. This is a shorter version of a PhD and a qualification in its own right. Research is carried out in a similar way, typically including a shorter thesis, over two years full-time or up to four years part-time. Professional doctorates are different from traditional PhDs, in that they are more appropriate for those pursuing professional careers, rather than academic. They also typically include some taught modules, a compulsory training element and a shorter thesis. A Doctor of Medicine DM is professional research degree for qualified doctors. You must be either already registered with the General Medical Council (GMC) or eligible for GMC registration to study this degree. If you wish to complete medical research but intend to work solely in clinical settings, you should apply to study a DM. However, if you would like to be able to work academically or complete further research within the field of medicine, we recommend you apply for a PhD. Applicants sometimes confuse a DM with the Doctor of Medicine MD degree offered in countries such as the US and Canada. These qualifications are not equivalent to one another. If you want to study to become a licenced medical professional, check our undergraduate medical degrees. Find a research programme A studentship is a fully funded research place in a specific area. The process is similar to applying for a job and the advert will give specific details of how to do this. You may also need to submit a formal application for the programme. Find a studentship A doctoral training programme allows you to work towards your PhD alongside a group of fellow doctoral students (though you may be researching different projects). You will benefit from high-level research and skills training, with places often funded by research councils or charitable trusts. Each opportunity has a different application process and deadlines. You may also need to submit a formal application for the programme. Find a doctoral training programme While these routes do not necessarily include funding, you may be able to apply for a scholarship or other sources of funding. You may wish to identify a specific supervisor working in your field of interest and approach them directly to discuss your research idea. They may be able to help you with developing a research proposal and applications to secure funding. You will still need to submit a formal application to the University. Find an expert You can also find out if research in your area of interest is already taking place at the University. You would then apply directly to the relevant school, department or institute. Find out about our research"
        }
    ],
    "pdf_files": []
}