{
    "url": "https://www.nottingham.edu.my/pgstudy/course/taught/english-with-creative-writing-ma",
    "content": [
        {
            "p": "UNM/JPT-R2/0231/7/0007(9/29)MQA/SWA9675 UNM’s MA in English with Creative Writing brings together creative and critical practices, exploring the writing process within the contexts of publication and professional writing. This degree is particularly relevant to students who are keen to develop creative writing skills in a professional capacity. However, it also includes selections from modules in English language and literature, which complement any career path within the larger field of English studies. You will also develop a specialist knowledge for research methods and practices in the wider field of English. Obtaining an MA degree demonstrates a high level of knowledge in a specific field. It can enhance your employability and prepare you for further academic research and vocational training. You will cover the range of theoretical approaches making up the contemporary critical terminology of English and English studies. The course will also develop your awareness of practices in language use and their application to various contexts. The course will focus on developing your ability to engage in critical evaluations of current research along with developing your ability to problem-solve in respect of real-world projects and case studies. Our global footprint allows you to draw on the supervisory expertise of over 80 staff specialising in numerous fields of English studies across our three campuses. Located in the UK, Malaysia and China, students are encouraged to spend a period of time at any or all of our campuses worldwide. The full-time MA English with Creative Writing lasts 12 months and is divided into two semesters and a summer period. You will take four 15-credit modules per semester. You will then complete a Creative Project over the summer to be submitted in September. Taught modules are assessed by a 5,000-word assignment or equivalent, and you must also submit a 14,000-word dissertation. To help guide you through your coursework, you will be assigned a personal tutor as well as a dissertation tutor. There are no examinations. This module explores the structures, techniques and methodologies of fiction through both creative and analytical practice. Students examine a range of international fiction from a writer's perspective with an emphasis on craft. Assignments include creative exercises of imitation or modelling, as well as direct responses to works of fiction in ways that demonstrate a practical understanding of their qualities. Analytical writing focuses on the functional aspects of selected works. Particular issues for consideration might include narrative voice and technique, point of view, character development, dialogue, plot, and setting. Students consider not only the elements of fiction, but also how those elements contribute to the overall structure of a narrative. The module is designed to make students familiar both with the craft and practice of using some common poetic conventions, and with the contexts in which poetry is published and read. Fundamental to the module’s is approach is the idea of questioning those conventions, and exploring what else might be possible. Each session includes some lecture-style input, group discussion, and a workshop during which students share and discuss their draft poems. Through this ‘practitioner’ approach, students are not only supported in their craft but also encouraged to work towards submitting their work for publication. Lecture-style content and focus of discussion: The conventions which make up the module’s technical focus include poetic structure; imagery; the lyric ‘I’; the relation between form and content; and poetic voice. The reading list from which the poems which illustrate these conventions is designed to give a view of a range of important publishing contexts. These will include: poetry magazines; new writers’ anthologies; debut poetry collections; poetry in performance; poetry competitions. Writing workshop: The students share their poems and drafts during the workshop part of each session, within which they learn both to refine their craft and to develop their skills in discussing their peers’ draft work. The idea of sources and influences provides one of the module's themes. This module is designed to develop students' skills in writing while developing their awareness of contemporary publishing. Each session includes some lecture-style input, and group discussion. This module enables students to develop their creative-writing skills through a range of activities that includes group discussions, exercises and workshops led by the tutor. Students are encouraged to develop their own creative practice through an examination of a range of ideas and techniques. These sessions may be accompanied by individual meetings with the tutor for contextualisation of feedback and commentary as well as further guidance required for the development and revision of selected work. Matters such as reviews, publication, public readings, and the teaching of creative writing may be included as ways of examining the context of creative practice. As a result of these activities, students learn how to incorporate the responses of others into their revisions, develop a more productive writing process, and become better editors of their own work. This 20-credit module addresses the question “What is literature?” by introducing key critical methodologies and theoretical frameworks that have been developed to study literary and dramatic texts. The principal objective is to encourage the students to use a variety of methodologies in the analysis of literary texts and to be reflexive as a literary critic. The module helps you feel confident in your ability to use different critical and theoretical frameworks to read literary texts. For this reason, the range of the module is purposely broad. Each Unit introduces a particular critical methodology or theoretical framework, and works through significant issues by examining a particular author, period or genre, ranging broadly over literatures from the fourteenth century to the present day. Students will choose a topic in consultation with the MA Course Convenor and an appropriate supervisor. The topic will normally be based on interests and skills students have developed in the course of the modules already studied. This module focuses on the empirical study of linguistic texts in relation to their contexts of use, with an emphasis on grammatical analysis. It explores how grammar is used as a system of resources for making meaning in context. Essential concepts and categories of grammar from various theoretical perspectives are introduced as analytical tools for exploring how users of a language explore and represent the world around them, interact with each other through the language, and organise what they say or write. Through learning to analyse the grammatical patterns of various texts and how they are organised, students are enabled to make explicit statements about the language in use, taking into account contextual factors related to culture and situation. Applications of such analysis to areas such as critical evaluation of literary and non-literary texts, language pedagogy, academic development, and workplace practices are consequently explored. This module will explore the relationship between literary texts and cultural concepts of modernity. Students will be introduced to a selection of texts from the 16th century to the present day, and a range of ideas and literary practices relating to innovation and to modernity/ ‘the modern’. Topics for discussion might include: early modern aesthetics; novelty and the eighteenth-century novel; modern gothic; Romantics and revolution; art, industry, and society; modernism; writing about the war. Writers to be considered will vary from year to year. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A relevant second class honours degree (or international equivalent). Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Applicants applying for Master of Arts in English with Creative Writing will be asked to submit an example of their written work. You will be contacted by the university with full details of how to submit this. Malaysians applying as a matured student without the standard entry requirements but with substantial and relevant work experience (and have successfully passed APEL’s assessment through Malaysian Qualifications Agency) at an appropriate level may be considered. Admission is at the discretion of the School. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. A postgraduate research degree in English equips you with the skills to succeed in a variety of careers including advertising, banking, broadcasting, business, communications, human resources, journalism, law, marketing, public relations, publishing and teaching to name just a few. Former research students hold senior posts in top-tier universities across the world and prominent positions in government and the private sector This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}