{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/research/architecture-social-science-phd",
    "content": [
        {
            "p": "Research in architecture at Nottingham covers a diverse multidisciplinary field including: architectural history, theory and criticism; philosophy of technology; critical and cultural theory; architecture and the body; architecture and language; museums and national identity. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. 2:1 (or international equivalent) and/or a masters at merit level or above in a relevant subject We encourage you to get in touch with a member of academic staff about your research proposal before submitting an application. They may be able to help you with your proposal and offer support to find funding opportunities in your area. Engineering supervisors, including their research interests and contact details, can be found on our find a PhD supervisor page. Details of research supervisors at the University can also be found on our research A to Z. Our step-by-step guide contains everything you need to know about applying for postgraduate research. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA). These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). There are many ways to fund your research degree, from scholarships to government loans. Check our guide to find out more about funding your postgraduate degree. The Researcher Academy is the network for researchers, and staff who support them. We work together to promote a healthy research culture, to cultivate researcher excellence, and develop creative partnerships that enable researchers to flourish. Postgraduate researchers at Nottingham have access to our online Members’ area, which includes a wealth of resources, access to training courses and award-winning postgraduate placements. Our graduate centres are dedicated community spaces on campus for postgraduates. Each space has areas for: You will have access to a range of support services, including: Our Students' Union represents all students. You can join the Postgraduate Students’ Network or contact the dedicated Postgraduate Officer. There are also a range of support networks, including groups for: SU Advice provides free, independent and confidential advice on issues such as accommodation, financial and academic difficulties. University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. Most schools and departments are based here. You will have access to libraries, shops, cafes, the Students’ Union, sports village and a health centre. You can walk or cycle around campus. Free hopper buses connect you to our other campuses. Nottingham city centre is 15 minutes away by public bus or tram. Whether you are considering a career in academia, industry or haven't yet decided, we’re here to support you every step of the way. Expert staff will work with you to explore PhD career options and apply for vacancies, develop your interview skills and meet employers. You can book a one-to-one appointment, take an online course or attend a workshop. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. Discover how our research changes the world around us. The University of Nottingham is ranked 7th in the UK for research power, according to analysis by Times Higher Education. The Research Excellence Framework (REF) is a national assessment of the quality of research in UK higher education institutions. *According to analysis by Times Higher Education ** According to our own analysis. This content was last updated on 03 December 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}