{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/advanced-architecture-design-march",
    "content": [
        {
            "p": "Our MArch Advanced Architecture Design programme focuses on the development and application of specialist architectural knowledge and advanced design techniques and technologies. It is established to respond to the increasing competition in the professional procurement of buildings and the growing demand for specialist knowledge and skills in the pursuit of architectural excellence. This programme offers the opportunity to concentrate on architectural or urban design, humanities, environmental design and technology to a high level of sophistication without the need to work within a single specialist area. and 5th in the UK for Architecture QS World University Rankings by Subject 2023 in the Russell Group universities for ‘overall satisfaction’ in Architecture The National Student Survey 2022 in Architecture Times Good University Guide 2023 In the autumn and spring semesters, you will complete 120 credits worth of modules including two design modules. These are studio-based exercises where practical skills and creativity are challenged and examined through an architectural project. Additional lectures and seminar modules provide a parallel knowledge base and intellectual support for the design project and for the final dissertation or design thesis project. You will spend the summer semester producing a 60-credit supervised dissertation or design thesis project. This will be an in-depth study of an individually determined topic and is an opportunity to conduct a major piece of independent research that reflects individual interests and aspirations. The purpose of this module is to develop architectural, urban design skills and awareness through the design of architectural and urban interventions at an appropriate scale and resolution, in response to a brief. Students are encouraged to engage with a specific design specialism, to adopt novel approaches to the generation of design concepts, and to develop these in detail in response to the circumstances of both the physical, cultural and intellectual context of the project. This is a studio-based design module within a specialist design units (for example: architecture design, museum design, tall buildings, sustainable architecture design, architectural tectonics, sustainable urban design). The projects will involve the design of an architectural or urban intervention at an appropriate scale and resolution in response to an advanced design brief. The module provides higher-level skills and understanding necessary for postgraduate study within specialist streams and explores the integration and development of advanced specialist concepts, ideas, technologies and thinking within the architectural and urban design environment. Throughout the semester, students are expected to undertake in-depth conceptual development, design research, design testing and evaluation, and final presentation. The purpose of this module is to develop advanced architectural and urban design skills and awareness through the design of architectural and urban interventions at an appropriate scale and resolution. Students are encouraged to engage with a specific design specialism, to adopt novel approaches to the generation of design concepts, and to develop these in detail in response to the circumstances of both the physical, cultural and intellectual context of the project. This is a studio-based design module within a specialist design unit (for example: architecture design, museum design, design and build, tall buildings, sustainable design, architectural tectonics, urban design). The project will involve the design of an architectural or urban intervention at an appropriate scale and resolution in response to an advanced design brief. The module provides higher-level skills and understanding necessary for postgraduate study within specialist streams and explores the integration and development of advanced specialist concepts, ideas, technologies and thinking within the architectural and urban design environment. Throughout the semester, students are expected to undertake in-depth conceptual development, design research, design testing and evaluation, presentation and communication. This module enables students to acquire the core skills used in research and practice these through an exploration of a specialist subject relevant to architecture and the built environment. This module covers the skills and resources needed to conduct independent academic research, including how to present findings effectively. It will cover choosing a research topic, how to shape research literature search techniques, including the use of the web. As a result, students will be able to conduct their own primary research, including quantitative and qualitative methodologies; data collection and simple statistical analysis. Opportunities to practice these skills will be presented through participation in a mixture of lectures, seminars and workshops designed to introduce specialist subject areas relevant to the field of architecture and related disciplines. This module aims to enable students to plan, implement and write up a substantial piece of original research that will make a contribution to the intellectual life of the discipline. Students can choose between a research dissertation or a design thesis project in the Summer term. The dissertation module aims to enable students to plan, implement, and write up a substantial piece of original research that will make a contribution to the intellectual life of the discipline of urban design. The dissertation seeks to enable students to: The design thesis project module is a research and studio-based module that aims to further develop advanced level design skills and knowledge. The structured project within the module builds upon the design, practical, and theoretical modules in the Autumn and Spring semesters and involves the completion of a detailed thesis design solution that should reflect the investigative research that is conducted through a written design research report. The design thesis project will enable students to: Learning will take place through a range of specialist lectures, seminars and design studio modules. You will explore current and future issues facing urban designers, architects and technologists, and develop the skills, knowledge and awareness required in the fast-moving world of contemporary architectural research and practice. In the autumn and spring semesters, you will complete 120 credits worth of modules. This will include: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Applicants to all MArch programmes are required to submit a portfolio of their design work with their application. The portfolio enables us to see that you have some of the core skills required to be successful on an MArch course and to see the range of skills and types of projects that you have completed in your undergraduate degree. The portfolio should be submitted with your admissions application and be in PDF format and less than 10Mb (please submit this directly onto the MyNottingham admissions system). The portfolio should have: The portfolio should contain: Portfolios will be judged on whether you have the architectural design skills to enter a specialised postgraduate degree programme. We want to see a keen sense of judgement and spatial awareness in your work, and an ability to graphically display this. Our step-by-step guide covers everything you need to know about applying. University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. Most schools and departments are based here. You will have access to libraries, shops, cafes, the Students’ Union, sports village and a health centre. You can walk or cycle around campus. Free hopper buses connect you to our other campuses. Nottingham city centre is 15 minutes away by public bus or tram. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you may factor some additional costs into your budget, alongside your tuition fees and living expenses. You should be able to access most of the books you’ll need through our libraries, though you may wish to purchase your own copies or more specific titles which could cost up to £100 per year. In addition to this you may spend up to £50 per on printing and up to £50 on model making and drawing equipment. Please note that these figures are approximate and subject to change. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Friday 26 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}