{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/research/art-history-phd",
    "content": [
        {
            "p": "Take the time to create your own original research in art history and visual culture. At Nottingham you'll receive: You will have at least two supervisors from our research-active and creative staff. You may also be able to strengthen your supervisory team from across our Midland4Cities partner universities. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Masters degree in art history or a subject relevant to your research. Identify and contact a potential supervisor from our research staff to check whether we can adequately support your research interests before submitting an application. If you're not sure how your research might fit into our existing programme contact out postgraduate admissions tutor Dr Mark Rawlinson who'll be happy to discuss. Joint supervision and collaboration may also be available from other University of Nottingham departments or Midlands4Cities partner universities. Most students apply to start the course in September but December starts are also possible. Our step-by-step guide contains everything you need to know about applying for postgraduate research. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA). These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. Optional field trips may require you to pay for your own travel and entrance fees. There are funding opportunities which are only open to students within the Faculty of Arts. There are many ways to fund your research degree, from scholarships to government loans. Check our guide to find out more about funding your postgraduate degree. These regular seminars allow you to broaden your knowledge of the subject and gain a better sense of how research develops as part of an interactive process. In particular you can: See recent recent seminars organised by the Centre for Research in Visual Culture. During your doctoral studies, you can apply to work as a Postgraduate Teaching Assistant (PGTA) within the Faculty of Arts. We offer a limited number of part-time annualised hours contracts of employment. They provide invaluable teaching experience in delivering and supporting seminars, as well as marking, assessing and giving feedback on students’ work. We provide dedicated training and professional development. (Please note - applications for PGTA positions are competitive and are not guaranteed.) Visit the Digital Transformations Hub website. Get involved in our student-led curatorial group and gain valuable practical experience in leadership, design, curatorship, marketing and promotion, networking and project management. You can make full use of the Language Centre facilities for both research-specific learning and personal interest. The Researcher Academy is the network for researchers, and staff who support them. We work together to promote a healthy research culture, to cultivate researcher excellence, and develop creative partnerships that enable researchers to flourish. Postgraduate researchers at Nottingham have access to our online Members’ area, which includes a wealth of resources, access to training courses and award-winning postgraduate placements. Our graduate centres are dedicated community spaces on campus for postgraduates. Each space has areas for: You will have access to a range of support services, including: Our Students' Union represents all students. You can join the Postgraduate Students’ Network or contact the dedicated Postgraduate Officer. There are also a range of support networks, including groups for: SU Advice provides free, independent and confidential advice on issues such as accommodation, financial and academic difficulties. The Centre is involved with all aspects of contemporary art and visual culture. Its activities reflect the research interests of staff and students in the department. Students attend regular seminars and symposia hosted by CRVC. Our latest seminar series \"Re-writing history? Monuments, iconoclasm, and social justice movements in 2020\" provided a snapshot of the long history of monuments, protest and oppression and explored the historical significance of this moment. Visit the Centre's website Whether you are considering a career in academia, industry or haven't yet decided, we’re here to support you every step of the way. Expert staff will work with you to explore PhD career options and apply for vacancies, develop your interview skills and meet employers. You can book a one-to-one appointment, take an online course or attend a workshop. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. The University of Nottingham is ranked 7th in the UK for research power, according to analysis by Times Higher Education. The Research Excellence Framework (REF) is a national assessment of the quality of research in UK higher education institutions. *According to analysis by Times Higher Education ** According to our own analysis. This content was last updated on 01 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}