{
    "url": "https://www.nottingham.ac.uk/pgstudy/funding/south-asia-postgraduate-excellence-award",
    "content": [
        {
            "p": "Unlock your potential with our South Asia Postgraduate Excellence award, a tuition fee scholarship for masters students who live in specific South Asian countries The South Asia Postgraduate Excellence Award is the University of Nottingham’s scholarship award, designed to support international students who have achieved academic excellence and show true passion for their chosen field of study. We're offering scholarships covering a contribution of between £4,000 and £8,000 towards full-time masters tuition fees for high-achieving international students who live in South Asia. To apply for this scholarship, you must: You must apply for and receive an offer to study a full-time masters (including MRes) for 2025/26 at the University of Nottingham before applying for this scholarship. Search for courses and find out how to apply. If you have an offer for a taught masters course, you can apply through the scholarships section of our application system, NottinghamHub. If you have an offer for an MRes course, email the scholarships team on scholarship-assistant@nottingham.ac.uk for instructions on how to apply. In your application, you will be asked about your achievements, study plans, reasons for choosing to study with us and details of predicted grades (if applicable). Make sure you have enough time to prepare strong answers. We will assess your responses and academic merit when making scholarship decisions. Please note that there is a strict word count limit for all questions, which is outlined at the end of each question. The system does not automatically limit this, so you would be encouraged to check your application before you submit. Any responses submitted that exceed the outlined word count may not be reviewed. You do not need to respond to your offer before submitting your application for this scholarship, however awards will only be made to students who accept their offer to study with us. We will contact you at the end of June 2025 to confirm the outcome of your application. If you are awarded this scholarship, it will be deducted from the tuition fees charged to you as a student at the University of Nottingham. We will not pay tuition fee scholarships to you directly. To maximise the reach of the university's scholarships offering, our international scholarships cannot be combined with other competitive university scholarships. Where you are awarded multiple scholarships, the single highest-value award will be applied. International scholarships are available to self-funded students only. If you are sponsored by an external funding body, e.g. government, business, employer, trust or charity, you are not eligible to apply. Check our frequently asked questions, scholarship application guidance notes and scholarship terms and conditions for further information. Offered by International Student Recruitment"
        }
    ],
    "pdf_files": []
}