{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/research/art-history-mres",
    "content": [
        {
            "p": "The MRes is a substantial piece of original work and can be ideal if: It can also be an advantage when applying for PhD funding as it demonstrates existing interest and research skills. This is a companion to the Visual Culture MRes. The requirements and supervision arrangements are the same but the title of your final degree is different. As well as researching and writing your dissertation you will take a taught module that develops your research and interdisciplinary skills. The balance of work is: You will research and write a 35,000 word dissertation. You'll agree the subject with your supervisor who will provide full support and regular reviews. Students must choose one from: This module helps postgraduate students recognise the range of careers and opportunities that an Arts and Humanities MA/MRes can provide. It highlights the skills and abilities present within these programmes and provides examples of the successful application of these skills. Students will explore how subjects within the arts can be ‘applied disciplines’ that serve to be impactful in wider society through research and engagement. Through ‘live brief’ assessments, students work in groups, utilising their Arts and Humanities skill sets, to present and produce a consultancy report for a range of organisations, including SMEs/Third-sector. The module examines key issues and contemporary debates in the study of media. It explores the implications of \"de-Westernising\" understandings of media communication, both in theory and in practice. It problematizes the nation state as the ethical and political horizon of media practices. There are four areas of enquiry: • Histories of the Present: Media in an International Context • Political-Economic Strategies and Communication Power • Emergence of New Actors in Society and Culture • Ethics and Politics of Communication in a World without Borders Key fields of research addressed are: • Media sociology • Cultural studies • The political economy of media This module is worth 20 credits. This module introduces you to the wide range of interdisciplinary research happening in the Faculty of Arts. We invite you to ‘think outside the box’ in relation to your own research, while learning key research techniques and methods. The module aims to: You will build on your existing research skills gained from your university career to date. Furthermore, you will develop a more nuanced understanding of your own research practice, inspiring you to explore different approaches questions. In addition, you will develop an understanding of professional practice in areas such as: An introduction to some of the key research skills required to become a more effective researcher and successfully complete your MRes. You'll also develop a range of transferable professional skills - from writing and presentation to public engagement and project management. You will also engage with key methdological concepts and debates within the arts and humaniities. This module runs for one semester and is worth 20 credits. Explore the role of technology in: The module draws together research in media and communication theory, history and philosophy of technology, geography and the sociology of communication, material cultures. You'll consider debates about: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. 2:1 (or international equivalent) in art history or a related subject. We encourage you to get in touch with a member of academic staff about your research proposal before submitting an application. They will be able to help you with your proposal and offer support to find funding opportunities in your area. If you're not sure how your research might fit into our existing programme contact our postgraduate admissions tutor Dr Mark Rawlinson who'll be happy to discuss. Most students start the course in September but February starts are also possible. Our step-by-step guide contains everything you need to know about applying for postgraduate research. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA). These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. Optional field trips may require you to pay for your own travel and entrance fees. There are additional funding opportunities available to you as a Faculty of Arts student. There are many ways to fund your research degree, from scholarships to government loans. Check our guide to find out more about funding your postgraduate degree. These regular seminars allow you to broaden your knowledge of the subject and gain a better sense of how research develops as part of an interactive process. In particular you can: See recent seminars organised by the Centre for Research in Visual Culture. Visit the Digital Transformations Hub website Get involved in our student-led curatorial group and gain valuable practical experience in leadership, design, curatorship, marketing and promotion, networking and project management. You can make full use of the Language Centre facilities for both research-specific learning and personal interest. The Researcher Academy is the network for researchers, and staff who support them. We work together to promote a healthy research culture, to cultivate researcher excellence, and develop creative partnerships that enable researchers to flourish. Postgraduate researchers at Nottingham have access to our online Members’ area, which includes a wealth of resources, access to training courses and award-winning postgraduate placements. Our graduate centres are dedicated community spaces on campus for postgraduates. Each space has areas for: You will have access to a range of support services, including: Our Students' Union represents all students. You can join the Postgraduate Students’ Network or contact the dedicated Postgraduate Officer. There are also a range of support networks, including groups for: SU Advice provides free, independent and confidential advice on issues such as accommodation, financial and academic difficulties. The Centre is involved with all aspects of contemporary art and visual culture. Its activities reflect the research interests of staff and students in the department. Students attend regular seminars and symposia hosted by CRVC. Our latest seminar series \"Re-writing history? Monuments, iconoclasm, and social justice movements in 2020\" provided a snapshot of the long history of monuments, protest and oppression and explored the historical significance of this moment. Visit the Centre's website Whether you are considering a career in academia, industry or haven't yet decided, we’re here to support you every step of the way. Expert staff will work with you to explore PhD career options and apply for vacancies, develop your interview skills and meet employers. You can book a one-to-one appointment, take an online course or attend a workshop. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. The University of Nottingham is ranked 7th in the UK for research power, according to analysis by Times Higher Education. The Research Excellence Framework (REF) is a national assessment of the quality of research in UK higher education institutions. *According to analysis by Times Higher Education ** According to our own analysis. This content was last updated on 08 November 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}