{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/additive-manufacturing-and-3d-printing-msc",
    "content": [
        {
            "p": "Whether it is creating advanced engineering components, new kinds of prosthetic limbs, or complex pharmaceutical devices, Additive Manufacturing gives an engineer the ability to build structures with unprecedented degrees of complexity. This leads to new product generations that are completely unlike what has ever existed before. The digital and tool-less nature of additive manufacturing offers a range of new possibilities that are very exciting to today’s engineers. This MSc programme will give you in-depth knowledge and understanding of Additive Manufacturing and 3D printing technology. You will gain the skills needed to: You will have access to the Additive Manufacturing laboratory within the Centre for Additive Manufacturing and will be taught by world-leading researchers using an impressive range of Additive Manufacturing machines and other technologies. Our research and teaching takes place in the new purpose built Advanced Manufacturing Building on Jubilee Campus. UK university QS World Rankings and the THE World University Rankings, 2022 for Mechanical Engineering The Times and The Sunday Times Good University Guide, 2021 This is a two week intensive module. This module examines both the basic implementation and theory of additive manufacturing, its translation into modern additive manufacturing techniques that are currently being researched and exploited within both academia and industry which result in net shape parts. The content of the module is as follows: The module will be mainly delivered in an intensive week(s) of lectures and laboratory classes. The module aims to provide the opportunity to work in small, multidisciplinary teams to address a grand challenge in the area of additive manufacturing. Although some variation in content is expected due to the varying nature of the possible challenges, it is expected that a common project will take the following form: In many cases the project will take the form of a design and make project in which the stages of the project will include the evaluation of alternative design concepts, engineering analysis, prototyping, performance evaluation and improvement. This is a module which requires personal engagement in the classes and there is no examination. In this way the module is like the Individual Project. The module has four cycles, each comprising students individually preparing a talk, and report, on a topic within a theme and with a title that has been negotiated with the Teachers straight after the Teachers have delivered an introductory lecture on that theme. The point of this module is to improve oral presentation and engineering report-writing skills using advanced materials as a vehicle. The classes are seminars, where good practice is openly discussed and materials' advantages and disadvantages are openly debated. This module is designed to deal with a wide range of materials (including advanced metallic, ceramic, glass, composite and polymeric-based materials) for a wide range of applications. Also it considers materials' themes, such as aerospace materials, medical materials, coatings, carbon-based materials, and so on. The module deals with: The module will be based on a number of topics of interest in research in additive manufacturing, which may change over time as the module is refreshed to reflect the current state of the art. Example topics to be included in the module programme include materials development for AM, in-situ and post process characterisation of materials and structures and computational methods for the modelling, design and optimisation of AM processes and parts. A project-oriented module involving a review of publications and views on a topic allied to the chosen specialist subject. The module will also involve organisation and design of the main project. Skills will be acquired through workshops and seminars that will include: Students will select a further set of specialist seminars from, e.g.: The specialist seminars will be organised within the individual MSc courses. Delivery Assessment method This is a one-week intensive module. The course provides cutting-edge lectures on a range of metrology topics for dimensional measurement of additive structures. Topics include introductory and advanced metrology lectures, and hands-on training in the use of measuring instruments. The lectures are designed to give a feel for the subject and why it is important, but do not cover difficult mathematical detail. The lectures will cover the following topics: Basics of measurement, terminology, SI units, uncertainty analysis, tolerance principles, length measurement, form measurement, coordinate measurement, x-ray computed tomography and surface texture measurement. The module will be mainly delivered in an intensive week of lectures and laboratory classes. This course includes a 60 credit research project, which is completed over the summer. The project area is flexible and will be supervised by a member of the Centre for Additive Manufacturing. Previous research projects have included: This module will initially look at new technology development and introduction focusing on innovation, funding and decision-making processes. The rest of the module will cover an engineering topic dealing with new and/or rapidly developing technologies with important applications. Coverage of each subject will typically include: Topics are selected each year to reflect current developments and issues; one or more topics may be changed each time the module is run. These topics will be associated with activities in major segments of manufacturing or service industries or of generic technologies. In each case, emphasis will be placed on review and analysis. This module focuses on understanding and manipulating of material's microstructure to avoid failure. It addresses the main areas of mechanical failure using specific material system examples to illustrate how materials design is used to develop better materials for particular applications. The four areas are: The range of assessment methods provides you with the opportunity to develop and demonstrate transferable skills relevant to a wide range of engineering disciplines. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Our step-by-step guide covers everything you need to know about applying. University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. Most schools and departments are based here. You will have access to libraries, shops, cafes, the Students’ Union, sports village and a health centre. You can walk or cycle around campus. Free hopper buses connect you to our other campuses. Nottingham city centre is 15 minutes away by public bus or tram. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, there are no additional costs for your budget, apart from your tuition fees and living expenses. Lab and safety equipment are included in your tuition fee. You should be able to access all of the books you will need through our libraries and it is not usual for students to buy their own copies. The Department also funds any field trips. Please note that these figures are approximate and subject to change. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Tuesday 16 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}