{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/advanced-civil-engineering-msc",
    "content": [
        {
            "p": "Who is this course for? Study for a varied, creative career that can take you around the world. If you want to make a difference to the world and to the quality of people's lives, this is the course for you. Civil engineers shape the world we live in. They design, build, and maintain the infrastructure we take for granted and their expertise is essential for a sustainable future, both in the UK and globally. What knowledge will I gain? You’ll develop group work skills working on projects as part of a team. Transferable skills for real life and your future career, and valuable experience of how to manage and delegate responsibilities. Choose from a diverse range of modules, including bridge engineering, railway technology, traffic engineering, coastal engineering, dynamics and wind engineering. Why should I choose University of Nottingham? 95% of postgraduates from our Department of Civil Engineering are in high skilled work, further higher education or professional study within 15 months of graduation (HESA Graduate Outcomes Survey 2019-20). This degree is accredited as meeting the requirements for Further Learning for a Chartered Engineer for candidates who have already acquired a partial CEng accredited undergraduate degree. Joint Board of Moderators This degree is also accredited by the Permanent Way Institution (PWI). The PWI: Permanent Way Institution joins Joint Board of Moderators in the UK for research power REF 2021 This is the major project element for all MSc plans in the Department of Civil Engineering. It will normally take the form of an in-depth investigation, whether it involves experimentation or an extensive review of work already completed by others. Typically, but not exclusively, it will include the following: The detailed technical content of the module will depend on the specific area under examination. Assessment is based on submission of a report (typically 10,000 to 20,000 words) which covers the above elements. The project area is flexible and will be supervised by an academic member of staff. Previous research projects have included: This module introduces important aspects affecting the professional practice of Civil Engineering including sustainability, environmental impact, quality management, continuous improvement and management principles. It will also develop knowledge and skills that will be used in the summer project, including writing a literature review and how to critically review your own and others’ writing. This is a compulsory course for all students studying an MSc in the Department of Civil Engineering. The course provides an introduction into important aspects affecting the professional practice of Civil Engineering and facilitates the development of knowledge and skills that will be used in the summer project, including literature review and writing skills, and developing a proposal for the activities to be conducted in the summer. The module will incorporate a mixture of learning environments/resources, including one-on-one tuition with personal tutors to formulate ideas and plans related to the summer project, classroom activities focused on resources relating to writing a literature review and how to critically review others’ as well as one’s own writing, and three 2-week workshops which provide knowledge in aspects that are important within the context of the professional practice of Civil Engineering. Our MSc Civil Engineering course is studied over 12 months. Sixty credits of modules are studied in each of the Autumn and Spring Semesters. Any digression from this (for example 50:70 credit split) can only be with agreement of the course director. A research project is undertaken in the summer period. The compulsory Research Methods and Project Proposal module taken on this course is designed to give a strong foundation in the skills and methodology necessary to successfully complete your research project over the summer period. In addition, you will be able to choose from a number of optional modules to create a more generalised path of study for the award of MSc Civil Engineering or to augment your degree with a specific theme. Over the summer period, you will be required to complete a 60-credit dissertation/research project. The research project is a chance to carry out a major piece of independent research under the supervision of a suitable member of academic staff. A range of assessment methods are adopted, with a pass mark of 50%. To attain the accredited MSc degree, students must pass 100 credits of their taught modules (comprising 120 credits) and have a weighted average of at least 50%. The Research Methods and Project Proposal module and the Civil Engineering Research Project module must be passed to attain the MSc degree. Teaching on this course takes place throughout the week during term-time, with a 10-credit taught module usually having 3 hours of lecture time per week (6 hours for a 20-credit module). Self-guided learning is an expectation on the course, with an expectation that students nominally dedicate approximately 10 hours of work per credit over the course of the term. Each student will work closely with a member of academic staff who will provide general guidance and support as well as specific instruction related to the student's chosen area for the summer research project. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Our step-by-step guide covers everything you need to know about applying. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you should factor some additional costs into your budget, alongside your tuition fees and living expenses. You should be able to access most of the books you’ll need through our libraries, though you may wish to purchase your own copies or more specific titles. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Wednesday 02 October 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}