{
    "url": "https://www.nottingham.ac.uk/pgstudy/funding/midlands4cities-collaborative-doctoral-award",
    "content": [
        {
            "p": "Apply by 13 January 2025 for our project 'Conferencing British Geography: Disciplinary History told through Annual Conferences (1949-2029) and their Archives'. This research project will provide a new history of post-WWII British geography, constructed through studying the lived experience and academic atmosphere of the annual conferences of the Institute of British Geographers (IBG). You will have unrivalled access to the Institute's archives and will also be embedded in the team which organises the annual conferences today. The project will focus on how geography conferences were and are planned and experienced, providing a new perspective on the discipline of Geography in Britain. It will emphasise conference organisers and hosts as well as the debates which took place and the concepts or discoveries which emerged. While the history of the Royal Geographical Society (RGS, founded in 1830 and merged with the IBG in 1995) has been well studied, with an emphasis on exploration, the role of the IBG (founded in 1933) as the preeminent professional body representing geography's academic community has barely been studied at all. The IBG's most significant influence was its role in organising its annual academic conference held around the UK and the focus of this study. Using the academic conference as a lens – 57 of the 75 conferences to date took place outside of London – this project will provide a more regional geography of British Geography, while also attending to the institute's international influence. The project will draw from recent scholarship which has reconsidered conferencing as a distinct political and intellectual practice. This work combines analysing both the content of the discussions (key debates, controversies and actors), the para-conference (socialising, fieldtrips) and the broader infrastructure of hosting (accommodation, venues, travel). Part ethnography of academic event organisation today, part historical reconstruction of past conferences, this doctoral project will pioneer a new methodology for disciplinary and institutional history. The project will begin with the IBG's mostly unused archive, held by the RGS-IBG. The student will help catalogue these papers, which are only broadly indexed at present, and will help digitise conference programmes where found. An overview of all conferences to date will be conducted before selecting three to study in depth (one of which was held in the Midlands). Archival research will also be conducted in the institutional collections of other geography associations and in the university archives of conference hosts. You will also conduct oral history interviews with past conference organisers and participants. Throughout the four years of study, you will also be embedded in the conference organising team, initially acting as an observer before helping to organise a future RGS-IBG annual conference. This research opportunity will provide a unique insight into the practice and procedures of conferencing organising to inform their understanding of the historical meetings under study. A fourth conference case study will emerge from this work. Stephen Legg and Jake Hodder have extensive experience of studying conferencing including through the development of innovative methodologies, while Legg was the Chair of the 2024 RGS-IBG conference. Catherine Souch is involved in the running of RGS-IBG conferences and has extensive contacts throughout the geography research and higher education community. This supervisory team is uniquely positioned to foster a dialogue between the past and present of British geography conferences, and of British geography more broadly. By bridging the local context of conference venues with the international diversity of the delegates and invited speakers, this project will enhance the RGS-IBG’s sense of institutional identity (currently tilted towards the RGS) while also providing a richer history of British Geography as a whole. You will spend the first year at the University of Nottingham gaining the necessary research skills, followed by a second year based at the RGS-IBG in London. The final two years will be based in Nottingham, with additional trips to archives as needed. In the first three years, the student will also contribute to conference preparation, including on-site running of the RGS-IBG annual conference in late-August. The applicant would ideally have an undergraduate degree, and have finished, or be working towards, a master's degree, in geography, but students with an interest in disciplinary histories from other fields are also encouraged to apply. Applicants should be interested in the conditions that shape knowledge formation, including institutional, social and geographical factors. They should be willing to engage in archival research, oral history, and institutional ethnography. Prior experience with any of these methods would be beneficial, but training will also be provided. Applications should be made via the Midlands4Cities portal, which opens on Monday 14 October 2024. Deadline: Monday 13 January at 12:00 noon (UK time). Offered by School of Geography"
        }
    ],
    "pdf_files": []
}