{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/animal-nutrition-msc",
    "content": [
        {
            "p": "You'll study farm, companion and zoo animal nutrition and the international animal feed industry. You'll learn about the latest developments in animal nutrition and consider the ethical implications associated with these trends. The programme covers the principles of nutrition including the role of diet relating to disease, feeding systems and operational management. You will cover nutrition from the molecular level through to whole animal production systems. This includes: Site visits, case studies and guest lectures will build your industry knowledge. This helps you to apply science to real-life industry problems. You'll also use the University Farm and Dairy Centre during the course. There is a dedicated module on research techniques. This covers writing and presentation skills, and scientific communications. covering livestock, companion and zoo animals you'll learn about the latest industry developments and real-life case studies you'll be taught by an academic team who are internationally recognised in this field The MSc programme requires 180 credits, while the PGDip requires 120 credits. The full time one-year masters course consists of two semesters of taught modules (120 credits), followed by a research project (60 credits) of three months on a full-time basis during the summer period. Part-time students should be prepared to undertake their research project in the summer of the second year, working on a full-time basis. On the masters degree you will complete a research project led by a subject specialist. This will give you an in-depth understanding of a specific area of animal nutrition and the scientific research process. This module aims to provide a comprehensive introduction to the key concepts in the field of nutrition, including requirements for macronutrients (e.g. proteins, carbohydrates and fats) and micronutrients (e.g. vitamins and minerals). You will carry out a primary research project in an area related to animal nutrition, supervised by a specialist. This module considers: This course is offered full-time and part-time. There is a significant proportion of independent learning and small group study. You will be guided through the process of identifying a research project to suit your career aspirations. Modules are assessed using a variety of individual assessment types which are weighted to calculate your final mark for each module. You will need an average mark of 50% to pass the MSc overall. You will be given a copy of our marking criteria when you start the course and will receive regular feedback from your tutors. Coursework includes diet formulation exercises, case-study assignments, reports, essays and reviews. As a guide, in the autumn and spring semesters you will typically spend around 25 hours per week in classes. You will be expected to spend a further 12 hours per week on self-guided study. You will work on your research project between June and September. You would be supervised for 3 hours per week, on average. Teaching is provided by teaching fellows, assistant professors, associate professors and professors. Technical staff, PhD students and post-doctoral researchers provide additional support in small group and practical classes. Typically you would study with around 20 other students. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Our step-by-step guide covers everything you need to know about applying. Our dairy centre delivers world leading research in livestock health and production. It has the facilities for nutritional studies with up to 100 individually-fed high-yielding dairy cows. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you should factor some additional costs into your budget, alongside your tuition fees and living expenses. You should be able to access most of the books you’ll need through our libraries, though you may wish to purchase your own copies. If you do these would cost around £40. Due to our commitment to sustainability, we don’t print lecture notes but these are available digitally. You will be given £5 worth of printer credits a year. You are welcome to buy more credits if you need them. It costs 4p to print one black and white page. Personal laptops are not compulsory as we have computer labs that are open 24 hours a day but you may want to consider one if you wish to work at home. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Thursday 06 June 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}