{
    "url": "https://www.nottingham.edu.my/pgstudy/course/research/applied-psychology-mphil-phd",
    "content": [
        {
            "p": "UNM/JPT-R/310/7/0013(7/26)MQA/SWA0182 UNM/JPT-R/310/8/0014(7/28)MQA/SWA0181 We offer high-quality doctoral training to postgraduate students who wish to pursue an MPhil, MRes or PhD. As a research student, you will work under a supervisor who will assist you in your research and thesis design. If you are interested in applying to do an MPhil or PhD with the Division of Organisational and Applied Psychology, we would recommend that you contact us and discuss your research project proposal with the relevant supervisor in the first instance. You can then visit our applications pages to find out how to apply. Our current areas of research include: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A masters degree (or international equivalent) in a relevant discipline related to applied psychology plus, an upper second class honours degree (or international equivalent) in a relevant discipline. A masters degree either in psychology or with an element of psychology is highly advantageous. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. MPhil An upper second class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Our PhD or MPhil graduates generally pursue careers in academia or research, working for government departments, international research organisations, and universities or as experts and consultants in their field of expertise. This content was last updated on 15 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}