{
    "url": "https://www.nottingham.edu.my/pgstudy/course/research/engineering-mphil-phd",
    "content": [
        {
            "p": "UNM/JPT-R/520/7/0085(7/26)MQA/SWA0818 UNM/JPT-R/520/8/0086(7/28)MQA/SWA0824 By undertaking postgraduate level study, you will work towards the enhancement of a variety of skill sets including: An MPhil is also a research degree which requires the submission of a dissertation. An MPhil thesis is expected to display a good general knowledge of the field of study, a comprehensive knowledge of some part or aspect of the field of study and a recognisable original contribution to knowledge or understanding. An MPhil degree does not usually involve an oral examination. A full-time MPhil degree is normally completed in two years. The essence of a PhD is research, in which knowledge is extended by exploration, investigation, and contemplation. In scientific and engineering disciplines, research often implies experimentation, but research is more than mere experiments: it means interpretation and deep understanding. To be awarded a PhD, you must find new abstractions, approaches, algorithms, principles, or mechanisms. Your work must also be of a high quality equivalent to peers in your field. To complete a PhD, you will present the results of your research in a formal document called a thesis or dissertation which should contain a substantial original contribution to knowledge or understanding. You will have to defend your work in an oral examination, known as a viva voce. A full-time PhD is typically completed in three years. As well as being taught by researchers at the leading edge of their field, you will also develop the essential skills necessary to embark on a fulfilling career as an engineer. We continually expand our programmes both in response to changes in society and to integrate the very latest research findings. Engineering is one of the strongest faculties at the University of Nottingham, with all engineering departments recognised as being among the best in higher education. If you are interested in applying to do an MPhil or PhD in the Faculty of Engineering we would recommend that you contact us and discuss your research project proposal with the relevant supervisor in the first instance. You can then visit our applications pages to find out how to apply. The Faculty of Engineering offers the opportunity to study for full-time and part-time MPhil and PhD degrees across each of our departments: Our five main research divisions are: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A master’s degree (or international equivalent) with an average mark of 60% and above plus, an upper second class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. Or A first class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. MPhil An upper second class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. The University’s Careers Advisory Services (CAS) support students with the necessary skills and career opportunities using its strong relationship with various employers and industries. The CAS will provide students with essential resources and guidance for career choices, offering many opportunities to develop the skills needed to plan and manage your future. Our Careers Advisory Service will work with you to improve and maximise your employability skills, as well as providing essential resources and guidance that will assist you with job/course applications. They will facilitate searches for appropriate work experience placements and connect you to a wide range of prospective employers and training opportunities. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}