{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/forensic-and-criminological-psychology-msc",
    "content": [
        {
            "p": "The MSc aims to advance students’ knowledge and skills acquired at undergraduate level, providing an in-depth knowledge of the discipline of forensic psychology. It covers academic research and theory and applied practice within the Criminal Justice and Forensic Mental Health Systems. The course receives unique input from currently practising forensic psychologists and other applied professionals, enabling students to develop a critical awareness of current issues, standards and developments in the field. The course is offered by the Centre for Forensic and Family Psychology (CFFP) under the Academic Unit of Mental Health and Neurosciences, School of Medicine. The MSc programme adheres to a taught degree structure, and as such, students are registered as a Postgraduate Taught Student (PGT); applying the policies, procedures, and regulations for Postgraduate Taught Programmes at the University of Nottingham. You can choose to complete this programme in one year through full-time study or two years through part-time study. The course is accredited by the British Psychological Society (BPS) and fulfils stage 1 of the BPS professional training in forensic psychology. The BPS is the learned and professional body, incorporated by Royal Charter, for psychology in the United Kingdom. The key objective of the Society is ‘to promote the advancement and diffusion of the knowledge of psychology pure and applied and especially to promote the efficiency and usefulness of members by setting up a high standard of professional education and knowledge’. A proportion of students who complete Stage 1, may later go on to complete Stage 2 training. Stage 2 training forms the basis for registration as a Forensic Psychologist with the Health Care Professions Council (HCPC), and is offered through other courses at the Centre for Forensic and Family Psychology. For this reason, the MSc closely draws upon relevant frameworks and standards from both the BPS and HCPC. Complete stage 1 of the professional accreditation route to becoming a qualified forensic psychologist Ethics, professional practice and research are all emphasised to provide a firm grounding for further professional training and practice We have been training future forensic psychologists at the University of Nottingham since 2010 MSc students will attend the University during which they study five core forensic psychology modules, attend research methods and statistics training, and complete a research project/dissertation. Part-time students will access the same modules and content, and are expected to attend the University for required teaching, dispersed across two years. The teaching week at the University for full time students runs from October to April and is as follows: From May to September, students complete their research project and outstanding coursework from home, and are required at the University only for research supervision/personal tutorials. Forensic work experience, should you wish to obtain any, can be organised on a Monday or Friday with permission. The module intends to build upon knowledge and skills gained at undergraduate level and provide a foundation of the current knowledge, theory and evidence base relevant to forensic psychology. The module aims to develop students’ knowledge of major psychological and criminological theories of crime, criminality and victimisation. Students will have the knowledge to enable them to progress to working with individuals across the lifespan (including children and young people in conflict with the law). This module aims to provide students with knowledge about the range of mental health conditions experienced by victims and offenders, including neurodevelopmental conditions and co-morbid conditions such as autism, alcohol and drug abuse, anxiety disorders. The module will develop students’ knowledge and critical understanding about approaches to assessment and formulation. This module aims to develop students’ critical understanding of psychological theories relating to justice systems, including police investigations and criminal and civil courts. It also aims to develop students’ knowledge of practice in the legal system. This module aims to provide students with comprehensive understanding of forensic settings as systems, and the issues involved in working in complex environments. The module will develop students’ thinking about issues affecting service-users and client groups with a systems perspective. Students will also understand the principles and procedures that forensic psychologists use when evaluating the practice of organisations and conducting consultancy. The module aims to provide students with working knowledge of the content and delivery of therapeutic programmes and approaches driven by information gathered by assessment and formulation. Students will demonstrate knowledge and critical understanding of a range of interventions available for offenders, patients and at risk individuals, victims/survivors, professionals, groups and organisations. This module considers a range of qualitative approaches suitable for psychologists. Students will be introduced to the theoretical and philosophical underpinnings and practical application of a number of qualitative research methods. This course aims to provide students with the knowledge and skills to effectively plan and design research as well as to critically appraise published research. Students will be introduced to: The course will also cover: This module aims to further develop the students understanding of research methods in a forensic psychology context, exploring more complex study designs and statistical methods. Analytical methods will be explored in depth with consideration of both quantitative, qualitative and mixed methods designs. This module will provide students with the opportunity to engage in, and learn from, supervised project work in forensic psychology. The emphasis is on applied research and associated methods in a forensic context. Through lectures, seminars and workshops, you’ll have the opportunity to develop theoretical and clinical skills. These skills will enhance your future employability and career progression. We focus on supporting you in becoming a scientist-practitioner in forensic settings. Each of the above modules assess students’ progress through diverse pieces of coursework measuring comprehension through both written and verbal communication. For the Forensic Psychology Research Dissertation, each student will submit an original, empirical research study on a topic pertaining to forensic psychology, towards the end of the academic year. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. You'll also need: Applications for this course do not open until 1 December 2023. You do not need to write a research proposal or select a supervisor as part of your application however you must include a personal statement of no more than one side of A4 paper. Application deadline is 30 June, applications received after this date will not be considered until the following academic year. Our step-by-step guide covers everything you need to know about applying. Jubilee Campus has eco-friendly buildings, alongside green spaces, wildlife and a lake. This campus is home to our business, education and computer science schools, as well as a sports centre and student accommodation. You can walk to University Park Campus in around 20 minutes or catch a free hopper bus. Nottingham city centre is 20 minutes away by public bus. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you should factor some additional costs into your budget, such as printing, alongside your tuition fees and living expenses. You should be able to access most of the books you’ll need through our libraries, though you may wish to purchase your own copies or access more specific titles. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Thursday 24 October 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}