{
    "url": "https://www.nottingham.ac.uk/pgstudy/how-to-apply/research.aspx",
    "content": [
        {
            "p": "There are a number of ways to begin the process of applying for a research opportunity, depending on which path you decide to take. Explore routes into research Academic requirements vary by programme – check our programme pages for details. Evidence of relevant personal, professional and educational experience may be taken into consideration – contact the academic school directly for further information. International and EU students can find guidance on alternative qualifications on our country-specific webpages. If English isn't your first language, you will also need to meet the relevant English language requirements. IELTS requirements are detailed on our course pages, though we also accept a variety of alternative qualifications. If you require additional support to develop your language skills, you may be able to attend a presessional course at the Centre for English Language Education. Most research programmes start early October. However, there are also start dates at the beginning of December, February, April and July. Check our programme pages or contact the academic school for details. Specific opportunities, including studentships and doctoral training programmes, usually have their own deadlines, so make sure you check if there is a closing date for the project(s) you are applying for. International students should apply as early as possible to ensure you have enough time to apply for your student visa and submit any documentation as advised by the admissions team. An offer of study is required for many funding opportunities. You should check deadlines for applications carefully, as these are often early in the year. Please apply early and allow time for any fee payments and your application to be processed. If you have a known deadline for funding (e.g. scholarship, sponsorship etc) and haven’t received a decision on your application by 2 weeks of the deadline, we encourage you to make us aware through our online enquiry form. Your application will usually include a 1,000 to 3,000-word research proposal. This will be judged on both content and format. However, this depends on the opportunity you are applying for – for example, if you are applying for a specific project such as a studentship, you may not need a proposal. Check the relevant course page for details. For advice on how to write a research proposal, see our how to guide. You can also contact the relevant academic school directly as they may be able to provide extra information. Applicants for the MRes Biomolecular Technology do not need to submit a research proposal: please simply enter “Not applicable” in the relevant box. Some Schools may require you to contact a potential supervisor before submitting your application. Please check the course page and if required, follow the links provided to find out more about the research areas and supervisors. You can apply directly through our online system. You will receive an automatic confirmation once you submit your application and can track its progress. Make sure that you upload scanned copies of your degree certificate and transcripts, as well as any other supporting documents, as we will not be able to assess your application without them. Please do not send us the original copies in the post. Depending on the course you are applying for, you may also need to provide two references, including at least one who can comment on your academic ability. These must be dated within two years of the date of your application and, if not received directly from your referee, signed and on letter-headed paper. There is an application fee of £50 for Master of Research (MRes) courses. Your MRes application will not be assessed until the application fee has been paid and processed. Please note, Nottingham University Business School does not offer Master of Research (MRes) courses as a starting point for PhDs. If you are applying for a PhD at Nottingham University Business School you should apply for either the PhD in Business and Management, Finance and Risk, Business and Society or Industrial Economics. Apply online You can log in at any time to track the progress of your application. When we have made a decision on your application, we will send you an email and let you know what you need to do next. Details on accepting your offer, accommodation and other helpful hints and tips can be found in our guidance for applicants. Track your application"
        }
    ],
    "pdf_files": []
}