{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/research/forensic-psychology-top-up-dforenpsy",
    "content": [
        {
            "p": "Our Stage 2 training programme is ideal for those who have already completed Stage 1 training (already holding a BPS accredited Masters in Criminological/Forensic/Investigative Psychology). Approved by the Health and Care Professions Council (HCPC) and accredited by the British Psychological Society (BPS). Meaning that upon graduation, you are eligible to apply for BPS Chartered Psychology status, HCPC registration as a Forensic Psychologist, and full member of the Division of Forensic Psychology. The course is run by the Centre for Forensic and Family Psychology (CFFP), located in the School of Medicine, in collaboration with the Institute of Mental Health. This top-up course will see you complete Stage 2 and the doctorate component of training to become a chartered and registered forensic psychologist. During this course, you’ll apply your knowledge to forensic psychology research and practice while on placement in forensic environments anywhere in the UK and Ireland. You'll also attend the University of Nottingham for two weeks of block teaching each year (usually October and January). On placement, you'll experience interventions with victims and offenders in the community and secure settings from various client groups. You can choose to complete this programme in two years through full-time study or four years through part-time study. During the doctorate component (stage 2), you'll develop skills and competency in four core areas: At the end of the course, you'll submit: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Undergraduate degree Postgraduate degree You'll also need: We only consider applications submitted between 1 December to 30 June. If you apply after 30 June, your application won’t be considered until the following academic year. You do not need to write a research proposal or select a supervisor as part of your application. You must include a personal statement of no more than one side of A4 paper. While a driving licence is not essential, your placement may be difficult to get to on public transport and students find that driving is an advantage. You do not need to already be working in forensic psychology to apply for this course. We have a range of national placement opportunities. However, those in employment may be able to use their employment as a placement during the supervised practice years. This is subject to being able to move to different Client Groups and Setting Types. Our step-by-step guide contains everything you need to know about applying for postgraduate research. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA). These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. As a student on this course, you should factor some additional costs into your budget, such as printing, alongside your tuition fees and living expenses. You should be able to access most of the books you’ll need through our libraries, though you may wish to purchase your own copies or access more specific titles. There are no set scholarships for this course. We have strong relationships with our placement providers, resulting in a variety of scholarships and bursaries, allowing us to increase the breadth and inclusivity of applicants that we can consider for our programmes. These are not guaranteed and are at the discretion of the placement provider. There are many ways to fund your research degree, from scholarships to government loans. Check our guide to find out more about funding your postgraduate degree. The Researcher Academy is the network for researchers, and staff who support them. We work together to promote a healthy research culture, to cultivate researcher excellence, and develop creative partnerships that enable researchers to flourish. Postgraduate researchers at Nottingham have access to our online Members’ area, which includes a wealth of resources, access to training courses and award-winning postgraduate placements. You will have access to a range of support services, including: Our Students' Union represents all students. You can join the Postgraduate Students’ Network or contact the dedicated Postgraduate Officer. There are also a range of support networks, including groups for: SU Advice provides free, independent and confidential advice on issues such as accommodation, financial and academic difficulties. Jubilee Campus has eco-friendly buildings, alongside green spaces, wildlife and a lake. This campus is home to our business, education and computer science schools, as well as a sports centre and student accommodation. You can walk to University Park Campus in around 20 minutes or catch a free hopper bus. Nottingham city centre is 20 minutes away by public bus. Whether you are considering a career in academia, industry or haven't yet decided, we’re here to support you every step of the way. Expert staff will work with you to explore PhD career options and apply for vacancies, develop your interview skills and meet employers. You can book a one-to-one appointment, take an online course or attend a workshop. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. The University of Nottingham is ranked 7th in the UK for research power, according to analysis by Times Higher Education. The Research Excellence Framework (REF) is a national assessment of the quality of research in UK higher education institutions. *According to analysis by Times Higher Education ** According to our own analysis. This content was last updated on 01 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}