{
    "url": "https://www.nottingham.edu.my/pgstudy/course/research/politics-history-development-and-international-relations-phd",
    "content": [
        {
            "p": "UNM/JPT-R/310/8/0014(7/28)MQA/SWA0181 We offer high-quality doctoral training to postgraduate students who wish to pursue a PhD. As a research student, you will work under a supervisor who will assist you in your research and thesis design. Principal supervisors will normally be members of the school but secondary supervisors may be drawn from other schools in the faculty, from staff in the School of Politics and International Relations in the UK or the Division of International Studies in Ningbo, China. We provide a dynamic learning environment that offers you the opportunity to challenge yourself, to question assumptions and to contribute to the way we understand, conceptualize and engage with global political phenomena. Only applicants with strong academic records and a proven aptitude for research will be considered. If you are interested in applying, we would recommend that you familiarise yourself with our research areas and staff expertise and then contact us to discuss your research project proposal with the school research director in the first instance – Dr Benjamin Barton. A final decision will only be made after a full application has been received. Visit our applications pages to find out how to apply. Research collaboration is promoted through The University of Nottingham’s Research Priority Groups. Principally with two groups, Integrating Global Society and Science, Technology and Society. Cooperation is also sought through staff and student membership of our sub-discipline, tri-campus research centres: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A good master’s degree (usually merit or higher) plus, at least a second class honours degree (or international equivalent) in the relevant discipline. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Or A first class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. The University’s Career Advisory Services (CAS) support students with the necessary skills and career opportunities using its strong relationship with various employers and industries. The CAS will provide students with essential resources and guidance for career choices offering many opportunities to develop the skills needed to plan and manage your future. Our Careers Advisory Service will work with you to improve and maximise your employability skills as well as providing essential resources and guidance that will assist you with job/course applications. They will facilitate searches for appropriate work experience placements and connect you to a wide range of prospective employers and training opportunities. This content was last updated on 15 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}