{
    "url": "https://www.nottingham.ac.uk/pgstudy/how-to-apply/taught.aspx",
    "content": [
        {
            "p": "Academic requirements vary by programme – check our course pages for details. Evidence of relevant personal, professional and educational experience may be taken into consideration. Generally an undergraduate degree will be required, but we may be able to consider experience-based qualifications on a case-by-case basis. Contact the academic school directly for further information. International and EU students can find guidance on alternative qualifications on our country-specific webpages. If English isn't your first language, you will also need to meet the relevant English language requirements. IELTS requirements are detailed on our course pages, though we also accept a variety of alternative qualifications. If you require additional support to develop your language skills, you may be able to attend a presessional course at the Centre for English Language Education. Teaching for most postgraduate taught courses starts late September, while some have alternative start dates. Check course pages for details. Although most postgraduate courses do not formally close for applications, places are limited and courses may become full. We will endeavour to make a decision on your application within six weeks. International applicants should apply as early as possible to ensure that you have enough time to apply for your student visa. If you are successful in receiving an offer, you will need to accept it and meet any outstanding conditions by early September, or as advised by the admissions team. An offer of study is required for many funding opportunities. You should check deadlines for applications carefully, as these are often early in the year. Please apply early and allow time for any fee payments and your application to be processed to avoid disappointment. If you have a known deadline for funding (e.g. scholarship, sponsorship etc), we encourage you to make us aware of it in your application. You can apply directly through our online system. You will receive an automatic confirmation once you submit your application and can track its progress. Make sure that you upload scanned copies of your degree certificate and transcripts, as well as any other supporting documents, as we will not be able to assess your application without them. Please do not send us the original copies in the post. Depending on the course you are applying for, you may also need to provide two references, including at least one who can comment on your academic ability. These must be dated within two years of the date of your application and, if not received directly from your referee, signed and on letter-headed paper. We may also require a personal statement. If you aren't sure what to include or need more help, please refer to our guidance. Applications for teacher training are made through DfE Apply and MA Social Work are made through UCAS. There is an application fee of £50 for postgraduate taught courses. Your application will not be assessed until the application fee has been paid and processed. For application deadlines and early course closures we require the application fee to be paid before the date stated on the course page. We do not consider your application as being fully submitted until your application payment has been made and processed. It can take up to 5 days for your application fee to be processed, so please allow time for this with any application or funding deadlines. Apply online You can log in at any time to track the progress of your application. When we have made a decision on your application, we will send you an email and let you know what you need to do next. We may also contact you asking you to provide further information to help us assess your application. Details on accepting your offer, accommodation and other helpful hints and tips can be found our guidance for applicants. Track your application International students who are planning to start a full-time postgraduate taught course will be required to pay a tuition fee deposit of at least £3,000 as part of the visa process. We will waive the tuition fee deposit requirement for students who are fully sponsored by a recognised sponsor. If you are fully sponsored for your course fees, you must email us a copy of your sponsorship letter, quoting your full name and application ID. The University will only accept sponsorship letters from recognised sponsors such as overseas governments, international businesses, universities, trusts and charities, and not from friends/family members. Admissions may, at their discretion, ask applicants to provide further information in order to assess their application fairly and accurately. This can include CVs, references (academic and professional) and clarifications regarding their previous and current education. In such cases you will be contacted by admissions with a more information request."
        }
    ],
    "pdf_files": []
}