{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/research/applied-linguistics-and-english-language-teaching-online",
    "content": [
        {
            "p": "Applied linguistics offers a fascinating opportunity to study the interaction between language and the real world. You will be supervised by our expert staff, who offer specialisms in areas including: You will be part of a diverse body of PhD students, working across all areas of the School of English (from English literature to medieval studies). We also host research in discourse analysis and sociolinguistics, with particular specialisms in health communication and professional communication, as well as language, gender and sexuality. A PhD in Applied Linguistics and English language teaching is mainly made up of independent study, with supervision meetings occurring online (e.g. via Microsoft Teams) and spread throughout the year. There are no taught credits attached to a PhD, although it is compulsory for full-time students to attend the Arts Faculty Researcher Skills training programme, which is available for online attendance. Part-time students Part-time students are required to take part in all required research training, attend postgraduate seminars where possible, and one postgraduate researcher (PGR) symposium over the period of their registration. Assessment You will complete a written thesis of up to 100,000 words, with expert support and advice from your academic supervisor(s). You will also take a verbal examination called a viva voce, where you explain your project in depth to an examination panel. What is the thesis pending period? All periods of registration are followed by a period of writing-up, called the thesis-pending period, when tuition fees are not paid and students are writing up their thesis. Find out more in the university's Quality Manual. Progression review All PhD students take part in progression review assessments to ensure that their project is progressing satisfactorily. A progression review consists usually consists of written reports from both the student and the supervisory team. All students have an independent assessment interview for their Stage 1 and Stage 2 reviews (end of years 1 and 2 for full-time students, years 2 and 4 for part-time students). All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. 2:1 (or international equivalent) and a masters degree at Merit level or above. Applicants without a masters degree who can demonstrate equivalent expertise should contact the School of English As well as IELTS (listed above), we also accept other English language qualifications. This includes TOEFL iBT, Pearson PTE, GCSE, IB and O level English. You will be required to provide a PhD proposal with your application, which will set out the structure of your project. The basis of a good proposal is usually a set of questions, approaches, and objectives which clearly outline your proposed project and what you want to accomplish. The proposal should also clearly demonstrate how you are going to accomplish this. A PhD proposal should be a minimum of 1000 words. There is no upward limit for proposals, although successful proposals are often not much longer than about 2000-3000 words. You should consider: In addition, the proposal should outline your reasons (academic and/or personal) for registering for online study rather than by full or part-time on-campus options. In particular, you should make clear how will be able to carry out your project in your chosen location. The proposal must include evidence of: It is also helpful to include: Find out more about how to write a research proposal. You may find it helpful to get in touch with a member of academic staff about your research proposal before submitting an application. They may be able to help you with your proposal and offer support to find funding opportunities in your area. Our step-by-step guide contains everything you need to know about applying for postgraduate research. How to apply. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA). These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). We also recommend students have a suitable laptop to work both on and off-campus. For more information, please check the equipment advice. Additional information for international students Additional costs All students will need at least one device to approve security access requests via Multi-Factor Authentication (MFA). Students must also have a suitable desktop/laptop to carry out their research. For more information, please check the equipment advice. Books You'll be able to access many of the books and journal papers you’ll need through our libraries, though you may wish to buy your own copies of core texts. Because some resources may not be available online, the University of Nottingham library offers postal loans for online learners and can scan up to one chapter or article from a book or journal on request. For details on postal loans, see the library website, and for scanning requests, use the dedicated request form. For students studying elsewhere in the UK, as a University of Nottingham student, you can also access many other university libraries across the country. The SCONUL Access scheme allows you access to the buildings and resources on offer at other UK campuses, so you can study closer to home. For more information on participating libraries and to sign up, check out their main webpage. Many academic libraries worldwide allow students to become library members. You may need to provide a letter confirming your student status: these can be ordered from the university's online store. There are funding opportunities which are only open to students within the Faculty of Arts. There are many ways to fund your research degree, from scholarships to government loans. Check our guide to find out more about funding your postgraduate degree. Regular supervision You will have a team of at least two supervisors. Full-time students will meet with their supervisory team at least 12 times each year (six times for part-time students). Your supervisors will help you to realise your research project and to guide you through your research. Many students will also attend conferences and publish papers in conjunction with their supervisors, to gain valuable experience and contacts in the academic community. Professional development Research students in the School of English may benefit from: Postgraduate seminars and conference attendance A seminar series is run by and for the postgraduate students in the school during term time, which will be hybrid and/or recorded for online students. The seminars provide a forum for students to share work in progress with staff and peers, to hear from invited speakers, and to explore key academic and career topics in a supportive atmosphere. The Researcher Academy is the network for researchers, and staff who support them. We work together to promote a healthy research culture, to cultivate researcher excellence, and develop creative partnerships that enable researchers to flourish. Postgraduate researchers at Nottingham have access to our online Members’ area, which includes a wealth of resources, access to training courses and award-winning postgraduate placements. Our graduate centres are dedicated community spaces on campus for postgraduates. Each space has areas for: You will have access to a range of support services, including: Our Students' Union represents all students. You can join the Postgraduate Students’ Network or contact the dedicated Postgraduate Officer. There are also a range of support networks, including groups for: SU Advice provides free, independent and confidential advice on issues such as accommodation, financial and academic difficulties. Whether you are considering a career in academia, industry or haven't yet decided, we’re here to support you every step of the way. Expert staff will work with you to explore PhD career options and apply for vacancies, develop your interview skills and meet employers. You can book a one-to-one appointment, take an online course or attend a workshop. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. The University of Nottingham is ranked 7th in the UK for research power, according to analysis by Times Higher Education. The Research Excellence Framework (REF) is a national assessment of the quality of research in UK higher education institutions. *According to analysis by Times Higher Education ** According to our own analysis. This content was last updated on 19 September 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}