{
    "url": "https://www.nottingham.edu.my/pgstudy/course/research/economics-phd",
    "content": [
        {
            "p": "UNM/JPT-R/310/8/0014(7/28)MQA/SWA0181 Our PhD Economics programme offers high-quality doctoral training in research skills along with providing knowledge in specialised fields. Current areas of research at the School of Economics include behavioural economics, development economics, experimental economics, international economics, microeconomics, and macroeconomics. Throughout the course our postgraduate students will gain a solid grounding in all areas of economics as well as learning the tools, techniques and literature necessary for writing a PhD dissertation. As a research student, you will have the guidance of a supervisor to assist you in your research and thesis design. By registering for your postgraduate research degree at the Malaysia Campus you will benefit from dual project supervision by academics based in Malaysia and the UK. This programme is part of a 1+2 split scheme where you will spend all, or a substantial part of your first year at the UK Campus to take advantage of the taught PhD-level modules offered. The rest of the programme will then be completed at the Malaysia Campus. If you are interested in applying, we would recommend that you familiarise yourself with our research areas and staff expertise and then contact us to discuss your research project proposal with the relevant supervisor in the first instance. You can then visit our applications pages to find out how to apply. Our current areas of research include: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A Master of Science in Economics with a merit grade (or international equivalent). Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. A PhD in Economics will give you invaluable skills and excellent career credentials. You could apply your economic skills and knowledge in roles such as researchers, academics, economists, and economic consultants. These roles often value many skills acquired and developed from a postgraduate qualification. In broader contexts, other options related to economics include, among others, financial risk analysts, investment analysts, and quantitative analysts. You could work in banks, hedge funds and investment banks that use models and analyses to assess financial risks. Besides, some management consultancies and larger financial firms also employ specific economic consultants for helping organisations to solve problems and improve business performance. This content was last updated on 15 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}