{
    "url": "https://www.nottingham.ac.uk/pgstudy/course/taught/statistical-science-distance-learning-msc",
    "content": [
        {
            "p": "The Statistical Science MSc is a part-time distance learning programme, offering you the flexibility to study your way. You will develop the advanced techniques and skills required to be a successful statistician in the 21st century. As the data we generate increases, so does the global demand for analysts who can apply modern statistical methods to make sense of it. The MSc ensures you will gain the skills to go from exploring a data set, to modelling and analysing the data, through to presenting your findings in a variety of ways. You will develop: Teaching is provided through course materials including lecture notes, digital recordings, training videos and practical computer sessions. You have the flexibility to look at these in your own time, meaning you can complete the masters around other commitments. We will support you throughout the degree with live online sessions using Microsoft Teams (or similar) which gives you the opportunity to ask any questions you have about the module content. You will study the core statistical concepts of inference and modelling. As you progress, you will cover advanced topics in machine learning, multivariate statistics and time series. These topics will develop your understanding of modern statistical techniques, leading to a dissertation which lets you demonstrate the skills you have gained and develop your ability to study independently. You will be supported by expert lecturers and leading statistical experts and researchers throughout the MSc. If you are already working in a statistics-related role, this MSc will enhance your existing knowledge and skills. You will formalise and consolidate your learning and practical skills through carefully chosen modules. All of the modules are available as standalone units to enhance your career development. Some examples include: This is highlighted in our commitment to attracting bright minds and inspiring academics to conduct mathematical research throughout the department. flexibility to study around your current work or lifestyle experts in infectious disease modelling, data-driven modelling and Bayesian computation from a prestigious UK Russell Group university Year 1 You will study four modules (80 credits) Year 2 You will study two modules (40 credits) and then a dissertation worth 60 credits. You will be allocated a personal tutor. This is someone who works closely to support you throughout the programme. Each module is taught by a module lecturer; an expert academic member of staff who will provide support throughout the module. Dissertation support and one-to-one sessions with your supervisor will be provided. Throughout the MSc there are opportunities to chat with fellow students and study together online as you progress through the course. You can share your ideas and support each other in any topics in which you may be struggling. In this course the fundamental principles and techniques underlying modern statistical and data analysis will be introduced. The course will cover the core foundations of statistical theory consisting of: The course highlights the importance of computers, and in particular, statistical packages, in performing modern statistical analysis. You will be introduced to the statistical package R as a statistical and programming tool and will gain hands-on experience in interpreting and communicating its output. This module is concerned with frequentist (classical/frequentist) statistical inference, both its theory and its applications and builds on the fundamental ideas of statistics introduced in the module “Foundations of Statistics”. The following topics are explored and the Delta Method is also presented: There is emphasis on the exponential family of distributions, which includes many standard distributions such as the normal, Poisson, binomial and gamma. You will also explore how computers can be utilised to perform statistical inference for non-standard (i.e. analytically intractable) problems by applying innovative statistical and numerical methods. Optimisation methods, the bootstrap algorithm and simulation techniques including Monte Carlo methods will be introduced in relation to problems of statistical inference. You will gain experience of linking the underlying statistical concepts to practical applications of the methodology. You will gain experience of using statistical software and interpreting its output. This module develops the theory of the generalised linear model and its practical implementation. It builds upon and extends the linear model introduced in the Foundations of Statistics module. The teaching extends the understanding and application of statistical methodology to the analysis of discrete (count and binary) data and survival models, which frequently occur in diverse applications. You will gain experience of using statistical software to perform exploratory data analysis and to apply generalised linear model methodology to a wide range of applications. You will develop key statistical skills in interpreting and communicating their statistical analysis. This module is concerned with the second main theory of statistical inference, Bayesian inference. It complements the frequentist statistical approach introduced in Statistical Inference. This module will provide a full description of Bayesian analysis and cover popular models, such as the normal distribution and inference for categorical data. Topics include: Well known classical procedures, such as point estimation and confidence intervals, will be compared with their Bayesian counterparts. You will also explore how computers allow the easy implementation of standard, but computationally intensive, statistical methods such as Markov chain Monte Carlo methods, to obtain samples from a posterior distribution. You will gain experience of linking the underlying statistical concepts to practical applications of the methodology and benefit from hands-on experience of using statistical software and interpreting its output. There is an exit point at the end of the taught modules in year one. If you leave after successfully completing 60 credits in year one, you will gain a Postgraduate Certificate qualification (PGCert). You will be taught through modules specifically designed for distance learning. These will be supported with interactive learning materials including: You will be able to access these learning resources through our online teaching platform. This is available on demand so you can study at a time that suits you. Each module will be led by an academic member of staff who will provide the learning resources and lead the teaching sessions. You will be supported in your independent learning by online tutorials with the lecturer and other students. Exams will take place at the university, or an approved test centre. Examinations will be scheduled to minimise travelling for students. You will be awarded the Master of Science Degree provided you have successfully completed the taught stage by achieving a weighted average mark of at least 50% with no more than 40 credits below 50% and no more than 20 credits below 40%. You must achieve a mark of at least 50% in the dissertation. The course is designed to allow flexibility to study when is convenient for you. Each module will have a small number of timetabled meeting sessions. This enables you to meet virtually with the lecturer and other students on the masters. Each module will have allocated time slots and forums to allow you to speak directly with the lecturer too. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2025 entry. Some prior knowledge of statistics would be helpful but not essential to start the course. Familiarity with the basics of calculus (differentiation and integration) and linear algebra (matrices and vectors) is assumed. Our step-by-step guide covers everything you need to know about applying. Distance learning is designed to be flexible, so you can choose where and when you study. This allows you to fit your course around work or other commitments and study at your own pace. Our online teaching is an interactive learning experience. You will receive support from your dedicated tutor, who will guide you through your studies and answer any questions. If you are a student from the EU, EEA or Switzerland, you may be asked to complete a fee status questionnaire and your answers will be assessed using guidance issued by the UK Council for International Student Affairs (UKCISA) . These fees are for full-time study. If you are studying part-time, you will be charged a proportion of this fee each year (subject to inflation). Non-essential (materials complete) but might be helpful. A wide range of statistics books can be accessed electronically through the library. A computer is essential to access the learning materials, use statistical software and prepare reports for assignments. A laptop is preferable. Travel will be required to attend the University of Nottingham or an approved test centre for examinations. There will be additional assessment costs if examinations are taken at a venue other than a University of Nottingham campus. The costs will be venue specific. There are many ways to fund your postgraduate course, from scholarships to government loans. We also offer a range of international masters scholarships for high-achieving international scholars who can put their Nottingham degree to great use in their careers. Check our guide to find out more about funding your postgraduate degree. We offer individual careers support for all postgraduate students. Expert staff can help you research career options and job vacancies, build your CV or résumé, develop your interview skills and meet employers. Each year 1,100 employers advertise graduate jobs and internships through our online vacancy service. We host regular careers fairs, including specialist fairs for different sectors. International students who complete an eligible degree programme in the UK on a student visa can apply to stay and work in the UK after their course under the Graduate immigration route. Eligible courses at the University of Nottingham include bachelors, masters and research degrees, and PGCE courses. This content was last updated on Friday 23 August 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur given the interval between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply. Student Recruitment Support Hub"
        }
    ],
    "pdf_files": []
}