{
    "url": "https://www.nottingham.edu.my/pgstudy/course/taught/mechanical-engineering-msc",
    "content": [
        {
            "p": "UNM/JPT-R3/0714/7/0009(9/29)MQA/SWA0142 Our courses in Mechanical Engineering are made up of lectures, laboratory sessions, workshops and design classes. They cover the core engineering science and design skills needed to give students a solid foundation in this subject. The Department of Mechanical, Materials and Manufacturing Engineering (M3) offers students a sound theoretical grounding in our labs and workshops. Students will conduct investigations to turn designs into reality through extensive hands-on learning using Computer Aided Design (CAD) software, Computer Aided Engineering (CAE) and design projects. Our Mechanical Engineering programme was the first established amongst foreign universities in Malaysia. Heavy investment has allowed course topics such as aerospace and automotive related modules to be developed. Our teaching facilities are well established and we provide diversified teaching expertise throughout the course. Students on this course are able to access our well-equipped workshop facilities allowing individual yet extensive hands-on practices and the mastering of machining skills (welding, milling, etc). Our programme is proudly awarded with a 6-year accreditation status presented by the Engineering Accreditation Council (EAC) Malaysia. This is the longest of any university in Malaysia. In addition, our programme is also accredited by the Malaysian Quality Agency (MQA), the Institution of Mechanical Engineers (IMechE) UK and the Institution of Engineering Designers (IED) UK. The MSc Mechanical Engineering consists of 70 credits of core modules and 50 credits of optional taught modules, along with a 60-credit summer individual project often linked with industrially sponsored research. Projects include experimental analyses, design oriented studies and the development of mathematical or computational models. The compulsory modules will teach you about the latest, cutting-edge developments in engineering from our world-leading research groups. You will also be able to choose from a number of optional modules which will allow you to focus your studies on your areas of interest. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. An upper second class honours degree (or international equivalent) in mechanical engineering or a related discipline. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. The course covers diversified areas of Mechanical Engineering upholding the profession of Mechanical Engineering as one of the most stable worldwide. Our graduates are employed in various industrial sectors including Aerospace, Automotive, Manufacturing, Power Generation, Bioengineering, Electrical and Electronic Systems, Renewable Energy, Nanotechnology, Oil and Gas Industries and Environmental Protection. Some graduates progress to postgraduate PhD levels both locally and overseas and are currently employed as postdoctoral researchers and academics in universities. Many of our graduates have developed themselves into managerial positions and/or achieved Professional/Chartered Engineer status. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}