{
    "url": "https://www.nottingham.edu.my/pgstudy/course/research/education-mphil-phd",
    "content": [
        {
            "p": "UNM/JPT-R/140/7/0011(7/26)MQA/SWA0815 UNM/JPT-R/140/8/0012(7/28)MQA/SWA0826 This course allows students to become both independent researchers and experts in their chosen specific area of Education. UNM offers high-quality doctoral training at the School of Education where applicants will have a strong background in research of their chosen discipline (see our areas of strength below). Students should be highly motivated and enthusiastic with an inquisitive mindset. International students are registered as full-time students (due to immigration requirements); however local students can choose between part-time and full-time. All doctoral candidates are based at the Malaysia campus. As a school, we are committed to improving and investigating transformative and effective practices in Education. You will study in a supportive, dynamic and inclusive environment with an international team from across the globe. Many of our colleagues are research active with ongoing national and international research grants. If you are interested in applying to do an MPhil or PhD in the School of Education we would recommend that you either Please include the following documents when contacting us: Your research proposal will help the School establish whether we have the expertise to support your proposed area of study. It will also be used in reviewing the overall quality of your application. While you will further develop your research proposal after joining the School, it is essential that you have an in-depth understanding of the issues associated with conducting research and the potential to design a research study to address a specific set of research questions. Proposals are reviewed both on content and format. Due to the high number of proposals that we receive, we review incoming during the application revision period that is defined as the first week of the following months: January, March, May, September and November. Please note that we do not have the capacity to provide feedback for incoming proposals at this stage of application. If your proposal meets the requirement of the School, you will be invited for an interview. Please note that only applicants successful at this stage will be formally invited to submit an application, which together with visa application may take weeks in certain situations. Malaysian applicants are recommended to submit your formal application at least three months before the intake that you intend to commence your study. International applicants are recommended to submit your formal application at least five months before the intake that you intend to commence your study. General guidelines for writing a research proposal for the application of MPhil or PhD with the School of Education. Please visit our applications page to find out how to submit a formal application. 1. Education for Sustainability and Inclusivity 2. Education for STREAM and Digitalisation 3. Education for Language Learning Sciences First year candidates will undertake a research methods module in order to gain a more in-depth background in designing and conducting quantitative, qualitative, and mixed-methods research. The first year (probationary year) is seen as a bridge between undergraduate, postgraduate, and professional experience and the required independent level of research. Candidates spend this year broadening their knowledge in the area of interest, refining their proposal, developing the methodology, securing ethical clearance, and collecting some initial data. At the end of the first year, this well-developed research proposal and the research skills gained are assessed in a mini-viva with an internal assessor. In the second year, candidates collect and analyse data, while continuously engaging with the literature and refining their chapters. The progress made this year is also assessed by an internal review, where the internal assessor determines whether requisite progress has been made in order to submit it at the end of the third year. The third year is primarily focused on preparing and writing up the thesis, which is defended in an oral examination (viva voce) by an external examiner who is an expert in the field. MPhil students must present a thesis of up to 60,000 words, embodying the results of their advanced study and research. The thesis must satisfy the examiners regarding knowledge of the general field of scholarship to which the subject belongs. An oral examination occurs at the discretion of the examiners. PhD students must present a thesis, a maximum of 100,000 words, demonstrating originality and innovation on the subject of their advanced study and research. The thesis must satisfy examiners regarding knowledge of the general field of scholarship to which the subject belongs. They must also present themselves for an oral examination on the subject of their thesis and its general field of scholarship. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A master’s degree, normally with a merit grade (or international equivalent) in a relevant discipline and some experience in research methodology, (e.g., postgraduate level dissertation or research project) plus, an upper second class honours degree. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Or A first class honours degree (or international equivalent) in a relevant discipline and some experience in research methodology, (e.g., dissertation or research project). Non-UK qualifications will be assessed against this standard. Direct admission with a first class honours degree is at the discretion of the School and is subject to the School’s evaluation of the applicant’s competencies level. MPhil An upper second class honours degree (or international equivalent) in a relevant discipline and normally some experience in research methodology, (e.g., undergraduate level dissertation or research project). Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Our graduates embark on successful careers within both education and academia. Many also branch out using their acquired leadership skills to work with international organisations and NGOs. This content was last updated on 16 October 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": [
        "pdf_files/SoE-PGRApplication-ProposalGuide.pdf"
    ]
}