{
    "url": "https://www.nottingham.edu.my/pgstudy/course/research/mathematical-sciences-mphil-phd",
    "content": [
        {
            "p": "UNM/JPT-R/421/7/0036(7/26)MQA/SWA0820 UNM/JPT-R/421/8/0034(7/28)MQA/SWA0822 Join the School of Mathematical Sciences to work on projects in both fundamental and applied mathematical sciences that can be applied to solve a wide range of real-world problems. Projects cover the areas of: We're seeking enthusiastic research students who are eager to shape the future of mathematical sciences and have a positive impact to the world. Our research projects encompass a wide range, from developing innovative mathematical models to utilizing mathematical sciences for creating sustainable materials and advancing healthcare. Join us and contribute to making a difference in the world through your passion for research. Our research activities revolve around three captivating research themes, encompassing both traditional areas and emerging, multidisciplinary challenges: Throughout your PhD you will focus on learning what information is already published and identifying gaps in knowledge. You will start to formulate your own research questions and develop skills to become a professional researcher. The emphases are on both broadening your knowledge base and improving the skills and techniques relevant for doing research on thesis-specific matters. The PhD programme includes a training element, which may include research work as well as traditional taught material, and will include assessed components, designed to support your research. In each year you will have regular meetings with your supervisor and an annual review. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A master’s degree with a distinction or merit grade (or international equivalent) plus, an upper second class honours degree (or international equivalent) in mathematics or a closely related discipline with substantial mathematical content. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Or A first class honours degree (or international equivalent) in mathematics or a closely related discipline with substantial mathematical content. Non-UK qualifications will be assessed against this standard. MPhil An upper second class honours degree (or international equivalent) in mathematics or a closely related discipline with substantial mathematical content. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. You do not need to submit a detailed proposal, but you must indicate a research theme(s)* that interests you and/or name specific academic staff members who could be your potential project supervisor and/or name specific projects. *See Section Research Themes and Projects The School of Mathematical Sciences provides dedicated support to its postgraduate researchers. Your supervisors will support you throughout your research period. There is also further support within the school including: In addition, you will have access to a range of support services, including: Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. A postgraduate qualification in Mathematics or Statistics can lead to roles such as academic, data scientist, policy analyst or economist in government organisations and research institutes, banks and investment companies, health research institutes, or as management consultants in finance, insurance, IT, engineering, market research and management consulting Data-Driven Modelling & Computation, a prominent field in mathematics, holds significant relevance across various disciplines such as engineering, physical sciences, biological sciences, and medical sciences. A substantial number of staff from diverse disciplines within the School of Mathematical Sciences are actively engaged in these expansive fields. They contribute significantly to the advancement of novel methodologies, algorithms, and pioneering applications that encompass disease modelling, stochastic modelling, distributional analysis, image analysis, and food engineering. The collective effort put forward a vibrant research environment dedicated to pushing the boundaries of knowledge and fostering impactful interdisciplinary collaborations. Staff members: Dr Grace Yap Dr Liew Kian Wah Dr Yap Yee Jiun Dr Ho Weang Kee Dr Sim Shin Zhu Dr Gloria Teng Available PhD projects Our research is dedicated to the pedagogical theory and practice of teaching and learning mathematics at the higher education level. We actively develop, implement, and rigorously evaluate innovative pedagogical approaches rooted in current educational research. Our ultimate goal is to enhance the teaching and learning of mathematics, not only within the School of Mathematical Sciences but also in broader educational contexts. Dr Betsy Lee Dr Chee Wing Loon Dr Grace Yap Dr Liew Kian Wah Algebra, as a fundamental area of pure mathematics, delves into the study of algebraic structures. Our research group specializes in Non-associative Algebra and Loop Theory, exploring the application of non-associative structures in cryptography. Our aim is to enhance the computational complexity of brute force attacks and establish more robust cryptosystems, thereby bolstering security measures. Dr Chee Wing Loon This content was last updated on 15 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}