{
    "url": "https://www.nottingham.edu.my/Pharmacy/About/Index.aspx",
    "content": [
        {
            "p": "Established in 1925, the School has grown steadily and is now at the forefront of academic development and progress in the field of pharmacy. With the combined intake at the UK and Malaysia campuses, the School is one of the largest School of Pharmacy in the UK. The School established its first overseas presence at the University of Nottingham Malaysia, offering the Master of Pharmacy (MPharm) programme - the first Pharmacy degree to be fully accredited by the Royal Pharmaceutical Society of Great Britain (pharmacy regulatory body in the UK prior to 2010, now General Pharmaceutical Council (GPhC)) outside of Europe in 2005. This essentially allows our students direct access to the UK pharmacist job market upon graduation. Our MPharm programme remains the longest running MPharm programme in Malaysia, and the only programme offered in Malaysia that is fully accredited by the GPhC. In 2010, the School launched the BSc (Hons) Pharmaceutical and Health Science programme to address the demands from a growing pharmaceutical industry scene in Malaysia. In 2012, the School of Biomedical Sciences was established and offered the Bsc (Hons) Biomedical Science programme. In 2019, the School of Biomedical Sciences was integrated into the School of Pharmacy to better integrate research capabilities and foster greater research collaboration between academics. In 2023, the School welcomed its first cohort of Bachelor of Pharmacy (BPharm) students, who will be undertaking a vigorous pharmacy (BPharm) programme, fully conducted in Malaysia and developed from our reputable MPharm programme. The School consistently rank top 10 in the world (8th for 2023) for 'Pharmacy and Pharmacology' (QS University Rankings), performing exceptionally well in aspects such as research impact, academic and employer reputation. Find out more about our courses. Our academics are at the leading edge of scientific and healthcare development. We have a long and distinguished research history, with the recent Research Excellence Framework (REF) 2021 reported that 45% of the School's research output was of \"world-leading\" quality in terms of originality, significance and rigour. Our commitment to research ensures that students learn from the best as they conduct their individual research projects alongside academic staff renowned in their fields. Find out more about our research. Our degree equips you with a range of skills and a knowledge-base valued by many employers from different fields. A degree from the School of Pharmacy prepares students for careers in industry, research, hospital or community pharmacy, scientific writing, marketing or management. Find out more about the student experience and career prospects from our students and alumni! You can be certain that as a graduate from The University of Nottingham School of Pharmacy you will be a valuable commodity, wherever in the world you choose to practice. For the latest updates on the School, do refer to our blog, Facebook, Instagram and Linktree pages. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}