{
    "url": "https://www.nottingham.edu.my/Pharmacy/People/tengjin.khoo",
    "content": [
        {
            "p": "Senior Tutor, Associate Professor, Digital Learning Director Science & Engineering, During my postgraduate years, I work on organic nitrogen-sulfur ligands and transition metal complexes. This is under the supervision of Professor Dr Karen Anne Crouse, Chemistry Department, Universiti Putra Malaysia which leads to a PhD in Synthesis and Organometallic Chemistry. In first two years, I developed synthesis methodology techniques for organic nitrogen donor ligand derivatives and metal complexes. For the remaining part of my PhD, I then continue my work with Professor Dr David J Watkin in Chemistry Research Laboratory, University of Oxford. I then developed spectroscopic and physicochemical techniques for my research with particular work on Single Crystal X-ray Crystallography. My work in the two institution are fully funded under National Science Fellowship, Malaysia and Overseas Researcher Attachment award. With these techniques I am able to then determine the chemical structural parameters for further application in other branch of life science with major interest in Pharmaceutical application. The methodology and techniques I developed were to determine stereochemical conformation, configuration, diasterioisomers, polymorphism, molecular packing and geometry for structures ranging from plant secondary metabolites to synthesis derivatives. Some of the important class of chemical structures I was able to determine are flavonoids, xanthones, Schiff base ligands, transition metal complex, chalcone and polyprenylated acylphloroglucinol. My work has since been successfully published in the journal Acta Crystallographica, Polyhedron, Inorganica Chimica Acta and Planta Medica Letters as first author or corresponding author. Fellow of The Higher Education Academy UK Pharmaceutical Chemistry and Medicinal Chemistry, Pharmaceutical Analysis and Pharmaceutical Organic Chemistry Over the years my research interest is primary on chemistry of small molecules for Pharmaceutical applications. Our area of research highly involve other important branches of chemistry and… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}