{
    "url": "https://www.nottingham.ac.uk/pharmacy/people/roger.knaggs",
    "content": [
        {
            "p": "Professor of Pain Management, Faculty of Science After graduating from the University of Sunderland, I completed by pre-registration training in the pharmaceutical industry and hospital pharmacy. I originally came to Nottingham to study the physicochemical properties of opioids, working under Nick Shaw and Dave Barrett and I was awarded my PhD in 1997. More recently, for nearly 10 years I was anaesthesia and pain management directorate pharmacist at Nottingham University Hospitals NHS Trust. I was appointed Associate Professor in Clinical Pharmacy Practice at the University of Nottingham in September 2011 and I continue to provide a highly specialist pharmacy service to the Pain Management Service at NUH. I have been instrumental in the development of PAIN (Pharmacist Analgesia Interest Network) and I am chair of the United Kingdom Clinical Pharmacy Association pain management group. Following co-option to the British Pain Society Council for several years, I became the pharmacist to become an elected Council member in June 2011. In addition to teaching on the MPharm undergraduate course I am the pharmacist lead for non-medical prescribing course (School of Nursing, Midwifery and Physiotherapy) and provide occasional lectures… read more My major research interest relates to the appropriate use of analgesic medicines, and associated clinical outcomes and healthcare utilisation. My main clinical and research interests relate to the appropriate use of analgesic medicines, and associated clinical outcomes and healthcare utilisation. One early study investigated the prescribing and clinical outcomes in primary care after opioid recommendation for chronic non-cancer pain from a pain clinic. This work won the UKCPA Napp Pain Award in 2005. Other topics have included the use of lidocaine 5% medicated plaster for peripheral neuropathic pain, the effectiveness of manual acupuncture and intramuscular stimulation for persistent pain, patient evaluation of nurse-led follow-up services for patients with chronic pain, and oral analgesic prescribing after major orthopaedic and gynaecological surgery. There has been a marked increase in the use of strong opioids, such as oral morphine and oxycodone, and transdermal fentanyl and buprenorphine, for non-cancer indications over the last decade. I am beginning to study these changes and their geographical variation in more detail, together with understanding the impact of recent legislative changes following The Shipman Inquiry. There remain many unanswered questions regarding the long term effects of opioid therapy and in collaboration with clinical colleagues I am developing a research programme to address some of these issues. For all enquiries please visit: www.nottingham.ac.uk/enquiry"
        }
    ],
    "pdf_files": []
}