{
    "url": "http://www.nottingham.edu.my/pharmacy",
    "content": [
        {
            "p": "Why study with us? We consistently rank top 10 in the world (8th for 2023) for 'Pharmacy and Pharmacology' (QS University Rankings), and an ideal place to pursue an undergraduate degree programme for a career in the healthcare industry. You will be taught and mentored by highly qualified educators, some of whom are alumni who returned from the UK to join the School as academics. Our curriculum encourages the holistic development of our students through placement activities and reflection in collaboration with our industrial partners, which contribute towards graduate competitiveness in the job market. Our Master of Pharmacy (MPharm) degree programme is the only programme offered in Malaysia that allows direct entry into UK pharmacist job market (accredited by the General Pharmaceutical Council UK). Established in 1925 (UK), the School has grown steadily and is now at the forefront of academic development and progress. With the combined intake at the UK and Malaysia campuses, the School is one of the largest of the UK Schools of Pharmacy. Find out more about our School and the Division of Biomedical Sciences. Find out more about our courses. Our academics are at the leading edge of scientific and healthcare development. We have a long and distinguished research history, with the recent Research Excellence Framework (REF) 2021 reported that 45% of the School's research output was of \"world-leading\" quality in terms of originality, significance and rigour. Our commitment to research ensures that students learn from the best as they conduct their individual research projects alongside academic staff renowned in their fields. Find out more about our research. Our degree equips you with a range of skills and a knowledge-base valued by many employers from different fields. A degree from the School of Pharmacy prepares students for careers in industry, research, hospital or community pharmacy, scientific writing, marketing or management. Find out more about the student experience and career prospects from our students and alumni! You can be certain that as a graduate from The University of Nottingham School of Pharmacy you will be a valuable commodity, wherever in the world you choose to practice. For the latest updates on the School, do refer to our blog, Facebook, Instagram and Linktree pages. To enrol in the BPharm course, students will need to complete their secondary education (SPM or its equivalent) and pre-university education (i.e. the Foundation in Science course), having met the entry requirements as stipulated in the BPharm course webpage. No, students can enrol in the BPharm course without the specific requirement for SPM completion. However, upon graduation, if students intend to conduct their provisional training (PRP) at government-linked hospitals or healthcare facilities, they must have completed and passed SPM, with at least a grade C in Malay Language (Bahasa Melayu). Yes, pharmacists are in demand in Malaysia, particularly in urban areas. With the increasing demand for healthcare services and the growing number of senior citizen population in the country, there is a need for qualified pharmacists to provide patient healthcare and medication management services. Moreover, there is a growing demand for pharmacists in non-traditional settings such as pharmaceutical companies, regulatory bodies and academia. Pharmacists with specialised skills are particularly in demand. The salary of a pharmacist in Malaysia ranges from RM4,000 to RM14,000 per month. The level and quality of education, experience, location and employers are some of the factors that affect pharmacist salary. It is important to note that course fees vary depending on the specific course you wish to enrol in. Please refer to the course webpage to find out more. The Bachelor of Pharmacy (BPharm) and Master of Pharmacy (MPharm) are four-year courses whereas the BSc (Hons) Pharmaceutical and Health Sciences and BSc (Hons) Biomedical Science are three-year courses. The University also offers a Foundation in Science course that runs for 2-3 semesters, providing direct entry to all four courses offered by the School. The medium of instruction is English. Students may be required to demonstrate their proficiency in the English language by taking approved language tests such as IELTS or TOEFL. English language requirements may also differ for different courses. Please refer to the course webpage to find out more. Yes, there are various scholarships available for both local and international students to study with us. Students at UNM can apply for scholarships and financial assistance, such as the High Achiever Scholarship and the Dean’s Excellence Scholarship. Our pharmacy courses (BPharm and MPharm) cover a range of subjects which include pharmaceutical chemistry, pharmacology, biology, physiology, pharmaceutics, pharmacy practice, professionalism and leadership. Students will also be required to attend simulated pharmacy workshops, complete practical placements in hospitals or community pharmacies to further hone their patient consultation skills. Pharmacists can work in a variety of settings, such as hospitals, community pharmacies, pharmaceutical companies and regulatory bodies. They can also pursue their education and specialise in areas such as clinical pharmacy or pharmaceutical research. Please refer to our School blog to find out more. Yes, our courses are globally recognised and graduates are eligible to work as pharmacists or scientists in many nations. Nevertheless, it is essential to check the local regulatory requirements for practising as a pharmacist in the country you intend to work in. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}