{
    "url": "https://www.nottingham.edu.my/Pharmacy/Research/Non-communicable-Diseases/index.aspx",
    "content": [
        {
            "p": "Non-communicable diseases (NCDs), a diverse group of non-infectious chronic diseases, contribute to the largest mortality in developing countries. It is essential to recognise the importance of research of issues pertaining to NCDs to develop evidence-based interventions that can prevent and manage NCDs. The members of this research group consists of multidisciplinary experts with vast experience and skills in chemistry of natural products, pharmacognosy, pharmacology, and immune modulation. The National Cancer Society of Malaysia (NCSM) projects that one in every four Malaysians are likely to develop cancer by the age of 75 years. The increasing ageing population, obesity epidemic and environmental risks such as the annual haze in Malaysia are additional factors which add on to other established risk factors. Millions of Ringgit is spent annually on oncology drugs to treat cancer and yet, the mortality rate due to neoplasm is increasing over the years. As such, our research aims to find ways in fighting cancer from a top-down approach where our projects range from fundamental research of cancer biology, development of bioassays and biomarkers for diagnosis and finding new-treatments for various cancer types. Current research focus: Current members: Cardiovascular diseases (CVDs) remain the leading cause of death in Malaysia as well as in the world. Some of the common risk factors of CVDs include obesity, diabetes, hypertension and dyslipidaemia. Our National CVD database (2011-13) showed that 96.8% Malaysian patients had at least one established CVD risk factors – diabetes (46 %), hypertension (65 %) and dyslipidaemia (37 %). In addition, Malaysians develop CVDs at a younger age as compared to people in Thailand, china and many western countries, indicating a need to combat hypertension and dyslipidaemia. Despite the availability of different classes of antihypertensive drugs, high blood pressure continues to be one of the most important risk factors for death and disability. The American Heart Association defines resistant hypertension as uncontrolled blood pressure despite the use of three or more antihypertensive medications. It was reported that 1 in 50 hypertensive patients became resistant to treatment within a median of 15 months after starting treatment. This further adds to the burden of other co-morbidity such as end-stage organ failure, heart attack and stroke. It was highlighted that an increasing proportion of patients will need more than 3 type of medications to effectively control their blood pressure. Two in five Malaysian adults are overweight with BMI >40 and carry high risk for chronic diseases including type 2 diabetes and cardiovascular diseases. Being the most obese nation in South East Asia and the second in Asia, the alarming rise of obesity and diabetes cases among Malaysian warrants region-specific research and awareness outreach initiatives. Recent pharmacogenetics studies found that populations with high frequency of certain HLA genes are associated with increased risk of various drug-induced hypersensitivity. Notably, the HLA-B*15:02 has been established to be associated with carbamazepine, phenytoin and oxocarbazepine induced-Steven Johnson syndrome while the HLA-B*58:01 is associated with allopurinol induced-Steven Johnson syndrome especially among South East Asian population. The FDA has issued recommendation to screen for the HLA-B*15:02 prior to prescription of carbamazepine and this calls for translational research that improves the turn-around-time of the genetic screening to better facilitate clinicians in making better decision on drug prescription. Cytochrome P450 (CYP) is an important drug-metabolising enzyme, which helps to eliminate drugs from human body. Herb is believed to be safe and beneficial to health. However, herbs contain numerous active constituents, which potentially inhibit or induce cytochrome P450 activities, thus affecting the elimination of drugs, leading to drug-herb interactions. On the other hand, CYP variants (polymorphic CYP enzymes) process altered enzyme activity, resulting in slower elimination of drugs from the body. Medicinal mushrooms have been used traditionally in Malaysia and other East Asian countries, including China and Japan, for benefits of general health, respiratory function and urinary problems. We are collaborating with Ligno Biotech, focusing on their cultivated mushrooms, Lignosus rhinocerotis and Cordyceps sinensis to study the in vitro pharmacological effects of these mushrooms in airways and bladder tissues. We are collaborating with Dr Laura Sadofsky, University of Hull (UK) in elucidating the role of L. rhinocerotis in alleviating cough through the purinergic receptors and Transient Receptor Potential (TRP) cation channels. In a separate research, the fungal immunomodulatory protein (FIPs) from edible mushroom Flammulina velutipes (Fve) and medicinal mushroom Lingzhi (LZ8) are being studied. Microplastics, haze particles and pharmaceutical contaminants are the focus of this research group. The areas of focus include toxicology and pathophysiological studies, and pharmacy practice on pharmaceutical waste management and exacerbations of respiratory conditions due to haze pollution. We work with colleagues across disciplines including Environmental and Geographical Sciences, material science and nanotechnology. A group led by Prof Ting Kang Nee has recently won a Tri-campus Award for the “Research Team Award for Most Supportive /Inclusive Research Environment 2021/22”. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}