{
    "url": "https://www.nottingham.ac.uk/pharmacy/news/2022/marie-sklodowska-curie-postdoctoral-fellowship-opportunity.aspx",
    "content": [
        {
            "p": "The School of Pharmacy at the University of Nottingham invites expressions of interest for Marie Sklodowska-Curie Postdoctoral Fellowships (MSCA PF) 2022 under the Horizon Europe programme. Our aim is to attract excellent researchers with the potential to work on ground-breaking research projects that make a significant contribution in areas that match the School of Pharmacy’s wide-ranging expertise, in particular to our research strategic priority areas of biotherapeutics, anti-infective technologies and diagnostics and analytics. https://www.nottingham.ac.uk/pharmacy/research/index.aspx. The School of Pharmacy host an exceptional research environment (5th in the 2021 QS World Rankings for Pharmacy & Pharmacology) with our research impact rated as 100% 4* in REF2014, and supports a dynamic and vibrant research culture. The School has an established support structure for its Research Fellows. MSCA PFs are prestigious and subject to rigorous peer review, so successful applicants who can be matched to a supervisor at the School of Pharmacy, University of Nottingham, will write the proposal in collaboration with their supervisor and with additional, expert proposal preparation support. International mobility is essential; applicants can be of any nationality but you should be moving to Nottingham from outside the UK to take up the fellowship. Project duration can be 12 – 24 months and focused on “training through research”. These are excellent awards for career development. Researchers must have a doctoral degree at the date of the call deadline, with a maximum of eight years full-time equivalent experience in research, measured from the date that the researcher was in possession of a doctoral degree and certified by appropriate documents. The European Commission’s next call for applications will now open on 13th April 2022, and close on 14th September 2022. It is important to devote enough time to maximising the competitiveness of the proposal, so if you are interested in developing a MSCA-PF proposal with the University of Nottingham School of Pharmacy, please send us a copy of your CV and a 2-page expression of interest that contains the following information that outlines your proposal for a Fellowship: 1. Scientific Proposal (max 1 page) – Provide an introduction to the proposed research undertaken in the Fellowship. Discuss the state-of-the-art, objectives and research methodology and approach. Highlight any opportunities for multi-disciplinary collaboration. 2. Why University of Nottingham and why the School of Pharmacy? (max 1/2 page) – provide details of why you wish the Fellowship to be hosted at University of Nottingham and in the School of Pharmacy. Propose an academic who you would come to work with. 3. Experience & Future Career (max 1/2 page) – briefly describe your research experience to date and how a MCSA Fellowship would support your future career development. Please email your CV and the 2-page expression of interest to Dr Frankie Rawson at frankie.rawson@nottingham.ac.uk by 31st May 2022 to be considered for development of a Fellowship application at University of Nottingham School of Pharmacy. Information on more fellowship opportunities can be found here: https://www.nottingham.ac.uk/pharmacy/research/fellowship/fellowship.aspx For all enquiries please visit: www.nottingham.ac.uk/enquiry"
        }
    ],
    "pdf_files": []
}