{
    "url": "https://www.nottingham.ac.uk/physics/about/welcomehos.aspx",
    "content": [
        {
            "p": "Welcome to the School of Physics & Astronomy web pages, summarizing our undergraduate teaching, research, and postgraduate degree programmes. Teaching and research are intrinsically intertwined in the School, which greatly benefits both activities. Being taught by world-class researchers enthuses our students to reach the forefront of physics, where there are many pathways to advancing the subject, forging links to other disciplines, and securing employment. Conversely, advances made by our undergraduates and postgraduate researchers, for example in projects and internships, enrich our research. The range of undergraduate degree programmes that we offer enables students to combine broad understanding of physical principles with in-depth knowledge of particular sub-disciplines. The core physics that we teach, and the many more specialized options that students can choose from, all draw on our latest research. Our undergraduate courses develop the many transferrable skills that you will need in your future career as a professional physicist or working in one of the many other sectors where scientific training is highly valued. These skills include: In the fourth year of our MSci programmes, conventional exam-based modules are replaced entirely by student-led activities where you work individually and with others to share understanding of physics and further hone your transferrable skills. These skills are highly desirable to employers, making our graduates sought after for a wide range of interesting and well-paid careers. Our students enjoy being part of a vibrant School and University community, which is reflected by the strong scores that we obtain in the National Student Survey completed by each graduating class. Our passionate commitment to Equality, Diversity, and Inclusion makes the School a very welcoming and friendly place to be. For example, our student leaders have recently formed a series of networks to support and connect people with protected characteristics. The School has a broadly-based and dynamic research environment with 100 postgraduate students and 72 post-doctoral fellows attracted from around the world. These researchers work with 61 academics, 26 highly-skilled technicians and 14 dedicated administrative staff. Our research spans Astronomy, Cold Atoms & Quantum Optics, Condensed Matter Theory, Experimental Condensed Matter & Nanoscience, Magnetic Resonance Imaging & Spectroscopy, Particle Cosmology. Collaboration between these groups regularly opens major new interdisciplinary research themes. As an indication of our research calibre, the School was ranked third equal amongst UK physics departments in the last national assessment of research quality. The strong international reputation of our research has attracted a large grant portfolio from a wide range of funders. We are proud that research undertaken within the School, by Professor Sir Peter Mansfield, was recognized by the award of a Nobel Prize for the invention of Magnetic Resonance Imaging body scanners, which have already helped more than half a billion people worldwide. Drawing on aspects of this work, our recent use of quantum technologies to understand how the brain works is changing the way that neurological conditions are detected and treated. Nottingham is an exciting city with many cultural and sporting attractions. Our campus is within easy reach of these attractions but situated in extensive parkland with easy access to the surrounding countryside and to neighbouring 500-acre Wollaton Park. Nottingham is a great place to live and study! Click here to find out more about living in Nottingham. I hope that this brief introduction gives a sense of our School, University, and city communities, and that our web pages convey the beauty and excitement of a subject that we love to study, advance and teach. If you have any questions, don’t hesitate to get in touch. Professor Mark Fromhold Head of School The University of Nottingham University Park Nottingham NG7 2RD For all enquiries please visit: www.nottingham.ac.uk/enquiry"
        }
    ],
    "pdf_files": []
}