{
    "url": "https://www.nottingham.ac.uk/physics/outreach/outreach.aspx",
    "content": [
        {
            "p": "The School of Physics & Astronomy is engaged in a wide range of activities designed to help get schools and the wider community involved in cutting-edge physics and astronomy. If you want to take part in any of these free programmes, or would like to develop some new activity with us, contact the School of Physics & Astronomy's Outreach Officer. Levelling Up: Physics is a support programme for A-level students from groups currently under-represented in physics who are aiming to study physics and related subjects at university. The programme runs alongside students’ A-level studies and gives them access to a dedicated tutor and peer mentor from a university local to them. Sixth-form students take part in regular, guided tutorials, mentoring sessions, guest lectures, and activities designed to make sure they are ready to apply for, and succeed, at university. We are happy to take part in the Faculty of Science’s “Science Lecture Series,” which sees experts from our department and others discuss their research. Our inflatable planetarium is managed and run by our Postgraduate and Undergraduate students. We take part in public events (must be indoors) and visit local primary schools as part of the University's Widening Participation programme. Due to the large volume of requests we receive, we cannot host individual work experience placements. However, we do host a very popular work experience week in July, so do please consider applying. Year 12 Work Experience Programme - 1-5th July 2024 If you are a Year 12 physics student, come experience the exciting world of cutting-edge research carried out here at the University of Nottingham. At our work experience week, you will have the opportunity to: The programme is completely free. Applications for the programme are now closed. The University of Nottingham University Park Nottingham NG7 2RD For all enquiries please visit: www.nottingham.ac.uk/enquiry"
        }
    ],
    "pdf_files": []
}