{
    "url": "https://www.nottingham.ac.uk/physics/",
    "content": [
        {
            "p": "\"A quantum leap in brain scanning: New technology could help detect conditions early\" An ITV News Science Correspondent has participated in a quantum brain scan using revolutionary new technology developed by the Medical Physics group at the University of Nottingham. The OPM-MEG system is a lightweight and cost-effective alternative to MRI, already aiding in the early detection of life-changing conditions. Watch the segment with Professor Matt Brookes OBE and Dr Karen Mullinger here. Our areas of study and innovation range from the minuscule - examining subatomic particles and quantum nanostructures - to the vastness of galaxies. Our research spans extreme temperatures, from near-absolute zero conditions to the intense heat of the Big Bang. We come up with new theories to fit what we observe and then design experiments and use advanced methods such as machine learning and AI to understand what we measure. We are home to numerous research fellows from the most prestigious research funders, such as the Royal Society. In our astronomy group, we treat the Universe as a playground, a laboratory in which to test theories of gravity, fusion and particle physics in the most extreme environments. There is nowhere better to test your theories of gravity than at the edge of a black hole - and that’s exactly what we do in our award-winning Gravity Laboratory. We are also the home of the Nobel Prize for the development of MRI body scanners, and we remain a world-leader in this area of medical physics. In 2022, we were awarded £29.1 million to establish the UK’s most powerful Magnetic Resonance Imaging (MRI) scanner as a national facility. Professor Brookes, recipient of an OBE in the 2023 New Year Honours, has helped pioneer a new kind of wearable brain scanner that has potential to transform the diagnosis and understanding of a number of neurological and psychiatric disorders, including autism, epilepsy and dementia. As much as we love our research, it is our passion for teaching that makes Nottingham special. We want you to have a great time learning about the subject that we research and teach, and we strive to prepare you for whatever direction you choose to take your love of the subject, whether it be entering industry, joining academia, or launching a medical physics startup. For example, there are many varied and exciting career paths you can take with a background in medical physics. These span from research and development of new technologies, to supporting end-users of the technology from within the health sector, to interacting with patients during their diagnosis or treatment planning pathway. The Institute of Physics (IOP) found that, in 2019 alone, physics directly generated 11% of total UK gross domestic product (GDP). The UK physics sector accounts for 10% of total UK employment, and labour productivity in the sector is strong, at £84,300 per worker, per year. Opt for a degree in physics, and a wide array of career paths will open up for you. Opt for Nottingham, and not only will you enjoy your journey towards earning that degree in a down-to-earth atmosphere, but you’ll also benefit from the unwavering support and dedication of our entire staff committed to helping you achieve your dream. Apply Now for Undergraduate and Postgraduate Courses Have you decided you would like to study physics but don't think you have the right qualifications? The School of Physics and Astronomy offers a foundation year which provides an alternative route onto our highly regarded BSc or MSci physics degrees. Foundation Year Undergraduate students are welcome to attend all seminars. See all internal events The University of Nottingham University Park Nottingham NG7 2RD For all enquiries please visit: www.nottingham.ac.uk/enquiry"
        }
    ],
    "pdf_files": []
}