{
    "url": "https://www.nottingham.ac.uk/physics/careers/careers.aspx",
    "content": [
        {
            "p": "Physics underpins most science and technology, but the range of careers entered by Physics and Astronomy graduates is far wider than even this fact would suggest. Many employers see a physics graduate as someone who has demonstrated an ability to work through a demanding course of study and who will have acquired a variety of technical and other transferable skills. The range of careers enjoyed by our graduates and their success in finding suitable positions is a measure of how many employers appreciate the value of a physics degree. This appreciation is reflected in the lucrative salaries that graduates from this School can typically expect, even at the start of their careers. Book Careers Advice appointment online What can I do with my degree? The Institute of Physics organise free careers events which usually take place at its London headquarters, 80 Portland Place. Full details can be found on their website. The University Careers Service organise skills workshops on topics such as Assessment Centres, CVs, interview techniques and psychometric tests, plus employer led sessions. All of these are bookable on their website. It's a good idea to meet employers, ask about job roles, understand the culture of their organisation and ask about opportunities at first degree and at PhD level. School of Physics & Astronomy students are welcome to attend all of the University's careers fairs. A full list of fairs is available in the Events section on the Careers Service website. The bulk of employer activity on campus will be in Autumn. Deadlines for graduate schemes in large organisations often close in November. Summer internship applications begin in autumn. Obviously not all employers will be on campus, so it’s a good idea to research your chosen area to understand how those employers recruit. IOP Careers Careers and Employability Service Prospects sector advice Further information on physics internships and summer placements can be found on our Internships page The University of Nottingham University Park Nottingham NG7 2RD For all enquiries please visit: www.nottingham.ac.uk/enquiry"
        }
    ],
    "pdf_files": []
}