{
    "url": "https://www.nottingham.edu.my/Politics/People/tricia.yeoh",
    "content": [
        {
            "p": "Associate Professor of Practice, Faculty of Social Sciences Dr Tricia Yeoh is Associate Professor of Practice at the University of Nottingham Malaysia's School of Politics and International Relations. She is also currently Senior Adjunct Research Fellow at Monash University Malaysia and visiting fellow at the ISEAS - Yusof Ishak Institute, and former CEO of the Institute for Democracy and Economic Affairs (IDEAS) Malaysia. She writes and speaks widely on federalism, subnational opposition politics and institutional reforms. She received her PhD in Political Science from the School of Politics, History and International Relations at the University of Nottingham Malaysia. Over the past 18 years, Dr Yeoh has been actively involved in both national and subnational-level public policy advocacy and policy-making processes through her writings and engagements with a cross-section of individuals within civil society, public officials, political representatives, the media and private sector. Through her work with independent think tank IDEAS, she has contributed to making national and state reforms within the public policy areas of anti-corruption, governance and accountability, natural resource transparency, economic freedom, public administration and education. She has been featured on BBC, Bloomberg, CNN, Al-Jazeera and The Economist commenting on public affairs in Malaysia. She has served as Research Officer to the Selangor Menteri Besar (Chief Minister) at the Selangor State Government and Director of the ASLI Centre for Public Policy Studies. She is a columnist at Channel News Asia and theSun. She is editor of the books \"The Spirit of Merdeka\", \"The Road to Reform: Pakatan Rakyat in Selangor\" and author of \"States of Reform: Governing Selangor and Penang\". Her documentary, \"The Rights of the Dead\", the story of political aide Teoh Beng Hock who died in 2009 under the Malaysian Anti-Corruption Commission's custody, won the Justin Louis Award at the FreedomFilmFest 2012 and was screened at the 9th Aljazeera International Documentary Film Festival 2013 in Doha, Qatar. Her writings have been published by academic websites including New Mandala, Fulcrum, Forum of Federations, FORSEA and The Asia Dialogue. Dr Yeoh was awarded the Meritorious Service Medal, conferred by the Sultan of Selangor (Pingat Jasa Kebaktian, PJK) in 2011. She was awarded the 2017 Distinguished Alumni Award for Monash University Malaysia, the Postgraduate Award Prize 2020/21 from the University of Nottingham and most recently, the Malaysia Australia Alumni Council Female Alumnus of the Year Award 2023 for her contributions to advancing women's causes in Malaysia, including social and economic policy towards improved conditions of living. In particular, Tricia was one of the founding members of the Malaysia Workshop on Political Studies *MYWPS) and the Women in Southeast Asian Social Sciences (WiSEASS) http://wiseass.me, which aims to advance young women scholars in their careers. Dr Yeoh graduated from Monash University Malaysia with a Bachelor in Business and Commerce, majoring in Econometrics and Business Statistics and Marketing. She also holds a MSc. in Research Methods in Psychology from the University of Warwick. She is a member of the Board of IDEAS Foundation and was up to recently a member of the Institute of Youth Research Malaysia (IYRES) Board of Directors under the Ministry of Youth and Sports. She is also on the Board of Advisors of Relate Malaysia, a non-profit advocating mental health. She is an avid yoga practitioner and is qualified as a yoga teacher. Her list of publications and research areas can be found at www.triciayeoh.com Dr Tricia Yeoh's expertise includes: telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}