{
    "url": "https://www.nottingham.ac.uk/politics/study/careers/placements/index.aspx",
    "content": [
        {
            "p": "To be competitive in the current job market you need more than just a degree - you need to gain and demonstrate key skills for the workplace. Our work placements and employability programme provides valuable work experience, self-confidence and a practical application of your studies. The school currently offers the following types of placements: Placements are available for both undergraduate and postgraduate students. Current students can find out more about our placement offering in the school's Student Handbook. Undertaking a placement will equip you with the following career-ready toolkit: All students in the School of Politics and International Relations are eligible to participate in the Faculty Nottingham Advantage Award term-time Placement Programme each semester. Additionally, there are Summer and Easter placements available to students, along with funded bursary support for students from widening participation backgrounds. Interested? The Autumn Programme vacancies go live in June/July and for Spring Programme in November. Keep an eye out for the big email launch. Access the vacancies and support and guidance (log-in required) Current and past placement providers include: The University of Nottingham's Politics and International Relations internship programme is an invaluable resource for international organisations, businesses and non-governmental organisations alike. The student base is one of the most motivated and qualified that I have come across in a long time, a combination which ensures we are provided with dedicated students, eager to learn while simultaneously able to produce high-quality work. The fact that the students can either come to the office or work remotely also adds a highly useful element of flexibility to the programme - for organisations and students. The university's support streamlines the intern selection process; short-listing applicants whose profiles most fit the job, and remaining a reassuring background presence that you can turn to should anything not be going smoothly - a situation that is yet to materialise! I am extremely grateful for their support. Steve Vaccarini, Faculty Placements Manager Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur. Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}