{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/blending-the-strengths-of-charities-and-academics-to-deliver-policy-impact",
    "content": [
        {
            "p": "Insights from the University of Nottingham’s pilot Charity Fellowship scheme At the Institute for Policy and Engagement, we continually ask ourselves how academics can more effectively engage with policy makers. The direct relationship between policy makers and researchers is of course key to this, but we always emphasise to the academics we work with that success often hinges as much on your partners – and how you work with them – as it does on your key policy audience. That’s why, as we explored mechanisms for policy engagement as part of the Capabilities in Academic Policy Engagement programme, we were keen to include work focused on how researchers can work best with some of the broader range of organisations that influence policy. Charities are a key example – and this gave rise to our pilot Charity Fellowship scheme. Why charities? The extent to which charities seek to impact on policy shouldn’t be underestimated. A quick look at the ‘what we do’ page of a charity’s website will probably show you a section on policy influencing. This shows that with an ability to mobilise campaigns, advocate for change, provide a voice for those with lived experience and carry out research relevant to policy, in areas ranging from healthcare to tackling the climate emergency, charities are powerful agents for policy impact. Working with charities can therefore be a powerful tool for academics looking to bypass the usual challenges faced in policy engagement: What can academics offer charities? Unsurprisingly, the strength of evidence and access to expertise behind charity-led campaigns and research is important to their success. The skills, resources and connections of universities have the potential to help meet this demand; academic engagement can therefore be another key step towards policy impact. However, as we have learnt through CAPE, there is no single, simple route to engaging with academics, with some methods being more suited than others depending on the context. Compounding this challenge further, small charities may have major strains on their capacity which prevent them from effectively accessing academic expertise. In 2019, the think tank Charity Futures and the Giving Evidence consultancy explored the uptake of academic evidence into charity activity by surveying charities and researchers2. They found that operational charities feel ‘disconnected from academic research’, rarely accessing academic journals and desiring more evidence relevant to them. Perhaps, then, a rethink on how academics and charities engage is needed. Our Charity Fellowship scheme Consequently, at the University of Nottingham, we allocated some of our CAPE funding to run fellowships that placed academics within charities, working on policy-facing projects. Fellowships are effective ways of supporting the needs of the host organisation in accessing expertise, while allowing the fellow to develop skills and experience in an organisation outside of their usual environment. In addition, they allow for sustained engagement which can sync up with mid to long term charity activity, such as campaigning. Rather than academic evidence existing as niche (and often jargon-filled) research papers hidden among thousands of others, fellowships can allow evidence to be communicated specifically to the host, often also supporting in interpretation and providing advice. In early 2023, we welcomed UoN staff to apply for the scheme. Applicants were invited to bid for up to £10,000 to cover eligible costs for the fellowship with a charity of their choice, which needed to be part-time to enable activity to sit alongside existing research responsibilities (or, where permitted by the faculty, replacing teaching time, which the funding could buy-out). Importantly, applicants were required to provide a letter of support from the charity they proposed working with. Four applicants were successfully awarded a fellowship, commencing in spring/summer of 2023 following the signing of an agreement between the University, the fellow and the charity. A brief look at the fellowships … Partnering with Nottinghamshire YMCA, Tara Webster-Deakin (from the School of Cultures, Languages and Area Studies) has been part of a team exploring the potential for using a ‘developmental assets’ framework to assess what young people in the local area need to thrive. Working to design, distribute and evaluate a survey for schools and their pupils, she was able to support the charity in demonstrating a new-to-the-UK method of working with young people and share her findings with local policy makers. In contrast, Tim Hutchings (from the School of Humanities) focused his fellowship on impact at the national level through direct engagement with politicians. His fellowship worked to utilise his expertise in religious education (RE) policy to develop and promote a campaign for a new approach to RE based on ‘worldviews’, championed by his host, the Religious Education Council of England and Wales. Working with a PR agency, his fellowship took him into parliament and party conferences, where he was able to work closely with those at the heart of decision-making. Focussing on health policy, Tessa Langley (from the School of Medicine) has been embedded in the charity Action on Smoking and Health (ASH) to provide evidence on the economic impact of the leading causes of preventable ill health. Culminating in a rapid literature review, Tessa explored how existing economic analysis of the impact of alcohol, tobacco and obesity could be aligned to ensure consistency in methodologies across the three risk factors. ASH can then use this evidence in their campaigning to counter claims of the economic value of unhealthy products like tobacco, alcohol and unhealthy foods, while strengthening the case for regulatory action to reduce consumption. Charities also have a role in influencing policy overseas, and this can be seen in Zinnia Gonzalez-Carranza’s (from the School of Biosciences) fellowship with Social Business Network, a charity working to empower farming communities in Nicaragua. Her project sought to analyse the impact of the charity on strengthening the support of smallholder cooperatives and stimulating rural social development. Through production of videos and policy briefs, the information will inform Nicaraguan policymakers on the impact of the charity’s interventions to empower women as a sustainable model for rural development. What are the key things we’ve learned? If you have any questions about these fellowships, please contact theinstitute@nottingham.ac.uk."
        }
    ],
    "pdf_files": []
}