{
    "url": "https://www.nottingham.edu.my/Politics/People/abdillah.noh",
    "content": [
        {
            "p": "Associate Professor, Faculty of Social Sciences Abdillah Noh is an Associate Professor at the School of Politics and International Relations. Abdillah obtained his DPhil (Politics) from St. Antony's College, University of Oxford. Abdillah has authored two books. The first is titled \"Issues in Public Policy and Administration in Malaysia: An Institutional Analysis \"His most recent book is titled \"Malaysia's State Formation: Small Steps and Large Outcomes of a Contested Leviathan,\" where he employs a blend of historical and rational institutional analysis to develop a framework that depicts the character of Malaysia's political economy. Abdillah is currently working on his third book titled Political Change in Southeast Asia, applying institutional analysis to understand the extent of political change and democratisation in selected Southeast Asian states. Abdillah has published articles in journals like Contemporary Politics, Electoral Politics, and the Journal of Policy History, as well as in the Critical Asian Studies commentary board. He has also written opinion pieces in the Straits Times (Singapore), South China Morning Post (Hong Kong), New Straits Times (Malaysia), and Today (Singapore). Abdillah's work is available on his personal website at https://abdillahnoh.com. Abdillah is interested in the quality of institutions and the nature of institutional change. He is interested in applying the tools of institutional analysis to examine seemingly eclectic issues ranging from state formation,democratisation and political change, public policy, economic diversification efforts to issues in international relations. Given his training in public policy, political science, finance and economics, Abdillah has taught a number of courses at both the undergraduate and postgraduate levels. They include international… read more Abdillah applies the institutional analysis to understand state formation, political transition, international relations and governance, public participation, and policy design and implementation.… read more telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}