{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/notts-youth-trends",
    "content": [
        {
            "p": "Working collaboratively to create Nottinghamshire's largest youth voice survey. Nonsuch’s Community Engagement Coordinator, Caroline Rowland, shares details of a youth voice survey running in partnership with two departments at the University of Nottingham. Find out how we are working to capture the views and opinions of children and young people and use that data to inform local decision making. Notts Youth Trends is Nottinghamshire's largest youth voice survey listening to the voices, opinions and demands of 11-25-year-olds living across Nottingham City and Nottinghamshire to make the city and county a better place to grow-up, learn and achieve in. Started in 2018, NottsYouthTrends has been led by Nonsuch Studios as part of a mission to empower creativity and access to opportunity. This year NottsYouthTrends is hoping to hear from the largest number of under 25s from across the city and county as possible to create the broadest understanding of what is it to be a young person living and working in Nottinghamshire today. We're thrilled that the programme is being supported by the Institute and the City as Lab programme. This will enable us to host workshops and insight sessions with groups of under 25s from across the county to unpack, expand upon and delve deeper into the findings as the survey results come through. The survey which collects anonymous data from any 11-25-year-old from across Nottinghamshire. Data collection and workshops will run through to February 2024. The data will then be analysed by the NottsYouthTrends team and lead to the creation of a report which will be shared at a youth-led launch event in Spring 2024. The data from Notts Youth Trends will be shared with partners across the city to help them shape their services and inform decisions about where to prioritise resources. It will also feed into the local work City as Lab are beginning to develop, informing their research strand named ‘improving the lives of young people’. Lastly, we are really excited that this survey is supporting Nottingham’s bid to become a UNICEF Child Friendly City. In order to do this it is essential that we work with our young people, listen to their concerns and collaborate to make the city a better place to grow up. Send them to the NottsYouthTrends website where they can fill in the survey in around 20-30 minutes. Anyone aged 13-25 can fill it in on their own and those aged 11 & 12 should fill it in with adult supervision and permission. As part of this data collection, Notts Youth Trends are holding Insight sessions for hard to reach groups who may not otherwise be able to share their voice. If you work with a anyone groups aged 11-25 who you think would be interested to share their views. Get in touch and we can talk through how a session could be tailored to your setting. Schools, FE & HE are a great way to gather large numbers of responses and we love to collaborate with educational institutions. If schools and colleges are able to support at least 200 responses from their local postcode area, we're able to extract an anonymised sample of the findings that hone in on their local community and catchment, which enable schools and colleges to effect change in their own planning on a localised level. To receive a resource pack to support sharing Notts Youth Trends in your school, college or university, please get in touch getinvolved@wearenonsuch.com Caroline Rowland is Community Engagement Coordinator at Nonsuch Studios. Nonsuch Studios has worked extensively with children and young people since 2013, galvanised by the belief that Creativity is Power. Across their community programmes they work with young people across Nottingham and Nottinghamshire to co-produce events, festivals and creatives opportunities that enable young people to share their voice, get involved and do their thing! The survey project has been created in partnership with Nonsuch, City as Lab and The Institute for Policy and Engagement."
        }
    ],
    "pdf_files": []
}