{
    "url": "https://www.nottingham.ac.uk/policy-and-engagement/events/events-2024/ending-stagnation-roundtable.aspx",
    "content": [
        {
            "p": "Thursday 29th February, 6:00 – 7:00pm (Refreshments available from 5:30pm) Cleaver and Wake, 1a The Great Northern Cl, Nottingham NG2 3JL A toxic combination of 15 years of low growth, and four decades of high inequality, has left Britain poorer and falling behind its peers. Productivity growth is weak and public investment is low, while wages today are no higher than they were before the financial crisis. Britain needs a new economic strategy to lift itself out of stagnation. Nottingham is in many ways a microcosm of this national challenge. It has become a hub for creative industries in the East Midlands, serving as the headquarters for major firms like Games Workshop, as well as global giants like Boots and e.on. The city’s many strengths – including the world-class university and services firms – must be harnessed to meet the economic challenges of the coming years. But it also has high levels of deprivation, and won’t be truly thriving unless it finds ways to ensure that all its inhabitants benefit from growth and investment. What should a new national economic strategy for Britain include? How will economic change affect the jobs we do, the places we live and the businesses we work for? And what are the prospects for cities like Nottingham, regions like the East Midlands, and nations like Britain to be able to rise to these challenges? The Resolution Foundation is hosting this event with the Institute for Policy and Engagement at the University of Nottingham to debate Britain’s future economic strategy, building on the analysis of The Economy 2030 Inquiry – a three-year collaboration between the Resolution Foundation and the LSE, funded by the Nuffield Foundation. We will be joined by leading experts from policy and business in the region to discuss how different areas of the UK – particularly Nottingham and the wider East Midlands region – can secure widely shared prosperity. University Park Nottingham NG7 2RD t: +44 (0) 115 951 5151 e: theinstitute@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}