{
    "url": "https://www.nottingham.edu.my/Politics/Newsletter/Issue-2-2015/Student-news.aspx",
    "content": [
        {
            "p": "From Victoria Cheng, the lead representative on PHIR-Nott, we learn that the society collaborated with Careers Office to organise the PHIR School's first ever Politics and International Relations Careers Day. We handed over some of our contacts to Careers Office for them to do speaker bookings and invitations, and we helped sort out the layout and itinerary for the event day. We were tasked with moderating, ushering, marketing, and facilitating between speakers and students. This will be the first time that PHIR students had contact with important figures like Dr. Ong Kian Ming (MP of Serdang), Yin Shao Loong (Executive Director of Institut Rakyat), and Sumitra Visvanathan (Executive Director of Women's Aid Organisation) in a setting that is designed so that students get maximum exposure to several chosen speakers in an intimate setting of sharing and discussion. These three speakers were chosen mainly for their areas of expertise; their shared experiences during the rotating sessions managed to broaden the scope for PHIR students when looking for potential jobs, be it in the political arena, in a think tank, or in an NGO. PHIR-Nott’s next event was a large-scale event where we collaborated with Projek Dialog to bring over a renowned Muslim ulama from Indonesia to speak about Islam and feminism. This was PHIR-Nott's first event where we attempted to tackle a contentious issue here in Malaysia with the help of an external institution and featuring a well-loved and controversial figure. It also recruited members from the Feminist Society to help us with ushering and marketing. A short film by filmmaker Norhayati Kaprawi was screened, followed by a Q&A session on Muslim feminism by Nyai Masriyah Amva. The final PHIR-Nott event for the semester was a Christmas dinner held in the glitzy part of KL - Bukit Bintang. In the spirit of diversity, the society had decided to go for a Middle Eastern theme in Tarbush Restaurant. Students played games centred on the arts and humanities peppered with some pop culture, and also made new friends with students from other courses. PHIR-Nott hopes to continue its current academic year's vision of tackling more grassroots and diverse affairs, be it in religion, ideology, or employment. The society wants students in PHIR to have a more holistic and multi-faceted university experience before they graduate. telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}