{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/climate-change-wicked-problems-and-evidence-based-policy",
    "content": [
        {
            "p": "Why the net zero challenge illustrates the importance of universities Introduction Climate change is the ultimate “wicked problem,” demanding multifaceted, interdisciplinary solutions that universities are uniquely positioned to provide. At the University of Nottingham, our initiatives like the Zero Carbon Cluster and the Policy Commission on the Just Transition highlight the critical role of academic institutions in shaping evidence-based policies. This article explores how universities can leverage their vast expertise to tackle the complexities of climate change, emphasizing the need for broad social consensus and collaborative efforts to achieve net zero. Since I joined the Institute for Policy and Engagement six years ago, I have been lucky enough to support policy impact projects on a wide range of topics, from preventing traffic accidents to improving mental health to tackling counterfeit medicines. One consistent message I have worked to convey to academics is the importance of crystalising in clear and concise terms, exactly what actions policy makers should take based on the research evidence. However, not all policy challenges lend themselves to capturing pithy policy messages in this way. The biggest challenges we face are wicked – multifaceted, highly complex, and demanding action in a bewildering array of fields – and by a range of policy actors at all levels and in diverse institutions – simultaneously. A punchy policy brief may work well when a problem is relatively one-dimensional, but for our most pressing social issues, it’s an understatement to call it inadequate. The wicked problem to end them all is, of course, climate change. From our presence at COP26 in Glasgow in 2021, through to the development of our SHAping Sustainable Futures Hub, the launch of the University of Nottingham Zero Carbon Cluster, and our current Policy Commission on the Just Transition, this has been a consistent focus area during my time at Nottingham. But throughout all this, the sheer size and complexity of the challenge has made it a difficult one to tackle in systematic ways – and, frankly, a difficult one to fit into the REF categories that provide so much of the incentive for impact work. On one level, this can be disheartening – it’s hard to feel you’re making progress when even a top research university can only be one small factor resisting such a behemoth of a threat. But what my experience in this area has taught me is that universities are uniquely well placed to mobilise the knowledge we need to tackle this most crucial of issues. Take our Policy Commission. We took as our starting point that a transition to net zero will not be possible if it does not achieve broad social consensus – and that means an honest conversation about the costs and benefits of the transition, how they are shared, and how governments can support those groups and communities who stand to lose out. Understanding that challenge needs expertise not just on the science and technology that can help us eventually eliminate our carbon footprint, but also on the social and economic ramifications of both climate change and the changes needed to combat it, the implications for health and wellbeing, and the ways in which communication and engagement on these issues can most effectively take place. This means insight from most, if not all, academic disciplines is essential for an effective policy response. Developing the technology isn’t enough. Nor is explaining the threat to electorates around the world. Nor are free market approaches to key sectors like sustainable energy. The voices needed to solve wicked problems are legion. And this is where universities come in – because it’s only in universities that you find an established network of knowledge professionals covering every conceivable specialism, with support in place – albeit not uniformly – to help craft their specialist insight into actionable policy recommendations. Yet – as anyone who’s tried to navigate the complexities of the UN system can tell you – it can often be difficult for universities to engage with key decision makers when the policy challenge is so huge that they are diffuse, global and often unknowable by nature. Initiatives like the UK Universities Climate Change Network have begun to change this, but their impact is arguably still limited – and the voice of universities in countries in the Global South is often still entirely unheard. We are at a point now in the UK where policy impact has become fairly mainstream. We’ve had some great successes in recent years, not least with the brilliant work done under the Capabilities in Academic Policy Engagement programme that Nottingham is proud to have co-led. There is much greater understanding between academics and policy makers than there was when I started. But the next step, I believe, needs to be to take a leaf from the rhetoric of the current government and adopt a mission-led approach. Evidence-informed policy is a good thing in and of itself. But how much better would it be if we could use the platform, we’ve developed to mobilise this unparalleled resource we had – the collective knowledge of thousands of brilliant minds, both in the UK and elsewhere – to help policy makers respond to the biggest existential threat humanity has ever faced? Of course, much excellent work already takes place to do just that. But too often we work in siloed disciplines, failing to incorporate the diverse perspectives required for complete policy responses. The way in which we measure, and reward impact encourages this, rather than prompting us to collaborate across boundaries. We find ourselves responding to instrumentalist metrics, not strategic visions. We focus too much on our individual institutions, rather than mobilising our enormous collective contribution. As a sector, we’re speaking more to policy than ever before – but we’re not living up to our potential. As we move towards REF 2029 and beyond, I’d like to see us raise our ambitions – beyond helping academics write better policy briefs and navigate parliament, and towards a shared effort to tackle our biggest common enemy in a way that only we can. Thanks for reading this thoughtful opinion piece from Chris Sims. To know more about what we do, kindly send us an email at theinstitute@nottingham.ac.uk, or follow us on all social media platforms."
        }
    ],
    "pdf_files": []
}