{
    "url": "https://www.nottingham.edu.my/Politics/Student-experience/Student-testimonials.aspx",
    "content": [
        {
            "p": "Shota Tohara, Master of International Relations Shota undertook his studies as part of his placement in Malaysia with the Ministry of Foreign Affairs, Japan. “Diversity” – I believe this is a key word which most describes MA-IR at UNMC. If you feel nervous just because you do not have an IR background, there is no reason for you to worry about it. The students of MA-IR at UNMC come from a variety of countries, have diverse background, and thus can see a subject from different perspectives, which always spices up discussion in a class. Not only the students but also lecturers contribute to making the curriculum of PHIR so attractive. All the lecturers are passionate, friendly and approachable, while they have diverse teaching methods and expertise. This “diversity” among its students and lecturers taken together makes the experience at UNMC distinctively colourful. Studying at UNMC was of course not always just fun and sometimes I faced challenges as well. Being an Asian student, who was used to listen to lecturers’ “one-way talk”, it was particularly challenging for me to take part in vigorous discussion and seminar in the class. In addition, in the class, I was given a lot of opportunities to consider challenging and yet intriguing questions thrown by the lectures. Through this, I was able to see the world from various different viewpoints, which I believe is the most precious thing I could learn at UNMC.\" Lee Yan Neo, Master of Science, International Development Management Lee Yan Neo graduated with a BSc in TESL 10 years ago and now runs a tutoring centre teaching English in Johor Bahru. A self-sponsored student, she makes her weekly commute to University of Nottingham Malaysia to attend her lectures for MSc in International Development. “Aspiring to venture into a career as a scholar, being a student in University of Nottingham Malaysia has opened my mind towards the endless academic pursuits that one can desire and achieve in one's lifetime. Coming from an English Language Teaching background, the professionalism and expertise of the lecturers helped me grasp concepts with a critical mind. The MSc in International Development is built upon a well-researched selection of relevant modules to encapsulate the necessary academic and practical skills needed in the field. I am truly grateful for the opportunity and the guidance that I have received from my professors and the camaraderie formed amongst my classmates who come from a diverse countries and backgrounds. The knowledge and skills I have acquired during my time at Nottingham has helped me build a strong theoretical and research background that will be invaluable to me during my doctoral studies in the future.” Carla Prowse, Master of International Relations Carla Prowse is from Sydney, Australia. Her undergraduate degree was a Bachelor of Arts (Media and Communications) from the University of Sydney, where she majored in History and Political Science. After working in public affairs in the private sector and for the Australian Government, she decided to take her postgraduate degree in International Relations through UNMC to further her knowledge and skills in the area. \"The Masters course at UNMC offers the study of international affairs in a truly international setting. Teachers and students alike are from around the world which offers unique perspectives and insights into global affairs. This dynamic environment has enhanced my learning experience. On a practical level, the MA International Relations course offers interesting and relevant units in the field, including development studies and NGOs. The subject choice, along with the support and quality of the teaching staff, makes this programme an excellent choice for those seeking to learn more in this field.\" Mirjam Resch, Master of International Relations Mirjam Resch comes from Regensburg, Germany. After completing her undergraduate studies in the UK and France, she was part of the first cohort of the MA International Relations at UNMC. “Studying in Asia was not anything I had considered before, but when the opportunity arose, I thought ‘why not!’. I had never been to Southeast Asia and was not sure what to expect, but I came with an open mind and ready for an adventure. I was not disappointed. Malaysia is a fascinating country full of life, colour and contrast, and the Southeast Asian context provides a multitude of ready case studies for anyone with an interest in international relations. Learning with and from students from a wide variety of cultural and educational backgrounds has been an immensely enriching experience for me and has helped me look beyond my Western views and values. Small classes and enthusiastic teachers provided for a personalised and stimulating learning environment which would have been difficult to find at any university in Europe. Living, studying and travelling in the region has opened my eyes to realities text books can never adequately convey and has left me with many unforgettable experiences. In retrospect, I can say that the year spent at UNMC has been a formative one for me and has equipped me with the professional and personal sills to succeed in a truly international environment.” Farah Norzam, BA (Hons) International Relations with Mandarin Farah studied high school in Kuala Lumpur and while at Nottingham was a leading member of Phir-Nott and also participated in “The Perdana Fellows Programme” in the Ministry of Tourism and Culture. \"Studying IR at University of Nottingham Malaysia Campus (UNMC) has given me a unique learning experience that has shaped who I am today. It is unique due to the small size of the school and the ‘open door’ policy practiced by all of our well-qualified lecturers. Also, interactions in class are always insightful as my class was made up of people who grew up in different parts of the world, ensuring that discussions are diverse and often filled with fresh perspectives. Due to our close proximity to the city center, Kuala Lumpur, we have been fortunate enough to be invited to and attend high level seminars and conferences such as the Roundtable Conference on Malaysia-Cambodia/Laod/Myanmar Relations towards Strengthening ASEAN through Multi-channel Dialogue and Global Movement of Moderates: Raising ASEAN Value through the Concept of Global Movement of Moderates. Our student society, PHIR-NOTT also played a vital part in ensuring that I made the most out of my degree. We were given the liberty and responsibility to manage student events in PHIR with full support from our Head of School. My involvement with PHIR-NOTT strengthened my soft-skills as I dealt with events as well as peoples from various levels and backgrounds.\" The existence of 3 Nottingham campuses allowed me to be a 'tri-campus nomad'. In my 3 years in UNMC, I have been fortunate enough to be selected to go to Nottingham’s International Summer School in Ningbo, China and Nottingham’s Inter-Campus exchange programme in the UK where I attended the Commonwealth Youth Action Event. This gave me a truly international dimension to my international relations degree and allowed me to embrace the 'knowledge without borders' spirit of our University.” Mo Xiang, Wong, BA (Hons) in International Relations with French at the University of Nottingham Mo Xiang comes from Petaling Jaya, Selangor in Malaysia. He was previously an ASEAN School-Based Scholar and completed his Singapore-Cambridge GCE Advanced Level at Hwa Chong Institution (Singapore) under the Integrated Programme. “My BA (Hons) in International Relations with French at the University of Nottingham Malaysia Campus has been a challenging and exciting undertaking that has certainly resulted in a fruitful three years. Studying at the University of Nottingham Malaysia Campus allowed me the freedom to explore my research with expert supervision. The strength of the school lies in the people we have: the academic staff, students and support from the administrative staff. The academic staff are all experts in their field, and the relative small size of the school has cultivated a close knit family that allows us to have closer and direct interaction with our lecturers. Beyond the classrooms, I participated in conferences, lecture series and high level seminars that continuously challenged me with ideas and thoughts. We were given the liberty to initiate new activities, panel discussions and we even undertook a visit to the ASEAN Secretariat. As part of the first graduating cohort of the School, it was a humbling experience of self-discovery growing along with the school as it expands and ventures into new heights.” telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": []
}