{
    "url": "https://www.nottingham.ac.uk/politics/news-items/2024/esrc-postdoctoral-fellowships-scheme-24-25.aspx",
    "content": [
        {
            "p": "Would you like to join the School of Politics and International Relations as a postdoctoral researcher? The Economic and Social Research Council (ESRC) is now advertising its Postdoctoral Fellowships scheme for the next academic year. The scheme provides the opportunity for fellows to consolidate their PhD through developing publications, networks, grants, and research and professional skills. Fellowships will be awarded for 12 months (or 24 months part-time). Applicants must have completed their PhD at a UK university. They must have passed their PhD with at least minor corrections by 25 March 2025, with the expectation that the PhD will be awarded by the time the fellowship begins; they must have no more than 12 months of active postdoc experience by the same date. The University of Nottingham is part of the Midlands Graduate School ESRC DTP. Access more detailed and local information about the scheme, including the application form. Potential applicants are strongly encouraged to look at the research expertise of our staff and reach out as soon as possible in order to discuss your research plans. This mentor should not usually be the applicant’s PhD supervisor but should have experience and a strong interest in the applicant’s field of research. Your proposed mentor should submit an expression of interest on your behalf, in the form of your c.v. (max. 2 pages) and summary of your proposed research (max. 1 page), by 9 a.m. on Monday, 13 January to Dr Ben Holland. It is the applicant’s own responsibility to confirm their your eligibility for the fellowship. Please contact Benjamin.Holland@nottingham.ac.uk for further information regarding this scheme, but please note that E.o.Is sent directly by candidates to this email address cannot be accepted. Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}