{
    "url": "https://www.nottingham.ac.uk/policy-and-engagement/events/events-2024/science-public-lecture-10.aspx",
    "content": [
        {
            "p": "For any questions about the science public lectures, please contact Hilary Collins or the Institute for Policy and Engagement. Professor Benford aims to extend artificial intelligence to enable humans to make sense of themselves, the world, and AI as part of this world. He takes the view that meaning making arises from having experiences. He is particularly interested in experiences of art, and those felt through our bodies and emotions. He leads a research programme called Somabotics in which he collaborates with artists to create robotic artworks that provoke meaning-making and challenge foundational assumptions in AI. During this lecture, Professor Benford will reflect on a series of artworks to explore how artistic practice and thinking can transform AI. The artworks range from a breath-controlled mechanical rodeo bull; to a robot that was designed to play with cats; to dancers engaging in improvised bodily contact with manufacturing robots. He will offer a series of artistic provocations to AI: that it should be more ambiguous, positional, improvisational and playful, and argue that artists can play a vital role in bringing about more human and meaningful experiences of AI by being ‘responsibly irresponsible’. Steve Benford is the Dunford Professor of Computer Science at the University of Nottingham where he founded the Mixed Reality Laboratory and directs the Horizon Centre for Doctoral Training. He has collaborated with artists for more than thirty years, producing a series of landmark artworks that challenge our understanding of what it means to interact with computers. He champions fresh perspectives within Computer Science, deliberately embracing ambiguity and discomfort. He has been an EPSRC Dream Fellow, has won five best paper awards at the prestigious Computer-Human Interaction (CHI) conference, won the Prix Arts Electronica Golden Nica for Interactive Art, and received four BAFTA nominations. From October 2024, he will be leading a new £6.5M programme funded by UKRI called “Somabotics: Creatively Embodying AI”. This lecture is part of our monthly science public lecture series. These events showcase research from scientists at the University of Nottingham and are free and open to all! University Park Nottingham NG7 2RD t: +44 (0) 115 951 5151 e: theinstitute@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}