{
    "url": "https://www.nottingham.ac.uk/politics/people/andrew.mumford",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR Ghostwriting History: Churchill, Kennedy and the Authenticity of Authorship (2024) Journal Article Mumford, A., & Bayford, K. (2024). Ghostwriting History: Churchill, Kennedy and the Authenticity of Authorship. International History Review, https://doi.org/10.1080/07075332.2024.2316738 This article explores how ghostwritten works of history compromise the authenticity of authorship as a process and have a tainted historiographical utility as source material in international relations. Using the examples of Winston Churchill and Joh... Read More about Ghostwriting History: Churchill, Kennedy and the Authenticity of Authorship. Hybrid warfare: The continuation of ambiguity by other means (2022) Journal Article Mumford, A., & Carlucci, P. (2023). Hybrid warfare: The continuation of ambiguity by other means. European Journal of International Security, 8(2), 192-206. https://doi.org/10.1017/eis.2022.19 This article presents the study of ambiguity as the essence of hybrid warfare to reconcile it with the international political context. It addresses the gaps in the literature in an effort to elucidate the essence of hybrid warfare not as a separate... Read More about Hybrid warfare: The continuation of ambiguity by other means. Disarmament, demobilisation and reintegration (DDR) after proxy wars: reconceptualising the consequences of external support (2021) Journal Article Mumford, A. (2021). Disarmament, demobilisation and reintegration (DDR) after proxy wars: reconceptualising the consequences of external support. Third World Quarterly, 42(12), 2956-2973. https://doi.org/10.1080/01436597.2021.1981762 The phenomenon of war by proxy has received inadequate academic analysis. At the same time, an understanding of how ex-combatants are demobilised, disarmed and reintegrated into society after conflicts that have seen large-scale third-party intervent... Read More about Disarmament, demobilisation and reintegration (DDR) after proxy wars: reconceptualising the consequences of external support. The West’s War Against Islamic State: Operation Inherent Resolve in Syria and Iraq (2021) Book Mumford, A. (2021). The West’s War Against Islamic State: Operation Inherent Resolve in Syria and Iraq. Bloomsbury Publishing On the 29th of June 2014 ISIS declared the establishment of a caliphate stretching across territories in Iraq and Syria. In response, Operation Inherent Resolve, a US-led 77 nation coalition, was launched to respond to the threat of Islamic State. Th... Read More about The West’s War Against Islamic State: Operation Inherent Resolve in Syria and Iraq. Not Yet Dead: The Establishment and Regulation of Slavery by the Islamic State (2020) Journal Article Al-Dayel, N., Mumford, A., & Bales, K. (2022). Not Yet Dead: The Establishment and Regulation of Slavery by the Islamic State. Studies in Conflict and Terrorism, 45(11), 929-952. https://doi.org/10.1080/1057610X.2020.1711590 The Islamic State is an organization at the nexus of modern slavery and terrorism. This article provides the first in-depth analysis of how it regulated slavery. With a consideration of gendered approaches, it applies multiple data sources to reveal... Read More about Not Yet Dead: The Establishment and Regulation of Slavery by the Islamic State. Theory-testing Uyghur terrorism in China (2018) Journal Article Mumford, A. (2018). Theory-testing Uyghur terrorism in China. Perspectives on Terrorism, 12(5), 18-26 Analysis of terrorism perpetrated by Uyghurs inside China and the presence of Uyghur fighters in the warzones from Afghanistan to Syria has been divided as to whether such violence constitutes the alignment of Uyghur groups like the Turkestan Islamis... Read More about Theory-testing Uyghur terrorism in China. Counterinsurgency Wars and the Anglo-American Alliance: the Special Relationship on the Rocks (2018) Book MUMFORD, A. (2018). Counterinsurgency Wars and the Anglo-American Alliance: the Special Relationship on the Rocks. Georgetown University Press Terrorist learning: a new analytical framework (2016) Journal Article Kettle, L., & Mumford, A. (2017). Terrorist learning: a new analytical framework. Studies in Conflict and Terrorism, 40(7), 523-538. https://doi.org/10.1080/1057610X.2016.1237224 Terrorists learn every day to gain further knowledge on how to achieve their violent objectives. Consequently, understanding terrorist learning forms a crucial part of the fight to counter terrorism. However, whilst existing literature within terrori... Read More about Terrorist learning: a new analytical framework. Parallels, prescience and the past: analogical reasoning and contemporary international politics (2014) Journal Article Mumford, A. (2015). Parallels, prescience and the past: analogical reasoning and contemporary international politics. International Politics, 52(1), https://doi.org/10.1057/ip.2014.40 Analogical reasoning has held a perpetual appeal to policymakers who have often drafted in historical metaphor as a mode of informing decision-making. However, this article contends that since the beginning of the ‘War on Terror’ we have arguably see... Read More about Parallels, prescience and the past: analogical reasoning and contemporary international politics. Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}