{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/addressing-nutritional-insecurity-in-nottinghamshire",
    "content": [
        {
            "p": "Bridging the gap between data and policy Food security is a growing concern across the UK, with many communities, especially those in economically disadvantaged areas, facing significant challenges in accessing nutritious food. While local authorities often bear the responsibility of addressing this issue, they frequently lack the precise data needed to develop effective, targeted policies. At the University of Nottingham, Simon Welham and his team in the Biosciences department have been at the forefront of research on food insecurity, particularly during the COVID-19 pandemic. Through their work, they have highlighted the critical nutritional impact on those living in poverty and are making strides in shaping local policies to better support vulnerable populations in Nottinghamshire. During the COVID-19 pandemic, the stark reality of food insecurity became even more apparent, exacerbating existing inequalities and exposing the fragility of many families’ accesses to adequate nutrition. Simon Welham’s team undertook pivotal research that provided a detailed analysis of the state of food insecurity during this period, examining not only the prevalence but also the nutritional implications for those most affected. Using QR-PSF funding, Simon expanded his work to focus specifically on Nottinghamshire, aiming to dig deeper into the root causes of food insecurity beyond just income levels. The team generated high-resolution mapped data, identifying local nutritional deficits and the key drivers behind them, which varied significantly across the county. Their research offered a granular view of where the most pressing needs lay, whether in urban centres or rural communities, and assessed the nutritional value of food provisions supported by local councils. This data not only painted a clear picture of the local situation but also provided actionable insights that local authorities could use to tailor their interventions. The impact of Simon Welham’s research extends beyond data collection; it is about transforming evidence into action. The findings from his team were incorporated into the Nottinghamshire County Council’s Joint Strategic Needs Assessment for food security (Notts. JSNA 2024), providing a foundational resource for local policy makers. This integration of research into policy planning is crucial, as it ensures that the voices of the most vulnerable are considered in decision-making processes. Simon’s work has been shared with city council public health officials, financial resilience teams, procurement officers, and local food providers. By engaging directly with these stakeholders, Simon and his team have facilitated a dialogue that bridges the gap between academic research and practical policy solutions. Currently, Simon is working to further disseminate these findings among county councillors and the public health team, ensuring that the data not only informs but also drives change. What made Simon Welham’s project particularly impactful was its clear focus on policy engagement. From the outset, the team identified a critical knowledge gap among local authorities and tailored their research to meet these specific needs. By establishing a concrete point of engagement with the policy-making process, Simon’s team was able to ensure that their work was not only relevant but also instrumental in guiding policy decisions. The success of this project lies in its human-centred approach: understanding the lived experiences of those facing food insecurity, translating that into data, and then using that evidence to influence policies that can make a tangible difference. This approach serves as a model for how academic research can effectively intersect with policy to create meaningful change in communities. Simon Welham’s work exemplifies the power of targeted research in addressing critical societal issues like food insecurity. Through rigorous data collection and strategic policy engagement, Simon and his team have provided Nottinghamshire with the tools needed to better understand and combat nutritional deficits in its communities. Their efforts have laid the groundwork for policies that not only acknowledge but actively address the complex factors contributing to food insecurity. As this research continues to inform local strategies, there is hope that the insights gained will lead to significant improvements in the lives of those struggling to access nutritious food in Nottinghamshire. This story of impact is not just about numbers and data; it's about people—the families who now have a better chance of meeting their nutritional needs, the local authorities equipped with the knowledge to make informed decisions, and the community at large that stands to benefit from more effective food security strategies. Simon Welham’s research is a testament to the critical role that academic work can play in driving policy and creating positive societal impact. Thanks for reading this impact story from Simon. To know more about what we do at the Institute, kindly send us an email at theinstitute@nottingham.ac.uk, or follow us on all social media platforms."
        }
    ],
    "pdf_files": []
}