{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/is-political-apathy-threatening-democracy",
    "content": [
        {
            "p": "Why people don’t vote and what can be done about it Voter engagement has been declining across the globe since the beginning of the 1990s and this growing trend has been raising many concerns amongst policymakers, researchers, and elected officials. In this blog, Dr Christopher Pich explores the decline in voting and the impact it has on our democracy and how democratic organisations can re-engage voters. The number of people engaging in electoral processes is an indicator of democratic health and the rise in voter disengagement, cynicism; and a widening disconnection between voters and electoral participation across the board paints a bleak picture for how our democracies are currently functioning. If voter disengagement continues to rise, it poses a direct threat to the integrity of elections and electoral democracy, the stability of governance of states as well as empowering disruptive narratives that speak to people who feel underrepresented. Voting is a complex and dynamic process involving not only behavioural but also emotional, and cognitive factors at different levels of engagement. To add to this, voters often develop their political attitudes, feelings and behaviours through time and reflect across their journey, existing research suggests that individuals can meander from engagement to disengagement from political event to political event so it is crucial that we continue to monitor this dynamic and ever-changing journey as it could highlight ways that we can strengthen voter engagement and subsequently our democracy. Initiatives to try and re-engage disengaged voters can be counterproductive if currently engaged voters become disengaged in the future so it is important for policymakers to focus on currently engaged voters as well as disengaged ones. Therefore, studying voter engagement over time is crucial for researchers and practitioners to identify potential solutions and interventions to barriers to disengagement, which include the rise in apathy, cynicism, and disillusion with the voting process. Studying voter engagement, disengagement and re-engagement is more important than ever but continues to be an under-developed and under-represented area of study which is where our Jersey Project comes in. According to Ledgerwood and Lally (2024), the number of people engaging in the electoral process is an indicator of democratic health. However, voter disengagement, cynicism and widening disconnection between voters and electoral participation is on the rise and this trend is not restricted to one jurisdiction In fact, voter engagement has been declining across the globe since the beginning of the 1990s and this growing trend raises many concerns among policymakers, researchers, and elected officials. For instance, if voter disengagement continues to rise, it poses direct threats to the integrity of electoral democracy, the stability and governance of states and empowers disruptive ‘voices, ideologies, and messages’. Therefore, research examining voter engagement, disengagement and re-engagement remains a priority issue and an under-developed and under-researched area of study. Nevertheless, the voter journey is a complex, dynamic, and multifaceted process and this topic deserves ongoing attention and routine investigation. For example, researchers have acknowledged that voter engagement involves not only behavioural but also emotional and cognitive dimensions and different levels of engagement. In addition, voters often develop their political attitudes, feelings and behaviour through time and embark on a reflective journey often transitioning from different levels of engagement across political events, which in turn can impact engagement at future political events. Existing research suggests the voter journey is subject to change and individuals can meander between engagement-disengagement from political event to political event and it is crucial to continue to monitor this dynamic ever-changing journey as this could highlight mechanisms to strengthen electoral democracy. Furthermore, policy makers, strategists and researchers should not prioritise disengaged voters and forget to continue to reach out to engaged voters. Otherwise, the strategies and initiatives introduced to appeal to disengaged voters may be counterproductive, particularly if engaged voters become disengaged in the future, which would have an adverse impact on voter turnout in future elections. In my recent research with The Crown Dependency of Jersey, we have identified barriers to engagement as well as uncovering opportunities for re-engagement. The Crown Dependency of Jersey experienced the lowest voter turnout among members of the Organisation for Economic Cooperation and Development (OECD) and continued a low trend of engagement with growing disconnection in national elections. Turnout in the 2022 general election was 41.6%, down from 42.3% in 2018 so we explored some of the reasons for this. Some of the barriers included: During the research, we found that outreach programmes designed to raise awareness and understanding of voter engagement and civic responsibility were practically non-existent as well as being disconnection and inconsistent across institutions (i.e., schools, colleges and other educational establishments) in Jersey. Furthermore, we heard from voters, educational specialists and elected officials a need to develop and co-create long-term educational outreach programmes on voter engagement. For example, it was argued “it all starts with education. The current provision for for five specific groups in Jersey: 1. young voters 2. newly qualified voters 3. returning islanders 4. apathetic voters 5. engaged voters The programmes should be co-developed with a range of stakeholders including elected officials, industry specialists, and importantly voters. The co-developed programmes will result in an island-wide curriculum for institutions in Jersey, which will ensure consistency, strengthen the current provision, and provide greater accessibility and transparency for voters. Once developed, the targeted voter engagement programmes will be led by a series of “Voter Engagement Champions”. Thanks for reading this insightful article from Dr Christopher Pich, Associate Professor in Marketing at Nottingham University Business School. To know more about our work at the Institute, send us an email at theinstitute@nottingham.ac.uk, or follow us on all social media platforms."
        }
    ],
    "pdf_files": []
}