{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/the-interconnected-worlds-of-policy-impact-and-public-engagement-reflections-from-the-institute-for-policy-and-engagement",
    "content": [
        {
            "p": "When the Institute for Policy and Engagement was established in 2018, I believe we were the only university in the UK that combined support for researchers interested in both public engagement and policy impact into one central, dedicated unit. Traditionally, policymakers and the public were seen as distinct audiences for knowledge exchange, often addressed through separate avenues. However, our approach has always been grounded in the belief that the two are inextricably linked, especially when it comes to driving meaningful, long-term change. Since then, our experience and the evolving political landscape have only reinforced the importance of this approach. From the ongoing challenges presented by global crises to the increasingly devolved decision-making in the UK, the lines between public engagement and policy impact have become beautifully blurred. In this post, I will explore the rationale behind bringing these two spheres together, reflect on the lessons learned over the past few years, and offer insights into how this model can inspire universities and research institutions to think differently. In 2019, I wrote a blog post outlining why it made sense to collocate support for public engagement and policy impact within our Institute. At the time, universities—like many other institutions—tended to assume that shaping policy was a straightforward matter of providing policymakers with compelling, rational evidence. While this may hold true for smaller, more technical decisions, the reality is far more complex when addressing larger, more strategic policy questions. For big, difficult decisions, evidence is just one piece of the puzzle. Policymakers must weigh factors such as the costs and benefits, competing priorities, political values, and—critically—public support. Even when the evidence points towards a certain course of action, a policy can fail if it doesn't resonate with the public or align with broader political goals. Academics and activists often urge politicians to be brave when the evidence is clear. While good politicians strive to lead public opinion rather than simply follow it, they also face the challenge of ensuring their actions have broad public understanding and support. Without that, even the best-intentioned policies risk being derailed by a lack of trust or support, ultimately preventing meaningful change. Public understanding and trust are vital for driving policy change—something that has become even more evident in recent years. The COVID-19 pandemic, for example, illustrated the delicate balance between political leadership, scientific evidence, and public trust. It revealed how critical it is to foster public confidence not just in the decisions being made, but in the process of decision-making itself. The pandemic also demonstrated that the public can engage with and understand uncertainty, as long as they trust the people and institutions guiding them. The scientific process often involves debate, revision, and the acknowledgment of uncertainty, and when this is communicated transparently, it can build rather than erode trust. However, when politicians or other actors overclaim, hide behind science, or act in bad faith, trust is easily squandered. This experience reinforces the idea that public engagement is not just a courtesy but a crucial element of policy success. It’s a reciprocal relationship: for researchers aiming to shape complex policy decisions, engaging with the public helps build the trust and understanding necessary to support difficult changes. In this sense, public engagement becomes a form of public service, empowering citizens to actively participate in shaping the policies that affect their lives. While much of the conversation about policy impact focuses on national or international decision-making, some of the most significant developments often happen at the local level. Public engagement projects frequently evolve into initiatives with a tangible policy dimension, especially when they involve direct interaction with communities. In many cases, engaging the public in research—whether through citizen science, co-creating research questions, or simply sharing findings—leads to real-world changes in how things are done, or shifts in public attitudes and perceptions. A notable example of this can be seen in Shaun French’s work on indebtedness in Nottingham’s most deprived communities. His research, conducted with and for the local population, has led to a better understanding of the challenges faced by these communities, sparking policy discussions and potential changes at both local and regional levels. Similarly, the University’s *City as Lab* initiative has provided local leaders and communities with valuable data and visualisation tools to better understand and address the needs of the people they serve. As the UK government continues its focus on devolving power to local authorities, these kinds of engagement projects are poised to become even more significant. By bringing decisions closer to the communities they affect, we have an opportunity to empower citizens, promote transparency, and ensure that policy decisions are informed by both evidence and lived experience. The University of Nottingham’s recent recognition—a Silver Watermark from the National Coordinating Centre for Public Engagement (NCCPE)—is a testament to the success of our integrated approach. One of the key aspects highlighted was our ability to unite policy impact and public engagement support under one framework. While the two are not identical, and not all public engagement needs a policy dimension (nor does all policy engagement need to be public-facing), we have found that these domains often intersect in meaningful ways. When they do, the results can be transformative."
        }
    ],
    "pdf_files": []
}