{
    "url": "https://www.nottingham.edu.my/Politics/Newsletter/Issue-2-2015/Faculty-news.aspx",
    "content": [
        {
            "p": "Amadeo Policante’s recent book The Pirate Myth has received an important review in Radical Philosophy, one of the most important bimonthly academic journals of critical theory and the history of political thought. The journal can be found at https://www.radicalphilosophy.com/. The review is at http://www.radicalphilosophy.com/wp-content/files_mf/rp195_reviews.pdf. Amadeo is also starting a new module on Piracy and the History of the International System at Nottingham, which has been introduced by Harry Cocks: https://blogs.nottingham.ac.uk/historypastandpresent/2015/09/09/the-pirate-myth-genealogies-of-an-imperial-concept/ This semester Josh Snider is coordinating two modules: 'Power and Contest: Living in a political world' and International Security. In addition, he is busy with a variety of research projects including editing a forthcoming special issue on the theme of migration goverance in Southeast Asia in the International Journal of Migration and Border Studies. Linda Quayle spoke at the Liberalism Conference in September 2015, organized by IDEAS, as part of the panel debating the question: 'Economic liberalism: curse or cure?' In November, she spoke on the topic of the ASEAN Community at the annual meeting of the ASEAN Youth Leaders' Association, hosted for the first time by the newly formed Malaysian branch. Linda has also contributed to Mushamir Mustafa's piece on ASEAN in the Malaysian Digest (http://www.malaysiandigest.com/features/581248-it-will-take-a-generation-to-see-ourselves-as-asean-experts-deliberate-on-the-new-asean-community.html) In December, Linda gave a paper at the Consortium for Southeast Asian Studies in Asia (SEASIA) conference in Kyoto, Japan. Entitled 'Intersecting trajectories: Indonesia and the ASEAN Socio-Cultural Community', the paper mapped the ways in which Indonesia's leadership aspirations and ASEAN's community aspirations relate to each other in the areas of migration, the environment, and disaster response. Finally, Linda has a chapter (entitled 'Falling Between Two Stools? Malaysia's Post-Mahathir Profile in International Society') in the recently published Malaysia Post-Mahathir: A Decade of Change?, edited by James Chin and Joern Dosch (http://www.marshallcavendish.com/marshallcavendish/genref/Malaysia-PostMahathir_B920_Singapore.aspx). Michael Connors has been working hard on an ominously titled article \"Cultural Policy as General Will and Social-Order Protectionism: Thailand’s conservative double movement.\". This will be published in 2016. At the beginning of this year he was invited to join the International Advisory Board of Asian Review for the period 2016-2020, a peer reviewed journal published by the Institute of Asian Studies, at Chulalongkorn University, Bangkok. He is looking forward to stepping down as PHIR's Head of School in July 2016 and working on a book project that is long overdue. In September 2015 Michael was a co-organizer on behalf of the Institute for Asia Pacific Studies of a major conference in KL on the topic of liberalism. His opening remarks may be viewed at https://www.youtube.com/watch?v=noJqVkqRtBA. There were lots of interesting speakers presented on the day and you are invited to explore the related videos. Sumit Mandal spoke about life and work of Benedict Anderson on BFM Radio in Kuala Lumpur. Mandal was interviewed by Sharaad Kuttan on the station’s programme “Night School” in a tribute to Anderson, a renowned scholar of Southeast Asia and nationalism who passed away on the 13th of December 2015. A podcast of the discussion is available at http://goo.gl/ulSs05. In the Autumn semester of 2015 Trevor Parfitt took a study leave at the Asian Institute of Technology in Pathumthani just outside of Bangkok. He was attached to the Gender Studies and Development Programme and to the Rural and Regional Development Programme at AIT. He delivered three public lectures during his stay at AIT on such issues as neoliberal paradigms of development and development ethics. These were well received and complemented the content of the two programmes. Parfitt also took part in doctoral proposal presentations at Chulalongkorn University and in a postgraduate conference at AIT during his stay. He was able to pursue and deepen his conception of his current research interest in technics and development, producing two draft articles and beginning the development of a project that will take the form of a monograph. Patrick O’Reilly is a Post-Doctoral Fellow in PHIR seconded to Crops for The Future where leads the Social Economic and Policy Research Theme collaborated with Tinashe Kitchen, a graduate of the MSc International Development Management programme, to publish a paper based Tinashe’ MSc dissertation. The paper is entitled ‘Energy poverty amidst abundance in Malaysia: placing energy in multidimensional poverty’ and has been published in the well known international development journal, Development in Practice, Vol. 26, No. 2, pp.203-213. The link for this article is as follows: http://dx.doi.org/10.1080/09614524.2016.1133562. Francesco Stolfi is away on sabbatical this semester. Guy Burton has been writing up the material he collected from last summer on the role of the BRICS in the Arab/Israeli conflict. He will be presenting some of this work at the Midwest Political Science Association conference in Chicago. His article on the Palestinian political economy inside Israel and the occupied territories came out in Middle East Critique in January. Two other articles are scheduled for publication in the first months of 2016: one on the Palestinian youth movement during the Arab Uprising and the other on China’s past and present engagement with the Arab/Israeli conflict. He has also been invited to present on Palestinian perceptions regarding China at a China and the Middle East conference at Nottingham’s UK campus in May. telephone: +6 (03) 8924 8253 fax: +6 (03) 8924 8019"
        }
    ],
    "pdf_files": [
        "pdf_files/rp195_reviews.pdf"
    ]
}