{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/welcome-to-our-2024-25-iap-cohort",
    "content": [
        {
            "p": "On Wednesday 16th October, we welcomed our 2024-25 cohort to the Institute Academy Programme. For the first time since the start of the programme four years ago, we have representation from all faculties across the University of Nottingham. The Institute Academy Programmes provide tailored training opportunities for staff across the university looking to develop their policy or public engagement skills. There are three programmes for our academics: Policy Impact Pathways Programme (PIPP), Policy Impact Accelerator Programme (PIAP) and Civic Impact Champions Programme (CICP). Successful applicants receive access to carefully tailored training and networking opportunities, helping them to engage with external audiences on a local, national, and global scale to maximise the impact of their research. They are also provided with funding, for a related project, to enable them to put the skills they develop into practice. Our director, Stephen Meek started the welcome event with an opening speech, reminding the cohort of the opportunities to learn not only from the programme lead but also from each other. The IAP programme leaders Tiffany Trundell (PIPP/PIAP) and Sally Nightingale (CICP) then went into the schedule of the programme, detailing what will be covered within the training sessions. The CICP programme will feature training sessions on local government structures, stakeholder mapping and understanding the locality and role as a civic researcher. The cohort consists of five academics. Susanne Seymour and Sam Booth are from the faculty of Social Science, Hongwei Bao from the faculty of Arts, Luke Norman from the faculty of science and Emma Campbell from the faculty of Medicine. Throughout the programme, the PIPP and PIAP cohorts will explore the foundations of policy making, stakeholder mapping and events for policy shareholders. In the PIPP programme, there’s a large representation from the faculty of social science including Alanna Higgins, Catherine Price, Social sciences, Minjia Chen and Scarlett McAdle. Alison Tidy is also on the programme from the faculty of science. In the PIAP programme, we have our cohort from the faculty of Engineering, Ruth Goodridge. Hang Le and Simon Toubeau are both from the faculty of Social Science and Max Wilson is from the faculty of science. With the programme now underway, our cohort will begin their bespoke training sessions over the next month plus further joint events throughout the academic year. The training programmes will conclude with a summer celebration in July, reflecting on the work and lessons learned on the programmes and the impact of the research. Over the year, we will also be sharing a series of blogs from members of this year’s cohort in which they talk about their research and projects, as well as their experiences on this year’s programme so look out for further updates soon to learn more! This blog was written by Phillipa Abery. If you have any questions about the Institute Academy Programme, please email me directly, phillipa.abery@nottingham.ac.uk. For all general queries, please email theinstitute@nottingham.ac.uk."
        }
    ],
    "pdf_files": []
}