{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/foregrounding-communities-in-our-public-engagement-through-partnerships",
    "content": [
        {
            "p": "In praise of community partners In this article, Maria Richards, Head of Public Engagement at the Institute explores the importance of maintaining community partnerships to ensure our research can deliver meaningful change through projects that foreground public engagement. At the Institute for Policy and Engagement we focus on public engagement with research. This is a core part of knowledge exchange, a fundamental element that demonstrates our contribution to wider society. As practise has evolved, it’s become about much more than just the dissemination of knowledge. While public lectures and focus groups are valuable (often incredibly so), public engagement goes much further than that. It’s about involving members of the public throughout the research process, from motivation and design, through development and implementation, and into the results and ongoing impact. Public engagement is public inclusion, a move away from ‘doing’ research on communities. Often the key to a successful public engagement project is the right project partner. The legacy of co-creating research should be an enduring relationship, enhanced understanding and new ways of working. But facilitating effective co-production with communities is a skill that takes time to learn. It requires a commitment to listen, to earn trust and to be able to demonstrate how you have responded to feedback. Here at the Institute, we support people to build these relationships and attempt new approaches. We work with researchers who are open to being challenged, to reconsidering their arguments, and to reworking plans if things don’t go smoothly. University researchers strive to achieve positive social impact and improve the lives of individuals. Over the last ten years there has been a positive shift towards ensuring such work is informed by the needs of communities and partner organisations. The benefits to this approach are manifold and increasingly being seen as central to a healthy research culture. Given that these relationships take years not months to build, we are increasingly working with community organisations to help us maximise impact. The Institute has a number of important stakeholders who help us unpick emerging trends. They help ensure that we can reach those who have had little prior contact with higher education and identify local need. As a new academic year begins, we would like to take a moment to celebrate these relationships and recognise how important it is for universities to become part of the local ecosystem. These few examples demonstrate what we can achieve if we are truly open to collaboration and change and how both grassroots and strategic partners are vital. The Institute team work directly with city council partners on various projects. Sometimes these are public facing, such as our partnership with Wollaton Hall allowing us to deliver Science in the Park to over 1,400 children and their families every year. Many times we make longstanding commitments to delivering programmes. One example is our support for the city’s journey to become recognised as a Child Friendly City by UNICEF. Being a project supporter brings us into regular contact with others who work directly with children and young people across the region. Partnership days bring us into contact with specialists in education, community policing, youth service provision and the arts. It allows us to benefit from training and insight from the UNICEF team regarding taking a child’s rights approach to our work. Most importantly it allows us to connect partners with academics who have insights into specific areas, or help them gain access to members of university staff who can assist with specific problem solving. Green Hustle is a Community Interest Company that reconnects urban citizens with nature through an inclusive festival. Working with the passionate team behind this initiative has allowed us not only to reach new audiences on festival days, but to become part of a bigger community of practise. Stakeholder meetings provide a forum for members to share ideas, highlight new activity and look for synergies. In 2024 we worked with company directors to not just source researchers to host stalls, but to run projects that had more of a lasting legacy. Writing a funding call and guidelines for these projects allowed us to learn what mattered most to Green Hustle and to help them understand our need for projects to combine engagement and research. As a result of sharing contacts, researchers in biosciences were able to join up with Honeybee Farmacy and expand the edible campus project to include a primary school. Another important partner is the educational charity Ignite Futures. UoN academics were present at ten of the events that formed the 2024 Festival of Science and Curiosity. For many young people the interaction with scientists the charity convenes is the first time they have spent time with a chemist, astronomer or medical researcher. The charity gains access to researchers willing to host workshops and activities in schools and libraries, but in return less experienced staff get to talk through their ideas and hear what has and has not worked in the past. Access to expert knowledge flows in both directions and is why the festival will be celebrating its tenth anniversary in 2025. Thanks for reading this thoughtful opinion piece from Maria Richards. To know more about what we do, kindly send us an email at theinstitute@nottingham.ac.uk, or follow us on all social media platforms."
        }
    ],
    "pdf_files": []
}