{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/2023-24-in-pictures",
    "content": [
        {
            "p": "We’ve come to the end of this financial and academic year and what a year we’ve had! We’ve highlighted our top 10 moments in pictures. Take a look at what we’ve achieved in 2023-2024. We launched a policy commission to investigate a just transition to net zero. The commission, chaired by Lord Watson alongside Professor Lucelia Rodrigues from the University of Nottingham, will call expert witnesses from a range of sectors to analyse who benefits from a transition; the role and position of communities in a transition; and how to realise that transition. This year’s Science in the Park saw another sold out event at Wollaton Hall with 1,500 visitors, 23 STEM based exhibits, 48 UoN student volunteers on the day. In June, the Green Hustle festival reminded us of why we need to inspire people and businesses to adopt sustainable practices that will make Nottingham a greener place to live, study, and work. We were thrilled to have helped fund the festival and support University of Nottingham academics taking part in the festival. Our Institute Academy Programme have had an extremely successful year. The Civic Impact Champion Programme (CICP) made its debut, joining our PIPP (Policy Impact Pathways Programme) and PIAP (Policy Impact Accelerator Programme). The programmes concluded in July with a Showcase and Celebration event, hosted at Jubilee Campus. For more information on the programmes take a look at our previous blog. This year marks our fifth year of our Institute awards, congratulations to all our winners and runner ups. For more information on the winners and runners up, read our latest award blog. We hosted a Youth Voice workshop in May with City as Lab in partnership with Nottingham City Council and Nonsuch Studios. This workshop provided an opportunity for experienced youth survey creators to collaborate on producing ideas for UNICEF's child-friendly Nottingham programme survey, set to go live later this year. As apart of the Byron 200 celebrations this year, we hosted a Byron 200 Lecture, in collaboration with Newstead Abbey, Nottingham City Council, Lakeside Arts and Nottingham City of Literature. We also funded information panels in the garden of Newstead Abbey. We later recorded an episode of our podcast, Knowledge, Engaged, at Newstead Abbey, Byron’s family home, and interviewed Dr Sam Hirst, a University of Nottingham research fellow as well as three volunteers from Newstead Abbey, to talk about Byron, his poetry and Dr Hirst's efforts at bringing Byron’s history to life for the public. In December last year, we were honoured with the prestigious Silver Engage Watermark by the National Co-ordinating Centre for Public Engagement (NCCPE). This award not only validates our dedication to involving the public in our work but also reinforces the importance we place on driving impact through knowledge sharing, teaching, and research. Ending stagnation; the role of cities like Nottingham in boosting economic prosperity across Britain. In February, we hosted the Resolution Foundation Economy 2030 talk at Cleaver and Wake in Nottingham city centre. The speakers included Gregory Thwaites, Research Director at Resolution Foundation (chair), Alex Clegg, Economist at Resolution Foundation, Mel Barrett, Chief Executive of Nottingham City Council and Nora Senior, chair of East Midlands Freeport. In October, we hosted a lecture by Professor Anand Menon, a professor of European Politics and Foreign Affairs at King's College London as well as Director of UK in a Changing Europe. The lecture was followed by a dinner with a select group of academics at the university. Thank you to all the academics, local communities, businesses and the general public who we have worked with, attended our events. We cannot wait to see what happens in the 2024-25 academic year. This blog was written by Phillipa Abery. If you have any questions or queries regarding the Institute for Policy and Engagement, please email out team."
        }
    ],
    "pdf_files": []
}