{
    "url": "https://www.nottingham.ac.uk/politics/study/undergraduate/index.aspx",
    "content": [
        {
            "p": "Rapid changes in domestic, regional and global politics have a daily impact on our lives, from traditional party politics to new forms of direct action in global settings. At the University of Nottingham, you are taught by the leading specialists in the most current developments in comparative and global politics as well as political theory. The school has particularly strengths in the fields of security, social and global justice, international history, and comparative British politics. We offer the following single and joint honours undergraduate degree programmes: This course will sharpen your awareness of current affairs and your comprehension of the complex processes that underpin our society. This course has a focus on developing advanced quantitative methods skills of data collection and analysis. This course includes a year abroad and will give you insights into the latest international relations developments between Asia and the rest of the world. This course provides you with the tools to address key political and security issues of our time and devise strategic solutions to a complex geopolitical environment. Undergraduate students can apply to study abroad for one semester or one year (on some courses). School study abroad options Justin talks about his Politics and Economics BA. Chelcy talks about her politics degree. We offer pre-sessional English language courses to improve your language level to meet the entry requirements for your degree. There is continued support while you study with us, with courses, consultations and drop-ins available. English language support Explore our campuses, accommodation and student life online. You can also discover campus life with 360 degree images and videos on our virtual tour. Visit our open days hub Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}