{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/public-engagement-on-a-robotic-scale",
    "content": [
        {
            "p": "How over 700 people joined us for Future Makers: Robotics and Emerging Technology at Nottingham Central Library On the 23rd of October, Nottingham Central Library became a hive of technical discovery as over 700 people joined us for Future Makers: Robotics and Emerging Technology. Here’s how our public engagement team curated and delivered this brand-new event: A key decision in planning any event is choosing the right venue. It sets the scene for the day and the backdrop for the exhibitors and visitors experience. Thanks to an on-going partnership with Nottingham City Council and Stem City Nottingham, we had the privilege of hosting Future Makers at the newly opened Nottingham Central Library. Located in the heart of the city and spread across three floors, this modern space provided the ideal event backdrop for exhibitors and visitors. While state-of-the-art technology within the library’s 360 immersive room meant that children could be transported into a microscopic world with an array of magnified images of everyday objects shown in detail as part of the University’s Nottingham Under the Microscope project. A huge thank you to the Nottingham Central Library team for their invaluable support in helping to plan and deliver this event. Interactive events thrive with the right exhibitors and Future Makers was no exception. University researchers introduced attendees to the latest in robotics and technology as well as basic coding principles, while the Institute hosted several hands-on craft activities, including squishy circuits and badge-making. One of the main attractions at the event was the University’s pioneering Cobot Maker Space who brought along their family of robots including Robin, a humanoid style robot with poseable head and arms and Spot, a Boston Dynamics dog-like mobile robot. On the second-floor visitors could pilot robots in a pop-up area alongside the legendary House Robot Matilda from UK TV show Robot Wars. Open to all ages, but primarily aimed at children and families aged 7-16, the event focuses on supporting Nottingham’s journey to be recognised as a UNICEF UK Child Friendly City by making academic research freely accessible to all ages. As a result, we were honoured to welcome the Mayor of Nottingham, Councillor Carole McCulloch, a key advocate for children’s activities in the city who toured each floor and interacted with exhibitors and family visitors. As with other large scale public events within our annual public programme, Future Makers was supported by University of Nottingham student volunteers. They played a crucial role in helping to manage children’s activities, direct visitors and gather visitor feedback throughout the day. “It was an exciting and insightful event; I am very glad I was a part of it being a success” - Volunteer feedback after the event. A big thank you to the whole Institute team who, as always, pulled together to deliver a seamless and engaging experience for all attendees. Feedback was overwhelmingly positive, with nearly 94% of respondents reporting that the event helped them better understand robotics and emerging technology. Many noted how the hands-on activities and friendly volunteers created an inspiring atmosphere. One visitor shared, “My daughter and I learned so much. The way complex information was presented made it accessible and engaging. We both feel more confident about STEM now and want to keep learning!” In addition, 74% of visitors expressed that their view of the University of Nottingham had improved as a result of their experience at Future Makers. This reinforces the event’s impact not only as an educational tool but also as a way to foster local civic appreciation for academic research. Following the success of this year’s event, Future Makers is set to return next year with new themes and improved programming based on feedback from visitors. For more information on future events, and to stay updated on public engagement and policy impact news, sign up for our newsletter or follow us on social media. This blog was written by Sally Nightingale and Phillipa Abery. If you have any questions about the Future Makers or general queries for our Public Engagement team, please email Sally Nightingale on sally.nightingale@nottingham.ac.uk. For all general queries, please email theinstitute@nottingham.ac.uk."
        }
    ],
    "pdf_files": []
}