{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/connecting-research-and-policy-to-enhance-maths-education-in-the-uk",
    "content": [
        {
            "p": "Supporting the launch of the new observatory for mathematical education: a Policy Impact Pathways project The launch of the new Observatory for Mathematical Education marks a significant step towards addressing the disparities in maths attainment across the UK. Dr Christopher Brignell, Associate Professor at the University of Nottingham, through the Policy Impact Pathways Programme (PIPP), aims to bridge the gap between research and policy-making, ensuring that the insights from the University of Nottingham’s longitudinal studies inform effective educational strategies and interventions. Dr Christopher Brignell joined the Policy Impact Pathways Programme (PIPP) with the aim of connecting specific and relevant research from the University of Nottingham’s new Observatory for Mathematical Education to policymakers. This initiative is designed to inform policy decisions regarding the maths curriculum and outreach in the UK. The Observatory is pioneering a longitudinal research programme, collaborating with 300 schools and over 30,000 students. This integrated analysis of various aspects of the maths education system aims to inform initiatives, interventions, and practices at multiple levels. Currently, there is a significant disparity in maths attainment levels among individuals from different demographics, with class, gender, and ethnicity playing major roles in these gaps. The Observatory’s research will identify barriers to better attainment in maths education and highlight specific patterns and areas for improvement, providing targeted policy recommendations. The Observatory is set to launch its first report this year. As part of the preliminary work, Dr Christopher Brignell conducted a stakeholder mapping exercise, leading to a breakfast policy meeting at The Royal Society on May 17, 2024. This meeting brought together policymakers and industry specialists to discuss three key areas: The roundtable discussions focused on identifying what is currently working, what isn’t, and the gaps in evidence and research needed to inform practical policy decisions for the future of maths education. The goal was to align the Observatory’s evidence with the needs of policymakers, fostering a collaborative approach that allows policymakers and industry specialists to contribute to the research plans. This successful meeting expanded the Observatory’s reach to new policymakers in different jurisdictions, opening new opportunities. For example, Bridget Phillipson MP discussed the Observatory’s work with the New Zealand Minister of Education, facilitating connections between the UK and New Zealand counterparts. The Observatory will launch its first report this autumn, with plans for future policy-focused events in development. We will bring you more updates as this project progresses. In the meantime, you can learn more about how we are supporting academics to impact people and influence policies on our website. To learn more about the Institute, please send us an email at theinstitute@nottingham.ac.uk, or follow us on our social media platforms."
        }
    ],
    "pdf_files": []
}