{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/providing-pathways-and-opportunities-for-sex-worker-justice",
    "content": [
        {
            "p": "Supporting safer experiences for sex workers in Nottingham: A Policy Impact Accelerator Programme project Sex work in the UK, while legal, is fraught with challenges due to the criminalisation of many associated activities. This precarious legal landscape fosters a climate of fear, deterring sex workers from reporting violent crimes. In Nottingham, Dr. Larissa Sandy, Associate Professor in Criminology, and the charity POW are addressing these safety concerns through a British Academy Innovation Fellowship. Their initiative aims to enhance access to justice for sex workers and promote policy discussions on decriminalisation, striving for a safer and more equitable working environment. The legal paradox: navigating sex work in the UK Sex work in the UK remains a legal yet precarious profession, burdened by the illegality of many related activities such as workers operating together, advertising, and communicating with clients. This has led to a climate of fear, where sex workers are hesitant to report violent crimes due to concerns about arrest, stigma, and discrimination. Studies suggest that street-based sex workers face an alarming rate of violence, being twelve times more likely to die from workplace violence than other women. The fractured relationship between law enforcement and sex workers has exacerbated these challenges, leading to low reporting rates and inconsistent experiences in accessing justice. In Nottingham, efforts to address these safety concerns have taken shape through the collaborative work of Dr. Larissa Sandy and the local charity POW. With a focus on empowering sex workers and facilitating access to justice, this project aims to reform the systemic inequalities they face, laying the groundwork for a more just and secure working environment. Innovation for safety: a new tool for justice Dr. Larissa Sandy has spent the last year working with local charity, POW, who provide support and advice for sex workers in Nottingham, designing a new safety tool for sex workers as part of her British Academy Innovation Fellowship. A series of design workshops as part of the participatory research programme with sex workers helped to design and construct the tool which will improve sex workers' access to justice as they will be able to anonymously feed into key agencies to keep sex workers safe whilst the tool also offers assistance to those who wish to report to the police by assisting the investigation and preventing re-traumatisation. The tool began the first phase of pilot testing with sex workers in Nottingham in January 2024. Driving policy change: pathways to decriminalisation Through the Policy Impact Accelerator Programme, Dr Larissa Sandy worked with local charity, POW, and local sex workers to co-produce materials to start the policy conversation around decriminalising sex work in the UK. Through facilitated art workshops at POW headquarters, sex workers co-designed the pamphlets and made art pieces representing their lived experience of safety and access to justice as sex workers. These materials will be shared with policy makers through a local to national campaign Dr Larissa Sandy is spearheading, which will seek to decriminalise sex work and create a safer working environment for sex workers across the country in a similar fashion to work she already helped to drive in Australia, which she has started to do through her radio and article interviews with the BBC investigations. The public panel at the National Justice Museum: Pathways to Creating Opportunities for Sex Worker Justice, as part of the PIAP programme, also allowed sex worker representatives with lived experience and industry experts and policy makers locally, to come together to discuss the policy path forward in making sex work safer. Panellists included Dr Rosie Campbell (OBE), Nadia Whittome (Labour MP, Nottingham East), Gary Godden the new Nottingham Police and Crime Commissioner, PC Ian Clay (Sex Work Action Partnership, Nottinghamshire Police), Alana (Member of the Research Advisory Committee), Dr Larissa Sandy, and Sam Richardson-Martin (POW), all of whom spoke to the significant safety issues sex workers face and discussed the new tool developed and piloted in Nottingham. Larissa plans to take this work national next with another public panel in winter 2024. Thanks for reading this ongoing impact project, supported by the Institute's Policy Impact Accelerator Programme. We aim to bring you more updates as Dr Larissa and her team progress in this project. To know more about our work at the Institute, send us an email at theinstitute@nottingham.ac.uk, or follow us on all social media platforms."
        }
    ],
    "pdf_files": []
}