{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/popular-consent-and-the-just-transition-to-net-zero",
    "content": [
        {
            "p": "Securing public support and ensuring equitable burden-sharing across nations. As global leaders convene in Azerbaijan for COP29, the concept of a \"just transition\" has taken centre stage, highlighting the urgent need for fair and inclusive climate policies. In this timely article, Stephen Meek delves into the challenge of achieving net-zero emissions in a way that secures public support and ensures equitable burden-sharing across nations. With wealthier countries negotiating financial commitments to support poorer nations in combating climate change, Meek explores how reframing the climate debate around fairness and shared benefits is essential for long-term success. From Azerbaijan, to the US, to launch of the University of Nottingham’s ‘Just Transition’ Policy Commission in Parliament—this week will have the topic of popular consent and the just transition in focus around the world. Today sees the opening of COP29 in Azerbaijan. This round of COP has set itself the challenge of reaching agreement on how much money should go each year from wealthy countries to the poorest to deliver an equitable burden sharing in addressing the challenge of climate change. It does so against the background of the US election and the return of President Donald Trump to the White House. In as much as tackling climate change was an issue in the election it was on a largely partisan basis: concern about the impact of fossil fuels on the climate was something that mattered to Democrats, while for Republicans the focus was energy security and preserving a way of life dependent on fossil fuel consumption. This was against the backdrop of a series of once in a generation extreme weather events – flooding in North Carolina, devastating heatwaves across the south of the country – that are now almost annual occurrences. It is too soon to unravel precisely what made Trump’s agenda more attractive than that presented by Harris’ Democrats, and the role their respective positions on the environment played in that, if at all. But undoubtedly four years of inflation at levels not seen for decades combined with an unprecedented stretch of stagnant real income growth will have played its part. In elections across the globe this year incumbent parties have been punished at the polls for inflation. And at a time when people were feeling economically uncertain, Republicans blamed policies such as shifting away from fossil fuel dependency as putting future economic performance at risk. Whether or not you believe this mood of financial vulnerability was exploited by Trump or that he has a workable plan to remedy it, the feeling is manifestly real and should not be dismissed or rationalised away. Tomorrow, on November 12, the University of Nottingham is launching in the House of Lords the final report of its Policy Commission on a Just Transition to Net Zero, chaired by Lord Watson of Wyre Forest. This is perhaps an event of marginally less significance than COP29 or the US Election. However, the report is extremely timely, not least because its first recommendation is that there is an urgent need to change the terms of debate about climate change and net zero, and the central role a demonstrably just transition plays in that. This means if net zero is to be reached we need to change the terms of the debate to win consent. Too often the case is made in negative terms: about what we have to give up rather than what we gain, as a moral crusade where we wear our hair shirt as a sign of virtue. As a result it is all too easy to see how concern about the climate can be presented as a “luxury belief”, something it is easy for “elites” to care about because they don’t have to worry about higher bills and prices at the pump, can afford an electric car, can insulate their homes and buy a heat pump, have the time and money to take a train to a Mediterranean holiday rather than fly. And those who present it as a moral issue can appear judgmental and patronising: it is not illegitimate to worry more about the bills you are struggling to pay today than an abstract future. To win the popular argument, the transition needs to be seen as the path to security: as they way to prosperity and jobs, as the way to keep warm in winter and cool in summer, as the way to prevent crisis-driven population flows. The counterfactual – doing nothing – is choosing to keep things as they are but the risky choice, the choice that will shore up industries and jobs that will become unsustainable, that will cause bills to rise, will make extreme weather (even more) the norm, will jeopardise food supplies and will cause mass migration as whole geographies become uninhabitable. Which is why talking about a just transition – one which ensures the costs and the benefits are equitably shared, which actively supports those who will be adversely affected into new opportunities in growth industries and occupations – is so important. Our report makes a contribution to thinking about how we address this in the UK. COP29 is looking at equity as a global level. For a transition to work it has to speak to people’s genuine and legitimate concerns about their security. It is not fair or reasonable to expect some people or some countries to pay a bigger price to secure the prize. And if the transition is not manifestly fair then, however well planned and robustly grounded in science and ethics, it will always be vulnerable to those who (genuinely or not) speak for those it leaves behind. This article was written by Stephen Meek, Director at the Institute for Policy and Engagement. To know more about our policy commission, visit our website or send an email to theinstitute@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}