{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/castle-meadow-campus",
    "content": [
        {
            "p": "Located in the heart of Nottingham city centre, Castle Meadow Campus is establishing strong links between the city and the University of Nottingham. Located in the heart of Nottingham city centre, a mere five-minute walk from Nottingham train station, Castle Meadow Campus is establishing strong links between the city and the University of Nottingham. With the aim to ‘grow some place extraordinary’, Castle Meadow is set to become the University of Nottingham’s home of enterprise. Once completed, this campus will be a collaborative space between businesses and research, inspiration and innovation. The campus will interact with the following groups daily: In February, we hosted our Public Engagement Group within City as Lab space, located in building C at Castle Meadow Campus. We got to see first-hand the digital and data innovation being continuously constructed at City as Lab to tackle real-world challenges in Nottingham. During our visit, we saw demonstrations how City as Lab are using technology to reflect data of the city providing researchers, businesses, and students alternate perspectives on the city. The team have created a 3D model of the city so they can visually see the data projected on the city itself. This data could include poverty alleviation, healthcare access, sustainability and so much more. By representing this data physically, it can propel the researchers to think differently about their project, looking at the data from a fresh perspective. Castle Meadow is designed as a collaborative space, seamlessly shifting its use for community’s needs, meetings, conferences and many more. As the construction of the campus finishes, it will also be home to Nottingham University Business School, bridging academia and various industries even further. Digital Nottingham and UNIP (University of Nottingham Innovation Park) will also find their home on campus. Thanks to City as Lab, we are already using this space, as an ideal central location for collaborations. In May, we hosted the Youth Voice workshop in partnership with Nottingham City Council and Nonsuch Studios. This workshop brought together academics and external partners to collaborate on the ongoing UNICEF Child Friendly City programme, requiring a location between University Park and the city centre. We also utilised the space for our Institute Academy Programme cohort networking session which featured external speakers and the cohort participating in trialogue discussions to develop best practice and improve research outcomes. We are excited to see this space develop and with a policy and public engagement at our heart, appreciate this new space to connect to communities more easily. For more information on Castle Meadow Campus and their partners, visit their website. Or if you would like to know more about Castle Meadow Campus, it’s facilities and upcoming opportunities, email Castlemeadowcampus@nottingham.ac.uk. This blog was written by Phillipa Abery. If you have a general query re the Institute for Policy and Engagement, please email our team."
        }
    ],
    "pdf_files": []
}