{
    "url": "https://www.nottingham.ac.uk/politics/alumni/index.aspx",
    "content": [
        {
            "p": "Your relationship with the University of Nottingham doesn't end when you graduate. We have many ways for our alumni to get involved and keep in touch, and help to inspire students currently studying with us. As a graduate of the University of Nottingham, you can continue to use the Careers and Employability Service to help build your career. They provide guidance and advice, run events, and have a job vacancy service. The School of Politics and International Relations also holds an annual alumni careers conference, in which alumni are invited back to the school to speak to current students about their career journeys and to offer advice and guidance. Other alumni panel events have taken place throughout the year, including during Welcome Week for new students. By registering your interest as a volunteer you will be kept up to date on the latest volunteering opportunities as they become available, including those within the school. Alumni are always welcome to attend research centre seminars and events. Register your interest as a volunteer Giving your time is a great way to learn new skills, get more involved in the university and meet alumni. We offer a range of roles that you can do from home, work, in the UK or from anywhere in the world. Whether you can offer 30 minutes or 30 hours, your time will make a positive difference. Our mentoring schemes offer Nottingham alumni the opportunity to provide meaningful career support to current students and fellow alumni. Mentoring develops via remote contact over the academic year, giving participants time to benefit from their mentor's professional experience and knowledge. Every year thousands of people like you donate to the University of Nottingham to make a difference to the lives of students and fund world-changing research. Find out more below about the areas where you can make an impact. The university alumni website provides many ways to keep in touch and stay connected and lists of the latest alumni events. Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}