{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/bright-sparks-family-talks",
    "content": [
        {
            "p": "Igniting young minds and sharing knowledge through a new series of talks and activities. Our new Bright Sparks family talks series launch this summer at the University of Nottingham’s Lakeside Arts! Find out what to expect from these engaging talks, designed for families to enjoy together and led by two of the University’s world-leading researchers. Our new Bright Sparks family talks bring University of Nottingham academics and family audiences together to explore the fascinating and wide-ranging research at the university in a fun and engaging way this summer. Funded by the Institute for Policy and Engagement, the series features interactive talks and demonstrations by two world-leading academics, eager to share their research and passions with family audiences. These lively, hour-long talks will be hosted at the University of Nottingham’s Lakeside Arts. Each session will take the audience on a scientific journey, with two lectures exploring the smartness of spiders and the sounds, touch and smells of outer space! Each talk will also have wrap-around activities before and after the talk, enabling participants of all ages to get involved in what’s happening. These weekend events form part of the Institute for Policy and Engagement’s public engagement activities, supporting Nottingham's UNICEF child-friendly city initiative by making academic research accessible to all ages. The initial event concept was first trialled last summer with Assistant Professor Jez Turner, from the university’s Faculty of Engineering, enthusiastically showcasing the role engineers played in the Apollo moon landings success to a family audience. This event saw an audience of more than 150 adults and children looking on in wonder as the story of the Apollo lunar landing was unravelled through an interactive event and lecture featuring astronaut costumes, air rockets and even a gravity demonstration using a BMX bike! The strong success of this event has now led the way for a new and larger scale summer programme with two, brand-new family events on offer as part of the Bright Sparks family talks series, held in the Djanogly Theatre at Lakeside Arts. The two talks take place on Sunday 7th and Saturday 20th July. Each session includes a 1-hour talk beginning at 1pm, with free themed drop-in activities before and after, from 12-1pm and 2-3pm. Talks are also free for concessions. Further details about each event and ticket booking details, can be found below. In the first family-friendly talk, on Sunday 7th July, Professor Sara L. Goodacre will reveal how spiders use their amazing skills and explain what it is that we still don’t quite understand about them. Did you know that spiders can make their legs into sails to cross water, make stretchy silk lines to swing from tree to tree, and even talk to each other in code? Sarah will also tell us how spiders give us the template to make our own, artificial spider silk copies that could one day be used to help our own bodies to heal! Sara is a professor of evolutionary biology and genetics and runs the University’s very own Spider Lab! What if we could smell the solar system, listen to a shooting star, or even feel the vibrations of a Mars-quake? The final talk of the series will welcome back Jez Turner, Assistant Professor in the Department for Foundation Engineering & Physical Sciences, for a new and original talk exploring how most of our Solar System and the Universe is not just what we see with visible light. The date of this interactive and sensory-focused talk on Saturday 20th July also marks exactly 55 years to the day since the Apollo moon landing took place. Jez’s talk will explore how most of our solar system and the universe is not just what we see with visible light. Through practical demonstrations, Jez will show how we can explore space through smell, touch and sound. This blog was written by Sally Nightingale from the Institute for Policy and Engagement. For more information about the series or for any other queries about the Institute’s work, please get in touch. #BrightSparks24"
        }
    ],
    "pdf_files": []
}