{
    "url": "https://www.nottingham.ac.uk/policy-and-engagement/net-zero/resources.aspx",
    "content": [
        {
            "p": "The University of Nottingham is dedicated to developing and sharing the expert knowledge needed to confront climate change and shape a sustainable future for generations to come. Across the university, we have a number of research groups and centres dedicated to tackling the many diverse aspects of this challenge. We’ve helped our partners cut CO2 emissions by 16.3m tonnes a year in recent years. Across transport, food, energy, and other industries, our technologies are securing a net-zero future. Our discoveries will help achieve the UNs goals for sustainable development. Our interdisciplinary approach and globally recognised expertise will help to inform research agendas, shape policy and create new ways of living to allow societies to flourish in the face of adversity. \"to tackle the greatest challenge of our time we must accelerate the delivery of sustainable technologies and solutions.\" Whether you are interested in learning more about Nottingham's research on net zero and sustainability beyond this Hub, the University of Nottingham's own net-zero strategy, or the social sciences in general, these links will help. There are also a number of more specialised research centres across the university, dedicated to tackling climate change. An interdisciplinary group researching sustainable environment management and the impacts of climate change. A £1.9m research project which fed into the Government and local strategies. Disruptive world class research on ecological transitions in diverse societies. Exploring and improving public policy for policymakers, practitioners and the public. Fostering creative and interdisciplinary research at the business-society interface. How will societies adapt to a changing world? Developing holistic solutions across transport, mobility and cities to co-create future cities. Solving global water challenges for generations to come."
        }
    ],
    "pdf_files": []
}