{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/deserts-as-a-source-of-sustainable-development-in-mexico",
    "content": [
        {
            "p": "Using native plants to build sustainable futures In this blog post, Dr Zinnia Gonzalez, Assistant Professor at the University of Nottingham, sheds more light on the transformative potential of native desert plants in Mexico’s drylands. She explores how Proyecto Mezquite, With support from the Institute, is working with local communities to restore ecosystems and create sustainable economic opportunities. Across Mexico’s vast deserts and semi-deserts, which span 54% of the country, native plants have long been a vital resource for local communities. These resilient species provide food, medicine, and raw materials, even as climate change threatens the delicate ecosystems that support them. For centuries, indigenous and rural populations have depended on plants like mezquite (Neltuma spp.), a legume known for its versatility. Mezquite flour is rich in nutrients, its medicinal properties are well-known, and its hardy wood is used in furniture and traditional crafts. But despite their potential, the sustainable use of these plants to reduce poverty and enhance food security remains largely untapped. This is where Dr Zinnia Gonzalez-Carranza, leader of Proyecto Mezquite and an associate researcher at the University of Nottingham’s School of Biosciences, has stepped in to explore the potential of these desert resources. Collaborating to reimagine dryland development In April 2024, Dr Gonzalez-Carranza organised a strategic consultation in Durango, Mexico, as part of her ongoing work with Proyecto Mezquite. This meeting brought together key stakeholders, including community leaders from Durango’s dryland regions, the Mexican government, and academic institutions. Among the participants were members of the federal program “Sembrando Vida,” which promotes reforestation efforts, and representatives from the Secretariat of Environment and Natural Resources (SEMARNAT), responsible for regulating the use of natural resources like mezquite. Also present were officials from the National Forest Commission (CONAFOR) and researchers from Durango’s Interdisciplinary Research Centre. The gathering was more than a typical policy discussion; it was an opportunity to connect the voices of dryland communities with the experts who hold the power to make impactful changes. “It was clear from the discussions that a national program and legislation for the integrated and sustainable management of desert and semi-desert plants is needed,” said Dr Gonzalez-Carranza. “The program and legislation should stimulate social development and the restoration of native ecosystems from the drylands.” The consultation provided a space for sharing ideas about how mezquite and other native plants could be cultivated sustainably and incorporated into local economies. Participants addressed concerns about the lack of comprehensive legislation governing the use and preservation of these resources, and they outlined the requirements for new laws that would support sustainable development, reforestation, and food security. A call for national action This meeting was not an isolated event. It built upon previous research and workshops organised by Proyecto Mezquite, which aim to revitalise dryland ecosystems while improving the quality of life for Mexico’s most vulnerable populations. These efforts culminated in a collective call to action submitted to the Mexican government, requesting a national program to preserve and sustainably manage desert plants like mezquite. For many in these communities, this work represents more than environmental conservation—it is a lifeline. A participant from one of the workshops shared a poignant thought: “If we could take care of and use our desert resources to have decent jobs that meet our needs, we would not risk our lives migrating to the United States where we suffer greatly.” Shaping the future of drylands The consultation in Durango marked a critical step toward creating lasting change in Mexico’s drylands. Beyond the meeting, a policy brief was produced, and a video showcasing the potential of desert and semi-desert plants was shared with diverse stakeholders in a webinar on August 28, 2024. These materials emphasise the urgent need for national programs and legislation that protect desert resources while fostering social development. As the momentum grows, the hope is that these efforts will lead to meaningful changes that benefit not only the people of Mexico but also the planet. By fostering sustainable use of native plants, communities can build resilience to climate change, reduce poverty, and preserve biodiversity for future generations. By supporting these communities, we help everyone to live well and with dignity, and our planet and biodiversity are protected for future generations, according to Dr Gonzalez-Carranza concludes. Thanks for reading this article as part of our ongoing impact series. Zinnia Gonzalez Carranza is an associate in the School of Biosciences at the University of Nottingham. Her research focuses on uses dryland plant species to stimulate sustainable development, preservation and revitalisation of dryland ecosystems and empowerment of rural women. To know more about our work at the Institute, send us an email at theinstitute@nottingham.ac.uk, or follow us on all social media platforms."
        }
    ],
    "pdf_files": []
}