{
    "url": "https://www.nottingham.ac.uk/policyengagementblog/supporting-victims-of-gender-based-violence-in-uganda",
    "content": [
        {
            "p": "The impact of Olympia Bekou’s nitiative on justice and policy reform Gender-based violence (GBV) remains a critical issue in Uganda, particularly in conflict-affected regions where women and girls are disproportionately affected. While the Ugandan government has made strides with the National Transitional Justice Policy (NTJP) to address these injustices, significant gaps remain in ensuring that survivors have access to justice and a voice in decision-making processes. This is where Professor Olympia Bekou’s work, supported by PSF funding from the Institute, is making a difference. Through her project, Olympia is not only elevating the voices of women survivor leaders but also contributing to national efforts to end violence against women by fostering direct engagement between survivors and policymakers. In August 2023, Olympia Bekou’s project culminated in a transformative symposium in Gulu City, Northern Uganda. This gathering brought together 144 participants, including over 80 influential women leaders from 10 conflict-affected districts, alongside community leaders, law enforcement, parliamentarians, and civil society representatives. The symposium was more than just a meeting; it was a powerful platform where survivors of gender-based violence could share their experiences and insights directly with those in positions of power. The event highlighted the critical need for innovative strategies to improve access to justice for victims of sexual and gender-based violence (SGBV). Participants collaboratively developed recommendations that would strengthen the justice framework and enhance support systems for survivors. One of the most impactful outcomes was the creation of the \"Women Leaders Justice Response Taskforce,\" composed of representatives from each participating district. This taskforce is a pioneering initiative aimed at empowering women leaders to spearhead SGBV justice efforts in their communities, ensuring that survivors’ voices are not just heard but are central to the policy-making process. Following the symposium, Olympia’s project continued to build momentum through targeted mentorship training sessions designed to equip women leaders with the skills and knowledge necessary to address SGBV at the grassroots level. These sessions focused on developing response and referral systems that would streamline the support provided to survivors, making justice more accessible to those most in need. By investing in local leaders, the project nurtured a network of empowered women who are now better equipped to advocate for their communities and challenge the barriers to justice that many survivors face. The grassroots approach is particularly significant because it recognizes that change must be driven from within the community. By empowering women leaders with the tools they need, the project not only addresses immediate SGBV justice issues but also lays the groundwork for sustained advocacy and long-term change. This community-led model exemplifies how academic expertise can effectively intersect with local leadership to create impactful and sustainable solutions. Building on the success of the symposium and mentorship sessions, Olympia’s project entered a second phase that focused on engaging key government officials and policymakers. A delegation of partners, along with four representatives from the Women Leaders Justice Response Taskforce, embarked on a ministerial engagement programme. This initiative included one-on-one meetings with government members, parliamentarians, and other stakeholders such as the Irish Ambassador, the Greater North Parliamentary Forum, the Prime Minister for Northern Uganda, and representatives from the Ministry of Gender. These meetings were instrumental in amplifying the voices of grassroots women at the highest levels of government. For many of the women leaders involved, this was their first opportunity to directly address policymakers and advocate for the needs of their communities. The impact of these engagements cannot be overstated; they represent a critical step in bridging the gap between survivors and those who have the power to implement change. By facilitating these dialogues, Olympia’s project is not only raising awareness of the issues surrounding SGBV but also driving the development of a strategic plan to promote justice, reconciliation, and peacebuilding in Uganda. Olympia Bekou’s project demonstrates the power of international partnerships and community engagement in addressing complex issues like gender-based violence. Supported by PSF funding, this initiative is a testament to how academic research and advocacy can converge to create platforms that elevate local voices and influence policy at both national and international levels. What makes this project particularly successful is its emphasis on trust, collaboration, and the empowerment of those directly affected by the issues being addressed. By working closely with survivors, local leaders, and policymakers, Olympia Bekou’s team is making a tangible impact on the fight against gender-based violence in Uganda. Their work not only strengthens the justice framework for survivors but also sets a precedent for how academic initiatives can support and drive meaningful social change. This story of impact is part of our ongoing effort to showcase how the University of Nottingham is supporting researchers in making a real difference in the world—one project at a time. Thank you for following our impact series. To learn more about our work and stay updated, send us an email at theinstitute@nottingham.ac.uk, or follow the Institute on all social media platforms."
        }
    ],
    "pdf_files": []
}