{
    "url": "https://www.nottingham.edu.my/Procurement/E-Invoice-Implementation.aspx",
    "content": [
        {
            "p": "The Inland Revenue Board Malaysia (IRBM) has announced the mandatory implementation of E-Invoicing system for all businesses in Malaysia through a phased implementation timeline depending on the annual turnover or sales revenue threshold of the business, starting from 1st August 2024 until full implementation for all taxpayers by 1st July 2025. In view of this mandate, it is the University of Nottingham Malaysia Sdn Bhd (UNM)’s policy to transact with vendors who can issue E-Invoicing validated by the IRBM on our purchases upon implementation of the E-Invoicing system. Please find the following details about University of Nottingham Malaysia (i.e. Buyer’s Details) that are required for completion of the relevant data fields in the IRBM’s MyInvois Portal for validation purposes: No. Data Field Details 1. Buyer’s name The University of Nottingham in Malaysia Sdn Bhd 2. Buyer’s TIN C1876315040 3. Buyer’s Registration Number 199801017391 4. Buyer’s SST Registration Number W10-2210-32000038 5. Buyer’s e-Invoicing Notification email address Finance.eInvoice@nottingham.edu.my 6. Buyer’s Address Jalan Broga 43500 Semenyih Selangor Darul Ehsan Malaysia Please be informed that UNM has engaged Finexus International Sdn Bhd as our system implementation partner to assist in the data gathering process. Therefore, we kindly request your co-operation in providing us with the necessary information required by IRBM which we have emailed separately to all our respective vendors. Please be rest assured that all submitted information and data will be treated with utmost confidentiality, in line with the Personal Data Protection Act 2010. If you have any questions regarding this request, please do not hesitate to contact Azlina Abdullah at 03-89248112 or email to procurement@nottingham.edu.my General Enquiry telephone: +6 03 8924 8000 fax: +6 03 8924 8001 (Malaysia)/8005 (International) Course Enquiry telephone: +6 03 8924 8686 Make an enquiry"
        }
    ],
    "pdf_files": []
}