{
    "url": "https://www.nottingham.ac.uk/professionaldevelopment/it.aspx",
    "content": [
        {
            "p": "Learning and Development offers a wide range of instructor-led and eLearning based IT training courses. These have been designed to support and enhance the use of IT in a wide variety of University roles. Use the information below to help you select the most appropriate development opportunity for your specific role. Our training courses all assume a prior knowledge of Microsoft Windows and the basic functions of a PC. You will find it hard to keep up without these skills so we have put in place some ways to help: Online training materials Supported IT Self-Study Getting started with OneDrive and OneNote Improving efficiency and collaboration using Teams & Forms Using OneNote the digital notebook Learn how to work with information in the cloud via OneDrive to help collaboration with individuals and groups. Use OneNote to make and store notes. Learn how to work with Microsoft Teams and understand how it can help you to collaborate with others This course will show you the potential of OneNote to collect and organise different types of information. Staff & Research Postgraduate Students Campus Solutions Essentials (Online Course) Campus Solutions Financials – Funding and Awarding (Online Course) Be able to: log in and navigate the system menu, use common features such as favourites and searching for data, understand Campus Solutions terminology, explore student records, Understand where to see personal, academic and financial information (including comments and documents), Understand the basics of curriculum data and how to view Plan, Course and Class roster information and Know how to find supporting documentation Be able to define an aid year and understand how this is used in Campus Solutions, Be able to check if a student has been aid year activated and financial aid term built, Find an item type, Look up and select an appropriate disbursement schedule, Assign, amend, and cancel an award for a student, Troubleshoot common problems Staff Agresso Procurement Purchase to Pay (P2P) Training B12 Kings' Meadow Campus Lenton Lane Nottingham, NG7 2NR telephone: +44 (0) 115 74 84800 email: pd@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}