{
    "url": "https://www.nottingham.ac.uk/professionaldevelopment/apprenticeships/index.aspx",
    "content": [
        {
            "p": "Have you ever thought that university might not be for you? Well maybe not to study but what about an apprenticeship? The University of Nottingham apprenticeship Programme provides young people from Nottingham and the surrounding area with worthwhile jobs and excellent training. Our apprentices also make a significant contribution to the University and employing an apprentice is not a charitable activity. Evidence suggests that apprentices are highly motivated, highly productive and – because of the combination of in-house support and external training – are able to quickly become productive and valuable members of staff. As an employer, the University can offer a wide variety of apprenticeship standards to fit the requirement of the schools and departments. We are also committed to developing staff to ensure they have the best possible preparation for a successful career. We are proud of our award-winning campuses, both at home and abroad, and continually invest in the University's grounds, buildings and facilities for both staff and students. Developing and managing the University's environment is at the heart of our values, ensuring environmental sustainability remains firmly on the University's agenda. Many of our apprentices have gone on to gain employment within the University, although we are unable to guarantee a permanent post at the end of the apprenticeship. An apprenticeship at the University of Nottingham is an opportunity to make the most of. We currently have apprentices working in the following areas but these are just a few of the standards available: Anyone can become an apprentice - there is no upper age limit. They could be a school leaver looking for employment and training opportunities (please see our traditional apprenticeships page), or an existing member of staff looking to develop their skills (please see our Work, Learn, Qualify page). Apprenticeships operate in exactly the same way for all ages, and they are encouraged as a new way of progressing for existing staff. Email Claire Phone: ext 15782 B12 Kings' Meadow Campus Lenton Lane Nottingham, NG7 2NR telephone: +44 (0) 115 74 84800 email: pd@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}