{
    "url": "https://www.nottingham.ac.uk/professionaldevelopment/learningandteaching/awards/dearingawards/index.aspx",
    "content": [
        {
            "p": "Running since 1999, the Lord Dearing Awards celebrate the world-class contribution made by a wide range of University staff who have enhanced the student learning experience. Overseen by the Teaching and Learning Committee, the awards judging panel is made up of senior colleagues from across the University, Vice-Provosts for Teaching and Learning from UNNC and UNM and Professional Development. The panel is chaired by the Pro-Vice-Chancellor for Education and Student Experience. Further guidance for nominees can be found on the Lord Dearing Award Moodle site including Dates, Times, and MS Team Links for Drop-in Sessions and Training for LDA Nominees (Further Training Opportunities Panel). Up to 50 awards will be made to individuals and teams that have a direct link to teaching and learning or the student experience, including teaching staff and staff from other areas such as professional services and technical or support staff. Please scroll down to find Key dates and note the final deadline for all aspects of a submission. The Lord Dearing Award for Excellence in the Learning Environment recognises a School or Department where efforts to achieve excellence in teaching and in the student experience have been embedded across all programme teams and staff groups. One award is made each academic year. Full guidance for nominees can be found on the Lord Dearing Award Moodle site including Dates, Time, and MS Team Links for Drop-in Sessions and Training for LDA Nominees (Further Training Opportunities Panel). Heads of School or Departments are invited to self-nominate their unit with the submission of a short narrative statement (maximum 600 words) and 360 review. Please find Key dates (including submission deadline) below and use the Lord Dearing Award system to nominate your School/Department and submit the narrative and 360 review aspects of the submission by the deadline. Teaching and Learning Observation College (TLOC) If you would like to nominate an individual, team, or School/Department, you should do this via the Lord Dearing Award Nomination System. You will need to provide your details and the details of the person, team, or School/Department you are nominating and a reason for that nomination. There is a drop down menu for you to do this. You will receive notification of your nomination by email and need to confirm that you intend to submit for the award. Once you have confirmed you intend to apply, you can progress your submission as outlined under ‘Application Stage’ opposite. Each element of the submission is scored, and nominations that have completed all aspects of the submission process will progress to interim and final panels for review (see Panel and outcomes stage opposite). If your submission progresses to award, you will be provided with an electronic certificate and a hard copy of this digital certificate will be made available to you at a celebration event for award holders. Team award certificates are issued in the name of the team and School/Department certificates are issued in the name of the School/Department. Individual award certificates are issued in the name of the individual award holder. Nomination / Intention to Submit Stage All resources for nominees, including Lord Dearing Award eligibility criteria and professional dialogue, narrative, and 360 review guidance and past training, can be found on the Lord Dearing Awards Moodle site. If you have any questions or require further information, please contact: pdsupport@nottingham.ac.uk B12 Kings' Meadow Campus Lenton Lane Nottingham, NG7 2NR telephone: +44 (0) 115 74 84800 email: pd@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}