{
    "url": "https://www.nottingham.ac.uk/professionaldevelopment/learningandteaching/tloc/index.aspx",
    "content": [
        {
            "p": "Welcome to the Teaching and Learning Observation College (formerly the Peer Observation College). Literature highlights the benefits of observation to both the observer and observee. The University of Nottingham values peer led observation activity as a method to support the development of its teaching staff at whatever level. Watch the video below to get further insights into the benefits of being involved with the Teaching and Learning Observation College. The Teaching and Learning Observation College (TLOC) is committed to supporting and developing excellence in teaching practice and the on-going professional development of all University of Nottingham staff through a collegial approach. To meet this aim, it emphasises four underpinning themes: dialogue, support, enhancement and dissemination. Observations are gradated in formality, as illustrated in the figure below: For further information and how to get involved please email: TLOC@nottingham.ac.uk Go to TLOC Moodle Developmental These are informal and very much led by the observee. Observations or professional dialogues can be carried out by staff from the same School/Department or from across the University. Formal Formal observations or professional dialogues can be undertaken where the observee requires evidence for University awards or schemes, for example, the Lord Dearing Award. You can request an observation or professional dialogue or register to become a TLOC Associate and observe others / lead professional dialogues through the TLOC System. All staff who wish to become a TLOC Associate and lead observations or professional dialogues will undertake TLOC Associate training, and additional training is required before an observation can be conducted for some schemes that use the TLOC platform (Apprenticeships). Dates of training are spread across the academic year. All staff are expected to observe the University guidelines on Equality. Diversity and Inclusion. For further information, please email: TLOC@nottingham.ac.uk The following steps are involved in observations and professional dialogues: Use the TLOC system to request an observation or professional dialogue and complete the pre observation and professional dialogue questionnaire (voluntary and confidential) You will be matched with an observer / professional dialogue facilitator (TLOC Associate) who meets your criteria (for example, area of focus, internal or external to your School/Department) Finalise arrangements for the observation or professional dialogue with the TLOC Associate matched with you, and on completion the TLOC Associate will confirm it has taken place through the TLOC system. Complete the post observation or professional dialogue questionnaire circulated three weeks after the observation or professional dialogue has been registered as complete to indicate any impact on you and your practice (voluntary and confidential). For further information, please navigate to TLOC Moodle Please find all observation and professional dialogue forms on TLOC Moodle. The TLOC Academic Board is designed to support the strategic function of observation and professional dialogue activity across the University. Specifically, it develops, oversees and manages the implementation of the TLOC, reporting on areas of effective practice and identifying common areas of development. Co-Chair: Dr Earl Kehoe Member: Dr Michael Clifford Member: Professor Andy Fisher Member: Professor Jo Lymn Member: Dr Sannia Mareta (UNN) Member: Dr Hazel Ramos (UNM) Member: TBC B12 Kings' Meadow Campus Lenton Lane Nottingham, NG7 2NR telephone: +44 (0) 115 74 84800 email: pd@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}