{
    "url": "https://www.nottingham.ac.uk/professionaldevelopment/graduate-management-trainee-programme/index.aspx",
    "content": [
        {
            "p": "The Graduate Management Trainee (GMT) scheme is designed to provide the foundation for a Professional services career in the Higher Education (HE) sector. It is an 18-month scheme, in which trainees typically undertake three placements in different key service areas. Placements could take place across any of the university’s UK campuses. Each placement has different responsibilities, including a blend of project work and operational service delivery. This provides the trainees with the opportunity to develop broad skills and experience in HE management and operations. The University of Nottingham has run a Graduate Management Trainee scheme since 2008, including as part of the Ambitious Futures Programme for University Leadership, which closed in 2020. The new GMT scheme has been running since September 2021. To be eligible, you must have at least a 2:1 in a first degree in any subject OR a postgraduate qualification (either obtained in the last 5 years or anticipated by the start date of the scheme). An interest in and understanding of HE issues is essential. Skills required for the role include: Graduate Management Trainees are in the Administrative, Professional and Managerial (APM) job family, paid at Level 4 Career Training Grade. Information on University of Nottingham salary scales is available here and you can also read about the reward and benefits available to University of Nottingham staff. Trainees are assigned a senior member of university staff as a mentor. There is a Learning Community of GMTs with online resources about the HE sector, personal effectiveness, and leadership, as well as a monthly peer discussion forum. There is also an opportunity to join a Community of Practice with trainees from other universities. Depending on availability, trainees may have the opportunity to undertake an ILM Certificate in Leadership and Management (Level 5) The scheme is an 18-month fixed-term contract of employment. In the final months, GMTs can enter the university’s redeployment scheme to find their next role at the university. It is expected that GMTs would be prepared for a Level 4 role after completing this scheme. Previous trainees have built successful careers in areas including, but not limited to, HR, Digital and Technology services, Research Support, International Partnerships, and HE consultancy. The next cohort to be recruited would start their roles in September 2024. Information about applications for this cohort will be available in early 2024; assessment centres and interviews will take place in the Spring. The roles will be advertised on the University of Nottingham’s page for current vacancies. B12 Kings' Meadow Campus Lenton Lane Nottingham, NG7 2NR telephone: +44 (0) 115 74 84800 email: pd@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}