{
    "url": "http://www.nottingham.ac.uk/project-transform/index.aspx",
    "content": [
        {
            "p": "Project Transform was just one part of Global Strategy 2020, our initiative to strengthen education and research, improve on existing quality and offer a unique international approach for our students. Aligning processes across the UK, China and Malaysia campuses, the project marked the beginning of a new journey towards continuous improvement and student excellence, transforming the way that the University delivers certain student services. The Campus Solutions software offered us an end-to-end student records system, meaning that all student administrative processes can be completed in one place and kept in one record. The system will enable an integrated view of the entire Nottingham student journey. We’ve also built a portal called MyNottingham, where students can access their record and carry out their part of these administrative processes. MyNottingham and Campus Solutions are integrated so the records seen by a staff member will automatically be updated if a student makes a change – and vice versa. Malaysia was the first campus to use Campus Solutions and MyNottingham, with new functionality brought online through the academic cycle. Using our experience there, we’ve been able to identify and resolve issues before they affect the other two campuses. Campus Solutions was rolled out in phases to staff and students in Ningbo, China. Find out more about the implementation in China. The Admissions team initially started using Campus Solutions to manage UCAS applications. Use of the system was later extended to Direct Admissions and UCAS Teacher Training applications. Find out more about the launch of Campus Solutions for UK Direct Admissions and Teacher Training. Staff and students at the University of Nottingham can learn more about Project Transform at the following locations: Student Services overview Staff can view information on the Campus Solutions Workspace pages Campus Solutions blog The introduction of the new software and Student Service Centres are part of a journey towards excellence. We are continuing to ensure that we build upon the new model and improve services and systems in line with the needs of our students. Kings Meadow Campus Lenton Lane Nottingham, NG7 2NR"
        }
    ],
    "pdf_files": []
}