{
    "url": "https://www.nottingham.ac.uk/psawards/index.aspx",
    "content": [
        {
            "p": "Following on from the success of our inaugural Professional Services Awards in 2022, would you again like to recognise a Professional Services team that has been gone over and above with their ambition to support others and succeed in all they strive to achieve over the course of the last year? The Professional Services Executive Group are delighted to again be hosting our second Professional Services Awards on Monday 2 October 2023. Last year the inaugural Professional Services Awards attracted 180 nominations over eight award categories and were an amazing showcase of al that our teams had achieved in the preceding two years. It was very tough for our Professional Services Executive Panel to choose winning categories from across the breadth of nominations and the event certainly lived up to its them of ‘Inspire’. This year the theme is ‘Ambition’ and we’re looking forward to hearing how teams have reached even higher since the last awards ,not only ensuring our professional services and campus operations run smoothly, but developing new services, capabilities and support for our fantastic global UoN community. We are very much looking forward to coming together for another evening of celebration and reflection on Monday 2 October 2023 to showcase all that our teams have achieved amongst the fantastic backdrop of our EMCC conference centre venue. Professional Services includes all of Administrative Professional and Managerial (APM), Technical Services (TS), Operations & Facilities (O&F) and Childcare Job Families, including roles based in Schools and Faculties as well as central functions. Save the date: Monday 2 October 2023 Deadline – 5pm, Sunday 23 July 2023. If you have any queries about the PS Awards or would like to volunteer to be involved in this celebratory event, contact us via ‐ To nominate in any category – click the button below to access the online form (deadline for all submissions - 5pm, 23 July 2023). Nominate now"
        }
    ],
    "pdf_files": []
}