{
    "url": "https://www.nottingham.edu.my/Psychology/Research/postgraduate-students.aspx",
    "content": [
        {
            "p": "Here are our postgraduate students studying for PhD and MPhil degrees in various areas of psychology. Supervisors: Dr Christine Leong, Dr Wong Tze Peng (School of Education), Dr. Marieke de Vries (Utrecht University), Dr Alessio Bellato (University of Southampton) Plurilingualism—the ability to communicate in multiple languages—has been associated with benefits on cognitive and social development. Research suggests that children who grow up speaking more than one language may show stronger executive function, which encompasses working memory, inhibition and cognitive flexibility. Furthermore, social cognition, or the ability to understand and navigate social interactions, may be influenced by a child's language proficiency, exposure, and the diversity of their linguistic environment. However, while these advantages are well-documented in typical children, the impact of plurilingualism on autistic children remains understudied. Given that autistic children frequently struggle with both executive function and social cognition, understanding how plurilingualism affects these areas is critical for developing effective support strategies. My research seeks to fill this gap by creating a comprehensive model that explores the relationships between plurilingualism, executive functioning, and social cognition in both autistic and non-autistic children in Malaysia. By examining how different dimensions of plurilingualism—such as language proficiency, frequency of use, and linguistic diversity—shape cognitive abilities and social understanding, this study aims to uncover potential advantages of plurilingualism in strengthening these areas. Malaysia’s unique linguistic diversity offers an ideal context for this exploration, as it serves as a rich resource for understanding how plurilingualism can support child development. Ultimately, the findings from this research will not only inform language education policies for all children but also provide valuable insights for autism service providers. khpy4wsn@nottingham.edu.my Supervisors: Dr Ahamed Miflah Hussain Ismail, Dr Polly Chen, Dr Fang Chee Mun Most women of reproductive age experience mild to moderate symptoms of premenstrual syndrome (PMS) which cause cyclically recurring disturbances in mood and cognitive functioning during the luteal phase of their menstrual cycles. Even without a clinical diagnosis, these impairments can be disturbing enough to interfere with their mental wellbeing, relationships, and productivity in both educational and occupational settings. As such, it is imperative to find ways of managing these disruptive symptoms that are accessible and affordable to improve the daily lives of impacted individuals from all walks of life. However, research into PMS is very much in its infancy, and has yet to be fully explored. My research aims to investigate mood disturbances, and perceptual and cognitive functioning in women with and without PMS. My research will also explore whether virtual exposure to natural environments can improve mood, and perceptual/cognitive functioning. The findings of my research will be useful in understanding the role of physical environments on PMS symptoms, and hopefully in turn allow for accessible and inexpensive digital methods of self-care for managing symptoms. hfycb2@nottingham.edu.my Supervisors: Prof Steve Stewart-Williams In accordance with the Sexual Strategies Theory (SST), proposed by Buss and Schmitt in 1993, humans have developed a wide range of mating strategies designed to improve mating opportunities, including both long-term and short-term relationships. These strategies which may vary in similarities or differences between males and females, are all directed towards the objective of maximising reproductive success. According to the theory, men typically exhibit greater eagerness in pursuing mates, while women tend to be more selective. Consequently, men are more inclined to engage in inappropriate behaviours to secure mates and enhance reproductive opportunities. Sexual harassment may not function explicitly as a strategy, but rather a behaviour utilised to obtain access to mates. However, whether the behaviour is perceived as harassment depends on the recipient’s reaction; if the behaviour is negatively received, it is classified as harassment, whereas, if it is positively received, it may simply be viewed as a positive sexual attention. Therefore, this study posits that the sex and level of attractiveness may influence the perceptions on sexual harassment. This is a questionnaire-based experiment in which vignettes will be utilised to depict a hypothetical scenario with actors: a pursuer, and a target. Participants will be presented with a vignette which depicts an interaction between the pursuer and target, followed by a set of questions in which the participants will answer based on the vignette. This study will examine physical attractiveness, focusing on how the attractiveness and sex of the pursuer influence the perceptions of both male and female participants. A cautionary note to readers, the intention of this experiment is in no way to justify, normalise, or endorse sexual harassment. Evolutionary psychology explanations of sexual harassment are strictly intended for research purposes and do not in any way, serve as a justification or excuse for such behaviour. On the contrary, greater knowledge of the nature and origins of harassment may improve our ability to curb it. sfynk1@nottingham.edu.my Supervisors: Dr David Keeble, Dr Martin Schuermann (UK campus), Dr Miflah Hussain Physical abnormalities in other people frequently arouse uneasy feelings – particularly abnormalities in hands, which are always on display. Hands are critical social cues that contribute to our interpretation of another individual’s intentions and thoughts, and humans are experts in evaluating other people’s hands. There is some evidence that the neural circuit underlies the high perceptual salience of distorted hands in social perception; however, little is known about the cognitive processes of human behaviour and eye movements. My research explores how distorted hand expression is processed in visual cognition. The visual search method and eye-tracking method (including pupil dilation) are used to analyse the visual stimuli of distorted hands. Additionally, little is known about the motor cognitive processing of static hands so motor cognitive methods are used to investigate this area. Finally, following on from my previous research in which event-related potentials were exploited to study distorted hands, another electroencephalography method (event-related desynchronisation) is being used here to explore the motor cognitive processes of static hands in neural circuits. Espírito Santo, M. G., Chen, H.-Y., & Schürmann, M. (2017). Lateralized occipito-temporal N1 responses to images of salient distorted finger postures. Scientific Reports, 7(1), 14129. hpxhc1@exmail.nottingham.edu.my Supervisors: Dr Marieke de Vries, Dr Maretha de Jonge (Universiteit Leiden), Dr Steve Janssen Autism Spectrum Disorder (ASD) is a neurodevelopmental disorder characterized by difficulties in social communication and interactions, and restricted, repetitive behaviours. Culture - as an environmental factor - might have an effect on ASD symptoms, but also on the diagnosis. ASD diagnosis, at least partly, relies on the judgment of social behaviour. Culture shapes norms and beliefs about behaviour, and what is perceived as normal or abnormal (social) behaviour is affected by culture. The perception of abnormal behaviour is influenced by culture, which affects the diagnosis of ASD. My research aims to investigate cross-culture differences in the perception of ASD traits, and the mental health of parents of children with ASD in different cultures. khpy5off@nottingham.edu.my Supervisors: Dr Christine Leong Xiang Ru, Dr Jessica Price English plays an important role as a global lingua franca in connecting people from different corner of the world. Hundred millions of people speak English as their native language, a foreign language (FL) or a second language (L2), resulting in many different varieties of Englishes. There are strong research evidences showing that variation in these speakers’ accent, phonemic pronunciation, stress, and intonation, caused by their native language interference affects intelligibility and comprehensibility of speech perception and production. The affective components associated with FL/L2 usage, for instance anxiety, can also be deemed unhelpful with its debilitating effect on communication. My current research aims to add insight on the psycholinguistics area by looking into the factors and effects of L2 anxiety associated with intelligibility and comprehensibility of speech perception and production. khpy6ckh@nottingham.edu.my Supervisors: Dr Miflah Hussain, Dr Hoo Keat Wong, Dr Steve Janssen, Dr Alejandro Estudillo (Bournemouth University) Recent studies argued that face recognition abilities could be quantified into a spectrum by using just a standardized test (Cambridge Face Memory Task, CFMT). Neurotypicals’ face recognition abilities were able to predict those with neurological deficit in face recognition, prosopagnosics, and those with exceptional face recognition abilities, super-recognisers, which reflects opposite ends of this spectrum. In light of that, investigating the differences at the basic level of face individuation (spatial frequency and holistic processing) between participants from opposite ends would provide further insight to face recognition abilities. My study aims to explore individual differences in face recognition and the specific mechanisms utilised that aids in better face recognition, which in return can be used to train those with poor recognition abilities. khpy6blq@nottingham.edu.my Supervisors: Dr Christine Leong, Dr Jessica Price, Dr Walter van Heuvan (UK Campus). Language ability has become an important criterion for university entry and some job appointments. Although the standardized IELTS and TOEFL could provide some indications of one’s English proficiency level, there is no easy measure to determine one’s language proficiency, especially for our national language – Bahasa Malaysia (BM). It also poses as a problem to linguistic research that targets bilingual populations who speak BM as their first language (L1) or second language (L2). There is no objective test that is easily accessible to examine the participants’ language ability. My current research aims at developing a Bahasa Malaysia (BM) translation norm database for English words, and subsequently creating a 5-minutes BM lexical test - BM LexTALE. The BM LexTALE devised can be used as a valid measure of BM vocabulary knowledge for BM L2 speakers, and potentially, BM L1 speakers. hpxsl1@nottingham.edu.my Supervisors: Dr Achille Pasqualotto, Dr Neil Mennie, Dr Alejandro Estudillo (Bournemouth University) Single-digit multiplication learning is a prerequisite skill in mathematics and it is critical for the learning of more advanced mathematics knowledge. Unfortunately, such skill is difficult for some students especially among children with mathematics difficulties (MD). Difficulties in learning multiplication table have important consequences. Children with poor multiplication skills are less competent in academic studies and are likely to experience poor mental health and the consequences also extends beyond school years as studies have found that children who have MD grow up to perform poorly in their professional career and receive lower income. As such, it is important to understand more about the numeracy literacy, possibly the cognitive and neural mechanism involved in single-digit multiplication before effective interventions can be carried out. My current research plans to unravel the mechanisms behind the single-digit multiplication and hopefully, the knowledge attained can be used for the development of the educational program in Malaysia and other developing countries. This study aims to use neuroscientific and educational approach to explore the mechanism that underlies the single-digit multiplication learning among low-multiplication fluency (LMF) and high multiplication fluency (HMF) participants. hpxms1@nottingham.edu.my Supervisors: Dr Yvonne Leung, Dr Jessica Price, Dr Polly Chen Degradation in communication skills and difficulties with independent functioning are the consequences of a progressive cognitive decline. Inability to perform daily routine tasks might lead to depression and suicide. Depression has been noted as the most common psychiatric disorder in elderly suicides, particularly in the presence of other debilitating illnesses. There is limited information on their prognosis due to high drop-out rates as the patient has to bear the cost of treatment and is not covered by the government. The aim of this research is to understand the challenges older adults face when their language ability is affected by late-life cognitive decline and develop appropriate compensatory strategy based on their language ability. There is presently no comprehensive evaluation being used in Malaysia and efficient methods of strategy to cope with language loss. In some situations where the native language is relatively less preserved than a language systematically acquired later, people are likely to have significant meta-linguistic knowledge to revert to. This may suggest they rely on two languages as a countervailing strategy to enhance communicative effectiveness. The objective of this study is to develop a comprehensive assessment of communication practices and investigate the occurrence of language switching among typical adults and adults with dementia. Based on the findings, a valuable database could be obtained. The development of an assessment tool will be valuable to clinicians as well as researchers to further investigate the communication process in language disordered population and develop intervention strategies to cope with their difficulties. hpxnr1@nottingham.edu.my Supervisors: Dr Ahamed Miflah Hussain, Professor Steve Janssen, Dr Isabelle Mareschal (Queen Mary University of London) When navigating a social world, successful interpersonal communication depends on accurately classifying other people’s facial expressions. Contextual cues such as body gestures and affective backgrounds are well known to bias classification of facial expressions. However, it is still unclear to what extent people would rely on contextual cues when they face difficulties in classifying facial expressions. These difficulties can originate from various causes, for instance, individual differences between perceivers (e.g., clinical traits such as autism) or ambiguities with the face stimulus (e.g., an obscured face). Therefore, my research aims to first measure individual differences and stimulus ambiguities that can influence the classification of facial expressions. Second, I aim to investigate how individual differences in expression classification and stimulus ambiguities can influence the susceptibility of individuals to contextual cues. My research could help identify how contextual cues can be used to rehabilitate those who have inherent difficulties in classifying facial expressions. hpynl1@nottingham.edu.my Supervisors: Dr Steve Stewart-Williams, Dr Christine Leong, Dr Fatimah Wati Halim (Universiti Kebangsaan Malaysia), Dr Tan Kok Wei (University of Reading Malaysia), Dr Andrew Thomas (Swansea University) There are discrepancies between attitudes about men and attitudes about women. This may be why reaction to research about male-favouring or female-favouring sex differences vary. Research about sex differences has always been quite controversial but some are more controversial than others, depending on the findings and how they are framed. Previous studies have shown that people tend to react more positively to sex differences that favour females rather than males. There are multiple possible reasons as to why this may be. My study aims to investigate attitudes about men and women as well as the reasons behind the way people react to research about sex differences. The study also investigates factors and how its manipulation can influence the way people react to these sex differences. Given that previous research has mostly been done with a sample that tilts to the left politically, this study also aims to recruit a more politically diverse sample. Delving deeper into the factors behind this phenomenon may also allow us to shed some light on the issue of gender parity or rather the lack thereof. hpyxw1@nottingham.edu.my Supervisors: Dr Jessica Price, Dr Hoo Keat Wong Bilingualism, the ability to read, speak, write and listen to more than one language, is an incredibly challenging task for the human mind. In practice, switching between languages in a conversation may seem simple. However, cognitively, the mechanism that allows for the seamless experience of juggling multiple languages based on the needs of the current interactional context is immensely complex. Research in this field concurs that the Executive Function (EF) system plays a central role enabling bilinguals to seamlessly switch between languages within a conversation. EEG and fMRI research has indicated significant differences in the structure, function and connectivity of a bilingual brain, in a way that enhances the executive functioning system. From greater grey matter volume to stronger and shorter N2/P3 complexes, current research are finding more and more impacts of bilingualism on the human brain. However, the methods by which the EF system is enhanced by learning multiple languages is still a matter of controversy. In my research, I explore how bilingual experience enhances the EF system using behavioural and neurophysiological data. The results of this research can hopefully push for a reformation of educational policies in Malaysia. One such policy that is impacted directly is the MBM-MBI policy implemented by MOE back in 2010. On paper, its noble goals should allow for an integration of bilingualism into Malaysia's educational system. However, in practice, students in government schools are only exposed to English during English classes, as the policy to teach Science and Maths in English (PPSMI) was abolished in 2013. By understanding how bilingual experience impacts EF system, my research hopes to push for policies that would see government schools integrating bilingual education into its core principles. hpxkc1@nottingham.edu.my Supervisors: Professor Steve Janssen, Dr Hoo Keat Wong Studies have shown that people suffering from depression and post-traumatic stress disorder (PTSD) often face difficulties in recalling past personal experiences. Despite explicit instructions to report specific events, depressed individuals often report fewer specific memories than people without depression. People with PTSD, on the other hand, tend to report a strong sense of reliving when recalling traumatic events. These recollective experiences can be so vivid that the person is unable to distinguish them from reality. To treat people with depression and PTSD more effectively, it is vital to understand the fundamental processes underlying the retrieval of autobiographical memories. Although evidence suggests that autobiographical memory has a biological basis, the extent of its heritability is yet to be examined. My research therefore aims to estimate the environmental and genetic contributions to individual differences in autobiographical memory. To achieve this, I will examine how and to what extent the different dimensions of autobiographical memory are related. Additionally, I will also investigate whether the different dimensions of autobiographical memory are more similar in monozygotic twins than in dizygotic twins, which would suggest that these traits are to some degree, shaped by genetic factors. hpyka1@nottingham.edu.my Supervisors: Dr Wong Hoo Keat, Dr Marieke de Vries, Dr Polly Chen, Dr Tan Kok Wei (University of Reading Malaysia) Interest in the effects of meditation intervention has been growing gradually in the past two decades. According to a meta-analysis, meditation practice has been widely suggested to be effective in protecting mental health, not only in clinical populations but also in general populations. A number of studies across countries have shown that the Covid-19 pandemic is negatively affecting people’s mental health. Therefore, interventions are highly and urgently needed to alleviate the psychological impacts of people who are suffering depression, anxiety, and stress. There are limited studies looking at the effect of mindfulness breathing meditation for protecting mental health during the Covid-19 pandemic, and the acceptability of mindfulness breathing meditation practice remains unknown. On the other hand, accumulating research suggests the positive effects of meditation practice on cognitive aspects such as attention and memory performance. However, few studies look at the effect of mindfulness breathing meditation on cognitive performance, including inhibitory control, attention, working memory, and cognitive flexibility using a combination of electroencephalography (EEG) and eye-tracking methods. My project investigates the acceptability of mindfulness breathing meditation for protecting mental health during the Covid-19 pandemic and how meditation can affect attention and executive functions by using neurophysiological techniques such as EEG, eye-tracking, galvanic skin responses, and virtual reality. We aim to address how acceptability mediates the meditation effects on cognitive performance. hpxlh1@nottingham.edu.my Supervisors: Dr Polly Chen Sleep has a very important role in supporting cognitive function, and it has been linked to the maintenance of other vital biological functions. Sleep habits also tend to change across the lifespan, with sleep disturbances being more frequently reported in the ageing population. Ageing is also one of the largest risk factors in developing certain neurodegenerative disorders, such as mild cognitive impairments, Parkinson’s and some dementias. Much research has shown links between sleep, ageing and the development of neurodegenerative disorders, however the relationship between these variables are not well understood and are still being explored. My research aims to explore these relationships by looking at age-related sleep changes, the waking brain activity, as well as any age-related differences in brain activity when falling asleep using resting-state EEG recordings. By investigating these age-related differences, I hope to better answer questions as to why sleep changes emerge as we age, and how important those changes are to ageing healthily. More importantly, I also hope to outline potential interventions that might help combat sleeping problems, and also slow down the development of neurodegenerative disorders. hfyjh1@nottingham.edu.my Supervisors: Dr Polly Chen, Dr Wong Hoo Keat and Dr Yvonne Leung (University of New South Wales) Ageism is defined as the systematic prejudice, discrimination and stereotyping of one age group against another on the basis of one’s chronological age. Older adults are generally perceived more negatively by the younger generations. Unlike other forms of prejudice (e.g., sexual or racial), ageism has become accepted and institutionalised, and this may be a cause of concern in Malaysia as it becomes an ageing nation by 2030. One of the predictors of ageism is ageing anxiety. Defined as the fear and negative feelings associated with growing older, this phenomenon is manifested due to negative expectations and self-perceptions of ageing among younger generations. Ageing anxiety includes one's concerns with changes in physical appearance with increasing age (e.g., brow ptosis, forehead wrinkles). These facial ageing cues are found to directly influence face processing and are cues to age-related stereotypes. However, many studies that looked into ageing anxiety and ageism are susceptible to social desirability effects as they were conducted using various subjective self-report measures. To date, no studies in South East Asia have investigated ageing anxiety by using implicit measures such as eye-tracking and self-aged face. My research aims to investigate the implicit levels of ageing anxiety and attitudes of young adults towards older adults in Malaysia. To achieve this, the eye movements (e.g., fixation and gaze patterns) of participants will be explored as they view the “present” and the software-generated “aged” faces of the self, their friend and strangers. I hope to generate more objective methodologies to understand the attitudes of the young towards the older generations, in order to facilitate better intergenerational interactions and healthier ageing among older adults. hfykm2@nottingham.edu.my Supervisors: Dr Polly Chen, Dr Hafeez Ullah Amin, Dr Alfred Lim, and Dr Ahamed Miflah Hussain Ismail For individuals with mild Alzheimer's Disease (AD) or its precursor, Mild Cognitive Impairment (MCI), it is crucial to monitor the progression of their condition. This monitoring helps predict behavioural changes and allows for timely interventions. Previous research has demonstrated the effectiveness of the antisaccade task as a reliable method for detecting and distinguishing individuals with AD from those without dementia as well as to differentiate which prodromal and/or preclinical patients were at greater risk of developing dementia due to AD. However, implementing eye-tracking tasks in clinical settings poses challenges. Limited space, lack of necessary equipment, and the time and skills required hinder the use of conventional eye-tracking technology. Additionally, the substantial financial investment involved in acquiring and maintaining this equipment is a significant barrier. Therefore, a more practical system would be required to realise the benefits that laboratory eye movement measures in monitoring and assessing people's cognitive health could provide. My research aims to create a more accessible and cost-effective means to aid diagnosing dementia and its progression through saccadic eye movement tracking. I am working on validating a newly developed mobile application called MoDUS, which can track eye movements using an antisaccade task. This involves comparing the eye movement data collected through traditional eye-tracking tools with data collected through MoDUS. hfyml6@nottingham.edu.my Supervisors: Dr Wong Hoo Keat, Prof Steve Janssen, Dr Miflah Hussain, Dr Jasmine Lee (University of Reading Malaysia) In recent years, the steady rise of depression and anxiety has, in turn, cultivated many psychologists to come out with continuous research in the path of developing a more robust diagnostic tool and alternative intervention techniques that could predict and aid one's risk of getting depression and anxiety efficiently and accurately. Nevertheless, one fascinating aspect that could help in diagnosing depression and anxiety is diving into the visual scanning strategies, and the physiological biofeedback one demonstrates when viewing various emotional-facial stimuli. While past literature has revealed that both depressive and anxious individuals tend to exhibit a differential response (having a greater fixation count towards negative stimuli and overall higher production of sweat) when negative emotional-facial stimuli are presented as compared to healthy individuals, the current study wishes to explore a more in-depth understanding on how different emotional faces are being exhibited by individuals with depression and anxiety. The study hopes to investigate how different emotional-facial stimuli are being recognised (e.g., Angry vs Happy faces) and the specific Area of Interest (AoI) (e.g., facial features like eyes, nose and mouth) that the participants are actively fixating upon. The study will also measure the engagement vs disengagement bias (being atracted towards certain emotional stimuli) that one shows when various emotional-facial stimuli are presented. My research aims to investigate the visual scanning strategies and the physiological responses for emotional and attentional face processing in anxiety and depression by combining the Emotional Recognition task and the Attentional Response to the Distal vs. Proximal Emotional Information (ARDPEI) task with Eye-tracking elements, Galvanic Skin Response (GSR) and Heart-rate variability (HRV) sensors to create a concrete and robust study on the visual, neurophysiological, physiological biofeedback and behavioural response paterns of depression and anxiety individuals, which would aid in the cultivation of a more profound diagnostic tool in the world of depression and anxiety. hfyyc8@nottingham.edu.my Supervisors: Dr Wong Tze Peng, Dr Chong Shue Ling, Dr Alessio Bellato (University of Southampton), Dr Marieke de Vries (Utrecht University) Neurotypical children regulate their emotions by seeking support or engaging in self-soothing techniques before developing more refined strategies. However, autistic children may struggle to use the same strategies as neurotypicals to regulate their emotions because they are less flexible to changes in the environment. As such, many autistic children experience emotional dysregulation, which often leads to self-harming behaviors or temper tantrums that are difficult to control. There has been growing research suggesting that emotional dysregulation in autistic children may be bidirectionally associated with parental factors, potentially affecting family dynamics and educational approaches. My research aims to identify whether parental factors such as stress and perceived parenting competence, as well as the child's intolerance to uncertainty, contribute to emotional dysregulation in autistic children. I also aim to explore the specific factors that trigger meltdowns in children, which would be particularly helpful to understand, in detail, the experience of autistic children and their parents. The findings of my research would be helpful in designing innovative interventions to support autistic children in regulating their emotions, with potential benefits for the entire family. Furthermore, understanding what factors trigger emotional dysregulation in autistic children will be particularly helpful in preparing safeguarding measures to ensure that the child with autism do not unintentionally harm themselves or others during their episodes. hpxnl1@nottingham.edu.my telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}