{
    "url": "https://www.nottingham.edu.my/Psychology/Research/Sustainability-and-Liveability.aspx",
    "content": [
        {
            "p": "Our research focusses on providing adequate solutions for various questions associated with the sustainable development of society by employing psychological methods. Sustainability refers to a condition in which economic, social and environmental components are optimised, while taking into account indirect and long-term impacts. Liveability is the subset of sustainability that directly affects people in a community. It is crucial that a human-centred approach is taken to understand the underlying mechanisms of issues that are brought up within the topic of sustainability and liveability. With increasing population in cities, the concern for land scarcity is becoming more prominent. To accommodate a larger population within limited land, buildings tend to be built bigger and taller (extended to both above and underground), which means that more people are exposed to the indoor environment that does not have direct access to the outside. Thus, one of our main research themes is to develop pleasant enclosed spaces. Exploring the new media environment and distinguishing truth from nontruth is becoming more challenging as emerging technologies, such as virtual reality, augmented reality, artificial intelligence, bots and deepfakes, become more sophisticated. Thus, we attempt to understand what psychological factors might hinder the judgment of the public when it comes to unidentified information (mis/disinformation) in the media environment and what might influence subsequent behaviour following the encounter of such information. Eventually, our goal is to develop a programme to reduce the spread of dis/misinformation among the public. Digital government, or e-government, is the use of information and communication technologies to deliver service within government as well as between government and the public. With various risks that have been imposed on the global community such as COVID-19, the use of e-government is getting more attention. For sustainable interaction between the government and citizens to persist, the user interface of government websites needs to be maintained and improved consistently. By employing psychological interventions, we intend to increase user satisfaction on e-government. Associate Professor Georgios Christopoulos, Nanyang Business School, Nanyang Technological University, Singapore Professor Taejun (David) Lee, KDI School of Public Policy and Management, South Korea telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}