{
    "url": "https://www.nottingham.edu.my/Psychology/About/Careers.aspx",
    "content": [
        {
            "p": "A recent report by the Higher Education Careers Services Unit (external link) found that psychology graduates are among the most employable, and least likely to be unemployed, of any degree course. This is because a psychology degree \"provides students with an impressive range of skills that make them highly employable\" and \"helps prepare graduates for many different types of work.\" Graduating with a degree in psychology provides: Click here to see a list of destinations and opportunities our graduates have had access to in the past few years (PDF file). Many psychology graduates go on to use their psychological skills and knowledge in an applied setting. Psychologists work in many areas in the public and private sector, from schools and hospitals to management consultancies, high-tech industry and even professional sports teams. Here, we outline a few of these areas: Clinical and counselling psychology A clinical psychologist works with a range of patient groups, mainly utilising strategic therapies which address problematic thinking, feeling, and behaviours. This includes working with inpatients and outpatients diagnosed with illnesses like depression and schizophrenia, as well as providing services to those with less pronounced problems. Clinical psychology utilises evidence-based practices, and clinical psychologists often follow the ‘scientist-practitioner’ approach. Educational and school psychology A career in educational or school psychology involves working with children in home or school settings. The educational psychologist uses objective tests to investigate the causes of learning or personal difficulties that children might be experiencing. He or she will devise a programme of study that is suited to the special educational needs of the child. In this way, the educational psychologist will help the child to work through emotional problems and learn effectively. If it appears that the child is suffering from a developmental disorder, then the educational psychologist will consider referring the child to a clinical psychologist. Engineering psychology Engineering psychologists conduct research on how people work best with machines. For example, how can a computer be designed to prevent fatigue and eye strain? What arrangement of an assembly line makes production most efficient? What is a reasonable workload? Most engineering psychologists work in industry, but some are employed by the government, particularly on Defense projects. They are often known as human factors specialists. Sports psychology The work of a sports psychologist is probably less well known and yet these professionals increasingly play a big role in major sporting events, such as the London Olympic games. Athletes need coaching not just in the physical aspects of their sport but in the psychological aspects as well, ranging from mentoring on having a winning attitude to guidance on the ideal regime for preparing to compete. Sports psychologists recognise that the mind as well as the body has to be in optimal condition in order to win gold medals. Forensic psychology Forensic psychologists apply psychological principles to legal issues. Their expertise is often essential in court. They can, for example, help a judge decide which parent should have custody of a child or evaluate a defendant's mental competence to stand trial. Forensic psychologists also conduct research on jury behaviour or eyewitness testimony. Some forensic psychologists are trained in both psychology and the law. Health psychology Health psychologists specialise in how biological, psychological, and social factors affect health and illness. They study how patients handle illness; why some people don't follow medical advice; and the most effective ways to control pain or to change poor health habits. They also develop health care strategies that foster emotional and physical well-being. Psychologists team up with medical personnel in private practice and in hospitals to provide patients with complete health care. They educate medical staff about psychological problems that arise from the pain and stress of illness and about symptoms that may seem to be physical in origin but actually have psychological causes. Health psychologists also investigate issues that affect a large segment of society, and develop and implement programs to deal with these problems. Examples are teenage pregnancy, substance abuse, risky sexual behaviours, smoking, lack of exercise, and poor diet Industrial/organisational psychology Industrial/organisational psychologists apply psychological principles and research methods to the work place in the interest of improving productivity and the quality of work life. Many serve as human resources specialists, helping organisations with staffing, training, and employee development. And others work as management consultants in such areas as strategic planning, quality management, and coping with organisational change. Some psychology students progress to a career in research, in either the public sector (usually a university or a hospital) or the private sector. There are many different areas of psychological research and some of these are outlined below. Cognitive and perceptual psychology Cognitive and perceptual psychologists study human perception, thinking, and memory. Cognitive psychologists are interested in questions such as, how does the mind represent reality? How do people learn? How do people understand and produce language? Cognitive psychologists also study reasoning, judgment, and decision making. Cognitive and perceptual psychologists frequently collaborate with behavioural neuroscientists to understand the biological bases of perception or cognition or with researchers in other areas of psychology to better understand the cognitive biases in the thinking of people with depression, for example. Developmental psychology Developmental psychologists study the processes through which people come into being - how they experience and are shaped by the world around them. Most emphasis is on the rapid changes during infancy and childhood, as well as the interactive effect of parents and offspring. Perhaps the most enduring and intriguing question concerns the relative influence of ‘Nature vs Nurture’. With advances in molecular genetics complimenting decades of systematic behavioural research not only are answers being revealed, but parenting, teaching, and clinical interventions are being refined. At the other end of the life span, as life expectancy in Malaysia rises, developmental psychologists are becoming increasingly interested in aging, especially in researching and developing ways to help elderly people stay as independent as possible. Evolutionary psychology Evolutionary psychologists study how evolutionary principles such as mutation, adaptation, and selective fitness influence human thought, feeling, and behaviour. Because of their focus on genetically shaped behaviours that influence an organism's chances of survival, evolutionary psychologists study mating, aggression, helping behaviour, and communication. Evolutionary psychologists are particularly interested in paradoxes and problems of evolution. For example, some behaviours that were highly adaptive in our evolutionary past may no longer be adaptive in the modern world. Neuropsychology Neuropsychologists (and behavioural neuropsychologists) explore the relationships between brain systems and behaviour. For example, behavioural neuropsychologists may study the way the brain creates and stores memories, or how various diseases and injuries of the brain affect emotion, perception, and behaviour. They design tasks to study normal brain functions with new imaging techniques, such as positron emission tomography (PET), single photon emission computed tomography (SPECT), and functional magnetic resonance imaging (fMRI). Clinical neuropsychologists also assess and treat people. And with the dramatic increase in the number of survivors of traumatic brain injury over the past 30 years, neuropsychologists are working with health teams to help brain-injured people resume productive lives. Social psychology Social psychologists study how a person's mental life and behaviour are shaped by interactions with other people. They are interested in all aspects of interpersonal relationships, including both individual and group influences, and seek ways to improve such interactions. For example, their research helps us understand how people form attitudes toward others, and when these are harmful—as in the case of prejudice—suggests ways to change them. Social psychologists are found in a variety of settings, from academic institutions (where they teach and conduct research), to advertising agencies (where they study consumer attitudes and preferences), to businesses and government agencies (where they help with a variety of problems in organisation and management). Many psychology graduates choose to apply the skills and knowledge that they have gained through their studies to careers in other areas. Some of the more popular destinations are outlined here. Social work Social workers help troubled families, disabled or elderly people or those who have drug or alcohol addictions. They may provide help and support in the community or in sheltered accommodation such as old people's homes or rehabilitation centres. Human resources Human resources professionals work within organisations, recruiting personnel and providing training to achieve a happy, productive workforce. Psychology graduates' understanding of the interactions of individuals and groups makes them highly sought-after for HR roles. Management consultancy Management consultants work with businesses and organisations to ensure that they are using the best practices in their processes, staff management and business model. Psychology graduates are often employed in this area for their knowledge of human interactions and ability to collect and analyse data to come to well supported conclusions. Marketing, sales and public relations Psychology graduates often apply their skills and knowledge in marketing, PR or sales, using their knowledge of people's attitudes and desires to ensure a powerful message is communicated to the public, in order to promote products or services offered by organisations. Market research Market researchers use the questionnaire design, survey and data analysis techniques learned by psychology graduates to find out information about people's beliefs, desires and preferences, in order to allow companies to design products or marketing campaigns to suit the market's needs. This page is adapted from a longer, excellent article on careers in psychology by the American Psychological Association (APA). telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": [
        "pdf_files/Psychology-Careers-survey.pdf"
    ]
}