{
    "url": "http://www.nottingham.edu.my/Psychology/Research/Memory.aspx",
    "content": [
        {
            "p": "One of the most consistently observed effects in autobiographical memory is the reminiscence bump. Whereas people tend to have hardly any memories of personal events from the first three or four years of their lives, they tend to recall many memories from the five to ten most recent years of their lives. Besides these two principal effects, people also tend to recall more personal events from the period in which they were between 10 and 30 years old, a finding commonly known as the reminiscence bump. Despite the robustness of the reminiscence bump, there has not been much agreement about its underlying mechanisms. In our research, we focus on biological factors, such as the rise and fall of cognitive abilities across the lifespan, and cultural factors, such as cultural life scripts. Besides these two mechanisms, we also examine methodological issues, which may influence the retrieval of autobiographical memories. To understand better how autobiographical memory operates, it is important to examine for which purposes people use their autobiographical memories. According to the tripartite model of autobiographical memory functionality, there are three groups of functions. Past experiences are used to prepare for future actions and to cope with current problems, they are used for forming and maintaining emotional bonds, and they are important for establishing a sense of identity over time. However, an additional function of autobiographical memory might be emotion regulation. When people feel badly, they might think or talk about past experiences to improve their mood. Our research group is currently developing measures, in which a fourth subscale that would measure emotion-regulation is added. Psychological distance refers to how far and how long ago an event feels to a person remembering the event and how distant this person feels from their ‘past self’ who experienced the event. Recent research has shown that people with more depression symptoms feel psychologically distant from positive events and people with more PTSD symptoms feel psychologically close to negative events. Although the ability to alter the psychological distance of positive and negative events seems to be related to depression and PTSD, little is known about how psychological distance can be manipulated to make favourable events feel closer and unfavourable events feel more distant. Our research examines two cognitive factors that might be used influence psychological distance: Recollective experience and vantage perspective. Psychological distance refers to how far and how long ago an event feels to a person remembering the event and how distant this person feels from their ‘past self’ who experienced the even. Importantly, memories related to a current self-concept tend to be recalled from a field perspective and might therefore feel psychologically close, whereas memories related to a past self-concept are often recalled from an observer perspective and might therefore feel psychologically distant. Because people can be instructed to recall memories from either a field or an observer perspective, undergraduate projects could examine whether vantage perspective influences psychological distance. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}