{
    "url": "https://www.nottingham.edu.my/Psychology/Research/Evolution-Human-Behaviour.aspx",
    "content": [
        {
            "p": "Our research revolves around the idea that theories from evolutionary biology can shed light on human psychology. In particular, we’re interested in the evolutionary origins of altruistic behaviour and human sex differences. Kinship, Altruism, and Morality If evolution is all about the survival of the fittest, why are people usually quite nice to each other? If natural selection favours organisms that aid their relatives, why are people often nicer to their friends and lovers? Is morality a part of human nature - or is it a social institution designed to control and constrain the destructive aspects of human nature? Human Sex Differences How do nature and nurture conspire to produce average differences between men and women? How different are the sexes, anyway? Are we highly dimorphic like peacocks and deer? Or are we relatively monomorphic, like gibbons and sea dragons? And why is research on sex differences so controversial? Do people react more negatively to research findings that favour males than those that favour females? Our recent research suggests that they do... 1. Reactions to Research on Sex Differences Focus: How people react to sex-differences research depending on factors such as whether the differences favour men or favour women and whether the lead researcher is a man or a woman. 2. Evolution of Human Sex Differences Focus: Average sex differences in traits such as mate preferences, physical aggression, and attitudes toward relationships. 3. Kinship Psychology Focus: Patterns of help among relatives, friends, and romantic partners. Steve’s new book, The Ape That Understood the Universe, hit the shelves in 2018. It opens with a question: How would an alien scientist view our species? What would it make of our sex differences, our child-rearing patterns, our moral codes, languages, and science? The book tackles these questions by drawing on ideas from two major schools of thought: evolutionary psychology and cultural evolutionary theory. You can read an excerpt here. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}