{
    "url": "https://www.nottingham.edu.my/Psychology/Student-experience/Student-Internships.aspx",
    "content": [
        {
            "p": "To get a taste of and experience in working in the field of Psychology, students can do an optional internship over the summer between year 1 and 2, or between year 2 and 3. The internship can be either clinical-, scientific- or business-focused. The internship will prepare students for the job market, giving them hands on experience and an opportunity to expand their networks. There are three workshops throughout the summer for students to share experiences, and each student is assigned to a mentor. The internships module is part of the Nottingham Advantage Awards (NAA). Students will receive a certificate and study credits (10), and completion will show on their transcript. Students may visit the NAA webpage, linked on the right, for more details on the programme. My three-month internship at Poliklinik Khafidz and with the team at Persatuan Insaf Murni was an eye-opening experience. Working there has made me realise how vital, yet underappreciated, healthcare workers and social workers are for a country that has rampant substance abuse and HIV/AIDS problems. As an intern, I had the opportunity to learn the various steps of the recovery process among Intravenous Drug Users (IDUs), from being a frequent drug user to achieving abstinence. I also learned the theoretical and clinical aspects of addiction from the most commonly abused drugs to the services provided to help patients achieve abstinence. Under the supervision of Dr Khafidz and his staff, I applied this knowledge by conducting interview sessions to further understand the behavioural, cognitive and social contexts that shape the psyche of drug addicts to further assist them in their recovery. I also had various opportunities to participate in outreach programmes that raise awareness on methods to reduce the spread of HIV/AIDS, ranging from the Needle-Syringe Exchange Programme (NSEP) to programmes advocating for safer sex among the LGBT community. The effort Dr Khafidz and his team has made into improving the lives of the community has inspired me to assist underprivileged persons, especially drug addicts seeking recovery, and to combat the stigma attached to them by the general Malaysian populace. I would like to thank Dr Marieke and the School of Psychology for selecting me to participate in this internship with Dr Khafidz and his team. It was truly an honour working with such highly motivated and passionate people. My internship as a research assistant at the University of Nottingham Malaysia was a fruitful experience both professionally and personally. During my internship, I was among the few individuals involved in establishing Nottingham’s very first Twin Registry. Twin research is vital to understanding the interactions between genes and the environment, and this registry acts as a database that stores information about the twins who have and want to participate in future research projects. Currently, Nottingham’s Twin Registry is the only active twin registry in Malaysia. I was assigned to various tasks throughout my internship, and among them was data collection. I carried out various neuropsychological tests and also administered questionnaires to both fraternal and identical twins from around the Klang Valley. Meeting people from different backgrounds during recruitment greatly improved my interpersonal and communication skills. Besides that, I was also involved in organising and marketing a Twin’s Festival that was held at Monash University, to recruit more twins for the registry. Although I had only interned for a period of three months (June to August 2019), I learned a great deal of skills required to be a good researcher. I was also grateful for my supervisor, Dr Steve Janssen, who supported and encouraged my endeavours throughout my internship. My colleagues were wonderful to work with and were supportive as well, which created a pleasant work environment. Essentially, this internship reinforced my aspiration to pursue psychological research as a career and helped me apply the skills and theories learned in the classroom into real world situations, especially during data collection and data analysis. The experience was an eye-opener as it made me realise that I truly enjoy doing what I have been studying for all along. I highly recommend the research internships offered at the University of Nottingham for aspiring researchers. I undertook my summer internship on campus and was supervised by Dr Miflah for two months. There were many things I learned during my short summer internship. I was given the opportunity to design the research experiment, which focused on the functional role of adapting to natural and man-made scenes in a visual search task. I then polished my skills in creating the experiment for the participants through PsychoPy, a visual builder for psychophysical experiments that runs on the Python programming language. I also gained exposure to MATLAB, another programming software. These skills are essential to me for a future research career. Together with three classmates also supervised by Dr Miflah, we held a journal club to supplement the research work we did over the summer. For this activity, we took turns every week to present academic papers. I found it to be effective and advantageous as I got to learn how to skilfully read scholarly articles and highlight key points. The best part about journal club was when we discussed the papers: we got to listen and share our opinions on research relevant to our summer work. This activity also trained me to generate ideas for future psychology research topics. Apart from providing practice and preparation for my final year project, this internship also allowed my soft skills to blossom. I first participated in this internship with few expectations that it would impact and benefit my life. However, I have picked up much knowledge and skills throughout the internship, handled difficult situations that brought me discomfort, and overcame some of my shortcomings. I understand now that personal development is necessary to help me define myself to others, and to drive me to become the best version of myself. I was allocated to SOLS Health for a four-month internship. SOLS Health is a behavioural therapy centre that provides accessible and affordable psychological services for all communities. Initially, I was assigned to client management and performed administrative tasks such as answering calls, speaking to clients, entering data and maintaining client records. I was also in charge of organising the assessment tools used for clients’ therapy sessions. Later in the internship, I was tasked with a variety of roles. One of them was planning interactive activities and free mental health screenings where I had to work closely with counsellors and clinical psychologists. I also acted as a liaison for the Women Aids Organization (WAO), coordinating with SOLS Health on mutual client management, and I was also encouraged to be actively involved in their outreach programmes. Through the various activities conducted by SOLS Health, I became more knowledgeable and aware of mental health concerns in different communities. This experience has also improved my communication skills and confidence. I was able to make connections with several clinical psychologists and counsellors while working at SOLS Health, and I had the opportunity to learn from their experiences and the guidance they provided me. The experience definitely made me think about careers I could pursue after graduating. The School of Psychology at UNM provided information about the internship programme by listing down several companies and what they offer to students. The school also prepared and guided us on what companies expect from interns such as work ethics by hosting presentations and sharing of experiences from other students. I would recommend SOLS Health to those that want to have an in-depth understanding of what professionals in the field of psychology do in a behavioural therapy centre. The people I worked with were motivating and passionate individuals, which contributed to a positive working environment. My internship was with Adapt Enrichment Centre in Ara Damansara. Adapt Enrichment Centre aims to provide early intervention programmes for children who suffer from Autism Spectrum Disorder (ASD). An essential goal of these programmes is to prepare the children for admission into mainstream educational institutions. During my three-month internship, I was assigned to attend to the needs of children and teach Bahasa Malaysia. The other subjects taught in the academic programme consist of languages, mathematics, science, physical education, music, social skills, social studies, and practical life skills. The academic programme runs from 8.30am to 2pm every Monday to Thursday, while it runs from 8.30am to 1pm on Fridays. Every Thursday, the children are engaged in outdoor activities such as futsal and swimming. Occasionally, the children are taken on educational trips to places such as the cinema, and a dinosaur-themed amusement park and exhibition. One of the challenges I faced was dealing with children who were experiencing intense responses to overwhelming situations, or meltdowns. These meltdowns would often lead to aggressive behaviours such as biting, hitting and scratching. Another challenge I faced was the inability to comprehend the children’s needs as some of them had difficulties in expressing themselves or act inappropriately in social interactions. To overcome these challenges, I developed effective methods in communicating and interacting with the children by always being patient, ignoring attention-seeking behaviour, inducing a calming environment, showing interest and demonstrating love and affection. I trained myself to sense and identify the early signs of a meltdown, and I became more confident in handling volatile situations. These skills do not apply to all children with ASD. It was crucial for me to understand that sufferers of ASD exhibit a spectrum of symptom types and severities, and I should make the effort to understand them and their needs. Indeed, I developed a close relationship with the children not only by putting the skills I learned into practice, but also by tailoring my approach to each child under my care. Having hands-on experience allowed me to learn more about teaching children with ASD. Generally, children with ASD are visual thinkers and lessons were often taught with visual images, videos and experiments. It was even more necessary to engage nonverbal children through other senses such as vision and touch, and this could include pointing to objects and using electronic devices such as iPads. I also found three techniques to be helpful from observing other teachers as well as testing them out in my own classes: using repetition to sustain the children’s attention on the task, prompting them to participate at certain points during the class, and offering them words of encouragement and compliments to create a safe environment for them to learn. Although it was challenging to ensure my students understood what was being taught, I felt a great sense of pleasure when they were able to complete tasks such as completing worksheets and answering questions correctly, as this meant that they were on their way to speaking Bahasa Malaysia fluently. I am thankful for the School of Psychology in informing me of and securing this internship position. Despite it being difficult at first, I gained a better understanding of children with ASD through my teaching role. I will forever cherish and value the many rewarding moments of my internship. For my internship, I worked on campus as a research assistant with Dr Marieke from June to July. Throughout the internship I completed tasks for both Dr Marieke and her postgraduate students. These included data collection, data analysis, data sorting, questionnaire scoring, web design, experiment design, school visits, qualitative data transcript review, qualitative application analysis, journal analysis, Java troubleshooting, language translation, as well as timekeeping and note-taking during the postgraduate sharing session. It was a pleasant experience as I was able to hone skills such as scoring online questionnaires directly, sorting data more efficiently on statistical software, and running online experiments via a host website (Pavlovia). I also practiced observing and reflecting on what I could do to improve the quality of an experiment. This was useful for giving me insight on what I should consider when designing, conducting and analysing research. I applied many things I learned in class such as statistical analysis, experimental programming and qualitative research techniques to the tasks assigned to me. Having prior knowledge allowed me to understand the material better and have more in-depth discussions regarding research. Additionally, I had the opportunity to dabble in a personal interest of web design, and I learned much on how to sustain participants’ interest and engagement on psychological assessments. I especially liked having the freedom to work from home, which allowed me to complete my tasks as an intern while being with my family. I was also extremely fortunate to work alongside such amazing classmates who made the internship experience one that I enjoyed and now miss dearly. I am grateful to have had the opportunity to work for my kind, patient and understanding lecturer. As a person who gets easily overwhelmed and anxious, working with Dr Marieke has challenged me to step out of my comfort zone without sacrificing my personal wellbeing. The advice she has given me throughout and beyond the internship has given me the confidence I needed to complete my degree successfully and to look forward to continuing my postgraduate studies. My internship from June to August 2019 was at Me Books Asia, a company that has created an interactive storytelling app for children and is branching out to other creative projects. As I was placed in the marketing department, I was assigned mainly to market research, although I was fortunate to be able to provide assistance to coordinators that planned activities and events for parents, children and educators. One of these events was called Townhall. It was held to promote familial bonding through a storytelling and craft session, where different families came together to create memories and experience fun moments. I enjoyed being part of the team for this event as it was very engaging and fun, and I was awestruck by the participants’ imagination and creativity. Among the other tasks assigned to me was to provide customers information and direct them to appropriate staff members who could better handle their requests. I also organised digitised records for easy updating and retrieval, and I analysed the company’s Search Engine Optimisation (SEO) goals and presented my findings to the marketing director. I enjoyed working with my colleagues in the open office space where we were able to work together closely and efficiently to achieve shared goals. This was possible due to the relaxed working environment, which made me feel that I was a welcome addition to the team. I was able to comfortably experience conducting market research in a corporate setting, which opened my eyes to the possibility of future careers involving this skill. The School of Psychology was instrumental in securing the position for me since it is quite difficult to obtain a psychology-related job in Malaysia not in Human Resources nor in a medical setting. I want to thank them as well as my direct supervisor who was kind, patient, and who motivated me to challenge myself and think ahead to help the company. This internship has certainly helped me grow and broadened my views of the working world. I worked with People Psyence for three months in 2019 under the School of Psychology internship programme. During that time, I worked with my supervisor on Human Resources-related research and as a facilitator in awareness campaigns on mental health in corporate organisations. It was an amazing and insightful experience as I saw how psychology can be applied to the workplace. I am truly grateful to the School of Psychology for introducing me to People Psyence and providing the documents needed to secure my position. They also visited me once in my workplace to ensure that I was taken good care of. The internship experience increased my confidence pursuing a career in psychology and I gained valuable knowledge over the three months. This internship has also showed me the versatility and ubiquity of a psychology degree in all kinds of industries. From mid-June to the end of August 2019, I worked as a Human Resource Services intern at the Sunway Lagoon theme park in Subang Jaya, Selangor. I applied for and obtained the internship through the Nottingham Advantage Award (NAA) internship module, which listed Sunway Lagoon as a potential company for students to seek internship opportunities. I applied for the role to challenge myself and go beyond my comfort zone, as I have always felt that I would not be able to work well in a traditional office setting. The School of Psychology provided comprehensive information on each company’s internships, which eased the process for us to select our preferred companies, and eventually assisted me in securing the role. My NAA mentor connected me to the Head of Recruitment in Sunway Lagoon, and I secured a face-to-face interview at the company to discuss the nature of my employment. My role was mainly to support the Human Resources Department in administrative duties and to attend to staff queries on weekdays, from 9am to 6pm. I also assisted in filing, documentation, updating and maintaining HR records, as well as arranging pre-employment processes and interviews. As a department, we also organised and conducted a variety of events for the other staff. I familiarised myself with the various full-time staff, part-timers, foreign workers, interns and contract workers in order to provide better assistance to them, especially since Human Resources was involved in the onboarding process of new employees. The office was located in the middle of the theme park, and as I walked through the bustling crowds to get to work every day, I couldn’t help but feel cheerful and alive. The internship taught me important lessons for my career and future. Being on the job dispelled my fears and misconceptions about working in an office setting. I learned about corporate organisations, daily operations and staff welfare too. I had the opportunity to reflect and work on my shortcomings; as I am an introvert, I had to push myself to take the initiative to meet new people and network more. I also had to be responsible for and perform well on the tasks assigned to me. This experience has taught me more about the world and about myself. I gained a new respect for people struggling to make ends meet, and I have a clearer picture of what I see myself doing in the future. I am grateful for the internship and would like to thank Sunway Lagoon and the School of Psychology for making it happen. I did my internship for two months in 2019 in Tree Top International School, which uses the Montessori education system. The school is an inclusive school that also accepts high-functioning special needs children, and they accomplish this by using various teaching methods for their students’ different adaptation levels. Students are not segregated by age, but by their level of maturity and academic adaptation. Each class consists of less than 20 students, and the teacher-to-student ratio is 1:5. This way, the teachers work closely with each student for each subject. The school also houses a sensory gym where special needs students go through a sensory diet every morning before class begins. For the first month of my internship, I was tasked to monitor how the children in the higher elementary class are taught in the classroom. This class consisted a total of 12 students from the age of 11 to 13 years old, with two boys who were on the autism spectrum, and another with Asperger’s syndrome. I was really intrigued by the way the children were taught, which encouraged the teachers and students to bond with each other. This included a sharing session led by the teacher, as well as the students preparing to have recess by setting the tables with cutlery and plates. Two weeks in, I was given the chance to lead a lesson on World History, specifically on World War 2. It was a great chance for me to not only educate myself more on the topic, but also translate what I learned into something the students could understand and find interesting. It was important for me to connect with each child in the class, and I used pictures and games to engage the children in the lesson. For the second month, I shadowed the special needs coordinator in charge of the sensory gym. I worked with children with Down syndrome, Asperger’s syndrome, and children with sensory processing disorder on their different and customised exercise routines. I joined the Read and Cook programme organised by the school to train a handful of special needs students to cook simple meals and make coffee from scratch. I was also responsible in conducting and documenting the Lego To Play classes, where all children could learn moral values while expressing themselves through building Lego models. This internship has definitely been fruitful for me. I believe that I will be able to use what I have learned and relate it to what I study in class. I also believe that undertaking internships will help me choose my career path in the future as I am able to find out what piques my interest. I started my research internship at the University of Nottingham just as I would at a regular workplace: meeting the team led by Dr Miflah, being assigned to a project, setting goals and expectations, scheduling meetings, etc. The process remained fairly standard except for one major difference—it was all done online, from start to finish. Having never been home-schooled or even entertained the idea of remote learning, I was entering unknown territory, and it was already turning out to be quite the experience. Going online did not seem like much of an issue at first. In fact, it felt like a miracle to be able to go back home and still do an internship. However, within the first few weeks I quickly realised that telecommunication posed a barrier as I find it difficult to communicate face-to-face, let alone virtually. I had to get used to facing a laptop screen for meetings and understanding the flow of conversation despite the connection problems, anxiety, and time zone differences. Over time, it became easier as I adjusted to this strange new mode of working. We found that we worked best by limiting the team meetings to weekly updates and a journal sharing session, and anything else would be reported through detailed emails. As a research intern, I conducted a study on the topic of my choosing, which was sarcasm. I worked on the findings of a former third-year psychology student by honing her research question (contextual information helps recognition of sarcastic smiles) into a more specific one (which of visual and auditory contextual information is the strongest factor in the recognition of sarcastic smiles). To do this, I read relevant journal articles, reviewed the available data, and fleshed out the experimental design with my supervisor. I knew research was difficult, but I may have underestimated how difficult it could be—I felt as if I had entered the 'boss level' of my practical methods class without having enough experience to return unscathed. The complexities and difficulties research posed included having to adopt a rigorous thought process, dealing with various things going wrong, and finding solutions that are not always obvious at first. All I had to show for the first month-and-a-half of my two-month internship was infinite patience wrangling with PsychoPy, an experiment builder software, and Pavlovia, the online experiment hosting website synchronised with PsychoPy. At the time of writing, I am still in the piloting stage of the experiment, constantly refining my experimental design, which indeed reflects the iterative component of the research process. The skills I developed and the knowledge I gained in the past two years of my undergraduate degree were definitely put to the test here, and I was grateful for my supervisor who remained flexible, understanding and optimistic even when all I could submit by every weekly deadline was a new problem that I had absolutely no idea how to deal with! I have learned much from this internship, not only in terms of academics but also in terms of my personal development. I was constantly challenged to adapt to increasingly demanding tasks and forced out of my comfort zone: I had always programmed experiments together in a team for my practical classes, but now I was assigned to lead this project independently, with minimal supervision. I soon realised that there was an enormous gap between the knowledge I had and the practical skills I needed to successfully use that knowledge. I resolved to keep an open mind, to learn regardless of the outcome, and to enjoy the research process even though at times I was not able to meet my daily and weekly goals. The internship opened my eyes to my strengths and weaknesses, research and future career prospects, and I am sure the skills I developed during this internship will be valuable in any line of work I choose. My internship lasted from June to September 2020 at The Happy Leaves Autism and Special Needs Therapy Centre. My initial choice was to do an internal internship with the School of Psychology, but it was cancelled at the last minute due to the COVID-19 pandemic. I eventually chose this external internship with The Happy Leaves as I wanted some exposure to work in a psychology field. I appreciate both the school for being considerate and lenient in the application deadlines for internship placements, as well as Dr Marieke, the internship supervisor, for guiding and helping me with my questions. As it turned out, the internship took place at just the right time: between the first and second Movement Control Orders imposed by the Malaysian government, and I am grateful that it happened this way. In my psychology classes, I had learned about behavioural therapies such as Applied Behaviour Analysis (ABA) as tools to help children cope with their autism. However, the centre showed me other ways to approach the same issues, by using an integration of behavioural and developmental theories known as Integrated Behaviour Therapy (IBT). As this was a new topic to me, I was fortunate to be able to have a one-on-one briefing session with my supervisor, where I was able to ask questions and learn more about the process. My supervisor was also attentive and provided the guidance that I needed, including asking me questions and testing my understanding of the IBT process. One of my first tasks was preparing materials such as worksheets and art and craft for the therapy sessions, keeping in mind that each child would not have the exact same therapy program, but a tailored one to address their individual needs. Preparing these materials awakened my inner child and certainly helped me to empathise stronger with the children. I also had the opportunity to participate in case discussions and general meetings where I could suggest ideas as well as learn more about how the centre operates. As I became more confident in my skills, I was invited to attend briefings and practical training on various topics like psychological assessments, play therapy and counselling. The briefings on psychological assessments was the most interesting to me, as I got to see in person these assessments such as the Wechsler's Intelligence Scale for Children (WISC) that I had only briefly studied in my classes. The assessment manuals, stimuli and scoring sheets were made available for reference, and I enjoyed reviewing these materials. The centre ensured that I got all the knowledge I could, and that is what I liked the most about this place. Finally, I got the chance to shadow the therapists in the centre and to observe their daily practices. In some sessions, I acted as a prompter by demonstrating physical actions for the children. This included holding their hands to guide their motor movements while giving verbal or non-verbal instructions for them to perform to actions, such as touching their own heads or clapping their hands. I also assisted teams conducting the Diagnostic Interview, which is a pre-therapy consultation with both the children clients and their parents. The parents would be interviewed by a clinical psychologist while a junior therapist helped to take care of and assess the child. As I mainly assisted the junior therapist, I developed the skills to observe and assess the child's current developmental condition with reference to typical age-specific developmental milestones. Before this internship, I had very limited knowledge about what a clinical psychologist does. After working with clinical psychologists and special-needs therapists, I realised how interesting, meaningful and dynamic this job could be. Being with children for the past three months deepened my interest and passion in working with them; I had always enjoyed interacting with children but I did not expect that dealing with them in a clinical setting would be fulfilling too. I am more than grateful for this internship as I obtained valuable lessons I could never get from textbooks or lectures, which is to reflect on myself and to empathise. When I take the time to understand each child's difficulties, I begin to empathise with their hardships rather than simply treating them as another case study. I feel like I did not merely build a therapist-client bond, but also established precious relationships between me and the children. It was indeed an unforgettable experience! I interned as an undergraduate research assistant together with one other classmate under Dr Jess Price for two and a half months, starting on 15 June 2020. I did the first two weeks in the UK, and the remaining period in Malaysia. Throughout the internship period, we worked from home. During our first meeting, Dr Jess asked us about why we wanted to be research interns. I answered that I wished to experience what a professional researcher does for a living, as I felt that the research we do in our practical classes is different. We were assigned projects spaced out in time, which allowed us to produce satisfactory work. As the projects were different, I did and learned something new on each of them. I also realised that I had to treat the work more seriously and be more accountable for what I did. One of the projects was to compile and summarise survey data from the Inclusion in the Workplace webinars conducted by the university. I had to wake up in the middle of the night while I was in the UK to attend the webinars conducted in the morning in Malaysia! We compiled all the surveys from different webinars into one Word document, creating tables that summarise each question asked in the surveys. I had to communicate a lot with my colleague to divide the workload, standardise the formatting, and discuss ways to filter data so that our summary could convey ideas in a simple yet structured manner. Another project that I had the opportunity to take part in was to design an experiment that aimed to replicate and expand findings from Duñabeitia and colleagues (2018). Their research culminated in a dataset of 750 images, with each image named in various languages by a large number of participants. Our project was to add Bahasa Malaysia into the existing data and to test if there was a difference in naming preference between speakers of British English and Malaysian English. I felt the most excited about this project because it was the closest what I envisioned my internship to be. We spent much time discussing how to design the survey on Qualtrics to effectively collect samples, analyse data, and adjust the set of images to make it recognisable by Malaysians. We even pondered about the wording for each question. Subsequently, we ran a pilot test and modified our survey based on the feedback we received. The main takeaway from my internship is that I was required to learn various skills as I progressed within the protocols of conducting research. I needed to master critical thinking to design and implement my research, to reflect on my work and constantly find ways to improve myself, and to pick up computing skills to automate tasks and speed up my workflow. As computing skills such as mastery of Excel and knowledge of coding gives me an advantage as a researcher, I took up Python programming through online classes outside the university, which I still continue to learn even after this internship. Another crucial take away is knowing how to achieve more in teamwork. I found that teamwork is more than just working in a pair or in a group; rather, the ability to communicate on work assignments, issues and even asking more from others is essential. I consider myself a less demanding person: I would always try to complete all of the work by myself even when it is completely fine to share or hand over work to others as I thought it would be rude or I would be viewed as lazy if I did so. This internship taught me that sharing out the workload is essential to keep your stress at bay and improve teamwork. I do not think I could have gotten this experience elsewhere and I am grateful for getting this position. I am keen to pursue a research career in the future, and being exposed to work in the research field is exciting and insightful for my career decision. During the summer of 2020, I had the opportunity to complete a two-month research internship with Dr David Keeble on geometrical illusions. My responsibilities included performing a literature search, contributing to the programming of the experiment, hosting the experiment online on Pavlovia, gathering data and analysing part of the data. Throughout the internship, I gained insight the process of a research project, discovered a website useful for literature reviews and searches, delved into psychophysics, explored Pavlovia, and learned new data analysis tools on Microsoft Excel. I also trained myself to be flexible, adaptable, and to better manage my time. The experiences I have gained from this internship would be useful for my second and third year, as well as in the future. As the internship had to be conducted online, I personally felt let down and that I was missing something. I understand that this was due to the COVID-19 pandemic, but I felt that I could have done more in a face-to-face internship. Nevertheless, doing it online has given me the opportunity to learn new and different things that I would not have the chance to learn if I had done my internship in person. I took advantage of the Nottingham Advantage Award (NAA) internship module that the university offers to aspiring high-achiever students. The workshops conducted by lecturers and peers who have done or are doing their internships was really helpful and their advice would definitely benefit me in the future. Overall, the internship has been a pleasant, enjoyable and enriching experience, for which I am very grateful. In the summer of 2020, I interned at a leading social enterprise called Care2Run. It is an organisation with a vision to transform under-served youth through sports and one-on-one mentoring programmes. We ran an online exercise event (FunXercise) every Saturday with the youth as well as on-site participants at Taman Aman Park, Petaling Jaya, where each intern is paired up with a differently-abled mentee. Through this activity, I learned high-quality coaching and mentoring skills as tools to engage differently-abled individuals. Besides FunXercise, I was also involved in various microprojects which included developing standard operating procedures at the workplace during the COVID-19 pandemic, liaising with universities for internship collaborations, as well as planning and executing a monthlong dance campaign. I was able to develop and improve myself through the different projects that I worked on. Care2Run was a safe place for me to make mistakes and to prepare myself for the working world. As I aspire to become a professional clinical psychologist, coaching and mentoring differently-abled youths gave me a glimpse at what my dream job could entail. I was also blessed that I met very kind and considerate colleagues and supervisors. My supervisors were always there to help and provide guidance, and my colleagues were supportive as well. This friendliness was certainly due to Care2Run's emphasis on good relationships among its employees, including having us get together for a team lunch once a week. One of the most significant things that I learned during my internship was how to work under constraints. The heavy workload and the tight deadlines taught me to prioritise tasks according to how important they were. I found myself to be more efficient when taking one thing at a time. My ability to adapt and be flexible was also put to the test on the microprojects that I worked on — especially on the monthlong dance campaign, where there were numerous amendments and sudden changes from the planning stages up to the campaign's execution. I realised that I should always put my heart in my work and give it my 120%, and use the stress and pressure to motivate myself to perform better and better, day by day. I would like to end by expressing my sincerest appreciation to the School of Psychology for helping me secure an internship during the pandemic. Us students were blessed to have a variety of internship placements that we could apply to according to our interests. The School of Psychology connected me with Care2Run before my placement, so I was not completely clueless during the application and interviewing processes. I would like to recommend my juniors to take up an internship during summer break as the experience would definitely be valuable. I was allocated to SOLS Health for my summer internship as a research assistant. SOLS Health is a non-profit organisation that provides affordable and accessible mental healthcare services. The research team was very welcoming and cooperative, and working with them has helped me improve my teamwork and communication skills. Moreover, the team's passion and determination to help underprivileged communities in Malaysia has inspired me to investigate welfare issues faced by communities all over Malaysia that are sometimes overlooked by experts and authorities. I was involved in two research projects, one incorporating quantitative research methods and the other qualitative. I feel like I have learned more from these than I would from my classes. Additionally, SOLS Health provided online training sessions on topics such as domestic violence, major depressive disorder and child-centred therapy. Such valuable knowledge from these sessions will help me if I decide to enter the field of clinical psychology in the future. During the internship, I also had to adapt to changes in schedule, acclimate to different roles in various projects, accommodate new information, and build rapport with the people I work with, just like in a regular workplace. Doing this internship has helped me realise that I should seize opportunities and be exposed to new knowledge outside the classroom. The saying “you don't know what you don't know” was key here, as unless I happened to stumble across a particular topic, I would remain ignorant of it. For example, I was not originally familiar with topics such as the B40 community and the socio-economic aspects of Malaysia before interning at SOLS Health. Not only did I get to learn more about pressing issues in Malaysia, but I got to be involved in addressing these issues and hopefully made a change for the better. All in all, my time at SOLS Health was a very positive experience and I am thankful to have gotten this opportunity through the School of Psychology. I started looking for opportunities to intern with a blank slate, with no expectations of what was to come. I happened to attend a talk organised by my school and met Genevieve, co-founder and director for the BAE Counselling and Therapy Centre, for the first time. I applied to intern with her organisation as the short interactions we had made me realise that she has exceptional potential and would ease me into my internship. I knew I had slim chances of getting the position, compounded with the fact that I was in a different country during the pandemic. However, I was certain that this would be the perfect opportunity to grow and learn, pushing me closer to my goal of practising counselling for my Masters. During the first week of my internship, I was given the task of writing and making a poster on counselling. I thought it would be easy until I started researching on the topic. I first tried writing a provocative piece but I was soon corrected and given feedback. I became aware of the protocols in which a counselling organisation has to operate in, and I was able to fine-tune my copywriting. Even though the task took some time to finish, it was worth it as I learned about the systems and best practices of the centre. I was then given an interesting exercise which pushed me to think critically. I had to write a report on how I would approach a situation where my client has views opposite to mine. I chose the case of a man who treats women poorly and has conservative thoughts, which turned out to be difficult as I am strictly against these values. I tried my best to figure out how to approach the situation on my own, but when I consulted Genevieve, I learned much more. Her explanations really opened my eyes! She explained the importance of the client acting independently: a counsellor can only recommend solutions to the client, and it is up to the client to work on their own. Importantly, a counsellor also needs to manage their expectations of their client and their client's expectations of them. I spent my remaining weeks researching about psychology and counselling, in order to make FAQs for the centre and posters for social media. I also received valuable input from Genevieve on where and how I could learn and practice counselling for my Masters. My supervisor put her best foot forward to ensure that I got the full experience of being an intern, even when I could not be physically present at the centre. As a result, the internship was informative and flexible. I was able to discuss and plan out what I wanted to learn with my supervisor, rather than passively getting tasks that would not help me grow. I would highly recommend this internship to anyone who plans to pursue counselling as a career as it gave me an in-depth insight into the field and also helped me understand how private counselling centres work. I did a 3-month research internship under Dr Neil Mennie from the School of Psychology. I am very thankful that I got the chance to participate in this programme despite the entirety of it being conducted online. It was an overall intense experience and I often felt unequipped and unprepared for what I was expected to do. However, it was precisely because of these feelings that drove me to push past my comfort zones. At times, I wanted to give excuses like “I’ve never learned how to do that!” or “I don’t think I can do this task properly”. Despite that, my supervisor would encourage me to think of a solution around it, so I felt independent and took charge of my learning experience. It was overwhelming on the days when I did not know what to do, and I was constantly occupied with thoughts about my work, on weekdays, weekends, and even when I was sleeping. The situation pushed me to accept my limitations and take breaks when needed. Prior to this internship, I prided myself on being committed to my work and I used to seek filling up my schedule with productive activities. However, this experience made me see how important a life outside of work is, and it’s allowed me to create healthy work-fun spaces, which has also allowed me to cultivate healthier relationships with friends and family. The skills I had to develop along the journey have forced me to become even more efficient, and I actually feel proud in myself for the things I’ve done this time around. Getting the first-hand experience to be involved with every step of the research process has solidified my decision in applying for a postgraduate programme and has piqued my interest in research as a career. Overall, I am grateful for what I learned, and I am more confident in my abilities and work ethic. Over the summer, I had the privilege to do a 3-month research internship with the UK campus. I worked directly with my supervisor, Dr Mark Haselgrove, and a behavioural scientist, Dr Sara Bru Garcia, both of whom have been inspiring and encouraging throughout the internship. For the internship, we started a new research project together. As both Dr Mark and Dr Sara specialise in behavioural science, we looked into the partial-reinforcement extinction effect in behaviour-change app use. In the second week of the internship, I did some literature reading, put together the highlights in a presentation, and presented them. I was delighted when Dr Mark said I had found a particularly relevant and helpful paper and called me a “brilliant intern” when I had just started my internship journey. This made me realise the power of encouragement, and I will practice it when I am in a leadership position. Then, I had to design a survey from scratch, which was quite challenging at first, but I soon got the hang of it. I referred to relevant previous literature and created a 31-question questionnaire about the types of behaviour change apps the participants use (e.g. well-being, fitness, healthy eating) and how they use them in their daily lives (e.g. frequency and duration of use). The goal was to examine if those who have performed the behaviour occasionally in the absence of the app continue to sustain their behaviour for longer than participants who only perform the behaviour in the presence of the app. I also designed and distributed the recruitment poster for our survey, which was commented as a very clever design by Dr Bahar Tuncgenc. I am happy that I got to learn some graphic design skills and survey distribution tips. We successfully achieved our recruitment target in a month. This internship has taught me a lot, not just in academics but also in personal growth. Working with a team more than 10000 kilometres away with a 7-hour time difference and different cultural backgrounds was a unique experience that I believe would be helpful for my future endeavours. I am grateful to be contributing to the project and to have been given the opportunity to work with Dr Mark and Dr Sara. I am confident that the skills I learned during this internship will be valuable in any field. Last summer, I completed a joint-internship with Firestar Research Sdn. Bhd. and Vodus Research Sdn. Bhd., working as a marketing research intern for both companies. Firestar conducts qualitative marketing research while Vodus conducts quantitative marketing research — the best of both worlds! As a Psychology student familiar with research, the thought of interning under marketing research companies was slightly daunting and nerve-wrecking, considering the fact that I had little to no knowledge about how marketing works. However, my supervisors and colleagues were very supportive and helpful while guiding me throughout my internship. With Firestar, we had weekly sessions to discuss the steps and lengthy processes involved in a qualitative research project, such as creating a brief for clients, creating a screener and discussion guide for recruiters, as well as having lessons on moderating a research group. With Vodus, I was tasked to translate and proofread questionnaires before they would be scripted through Vodus’ unique One-Question Media Tracking Online Survey (OMTOS) method. OMTOS worked by displaying a single question from a questionnaire every time a respondent visited any Vodus Media Network websites, which is easier for respondents to complete as compared to a 10-question survey. Learning how to script questionnaires was confusing at first, but became enjoyable after I got the hang of it. During my last month there, I was tasked to conduct my own marketing research project which required me to utilise both my qualitative and quantitative research skills. As I was already working on a similar project with Firestar, I chose to conduct a research project on the consumption of skincare products during the pandemic, where I had the opportunity to moderate a 6-person focus group. Due to restrictions and also for convenience, the focus group session was conducted through Whatsapp for 3 days. Despite being able to hide behind a screen, it did not completely extinguish the anxiety I had while moderating the sessions. Once the qualitative data was analysed, it was time to move on to the quantitative part of the study where I had to extract the key points from the qualitative insights in order to quantify, translate, proofread, and script them. It was a new and strange experience but I am glad to have had the opportunity to run a qualitative-quantitative marketing research project! This internship period gave me the chance to experience the marketing research life I have always been interested in and I certainly am open to the idea of working in that field in the future. Of course, no job comes without its share of struggles but with good support and resilience, nothing is impossible to achieve and overcome. The summer research internship I carried out was an enlightening research experience that gave me a new perspective on the realities of academia. I had the opportunity of working alongside Dr Tan Kok Wei from the University of Reading, Malaysia as a research assistant. Scientific research in psychology is a critical tool for successfully navigating our complex world and it also facilitates the understanding of what makes an individual think, feel and act in a certain way. It is through systematic scientific research that we divest ourselves of our preconceived notions and superstitions and gain an objective understanding of ourselves and our world. This is what gravitated me towards carrying out a research internship. To kick start the internship, I was asked to carry out a literature review on vaccine hesitancy during the Covid-19 pandemic. I also gathered and summarized literature pertaining to several cognitive/mind games, which would be used in the recruiters’ future studies/research. Moreover, I was asked to brief my fellow interns on the work that we would be doing. The first CPD presentation was based on “Gorilla”, an online experimenter builder, where I had to deliver a training session on how to manoeuvre around the software. The second CPD presentation was based on the literature I had gathered pertaining to different mind/cognitive games that could be used in research within Psychology. Third, I delivered a presentation discussing happiness and wellbeing, wherein a defined happiness, explained its importance and listed the main factors contributing to happiness and well-being. Finally, I presented the literature regarding vaccine hesitancy during the Covid-19 pandemic. Perhaps the most challenging portion of the internship involved the standardization and transformation of previously collected facial stimuli using Webmorph. Overall, I have accumulated strong foundational knowledge within the research domain these past three months, and gained first-hand experience with valued professionals in this field. Furthermore, this opportunity enhanced my knowledge on academic writing skills, data collection procedures, and data analysis techniques, which would be of high value for my Final Year Project I spent my summer in prison! As weird as it sounds, it’s true. I interned at a maximum-security women’s prison in my home country, Kenya. While this may sound quite adventurous and risky, it was nothing like I expected. Home to thousands of prisoners, it is the largest women’s prison in Kenya. Although I have been living in Kenya for 4 years, I didn't know what to expect. To my surprise, it was more close-knit than any of our modern societies will ever be. The main aim of the internship was to get a view of life in prison and assist in delivering intervention programs as a forensic psychologist would. I set out with the expectation that the mental health of prisoners would be highly neglected and the living conditions will not meet minimum standards. However, this was far from the truth. On my very first day, I spent time talking to prisoners and getting to know the routine of prison. It was a revelation when I came to know that prisoners are allowed to pursue their passions inside the safety of the prison. From getting a law degree from the University of London to modelling, knitting, sewing, pottery, studying for the national exam, learning a new language or practicing mindfulness and meditation, you were sure to find a world of professionals in closed quarters. Not only that, the mental health of prisoners was also probably better than the general population as they had a counsellor at their disposal at any time along with officers from the welfare office. The doctor also took regular rounds to ensure each prisoner was doing well physically. These were also some reasons that rates of recidivism/re-offending were quite high as they found it hard to integrate into society with the stigma of being a prisoners and also because of the excellent conditions in prison. My tasks included delivering intervention programs, assisting in risk-assessments, sitting in virtual court, observing therapy sessions and delivering classes to high school students, hence, this seemed like many internships in one. I also managed to successfully introduce new ideas in the prison, such as giving advice to the parole board on the mental health of prisoners, introducing new interview techniques based on research and having an interview before the prisoner goes back into society. Overall, this was a fulfilling experience and nothing like I had expected from prisons. This fuelled my interest in pursuing forensic psychology as a career and making prisons a place for rehabilitation rather than punishment. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}