{
    "url": "https://www.nottingham.edu.my/Psychology/People/kaili.chung",
    "content": [
        {
            "p": "Associate Professor, My main research interests lie in psychopathology and individual differences, and I am passionate about the intersection of psychology and the justice system. My PhD thesis focussed on aversive personality traits, particularly three traits collectively known as the Dark Triad - psychopathy, narcissism, and Machiavellianism. After completing my PhD in Psychology from Edinburgh Napier University, Scotland in 2017, I worked for 7 years at the University of Reading Malaysia. I was promoted to Associate Professor and appointed the Head of Psychology in 2022, and became the Director of Research Management Centre in 2023. I joined the University of Nottingham Malaysia in 2024 as an Associate Professor. I am a Senior Fellow of Advance HE. Since 2014 I have designed and taught various psychology modules at undergraduate and postgraduate level, including Forensic Psychology, Debates in Mental Health, Abnormal Psychology, Counselling Psychology, Researching Psychology, as well as Social and Differential Psychology. Additionally, I developed online teaching materials for distance learning courses provided by the University of Strathclyde and The Open University, UK. I have also held the position of the Psychology Course Coordinator for the Lothians Equal Access Programme for Schools (LEAPS) Summer School, a widening participation programme to raise educational attainment among under-represented groups. I am also an active member of the Johor Women's League, a non-governmental, non-profit society working to promote women's empowerment and the rights of children. My research covers two areas within the field of forensic psychology (the application of psychological knowledge to legal systems): investigative interviewing and interpersonal violence, which involves working with the police force and abuse victims. In the criminal justice system, investigative interviewing involves a method of communicating with witnesses, victims, or suspects in order to obtain information. An ability to conduct good investigative interviews is one of the most important tools of a crime investigator. However, due to the lack of available empirical data, very little is known about how Malaysian police officers conduct interviews and their outcomes. Since 2017, I have been pioneering research in this area in Malaysia, establishing multisite transnational collaborations with researchers from all over the world. I work collaboratively with the Royal Malaysia Police on both research and training, with the aim of developing a national protocol of investigative interviewing that is evidence-based, universally endorsed, and suitable for implementation in Malaysia. I am regularly invited to provide training to government stakeholders, and am a consulting editor of Psychology of Violence. About half of my published papers are on the topics of interpersonal aggression or violence, namely stalking, corporal punishment, and capital punishment. My work in these areas focusses on the role of individual differences in aggression and blame attribution. I am the module convenor for Cognitive Psychology 1 (PSGY1010). I also supervise third-year students in the Research Project (PSGY3023) module. Establishing Networks to Implement the Principles on Effective Interviewing for Investigations (IMPLEMENDEZ; with Prof Dave Walsh, De Monfort University) Child Investigative Interviewing Training (with Dr Ummi Habibah Abd Rani, Polis Diraja Malaysia) Sexual Offending Against Children (with Prof Michael Seto, The Royal's Institute of Mental Health Research & Dr Mohd Norbayusri Baharudin, Universiti Malaya) Child Memory and Suggestibility in Investigative Interviewing (with Dr Rachel Pye & Wong Yi Shan, University of Reading) Pathogen Disgust (with Dr Tan Kok Wei, University of Reading Malaysia) Dark Tetrad Traits and Eye Movements (with Dr Shumetha Sidhu, University of Reading Malaysia) Piloting Practices in Psychology (with Mary Beth Neff, University of Oslo) The Replication Database: Documenting the Replicability of Psychological Science (FReD; with Framework for Open and Reproducible Research Training) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": [
        "pdf_files/iII-RP-Journal-Volume13_2023.pdf"
    ]
}