{
    "url": "https://www.nottingham.edu.my/Psychology/About/Podcasts.aspx",
    "content": [
        {
            "p": "Members of the department have been on the radio talking about psychology and their research. Listen to these shows below. Part 20: Dr. Ahmed Dahir Mohamed talks about mindfulness. #20 Part 19: Dr Dan Seal talks about PTSD in Malaysia. #19 Part 18: Dr Jason Satel discusses whether multi-tasking work. #18 Part 17: Dr Jessica Price and student Poh Wei Lin talk about how your job affects your memory. #17 Part 16: Prof Peter Mitchell talks about special abilities in autism. #16 Part 15: Dr Elizabeth Sheppard and student Lim Phui Cheng talk about driving behaviour in Malaysia. #15 Part 14: Dr Kirsten McKenzie talks about memory. #14 Part 13: Dr Ian Stephen talks about the science of relationships. #13 Part 12: Prof Peter Mitchell talks about the way children think and reason. #12 Part 11: PhD student Chrystalle Tan and Dr Ian Stephen talk about their recent research into how Malaysian Chinese recognise faces. #11 Part 10: Dr Jessica Price talks about diagnosing Alzheimer's. #10 Part 9: Dr Kirsten McKenzie talks about the mismatch between perception and reality. #9 Part 8: Dr Elizabeth Sheppard (Malaysia Campus) and Prof David Crundall (UK Campus) talk about the psychology of road safety in Malaysia. #8 Part 7: Dr Kirsten McKenzie and Prof Peter Mitchell talk about the human brain. #7 Part 6: Prof Peter Mitchell talks about the influence of birth order on personality. #6 Part 5: Dr Ian Stephen talks about the psychology of attractiveness. #5 Part 4: Valentine's Day special. Dr Ian Stephen talks about what makes people attracted to each other, and about the psychology of love. #4 Part 3: Prof Peter Mitchell talks about autism in Malaysia. #3 Part 2: Prof Peter Mitchell and Dr Elizabeth Sheppard talk about cognitive aspects of autism. #2 Part 1: Prof Peter Mitchell talks about the interesting, varied and well paid careers in psychology. #1 telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}