{
    "url": "https://www.nottingham.ac.uk/psychology/people/eamonn.ferguson",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR FACULTIES, SCHOOLS & GROUPS The infected blood inquiry: Impact on public perceptions of blood supply risk, safety, and donation attitudes (2024) Journal Article Mills, R., Merz, E., Croucher, M., Masser, B., Brailsford, S. R., Smith, R., & Ferguson, E. (in press). The infected blood inquiry: Impact on public perceptions of blood supply risk, safety, and donation attitudes. Transfusion Medicine, https://doi.org/10.1111/tme.13108 Background: The UK’s Infected Blood Inquiry (IBI) highlighted a major public health scandal, with at least 30,000 people infected and more than 3,000 deaths attributable to infected blood and blood products. This study investigates the impact of the... Read More about The infected blood inquiry: Impact on public perceptions of blood supply risk, safety, and donation attitudes. Questions on travel and sexual behaviours negatively impact ethnic minority donor recruitment: Effect of negative word-of-mouth and avoidance (2024) Journal Article Ferguson, E., Mills, R., Dawe-Lane, E., Khan, Z., Reynolds, C., Davison, K., Edge, D., Smith, R., O'Hagan, N., Desai, R., Croucher, M., Eaton, N., & Brailsford, S. R. (2024). Questions on travel and sexual behaviours negatively impact ethnic minority donor recruitment: Effect of negative word-of-mouth and avoidance. Vox Sanguinis, https://doi.org/10.1111/vox.13748 Background and Objectives Donor selection questions differentially impacting ethnic minorities can discourage donation directly or via negative word-of-mouth. We explore the differential impact of two blood safety questions relating to (i) sexual co... Read More about Questions on travel and sexual behaviours negatively impact ethnic minority donor recruitment: Effect of negative word-of-mouth and avoidance. Contribution of inflammation markers and quantitative sensory testing (QST) indices of central sensitisation to rheumatoid arthritis pain (2024) Journal Article Georgopoulos, V., Smith, S., McWilliams, D. F., Ferguson, E., Wakefield, R., Platts, D., Ledbury, S., Wilson, D., & Walsh, D. A. (2024). Contribution of inflammation markers and quantitative sensory testing (QST) indices of central sensitisation to rheumatoid arthritis pain. Arthritis Research and Therapy, 26(1), Article 175. https://doi.org/10.1186/s13075-024-03407-5 Background: Pain, the primary complaint in rheumatoid arthritis (RA), is multifaceted, and may be driven by inflammatory disease activity and central sensitisation. We aimed to ascertain what proportion of RA pain severity is explained by markers of... Read More about Contribution of inflammation markers and quantitative sensory testing (QST) indices of central sensitisation to rheumatoid arthritis pain. The power of arts‐based film interventions to encourage Black blood donors (2024) Journal Article Mills, R., Okubanjo, A., Acheampong, N., Croucher, M., Eaton, N., Kazi, A., Di Angelantonio, E., Wood, A., Barbara, M., & Ferguson, E. (2024). The power of arts‐based film interventions to encourage Black blood donors. Transfusion, 64(11), 2133-2143. https://doi.org/10.1111/trf.17963 Background: Blood services must consider innovative ways to encourage more Black people to donate to enhance the efficacy of treatments. We evaluate how two innovative arts-based approaches (co-designed and locally produced films and a large-scale Ma... Read More about The power of arts‐based film interventions to encourage Black blood donors. The prototypical UK blood donor, homophily and blood donation: Blood donors are like you, not me (2024) Journal Article Ferguson, E., Bowen, S., Mills, R., Reynolds, C., Davison, K., Lawrence, C., Maharaj, R., Starmer, C., Barr, A., Williams, T., Croucher, M., & Brailsford, S. R. (in press). The prototypical UK blood donor, homophily and blood donation: Blood donors are like you, not me. Vox Sanguinis, https://doi.org/10.1111/vox.13731 Background and Objectives Homophily represents the extent to which people feel others are like them and encourages the uptake of activities they feel people like them do. Currently, there are no data on blood donor homophily with respect to (i) peop... Read More about The prototypical UK blood donor, homophily and blood donation: Blood donors are like you, not me. The importance of need‐altruism and kin‐altruism to blood donor behaviour for black and white people (2024) Journal Article Ferguson, E., Dawe‐Lane, E., Ajayi, O., Osikomaiya, B., Mills, R., & Okubanjo, A. (2024). The importance of need‐altruism and kin‐altruism to blood donor behaviour for black and white people. Transfusion Medicine, 34(2), 112-123. https://doi.org/10.1111/tme.13032 Background Need-altruism (a preference to help people in need) and kin-altruism (a preference to help kin over non-kin) underlie two hypotheses for voluntary blood donation: (i) Need-altruism underlies motivations for volunteer blood donation and (i... Read More about The importance of need‐altruism and kin‐altruism to blood donor behaviour for black and white people. Blood Donor Incentives across 63 Countries: The BEST Collaborative Study (2023) Journal Article Graf, C., Oteng-Attakora, K., Ferguson, E., Vassallo, R., & Merz, E. M. (2024). Blood Donor Incentives across 63 Countries: The BEST Collaborative Study. Transfusion Medicine Reviews, 38(2), Article 150809. https://doi.org/10.1016/j.tmrv.2023.150809 Incentives for blood donors are a much-debated strategy intended to ensure a sufficient supply of blood. Yet, there is a fundamental lack of knowledge about which incentives are offered by different blood collectors. We provide a comprehensive descri... Read More about Blood Donor Incentives across 63 Countries: The BEST Collaborative Study. Blood Donor Incentives across 63 Countries: The BEST Collaborative Study (2023) Journal Article Graf, C., Oteng-Attakorac, K., Ferguson, E., Vassalloe, R., & Merz, E.-M. (2024). Blood Donor Incentives across 63 Countries: The BEST Collaborative Study. Transfusion Medicine Reviews, 38(2), Article 150809. https://doi.org/10.1016/j.tmrv.2023.150809 Effects of childhood trauma on sleep quality and stress-related variables in adulthood: evidence from two multilevel studies (2023) Journal Article O’Connor, D. B., Branley-Bell, D., Green, J. A., Ferguson, E., O’Carroll, R. E., & O’Connor, R. C. (2023). Effects of childhood trauma on sleep quality and stress-related variables in adulthood: evidence from two multilevel studies. Psychology and Health, https://doi.org/10.1080/08870446.2023.2281712 Childhood trauma has been found to have serious negative consequences for mental and physical health. However, the precise mechanisms through which trauma influences health outcomes are unclear. Childhood trauma-related disruptions to sleep in adulth... Read More about Effects of childhood trauma on sleep quality and stress-related variables in adulthood: evidence from two multilevel studies. Assessing the influence of affective attitudes, demography and blood donor status on organ donor registration active decisions in opt-out systems (2023) Journal Article Shepherd, L., O'Carroll, R., & Ferguson, E. (2024). Assessing the influence of affective attitudes, demography and blood donor status on organ donor registration active decisions in opt-out systems. Journal of Health Psychology, 29(8), 825-835. https://doi.org/10.1177/13591053231208531 In contrast to opt-in systems, relatively little is known about what influences whether or not people register a decision about organ donation in opt-out systems. We address this gap in the literature. Participants (N = 756) living in a country with... Read More about Assessing the influence of affective attitudes, demography and blood donor status on organ donor registration active decisions in opt-out systems. Exploring the nuances of cooperation in public health – a critical reflection of default policies and reputation effects: a reply to 'Nurturing, nudging and navigating the increasingly precarious nature of cooperation in public health: The cases of vaccination and organ donation' by Larson and Toledo (2023) Journal Article Ferguson, E., & Mills, R. (2023). Exploring the nuances of cooperation in public health – a critical reflection of default policies and reputation effects: a reply to 'Nurturing, nudging and navigating the increasingly precarious nature of cooperation in public health: The cases of vaccination and organ donation' by Larson and Toledo. Global Discourse: An Interdisciplinary Journal of Current Affairs and Applied Contemporary Thought, 13(3-4), https://doi.org/10.1332/20437897Y2023D000000008 Exploring the nuances of cooperation in public health – a critical reflection on default policies and reputation effects: a reply to ‘Nurturing, nudging and navigating the increasingly precarious nature of cooperation in public health: the cases of vaccination and organ donation’ by Heidi J. Larson and Alexander H. Toledo (2023) Journal Article Ferguson, E., & Mills, R. (2023). Exploring the nuances of cooperation in public health – a critical reflection on default policies and reputation effects: a reply to ‘Nurturing, nudging and navigating the increasingly precarious nature of cooperation in public health: the cases of vaccination and organ donation’ by Heidi J. Larson and Alexander H. Toledo. Global Discourse: An Interdisciplinary Journal of Current Affairs and Applied Contemporary Thought, 13(3-4), 323-343. https://doi.org/10.1332/20437897y2023d000000008 Warming up cool cooperators (2023) Journal Article Ferguson, E., Lawrence, C., Bowen, S., Gemelli, C. N., Rozsa, A., Niekrasz, K., van Dongen, A., Williams, L. A., Thijsen, A., Guerin, N., Masser, B., & Davison, T. E. (2023). Warming up cool cooperators. Nature Human Behaviour, 7, 1917-1932. https://doi.org/10.1038/s41562-023-01687-6 Explaining why someone repeats high-cost cooperation towards non-reciprocating strangers is difficult. Warm-glow offers an explanation. We argue that warm-glow, as a mechanism to sustain long-term cooperation, cools off over time but can be warmed up... Read More about Warming up cool cooperators. Incorporating heterogeneity in farmer disease control behaviour into a livestock disease transmission model (2023) Journal Article Hill, E. M., Prosser, N. S., Brown, P. E., Ferguson, E., Green, M. J., Kaler, J., Keeling, M. J., & Tildesley, M. J. (2023). Incorporating heterogeneity in farmer disease control behaviour into a livestock disease transmission model. Preventive Veterinary Medicine, 219, Article 106019. https://doi.org/10.1016/j.prevetmed.2023.106019 Human behaviour is critical to effective responses to livestock disease outbreaks, especially with respect to vaccination uptake. Traditionally, mathematical models used to inform this behaviour have not taken heterogeneity in farmer behaviour into a... Read More about Incorporating heterogeneity in farmer disease control behaviour into a livestock disease transmission model. Incorporating heterogeneity in farmer disease control behaviour into a livestock disease transmission model (2023) Journal Article Hill, E., Prosser, N., Brown, P., Ferguson, E., Green, M., Kaler, J., Keeling, M., & Tildesley, M. (2023). Incorporating heterogeneity in farmer disease control behaviour into a livestock disease transmission model. Preventive Veterinary Medicine, 219, Article 106019. https://doi.org/10.1016/j.prevetmed.2023.106019 Heading Frequency and Risk of Cognitive Impairment in Retired Male Professional Soccer Players (2023) Journal Article Espahbodi, S., Hogervorst, E., Macnab, T.-M. P., Thanoon, A., Fernandes, G. S., Millar, B., Duncan, A., Goodwin, M., Batt, M., Fuller, C. W., Fuller, G., Ferguson, E., Bast, T., Doherty, M., & Zhang, W. (2023). Heading Frequency and Risk of Cognitive Impairment in Retired Male Professional Soccer Players. JAMA Network Open, 6(7), Article e2323822. https://doi.org/10.1001/jamanetworkopen.2023.23822 Importance Although professional soccer players appear to be at higher risk of neurodegenerative disease, the reason remains unknown. Objective To examine whether heading frequency is associated with risk of cognitive impairment in retired profe... Read More about Heading Frequency and Risk of Cognitive Impairment in Retired Male Professional Soccer Players. Cognitive Impairment and Self-Reported Dementia in UK Retired Professional Soccer Players: A Cross Sectional Comparative Study (2023) Journal Article Macnab, T.-M. P., Espahbodi, S., Hogervorst, E., Thanoon, A., Fernandes, G. S., Millar, B., Duncan, A., Goodwin, M., Batt, M., Fuller, C. W., Fuller, G., Ferguson, E., Bast, T., Doherty, M., & Zhang, W. (2023). Cognitive Impairment and Self-Reported Dementia in UK Retired Professional Soccer Players: A Cross Sectional Comparative Study. Sports Medicine - Open, 9, Article 43. https://doi.org/10.1186/s40798-023-00588-2 Background Previous studies based on death certificates have found professional soccer players were more likely to die with neurodegenerative diseases, including dementia. Therefore, this study aimed to investigate whether retired professional male... Read More about Cognitive Impairment and Self-Reported Dementia in UK Retired Professional Soccer Players: A Cross Sectional Comparative Study. A latent class analysis using the integrated motivational-volitional model of suicidal behaviour: Understanding suicide risk over 36 months (2023) Journal Article van Eijk, N. L., Wetherall, K., Ferguson, E., O'Connor, D. B., & O'Connor, R. C. (2023). A latent class analysis using the integrated motivational-volitional model of suicidal behaviour: Understanding suicide risk over 36 months. Journal of Affective Disorders, 336, 9-14. https://doi.org/10.1016/j.jad.2023.05.028 The use of latent class analysis (LCA) to understand suicide risk is often not guided by theoretical frameworks. This study used the Integrated Motivational-Volitional (IMV) Model of Suicidal Behaviour to inform the classification of subtypes of youn... Read More about A latent class analysis using the integrated motivational-volitional model of suicidal behaviour: Understanding suicide risk over 36 months. Depression, Cognition, and Pain: Exploring Individual, Cultural and Country-Level Effects Across Europe (2023) Journal Article James, R. J., & Ferguson, E. (2023). Depression, Cognition, and Pain: Exploring Individual, Cultural and Country-Level Effects Across Europe. Journal of Pain, 24(6), 1104-1115. https://doi.org/10.1016/j.jpain.2023.03.006 The aim of this paper was to investigate the role of economic (eg, GDP per capita), political (eg, healthcare spending), cultural (country-level aggregates norms) and individual correlates (eg, depression) of pain in a secondary analysis of a sample... Read More about Depression, Cognition, and Pain: Exploring Individual, Cultural and Country-Level Effects Across Europe. Impact of a post-donation hemoglobin testing strategy on efficiency and safety of whole blood donation in England: A modeling study (2023) Journal Article Kim, L. G., Bolton, T., Sweeting, M. J., Bell, S., Fahle, S., McMahon, A., Walker, M., Ferguson, E., Miflin, G., Robert, D. J., di Angelantonio, E., & Wood, A. M. (2023). Impact of a post-donation hemoglobin testing strategy on efficiency and safety of whole blood donation in England: A modeling study. Transfusion, 63(3), 541-551. https://doi.org/10.1111/trf.17277 Background: Deferrals due to low hemoglobin are time-consuming and costly for blood donors and donation services. Furthermore, accepting donations from those with low hemoglobin could represent a significant safety issue. One approach to reduce them... Read More about Impact of a post-donation hemoglobin testing strategy on efficiency and safety of whole blood donation in England: A modeling study. Showing 1 - 20 of 163 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}