{
    "url": "https://www.nottingham.edu.my/Psychology/Research/Developmental-and-Social-Psychology.aspx",
    "content": [
        {
            "p": "Our research group focuses on studying the development and social behaviours of individuals across the lifespan, including the younger population: children, adolescents, and youths. We examine various aspects of positive and adverse developmental outcomes. We are curious about the interactions and contributions of various factors towards diverse developmental outcomes, ranging from parenting, peer relations, and school environment to greater ecological factors such as society, values, and cultures. We are also interested in studying and tracking the developmental process of people, in studying their needs and challenges at different stages of development (including the transition process), to help them in their growth and flourishing (e.g.: transition from adolescence into adulthood, school and university challenges, adulthood challenges etc.). Our research group is interested in studies, ranging from positive well-being (e.g., life satisfaction, happiness, optimism) to non-substance addiction studies (e.g., social media and gadgets addictions). We hope to understand and improve well-being and development of people holistically. Hence, we are interested in looking at both positive and adverse developmental outcomes. We utilized a wide range of approaches in our methods of inquiry including quantitative (e.g., structural equation modelling (SEM), mediation and moderation analyses, experimental design), qualitative (e.g., interview, focus group and ethnography) and mixed-methods design depending on studies. We are also interested in psychometric studies of instruments, suitable for developmental and psychological studies, relevant to children, adolescents, and youth population. Our research group welcomes cross-cultural and inter-disciplinary studies in our area of interest. We have been collaborating with researchers from various fields. We embrace inter-disciplinary and collaborative work, for a holistic understanding of human development. Dr Chong Shue Ling Dr Lee Eun Hee Dr Sheena Tiong, Universiti Malaya Associate Professor Dr Yu-Chieh Hsieh, Chinese Cultural University We are interested in research relevant to developmental psychology, social psychology, and positive psychology. Our area of study includes, but is not limited to: We are looking at expanding the current research group. If you are interested in our work, please do not hesitate to contact Dr Shue Ling Chong for more information and discussion. Please contact Dr Shue Ling Chong at: Shue.Ling@nottingham.edu.my Personal webpage: www.chongshueling.com We are actively looking for meaningful research collaborations! We also welcome postgraduate supervisees, research assistants, project students and participants for various projects. Occasionally, we do have research opportunities and please do not hesitate to contact us. If you are interested in carrying out postgraduate research (Masters or PhD) in our area, please do contact us for more details. If you are from governmental and non-governmental organizations, schools, hospitals, or centres (e.g., learning centres, child development centres), and would like to collaborate with our research group, please do not hesitate to contact Dr Shue Ling Chong. We will be happy to hear from you! telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}