{
    "url": "https://www.nottingham.ac.uk/psychology/research/fellowships/fellowships.aspx",
    "content": [
        {
            "p": "The School of Psychology welcomes enquiries and applications from those interested to pursue personal fellowships. The School has substantial experience in supporting Research Fellows through their early careers and beyond. Fellowships enable post-doctoral researchers to pursue independent research, and are an ideal early step for those who are keen to develop a research career. The School provides an exciting and dynamic research environment for Fellows. For further information on research within the School please visit our research groups section. Prof Alexa Spence is the School’s dedicated Fellowship lead who can assist with queries and support fellowship applications. Please contact Alexa at the earliest stage in the development of your fellowship application so you receive the best possible guidance and support. Alexa can be contacted via email at: alexa.spence@nottingham.ac.uk The University has a range of its own fellowship schemes to support early career researchers including the Anne McLaren Fellowships and the Nottingham Research Fellowships. Links to externally funded fellowships can be found on the University’s fellowship page in addition to those highlighted below. The next round of Nottingham Research and Anne McLaren Fellowships are anticipated to start in 2026. The Anne McLaren Fellowships are targeted at women in STEM subjects, the NRF is available across all schools in the University. The aim is to recruit high quality researchers who will be our research leaders of the future and will make an active contribution to delivering our ambitious research vision. These highly prestigious fellowships, funded through the University of Nottingham Research Strategy, offer: Up to three years’ independent research funding, covering salary costs Link to permanent academic appointment (subject to performance and the right to work in the UK) Funding for research expenses Childcare costs Access to mentoring, career development and networking with the wider fellowship community School of Psychology welcomes applications from exceptional early career researchers in any area of psychology that complements or extends our existing research strengths. alexa.spence@nottingham.ac.uk For queries related to the application process and eligibility, please contact fellowships@nottingham.ac.uk Find out more and how to apply University Park The University of Nottingham Nottingham, NG7 2RD For all enquires please visit: www.nottingham.ac.uk/enquire"
        }
    ],
    "pdf_files": []
}