{
    "url": "https://www.nottingham.edu.my/Psychology/About/Alumni.aspx",
    "content": [
        {
            "p": "Since the founding of the School of Psychology in 2009, it has produced many high-quality graduates, who have gone on to change and inspire the world around them. Assistant Professor at the University of Nottingham Malaysia Dr Miflah Hussain graduated from the University of Nottingham Malaysia (UNM) in 2014, with a BSc (Hons) in Psychology and Cognitive Neuroscience. Subsequently, he moved to Queen Mary University of London (QMUL) to do his PhD at Dr Isabelle Mareschal's lab, on a project investigating natural scene perception. After obtaining his Doctorate from QMUL and having been an Associate Lecturer (2017-2018) at the same institution, he started at UNM as an Assistant Professor in the School of Psychology in September 2018. His research primarily focuses on human vision, with a specific interest in how people rapidly spot and recognise faces and other objects, especially when they appear ambiguous. He is also interested in how people's expectations, perceptual history and sociocultural context inlfuence recognition. His research uses a combination of psychophysics and eye-tracking techniques in laboratory, under realistic and/or real-world settings. Dr Christine Leong graduated from the University of Nottingham with a BScc(Hons) in Psychology, and a PhD in Psycholinguistics. Her doctoral research examined bottom-up and top-down speech perceptual disadvantages of Malaysian multilinguals, as well as methods to overcome these cognitive and neural disadvantages. She is currently an assistant professor in the School of Psychology, UNM. She is currently working on funded projects relating to developmental trajectory of speech perception in multilinguals, bilingual word processing and linguistic experience of second language/non-native speakers. Christine is known for her passionate about work that can leave a positive impact in others' (especially students’) life. Faculty Member for A-Level Psychology at Nixor College, Alpha College, Highbrow College, Beaconhouse College Dr Rehan holds a bachelor’s degree in Psychology and Cognitive Neuroscience from The University of Nottingham where he used electroencephalography (EEG) to validate diagnostic biomarkers for Alzheimer’s Disease as well as tested animal models of Schizophrenia. He pursued his master’s degree in Neuroscience and Education from Columbia University and received his graduate training from the Centre for Brain Science at Harvard University. As a graduate student, Dr Rehan explored the mechanisms that contribute to the link between socioeconomic disparities and neurocognitive outcomes in children. His graduate thesis explored the relationships between punitive parenting, white matter structure and internalizing problems during childhood. This research was conducted at the prestigious Teachers College as well as the New York State Psychiatric Institute. Dr Rehan has been a faculty member for psychology at some of the leading colleges in Pakistan since the time he graduated from UNM. He can be seen interacting with students on a range of topics and issues when he is not teaching or ‘nerding out’ with neuroscientific content! Dr Rehan has received scholarships at UNM and Teachers College, Columbia University. He has been acknowledge for his extra-curricular achievements through Nottingham Advantage Award, and his research has been published in journals such as Biological Psychiatry and Acta Psychologica. Research Fellow - Human Factors of Vehicle Automation at the Institute for Transport Studies, University of Leeds Dr Lee is a research fellow at ITS, University of Leeds. Her main research interest is to understand the interactions between AV and other road users (e.g. pedestrians, other vehicles) in a mixed traffic situation. Seeing things from the cognitive psychologist perspective, she works closely with engineers, modellers, and computer scientist using the world's largest 4k resolution pedestrian simulator (HIKER). She is also leading and conducted the first series of studies using HIKER and HMD is setting up the facility's pedestrians' simulator lab. She is one of the work-package leaders in an EU funded project (interACT), and is also involved in another EU funded project (L3Pilot). Dr Lee is part of the British Standards Institution (BSI), International Organisation for Standardisation (ISO) working group, and is accredited as a Chartered Psychologist. Lecturer at Sunway University, Malaysia Dr Lee graduated from the University of Nottingham Malaysia in 2018 under the supervision of Dr Ian Stephen, Dr Elizabeth Sheppard and Dr David Keeble. Her PhD examined the role of language and culture in looking and description strategies in face and scene processing. After completing her PhD, she was a Tutor and later Assistant Professor at Universiti Tunku Abdul Rahman (UTAR), Kampar campus. She is currently a Lecturer at Sunway University. Dr Lee's research interests are in cross-cultural face perception, using eye-tracking methods to examine the factors underlying face recognition and how people perceive cues to health and attractiveness. Recently, she has also expanded her research interests to body image, specifically the influence of social media on body image and ways to improve body image in young adults. Dr Lee has captured an internal grant scheme awarded by Sunway University in 2020. She was the invited workshop speaker on the topic “Eye on the world: A hands-on introduction to eye-tracking methods” for the Malaysian Psychology Student Association (MAPSA) Conference at the University of Reading Malaysia in 2018. She has been also awarded various prizes for her graduate research work, including the Graduate School Travel Prize (2014) awarded by the University of Nottingham Malaysia Campus, the Ernst Mach Grant - Worldwide (2013) awarded by the Austrian Agency for International Cooperation and Research (OeAD-GmbH), and the Poster Award (2012) for the 21st Biennial Conference on Human Ethology, Vienna, Austria. Lecturer in Psychology at the University of Reading Malaysia Dr Tan Kok Wei obtained his PhD in Psychology from the University of Nottingham in 2016, where he studied the effects of skin condition, specifically its colour and texture, on health perception in Asian faces. Dr Tan completed his master degree in developmental psychology from the National University of Malaysia (UKM), from 2005 to 2007, where he examined the occurrence of private speech in young adults. Upon completion, he worked as a lecturer at the University Tunku Abdul Rahman (UTAR) for 4 years. He was also engaged by a community college, while pursuing his PhD, teaching child psychology related subjects. Prior to joining University of Reading Malaysia in 2016, he worked as the course writer for the Wawasan Open University (WOU) where he prepared academic modules for WOU’s students, in both Experimental Psychology and History and Systems of Psychology subjects. His research focuses on face perception, specifically on judgment of apparent health and attractiveness, and their association with actual physical health. Clinical Director and Co-Founder of The Happy Leaves Autism & Special Needs Therapy Centre Ellie completed her BSc (Hons) in Psychology in Nottingham before obtaining her Masters in Clinical Psychology. She was attached with the government hospitals, NGOs and some private centres before finding like-minded people to set up The Happy Leaves. Currently, she is the clinical director at The Happy Leaves, offering both child & adult therapy services as well as supervising university students for their internship periods. She is also looking into pursuing her PhD in the topic of early intervention programs for young toddlers with autism. Ellie’s therapy style leans towards expressive arts and Jungian psychoanalytic approaches. Lecturer in Psychology at Nottingham Trent University (NTU) Dr Treshi joined the Department of Psychology at NTU in 2019. Prior to this, she was a Lecturer at the School of Psychology and Clinical Language Sciences at the University of Reading Malaysia. She completed both her Undergraduate studies and PhD at the University of Nottingham Malaysia and has research interests in body perception. She approaches her research questions from both a cognitive neuroscience perspective, examining the sensory and cognitive processes underlying the formation of our body representation as well as from an evolutionary psychology and person perception viewpoint, examining factors influencing misperceptions of our own and others’ body shape and size. Co-Founder and Director for the BAE Counselling and Therapy Centre; current PhD student and Academic Tutor at Monash University Malaysia Genevieve is a registered and licensed counsellor, an accredited Mental Health First Aider, as well as the Co-founder and Director of BAE Counselling & Therapy Centre at Sunway Geo Avenue. She graduated first class in both Master of Professional Counselling (Monash University Malaysia) and BSc (Hons) Psychology and Cognitive Neuroscience (University of Nottingham Malaysia), and received the Nottingham Advantage Award (2016) as an undergraduate. Genevieve is currently pursuing her PhD on a full scholarship (the Monash University Malaysia Merit Scholarship) from Monash University, where she is also an Academic Tutor. Her research work examines family and marital satisfaction, autobiographical memories and religiosity. Genevieve is also undertaking studies to complete a Diploma in Theology. She has an interest in writing on topics of interest to her, and has co-authored “How Easy is it to Read the Minds of People with Autism Spectrum Disorder? (2015)” following her first summer internship at UNM with Dr. Elizabeth Sheppard in 2013, as well as a self-published poetry anthology titled Midnights with God in 2011. Clinical Psychologist at WeCare Allied Health Center Carmen is a passionate clinical psychologist who is committed to empower individuals through challenging times, dealing with psychological difficulties. Carmen graduated with a Bachelor of Science (with Honours) in Psychology from The University of Nottingham, Malaysia and subsequently completed her Masters in Clinical Psychology from HELP University, Malaysia. In her clinical training, she had experience working in a university counselling centre, private psychology centres, and non-government organizations (NGOs) which provided her with a wide exposure of cases, and clients with diverse backgrounds. Carmen’s roles include delivering individual therapy for adults, administering psychological assessments, and provide individualized interventions for children with neurodevelopmental disorders. Her clinical training also provided her with opportunity to provide consultation and crisis intervention for refugees who have gone through trauma. She believes that each person has a story to tell and through narration of their life story will they find strength and meaning in adversity. PhD student at the University of Nottingham, UK Anthony's research looks to investigate sight loss post-stroke using functional magnetic resonance imaging (fMRI) techniques in order to develop a rehabilitation program. He graduated from the School of Psychology in 2015. During his postgraduate studies at the Unviersity of Nottingham, UK, he became the co-founder of 100 Scientists of Malaysia, a platform featuring Malaysian scientists from various fields to showcase STEM in the public sphere. Joshua is currently a PhD student at the School of Psychology, University of Nottingham, UK. His area of research is in learning, memory and cognitive control. In particular, he is interested in how the brain processes errors or negative outcomes to support adaptations such as learning, better memory and decision making. His current work involves conducting cognitive experiments and developing expertise in functional neuroimaging (fMRI) and computational modelling, and he received a Vice-Chancellor's Scholarship for Research Excellence (International) for his research work. Aside from these academic interests, he is also interested in science communication and co-founded a platform known as 100 Scientists of Malaysia that aims to make science more accessible and diverse. During his undergraduate studies, he was awarded Best Overall Performance, BSc Psychology and Cognitive Neuroscience for the 2017 Cohort and was nominated to deliver the Student Response, during the University of Nottingham Malaysia's summer graduation ceremony in 2017. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}