{
    "url": "https://www.nottingham.edu.my/Psychology/Courses/Undergraduate/Moduledescriptions.aspx",
    "content": [
        {
            "p": "The School of Psychology offers a variety of courses aimed at providing students with a well-rounded education in the principles of psychology. It is intellectually challenging and coherent, and benefits from the strong research ethos of the School. The teaching programme provides a solid understanding of psychological theories and concepts, and the knowledge, analytical tools and skills needed to assess and conduct empirical research. If you are interested in pursuing a psychology course in Malaysia, our programs offer comprehensive training and education 20 credits Cognitive psychology is the study of mental processes: the ways in which we gain information from the world, how that information is represented and transformed as knowledge, how it is sorted and how it is used to direct our attention and behaviour. This is our ability to perceive, comprehend, attend, store and retrieve information gained from the world. This module will introduce the methods used to investigate cognitive processes, together with summaries of principal findings in the domains of attention, perception, language, memory and thinking. This module will introduce a subset of the following topics: - the structure and functioning of the brain - the neuroscientific basis of cognitive and psychological processes - genetics and evolution in relation to psychology. 10 credits This module introduces students to the core topics in social psychology. Social psychology is concerned with trying to understand the social behaviour of individuals in terms of both internal characteristics of the person (e.g. cognitive mental processes) and external influences (the social environment). Lectures will cover topics on how we define the self, attitudes, attribution, obedience, aggression, pro-social behaviour and formation of friendships. This module introduces students to the fascinating world of the developing child. Lectures consider different theoretical, applied and experimental approaches to cognitive, linguistic and social developmental from early to late childhood. Topics include the development of thinking, perception, drawing, understanding the mind, intelligence, attachment, language, and moral development. This module introduces students to basic principles in research design and the statistical presentation and analysis of data with the aid of SPSS. Students cover a range of: (1) simple experimental and correlational research designs; (2) simple statistical procedures for describing data on different measurement scales (3) non-parametric and parametric statistical hypothesis testing procedures including chi-square tests, t-tests and their non-parametric equivalents, univariate analysis of variance, zero order and partial, correlations, simple linear regression and the use of resampling methods in statistics. This Practical Module offers several components that relate to psychological research methods, both quantitative and qualitative. Approximately fourteen laboratory classes, of three hours duration each, address several different psychological topics using a range of investigative procedures, some based on the experimental method and with one qualitative approach. Students work alone or in pairs designing studies, and collecting and analysing data. Work handed in for assessment must be done individually. To undertake these studies students are instructed in the use of experimental design and analysis software, and will be introduced to web-based resources, and modern research techniques in experimental psychology. They will also be introduced to some aspects of qualitative research methods. Students also will attend some psychological experiments, presentations and participate in a field trip to enhance their understanding. This module will cover the basic concepts and assumptions underlying the major univariate and multivariate statistical approaches used in the field of psychology. It will additionally cover important issues relating to psychological research, including study design, ethics, reliability and validity, best practices, and qualitative research methods. The module will cover ANOVA, familywise error, power analysis, multiple linear regression, exploratory factor analysis, ethical issues, the reliability and validity of research designs, and the collection and analysis of qualitative data. Students working in small groups will design, conduct, analyse and report on extended practical projects in areas related to those taught in lecture-based modules. Although there is some calculation involved, the topic quickly provides tools to analyse data from complex designs. Students will learn a computer program to analyse this type of data. This module will examine: Perception, with particular emphasis on vision; The Psychology of Language, including linguistic theory, speech, parsing, word meaning, and different experimental techniques; Human Memory, covering the basics of encoding, storage and retrieval with particular reference to real-world applications of memory research; Thinking and Problem Solving, including heuristics, biases, evolutionary perspectives on human rationality, and group decision making. This module will examine: Social cognition and social thinking, Attribution, Attitudes, Persuasive communication and attitude change, Social Influence, Conformity and obedience, People in groups: Social facilitation, People in groups: Cohesiveness and norms, Intergroup behaviour, Prejudice and discrimination, Aggression, Social bases of motivation and emotion, Development of children’s theories of mind, Early social and communicative development, Development of understanding about moral and social conventions, Atypical socio-cognitive development, Theories of language development, Phonological and lexical development, Conceptual development, Reading development. This module will cover several issues in neuroscience and behaviour that are particularly relevant to understanding the biological bases of psychological functions. Among the topics to be covered are: psychopharmacology, psychobiological explanations of mental disorders, dementia, sexual development and behaviour, methods of studying neuropsychological processes, the effects of brain damage on mental functioning including amnesias, agnosias and aphasias, introduction to classical and instrumental conditioning, theories of associative learning and memory, what forgetting might tell us about learning, topics in comparative cognition and cognitive abilities, can animals do anything apart from conditioning. The focus of psychology is one of the most interesting phenomena in the universe: the human mind. Psychology is, in effect, an effort to explain the mind to the mind. But psychology hasn’t always existed. Where exactly did it come from? And what are the philosophical issues associated with this fascinating field? Those are the questions this module aims to answer. In doing so, it surveys some of the most influential ideas in intellectual history, including those of the Ancients Greeks, various medieval thinkers, and philosophers and scientists from the seventeenth century to today. Along the way, the module touches on some fascinating questions about the human mind. Is the mind something separate from the brain, or is it simply the activity of the brain? Is the mind a blank slate at birth, or do we have some innate knowledge or dispositions? Are humans naturally good or bad, peaceful or violent? Do we have an unconscious mind, full of repressed memories and hidden desires – or is that just a psychological myth? Can we measure the mind, or should we just focus on behaviour? And what are some of the challenges and debates associated with the practice of psychology as a science? In this module students will be introduced to a range of practical methods used within the field of Psychology and cognitive neuroscience, and which are available within the School. Students will gain practical experience in a number of small projects related to psychology and cognitive neuroscience. In addition they will cover topics on the design of experiments and use of cognitive neuroscience techniques including EEG, human psychophysics and animal models of cognition. The module covers the psychological explanations of personality and individual differences. In this module the relationship between the individual and society will be highlighted. In particular the major personality theories are considered in detail and the application of these theories to areas such as abnormal psychology, criminal behaviour and health are discussed. IQ is also covered and evolutionary bases of traits. 40 credits In this year-long module, students will conduct an independent piece of empirical research (or computational modelling) with the aim of demonstrating a grasp of a pertinent issue in psychology. The module is be assessed on a single project report (maximum 8000 words for Extended Projects) submitted at the end of the year. Students on this course will be final year students on BSc (Hons) in Psychology or Psychology and Cognitive Neuroscience who have already completed first and second year psychology practical methods modules. Students work closely with a supervisor to design, conduct, analyse and report on an extended research project in an area where the supervisor has expertise. All research projects should involve either empirical work or computational modelling. Projects need not be original - replications and extensions of published work are acceptable. This module offers a broad overview of a new area of psychology: evolutionary psychology. Researchers in this field are interested in how the mind and behaviour evolved: why we evolved to feel fear, to fall in love, to talk and laugh and care for friends and family members. According to evolutionary psychologists, these things are not just products of learning or culture; they’re deep-seated aspects of human nature. Core topics covered in this module include: Psychological adaptations related to survival, Sexual selection theory and romantic relationships, Sex differences, Kin selection theory and the family, Altruism, Aggression, The battle of the sexes, The evolution of language and Evolutionary clinical psychology. The PSGY3028 module consists of two components (each lasting 2 hours): Lectures and workshops. In addition to learning about hot topics, students will gain further insights into the following: theories of bilingual language acquisition; be introduced to difficulties associated with second language learning, describe current models of bilingual language processing, cognitive and neurological implications of being bilingual. This module will focus on clinical psychology. Several psychiatric disorders will be discussed. Furthermore, the diagnostic process and interventions will be covered. The lectures will cover advanced and current topics associated with ASD including the changing diagnostic criteria for autism, whether the prevalence of autism is increasing, savant skills, cross-cultural issues. Students will be required to actively participate in the lectures by discussing journal articles, and preparing short informal presentations for some of the topics. Students in this class will learn about a number of different perceptual illusions, mostly visual, and some of the explanations that have been proposed for them. In particular, there will be an emphasis on low-level explanations relating to what is known about the underlying neural apparatus of the visual system. The distinction between high-level and low-level explanations will be discussed. Among others, the following categories of illusions will be discussed: geometric, ambiguity, brightness, size constancy, adaptation. The aim of the module is to introduce students to the key concepts and widely used theories from the autobiographical memory literature. During the module, neurological, cognitive, developmental, social, clinical and applied perspectives on the topic will be offered. Furthermore, the module aims to introduce students to a wide range of research methods that can be used to examine different aspects of autobiographical memory. Finally, the module aims to familiarise students with the applications of findings from the autobiographical memory literature into real-world situations. This module will present a variety of current topics in relation to neuropsychology including the etiology, diagnosis and treatment of different abnormal cognitive disorders. Students will attend a series of lectures on these topics. This module will introduce students to the basics of interactive programming and provide solid practical training in MATLAB for research purposes. Students will go through a series of lectures supplemented with structured programming exercises (in specified weeks) for reconsolidation, and practicals. This course introduces students to some commonly used psychological assessments and their respective components through popular case studies. The course will discuss the theoretical underpinnings of the assessment tools and issues related to the practices involved. Students will also explore how tests and assessments are used in a range of research studies and how a few cases of unreliable test have gained enormous favour in popular culture. This module gives students an introduction to the field of active vision and real world studies in vision. Students will be taught why there is a need to run experiments in applied settings, and the course will familiarise them with many of the current methodological approaches in visual cognition, animal behaviour, visuo-motor coordination and executive control of actions. It will highlight new findings gained from real world studies that would not have been possible from laboratory-based experiments, and gives the students’ knowledge about some of the issues surrounding the interpretation of empirical results and the background literature and future directions in cognitive science. This module will introduce students to the subject of the psychology of music. It asks questions about how we perceive and respond to sound and music, why certain tune get stuck in our head, at what age we can start hearing and appreciating music, etc. These questions will be addressed by examining the literature in music psychology. By the end of the module, students should have an understanding of the cognitive, developmental, and social psychological approaches used in understanding music perception and behaviour and be able to critically evaluate their own everyday experience with music. This module will consist of face-to-face lectures and online learning activities. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}