{
    "url": "https://www.nottingham.edu.my/Psychology/Research/ActiveVision/Index.aspx",
    "content": [
        {
            "p": "The term active vision originated in computer vision and artificial intelligence where, when faced with the problem of designing a computer system capable of mimicking animal vision, researchers soon realised that this would require vast computational resources beyond the reach of current technology. In Neuroscience, we investigate the way that agents such as humans and great apes allocate vision (by measuring aspects of their eye movements and behaviour) during the performance of natural actions and complex visuomotor tasks. If the neural mechanisms that underlie vision only have access to finite resources, then by studying how vision is allocated during different tasks with varying demands we hope to provide an insight into the neural architecture of the brain. To explore aspects of our gaze (head + eye) in complex environments we use video based, portable eye tracking devices (dark pupil) and video cameras. Some theories of eye movement control suggest gaze is drawn to \"salient' areas of the visual scene. We find that this is not always the case in the real world. Aspects of the task determine where the eye will be directed to obtain task-specific information. We are particularly interested in predictive movements of gaze to areas or objects in the environment that will be relevant in the future. What benefits these fast movements offer ─ whether it is for action or for perception, is a goal of this research group. In Malaysia, Dr. Mennie’s research is supported by the Malaysian Ministry of Higher Education, where he has been the Principal Investigator and Co-Investigator on Fundamental Research Grant Schemes (FRGS) and Experimental Research Grant Schemes (ERGS). He is also a grant holder of the Malaysian Ministry of Science, Technology and Innovation (MOSTI) eScience fund, and has received research funding from the University of Nottingham Malaysia Campus. He is also working with the approval of the Malaysian Department of Wildlife and National Parks (Perhilitan). Several different student-initiated projects have been supervised by Dr. Mennie and the Active Vision group. Some examples are: Eye movements in advertising, associative conditioning for faces in visual search, horse and rider head movements, memory for faces in criminal line-ups, and inhibition of return in visual attention. The Active Vision group also offers internships to first-year students. Two student experiences of such internships are described here and here. Research by the Active Vision group has appeared in various newspapers and online articles and on radio and TV, and has also been showcased on the University of Nottingham’s channel (see below): Additionally, the Active Vision group regularly engages with the public in different activities – from demonstrating active vision to children at the Kuala Lumpur Kids Festival to appearing on TEDxYouth@KL. Our research interests are: telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}