{
    "url": "https://www.nottingham.edu.my/Psychology/Student-experience/Study-Abroad.aspx",
    "content": [
        {
            "p": "The global nature of The University of Nottingham provides a unique opportunity for students to experience life as a student at the UK campus as part of the inter-campus exchange programme. Students on our undergraduate courses have the opportunity to spend one or two semesters in their second year studying abroad. Since the degree courses are the same across campuses, students study the same modules and sit the same exams as they would in Malaysia. All study in the UK counts towards their degree just as it would in Malaysia. Students who study in the UK continue to pay the lower Malaysia Campus fees. The study abroad scheme is dependent upon the student maintaining good grades. I went on exchange to the UK campus in 2020 for the second semester of my second year, and I can confidently say it was the best choice I have made. The teaching quality was good overall and was not too different from the Malaysian campus; the UK lecturers were as approachable and attentive as those in Malaysia. I think the most distinctive aspect of the UK campus was the student and campus culture. The libraries were always filled with proactive students and many students were eager to help and make small chat with you. The student clubs offered by the UK campus were diverse and there was something for everyone. The clubs also host fun socials where you get to meet new people! Through this exchange programme, I not only covered the course syllabus, but also learned skills that my academic modules did not necessarily teach. The exchange programme taught me more about interpersonal relationships and learning to overcome cultural differences. I had to work with UK students that I had never met before and I had to accustom myself to the work culture there as opposed to working in groups with my Malaysian friends that I had known since my foundation studies. This has inspired me to spread my wings and not be scared of trying different occupations, and also made me realise that my future career path does not have to be as inflexible as I originally thought it to be. In terms of personal development, I learned to be more independent by picking up skills such as renting a house abroad, settling bills, getting lost in different places, asking for help, and budgeting. These are skills that you cannot really learn unless you absolutely have to do them, and what better place to do them than in a country you have never lived in! This exchange gave me a great opportunity to be as outgoing as possible and the limited time frame forced me to try as many things as I could. In the second academic year of my degree (2019), I was lucky and blessed to be able to go for exchange to the UK campus. It was my first time going overseas, and I was filled with a mixture of excitement and fear. In the end, it was a wonderful and unforgettable experience after all. I was lucky to have my course mates as my housemates who, though of different races, stayed together peacefully and happily. I prepared every meal daily and I enjoyed bringing my lunch with me to university, notwithstanding the challenge of having to look for a microwave during meal time! Another thing that I liked about the UK campus is that they have a huge sports village where almost all kinds of sports were available. I was also amazed by the passion and enthusiasm demonstrated by the lecturers – they were awesome, friendly, knowledgeable, approachable and lovely. I enjoyed my classes, no matter if it was a lecture or practical class. Through this programme, I expanded my knowledge of possible future careers. There were many workshops organized by MyCareer and even the School of Psychology itself. I recommend you to manage your time well and attend some of the workshops as this will enhance your relevant skills and provide you with some highly relevant information regarding career paths. Besides workshops, you can also participate in the Nottingham Advantage Award (NAA) by choosing a variety of modules offered in the UK campus. As for me, I taught psychology to local primary school students. You will be amazed by how responsive the children are and how highly driven they are to learn new things! I also joined the Travel Society and became a volunteer – I was able to enjoy free day trips and simultaneously develop my interpersonal, communication and leadership skills. If I were given an opportunity to exchange to another campus I would, without a doubt, grasp the chance! This exchange program has directly and indirectly shaped my personality and developed me into a well-rounded person. For example, I learned to be an independent student without any guidance from my parents. I disciplined myself to develop as a student, by attending lectures and making time for exercise. I learned to think critically to get through the inevitable obstacles arising during the exchange. I also learned to adapt to a new environment by doing things such as talking to my friends when I felt homesick. This way, I knew that I was never alone in a new place and I received sufficient support from friends and mentors when it was necessary. I am grateful from the bottom of my heart that with the support from different groups, I was able to experience being a student of University of Nottingham, UK. I am proud of the experience. To you reading this article, if you are still considering if you should participate in the exchange program, my piece of advice is to give it a try: you will be astonished by how the experience will benefit you in many different ways for a lifetime. All the best! I spent the second semester of my second year (Spring 2019) in the University of Nottingham, UK. It was a fabulous experience for me and I am very grateful that I took this opportunity to study abroad. Since the syllabi are the same across both the UK and Malaysia campuses, it was not a problem for me to get up to speed in my classes. Although the classes in UK were bigger than those in Malaysia (around 200 people), I was still able to follow what was taught in class and the lecturers were passionate in answering questions the students might have. I would like to single out the tutoring system: I was assigned to a personal tutor, who helped me get familiar with the faculty and provided any help I needed. I also took the advantage to use the campus facilities such as the sport complex and meeting rooms, where I spent most of the evenings with my friends. I also explored the campus on foot and by the campus shuttle bus, and enjoyed the scenery in various locations. During the weekend, my friends and I would try out different food in Beeston town after getting our groceries, and we liked to explore the city. I also took the chance to travel around the UK and Europe during the semester break. It was a precious experience as I was exposed to different cultures. Overall, this exchange programme experience is one of the best memories in my life. It might be hard to live in a foreign country, but the programme taught me many lessons that will benefit me in the long run. I became more outspoken and independent as I had to step out of my comfort zone to meet new people and try out new things. I also learned how to spend quality ‘me’ time and enjoy living in the moment. I believe that the flexibility and adaptability to new cultures I acquired during this exchange will help me go far in my future career. I went on an inter-campus exchange program to the UK campus for my spring semester in my second year of study (2020). Studying at the UK campus allowed me to experience different learning methods through the lectures and exposed me to a different learning environment. Besides bonding with my course mates on the exchange programme, I also got to know and make friends with other students from different courses that were also part of this programme. I took the opportunity to travel around several cities in the UK, creating unforgettable memories with my friends. This exchange programme provided me an opportunity to experience what it is like to live far away from home and family; it allowed me to grow and to be more independent as I had to adapt to the new environment, get used to the local slang, and handle important matters when I arrived in the UK. In short, I found the exchange programme to be memorable, and it definitely helped me develop and mature myself in different aspects. I had the opportunity to go on exchange to our UK campus in the 2018/2019 academic year and it was the experience of a lifetime. I made wonderful friends that I still stay in touch with, and I hope to maintain these friendships for a long time. For me, it was key to stay open to new experiences and to take things as they come. The way the students in the UK approached matters was different from how I did, so it took me some time to understand and adapt to their ways. Most people I met were friendly and helpful, and I was grateful for that. During my exchange, I stayed at a place called Graystacks and it was a great environment to live in if you are keen on socialising. They offered me a job there as Resident Coordinator, which allowed me to aid other tenants and also provided me with some extra income to fund my travels. It was something I could add to my CV and also exposed me to working in the UK. Personally, the exchange programme made me more independent and pushed me out of my comfort zone. I never thought I would travel solo, but I did it anyway – I was either going alone or not going at all. I was also forced to handle serious matters on my own and learn to manage my finances much better. The exchange taught me the benefit of working hard and also having fun at the same time; I was able to strike that balance and I valued this experience. In the academic year of 2019/2020, as part of the second year of my undergraduate degree, I had the opportunity to participate in an inter-campus exchange programme with the University of Nottingham UK Campus. Like any university programme, one should focus on studies to achieve what one desires. Instilling self-discipline is crucial: one should find a balance between working hard and having fun! For me, I attended numerous university-sponsored events, theatre shows, open nights, social gatherings and the like – each was a worthwhile learning experience, and I was able to draw inspiration from them. The number of clubs and societies is astonishing, to say the least; for every interest out there, there is possibly a group for you! Volunteering in the community is also heavily emphasized in the culture, and I had the chance to help out during my spare time. Travelling around the UK and to nearby countries was also incredibly fascinating, and I enjoyed learning about the rich history and geography of those countries. Touring the many enthralling landscapes and captivating sceneries with companions has been a source of joy. While my experiences have been limited by COVID-19, I have no regrets on my time spent in the UK. While there are minimal differences between the teaching methods of the two campuses, the UK campus has an edge over the Malaysian campus in its networking opportunities. Over the academic year, I had the opportunity to attend many research talks by leading figures in their fields from universities across the country – my knowledge of the different psychology disciplines was widened with greater exposure to the current trends in research. Career talk and workshop hosts were highly engaging, expanding upon my understanding of job opportunities in the current market. While a majority of these are optional, you should attend them – the wealth of information offered should not be passed up and there may be free food too! In addition, I participated in multiple psychology experiments led by postgraduate researchers, and experienced several research methods first-hand, ranging from TMS stimulations to an fMRI brain scan in the Sir Peter Mansfield Imaging Centre. A great deal of these experiences are unique to the UK Campus, and I would encourage others to participate in them as well. I truly enjoyed the exchange experience having grown as an individual, as moving to a foreign country requires a degree of maturity. There are often challenges in adapting to the intercultural differences, and part of becoming a full-fledged adult is developing the acceptance of change. There are also many day-to-day living skills that I have improved on; as odd as it sounds, I have grown fond of my weekly grocery runs to the local Sainsbury’s! My communicative skills have been honed too as a crucial part of the culture in the UK is taking the initiative to engage in conversation. Consequently, I have built upon my confidence in participating in discussions and discourses, to convey my thoughts and feelings in a manner befitting the context. I stepped beyond the boundaries of comfort and openly shared my background experiences when befriending colleagues and establishing companionships. Being away from friends and family can be hard at times, and having people to support you is valuable. It has been a great pleasure to have participated in this inter-campus exchange programme, and the time I spent in the UK will remain an important period in my life as a university student. I recommend others to go on exchange – it will be a rewarding experience for you! During the second year of my degree, I went on exchange for a year to the UK campus of the University of Nottingham. This experience encouraged me to become more independent, which led me to learn many things that assisted my personal development. I learned how to cook simple meals for myself and how to plan out my groceries, given the limited fridge space I had. I also got to experience living with housemates of different backgrounds, and they taught me many things about their cultures. In addition to my personal development, this experience also exposed me to the world of psychological research. The School of Psychology organised talks by researchers from various universities at least once a week. There were also many experiments that I could take part in, and in one of these a researcher conducted an MRI scan on my brain. The researcher was kind enough to send me the file and an application that would allow me to utilise the scan. These experiences have given me valuable insight into the field of psychology, and I am sure this will help me with my future career. Lastly, I was able to make quite a few new friends. Due to the small number of students going on exchange, I had the opportunity to spend more time with them. I am grateful for the memories I made with them, whether it be travelling, studying, or even just having a meal together. I went on exchange over the 2019/2020 academic year, in my second year. I would describe it as possibly the best few months of my life. Going on exchange has been my goal and dream since I applied to the University of Nottingham Malaysia; I worked hard and was finally given the opportunity to study abroad. When I arrived, I thought that the UK campus was absolutely beautiful. My favourite thing to do after a long and exhausting day was to walk around campus in the glow of the setting sun and to let my legs take me anywhere as I felt myself unwind. I also enjoyed the academic experience there. I had been informed of the relative size of the class before going for exchange, but experiencing it put it into perspective. There were probably three times as many students in a UK classroom as in a Malaysian classroom. The lecturers were not only friendly and easy to approach, but were truly experts in their area. I was impressed with the facilities provided by the university. There were free shuttle buses that could take you from one campus to another. The university is also well-connected with the city’s public transportation system, making it easy to catch a bus or a tram from within the campus itself. The food choices on campus were varied – as a Muslim, I was delighted to find halal food in the cafeteria. It was also easy to find vegan and vegetarian meals. The services provided were also of great help, especially the Careers and Employability Service. They organized frequent workshops and seminars that were course- and school-specific, and offered one-to-one sessions to discuss students’ concerns for their future careers. They assisted students in finding relevant work experience, whether it be with the university or external organizations. The university was also bustling with activities and events organized by various clubs and societies. I met many people by being active in the societies there. I strongly recommend UNM students going on exchange to reach out to the Malaysian Society: they helped me find accommodation, as well as offered tips and insight on living in Nottingham. I made many new and meaningful friendships from participating in their events, and as a member I got Chatime perks too! Being in the city of Nottingham as well as the UK in general was such an incredible experience. The city was the perfect balance of quiet and bustling. Nottingham is not as busy as London, but events are regularly held, and there are many places to walk around and shop at. If you are Muslim, there are also many halal and Asian food choices, including ethnic food markets, so eating out is never a problem. I also travelled plenty while I was in the UK and visited many cities and towns. Some of it I did with my friends and some I did with the Travel Society, who offered day trips to famous cities for student prices. Travelling is one of my favourite parts of my experience abroad, so I recommend using this once-in-a-lifetime experience to explore as much as you can. The highlight of my experience, though, would be the friendships I formed over the few months of being in Nottingham. Being across the globe away from your home country, you rely on those around you more. I truly would not have made it through the experience without my friends. Although my exchange experience was cut short due to COVID-19 and I returned back to Malaysia four months earlier than expected, my time there meant so much to me because of how much I grew as a person. First, being away from my family pushed me to be more independent. I had to take care of myself, my health and my safety. Not only that, I had to manage my finances well and plan wisely. I had to be more responsible and think of the consequences of my actions and decisions more intently. As I was in a different academic environment, I pushed myself to work harder: I had to have self-discipline and be strict on myself to perform in my studies and not slack off. I had to take my future seriously as I was in my second year, so I often joined career talks, seminars and consultations, which opened my mind to future prospects and finding relevant work experience. Social events were out of my comfort zone as I am an introvert, so I worked hard in building networks and connections during my time in the UK. Socialising became easier over time and I ended up making many good friends, which I counted as a win. The exchange programme was truly a remarkable experience as I had learned so much about the world and about myself. Although it wasn’t very long, the months I spent abroad will always be kept safely in my mind as every moment felt precious. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}