{
    "url": "https://www.nottingham.edu.my/Psychology/Research/Neuropsychology.aspx",
    "content": [
        {
            "p": "The development of Neuropsychology in Malaysia is still in its early stage. Our research group aims to spearhead neuropsychological research in the country to advance the knowledge of both normal and abnormal brain functioning. From basic cognitive functions (e.g., memory, attention, language, perception, executive function) to brain anatomy, currently our studies focus on how the brain mechanisms in relation to any specific cognitive function can change due to the ageing process. We use various techniques such as quantitative approach, experimental design, saccadic eye movements tracking, brain recordings (e.g., EEG), transcranial electrical stimulation (e.g., tDCS, TMS) to explore the age-related brain functions, from healthy ageing to pathological ageing (e.g., Alzheimer’s disease and dementia). We also investigate how the ageing brain tries to compensate its age-related deterioration by recruiting brain regions that are not normally seen in the young people’s brain, and whether these compensatory mechanisms benefit or worsen the cognitive functions. Moreover, our research group also look into potential ways to detect early signs of age-related cognitive declines and develop therapeutic strategies to combat with these deficits – cognitively, emotionally, and behaviourally. Dr Polly Chen Dr Soon Tat Lee At UNM, we are currently engaged in several innovative neuropsychology research projects encompassing diverse areas of the brain and its functions in relation to human behaviour. Our aim is that the neuropsychology research from UNM will contribute to developing effective interventions and treatments. A randomised controlled trial using transcranial brain stimulation in managing psychotic behavioural and psychological symptoms of dementia: A pilot study Monitoring dementia using smartphones (MODUS): An eye tracking study Reviewing neuropsychological assessments in Malaysia in both clinical and non-clinical settings A comparison of code-switching patterns in dementia and neurologically normal bilingual speakers Neuropsychological changes in healthy and pathological ageing Cognitive reserve Compensatory mechanisms in the ageing brain Emotional processing and management of people with dementia and their caregivers Domain validation and cultural adaptation of neuropsychological assessments in Malaysia Neuropsychology research focuses on the study of brain-behaviour relationships. It explores how brain structure and function impact cognitive, emotional and behavioural processes. Neuropsychologists study a wide range of topics that concern brain-behaviour relationships. This includes brain injuries, neurodevelopmental disorders, cognitive functions, memory, attention, emotional processing, and brain plasticity. Neuropsychology researchers research to expand the understanding of brain functions. These findings are then applied to improve assessing and treating patients with neurological conditions. Some main areas of research within neuropsychology include brain injuries, neurodevelopmental disorders, cognitive rehabilitation, memory and attention, and the effects of brain lesions on behaviour and cognition. Neuropsychology research at UNM employs various methods, such as cognitive assessments, behavioural experiments, case studies, and neuroimaging (e.g., PET scans and fMRI) to examine brain-behaviour relationships. Students will have the opportunity to participate in research projects, gain hands-on experience and delve into their areas of interest. Yes, neuropsychology research students can apply for various scholarships at UNM. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}