{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pol-academic-misconduct.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on academic misconduct. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. Includes: academic integrity; summative and formative assessments; scope; fitness to practise procedures; training and guidance; responsibilities; standard of proof extenuating circumstances; aggravating factors 1.1 The academic activities at the University of Nottingham whether scholarship, research, or innovation are based on the values of academic integrity. Academic integrity is a set of values and practices that expect us to act with honesty, trust, fairness, respect, and responsibility. 1.2 Academic misconduct is any inappropriate activity or behaviour by a student which may give that student, or another student, an unpermitted academic advantage in a summative assessment and is unacceptable within the University’s scholarly community. This includes activity or behaviour during preparation for a summative assessment even if there is no direct evidence of misconduct in the submitted assessment itself, e.g., approaching a third party for help during an examination even if there is no evidence of the material provided being used in the summative assessment. Such activities and behaviours will be considered under these regulations, and this may lead to a penalty being imposed. A summative assessment is an assessment that counts towards an award, a transcript mark, or a progression decision. This includes postgraduate research students’ annual reviews and thesis submissions. 1.3 These regulations are to be applied to all students of the University, whether currently registered or not. Former students will be subject to the academic misconduct regulations that were in place whilst they were a registered student. 1.4 The University’s Fitness to Practise procedures may also be applied to students on programmes of study that lead to professional registration and whose actions are considered under these regulations. Findings of proven intent to commit academic misconduct (see 1.10 below) will also be referred for consideration under the relevant Fitness to Practise concerns process. For more information, please consult the following: Fitness to practise procedures 1.5 Schools/Departments will provide advice and examples to students of what constitutes academic misconduct. They will inform students of these regulations and the possible outcomes of academic misconduct. Students have a responsibility to undertake available training and read relevant guidance. 1.6 Students must take responsibility for the integrity of their own work, including asking for clarification. 1.7 Confirmed instances of academic misconduct and any penalty imposed may be referred to in student references relating to a student’s academic achievement at University. For some courses, the University must notify the relevant accrediting body. For more information, please consult the following: 1.8 The standard of proof is that of “the balance of probabilities”. Evidence indicating that, on the balance of probabilities, academic misconduct has occurred will be deemed sufficient for action under these regulations. 1.9 Although extenuating circumstances do not justify the occurrence of academic misconduct, such circumstances may be taken into account when determining an appropriate penalty. Students are responsible for ensuring that they inform the University of any extenuating circumstances that they consider are affecting their ability to undertake an assessment, to ensure appropriate support can be provided. 1.10 It is not necessary to prove intention to commit academic misconduct to make a finding of academic misconduct. However, proven intent to commit academic misconduct is likely to be considered an aggravating factor when determining a penalty. Examples of proven intent include, but are not limited to: Includes: plagiarism; false authorship; collusion; misconduct in examinations and in-person assessments; fabrication or misrepresentation 2.1 The following is a non-exhaustive list of examples of academic misconduct which will be considered under these regulations: Plagiarism is representing work or ideas of a third party as one’s own. For example, by failing to correctly acknowledge others’ ideas and work as sources of information in a summative assessment. Plagiarism is not limited to text-based sources; it also applies to the use of graphical material, images, video/audio, calculations, etc. Where permitted, a proof-reader may identify spelling and basic grammar errors. Inaccuracies in academic content must not be corrected nor should the structure of the piece of work be changed; doing so may result in a charge of plagiarism. A proof-reader may only be used to ensure that the work meets a quality threshold in accordance with the University’s Policy on Proofreading unless a School/Department policy specifically prohibits this. Students should make every effort to familiarise themselves with their School/Department’s policy as well as the University policy regarding proof-reading. Paraphrasing or re-ordering the words of plagiarised text to avoid Turnitin matches is plagiarism if the ideas are represented as the student’s own. Schools/Departments should ensure this information is accessible to students. For more information about the Proofreading policy, please consult the following: Proofreading policy False Authorship is where a student is not the sole author of the work they have submitted as their own work. False Authorship is a form of plagiarism but is distinguished by the fact that the student has engaged with an unauthorised or unacknowledged third party and/or software tool to complete an assessment, either in part or whole. False Authorship can be direct or through a platform or software (such as Course Hero or similar). This may include work produced by another student, an essay mill, a family member or friend, or a tutoring service (such as Chegg, or similar). The use of answers advertised or provided by tutoring services or essay mills is false authorship. As it is the authorship of work that is contested, there is no requirement to prove that the work has been purchased. False Authorship also occurs where a student has engaged with computer-aided software to complete an assessment, in whole or part, except in cases where this has been permitted by an explicit instruction by the School and/or as part of that assessment. This engagement can be the use of Generative Artificial Intelligence (AI) software (e.g., ChatGPT, Wordtune, DALL-E, chatbots and similar). The submission of work that is generated and/or improved by software that is not permitted for that assessment, for the purpose of gaining marks will be regarded as false authorship and seen as an attempt to gain an unpermitted academic advantage. For clarity this includes the over-reliance on translation and paraphrasing software (for example Grammarly), including when it is used to conceal the original author or source material. Students should familiarise themselves with the local policies on what is, and is not permitted. If a student is unsure about what is/is not permitted for an assessment, they are responsible for confirming this with their School. Collusion is cooperation in order to gain an unpermitted advantage. This may occur where students have collaborated on a piece of work, in part or whole, and passed it off as their own individual efforts; where one student has authorised another to use their work, in part or whole, and to submit it as their own; or when a student has stolen somebody else’s work. A colluding student does not have to gain an unpermitted advantage in their own summative assessment for academic misconduct to have occurred. Misconduct in examinations includes, for example, when an examination candidate: Fabrication or misrepresentation is the presentation or misrepresentation of fabricated data, results, references, evidence, or other material, including, for example: For more information, please consult the following: Policy on minimum English language entry requirements Admissions 2.1.6 Failure to disclose previous experience or qualifications that are a bar to enrolment on a module (for example, enrolment on inter-faculty language modules). Language Centre module enrolment 2.1.7 Failure to obtain ethical approval: where work is undertaken without obtaining ethical approval when there is a clear and unambiguous requirement to do so. This may be specified, for example, in module handbooks or in University research ethics policies. Poor academic scholarship is conduct which breaches the standard of academic integrity expected by the University and which does not neatly fit into the definitions outlined above. Such behaviour could include; the mishandling and inappropriate use of research data and the uploading of information (including live assessment material and criteria) onto a public forum. The multiple submission by a student of their own material (either in whole or in part) is not considered academic misconduct. This includes work that the student may have submitted for a previous academic year, for another course or at a different institution. Submission of material that has been submitted on a previous occasion for a different summative assessment is, however, unlikely to be academically appropriate. The merit of such material will therefore be a matter of academic judgement. Declaration of falsified and/or counterfeit qualification is where a student has declared a qualification which has later been found to be counterfeit or fraudulently gained and affects the student’s suitability to study for their qualification at the University. Such behaviour may be found during the process of investigating an allegation of academic misconduct. If this is the case the student may be refered to to the University Disciplinary procedure: For more information about the University Disciplinary procedure, please consult the following: University Disciplinary procedure Includes: Code of ethical research conduct and research ethics; Policy on communications with third parties; Unacceptable behaviour policy; further guidance about procedures and exam conditions For more information about related codes and policies, please consult the following: For more information about the academic misconduct procedure and exam conditions, please consult the following: Student Services - Academic misconduct procedure Student Services - In-person examinations Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/code-of-practice-on-handling-allegations-of-research-misconduct-v1-09-jan-2020.pdf",
        "uk_pdf_files/unacceptable-behaviour-policy.pdf"
    ]
}