{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/taught-mod-enrolment-and-additional-credits.aspx",
    "content": [
        {
            "p": "This page provides information on student enrolment and registration for all modules, including additional credits. Its content is primarily directed at undergraduate and postgraduate taught students but may also be of interest to staff across all of the UK, China and Malaysia campuses. Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship Includes: student responsibility; University's right to not award marks; access to information In order to qualify for an award, students must pursue an approved course of study. It is the student’s responsibility to see that the selected combination of modules accords with the regulations for their course. The University retains the right not to award marks for coursework or to allow students to sit examinations for modules for which they are not formally registered. The 'Courses' tab on the MyNottingham Portal, available to all students, reflects the information held on the University’s central student records system; MyNottingham also provides guidance on how to rectify incorrect data. In order for a student formally to be entered for an examination, MyNottingham must accurately reflect the student's module enrolments. Includes: compulsory modules; other choices; review; issues regarding submission Includes: autumn semester; spring semester; restrictions To provide students with an opportunity to change the modules they are studying, the University allows for the following two-week ‘change of mind’ periods. During these periods, students are able to change their module choices through the online module enrolment system, which will be reopened during these periods. Includes: Exceptional Amendment Form; responsibilities; subsequent requests to change; extenuating circumstances procedure After these ‘change of mind’ periods, a change to a module registration will only be accepted in exceptional circumstances and where the choice is formally approved – that is, approval from the school offering the module and from the student’s home school. To do so, the student must complete the following form: Exceptional Amendment Form It is the student’s responsibility to ensure that any requests to exceptionally change a module are notified to their school or department immediately. This notification is via the completion of the form above. Only one module change request per form is permitted. The University reserves the right to give marks only for modules that the student is formally enrolled on. In cases where the student has failed to notify the change via the form a mark of zero may be awarded for the module a student is enrolled on, even though they have studied and successfully completed another module, on which they are not registered. Requests to change a module registration once the majority of the teaching for the module has been delivered (in the case of year-long modules this will apply when the majority of teaching in the initial semester has been delivered) must be approved by Quality and Standards Committee (QSC). Such changes would only be possible when there are extenuating circumstances. In such cases, please note the following: If the change is agreed the Registry and Academic Affairs Programmes team will be notified and will update the student record. For more information about what kind of circumstances are permissible, please consult the following Student Services page: Extenuating circumstances Includes: normal expectations; exceptional procedure; confirmation; important information for students; student fees and finance The normal expectation is that registered students of the University enrol for modules in accordance with the appropriate University regulations and programme specification. Exceptionally, however, a student may be allowed to register for a maximum of 20 credits of additional credit-bearing modules in any one academic year (see 9e below). When a student wishes to undertake a module(s) that cannot be accommodated on the course on which they are registered, the following procedure will apply: 1. The student should initially approach their school to confirm that the module(s) they wish to undertake cannot be accommodated on their degree course. For students registered on a joint honours degree, the school with overall administrative responsibility (the ‘lead’ school) for the course should be approached. 2. If the module(s) cannot be accommodated within the structure of the degree course, the student will be allowed to take them in addition to their degree course credits. 3. The student’s school should confirm the details of the additional module(s) that the student wishes to study to the home Student Services programmes team. 4. If the module specification specifies a maximum number of available places, the school offering the module should always give priority to students who need or wish to take that module(s) as part of their degree course. It is for this reason that a student wishing to undertake an additional module(s) may have to wait until the normal module enrolment process has been completed before knowing for definite that they may enrol for such additional study. 5. Upon receipt of the request from the school, Student Services staff will add these additional modules to the student’s record and arrange for a pro rata tuition fee to be charged to the student. 6. Once the student has completed the assessment for the additional module(s) as outlined in the module specification (i.e. submitted the coursework and/or sat the examination), the school offering the module(s) should inform the Student Service Centre so that the module(s) may be deleted from the student’s record to allow marks processing to operate as normal. 7. If the student does not pass the module upon their first attempt, the offering school reserves the right to refuse a reassessment opportunity. If a reassessment opportunity is granted, the student will be charged the appropriate reassessment fee. 8. If the student requires written confirmation of any details relating to the additional module(s), this should be provided by the school offering the module(s). 9. Students should note that: (a) undertaking additional credits is done entirely at their own risk; (b) any effect of the workload associated with the additional module(s) will not be accepted as an extenuating circumstance in relation to performance on their degree course; (c) any credits awarded for the additional module(s) will not appear on the final transcript. Confirmation of any details associated with the additional module(s) is carried out exclusively by the school(s) offering the module(s) (8 above); (d) any credits awarded for the additional module(s) will not be counted when determining either progression entitlement or an award of the University (including interim awards), irrespective of the student’s performance in such a module(s); (e) the maximum number of additional modules is limited to 20 credits per academic year and no more than 15 credits in any one semester. More information on reassessment fees can be found here: Student fees and finance - tuition fees Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}