{
    "url": "https://www.nottingham.ac.uk/qualitymanual/professional-work-based-learning/uono-verification-service.aspx",
    "content": [
        {
            "p": "This section provides information on the University of Nottingham Online verification service and includes regulations, process and template forms The University of Nottingham may sometimes verify the claims made by Continuing professional development (CPD) providers for their learning products. In so-doing, UoN does not thereby endorse or recommend the learning product. Rather, through verification, UoN confirms that the learning product does what is claimed for it, by the CPD provider. In particular, through verification UoN confirms that learners successfully completing the learning product will have met the learning outcomes claimed for the learning product by the CPD provider. 2.1 Verification may only be offered for learning products that are below degree level (i.e. at level 5 or below). These products may not be used for Recognition of Other Learning for degree credits. 2.2 Where verification is offered, learners successfully completing the learning product will receive a digital badge from UoN that confirms their successful completion of the learning product. This badging is not recognised by UoN as contributing to the completion of any degree qualification. 2.3 Before verification can begin, UoNO must satisfy itself that the prospective client is of suitable standing by undertaking due diligence and forwarding a business case to the Planning and Resource Committee (PRC) UoNO sub-committee for consideration and decision. 2.4 The verification process has three phases, each requiring some review. Prior to commencing those phases, Academic Experts and External Reviewers must be pre-approved by QSC. Providers delivery platform and materials are reviewed to confirm that learners successfully completing the learning product should meet the learning outcomes claimed for the learning product by the CPD provider and should be able to do so with the support proposed by the provider. Following successful completion of phase 1, UoN will evaluate each learner cohort in order to determine whether a digital badge will be issued to that cohort. CPD provider’s platform and materials are re-reviewed for a specific learning product after learners have completed that product to confirm that the CPD provider used the platform and materials first reviewed in phase 1 (and/or any deviations were non-material). Evaluation of a sample of the learners’ completed work and feedback, alongside evaluation of any marking rubrics used to confirm that the work completed is of a standard that demonstrates that learners successfully completing the learning product have met the learning outcomes claimed for the learning product by the CPD provider. On successful completion of all three phases by the University, learners in the relevant cohort will be issued with a digital badge. The phases must be completed in order. If any phase is not successfully completed, a digital badge will not be issued to the cohort in question. An Annual Review of the verification products and processes undertaken by an External Reviewer will be undertaken for all verifications. The annual review is the means by which the university ensures that UoN policy and processes were followed effectively and to ensure that the learning products being verified are of a suitable standard, and that the student performances are judged appropriately. The aim of this process is not to scrutinise learners’ work or individual programmes/teaching materials that have been verified. 3.1 This process outlines the steps that must be gone through for UoNO to verify the online provision of a provider external to UoN and to award a UoN digital badge to learners. 3.2 Verification may only be offered in cases where the online provision is not credit bearing and UoNO verified online provision may not be used for the award of credit at the University of Nottingham. 3.3 A digital badge acts as digital confirmation that the learner has achieved the learning outcomes of the learning product. For the award of a digital badge to learners, all three phases of the verification process must be completed with approval. 3.4 The process may be halted at any stage and by either the client or UoN. Prior to the initiation of Phase 1, UoNO must satisfy itself that the prospective client is of suitable standing by undertaking due diligence, including steps a - e. (a) When a client approaches UoNO to request verification, the Academic Director of UoNO determines whether or not the scope and scale of the project are appropriate for verification, and whether or not the UoNO wishes to partner with the client (including liaising with UoNO CEO regarding the potential new client). Approval at this stage does not commit UoNO to verification. This step of the process is purely to confirm initial interest in the project on the part of UoNO. (b) The client is asked to confirm that they wish to engage in the verification process, with all aspects explained to them, including: timelines, pricing and process. (c) The Business Case for partnering with the client should be prepared and submitted to the Planning and Resource Committee (PRC) UoNO sub-committee for consideration. The Business Case should include information on the proposed verification, the due diligence undertaken and the pricing model, and any other information requested by the committee. (d) If the PRC UoNO sub-committee recommends to PRC that the proposed verification project can be approved, and this is agreed, confirmation will be provided to the CEO/Academic Director in writing. (e) Once approval has been given, the project can move to Phase 1. UoNO and the prospective client may start work for Phase 1, at risk, prior to formal approval being given. A review of the CPD provider’s platform and materials for each specific learning product. The goal of Phase 1 is to confirm that learners successfully completing the learning product should meet the learning outcomes claimed for the learning product by the CPD provider and should do so with the support claimed by the provider. (a) Working with HR and Schools, UoNO must recruit Academic Experts from the wider UoN to engage in any/each of the phases verification process and outcomes review. Academic Experts external to the UoN are not permitted for the Phase 1, 2 or 3 reviews. The Academic Expert(s) need to be a subject area expert with suitable qualifications (eg. AFHEA) and should also have experience in the development, implementation and/or design of teaching programmes. They would usually have external examiner experience. If required, this could be more than one person. Please see the ‘guidance for Appointment of Academic Experts’ (Appendix 1 of the Academic Expert Nomination form) for more information. (b) If such Academic Experts cannot be found to do the reviewing, verification cannot proceed. (c) These Academic Experts require QSC approval prior to undertaking any review work (see template Academic Expert nomination form). (d) The recruitment process will be managed by UoNO, in collaboration with HR as necessary. (e) The Academic Expert(s) must complete the Phase 1 Verification Template (see template Phase 1 verification template ) and send to the UoNO Academic Director. In completing the Phase 1 Verification Template, the Academic Expert(s) should consult the Guidance on Standards for Verification. (i) If no concerns are raised, the Academic Director should confirm that verification will be granted and the Academic Director must send the completed Phase 1 Verification Template to QSC for report (ss-qsc-cases@exmail.nottingham.ac.uk). The Academic Director may also ask QSC for guidance or advice if they wish to do so. (ii) If concerns are raised, or more information is requested by the Academic Expert(s), the Academic Director may either ask the client for more information, or else they should decline to grant verification. There is no upper limit on the number of times that additional information may be sought. (iii) If granted, Phase 1 verification of the learning product will last for 12 months. The only exception to this is if UoNO has concerns raised through Phase 3 that the learning product is not enabling learners to meet learning outcomes. (iv) In advance of the 12 month period coming to a close, the Academic Director of UoNO should commence the Phase 1 verification process once again. If not renewed by the 12 month deadline, then Phase 1 verification will automatically lapse at the 12 month mark. (v) If verification lapses, the UoNO Academic Director must inform QSC that Phase 1 verification has lapsed. (vi) Once verification is granted, the client may not make alterations to the provision without approval. If they wish to do make changes, they must contact the Academic Director who will determine whether the changes are minor and do not affect Phase 1 verification, whether to re-instigate the Phase 1 verification process described above, or whether to remove verification. Anything other than minor changes should be reported to QSC (minor changes would be picked up in a Phase 2 review). (vii) Phase 1 may be completed without completing Phases 2 and 3. Phase 2 consists of a re-review of the CPD provider’s platform and materials for a specific learning product after the learners have completed the learning product, to confirm that the CPD provider used of the platform and materials first reviewed in Phase 1 (and/or any deviations were non-material). This review is required prior to a Phase 3 review (for learners’ digital badges). For avoidance of doubt, Phase 1 must precede Phase 2. The Academic Expert(s) do not have to be the same person/people as the Phase 1 review, but may be. The Academic Expert(s) must complete the Phase 2 Verification Template and send to the UoNO Academic Director. In completing the Phase 2 Verification Template, the Academic Expert(s) should consult the Guidance on Standards for Verification . Any deviations from the Phase 1 approval should be highlighted and discussed by the Academic Expert and Academic Director to determine if those change invalidate Phase 1. (a) If no concerns are raised, the Academic Director should confirm that Phase 2 re-verification will be granted and the Academic Director must send the Phase 2 Verification Template to QSC for report (ss-qsc-cases@exmail.nottingham.ac.uk). The Academic Director may also ask QSC for guidance or advice if they wish to do so. (b) If concerns are raised, or more information is requested by Academic Expert(s), the Academic Director may either ask the client for more information, or else they should decline to grant verification. There is no upper limit on the number of times that additional information may be sought. 3.8.1 Phase 3 consists in an evaluation of a sample of the learners’ completed work and feedback, alongside any marking rubrics used to confirm that the work completed is of a standard that demonstrates that learners successfully completing the learning product have met the learning outcomes claimed for the learning product by the CPD provider. 3.8.2 For avoidance of doubt, Phases 1 and 2 must precede Phase 3. The Academic Expert(s) would normally be the same person/people as Phase 2, but may be different. (a) The Academic Expert must review learner outcomes within each cohort in order for the UoN digital badge to be awarded to learners within that cohort. (b) It is necessary for the Academic Expert to be able to select which learners work is reviewed. Work should be reviewed from a minimum of 25% of the cohort up to a maximum of the work of 40 learners, depending on cohort size. This sample should be selected randomly but should include at least one submission from each mark range (where they exist): e.g. 0-39, 40-49, 50-59, 60-69, 70-100. Additionally, all fails should be reviewed. (c) The Academic Expert(s) must complete a review of learner work and feedback as well as the marking rubrics, and complete the Phase 3 Verification Template and send to the Academic Director. In completing the Phase 3 Verification Template, the Academic Expert(s) should consult the Guidance on Standards for Verification. (i) If no concerns are raised, the Academic Director can confirm to the client that the Phase 3 review has been satisfied, and UoN digital badges may be issued to the learners within that cohort who have satisfied the learning outcomes specified. The Academic Director must send the completed Phase 3 Verification template to QSC (ss-qsc-cases@exmail.nottingham.ac.uk) for report. (ii) If concerns are raised, or the Academic Expert asks for additional information, the Academic Director may either ask the client for more information, or else they should inform the client that UoN Digital Badges may not be issued to this cohort. . If the Academic Director reaches the decision that UoN Digital Badges may not be issued to this cohort, this decision should be reported to QSC (ss-qsc-cases@exmail.nottingham.ac.uk) and the learning product should be re-reviewed using the verification process described above. 3.8.3 UoNO must maintain a complete and up to date record of all verified courses and Phase 3 outcomes reviews and award (or not) of digital badges, with accompanying documentation. 3.9.1 The verification of external learning products will be reviewed annually by an External Reviewer who will be asked to review materials produced by UoN Academic Expert(s), including verification reports and reviews of outcomes. For avoidance of doubt, the External Review does not review the underlying materials provided by the external CPD provider. 3.9.2 The purpose of the external annual review is to establish whether the regulations and processes around verification are being correctly implemented, and to give external advice as to how the regulations and processes might be improved. It will enable the University to ensure that the learning products being verified are of a suitable standard, and that the student performances are judged appropriately. 3.9.3 UoNO are to recruit this External Reviewer using the approach described in the External Examiner for taught courses process . External Reviewers are appointed on an annual basis up to a normal maximum of four years' service. UoNO will need to ensure that they nominate suitable candidates for the roles of External Reviewer, ensuring the External Reviewer Nomination forms for appointment of External Reviewer are sent to the Quality and Student Management Systems team for approval by QSC. 3.9.4 The External Reviewers are asked to complete the External Review template form . Once this is complete, it should be sent to the Quality and Student Management Systems team for QSC consideration as part of the PG annual review cycle. If you have any problems or queries relating to this page, please contact: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}