{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2008.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2008. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. Recent Changes to Research Degree Programmes Section: Following consultation with Academic Boards, the regulations for the Degrees of Master of Research and MA/MSc by Research regulations have now been amended to enable Schools with appropriate marking criteria available for the reference of examiners to be able to recommend these awards with Merit or Distinction if they wish to do so. The entry on Attendance Procedures has been amended to include a sentence which states: \"Permission to register on a second course to be taken concurrently at the University must be sought in advance from the School with which the student is initially registered. Students will not be permitted to register on two full-time courses at the same time\" This is in the Study Regulations section. The following changes have been made to the Research Degree Programmes section: 1. Changes to Policy on Annual Review of Students Learning and Teaching Committee considered the issue of the initial registration of research students in November 2007, and endorsed the proposition that students accepted to undertake a PhD should be registered by Schools as PhD from the first year onwards. As a result of this decision, the Quality Manual entry on Annual Research of Research Students has been amended to reinforce this position. A statement has been added that ‘Offers to students who have applied for a PhD programme should be a place on that programme, except where the calibre of the applicant suggests that a place on an MPhil programme would be more appropriate'. Further, PhD students will now be required to undertake a strengthened annual review process at the end of their first year, which provides a robust mechanism for downgrading students at the end of Year 1 if they are clearly unable to perform at the PhD level. 2. Changes to entry entitled The Thesis-Pending Period This entry has been amended to clarify that students on MRes and MA/MSc by Research degrees are not entitled to a thesis pending period, but nonetheless are subject to the related extension policy and procedure if they are unable to submit by their deadline. A further sentence has been added to state that for students commencing their research degree as from Session 2009/10 access to facilities in the thesis pending period will only be available if students are registered as ‘thesis pending' students and pay the appropriate tuition fee. 3. Change to the entry Responsibilities of the Supervisor This entry has now been amended to make the requirements for the format of supervisions to be more flexible, but to stress that the format should be as close as possible to face-to-face supervision for a proportion of the meetings where it was not possible for meetings to take place. 4. Instructions for Research Degree examiners The instructions enclosed for the guidance of examiners when they are sent theses for examination have now been amended to invite them to give feedback if they wish on the quality and content of the University's research degree programmes in their Independent Reports. In addition, examiners for doctoral examinations who wish to recommend the award of a Master of Philosophy qualification after re-examination are asked to consider whether the criteria in the University's Master Level Qualification Descriptor are met. The following changes have been made to the Assessment section: 1. Following a report from the Joint Honours Working Group, Taught Courses Committee approved the inclusion in the Quality Manual of a policy document clarifying the responsibilities of Schools in relation to Joint Honours Programmes. The document 'Management of Joint Honours Programmes' has been added to the Assessment section. 2. The section on School Examination Boards has been updated to include guidance in the Overview regarding consideration of extenuating circumstances at Board meetings and to update in relation to Board consideration of students on Joint Honours programmes. 3. The information on the Layout of Exam Papers has been amended slightly. The front page of the exam paper should now state that \"Candidates may complete the front cover of their answer book and sign their desk card but must NOT write anything else until the start of the examination period is announced\" Following consultation with School representatives via Academic Boards in the Spring Semester, the University Regulations for Taught Masters Degrees, Postgraduate Diploma and Postgraduate Certificate courses have been updated as follows: A new Regulation 5 to state that work submitted for an award must be the result of work done mainly wile the candidate is registered as a student of the University of Nottingham; A change to the Regulation on compensation (now Regulation 11) to state that enable Schools to amend their programme specifications to allow up to 20 credits of module marks below 40% to be compensatable as long as the student is able to satisfy the requirements to have passed 80 credits and have an overall average for the taught stage of at least 50%; A new Regulation 12 stating that progression requirements may only be more stringent than those stated in regulation 11 if there is a demonstrable requirement for this from a professional or accrediting external body; An amendment to the Regulation setting out eligibility to receive a Masters award (now Regulation 19) stating that Schools wishing to use the dissertation mark towards the award of a Postgraduate Diploma may only do so if this is specified in their course supplementary regulations. The Student Support and Development section has been amended to clarify the personal tutoring expectations for Joint Honours students (see section C1) and the responsibilities of Schools in providing personal tutoring for exchange students (see section D1). The guidance on Double Counting of Accredited Prior Learning has been amended to clarify that credits gained as part of an undergraduate qualification may not be used towards a postgraduate qualification. Following approval by Learning & Teaching Committee, it has been clarified that offers to students who have applied for a PhD programme should be a place on that programme, except where the calibre of the applicant suggests that a place on an MPhil programme would be more appropriate. This is in the Recruitment and Admissions section. A minor amendment has been made to Model 3 in the Degree Classifications guidance. Previously the First Class threshold the borderline was defined as a score within 12 points of the threshold and for all other thresholds the borderline was defined as a score within 8 points of the threshold. This has been revised so that the threshold for all borderlines is defined as a score within 12 points of the threshold. The Academic Appeals Policy and Procedure has been revised. The triage approach to appeal submissions continues with various levels of decision making in operation. Vice-Deans now assume responsibility on behalf of Academic Boards for appeals where primae facia grounds may exist and a decision is required on whether a hearing should take place. Where the original decision (against which the student is appealing) was made on by an Academic Board, a representative from Learning and Teaching Committee makes the judgement. Guidance on the definition and use of learning outcomes has been added to the Programme Approval, Monitoring and Review section. This supersedes guidance previously contained in the Programme Specification and Module Specification guidance. The Programme Specification Guidance has been updated to clarify the relationship between University and Supplementary Regulations. In section C, part 3 Assessment, it is clarified that \"Programme Specifications may incorporate more stringent progression and award hurdles, only if there is a demonstrable requirement from a professional or accrediting body. Students who fail to satisfy the more stringent requirements in programme specifications associated with a professional or accrediting body but who satisfy University regulations should have the opportunity of transferring to a named ‘fall back’ non-accredited degree.\" And in section C, part 4 Other Regulations, it is clarified that \"The requirements of Programme Specifications should be in addition to, rather than instead of, the University’s regulations.\" The University's Bologna Advisory Group has formulated a Statement of Compatibility with the European Higher Education Area. which has been added to the University of Nottingham Qualifications Framework . It provides an explanation of how University of Nottingham qualifications meet the requirements of each cycle of the qualifications framework adopted at the Bergen Summit of the Bologna Process for the creation of a European Higher Education Area (see EHEA ). A new section has been created called Miscellaneous Policies . It has collated various polices which do not sit easily within the other sections: Included in the section is new Guidance on Religious Observance . Streamlining of Committees: Various sections of the Quality Manual have been updated to reflect the streamlining of the decision-making and dissemination processes, most notably changes to Teaching Committee (now called Learning & Teaching Committee) and its sub-committees. Revisions of note are to the following: Research Student Supervision: Clarification has been provided on the composition of the supervisory team appointed to research students, as well as their roles within the team. See section 3.2 in the guidance on the Appointment of Supervisors. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}