{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2007.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2007. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. Year-Long Modules Guidance has been provided for Schools on the creation and implementation of year-long modules. This includes guidance on assessment and making provision for mobility students. This has been added to section 6 of the Module Specification Guidance. In anticipation of possible Bologna developments, provision has been made for a 540 credit Extended Integrated Masters degree, which will supplement the existing 480 credit Integrated Masters Degrees. For both the Extended Integrated Masters and the Integrated Masters degrees, 120 credits need to be gained at level 4, not all of which need to be taken in the final year. This is in the University of Nottingham Qualifications Framework. The Responsibilities of the School guidance of the Research Degree Programmes section has had a minor amendment to clarify that a School should put in place a system for storing and monitoring supervision records, see section 8. The External Examiner Report Form has been updated, removing Part II, the confidential report to the University. Under the terms of the Freedom of Information Act we are unable to guarantee that reports will remain confidential to the University and external examiners will now be advised to write their whole report on the assumption that it will be accessed by students and may become a public document. External examiners will be able to make a confidential report under separate cover which can be anonymised should the need arise to release the document under an FOI request. The guidance on Invigilation of University Exams in the Assessment section has been updated to reflect the introduction of a central invigilation service for centrally scheduled main University examinations. Student Staff Feedback Committee It has been agreed that Student Staff Consultative Committees are to be renamed Student Staff Feedback Committees SSFCs). It has also been agreed that Schools must display clearly on their School website the names and contact details of the student representatives on the SSFC. This is in addition to the requirement to display clearly on the School noticeboard details of the SSFC membership, terms of reference, dates of meetings for the current session, and a copy of the minutes of the previous meeting. ASSESSMENT SECTION UPDATE The amendments and additions have been made to the Assessment section in light of revisions to Section 6 of the QAA Code of Practice. The additions include an e-assessment policy which outlines the minimum requirements that the University expects should be met by Schools when assessing by on-line examination. There is an associated procedure for Schools wishing to assess by e-assessment using QMP. Amendments include a requirement for Schools to bring policy and guidance to the attention of students, rather than just making it available (see Overview); clarification that the language of assessment is English, unless stated otherwise in the relevant programme or module specification (see Assessment Regulations); that Schools should specify the nature and extent of assessment feedback and whether this is accompanied by the return of assessed work (see Assessment Feedback Policy); that Schools should inform students how and when results will be issued (see Marking and Grading Policy); and that Schools should tell students where anonymity in the assessment process ends (see Anonymous Marking). In response to revisions to Section 4 of the QAA Code of Practice, the policy on external examiners had also been revised to clarify the duties of the external examiner in regard to the moderation of scripts and to define what would be considered inappropriate reciprocity in external examiner appointment. RESEARCH DEGREE PROGRAMMES SECTION UPDATE The following changes have recently been made to the Research Degree Programmes section of the Quality Manual: Schools have also been informed that the Quality Manual entry on the supervision of research students has also be changed, following consultation with Academic Boards, to make it a requirement to appoint more than one supervisor to a research student. In addition, it was agreed at the May 2007 meeting of Research Degrees Committee that the MPhil/PhD Regulations should be amended to state PhD students re-submit for PhD after initial submission, thus removing the option previously available to examiners that PhD candidates should re-submit for either the degree of PhD or MPhil. As a result of this regulatory change, the Procedures for Assessment entry, the guidance to examiners and Joint Report Form have been updated. Please see the attachment entitled “Information for examiners, supervisors and candidates for the degree of PhD” at the bottom of the entry on Procedures for Assessment. Following a review by Teaching Committee of Personal and Academic Support, this section of the Quality Manual has been substantially revised and re-titled Student Support and Development. The revised section clarifies and develops the personal tutoring function, as well as giving recognition to the role that central support services play in assisting students. The guidance on ‘Marks and Credit Transfer for Students on Placements’ has been revised in light of feedback from Schools and students, revisions to the Quality Assurance Agency Code of Practice on Placement Learning, and following discussions between the International Office and the Courses Office. Revisions to the current policy include: The guidance is within the Placement Learning section of the Quality Manual. There's been an addition to the guidance on appointing module convenors in the Module Specification Guidance to clarify that where a module is delivered in both the UK and an international campus, a module contact should be appointed at the international campus. The module contact will: undertake the liaison with the UK-based module convenor; have delegated responsibility for the modules delivery at the international campus; be the contact person in regard to that module for students at the international campus. The Collaborative Course Approval Policy and Procedure has been revised to clarify the types of collaborative provision supported by the University and the approval process. Following approval at Teaching Committee, the following changes have been made with a view to streamlining assessment and taught provision: Assessment 1. Module/Programme Specification Guidance Modules 2. New Modules The addition of the following to the policy on approval of new modules, to come into force with regard to modules being submitted for approval from the beginning of 2007/08: 'In submitting a new module for approval, the School should either: Where neither of the above circumstances exist, the School will need to make a case for the module to be approved, citing the significant institutional interests served by the module. The relevant Programmes Committee will seek the advice of Teaching Committee in considering any such case.' 3. 5-credit Modules The addition of the following to section 3 of the module specification guidance ('Number of credits'): 'The minimum credit size of a module is 10 credits and all credit sizes must be divisible by 5. 5-credit modules are only permitted where these place no demands on either the teaching or examinations timetables.' 4. Course Structures Programmes 5. New Programmes The addition of the following statement to the Quality Manual section on approving new courses: 'One of the aims of a new programme should be to increase (or, at least, help maintain) the overall intake of students to the University.' 6. Withdrawing Programmes The addition of the following statement to the Quality Manual section on Closing or Suspending a Taught Course: 'The University will automatically close any programme which has not had a student registered upon it for three years and for which there are no outstanding applications, unless the School is able to demonstrate likely future recruitment of significant numbers of students onto that programme.' 19 February Regulation 12 of the Regulations for Taught Postgraduate Courses has been amended to clarify that a student who, at the first attempt, has not satisfactorily completed the taught stage or research stage of the course has a right to one re-assessment in each failed module at a time to be specified by the admitting School but normally by the end of the following academic year or equivalent for part-time students. 19 February There have been two amendments to the Code of Practice for External Examiners (Undergraduate & Taught Postgraduate Programmes): 1. to include the addition of a requirement for reports to be available to, and considered by, the School's Staff-Student Feedback Committee; 2. To extend the appointment of External Examiners up to a normal maximum of three to five years' service (from the previous three years). 6 February A Form to allow a research student to request to Register for an Additional Year of Study has been added to the Research Student progress and Annual Review section. Where it is agreed that a student's course should be extended into a fourth year of study (for students registered as PhD candidates) or a third year of study (for students registered as MPhil candidates and intending to submit for that degree), the form should be completed and returned to the Registry, E Floor, Portland Building , University Park. 26 January A policy on waiving English Language Requirements has been added to the Recruitment and Admissions section. Applicants who are nationals from the listed countries and who have graduated in their countries with a recognised degree and/or who have successfully completed the equivalent of year 12 in high school will automatically satisfy the University English language requirements. Applicants from non-listed countries but who have completed a recognised degree and/or who have successfully completed the equivalent of year 12 in high school in one of the listed countries will automatically have their English language requirement waived if they completed these studies within the last ten years. 16 January An additional requirement has been added to the Information to be provided for students on their programmes of study section. Schools are required to provide details, for each module, of the format of the assessment(s), including, for written examinations, whether it is essay questions, MCQ etc 11 January The Assessment Feedback section has been revised to state: 1. All students should receive a clearly advertised opportunity to receive satisfactory feedback on their examinations. Where no other suitable mechanisms exist for providing feedback the module convenor should supply on the Web a generic feedback report (no more than one side of A4) for each module to the relevant group of students which: (a) highlights examination questions on which students' performance could be improved, (b) suggests strategies for improving performance in those questions, (c) gives general comments about technique. An optional template is provided at: http://www.nottingham.ac.uk/quality-manual/forms/examination-feedback-form.doc 2. All students failing a module should be given feedback on request which, as a minimum (though only where relevant), comprises a breakdown of their marks question-by-question. Schools are asked to make any necessary changes to their procedures in time for the January 2007 examinations where possible. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}