{
    "url": "https://www.nottingham.ac.uk/qualitymanual/student-engagement-and-representation/student-engagement.aspx",
    "content": [
        {
            "p": "This page sets out the University's guidelines for student engagement, including about the collection of feedback (from students) and associated quality systems. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. This area covers the University of Nottingham’s arrangements to ensure that students are fully involved and represented in all aspects of their learning experience, and have a range of opportunities to engage in the University’s quality assurance systems, at University level, at programme and academic level. Includes: methods of feedback; student representation; Quality and Standards Committee; feedback on modules and programmes; Student Staff Fora; Periodic Assurance and Continuous Enhancement Review The University obtains regular feedback from students through a number of methods, including: Students are represented on all of the University’s main committees, including student representatives from the overseas campuses where appropriate. In addition, schools are consulted on proposals from Education and Student Experience Committee (ESEC), Education Delivery Board (EDB) and Quality and Standards Committee (QSC) by way of Faculty Teaching Committees, which include student representation. For more information about ESEC, please consult the following: Education and Student Experience Committee For more information about EDB, please consult the following: Education Delivery Board For more information about QSC, please consult the following: Quality and Standards Committee Feedback on modules and programmes is collected from students by means of the University’s Student Evaluation of Modules (SEM) and Student Evaluation of Teaching (SET). They also have an opportunity to raise issues through their school’s Student Staff Fora (SSF or Learning Community Forum). This feedback is considered by schools as part of the annual monitoring process which is overseen by QSC. For more information about the use of SET and SEM or about SSFs, please consult the following: Policy on the collection and use of SET and SEM surveys Student Staff Fora The University’s Periodic Assurance and Continuous Enhancement Review (PACER) process provides an opportunity for student involvement in three ways: For more information about our review processes, please consult the following page: Programme monitoring and review Includes: University commitment; requirements; key committees/boards As part of the University’s commitment to enabling students to give effective feedback on the student experience, schools, departments and divisions should ensure that they have student representation on their Teaching Committees (or equivalent). This should include the Senior Course Representative(s) for that school, department or division. These meetings shall, wherever possible, be scheduled for times and dates when students are able to attend. A mechanism shall be put in place to ensure that student representatives are able to feed back discussions from the Teaching Committee or equivalent; this may involve the Student Staff Forum (SSF). Each faculty must ensure that they have student representation at their Teaching and Learning Boards and Student Experience Committees (or equivalent, on each campus); in the UK for undergraduates this should include the relevant UG Faculty Representative and for postgraduates this should include the relevant PGT or PGR Faculty Rep and/or Postgraduate Sounding Board member. Includes: role of Students' Union; support for student representatives The Students’ Union shall be responsible for delivering recruitment systems and effective training for student representatives at all levels, including initial induction training and ongoing development opportunities. The Students’ Union will engage with the University to review and monitor training on an annual basis. The Students’ Union and the University shall be jointly responsible for delivering an induction programme and ongoing support for staff responsible for Student Staff Fora (SSFs). Student representatives should be given effective support in demonstrating employability skills developed through their duties. For more information about these arrangements, please consult the following: Student's Union Includes: responsibility The University regularly monitors all quality systems (for example, by way of the PACER procedures) to ensure they are working effectively. This includes monitoring the effectiveness of student engagement within these systems by seeking views from student representatives on University committees and via the Course Rep system. For more information about Student Staff Fora, Action Logs and Annual Reporting, please consult the following: Includes: Policy on circumstances affecting students ability to study and complete assessments; extenuating circumstances; disability support services; religious observance; academic regulations The satisfactory operation of the assessment system relies to a large extent on the co-operation of the student body. The responsibilities of the individual student in this regard are as follows: For more information, please consult the following: Policy on Circumstances Affecting Students' Ability to Study and Complete Assessment When applying for extenuating circumstances, please complete the following: Disability Support Services Student Services – Religious observance For more information about student engagement with assessment, please consult the following page: Student Services Academic regulations Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}