{
    "url": "https://www.nottingham.ac.uk/qualitymanual/academic-regulations/statement-of-compatibility-with-ehea.aspx",
    "content": [
        {
            "p": "This page contains the Statement of Compatibility with the European Higher Education Area. Its content may be of interest to staff and students across all of the UK, China and Malaysia campuses. Includes: key links and documentation The University of Nottingham Qualifications Framework (UNQF) has been drafted to be fully compatible with the national framework in England, as well as the qualifications framework adopted at the Bergen Summit of the Bologna Process for the creation of a European Higher Education Area (EHEA). The Quality Assurance Agency (QAA) has independently confirmed that the FHEQ is compatible with the Framework for Qualifications of the European Higher Education Area (FQ EHEA). For more information, please consult the following: European Higher Education Area Quality Assurance Agency Links to important documentation: UK Quality Code for Higher Education How does the Bologna process work? Includes: first cycle qualifications; second cycle qualifications; third cycle qualifications The EHEA framework is divided into three cycles; below is an explanation of how University of Nottingham qualifications meet the requirements of each cycle. Honours degrees at the University of Nottingham are first cycle qualifications with outcomes that meet the relevant qualification descriptors of the UK Quality Assurance Agency and the EHEA. These degrees require a minimum of three years study full-time and are worth 180 ECTS credits. Honours degrees are awarded as various forms of Bachelor qualifications - Bachelor of Arts (BA), Bachelor of Science (BSc), Bachelor of Engineering (BEng) etc. There are three separate routes to second cycle qualifications at the University of Nottingham: (a) Taught Masters degrees at the University of Nottingham are second cycle qualifications with outcomes that meet the relevant qualification descriptors of the UK QAA and the EHEA. These degrees require a minimum of one year study full-time and are worth 90 or 120 ECTS credits. Taught Masters degrees are awarded as various forms of Master qualification - Master of Arts (MA), Master of Science (MSc), Master of Business Administration (MBA) etc. (b) Integrated Masters degrees at the University of Nottingham are second cycle qualifications with outcomes that meet the relevant qualification descriptors of the UK QAA and the EHEA. These degrees comprise a minimum of three years study full-time to complete a first cycle qualification, followed by a minimum of one year study full-time worth 60 or 90 ECTS credits to obtain the second cycle qualification. Integrated Masters degrees are awarded as various forms of Master qualification - Master in Engineering (MEng), Master in Science (MSci), Master of Pharmacy (MPharm) etc. (c) Research Masters degrees at the University of Nottingham are second cycle qualifications with outcomes that meet the relevant qualification descriptors of the UK QAA and the EHEA. These degrees comprise a minimum of one year study full-time and (if credit-bearing) are worth 90 ECTS credits. Research Masters degrees are awarded as various forms of Master qualification - Master of Philosophy (MPhil), Master of Research (MRes) etc. Doctoral degrees at the University of Nottingham are third cycle qualifications with outcomes that meet the relevant qualification descriptors of the UK QAA and the EHEA. These degrees comprise a minimum of three years study and (if credit-bearing) are worth 270 ECTS credits. Doctoral degrees are awarded as various forms of Doctoral qualification - Doctor of Philosophy (PhD), Doctor of Education (EdD), Doctor of Clinical Psychology (DClinPsy) etc. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}