{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-regs-higher-docs.aspx",
    "content": [
        {
            "p": "This page contains the regulations for Higher Doctorates. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 2. The following shall be eligible to make application for the Higher Doctorate degree: (a) persons in the eighth or any subsequent year after the date of graduation in this University; (b) persons who were awarded a degree of the University of London after having attended, as full-time or part-time students in the University of Nottingham, the University College of Nottingham or the Midland Agricultural College, the complete post-Intermediate course of study appropriate to such degree, in the eighth or any subsequent year after the date of graduation; (c) graduates of not less than seven years' standing of any approved university, who at the time of application have been full-time members of the staff of this University for not less than four years. 3. A candidate must make an initial application to Registry and Academic Affairs (RAA) to submit for the degree. 4. An initial application shall consist of the submission of: (a) a curriculum vitae; (b) a list of published works; (c) a submission title; (d) a statement of approximately 1,000 words; (e) a statement about joint authorship; (f) a statement describing any previous submission of the works for a degree of this or any other University; (g) the names of two referees who shall not be members of the University. 5. The appropriate Head of School or, exceptionally, the appropriate Faculty Pro-Vice-Chancellor (FPVC) will decide on the basis of the information described in 4 (a)-(g) above whether there is a prima facie case for the award of the degree. The award of the degree shall be based wholly or to a substantial extent on original work of distinction carried out independently by the candidate. 6. If the Head of School or FPVC decides that a prima facie case is so established, the candidate shall be invited to submit copies of the relevant published works for assessment (normally three copies are required). 7. The Head of School or FPVC is required to submit to RAA nominations for two main and one reserve External Assessors for approval on behalf of the Quality and Standards Committee (QSC). 8. If the Head of School or FPVC decides that a prima facie case has not been established or that the application is premature and should be rejected, this shall not prevent the candidate from applying on a further occasion at a later stage. 9. The works shall be submitted to two External Assessors. Exceptionally, the Quality and Standards Committee (QSC) shall invite the third Assessor to assess the submission. 10. QSC, after considering the reports of the Assessors, may recommend to the University that the degree be awarded. 11. If, after considering the reports of the Assessors, QSC decides not to recommend to the University that the degree be awarded, this shall not prevent the candidate from applying again to submit for the degree on one further occasion, which shall not be earlier than 2 years from the date of the first examination. The date of the first examination is the date on which QSC decided not to recommend that the degree be awarded. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}