{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2024.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2024. The University has reviewed and updated its contingency regulations, the purpose of which are to mitigate against risk to student classification and progression where University business has been significantly disrupted. Contingency Regulations Following approval of the Student Engagement and Attendance Policy by ESEC, the regulations governing Student Engagement and Attendance - UK Campus page has been rewritten to remove any duplication and to reference the new Policy document. Regulations governing attendance and engagement - UNUK There have been a handful of updates made to the EC Regulation in the Quality Manual in time for the next academic year Extenuating circumstances Updates to the Examination Paper Template and also an update to examination rubrics for dictionaries, calculators, multiple choice question papers and open book exams. School Examinations Officer role A change has been approved for coursework marking. Anonymous marking is now required where possible and appropriate Policy on marking and grading In the 2024/25 academic year, the academic appeals policy and procedure will be replaced by a single code of practice. This will apply to all students and staff at the UK campuses. UNNC and UNM will continue under the existing academic appeals policy and procedure until codes of practice for their respective campuses are available. Academic Appeals Code of Practice In the 2024/25 academic year, the student complaints policy and procedure will be replaced by a single code of practice. This will apply to all students and staff at the UK campuses. UNNC and UNM will continue under the existing student complaints policy and procedure until codes of practice for their respective campuses are available. Student Complaints Code of Practice The maximum time for return of feedback for the qualifying year (Year1) UNUK is being extended to 20 working days Feedback to students A simplification and clarification of School Assessment Responsibilities including the Exams Officer Role. The changes made are intended to ensure that the Assessment Responsibilities owned by Schools are more reflective. As part of ongoing work to improve the clarity of the Quality Manual, the landing page of the Quality Manual has been updated to provide an overview of and additional information about the purpose of the Quality Manual. Further information has also been added to the ‘Governance’ pages, with a separate section about how to request changes to the Quality Manual and about how to submit an exceptional case to the Quality and Standards Committee. Some items have been reorganised to better locate them. Quality Manual Landing Page The University’s Educational Enhancement and Assurance Review process has been reviewed and from the 24/25 academic year will be replaced by the Periodic Assurance and Continuous Enhancement Review (PACER). Details of the new process, supporting templates and timelines can be found here: Periodic Assurance and Continuous Enhancement Review The university’s current conflict of interest policy has been reviewed to ensure continued compliance with OfS and IfATE requirements of the University as an end point assessment organisation for integrated apprenticeship provision. Changes have been made to the scope of the regulation to ensure independence of the assessment from the programme team. Changes in format are also included to ensure compliance with the University Framework on polices Regulation on Conflict of Interest The revised process for the University of Nottingham Malaysia Campus sets out to provide further guidance and clarification on the conduct of SSFs and its associated processes applicable for Foundation, UG and PGT UNM Staff Student Fora The EPA process document has been refreshed for the 2024/25 academic year. Apprenticeship End Point Assessment Process Changes made following a review encompassing the following: Disabled students Teaching and timetabling arrangements for disabled students Examination arrangements for disabled students Pages have been reformatted to align with the new University Of Nottingham Policy and Management Framework. Additionally the following updates have been made: Programme and module design and approval The regulations on the retention of students assessed work have been reviewed and updated to reflect the guidance issues by the OFs on the retention of students assessed work Clarifications have been made to the PGT supervision expectations page to address UKVI regulatory requirements that were not captured in the previous regulations A new page has been created for the role of an 'Academic Guide' within the Personal Tutor pilot in the in the Schools of Psychology (UK & UNM) and Law Changes have been made to the High Performance Athlete regulations to both update it in terms of changes to the EC regulation, and to make the interaction with the visa and immigration rules clearer. Clarifications on the use of reassessment relating to ‘elements’ of assessment have been implemented within Undergraduate and Postgraduate Taught Assessment Regulations. New link for the pilot school students to follow to find the digital form. And a video to show them how to complete it. Minor updates have been made to regulations for MRes in Geography, to bring in line with main MRes Regulations. Updates made to the wording of the International Campuses quality assurance regulations. Guidance for staff wishing to submit for a research degree by submission of published works has been updated. The University has provided equivalent information and guidance relating to internal transfers for students studying at China and Malaysia campuses. This change was informed due to the omission of equivalent guidance for students studying outside of the UK campus. Addition of the requirement on Senior Tutors to annually survey all students in their school about the tutoring system. This is for ongoing QA, and enhancement work. Due to feedback indicating misunderstanding of the earlier update, the Policy on Academic Misconduct (2.1.2) has been updated to clarify use of translation and paraphrasing software can be permitted by schools or assessment guidance. Where appropriate and permitted by relevant Units/Schools, students’ can continue to use this to improve their writing. Students should check locally as to what is permitted. Changes have been made to the role of the PGR supervisor: Minor amendments to reasons that do not warrant an extension to the thesis pending period for postgraduate research students have been made. The role of the PGR supervisor has also been updated to add in that supervision occurs until submission of the thesis and during any subsequent period of corrections. The changes made to ‘Responsibilities of supervisors’ apply here too. The role of the PGR supervisor has been updated to add in that supervision occurs until submission of the thesis and during any subsequent period of corrections. The changes made to ‘Responsibilities of supervisors’ apply here too. This change is to limit new modules (and modules within new programmes) to restrict the length of in person exams to 1, 2 or 3 hours and of ‘at home’ exams to 1, 2, 3 or 24 hours. It is also intended that existing programmes/modules comply with these exam durations, unless there are necessary reasons why not (e.g. PSRB requirements). Change made to clarify the position regarding compulsory breaks in learning for apprentices. A new form has been introduced for this purpose. To clarify the scope of the SPSA role and make corrections to incorrect Professional Service names Corrections have been made to the Student Evaluation of Teaching / Student Evaluation of Modules pages of the quality manual to bring them in line with current practice. Clarification of the wording in the Quality Manual around the appointment for the role of Independent Assessor. The UoNO Extenuating circumstances regulation has been published. A revised version of the University's degree outcome statement has been published. The QSC procedure for cases outside of regulations has been updated to provide more clarity on roles and responsibilities. New online forms have been created to replace word documents for UG/PGT and PGR cases. The updated process and guidance on completing the forms will be communicated to Schools/Departments shortly. QSC membership has been extended to include a representative from the student wellbeing team and additional faculty representation from UNM and UMNC. Clarification that, due to local context, the MA in Education Research and Postgraduate Diploma in Education Research are not applicable to University of Nottingham Ningbo China (UNNC) for applying as a degree/award nor as a result of Viva examination. A change has been made to the format of Section 4 of the Extenuating Circumstances Regulations to make it easier to access. There has been no material change to the policy In the academic year 2023/24 the University of Nottingham Online introduced a set of regulations to support learners engage in credit-bearing micro-credentials, and to allow the University of Nottingham Online to verify the provision of external providers of Continuing Professional Development (CPD). Notes have been added to the Admissions, Personal tutoring, student support and development, Student engagement and representation and Registration, attendance and study pages to clarify that these sections do not apply to UoNO learners The Role and responsibilities of the internal assessor and Role and appointment of examiners for research degree programmes regulations have been amended to bring practice into line with sector norms, streamline process and improve student experience. New supplementary regulations for the Degree of Doctor of Clinical Psychology (DClinPsy) for 2021 and 2022 cohort, and for those joining the programme in 2023 have been added to the Quality Manual. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}