{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-responsibilities-of-school.aspx",
    "content": [
        {
            "p": "This page explains the role and responsibilities of all Schools as regards postgraduate research students, including supervision arrangements and monitoring progress. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Please be aware that during academic year 2020/21, the University introduced additional guidance in response to the Covid-19 pandemic. This page was previously affected by these arrangements and has been documented accordingly. Further details can be found in the \"Additional guidance in 2020/21 due to Covid-19\" section below. Includes: responsibilities The University intends that Academic Schools will provide a study environment which will facilitate the successful completion of research studies undertaken by students. These matters are the responsibility of the Head of School, or person with suitable designated authority, who is expected to action the following matters. Appoint, as necessary, a Safety Officer and a Safety Committee, and demand rigorous attention to all safety matters related to the student's research activity. The School should organise safety instruction for students as appropriate and may wish to appoint a Safety Adviser for special purposes. Such Advisers may be any member of staff suitably qualified for the purpose. Includes: responsibilities of the postgraduate student advisor Designate a full-time member of staff to act as an independent School Postgraduate Student Adviser (SPSA). For more information, please consult the following: Responsibilities of the Postgraduate Student Advisor Includes: expectations of supervisors; duration of supervision Ensure that prior to or, exceptionally, within 4 weeks of their initial registration, every research student is allocated a supervisory team, containing at least two supervisors who: Supervision should continue for the duration of the student's registered period of research. Ensure that a School Handbook is written and distributed for their School. This should supplement University documentation with information on special School facilities, services and local procedures, including information relevant to postgraduate study, such as research ethics and approval procedures, etc. Allocate Internal Assessors to research students specifically for the purpose of the Annual Reviews. Please be aware that the following guidance was developed and applied during academic year 2020/21 in response to the coronavirus pandemic. These additional responsibilities were specific to Heads of School, Supervisors and Directors of PGR Programmes and should be read in conjunction with all other content on this page: Responsibilities of the Head of School, Supervisor and Director of PGR Programme - Additional guidance for the 2020-21 academic year in response to Covid-19 This guidance appeared alongside the University's Exceptional Regulations that were developed and applied in response to the coronavirus pandemic. For more information about the Exceptional Regulations as a whole, please consult the following: Exceptional Regulations: Covid-19 - 2019/20 - 2020/21 Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}