{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2019.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2019. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. SUBMISSION BY PUBLICATION The Procedures for Assessment for Research Degree Programmes was updated to remove the text informing that QSC were required to approve Submission by Publication cases. Regulation 21 states that Publication by Submission is an available route for students and therefore QSC approval is not required. NORMALISATION PROCESS Section three of the Marking and Grading section was updated to provide clarity with regard to the Normalisation reporting process. STUDENT EVALUATION OF TEACHING (SET) AND STUDENT EVALUATION OF MODULE SURVEYS (SEM) POLICY Introduction of the Policy for the Collection and Use of Student Evaluation of Teaching and Student Evaluation of Module Surveys. REASSESSMENT REGULATIONS Regulations 15 and 20 (UG) were updated to provide clarity relating to the timing of second reassessments and circumstances in which Regulation 20 (undergraduate students) may not apply. MAXIMUM PERIOD FROM INITIAL REGISTRATION Updates were made to the policy to ensure appropriate consideration of a disabled student’s circumstances, or a student with carer responsibilities, in relation to maximum period from initial registration. ACADEMIC APPEALS POLICY The policy was updated to provide clarity of the Academic Appeals procedure and address Office of the Independent Adjudicator (OIA) Good Practice recommendations. Changes are summarised below: Academic Appeal Policy Section 4(c)* - revised wording to provide a clear time-frame for submission of an appeal. Section 5.1.ii - slight amendment to the wording of the grounds relating to prejudice and bias to emphasise the need for perceptions of prejudice and bias to be reasonable. Section 5.1.iv - rewording to align more closely with the wording in the Extenuating Circumstances procedure for the purposes of consistency. Section 5.2 (e) - an insertion to clarify ineligibility for appeal. PROGRAMME DESIGN, DEVELOPMENT AND APPROVAL Updates were made to Programme design, development and approval in response to feedback from the Inter Campus Working Group. Updates have been undertaken to re-define the three types of programme that exist within the institution. A clear definition of each is given and the variation/addition to the current programme approval process is outlined. ELECTRONICALLY SUBMITTED COURSEWORK Updates were made to Assessment Regulations, Penalties for late submission of assessed coursework and Feedback to Students relating to the submission of electronic coursework, particularly relating to submission deadlines and penalties for late submission. The updates reflect the revised management of electronic coursework procedures, approved by TLC. Key changes are summarised below: UG AND PGT REGULATIONS New pages were created for the current versions of UG and PGT regulations, that came into effect as of September 2019. These new regulations were made to ensure clarity and appropriate application of the regulations, in particular regulation 26b/24b, which was amended from September 2019. DEGREE CLASSIFICATION REGULATIONS Updates to Regulation 26b of the Undergraduate Course Regulations (and, correspondingly regulation 24b of the Regulations for Postgraduate Taught Courses) were approved by QSC to provide clarity and ensure consistency in how the regulation is applied. A reduction in the number of credits that can be discounted under 26b (UG) and 24b (PG) has been introduced to ensure that the regulation is only used for its intended purpose. The revised regulations applies to all students from September 2019. APPOINTMENT TO QSC Introduction of the Role Description and Appointment to QSC process. PGR POLICIES Introduction of the PGR Sick Leave Policy and PGR Maternity/Paternity/Adoption Leave Policy MID-SESSION AMENDMENT TO ACADEMIC APPEALS POLICY AND PROCEDURE A mid-session amendment was made to the information found in the ‘Triage by Case Handler’ section of the Academic Appeal policy and procedure. In response to feedback it was recognised that the information needed clarification and expansion to reflect custom and practice. UPDATE TO PROGRAMME DESIGN, DEVELOPMENT AND APPROVAL - DEGREE APPRENTICESHIP PROGRAMMES Minor updates were made to the Programme Design, Development and Approval policy to clarify the process for Degree Apprenticeship programmes. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}