{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pol-pgr-mat-pat-adoption-leave.aspx",
    "content": [
        {
            "p": "This page provides information on maternity, paternity and adoption leave arrangements for Postgraduate research students, including eligibility criteria, types of leave and returning to study. This may be of interest to staff and students from UK campuses only. Includes: Policy on support for pregnant students and students with very young children document 1.1 This policy relates to the payment of postgraduate research studentship maintenance stipends during periods of maternity leave, paternity/maternity support leave, shared parental leave and adoption leave and applies to eligible postgraduate research students listed in 2.1 of the section below. 1.2 This policy should be read in conjunction with the Policy on support for pregnant students and students with very young children. Students should also refer to the Voluntary Interruption of Study and Extension to Thesis pending Policies specified in the Quality Manual, which can be found here: Voluntary interruption of study Thesis pending period (including policy on extension) 2.1 Postgraduate research students in receipt of annual maintenance stipend funding from the following sources are eligible to receive stipend payments under this policy: a) Students who receive Research Council funded maintenance stipends; b) Students who receive University of Nottingham funded maintenance stipends. 2.2 Students are eligible: a) Whether registered on a full-time or part-time basis; b) From the point of initial registration on their programme; c) Where the first day of the period of leave falls within the funded period, or in the case of maternity leave where the expected date of delivery (EDD)* falls within the funded period, and for adoption leave where the date of adoption falls within the funded period; * Referred to as ‘expected week of confinement’ in the Maternity Certificate (MAT B1) issued by a doctor or midwife. d) To receive stipend payments under this policy on multiple occasions. 2.3 Students who are funded from external sources administered by the University of Nottingham, may be eligible for some or all of the above type of payment subject to their funders’ terms and conditions. 2.4 The following groups of students are not eligible for receipt of stipend payments under this policy: a) Self-funded students; b) Postgraduate research students who receive an externally funded stipend directly from an external organisation. Such students must follow the processes of their funder. If the funder does not provide additional funds, the University is not liable to provide any payments under this policy. As such students are advised to carefully check the terms and conditions attached to their funding prior to accepting that funding, and to refer back to those terms and conditions as necessary; c) Students in receipt of bursaries or awards covering tuition fees only; d) Students who have been in receipt of funding (as specified in 2.2 above), but who are, or will be, outside of their funding period at the point at which their period of leave would commence. 2.5 Students who fall into the categories in 2.4 above, and who have financial concerns about taking a period of maternity leave, paternity/maternity support leave, shared parental leave or adoption leave are advised to contact the Student Funding and Financial Support team or Students’ Union for advice and support. Please note in all maternity cases, students will have to interrupt their studies for 2 weeks post-birth. Includes: maternity and adoption; paternity/maternity support; shared parental 3.1 Maternity and adoption leave: Students are entitled to up to 52 weeks of maternity and adoption leave. a) The first 26 weeks will be paid at the student’s usual stipend rate;* b) The following 13 weeks will be paid at the Statutory Maternity Pay (SMP) rate as advised on the Gov.UK website at the start of the maternity leave; c) A further period of up to 13 weeks, which will be unpaid; d) The paid and unpaid periods of leave must be taken consecutively. 3.2 Paternity/maternity support leave: a) Students are entitled to up to 10 days of leave at the usual stipend rate.** These may be taken at any time during a partner's pregnancy or within three months following the birth; ** The full stipend rate is stipulated on the student’s offer or award letter, however, where a student has changed their registration status subsequent to this (e.g. changed from full-time to part-time registration) stipend payments under this policy will reflect the amount of stipend they were receiving in accordance with their registration status at the point at which an application for a period of interruption to cover a period of maternity, shared parental or adoption leave is made. Students should consult Student Services to check the arrangements for their individual award. b) Those entitled to this leave include the spouse, civil partner or partner of the person giving birth or primary adopter, who will share responsibility for the child’s upbringing. 3.3 Shared parental leave: Students are entitled to up to 50 weeks of Shared parental leave. (a) The first 24 weeks will be paid at the full stipend rate; (b) The following 13 weeks will be paid at 41% of the full stipend rate; (c) A further period of up to 13 weeks which will be unpaid. (d) Those entitled to share parental leave are the person giving birth to the baby/the primary adopter and their spouse, civil partner or partner, who will share responsibility for the child’s upbringing. These levels are commensurate with employee entitlements. Includes: reference to funding offer letter; conflict Students should refer to their funding offer letter and terms and conditions specified in it. Where there is a conflict between the eligibility criteria specified in this policy and the terms and conditions set out in a student’s offer or award letter, the terms and conditions set out in the offer or award letter take precedence, unless there is a clear conflict with the eligibility criteria specified in sections above, which would lead to a student being treated less advantageously than other students in receipt of comparable funding. Where offer and award letters do not make specific reference to eligibility (which may be the case in some instances for students who entered prior to the 2018/19 academic year) the criteria specified in this policy should determine whether a student is eligible for receipt of stipend payments under this policy. In any instance where a student’s eligibility is not clear, the relevant School’s Student Service Centre should be consulted in the first instance. Includes: maternity, shared parental and adoption; paternity/maternity support 5.1 Maternity, shared parental and adoption leave: A student must apply for a period of voluntary interruption to their study of the relevant length. This needs to have been approved in order for their maintenance funding and period of registered study to be extended commensurately. For more information, please consult the following: Postgraduate research maintenance stipend funding for approved periods of maternity, shared parental or adoption leave will be made to eligible students to cover the period of interruption for maternity, shared parental or adoption leave as specified in section 3 (Types of leave). Students may be required to supply evidence to support the request for stipend funding under this policy. Sources of evidence will normally be those set out under the equivalent staff procedure. Students may also be required to provide sufficient notice of their intention to take a period of interruption on these grounds. For example, to apply for shared parental leave a student must give notice at least 8 weeks prior to the period of interruption, and as such students should discuss their intentions with their supervisor as early as possible. 5.2 Paternity/maternity support leave: As the length for this leave is a maximum of 10 days, students will not normally be required to apply for a period of voluntary interruption of study, nor will their period of registered study and maintenance payments be automatically extended. However, if an extension to the expected submission date is required students may apply using the relevant policies. To be eligible for an extension in these circumstances a student must have disclosed their intention to take paternity/maternity support at the appropriate time. Students should note that every effort will be made to respect the confidential nature of any disclosure of information on these grounds. However, in order to manage financial arrangements with regard to stipend payments during a period of leave, the University may need to disclose to external funders that the student has notified the University of their intention of applying for a period of interruption, which would result in payment of maintenance stipends under this policy. Includes: students who receive stipend payments; exceptional circumstances; failure to return Students who receive stipend payments for periods of maternity, shared parental or adoption leave under this policy are expected to return to registered study. However, it is recognised that in exceptional circumstances this may not be possible, in which case there is a minimum requirement to provide a detailed handover of their work to their supervisors immediately following the period of leave. The University may reclaim all or part of the payment if the student fails to return to registered study or undertake such handover following the period of leave. Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/student-pregnancy-maternity-guidance-for-staff-and-students.pdf",
        "uk_pdf_files/student-pregnancy-maternity-guidance-for-staff-and-students.pdf"
    ]
}