{
    "url": "https://www.nottingham.ac.uk/qualitymanual/prog-and-mod-design-and-approval/mod-spec-guidance.aspx",
    "content": [
        {
            "p": "This page sets out the regulations on how to complete module specifications. This information is primarily directed at staff across all of the UK, China and Malaysia campuses, but may also be of interest to students. The University has endorsed seven principles for good curriculum design. Schools are asked to review the principles in the Curriculum design document as they design programmes. New Programme Design Principles Module levels are typically aligned with the corresponding stage of a student’s degree. There are five different levels of modules: Use ‘Content note’ to highlight potentially challenging material for student awareness. Please consult the following guidance for mote information about Content Notes: Content Notes Guidance Specify the number of credits. A single credit is notionally intended to represent 10 hours of student input, whether in the form of teaching contact or private study. Credits indicate a quantity of assessed learning and are gained by satisfying the Board of Examiners. The notional equivalent hours of study may not be directly applicable to University of Nottingham apprenticeship programmes where work-based learners have additional contextual opportunities to embed and test learning. Programme approval processes will ensure teaching approaches meet required outcomes for the learners on apprenticeships. If, exceptionally, the assessment of a postgraduate module is not carried out by the end of the semester in which the module is offered, the credits will not in theory accrue to the student until assessment is completed in the following semester. All new modules must have a credit value of 10, 20, 30, 40, 50 or 60 credits. For the MRes only, larger credit sizes of 80, 100, 120, 140 or 160 are permitted. Regulations around limits on the total number of modules of particular sizes must be applied when designing new modules. Any modules sizes outside of this range (including zero credit modules) or outside of the combination of modules permitted under the programme specification regulations are only permitted in exceptional circumstances (for instance where there is a PSRB requirement), and such modules require QSC approval. Schools requiring this must submit a QSC exceptional case request via the Curriculum Approvals and Advisory Team. Specify the number of students expected to enrol on the module in the following academic session. If there is a cap, please indicate this and provide a rationale for the cap (see below). Clearly explain the justification for imposing a limit on the numbers of students on the module Requisites should only be used where necessary to support student learning. Pre-requisites for admission to the module (if any) Co-requisites for the module (if any) Anti-requisites (if any) Clearly state the School offering the module and any contributing Schools, along with the percentage split. List the Schools and Faculties consulted during the proposal, including information on their support for their proposal. Provide a general statement explaining the purpose of the module, its benifits for students and its role in the broader subject context. It is expected that these will vary among the different modules contributing towards the same programme. Specify the knowledge and subject-specific skills which students are expected to aquire on completion of the module – for example, the aim of a module might be to teach computer-aided design skills, which would be different from the aim of a programme which might be to teach general IT skills. This is a free text field in the module specification which musts be used to provide a clear indication to students about who can/cannot take the module and if there are any restrictions, for example: Only available to Year 1 Undergraduate students on xxx degree programme. Not available to Exchange students. Information in this section will not prevent a student enrolling on a module and must be checked by the school prior to commencement of the module The Assessment Period indicates when formal assessment of the module concludes. It will typically align with the semester, but may vary in exceptional cases – for example, an autumn module may have a formal examination in the spring and therefore an Assessment Period of \"Assessed by the end of Spring Semester.\" Year-long modules which have summative assessment at the end of the academic year must also include a formative or summative assessment at the end of the Autumn Semester. For avoidance of doubt, the autumn assessment does not have to be the same format at the spring assessment. For example, summative 10% in autumn with summative 90% in spring; or formative (can be different format) in autumn with summative 100% in spring; or summative 60% autumn and summative 40% spring. Where schools allow mobility for one semester of a year-long module, a new module for one/both semester(s) (as applicable) will need to be created to enable this. Includes: module web links; learning outcomes; knowledge, skills and behaviours; module activities For further information please see the following: Programme Specification information Where the module in question is the dissertation, please indicate the minimum supervision arrangements. If appropriate, you would need to include a description of a range of different teaching methods.. Includes: module contact at the international campus Ensure that a named member of University staff is available for all module related queries. This individual, typically a permanent member of staff, must be easily accessible to students. In cases, where a module is delivered in both the UK and on an international campus, appoint a module contact at the international campus who will: You must describe each assessment element in detail, particularly the duration of examinations and the word-length of any essay, project or dissertation and if any element is non-compensable. A non-compensable module element is one which must be passed at the relevant level (40% for Honours degrees, 50% for masters' degrees, PG certificates and PG diplomas). Examinations, whether remote or in person, must be either 1, 2 or 3 hours in duration or, for 'take home' exams, these could also be 24 hours in duration. These durations are required (unless there is a specific reason for another duration, e.g. PSRB requirement) A student does have the opportunity to resit the module element for progression purposes (unless they are in their final year of study as an undergraduate), but they must achieve over the minimum level in one of their attempts to be awarded the credits associated with that module. The contribution of each assessment element to the overall module mark must be clearly specified (for example, one 1-hour examination (50%); one 1,500 word essay (50%)). In addition: It is an established principle of the University, that when registered for a University of Nottingham qualification all teaching and assessment must be in English. The only exception is where the subject of study is a language or literature other than English. Where a student must repeat their enrolment in order to be reassessed in a specific module this must be stated in the module specification. The form of reassessment of the module will be the same as the original assessment, unless stated to the contrary in this section. If the reassessment is different, it must consist of either a single examination or a single coursework assessment that replaces all the failed assessment components of the module for reassessment purposes. Where the different reassessment is an examination, then as above it must be either 1, 2 or 3 hours in duration or, for 'take home' exams, these could also be 24 hours in duration. These durations are required (unless there is a specific reason for another duration, e.g. PSRB requirement) There are many ways of making assessments more inclusive to recognise individual students’ challenges and situations. One approach is to introduce an element of flexibility. If there is more than one way of meeting the learning outcomes, students can be given a degree of choice over how they do this, noting bullet 7 in section 2.16 above (i.e. that either/or assessment options are not permitted where the assessment type and/ or element weightings are different). The choice can be constrained appropriately by the options offered and managed by schools locally. The details of any flexibility available must be clearly stated in the guidance given to all students about the assessment. It is also recommended that a record of the student’s choice regarding the version of an assessment that a student selected is kept at least until 2 months after the relevant exam board. If the student’s choice is obvious by the format or nature of the submission via Moodle, then simply retaining the submission box on Moodle would satisfy this recommendation. For more information about setting inclusive or flexible assessment please see these examples The University's Planning, Performance and Strategic Change Division (PPSC) compiles an annual student data return for the Higher Education Statistics Agency (HESA). As part of this process, HeCOS, or 'subject' data codes for all modules taken by our students must be provided. This data is used to: A HECoS code that is too vague or not reflective of a course content and relation to a broader subject group has the potential to have a profound impact. Please consult the following for more information about HECoS codes: Higher Education Classification of Subjects (HECoS) codes For more information about the University of Nottingham Qualification Framework, please see: For Programme specifcation guidance, please see the following: Programme specification guidance For more information about intercampus programme types, please see: For information about Degree apprenticeships, please consult the following SharePoint Degree apprenticeships For queries about the Higher Education Statistics Agency (HESA) return, please contact PPSC: Planning, performance and strategic change For more information about setting inclusive or flexible assessment, please see these examples: Inclusive or flexible assessment examples If you have any problems or queries relating to this page, please email: ss-curriculumadvice@nottingham.ac.uk If you have any problems or queries relating to this page, please email: ss-curriculumadvice@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}