{
    "url": "https://www.nottingham.ac.uk/qualitymanual/academic-regulations/reg-collection-and-use-of-sem.aspx",
    "content": [
        {
            "p": "This page contains the University's regulation for the collection, use and publication of Student Evaluation of Module (SEM) surveys. Its content applies to staff and students across all of the UK, China and Malaysia campuses. Includes: EVALUATE; modules taught by more than one teacher 1.1 Student Evaluation of Module (SEM) data must be collected using EVALUATE. The normal expectation will be that every module should be subject to SEM every academic year, but modules can be surveyed more than once when appropriate 1.2 Where a module is taught by more than one teacher the School should appoint one of the teaching team to collect the SEM evaluation. This will usually be the module convenor, the senior teacher or the team lead. Includes: opening and closing dates; provision of information; time; Blue Castle; EVALUATE; discussion of reports. Staff whose modules are being evaluated by SEM have certain responsibilities that they must fulfil with support from their School. These are: 2.1 Ensure that an appropriate date and time for opening and closing the EVALUATE survey is agreed with the team creating the SEM surveys (e.g. Registry and Academic Affairs / Faculty Academic Office, as appropriate) so as to maximise student participation. 2.2 Inform students at the appropriate time of the purpose of the survey and the period during which it will be live. 2.3 Ensure that students have time to complete the survey. 2.4 Display the information necessary to students to enable them to complete the survey. This is the Blue Castle address and the PIN if a non-standard survey is being used. 2.5 Consider using the Survey Monitor (in Blue Castle) to encourage participation. 2.6 Inform the team creating the SEM surveys (e.g. Registry and Academic Affairs / Faculty Academic Office, as appropriate) if a survey fails to run for any reason so that the survey can be re-opened. 2.7 Understand that there are no circumstances in which a student’s responses can be changed. The student can request that their responses are deleted by emailing the Evaluate team, but will not be able to complete that particular survey again. Includes: confidentiality; permission to publish scores 3.1 Members of University Executive Board (UEB) / Associate Pro-Vice Chancellors (APVC) (UNUK), the Management Board / Faculty Associate Dean for Education and Student Experience (UNNC), Faculty Associate Dean for Teaching Learning (UNM) will have access to all Faculty and all School SEM reports both for the current year and for all previous years. This will include the ability to view individual SEM reports (both scores and comments). 3.2 The Head of School has access to all reports within the School including scores and comments and the overall School report. 3.3 Other relevant Faculty and School-based staff who might have good reason to be given access to individual reports can be identified by the APVC/Head of School (UNUK) and the Faculty Associate Dean for Education and Student Experience (UNNC) or the Faculty Associate Dean for Teaching Learning (UNM). Levels of access may vary between Schools and Faculties but the following staff should be considered for access: Includes: scores, comments and responses; availability; feedback or module review template; location 4.1 A summary response to the most recent student feedback available, such as SEM surveys must be published by the School within a reasonable time frame. 4.2 Published scores must be available to students who have completed the module and to students who might be undertaking the module in the future. 4.3 SEM scores should be published within a feedback or module review template (one is available in Blue Castle) and the teacher/module convenor must provide a commentary in response to the scores and comments. This commentary must indicate any changes to the module that have arisen as a result of student feedback. 4.4 SEM scores must be published in a location which is available to all relevant students within a School or Department. For example, this might be on the School Content Management System (CMS) or via a ‘community’ page in Moodle. Includes: reporting abuse; University code of discipline; Student User Guide; disciplinary action 5.1 Abusive and personal comments are unacceptable and need to be removed from the EVALUATE system as quickly as possible. 5.2 Any individual receiving a comment that they identify as being abusive should report the abuse to a person agreed by the School, e.g. Head of School or Director of Education and Student Experience. The abusive comment should be reported by the agreed person to the EVALUATE team who will remove the student’s ratings and abusive comments. 5.3 In deciding whether a comment is abusive the agreed person should use common sense principles and if necessary refer to the University Code of Discipline and the Code of Practice for users of the University computing facilities. More information can be found here: 5.4 Students are informed of the seriousness of submitting abusive comments in the Student User Guide and it is recommended that Schools remind students of their responsibilities and indicate the seriousness of breaking the Discipline and Computing Facilities Codes. 5.5 In principle authors of offensive comments can be identified and disciplinary action could be taken if deemed necessary. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/regulations.pdf",
        "uk_pdf_files/evaluate-blucastle-student-guide.pdf"
    ]
}