{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/international-campuses-and-qa.aspx",
    "content": [
        {
            "p": "This page sets out the principles, responsibilities and guidance on particular areas surrounding quality assurance at the international campuses. This information is primarily directed at staff but may also be of interest to students across all of the UK, China and Malaysia. The policy framework for quality assurance in which academic schools have provision across multiple campuses is outlined below. Schools may have provision on one or more campus for which they have responsibility. The nature of the relationship and therefore responsibility will differ for UNM and UNNC but the principles will hold. The principle of the UK having the Degree Awarding Power means that in practice all provision on all campuses must be clearly owned by a single School (even where delivery may be joint and there is no single equivalent UK School). This ensures that the same protocols around awarding of degrees is maintained Where a UK School has delegated specific functions to a unit on an international campus, it should be clear that this unit forms part of that School or, at least, is performing those specific functions on behalf of that School.1 1This principle is of particular significance in those instances in which there is joint involvement by UK campus (UNUK) based Schools in relation to provision of a degree programme in either University of Nottingham Malaysia (UNM) or University of Nottingham Ningbo China (UNNC). Schools have all the responsibilities set out in the Quality Manual for their entire provision across all campuses. It is the responsibility of the individual School to determine the most appropriate approach to operating its quality assurance process within the context of the broad principles outlined in the Quality Manual. Where Quality Assurance responsibilities have been delegated to particular role holders or units on the international campuses, this should be formally documented and appropriate protocols put in place via the Statement of Responsibility. Schools may have multiple Statements of Responsibilities in order to facilitate differing arrangements for different programmes/ groups of programme. The Heads of School at each campus to which a Statement of Responsibilities applies should each sign-off a completed template. Schools may choose to give considerable autonomy to units on international campuses, but necessarily retain a responsibility to exercise a general monitoring function to ensure that the policies and procedures in the Quality Manual are being carried out appropriately. There is an annual process to confirm continued validity of Statements of Responsibility and an opportunity for any changes to be discussed and reflected in the documentation. Where the activities of the School have repercussions for the provision of other Schools on the international campuses, or for the overall management of the campuses, the relevant managers on the international campus (e.g. the Provost, Vice Provost or Dean) must be fully involved in decision-making and there should be joint agreement as to the actions taken. By the same token, decisions of the international campus management that have repercussions for the academic activities of other Schools should be arrived at jointly with those Schools. In regard to the above, and to the guidance section below, decisions made at an international campus can be regarded as having the agreement of Schools and of international campus management, so long as Schools have delegated the necessary authority to their staff on the campus. In cases where agreement cannot be arrived at between Schools and the international campus management, the matter should be referred to the University's Education and Student Experience Committee (in regard to matters of academic policy) or to the Pro-Vice Chancellor (PVC) for Global Engagement (in regard to strategic or operational matters). Professional Services have a responsibility for ensuring that University policies and procedures take account of the needs of all campuses and the implementation of them is supported on all campuses. This involves either direct or indirect responsibility for relevant professional services on the international campuses in co-operation with the senior management of the international campuses. Schools should agree entry criteria in discussion with UNM/UNNC management. Implementation of these admissions criteria is undertaken by the UNM/UNNC management with academic decision-making as necessary by relevant academic units. In all cases, Schools should submit business cases and programme specifications in consultation with UNM/UNNC management to Student Services/Registry and Academic Affairs (Curriculum Approvals and Advisory Team). The Provost and Vice-Provost for the relevant campus have the authority to sign off the business case, with approval for the programme specification resting with Quality and Standards Committee (QSC). The Vice-Provost, on the basis of advice and guidance from Student Services/Registry and Academic Affairs, will confirm that the proposed programme is aligned with the University of Nottingham Qualifications Framework (UNQF), the University’s study regulations and any other relevant Quality Manual provisions. If the programme deviates from these provisions in any regard, then approval is also required from the Pro-Vice Chancellor (PVC) Education and Student Experience. For more information about these areas, please consult the following: Quality and Standards Committee Academic regulations In the case of new programmes that are delivered jointly by the international campuses and the UK campus (UNUK) (e.g. 2+2 programmes), or are programmes currently delivered in the UK that will in future be delivered also at University of Nottingham Malaysia (UNM)/University of Nottingham Ningbo China (UNNC), the Business Case is considered by the Provost of the relevant campus, in addition to the standard process for new Programme Approval. Where a campus is proposing to run a programme which already exists on another campus, only the business case needs formal approval but the Programme Specification must be reviewed by QSC and the relevant campus to ensure that local delivery plans and the overarching programme specification are consistent. With respect to such ‘based on’ programmes, the new version of the programme will include the same learning outcomes and compulsory modules as the original version.2 2An existing Programme Specification might require revision to reflect variations in the number and range of optional subjects available which might include an increased number of compulsory modules at a campus with a more limited range of options available. There is also an expectation that the title of the new programme should be the same as the original version.3 3Whilst the expectation is that the new version of the programme will retain the same title as the original version, it is recognised that there may be circumstances where this is not possible, eg in order to meet to local regulatory or statutory requirements. The Partnership Relations and Projects team within External Relations should also be informed of any proposed new programme. For programmes approved for delivery on UNM, other than those subject to professional body accreditation, 'self-accreditation' (comprising QSC receiving information confirming the satisfactory operation of the programme on UNM) must be undertaken before the first cohort of students has completed the programme. For more information about programme approvals, please consult the following: Programme design, development and approval Schools submit module specifications in consultation with international campus management to Student Services/Registry and Academic Affairs (Curriculum Approvals and Advisory Team). Where a module (as defined by its title4 and learning outcomes) already exists on one of the campuses, no separate approval is required. 4Similarly, the expectation is that modules will retain the same title unless there are circumstances which mean this is not appropriate, e.g. local Professional, Statutory and Regulatory Bodies (PSRB) requirements. The content, delivery format and assessment of the same module may vary between campuses, so long as the learning outcomes remain constant. In sanctioning such module differences across the campuses, the consequences of such differences on the effectiveness of student transfer between campuses must be addressed. In those instances where approval of changes is required from beyond the School (the circumstances are set out in the relevant passages of the Quality Manual), the amended programme or module specification should be submitted by the School, in consultation with the international campus management, to Student Services/Registry and Academic Affairs (Curriculum Approvals and Advisory Team) for subsequent approval by the relevant committee. Campus reviews are a cyclical process, typically every 5/6 years and follow a similar process to the Quality Assurace Agency (QAA) Transnational Education review (TNE). Reviews of programmes delivered on international campuses form part of the Educational Enhancement and Assurance Review (EEAR) process. On an annual basis programmes at UNM/UNNC will contribute to the annual monitoring process. For more information, please consult the following: Educational Enhancement and Assurance Review Creation of assessments and the marking thereof can be fully delegated to staff on international campuses at the discretion of individual Schools. Some moderation and comparison of performance outcomes should normally be undertaken at module level. There should be a single Board of Examiners for programmes taught on more than one campus with representation (physical or via Microsoft Teams) from all campuses; again, comparison of student performance outcomes should normally be undertaken at both stage and degree award levels. A School's international campus staff should have the opportunity to be fully represented on School committees including at senior management level.5 5According to the circumstances of individual Schools this may range from formal video conferenced meetings, to virtual attendance via circulation of papers or regular one-to-one meetings with relevant colleagues. The key requirement is that there is an identifiable mechanism for representatives from the international campuses to engage with and be heard during School decision making processes. A School's approach to internal communications should ensure that the international campuses are fully informed of all developments and are involved in decision-making. While it is for the individual School to determine the most appropriate mechanism for this to occur, it may be worth noting that many Schools have found it helpful to identify a Director of Internationalisation who has specific responsibility in this area. Schools retain responsibility for staff appointed on the international campuses where the role is within a School and should have an agreed process for making such appointments.6 6Each School/ Department /Faculty’s positions on this should be set out in their Statement of Responsibilities Schools should ensure that their tutoring arrangements as set out in their tutoring statements are operating appropriately across all campuses on which they are represented.7 7Clarification of where responsibility for tutoring statements and tutoring arrangements lie should be outlined in a School/ Department/ Faculty’s Statement of Responsibilities (i.e. Head of School in the UK, Head of School at each campus etc). Schools should ensure that Staff and Student committtees (i.e Learning Community Forums or Staff Student Forums), Student Evaluation of Module (SEM) and any other related processes for securing School-level student feedback are operating on the international campuses and that proper consideration is given to feedback.8 8Clarification of where responsibility for Student Feedback in each School/ Department/ Faculty lies should be set out in their Statement of Responsibilities. Schools should consider student complaints and academic appeals in accordance with the principles of the associated policies and the relevant published procedures. Any local deviations from core procedures must be approved by QSC and accessible to relevant students. Schools have responsibility for ensuring that Quality Manual requirements are implemented for their research students on the international campuses.9 9Arrangements for responsibility of this implementation should be set out in each School/ Department/ Faculty’s Statement of Responsibilities. Schools and the international campus management should arrange jointly for a Disability Liaison Officer (DLO) to be available for all international campus students. For more information about the DLO role, please consult the following: Students with disabilities Schools, international campus management and the Careers and Employability Service have joint responsibility for ensuring that careers advice is delivered to international campus students in line with the Quality Manual.10 10Arrangements for responsibility of aspects of Careers Information, Advice and Guidance that fall to the School should be set out in the School/ Department/ Faculty’s Statement of Responsibilities. Given the use of different email domains in UNNC and UNM, Schools and Professional services should identify appropriate mechanisms to ensure that information flows between different locations in a timely fashion. Face-to-face meetings can be of particular value and, while noting the University’s carbon management plan, a limited number of annual visits (in both directions) would be considered desirable. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}