{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-docwhw.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Workplace Health and Wellbeing (DocWHW). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 2. A candidate for the degree of Professional Doctorate in Workplace Health and Wellbeing must have pursued at this University a part-time course of study comprising a taught component and a thesis. Inclusive of the time spent studying towards the MSc in Workplace Health and Wellbeing, completion of the Professional Doctorate in Workplace Health and Wellbeing programme requires a minimum of 4 years of part-time supervised study. 3. A candidate must have access to a relevant organisational setting in which to carry out their research. 4. Each candidate will have at least two academic supervisors. 5. The University's policies with regard to supervision and annual review of progress shall apply. 6. Submissions will be subject to the University regulations on submission timeframes in the University of Nottingham Qualifications Framework but in no less than a period of 4 years part-time from initial registration on the MSc in Workplace Health and Wellbeing. 7. The candidate shall submit a thesis of a maximum of 50,000 words for examination. The thesis should contain no fewer than two studies, considered by the external examiner to be worthy of submission to a peer-reviewed journal. At least one paper must have been submitted for publication to a peer-reviewed journal (with the primary supervisor’s consent) prior to thesis submission. 8. Candidates shall be examined in accordance with PhD regulations. Includes: failure to submit a thesis or a thesis deemed to be below standard 9. The degree of Professional Doctorate in Workplace Health and Wellbeing will be conferred on candidates who have satisfied the Examiners as to the standard of the thesis. 10. Candidates who fail to submit a thesis, or submit a thesis that is deemed by the examiners to be below doctoral standard will receive the MSc in Workplace Health and Wellbeing. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}