{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/pol-min-english-entry-requirements.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on the minimum English language requirements for entry to all award and non-award bearing studies. Its content is primarily aimed at prospective international students but may also be of interest to staff and current students across all of the UK, China and Malaysia campuses. This policy specifies minimum English language entry requirements for students applying to the University of Nottingham. Please note that these are minimum entry requirements and many subjects require higher entry qualifications. These requirements apply to students undertaking both award and non-award bearing studies at the University. Includes: requirements; GCSE level Home students are required to have an appropriate grade or score in an approved examination in English language before they can register on an academic programme. This is normally Grade C or 4 in GCSE English Language or equivalent. Please check individual course listings as some courses may have higher GCSE requirements. Includes: International English Language Testing System (IELTS); Home Office list of recognised countries; recognised and equivalent qualifications; English language equivalencies document EU and international students whose first language is not English are required to have an appropriate grade or score in an approved examination in English language (such as International English Language Testing System (IELTS)) before they can register on an academic programme. Students will also be deemed to have an acceptable English language qualification if they have either: In addition to the Home Office's list, we can also accept degrees from selected other English-speaking countries and institutions as evidence of English proficiency. For more information, please consult the following: UK Government website Policy on alternative English language qualifications IELTS website Centre for English Language Education (CELE) The following are the recognised primary English Language qualifications: A number of alternative language qualifications can also be accepted as B2 equivalent alternatives for NQF Level 6 (undergraduate degree level) study and above. For more information, please consult the following: Below are the grades or scores normally required for immediate entry on to academic programmes at the University. Grades or scores are valid for a maximum period of two years prior to the date of registration. Includes: Secure English Language Test (SELT); Tier 4 student visa requirements Please note that foundation course applicants requiring a Tier 4 student visa to study within the UK must provide evidence of a valid Secure English Language Test (SELT) as defined by the Home Office at the level of B1. This is due to visa regulations for non-degree-level programmes. If you intend to apply for your visa outside the UK, the only tests available as a SELT for University of Nottingham applicants are an 'IELTS for UKVI' test (UK Visas and Immigration) from an approved IELTS SELT Consortium test centre, or a 'Pearson Test of English (PTE) for UKVI'. If you apply within the UK you can take an IELTS for UKVI test or a Trinity College London SELT test. We do not accept LanguageCert for entry to our courses. The IELTS entry requirement for foundation programmes is: The PTE entry requirement for foundation programmes is: For full details of this policy including a list of approved test centres around the world and Trinity College London SELT test centres in the UK, please consult the following. Includes: Medicine; Nursing and Midwifery; Physiotherapy and Sports Rehabilitation; Veterinary Medicine and Science; other undergraduate and postgraduate programmes; English language bandings document or For more information about individual requirements, please consult the following: Online prospectus Admissions Office Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/english-language-equivalencies.pdf",
        "uk_pdf_files/english-language-equivalencies.pdf"
    ]
}