{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-regs-mres-presept19.aspx",
    "content": [
        {
            "p": "This page contains the regulations for the Degree of Master of Research (MRes) before September 2019. Its content is only applicable to students who commenced their studies before that date but may also be of interest to staff across all of the UK, China and Malaysia campuses. These regulations are applicable to students starting programmes in or after September 2018. For students commencing their programmes in or after September 2018. For students commencing their programmes before this date, the Master of Research Regulations (pre-September 2018) will apply. For more information about the previous regulations, please consult the following: Regulations for the Degree of Master of Research (MRes) before September 2018 1. Requirements for admission to a research degree are set out in the Academic entry requirements page, which can be found here: Academic entry requirements Includes: supervisors; criteria for a candidate for the degree of Masters of Research 2. Every candidate for the degree of Master of Research shall be allocated to a supervisor, or supervisors, by the University, on the recommendation of the Head of School. It shall be the general duty of the Head of School to ensure that adequate supervision is provided for all candidates during their period of directed study for the degree. This shall not detract from the duty of all supervisors to supervise adequately all students allocated to them. 3. The supervisor will normally be the person directly responsible for the project component of the course. In addition to supervision of the project the supervisor will also be required to direct the student as to the relevant taught component of the course. 4. A candidate for the degree of Master of Research must have pursued in this University a full- or part-time course of study comprising a programme of generic training, a research project and, as appropriate, an element of assessed taught modules. Includes: completion of generic training equivalent to 20 credits 5. This component requires the satisfactory completion of generic training equivalent to 20 credits. These credits can be accumulated from courses offered from within the Research Training Programme run by the Graduate School or other units offering generic training within the University, or from within any other generic training courses run within individual Schools. The generic courses will be selected in consultation with the supervisor(s) and should be cognate with the student's research topic. This element of the degree will not be assessed but candidates are required to attend at least 70% of the course(s). The selection of these modules is at the discretion of the student's School. Guidance on the appropriateness of the content of modules is available from the Graduate School. For more information, please consult the following: Graduate School 6. In addition to the generic training programme candidates are required to undertake assessed work to the equivalent of 160 credits. These credits can be obtained entirely from a research project in a subject within the scope of the School concerned. The candidate will be required to present a dissertation with a maximum length of 35,000 words (ie inclusive of appendices, footnotes, tables, and bibliography). The dissertation should embody the result of the candidate's advanced study and research. The dissertation must be presented within one year of the start of the course in the case of full-time study or up to four years in the case of part-time study. 7. A candidate may choose, with the agreement of the supervisor, to take up to 40 credits of taught modules. These must be selected from level 4 level modules (or, exceptionally, level 3) and must be clearly cognate with the student's research topic. In this instance the candidate will be required to take any relevant assessments associated with these modules. At the discretion of the School, when students take taught credits as part of their MRes degree, the word limit for the dissertation can be reduced. Includes: requirements for after period of directed study; curriculum catalogue page 9. A candidate for the degree of Master of Research shall be required after the period of directed study: (a) To demonstrate to the Examiners through attendance certificates that they have pursued an adequate generic training programme; (b) To undertake assessments, as specified in the Catalogue of Modules, for all taught modules for which they have registered; (c) To submit a dissertation of a maximum 35,000 words (or equivalent) displaying originality and technical understanding commensurate with the credit weighting of the dissertation; (d) To satisfy the Examiners regarding knowledge of the general field of scholarship to which the subject belongs; (e) If so required by the Examiners, to attend a viva voce examination held in the University on the subject of their dissertation and the general related field of scholarship. Includes: requirements; successful candidates; nottingham etheses service 10. Candidates may be awarded the degree of Master of Research (which can be a named route where schools indicate this to Student Services (Academic Processes) if they have: (a) Attended an adequate generic training programme, and (b) Obtained a pass mark in all taught modules excluding those making up the generic training element of the course. Exceptionally, and at the discretion of the Examiners, a fail mark in one or more of the taught modules may be compensated as long as the candidate has obtained an overall average in the taught modules taken of at least 50% and has no mark below 40%. (c) Produced a dissertation which satisfies the Examiners, and (d) If required by the Examiners attended a viva voce examination on the subject of their dissertation and satisfied the Examiners therein as well as in the dissertation presented. 11. Successful candidates will be eligible to graduate once their thesis has been uploaded to the University’s eTheses service and approved by the Internal Examiner or, in cases where there are two external examiners, the lead External Examiner. For more information, please consult the following: Nottingham eTheses 12. Where a student obtains a fail mark in a taught module that is not compensated, or fails the thesis module, the student has one further opportunity to pass those modules. All reassessments must be completed within one year of the end of the student's period of registered study. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}