{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-dass.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Applied Social Sciences (DASS), including admissions, thesis and awards information. However, please note that this programme is not currently running and its details will not be applicable to any staff or students. 1. A candidate for the degree of Doctor of Applied Social Science must: (a) Be a graduate of this or any other approved university holding a Bachelor's degree (normally first or second class Honours or equivalent) and normally holding a relevant Master's degree from this or any other approved university; or (b) Hold such other qualifications or research experience as may, on the recommendation of the University, be deemed by Senate to be equivalent to the qualifications referred to in (a). Candidates will normally be expected to have a minimum of two years' relevant practical experience. Includes: candidates who fail to satisfy examiners 3. The taught component requires the completion of 180 credits, including a research dissertation (60 credits) normally completed during the first year of the course (or two years if part-time). The taught component requires satisfactory completion of the following courses as part of a training programme in theory and research methods of applied social science: The dissertation on an approved topic will comprise a 10,000 word research report, executive summary and 3,000-5,000 word article (derived from the dissertation) for prospective publication in a practitioner or academic journal. It will be completed within one year of the start of the course in the case of full time study and within two years in the case of part time study. Candidates who fail to satisfy the Examiners in any of the above courses or the dissertation may be re-examined on such terms as the Senate, on the recommendation of the University, may decide. Candidates may normally be re-examined on one occasion only. Includes: submission; original application of knowledge in area of applied social science 4. Candidates are required to submit a thesis on an approved topic. The thesis will comprise a 50,000 word report, an executive summary, a 5-6,000 word literature review relating to the thesis topic a 7-8,000 word article (derived from the thesis) for prospective publication in an academic journal. The thesis should offer an original application of knowledge in the area of applied social science and should demonstrate the candidate's ability to integrate rigorous academic analysis with practical relevance and application. The thesis should be the result of the work done mainly while the candidate is registered for the degree. The candidate shall submit a certificate to this effect, countersigned by the candidate's supervisor, when presenting the thesis. The submission should also be accompanied by evidence that the taught programme has been satisfactorily completed. 6. A candidate for the degree of DASS whose thesis fails to satisfy the Examiners may, by permission of Senate on the recommendation of the Examiners and the University, be allowed to: (a) Make minor corrections to the thesis to the satisfaction of the internal (academic) Examiner; or (b) To represent the same thesis and attend a second viva voce examination; or (c) To represent the thesis in a revised form and take the whole examination; or (d) To represent the thesis without taking the whole examination. A candidate proceeding under this regulation shall normally be required to pursue a further course of directed study for a specified period that will not normally exceed one calendar year. Candidates who fail to satisfy the Examiners in one or more of the taught components or the dissertation may be re-examined. Candidates may normally by re-examined on one occasion only. Candidates who fail to satisfy the Examiners on one or more of the taught components or the dissertation will not be allowed to progress to thesis stage of the award. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}