{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-resources-and-facilities.aspx",
    "content": [
        {
            "p": "This page sets out the University's requirements in relation to the availability of study resources and facilities for Postgraduate research students. This information is relevant to staff and students across all of the UK, China and Malaysia campuses. Every research student should have reasonable access to the study facilities and equipment which are necessary to, and which will facilitate, the successful completion of their research studies. Prior to the commencement of a research degree, the School should establish that the essential resources and facilities will be available when the student begins their research. These resources and facilities may be offered either within the School or elsewhere within the University or (by agreement) in another institution or outside laboratory - and the student and supervisor shall have reasonable access to them. If in exceptional circumstances it becomes impossible to continue to provide these resources (for example, when a sponsor unexpectedly withdraws funding or equipment), the School should make reasonable efforts to identify alternative means of enabling the student to gain access to suitable facilities so that they may continue their studies at Nottingham. However, this may mean that in some circumstances it may be necessary to advise that the student carries on their research work in co-operation with another institution. Schools should ensure that a full-time research student (prior to entering the thesis pending period) should have an appropriate individual study space where the student can work and keep their books. Research students should also have reasonable access to the following. In some cases it may be possible to cover the costs from research grants relevant to the students' work: 5.1 Computing facilities: School or open-access University computing facilities. The opening hours of the University facility should be advertised in Schools and local arrangements concerning access to School facilities should be listed in the School Handbook. 5.2 Printing: Schools should offer a minimum of £50 p.a. to full-time research students and £25 p.a. to part-time research students to assist with the cost of draft printing for required reports. 5.3 Photocopying: Schools should offer a minimum of £50 p.a. to full-time research students and £25 p.a. to part-time research students to assist with photocopying costs. 5.4 Inter-library loans: Schools should offer a minimum of £50 p.a to full-time research students and £25 p.a. to part-time research students to assist with inter-library loans. 5.5 Telephones: Students should have access to a telephone which permits internal telephone calls and in-coming external calls. 5.6 Recreational area: where sufficient space has been provided to a School by the University, and where there is no suitable University or Students’ Union facility in the vicinity, the School should provide a recreational area. This need not be dedicated to research students but might be shared with other students and staff. 5.7 Other student services: The University will provide a range of other student services. For example, the Researcher Academy, the Accommodation Service, the Counselling Service, and the Centre for English Language Education. Researcher Academy Accommodation services The University Counselling Services Centre for English Language Education Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}