{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2015.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2015. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. Minor amendments have been made to the 'Normalisation' section of 'Marking and Grading' to provide greater clarification on the current policy, ahead of the conclusion of the work of the Marks Adjustment Working Group. ACADEMIC PROGRESSION AND AWARD REGULATIONS (APAR): Following work of the Academic Progression and Award Working Group, the University has amended some of the Undergraduate academic progression and award regulations, with effect from the 2015/16 academic year for students who are entering Qualifying year or Part I of their programmes from September 2015. These changes have been approved by relevant University Committees applying a set of principles relating to academic rigour, consistency and simplicity. Students on three year programmes entering Part II and students on four year programmes entering Part II or Part III in the 2015/16 academic year will not be disadvantaged by the changes being implemented. Parallel calculations will be run using the new standardised weightings (unless a PSRB exemption applies) and borderline algorithms and awards will be made using the better of the two outcomes. A number of policy areas have been subject to change, as follows: • Method by which degrees are classified • Standardisation of stage weightings for final degree mark • Standardisation of borderline algorithms • Changes to the Ordinary degree pathway • Progression Criteria for Integrated Masters Programmes • Proceeding Carrying Credits • Reassessments with or Without Attendance • Second reassessment opportunities For further information please see the APAR Homepage Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}