{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/academic-entry-requirements.aspx",
    "content": [
        {
            "p": "This page contains information on the basic admissions requirements for undergraduate, postgraduate taught and postgraduate research degrees. Its content is primarily aimed at prospective students but may also be of interest to staff based at the UK campus. Includes: location of criteria; School responsibilities The setting of entry criteria is the responsibility of the school to which the course is attached, within the overall policy requirements agreed by the University. Minimum entry criteria are published online in the Programme Specification document for each course, following approval from Quality and Standards Committee (QSC). The Admissions Office maintains a database of minimum entry requirements for all taught courses at undergraduate and postgraduate level, which includes both academic and non-academic criteria. The database is updated following consultation with school admissions staff prior to the start of each academic session. This information is then used in generic University publications, such as programme specification documents, online and hard copy University prospectuses, and UCAS publications. Includes: criteria; undergraduate; postgraduate taught; Recognition of Other Learning; research degrees The University minimum for entry is normally grades BBC at A-level or equivalent (BCC for foundation programmes) although most courses require higher grades for entry. Schools can insist on a particular level of performance in a subject at GCSE, A Level or other examinations, including English language qualifications. Where particular subjects will not be considered, these should be specified (for example, General Studies). When assessing an application for undergraduate study, admissions selectors will normally consider the following information on the UCAS form: When assessing an application for taught postgraduate study, admissions selectors should ensure that applicants hold a good first degree with at least second class honours, or an equivalent qualification. Evidence of relevant personal, professional and educational experience may also be taken into account. Where a school wishes to admit an applicant on the basis of significant relevant work experience in lieu of an appropriate academic qualification, it will need to make a case for exceptional entry to be considered on behalf of Quality and Standards Committee (QSC). More information on admissions requirements can be found here: Recognition of Other Learning In considering applications for admission to a research degree, a school will consider if the applicant would be able to achieve the standards required for the award of that degree. Normally, applicants will be required to possess a first degree with at least Class 2 Division I Honours, or an equivalent qualification for PhD or other doctoral degree, or at least Second Class Honours for entry onto an MPhil or other research master's degree (for example, MRes, or MA or MSc by Research) programme. Admissions Office Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}