{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-regs-mres-presept20.aspx",
    "content": [
        {
            "p": "This page contains the regulations for the Degree of Master of Research (MRes) before September 2020, including admissions, examination and award of degree information. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. These regulations are applicable to students starting programmes in or after September 2019. For students commencing their programmes before this date, the Master of Research Regulations (pre-September 2019) will apply. For more information about the previous regulations, please consult the following: Regulations for the Degree of Master of Research (MRes) before September 2019 1. Requirements for admission to a research degree are set out in the Academic entry requirements page, which can be found here: Academic entry requirements 3. Students are required to study modules worth 180 credits, of which 60 credits must be obtained from taught modules at Level 4 and from the Research Training Programme run by the Graduate School or other units offering generic training within the University, or from within any other generic training courses run within individual Schools. The remaining 120 credits must be obtained from a thesis module at Level 4. Any taught modules and research training taken must be clearly cognate with the student’s research topic. Supervision while undertaking the thesis module will be as set out in the module specification and in line with the requirements for supervision contained in the regulations for research degrees. 4. In cases where 60 credits of modules of the requisite level and subject matter are not available, supplementary regulations may stipulate a smaller number of taught/training credits and a thesis module of more than 120 credits (such that the overall number of credits remains at 180). In these circumstances, the maximum word length of the thesis may be greater than that stated in Regulation 6 (in the Assessment section) below and the compensation arrangements stated in Regulation 10 (in the Outcomes of examination section) below will not apply. Includes: module specifications; submitting thesis before end of registered study; viva voce examinations 6. The assessment of all modules is as set out in the specifications for those modules. In regard to the thesis module, the maximum word length of the thesis is 25,000 words. The maximum word limit is inclusive of appendices, footnotes, tables and bibliography. The Thesis should embody the result of the candidate’s advanced study and research. From September 2020 all students are subject to Regulation 6 from the September 2020 regulations, which can be found here: Regulations for the Degree of Master of Research (MRes) from September 2020 7. Students are required to submit their thesis prior to the end of the period of registered study. Two copies of the thesis should be submitted to Student Services or equivalent (in a form prescribed by the University), who will forward the thesis to the Examiners. The thesis should not, whether in the same or a different form, have been submitted to this or any other University for the award of any degree. 8. The thesis must be the result of the student’s own work. The requirement does not preclude a student obtaining limited assistance with proof-reading and with the routine collection and/or processing of data under guidelines and instructions clearly devised by the student. When such help is obtained it should be with the prior approval of the supervisor who must be satisfied that the spirit of the 'own work' requirement is not breached. 9. The thesis is examined by both an External Examiner and an Internal Examiner appointed under the regulations governing the assessment of research degrees, who should provide independent reports on the thesis, indicating whether the thesis module has been passed; and also whether a viva voce examination is necessary. Where a viva voce examination is required by the examiners, this should be conducted in line with the relevant regulations for MPhil degrees. For more information about the Viva voce examinations, please consult the following: Viva voce examinations Includes: award of degree; where a student obtains a fail mark or failed thesis or training credits; nottingham etheses service 10. The degree is awarded where all taught modules and training credits and the thesis module have been passed. The pass mark for all taught modules is 50%, but marks of 40%-49% can be compensated in up to 20 credits if the overall average for the taught modules taken is 50% or over. Training credits will be assessed on a pass/fail basis. 11. Where a student obtains a fail mark in a taught module that is not compensated, or fails the thesis module or training credits, the student has one further opportunity to pass those modules. All reassessments must be completed within one year of the end of the student's period of registered study. 12. The qualification awarded to the student will include the subject of study undertaken as notified to the student at the time of admission. 13. Successful candidates will be eligible to graduate once their thesis has been uploaded to the University’s eTheses service and approved by the Internal Examiner or, in cases where there are two external examiners, the lead External Examiner. For more information, please consult the following: Nottingham eTheses Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}