{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-induction-and-training.aspx",
    "content": [
        {
            "p": "This page sets out the induction and training processes for Postgraduate research students. It's content is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: training for registered students; role of supervisors All registered research students should receive appropriate training to enable them to undertake and present research effectively and efficiently. An induction programme, the timing and content of which reflects the diversity of needs of specific groups of research students (including part-time and newly arriving international students) should be delivered at the most appropriate levels (ie School or institutional level). Supervisors should ensure that new students will receive an induction programme appropriate to them. The training programme should take account of an individual’s needs and comprise subject-specific training as well as training which leads to the acquisition of relevant transferable skills and generic research skills. Includes: information to be provided The information to be provided as part of the induction programme should include: Includes: role of the Head of School; consideration of planning and timetabling It is the responsibility of Heads of Schools, in conjunction with supervisors and School Postgraduate Student Advisers (SPSAs), to identify the training needs for individual students, to ensure that these needs are met and to determine the means by which they are met. It is recognised that needs will vary according to the student’s registration status (MPhil or doctoral, full-time or part-time) and according to each individual student’s previous experience. The training needs of part-time students should be considered in planning and timetabling, and they should be encouraged to participate in suitable courses. For more information about the SPSAs, please consult the following: Responsibilities of the Postgraduate Student Advisor Includes: School requirements; responsibility of the School Students must satisfy the School’s requirements for research training. Failure to do so may result in the submission of an unsatisfactory annual report to the Head of School. It is the responsibility of a student’s School to provide subject-specific training by means of, for example, attendance at taught theory or practical courses (either undergraduate or postgraduate), seminars, colloquia, conferences, etc. Schools should decide and inform the student at the outset of the training whether or not the student’s knowledge will be formally assessed at the conclusion of any subject-specific training. Includes: provision by the Researcher Academy; researcher development framework; central short courses It is the responsibility of the Researcher Academy to provide training and development opportunities which span the needs of different disciplines. This provision will address the requirements identified by the Research Councils and Quality Assurance Agency (QAA) in the Researcher Development Framework. Normally the training and development training will not be formally assessed. Students can download certificates confirming their attendance at courses and workshops run by the Researcher Academy and other University training providers such as Health and Safety from the Central Short Courses website. The Researcher Academy will provide Schools with annual attendance information on students registered within the School. For more information about Central Short Courses, please consult the following: About Central Short Courses Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}