{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pgt-deg-sept21.aspx",
    "content": [
        {
            "p": "This page contains the degree classifications for all postgraduate taught students who began their awards from September 2021. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: commencement dates; former regulations These regulations take effect from 2021/22 for students who began their awards from September 2021. Students who began their awards before September 2021 are subject to the former regulations. For more information about the former regulations, please consult the following: Degree classification Includes: classification; postgraduate diplomas and certificates; borderlines The classification rules for Taught Masters, Postgraduate Diplomas and Postgraduate Certificates (that is, the award of Merits and Distinctions) are contained in the University’s Taught Postgraduate Regulations. The classifications are: Borderlines for these qualifications are: Includes: use of borderlines; extenuating circumstances; footnotes Following moderation an agreed algorithm is used to determine the final composite mark. If this falls within a borderline as defined above, the weighted profiling system as stated in the programme specification will be applied to determine the final classification (footnote 2). Students with acceptable extenuating circumstances should be considered in accordance with the extenuating circumstances policy and procedures. For more information, please consult the following: Policy on circumstances affecting students' ability to study and complete assessments 1. “Unit mark” is the mark awarded for an individual piece of assessed work, which goes towards the computation of a module mark using a weighting formula. 2. For students entering Taught Postgraduate programmes from 2021/22 onwards, Schools should use only the standardised weighted profiling system for determining the degree class of borderline students. A student should be given the higher classification if the following criterion is met: This does not preclude the consideration of Extenuating Circumstances of students, whether inside or outside the borderline. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}