{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-professional-doc-edd.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Education (EdD). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 1. A candidate for the Doctor of Education must (a) be a graduate of this or any other approved university holding either a bachelor's degree with first or upper second class honours (b) or such other qualifications as may be deemed by the University to be the equivalent of any qualifications referred to in (a) above. 2. Candidates will normally be expected to have a minimum of two years' relevant professional experience within a relevant field. 3. All candidates will be asked to provide examples of academic writing and will be interviewed. 5. The taught component requires the successful completion of 120 credits of modules (Part I), which should normally be completed by the end of the second year. The modules available will be listed in the School programme handbook. There is no compensation for modules on the Doctor of Education. 6. The University's Regulations for Taught Master's Degrees, Postgraduate Diploma and Postgraduate Certificate courses shall apply with regard to satisfactory progression on the taught element of the degree. More information on regulations can be found here: Postgraduate Taught study regulations 7. Candidates who successfully complete part or the whole of the taught programme and do not undertake the research component may be considered for the following awards: Postgraduate Certificate in Education Research (60 credits), Postgraduate Diploma in Education Research (120 credits). The award of MA in Education Research (180 credits) may be available to a student who transfers their registration and is successfully assessed on the formal submission of a 60 credit dissertation. These awards are in accordance with the application of the University's regulations for postgraduate taught courses as indicated in 6 above. 8. For progression to the Research Component, students will have passed all assignments in the taught component and will normally have achieved marks of at least 60% in a minimum of 3 of the modules. In cases where candidates have passed the taught component but not at this level, the Examiners may exercise their discretion in allowing progression to the research component. 9. The Research Component starts with compulsory attendance at the Summer School undertaken at the end of year two. 10. All candidates will go through a Confirmation of Research Status process. This will include a submission of a paper of 10-12,000 words and will involve a viva voce. 11. The thesis component requires candidates to undertake original research in an approved topic in a relevant field in education and normally complete a 50,000-60,000 word thesis or, if appropriate and agreed with supervisors, a thesis portfolio consisting of three linked pieces of research, each of 10–12,000 words, together with a 20-24,000 word overview and meta-analysis. Either a thesis or a thesis portfolio might include educational products (e.g. film, design research outputs, software) as part of the submission, this would be in addition to the requisite 50,000 words. The thesis/thesis portfolio will: 13. The degree of Doctor of Education will be conferred on candidates who have successfully completed the taught component of the programme and have satisfied the Examiners as to the standard of the thesis or portfolio. 14. The Examiners may recommend to the University the following outcomes of examination: 15. Where a thesis has been resubmitted and/or a second viva voce examination has occurred, the Examiners may recommend to the University the following outcomes of examination: 16. Candidates who successfully complete the whole of the taught programme but fail the thesis or thesis portfolio may be considered for the award of the Postgraduate Diploma in Education Research in line with the taught credits already achieved. Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}