{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pol-pgr-sick-leave.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on sick leave for Postgraduate research students, including eligibility, procedure and returning to study. Its content is only relevant to UK-based staff and students. Includes: payment of studentship maintenance stipends; corresponding regulations The policy relates to the payment of studentship maintenance stipends during periods of illness and applies to eligible full-time and part-time postgraduate research students listed in section 2 (Student eligibility criteria for receiving sick pay) below. This policy should be read in conjunction with the University’s Regulations Governing Attendance and Engagement, and policies on Circumstances affecting students' ability to study and complete assessments and Interruption of Studies. For more information, please consult the following: Regulations governing attendance and engagement Policy on circumstances affecting students' ability to study and complete assessments Voluntary interruption of study Includes: funding implications 2.1 Postgraduate research students in receipt of annual maintenance stipend funding from the following sources are eligible to receive stipend payments under this policy: a) Students who receive Research Council funded maintenance stipends; b) Students who receive University of Nottingham funded maintenance stipends. 2.2 Students are eligible: a) Whether registered on a full-time or part-time basis; b) From the point of initial registration on their programme; c) To receive stipend payments under this policy on multiple occasions subject to the terms below. 2.3 Students who are funded from external sources administered by the University of Nottingham, may be eligible for some or all of the above type of payment subject to their Funders’ terms and conditions. 2.4 The following groups of students are not eligible for receipt of stipend payments under this policy: a) Self-funded students; b) Postgraduate research students who receive an externally funded stipend directly from an external organisation. These students must follow the regulations of their funder. If the funder does not provide additional funds, the University is not liable to provide any payments under this policy. As such students are advised to carefully check the terms and conditions attached to their funding prior to accepting that funding, and to refer back to those terms and conditions as necessary; c) Students in receipt of bursaries or awards covering tuition fees only; d) Students who have been in receipt of funding (as specified in 2.1a and 2.1b above), but who are or will be outside of their funded period at the point at which their period of leave would commence. Includes: duration; retrospective requests for sick pay Eligible students may receive up to 13 weeks of paid sick leave at their normal stipend value from the first day of certified illness within any 12 month period subject to the following criteria: a) Students are not entitled to paid sick leave during the thesis pending period or any resubmission period; b) All cases of student sick leave will be considered individually on a case by case basis and any payment is subject to the approval of the relevant School, Faculty or Doctoral Training programme; c) In the case of short-term, self-limiting illnesses lasting less than four weeks (eg. colds, stomach upsets) stipend payments will continue to be paid. d) If the period of illness exceeds four weeks, the student will be required to formally interrupt their studies (see section 5 below). Any stipend payments already made to such students will be accounted for as sick pay from the date the student reported that their illness started, not the date any request for an interruption to study is made. Sick pay is unlikely to be considered if the absence due to illness is not reported at the time using the procedure in section 4c (Procedure for reporting sickness) below. e) Retrospective requests for sick pay will not normally be considered. Includes: notification of supervisor; durations; returning to study; calculating an absence period a) Any period of absence owing to illness, accident or injury should be reported by the student to the supervisor(s). b) For absence of 7 days or less, students are required to provide self-certification of their illness by completing the relevant form available from Student Service Centres, and must be submitted on the day of return to the University to the appropriate Student Service Centre. c) For absence greater than 7 days, students are required to have a medical certificate, available via their General Practitioner, covering any further periods of sickness in the same absence period. Students must complete the reverse side of the certificate before submission to the appropriate Student Service Centre. d) The student will not normally be permitted to return to their studies before the date specified by the doctor on the medical certificate. e) When calculating an absence period, note that weekends and public holidays are counted as days of absence. In line with existing University policies (referenced above in section 1): a) If the period of illness exceeds 4 weeks, the student will be required to formally interrupt their studies. b) If the absence is for a period of more than 2 weeks or any period considered to be significant by the School and notified to students, the School may require the student to suspend their studies and return at a specified time in the future that will enable the student to resume the programme appropriately (see paragraph 2.1.4 of the Regulations Governing Attendance and Engagement). c) The University normally permits postgraduate research students to interrupt their degree for a maximum period of 12 months in total throughout the duration of the degree. To apply for an interruption, please consult the following: d) Any application for an interruption of studies due to sickness is granted at the discretion of the appropriate School or Faculty and must be accompanied by a medical certificate or other acceptable evidence as defined in the relevant policies. Includes: whom to inform; postponed return; additional support consultations a) Students must keep their supervisor and appropriate School, Faculty and/or Student Service Centre informed of any changes in their circumstances that may result in them returning to their studies earlier or later than originally stated. b) Students who are interrupting and want to return to their studies later than originally stated must apply for an extension to their interruption and provide a new medical certificate. c) The Student Services Welfare Officer and/or the Disability Support Office should be consulted if additional support needs are required for students returning from long-term sick leave. Students may in certain circumstances be referred to Occupational Health before being allowed to return to study. Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}