{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-dforenpsy.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Forensic Psychology (DForenPsy). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 3. The taught component requires the successful completion of 60 credits of modules as specified in the DForenPsy course handbook and the equivalent of a 120-credit research dissertation, normally carried out during the first year of the course. Candidates wishing to exit the course at the Masters stage may be eligible for the MSc (by Research) in Forensic and Criminological Psychology subject to the University's Regulations for the Degree of Master of Arts by Research (MA by Research) and Master of Science by Research (MSc by Research) which also apply with regard to satisfactory progression on the taught element of this degree. The MSc (by Research) award is only available to candidates who exit the programme without completing the doctoral element. For more information, please consult the following: Regulations for the Degree of Master of Arts by Research (MA by Research) and Master of Science by Research (MSc by Research) before September 2018 5. Each candidate will have at least two academic supervisors, and one supervisor for each of the forensic placements who will be a HCPC registered Forensic Psychology Practitioner and act as a ‘Coordinating Supervisor’. The responsibility of the ‘Coordinating Supervisor’ is to help plan the placement experience and research work to ensure the student has adequate breadth and depth of study to fulfil the professional registration requirements and fitness to practise. 6. The University's policies with regard to supervision and annual review of progress shall apply. More information can be found here: Supervision Progression review of research students 7. Submission of the doctoral thesis and practice portfolio must be made within 4 years from initial registration for full-time students and accordingly the majority of candidates shall be entitled to a thesis pending period after completing 3 years of registered study. For part-time students submission must be made within 8 years from initial registration. Includes: submission of practice portfolio 8. The candidate shall submit for examination, a doctoral thesis of a maximum of 50,000 words, which shall comprise of four components: 9. The candidate shall also submit a practice portfolio which shall comprise of six components: Includes: candidates who do not undertake or fail research thesis or practice portfolio 11. The degree of DForenPsy will be conferred on candidates who have successfully completed the taught element of the programme and have satisfied the Examiners as to the standard of the doctoral thesis and practice portfolio. 12. Candidates who either do not undertake, or fail, the research thesis or practice portfolio, but successfully complete part or the whole of the taught programme, may be considered for the following awards: Postgraduate Certificate in Criminological Psychology (60 credits) or MSc (by Research) in Forensic and Criminological Psychology (180 credits) subject to MSc (by Research) regulations. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}