{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2021.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2021. POLICY ON ALTERNATIVE ENGLISH LANGUAGE QUALIFICATIONS The outdated English language guidance workspace links have been removed from the Policy on Alternative English language qualifications page HIGH PERFORMANCE ATHLETE ACADEMIC FLEXIBILITY The High performance athlete academic flexibility page has been introduced to the Quality Manual. This information appears under the Registration, attendance and study Personal tutoring, student support and development and Policy A-Z categories, as well as the Assessment and marking policies section of the Assessment awards and degree classification category. EXCEPTIONAL POLICY ON COVID-19 (LIMITED) REMOTE STUDY The Exceptional policy on Covid-19 (Limited) remote study page has been updated to reflect the latest version, valid from 3 December 2021 until 13 May 2022.This includes the combination of the \"Remote study\" and \"Interruption of studies\" sections into a single \"Options for long-term absence\" section. ONLINE SUBMISSION OF PGR THESIS The Role and appointment of examiners for research degree programmes page and the Submission information pack for PGRs document has been updated to reflect that a thesis should be submitted in an electronic version only. In some instances Schools will also require students to submit soft-bound copies of a thesis (in addition to an electronic version) – this will be communicated to students via the Schools. The School Examinations Officer Role page has been updated to include the revised documentation: ADMISSIONS The Policy on alternative English language qualifications and Policy on minimum English language entry requirements pages have been updated to reflect the University's admissions policies until September 2022. The Exceptional policy on Covid-19 (Limited) remote study page has been updated to reflect the latest version, valid from 10 November 2021. This includes the removal of the \"Reasons for agreeing to study remotely\" and \"late arrival sections.\" EXCEPTIONAL REGULATIONS: COVID-19 The Exceptional Regulations: Covid-19 content has been updated to reflect its status in academic year 2021/22, across all three campuses. This includes signposting and legacy content on all affected pages within the Quality Manual. RESEARCH DEGREE PROGRAMMES Research programme regulations has been restructured to include sections for: Regulations for Subject Specific Masters by Research degrees has been moved into the Regulations for programmes which are not currently running section LEARNING COMMUNITY FORUM (LCF) - UNUK ONLY The UNUK Learning Community Forum (LCF) page has been updated to introduce the following documentation: The updates also include information relating to the appointment of student co-chairs at LCFs (alongside a member of staff), the appointment of a secretary (who is a member of staff), and an outline of LCF membership to ensure the student voice is raised correctly. ACADEMIC MISCONDUCT POLICY From 2021/22 the academic misconduct policy has been updated in order to further align with the Office of the Independent Adjudicators (OIA's) Best Practice Framework for academic misconduct. Key changes include: DEGREE OF MASTER OF RESEARCH (MRES) From 2021/22 the regulations for the Degree of MRes have been updated to state that students are required to study modules worth 180 credits, of which between 20 and 60 credits (or equivalent) should normally be obtained from taught modules at Level 4 or from other units offering generic training within the University. From 2021/22 the UNQF has been updated in relation to a taught masters degree to reflect that for the research stage at least 60 credits of the course is devoted to a research project leading to a dissertation/comparable research output or the production of other output such as an artefact, business plan, performance or musical composition. These credits must be at level 4. MINIMUM TEACHING AND LEARNING ACTIVITY Following a review of the minimum expectations for levels of teaching and learning activity, revised guidance has been introduced in 2021/22. The revised levels below are now stated relating to a student following a typical programme of study (based upon modules comprising 120 credits per year and there being 22 teaching weeks in the year) with the minimum number of scheduled learning hours per 10 credits noted: Study hours on placement modules may be counted towards the above totals. MAXIMUM PERIOD OF REGISTRATION - POSTGRADUATE CERTIFICATE IN HIGHER EDUCATION (PGCHE) From 2021/22 the PGCHE has a sperate entry within the maximum period of registration table stating that the maximum period for full-time students should be 3 years and the maximum period for part-time students should be 4 years. FITNESS TO PRACTISE - BSC ACCOUNTANCY A fitness to practise procedure for BSc Accountancy has been implemented for 2021/22. PROGRAMME APPROVAL PROCESS - UNUK ONLY Following a review of the current programme approval process, a new process has been introduced for UNUK in 2021/22. MODERATION AND MARKS ADJUSTMENT Following a review of the current moderation and marks adjustment process, a new process has been introduced for 2021/22. Updates include: PGT BORDERLINES A new page was created for the current version of the PGT degree classifications, that came into effect as of September 2021. For Postgraduate Taught students commencing their programmes from September 2021 the following borderline criteria will apply: A student should be given the higher class if the following criteria is met: Note – there is no borderline between Pass (50) and Fail (49) on a Taught Masters programme. PGT REGULATIONS A new page was created for the current version of the PGT regulations, that came into effect as of September 2021. PGR STUDENTS STUDYING AWAY / IN OUTSIDE ORGANISATIONS From September 2021 all PGR students studying for more than 4 weeks away from a Nottingham site (either UK or overseas) or in outside organisations must inform Student Services about the arrangements for this, by completing the following document: DEGREE OUTCOMES STATEMENT Publication of the current Degree outcomes statement for the University of Nottingham. EXCEPTIONAL (Covid-19 specific) LIMITED REMOTE STUDY POLICY FOR ACADEMIC YEAR 2012/22 The University has reviewed and approved the Remote Study policy for academic year 2021/22, which will be implemented from 1 August 2021. In principle, students may be able to apply to study remotely next academic year, within certain criteria, which are explained clearly in the policy. Students and academic staff are encouraged to read this carefully before discussing and submitting an application. EXCEPTIONAL REGULATIONS The Exceptional Regulations pages for UNUK, UNM and UNNC were updated to indicate that for 2021/22 the regulations will not be actively applied to a student's period of study. SAFEGUARDING A link was created in Personal Tutoring to the Safeguarding Policy and to the Report and Support process. QUARANTINE POLICY To reflect the ongoing Government restrictions in terms of red, amber, green countries; a link to the Student Services Quarantine Policy was created from the Registration and Attendance page. PARTNERSHIPS AND PLACEMENTS Updates to the 'Marks and credit transfer for students on study abroad placements at educational institutions' section of the Partnerships and Placements page were made to standardise the process of credit and grade transfer from other institutions. The revisions provide new and updated information in relation to the following areas: BREXIT Updates to the 'Visa and Immigration' section were made to the following forms from January 2021 in light of Brexit: Introduction of Covid-19 extension to period of registered study exceptional regulations: PhD and MPhil (UNUK only). SUBMISSION INFORMATION PACK FOR PGRs A revised version of the Submission information pack for PGRs was created to reflect the update to the e-theses portal. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/fitness-to-practise-bsc-accountancy.pdf",
        "uk_pdf_files/covid-pgr-extensions-to-period-of-registered-study-exceptional-regulations-unuk.pdf"
    ]
}