{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/ug-deg-class-sept20.aspx",
    "content": [
        {
            "p": "This page contains the degree classifications for all undergraduate students who entered their Qualifying year or Part I* from September 2020. Its contents are only applicable to students who were admitted from that date but may also be of interest to staff across all of the UK, China and Malaysia campuses. Includes: commencement dates; former regulations These regulations take effect from 2020/21 for students entering Qualifying year or Part I* from September 2020. Other students are subject to the former regulations, except for Regulation 26 (b) which applies to all students from September 2020. For more information about the former regulations, please consult the following: Degree classification before September 2020 Standardised weightings between Parts apply unless an approved Professional Statutory or Regulatory Body (PSRB) or other exemption has been given and this is stated in the relevant programme specification(s). Includes: unit marks; modules marks; weightings; weighted numerical average; borderlines 1. Unit marks (see footnote 1 in the All awards section) are numeric. 2. Module mark is calculated from unit marks and rounded to a numeric integer 3. Module marks are weighted accordingly to the number of credits attached to the module - for example, a 20 credit module is weighted double compared to a 10 credit module. 4. The relative weightings of Part I/II/III marks are given in programme specifications. 5. A weighted numerical average is calculated using the weightings indicated in 3 and 4 above. 6. The weighted numerical average is rounded. For more information, please consult the following: Policy on marking and grading 7. Weighted numerical average is translated into degree classification according to Table 1. Pass * that is, an unclassified degree and therefore awarded without honours. 40%+ (which can include reassessment marks from Parts I/II/III) Only the following rounded marks will be regarded as “borderline”: Includes: classifications; borderlines; calculating an overall average Ordinary Degrees and Undergraduate and Graduate Certificates and Diplomas are classified using a weighted numerical average as defined above. The classifications are: Only the following rounded marks will be regarded as borderline: When calculating an overall average, in the case of Ordinary Degrees, classification is based on the best marks obtained from 100 credits at Part I and the best marks obtained from 100 credits at Part II. In the case of Undergraduate Diplomas the classification is based on the best marks obtained in 120 credits taken in stage 2 or 3 including at least 90 credits at level 2. Includes: use of borderlines; extenuating circumstances; footnotes Following moderation an agreed algorithm is used to determine the final composite mark. If this falls within a borderline as defined above, the weighted profiling system as stated in the programme specification will be applied to determine the final classification (see footnote 3 below) Students with acceptable extenuating circumstances should be considered in accordance with the Extenuating Circumstances Policy and Procedures. For more information, please consult the following: Extenuating circumstances procedure 1. “Unit mark” is the mark awarded for an individual piece of assessed work, which goes towards the computation of a module mark using a weighting formula. 2. For students registering on programmes from 2009/10 onwards, Schools should use only a weighted profiling system for determining the degree class of borderline students. The profiling system must be stated in the programme specification and made explicit and clear to students from the start of their studies through School Handbooks. 3. For students entering Qualifying year or Part I* from 2020/21 onwards, Schools should use only the standardised weighted profiling system for determining the degree class of borderline students. An undergraduate student should be given the higher class if either of the following criteria are met: i) Two thirds or more of the final stage credits are in the higher class; ii) Two thirds or more of the final and penultimate stage credits are in the higher class. This does not preclude the consideration of Extenuating Circumstances of students, whether inside or outside the borderline. If you have any problems or queries relating to this page, please contact: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}