{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/withdrawal-from-study.aspx",
    "content": [
        {
            "p": "This page provides regulations, processes and associated implications that apply when a student withdraws from their studies. This information is relevant to staff and students across all of the UK, China and Malaysia campuses. Please note that students in the UK on a Student Route visa are also affected by the University’s Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship Where a student no longer wishes to continue with their programme of study, they may withdraw from the University. To withdraw, the student must follow the procedure described in 3.0 Roles and Responsibilities. Students may be withdrawn from their programme of study and the University for a variety of reasons: The process for withdrawal in these circumstances can be found in the relevant sections of the Quality Manual. Withdrawal from the University will have financial implications in relation to, for example, funding to the University, fees due to the University, maintenance loans stipend or other funding that a student receives. Schools should always remind students of the need to consult their funding body, the Funding team and the Fees and Charges team (UK) and the Finance Office (Malaysia) before withdrawing from their programme of study. Students considering withdrawal are advised to discuss their circumstances with their Personal Tutor and/or Course Director (or in the case of PGR students, with their Supervisor), who will be able to help the student decide if a withdrawal is the appropriate course of action, before submitting their withdrawal form, which can be found below. The student is responsible for completing the forms as described below. When a student withdraws from their study, their registration and status with the University is cancelled and all relevant authorities (where known) will be informed. It is the student’s responsibility to ensure that any sponsor or legal requirements are complied with when withdrawing. For apprentices, the Professional and Work-based Learning team will oversee the funding and contractual process. Students who withdraw from study are advised to consult the Visa and Immigration Team for immigration advice before submitting their withdrawal form to the relevant Student Service Centre or equivalent office. Students must submit the relevent form from the list below to Student Services Funding and financial support Fees and payments Student Services Centre Help with your visa Student Services UG and PGT students: Academic-Service-Office@nottingham.edu.cn PGR students: GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/notification-of-withdrawal-form-unm.pdf",
        "uk_pdf_files/covid-ec-exceptional-regulations-unuk.pdf",
        "uk_pdf_files/notification-of-withdrawal-form-unm.pdf",
        "uk_pdf_files/covid-ec-exceptional-regulations-unuk.pdf"
    ]
}