{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2020.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2020. MRES REGULATIONS An update was made to the MRes regulations to provide clarity regarding the maximum word count of a thesis dependent on credit size. The revised regulation applies to all students from September 2020. MODULE EXCEPTIONAL AMENDMENT FORM A revised version of the Exceptional Amendment Form was created in relation to taught module enrolment and registering for additional credits. PROOFREADING POLICY Introduction of the University's policy on proofreading. SELF-CERTIFICATION POLICY Introduction of University's policy on self-certification ACADEMIC MISCONDUCT POLICY Updates were made to the academic misconduct policy to provide examples of 'proven intent' and to provide clarification that it is not the responsibility of invigilators to search for and remove unauthorised materials. A new page was created for the current version of the MRes regulations, that came into effect as of September 2020. The new regulations were created to reflect that 60 credits should normally be obtained from taught modules, however when 60 credits are not available, or if the School does not consider them appropriate for a research degree, supplementary regulations may stipulate a smaller number of taught credits. VOLUNTARY INTERRUPTION OF STUDY An update was made to the voluntary interruption of study policy to bring it in line with the University's fitness to study policy with regards to return to study. UNDERGRADUATE STUDY REGULATIONS FROM SEPTEMBER 2020 A page was created for the new Undergraduate Study Regulations that came into effect as of September 2020. The new regulations reflect a decision to remove the '8' in the borderline for Undergraduate regulations. These new regulations apply to all students who entered their qualifying year or Part 1 from September 2020. EXCEPTIONAL REGULATIONS FROM SEPTEMBER 2020 For the academic year 2020/21, only the following exceptional regulations in response to the Covid-19 pandemic are to be actively applied to a student’s period of study: Outcomes from the application of all other exceptional regulations during the 2019/20 academic year, will be honoured, and used in all future decision making, they can be viewed here. PGR SUPERVISION An amendment to the Appointment of supervisors and Responsibilities of the supervisor policies to reflect the introduction of the role of assistant supervisor to the PGR supervisory team. FOUNDATION REGULATIONS: UNM Introduction of the academic regulations for the UNM Foundation Programme. DEGREE OUTCOMES STATEMENT Publication of the current Degree outcomes statement for the University of Nottingham. INAPPROPRIATE APPLICANT BEHAVIOUR POLICY Introduction of the Policy on inappropriate applicant behaviour. EXCEPTIONAL REGULATIONS: Covid-19 As part of the University's response to the coronavirus pandemic, a number of exceptional regulations were introduced to ensure that teaching and learning continued throughout this period. CHANGES TO PROGRAMME SPECIFICATIONS An amendment to the Policy for Approval of Changes to Programme Specifications was made to inform that students and applicants should be informed of changes to programme specifications which have a direct effect on their studies \"at the earliest opportunity\", as recommended by the Office of the Independent Adjudicator for Higher Education (OIA). A revised version of the Request to interrupt study form for UNM (taught and research students) was created in relation to the Voluntary Interruption of Study policy. RECORDING OF CREDITS AND MARKS A revised version of the Credit Transfer Form was created in relation to the Partnerships and placements policy. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/academic-regulations-for-foundation-unm.pdf",
        "uk_pdf_files/request-to-interrupt-taught-and-research-studies-form-unm.pdf",
        "uk_pdf_files/credit-transfer-form.pdf"
    ]
}