{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2004.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2004. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. 26 November The University has established a University of Nottingham Qualifications Framework (UNQF) to demonstrate that our awards fit in with the QAA Framework for Higher Education Qualifications. This has been added to the Quality Assurance Structures section of the Quality. 12 November Guidance on the Invigilation of University Exams has been added to the Assessment section of the Quality Manual. The guidance clarifies the responsibilities of Schools in providing invigilators and clarifies who can act as an invigilator. 12 November A Framework for Professional Doctorates has been added to the Quality Assurance Structures section of the Quality Manual. The Framework outlines a general qualifications descriptor for the Professional Doctorates and provides guidance for Schools seeking to write regulations for specific Professional Doctorates. 12 November The Assessment and Progression section of the Quality Manual has been divided into two sections: an Assessment section, and an Attendance and Progression section. 2 November The 'Voluntary Suspensions of Registration' guidance has been revised, and downloadable forms which should be completed by students wishing to suspend registration (both taught and research students) have been added to the Attendance section of the Quality Manual. 2 November The 'Annual Review form for Research Students' has been revised, and a new 'Annual Review form for year three Research Students' as been added to Research Student Progress and Monitoring page of the Research Students section of the Quality Manual. 1 November The 'Protocol for granting staff members access to view marks in SATURN', has been added to the Assessment section of the Quality Manual. 1 November The 'Extenuating circumstance procedures and guidance', has been revised in the Assessment section of the Quality Manual. Section 4 now provides greater guidance on the standard of evidence that would be expected to enable the University to verify claims for extenuating circumstances. 30 July The 'Academic Offences Policy and Procedures', has been added to the Complaints and Appeals section of the Quality Manual. This is a single policy and procedure document which replaces the Academic Offence Regulations and Academic Offences Committee procedures. 30 July A 'Code of Practice on Admissions and Recruitment ', has been added to the Quality Manual. It supersedes the previous Admissions and Recruitment section and provides guidance on admissions & recruitment policy and procedure for staff and students. 2 July The 'Code of Practice on Placement Learning ', within the Placement Learning section, has been revised to provide greater guidance to Schools and to students. It outlines the minimum requirements that University expects should be met by Schools. 2 July The 'Policy on Occasional Teachers ' has been added to the Staff Development section of the Quality Manual. This extends the Quality Manual provisions in relation to postgraduate student teachers to include other individuals engaged in teaching who are not academic members of staff of the University. 29 April The 'Student Complaints Policy and Procedure ' has been updated within the Complaints and Appeals section of the Quality Manual 14 April The 'Voluntary Suspensions of Registration' document has been updated within the Assessment & Progression section of the Quality Manual 5 April A revised Academic Appeals Policy and Procedure has been added to the Complaints and Appeals section of the Quality Manual. This is a single policy and procedure document which replaces several previous documents. This includes a revised appeal form. 15 March A updated version of the ' Annual Report of External Examiner for a Taught Course ' has been added to the External Examiners section of the Quality Manual. The following two documents have been updated and now both include procedure and guidance notes: Extenuating Circumstances Form for Examinations/Assessed Coursework and Explanation for Absence from an Examination/Assessment 11 March Guidance on appropriate quantity of assessment has been updated in the 'Module Specification Template Guidance' (section 17). This can be found within the Taught Programmes section of the Quality Manual 8 March A new document ' Legibility of work submitted for assessment' has now been added to the Assessment and Progression section of the Quality Manual. 3 March The Taught Courses Review Policy has now been updated and a new Course Review Report Template has been added within the Taught Courses section of the Quality Manual. 19 February The flow chart detailing the procedure for the introduction of a collaborative course has been updated and an additional flow chart detailing the process to receive approval for the renewal of an existing course offered in collaboration with the University of Nottingham has been added to the Collaborative Provision section of the Quality Manual. 5 February The Minimum English Language Entry Requirements which was added to the Admissions section within the Quality Manual in October has now been updated. 2 February The ' notes for invigilators of University Examinations ' document has been updated within the Assessment & Progression section of the Quality Manual. 8 January The Module Specifications document has been updated within the Taught Programmes section of the Quality Manual. 7 January A new document ' Attendance Procedures ' has been added to the Assessment and Progression section within the Quality Manual. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}