{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-regs-maresearch-presept18.aspx",
    "content": [
        {
            "p": "This page contains the regulations for the Degree of Master of Arts by Research (MA by Research) and the Degree of Master of Science by Research (MSc by Research before September 2019. Its content is only applicable to students who commenced their studies before that date. 1. Requirements for admission to a research degree are set out on the Admissions page, which can be found here: Admissions Includes: framework; module requirements 2. Periods of registration for these degrees and supervision requirements are as set out in the University of Nottingham Qualifications Framework (UNQF), which can be found here: 3. Students are required to study modules worth 180 credits, of which a maximum of 60 credits may be obtained from taught modules at Level 4. The remaining credits (between 120 and 180) must be obtained from a thesis module at Level 4. Includes: module specifications; thesis requirements 4. The assessment of all modules are as set out in the specifications for those modules. In regard to the thesis module, the maximum word length of the thesis is as follows: The maximum word limits are all inclusive of appendices, footnotes, tables and bibliography. 5. Students are required to submit their thesis prior to the end of the period of registered study. Two copies of the thesis should be submitted to a Student Service Centre or equivalent (in a form prescribed by the University), which will forward the thesis to the Examiners. The thesis should not, whether in the same or a different form, have been submitted to this or any other University for the award of any degree. 6. The thesis must be the result of the student’s own work. The requirement does not preclude a student obtaining limited assistance with proof-reading and with the routine collection and/or processing of data under guidelines and instructions clearly devised by the student. When such help is obtained it should be with the prior approval of the supervisor who must be satisfied that the spirit of the 'own work' requirement is not breached. 7. The thesis is examined by both an External Examiner and an Internal Examiner who should provide independent reports on the thesis, indicating whether the thesis module has been passed and whether the thesis demonstrates exceptional performance; and also whether a viva voce examination is necessary. Where a viva voce examination is required, this should be conducted in line with the relevant regulations for MPhil degrees. Includes: distinction; merit; where a student obtains a fail mark or fails thesis; nottingham etheses service 8. The degree is awarded where all taught modules (if any taken) and the thesis module have been passed. The pass mark for the taught modules is 50%, but marks of 40%-49% can be compensated at the discretion of the student's School if the overall average for the taught modules is 50% or over. 9. The degree is awarded with distinction if: (a) The overall average for the taught modules (if any are taken) is 70% or over, and (b) The Examiners state that the thesis demonstrates exceptional performance. 10. The degree is awarded with merit if: (a) The overall average for the taught modules (if any are taken) is 60% or over, and (b) The Examiners state that the thesis demonstrates a high level of performance. 11. Where a student obtains a fail mark in a taught module that is not compensated, or fails the thesis module, the student has one further opportunity to pass those modules. A student undertaking reassessment cannot be awarded the degree with distinction. All reassessments must be completed within one year of the end of the student's period of registered study. 12. The qualification awarded to the student will include the subject of study undertaken as notified to the student at the time of admission. 13. Successful candidates will be eligible to graduate once their thesis has been uploaded to the University’s eTheses service and approved by the Internal Examiner or, in cases where there are two external examiners, the lead External Examiner. Nottingham eTheses service Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}