{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-responsibilities-of-supervisor.aspx",
    "content": [
        {
            "p": "This page contains detailed information about the role and responsibilities of a postgraduate supervisor, including research planning and thesis requirements. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Note: In addition to the responsibilities detailed in this section, Postgraduate Student Advisors should also see the additional Covid-19 related responsibilities for Heads of Schools, PGR Directors and Supervisors for 2020-21. For more information, please consult the following: Responsibilities of the Head of School, Supervisor and Director of PGR Programme - Additional guidance for the 2020-21 academic year in response to Covid-19 Supervisors will provide guidance and assistance to PGRs so that they may carry out their research and present their results to the best advantage. Every supervisor and every PGR will be provided with guidance on their respective roles and responsibilities. The general role of supervisors is to guide and assist PGRs until submission of their thesis and any subsequent period of corrections, until such a point that examiners have reached a final decision on the award of the degree. The roles of supervisor and examiner are quite distinct, and it is not one of the roles of the supervisor to assess the thesis. The specific roles of supervisors may differ depending on the academic discipline, Departmental practice and whether the member of staff is acting as lead, second, assistant, temporary or permanent supervisor. The lead supervisor (or delegate) will also consider requests for annual leave in line with School/Departmental policy. Many postdoctoral research staff, level 4 Research Officers and research technicians make valuable contributions towards the supervision of the University’s PGRs. The formal appointment of such staff as assistant supervisors as part of a supervisory team is intended to recognise and acknowledge this contribution and to identify the roles and responsibilities of assistant supervisors in order that this is clear to the candidate and all members of the supervisory team. Assistant supervisors are responsible for: All supervisors must undertake continuing professional development, so that their work as a supervisor is supported. Supervisors should take the initiative in updating their knowledge and skills by participating in a range of appropriate activities and sharing good practice. More information on support for research supervisors can be found here: Researcher Academy Includes: responsibilities At the outset the supervisor should check that the candidate has received information sent by the University concerning registration and that they have registered for that session. Before or at initial registration or, at the latest within 4 weeks of initial registration, supervisors should check that all their PGRs have received copies of essential documentation relevant to their research studies or have been informed about where to locate them on the web. As a minimum, this should include: information about registration and services, the School Handbook, and any relevant safety advice. For more information about registration, please consult the following: Student Services - registration Includes: assistance; designing a programme of research; for full-time doctoral students Supervisors will assist their PGRs to plan their research studies, including helping them to define their research topic; to identify schemes and specific tasks; to identify the relevant research literature, databases and other relevant sources, and to be aware of the standards in the discipline. The supervisor and candidate should design a programme of research in which (subject to research progress and taking into account special cases) all or much of the thesis will have been written up by the candidate by the end of their period of registered study. The design of the programme of research should not at the outset plan to include any period of thesis pending that the candidate is entitled to. For full-time doctoral candidates on a 3 year programme, it is expected that the completion of the entire doctoral examination process is completed within 4 years. The PGR may need to register for some taught modules or attend research training courses. The supervisor will advise them how to do this. Includes: understanding and knowledge; responsibilities Supervisors should have a reasonable knowledge and understanding of the University's regulations governing research study and the University, Faculty and Departmental procedures governing research study and supervision. They are required to advise their PGRs on these regulations and procedures or, if they feel a question is outside their knowledge, to direct their PGR to other sources such as Student Services (or Central Administration at UNM and the Graduate School at UNNC). Supervisors also have a responsibility to ensure that other members of the supervisory team are kept informed of the candidate’s progress, and any issues which may be having an impact on their programme. Includes: responsibilities; review of PGR needs Supervisors should have a reasonable knowledge of and be able to advise their PGRs on the availability of the University's academic services and facilities (for example library and computing facilities) and how to make use of them. The supervisors in conjunction with the PGR should keep under review the facilities which are required in order to carry out the research and make these needs known to the Head of School. Includes: responsibility to provide appropriate and regular supervision; requirements for part-time PGRs Supervisors are responsible for providing appropriate and regular supervision for their PGRs until submission of their thesis and any subsequent period of corrections, until such a point that examiners have reached a final decision on the award of the degree. They are also responsible for being accessible at mutually convenient times to listen and offer advice. Students and supervisors are jointly responsible for arranging the supervision meetings. Supervisors must provide their part-time candidates with a minimum of 6 recorded supervisions a year and their full-time candidates with a minimum of 12 recorded supervisions a year. These supervisory meetings must be at least monthly for full time candidates and two-monthly for part time candidates. This is based on calendar months. Note, it is expected that in many cases the actual number of meetings between supervisors and candidates may exceed these minima. If it is not possible for a meeting to take place as scheduled, the meeting should be re-arranged for the next available opportunity. If no meetings are possible in any given month (or two months for part time students), the supervisor is responsible to ensure that the reason for the missed meeting is recorded appropriately. These reports should be regularly monitored by the School. University staff will review the missed meeting reports on a case by case basis, particularly for PGRs are at risk of breaching visa and immigration requirements, to see if any additional support is required. These requirements may also be modified under the rules for supervising students working off-site. For students who are missing meetings, or who are not meeting the meeting minima requirements, the regulations governing attendance and engagement should be reviewed: UNUK regulations governing attendance and engagement UNNC and UNM regulations governing attendance and engagement Includes: definition; purpose A 'supervision meeting' is considered to be a any simultaneous contact between the supervisor(s) and PGR candidate for an academic purpose. It is important that at the supervision meetings the PGR’s progress to date and/or the future direction of their research or thesis writing is discussed. It is also necessary that these discussions must be summarised in writing so that they are available if required, for example for audit purposes, or to aid student wellbeing or support. These written reports must meet the minimum number requirements as detailed earlier. There is no specified format for these meetings. For example, a daily chat at the lab bench and/or a pre-scheduled sit down meeting would meet these criteria, as long as a monthly report with a progress overview is still submitted. Group meetings of PGRs and/or seminars would be acceptable as long as the PGR’s progress to date and/or the future direction of their research or thesis writing is discussed. A supervision meeting should typically take place as a face-to-face meeting, but can also include meetings conducted online, such as on Microsoft Teams. The exception to this is where the PGR is in the UK on a student visa, unless the student has been given formal permission to study at a different location, supervision meetings must be face-to-face and on campus. Includes: reporting needs; annual review of PGRs In order that proper audit of supervision provision can be carried out, so that supervisors may undertake continuous monitoring of their PGR’s progress, and records of this progress monitoring are available for formal Progression Review, supervisors are required to ensure the maintenance of a supervision record of at least the minimum number and frequency of supervision meetings a year (see Section 9 above). Supervisors should advise their PGRs on the procedures for monitoring their progress which are described in the section of this Quality Manual entitled Progression Review of research students. These include: (i) Supervision Records - attendance at supervision sessions and completion of supervision records; (ii) Progression Review - formal review of progress towards meeting the required outcomes, and assessment of whether the outcomes will be met in the required time. Completion of the Progression Review forms. (iii) MPhil and doctoral registration - procedures for upgrading or downgrading candidates and for confirming MPhil or doctoral registration. Supervisors may, from time to time, be required to provide reports on their PGR’s progress for other purposes and to other agencies, for example, the Research Councils and other sponsors. Such reports should be provided within the required deadline to ensure, in particular, that the continuation of candidate’s funding by outside agencies is not compromised. For more information about the Progression Review of research students, please consult the following: Progression Review of research students Includes: discussing personal, academic, and professional skills; PGR training programme; research ethics; Code of research conduct and research ethics The supervisor should discuss with the PGR what personal, academic, and professional skills training they require in order to complete their research degree and to provide a skills base for a future career. The supervisor should agree with the candidate a research training programme which is compatible with the PGR's needs and which is achievable in relation to the research commitments within the limits of their registered period of study, making it clear where attendance at training courses is compulsory or voluntary. This programme should be reviewed each year. The supervisors should take reasonable steps to ensure that the PGR’s training needs are met. Normally such training will be delivered within the University and the supervisor should, therefore, be aware of any research training offered through the Researcher Academy, the Doctoral Training Centre/Programme, the Faculty and the School. The supervisor should also ensure that the PGR receives adequate training in research ethics and is given assistance in applying for ethical approval if appropriate. For more information, please consult the following: Code of research conduct and research ethics Includes: correct procedures; seeking advice The supervisor(s) should encourage and facilitate the PGR to engage with relevant academics who will support their doctoral research and future career development. This could be through encouraging attendance at seminars, meetings and conferences; introducing them to relevant individuals and professional networks; and encouraging them to publish the results of their research. Where appropriate supervisors should also support the PGRs to participate in public and policy engagement activities or undertake placements and internships that will enable them to develop their broader research experiences. Includes: minimum number of meetings; the role of proofreaders During the thesis pending period and any period of corrections or thesis re-submission, supervisors and PGRs should continue to meet regularly (as described above). Supervisors will also read and comment on one draft of the candidate’s thesis prior to each submission (as appropriate) when submitted within the required timeframes for feedback to be given. A proofreader may only ensure that the meaning of the author is not misrepresented due to the quality and standard of the English used. This can include correcting spelling and basic grammar errors. Inaccuracies in academic content should not be corrected nor should the structure of the piece of work be changed; doing so may result in a charge of plagiarism. Supervisors should advise candidate’s on the timing, construction and form of presentation of their thesis and should check that they receive a copy of the University's guidance on presenting a thesis, from Student Services or Central Administration at UNM or Graduate School at UNNC. Includes: PGR supervision record; Research supervisor resources Research supervisor resources Students studying in outside organisations Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}