{
    "url": "https://www.nottingham.ac.uk/qualitymanual/personal-tutoring-student-support-and-development/disabled-students.aspx",
    "content": [
        {
            "p": "This page provides an introduction to the relevant legislation and the University's Disability Liaison Officer roles. Its content is directed at staff and students across all of the UK, China and Malaysia campuses. Includes: 'Disabled Student' definition; link to relevant legislation The term ‘Disabled Student’ is used to refer to those with a disability, long-term mental health difficulty or medical condition, autistic spectrum condition, or a specific learning difference such as dyslexia, dyspraxia, dyscalculia or ADHD. As part of the University’s support to disabled students this page provides an introduction to relevant legislation and the University’s Disability Liaison Officer roles. Its content is directed at staff and students on the UNUK campus, UNM and UNNC. For more information about this legislation, please consult the following: Equality Act 2010 The Public Sector Bodies Accessibility Regulations 2018 The Persons with Disabilities Act Malaysia 2008 Law of the People’s Republic of China on the Protection of Disabled Persons 2018 Includes: expectations; support and School mechanisms Each School is expected to have a Disability Liaison Officer (DLO). The DLO will be the point of reference, advice and guidance for members of staff and students in the School for disability issues and support. The DLO should be a member of relevant School and/or Faculty committees. Schools should have mechanisms (such as a Disability Action Plan, DAP) to: For more information about disability support arrangements, please consult the following: UNUK Disability support services UNM Disability Services UNNC Disability support service Teaching timetable arrangements for students who have a disability Examination arrangements for disabled students Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}