{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2018.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2018. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. ADDITION TO VOLUNTARY INTERRUPTION OF STUDY Section 9 of the policy was updated to reflect that a School may require a student to provide medical evidence that they are fit enough to engage with academic study prior to the next period of proposed registration. UPDATE TO LEGIBILITY OF WORK SUBMITTED FOR ASSESSMENT The wording of the policy was updated to reflect that ALL work submitted for assessment should be legible, not only examination scripts as the previous wording implied. AMENDMENT TO THE ACADEMIC APPEALS POLICY AND PROCEDURE - RIGHT TO APPEAL A small amendment to Policy has been made to make provision for the exceptional scenario in which a student, who is not in their final year of study, wishes to notify the University of circumstances affecting their study after an Examination Board’s decision even if they have met the progression requirements of their course. Schools and Department should have scope to consider cases where there is considered to be ‘good reason’ for the late notification of circumstances affecting study and where the student’s final classification could be impacted. REGULATIONS ON ACADEMIC MISCONDUCT (POLICY&PROCEDURE) - from 24 September Changes have been made to the Regulations on Academic Misconduct as a result of feedback from colleagues, guidance from the Office of the Independent Adjudicator and to align the Regulations with existing University processes. Key changes include: Training sessions will be taking place throughout September and October. Changes will go live from 24 September 2018. REGULATIONS FOR MRES AND MA BY RESEARCH Previously published updated versions of both the Regulations for the Degree of Master of Research (MRes) and Regulations for the Degree of Master of Arts by Research (MA by Research) and Master of Science by Research (MSc by Research) came into effect for student commencing study in or after September 2018. Following QSC approval, changes were made to the Managing Higher Education Provision with Others policy. Key changes include: REGULATIONS FOR THE DEGREE OF MASTER OF RESEARCH (MRes) - FROM SEPTEMBER 2019 New regulations for MRes programmes were approved by Quality and Standards Committee, with the aim of unifying regulations for the MRes and MA/MSc by Research programmes under a single title. The regulations would come into effect from September 2019 only; before this date, the MA/MSc by Research Regulations and Master of Research (pre-September 2019) will apply. F1 ARCP OUTCOME 4 APPEAL PROCEDURE Under the Medical Act, the General Medical Council (GMC) has determined that the graduating UK university/medical school is responsible for the recommendation for full registration of its students. In consequence, a standalone procedure has been created, mirroring many of the core principles of the academic appeal procedure, but designating the roles and responsibilities of University of Nottingham staff within the procedure and providing for an appropriately skilled panel to assess the case. Implementation date 28th March 2018 UG AND PGT REGULATIONS New pages were retrospectively created for the current versions of UG and PGT regulations, that came into effect as of September 2017. The versions of the regulations that were in effect prior to September 2017 were reinstated for reference. These changes were made to ensure clarity and appropriate application of the regulations, in particular regulation 26b/24b, which was amended from September 2017. INNTERNATIONAL CAMPUSES AND QA The policy was updated to bring it in line with changes previously made to the Programme Design, Development and Approval Policy. In particular, the removal of the PVC for Global Engagement from the process, and the addition of the Provost and Vice- Provost of the relevant campus. EXTERNAL EXAMINERS Appointment and Responsibilities of External Examiners: a number of documents were updated to reflect updated procedures. Fees and Expenses Procedure: a number of documents were updated. REASSESSMENT REGULATIONS A number of changes were made to regulations relating to reassessment. This includes Regulations 13 and 19 of the Undergraduate Regulations and Regulation 14 on the PGT Regulations. Additionally, the final paragraph was added at the end of section 18 in Module Specification Guidance. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}