{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2022.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2022. INDEPENDENT ASSESSOR ROLE The Independent assessor role page was introduced to provide information with regards to the roles and responsibilities of the Independent Assessors for Apprenticeship Integrated End-Point Assessments. EXTERNAL ASSESSOR ROLE The External assessor role page was introduced to provide information with regards to the roles and responsibilities of the External Assessors for Apprenticeship Integrated End-Point Assessments. MARKING AND GRADING - ROUNDING The Rounding section of the Policy on marking and grading has been updated to provide clarification on the rounding process. SCHOOL EXAMINATION BOARD The School Examination Board page has been updated to inform that where possible all Examination Boards must be conducted using student IDs, rather than names, in order to provide anonymity in decision making processes. ACADEMIC MISCONDUCT The Academic Misconduct Policy has been updated to provide clarification with regards to Artificial Intelligence (AI) software. DICTIONARY, CALCULATOR and MCQ RUBRIC The School Examinations Officer Role page has been updated to include the revised documentation: The School Examination Board page has been updated to inform that all Examination Boards must be conducted using student IDs, rather than names, in order to provide anonymity in decision making processes. VETERINARY MEDICINE MVM/MVS The Maximum period from initial registration for completion of studies page has been updated to include Veterinary Medicine MVM/MVS to the 'Table of absolute maxima for the completion of all full and part-time programmes'. REMOTE VIVA VOCE EXAMINATIONS The Regulations for the Degree of Doctor of Philosophy (PhD) and Master of Philosophy (MPhil), Viva voce examinations and Role and appointment of examiners for research degree programmes pages have been updated to support the conduct of remote viva voce examinations where deemed necessary and/or appropriate. POSTGRADUATE RESEARCH REGULATIONS The Regulations for the Degree of Doctor of Philosophy (PhD) and Master of Philosophy (MPhil), Responsibilities of the supervisor and Progression review of research students (formally named Annual review of research students) have been updated to reflect changes to the progression review process for doctoral and MPhil PGRs. Changes include appointment and responsibilities of internal assessors, assessment criteria for PGR progression at different stages, and more information on pre-review preparation and post-review decision making. WITHDRAWAL FROM STUDY The Withdrawal from study process has been introduced. The page provides guidance on the process and associated implications that apply when a student withdraws from their studies. MARKS ADJUSTMENT The Marks adjustment section of the Policy on marking and grading has been updated to include a revised marks adjustment reporting process and associated forms. THESIS RESTRICTION OR EMBARGO The Applications for a restriction to be placed on a thesis policy has been updated to incorporate information on thesis embargo. PGR STUDY AWAY/IN OUTSIDE ORGANISATIONS The Postgraduate researchers studying away/in outside organisations policy has been updated to provide clarity on the different study away options and to ensure visa and immigration requirements are fully reflected. CLOSING OR SUSPENDING A PROGRAMME The Closing or suspending a programme policy has been updated to provide a more streamlined approval process to speed up the response to closure/suspension requests. The policy has also been updated to mandate consultation with key stakeholders. FITNESS TO PRACTISE PROCEDURES The Fitness to Practise Procedure page was updated to link to the revised Faculty of Medicine and Health Sciences Fitness to Practise Procedure. ASSESSMENT REGULATIONS - ONLINE EXAMINATIONS The assessment regulations page was updated to include regulations specific to online examinations. The School Examination Board page was updated to advise that the exam board agenda should include 'Review and sign off of marks adjustment report (including nil returns)'. SAFEGUARDING The Safeguarding page was updated to link to the revised Safeguarding policy. PROGRAMME DESIGN, DEVELOPMENT AND APPROVAL Following adoption of the revised programme approval process at UNUK in 2021/22, the new process has now been introduced at UNNC and UNM. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/fitness-to-practise-procedure-mhs.pdf"
    ]
}