{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/pacer.aspx",
    "content": [
        {
            "p": "This page provides information about the purpose, schedule and assessment of core teaching and learning activities of the Periodic Assurance and Continuous Enhancement Review (PACER). This information and its associated documentation may be of interest for staff and students across all of the UK, China and Malaysia campuses. Periodic Assurance and Continuous Enhancement Reviews (PACERs) are UoN's periodic quality assurance (QA) and enhancement (QE) review process. It is a periodic programme of peer review, in which academic Schools and Departments of UoN focus on Quality Assurance and Quality Enhancement in their Education and Student Experience (ESE) provision. The philosophy underpinning the PACER is one of peer support, collaboration and educational enhancement through the sharing of good practice in ESE, teaching and curriculum leadership. Through the review visit and the subsequent report and follow up, the process aims to enable colleagues in Schools/Departments who are facing challenges in specific areas of their provision to learn from peers with expertise or proven good performance in those same areas. The remit of the PACERs is limited to UG and PGT programmes, but the impact of potential changes can affect other provision such as Apprenticeships or PGR delivery. All recommendations should consider the wider impact they have on delivery to avoid unintended negative consequence The purpose of the PACER process is: 1. In advance of each academic session, a review of performance in key ESE indicators is conducted by the PACER Planning Board of the Schools currently in the pool of Schools/Department eligible for review. The membership of this board should include; 2. Example indicators that will normally factor into the review of performance are listed below and are predominantly the external measures of our performance, as monitored by the UNUK regulator the OfS; 3. The review of performance should look longitudinally at the data sets. A single year’s performance should not alone be considered a trigger for review. Nor should a single year’s performance be considered as a reason why a review is not justified. 4. The PACER Chair, as nominated by the PACER Planning Board, will recommend a review panel for each visit. As far as possible, the constitution of the panel should be matched to the needs of the visit, based on the factors that contributed to the decision to conduct the review. For example, if a School’s Assessment and Feedback scores in NSS and Awarding Gaps are the focus of the review, then it may draw on those with provable expertise in those fields. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}