{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/professional-accreditation-reports.aspx",
    "content": [
        {
            "p": "This page provides information on the procedure surrounding professional accreditation reports, which may be useful for staff and students across all of the UK, China and Malaysia campuses. Includes: expectations of the School Reports arising from reviews conducted by Professional, Statutory and Regulatory Bodies (PSRBs) are valuable sources of information on the quality and standards of courses. Schools are expected to take them fully into account as part of their own internal review processes and to report on the outcome. Includes: notification; receipt of report; consideration of recommendations; key roles and responsibilities 1. The School is notified by the Professional, Statutory and Regulatory Bodies (PSRB) of its re-accreditation decision; if that is anything other than full approval then the Head of School must as a matter of urgency inform the Chair of Quality and Standards Committee (QSC), the Pro-Vice Chancellor (PVC) for Education and Student Experience and the Registrar; 2. the School receives the PSRB report; 3. the School considers the recommendations of the PSRB report through its existing committee structure and agrees any actions; 4. the Head of School sends a copy of the full PSRB report together with a written School response where required (comprising a note of actions taken or planned, and any other relevant points) to Quality and Student Record systems team, Registry and Academic Affairs for consideration on behalf of QSC via RA-Accreditation@nottingham.ac.uk 5. QSC confirms that it is content with the School response, or if not engages in dialogue with the Head of School to resolve the issue; 6. where approprate, the School will take PSRB reports into consideration in its next full Educational Enhancement and Assurance Review. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}