{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/external-assessors-role.aspx",
    "content": [
        {
            "p": "This section contains detailed information with regards to the roles and responsibilities of the External Assessor for Apprenticeship Integrated End-Point Assessments. This information is only relevant to staff and students based at the UK campus. 1.1 Schools are responsible for providing nominations for the appointment of External Assessor(s) (EA) for their End-Point Assessments (EPA) on an annual basis. Council has the power to receive nominations and approve such appointments and discharges its responsibilities in this regard through the Quality and Standards Committee (QSC). 1.2 The EA must not be involved in the delivery of the apprenticeship training and must be independent from apprentices, employers and Training Providers (except as an existing External Examiner for the programme). 1.3 It is the EA’s role provide assurance to the University of the quality and standard of the EPA, as set out the EPA plan, and to ensure the assessment processes are reliable, fair and transparent and that they operate in line with the University’s Regulations. 1.4 The EA will be provided with guidance and undertake an induction and relevant training for the EPA delivery, which will be provided by the School. 1.5 The EA will be expected to engage in regular Continual Professional Development (CPD) activity related to their role in line within the relevant Apprenticeship Standard and provide evidence of this to the School. 2.1 The main responsibilities of EAs are: i) To provide informative comment and recommendations on whether the EPA meet the standards set within the EPA plan, ii) To provide informative comment and recommendations upon whether the assessment process measures student achievement rigorously and fairly against the intended outcomes of the EPA plan and is conducted in line with the relevant policies and regulations, iii) To provide informative comment on whether the academic standards and achievements of students undertaking the EPA are reliable and comparable to EPA across different EPAOs, employers, places, times and assessors, iv) To annually submit evidence of CPD records to the relevant School within the agreed timescales, v) To annually review their conflict-of-interest declaration within the agreed timescales, vi) To submit all requested documentation within university timescales. Includes: Conflict of Interest; apprenticeship standards; assessment plans; CPD 4.1 Nominees will ideally have experience and expertise of the following: 4.2 Be independent of the apprentice, the End-Point Assessment Organisation (EPAO) (University of Nottingham) and employing organisation who are involved in delivering the apprenticeship. 4.3 Able to demonstrate the knowledge, skills and experience required of an EA, as outlined in the EPA plan and meets all external regulatory requirements. 4.4 In view of the importance of the EA, the University reserves the right to review the appointment of an EA in the following circumstances: Includes: conflict of interest; categories and circumstances; reappointment restrictions 5.1 The nomination complies with the University’s conflict of interest policy in relation to the appointment of EAs. For more information, please consult the following: Policy on conflict of interest 5.2 Appointment of an EA will be carried out on an annual basis by the School, in conjunction with Registry and Academic Affairs. 5.3 Re-appointment (or renewal) of an EA who has previously fulfilled the role may be allowed, on the basis that the individual in question continues to meet all the requirements of the standard and has shown an acceptable level of involvement in the past. 5.4 An EA should normally hold no more than one other external examinership during the period of their appointment. 6.1 EA will be appointed on an annual basis. 6.2 Every EA will receive a formal letter of appointment from Registry and Academic Affairs (Quality and Student Management System team) setting the programme(s) to be examined, specific responsibilities and the fee to be paid. Includes: responsibilities of the Head of School; EAs' report availability 7.1 Schools should ensure that EAs’ reports are made available in full to students, with the sole exception of any confidential report made directly, and separately, to the Vice-Chancellor. For this reason, EAs will be asked not to identify any individual apprentice or staff by name in their summary reports. 7.2 Schools should ensure that their apprentices are informed that it is inappropriate for them to directly contact EAs and that other appropriate mechanisms are available for them to raise concerns regarding their individual performance in assessments, for example the Appeals or Complaints procedures. Includes: responsibility of Registry and Academic Affairs; appointments with no previous experience; responsibilities of the Head of School 8.1 Registry and Academic Affairs ensures that all EAs are informed about the University’s procedures and policies, including the University’s appeals and reassessment process, which may be by provision of an opportunity to attend a University or School induction event. 8.2 Where the individual appointed has no previous experience as an EA for any institution, the School should ensure that the appointment is, if practicable, made to a team of EAs, or that with prior agreement a more experienced EA will act as a mentor. 8.3 Heads of School are responsible for ensuring that EAs are provided with information on the University’s marking and grading policy, moderation practices and any additional requirements contained with the Apprentice standard or EPA plan. 8.4 The School should ensure that all EAs are given the opportunity to engage with training / briefing materials at both University and School level. Engagement with such materials by the EA is considered mandatory. 8.5 Heads of School are responsible for ensuring that EAs are given the relevant material they require and adequate time to carry out the role. Includes: requirements; Microsoft Forms report, annual report, final summary report; submission and contact details 9.1 EAs are responsible for assuring the University on the quality and standards of EPA delivery. 9.2 EAs are responsible for assuring the University that the assessment procedures being followed (including marking criteria and marking schemes and the consideration of extenuating circumstances) are fair and reasonable, protect academic standards, and are in line with the EPA Plan and appropriate apprenticeship standards. 9.3 EAs are responsible for endorsing assessment outcomes. In doing so, they need to be assured that marking criteria have been applied rigorously and fairly and that the recommendations of the IAs reflect the standards set by the EPA Plan. 9.4 EAs are responsible for providing the University with an annual written report in compliance with the standard requirements outlined in the report form and a final summary report at the end of their appointment. Includes: requirements; Microsoft Forms report, annual report, final summary report; submission and contact details 10.1 The EA is required to provide a summary report in a digital format, within the prescribed timescales outlined in the EPA Plan. The EA’s summary report should be submitted through Microsoft Forms to Registry and Academic Affairs (Quality and Student Management Systems team), who will then arrange for the appropriate fee to be paid. 10.2 The report form is available on request by emailing: indi-assessors@nottingham.ac.uk 10.3 Registry and Academic Affairs (Quality and Student Management team) will forward copies of the report to the Head of School (for action). Copies should also be made available to the External Examiner for related apprenticeship degree programme, Apprenticeship committee and the Office for Students (OfS) Designated Quality Body the (Quality Assurance Agency. Includes: report explicitly on standards, assessments and awards; may also make a written report on confidential matters 11.1 In their report, the EA is asked to report explicitly on standards, assessments awards and conduct of the EPA process using the standardised report form provided and to draw attention in particular to any good practice, or areas requiring attention. 11.2 The EA may also make a written report on confidential matters to the Vice-Chancellor. In exceptional cases, where the concern is systemic and not a one-off case of ineffective practice, and the EA has exhausted all published applicable internal procedures, including the submission of a confidential report to the Vice-Chancellor. Includes: School responsibilities; opportunities for feedback; circulation; communication requirements; responsibilities of Quality and Standards Committee, QAA, OfS, DQB 12.1 It is the School’s responsibility to ensure that the annual and final reports comply with the standard requirements outlined EPA Plan. 12.2 Reports must be available to the External Examiner for the associated apprenticeship degree programme and to the School's Student Staff Forum, Apprenticeship committees, and Quality and Standards Committee (QSC) and will be submitted to the Quality Assurance Agency (QAA) in their role as the Designated Quality body (DQB) for the Office for Students (OfS) as part of their quality review process. 12.3 If an EA fails to submit an annual summary report in the time stipulated by the School, this may constitute grounds for not re-appointing the EA in a subsequent year. 12.4 To assist Schools in fulfilling their responsibility, Registry and Academic Affairs (Quality and Student Management Systems team) will notify them annually of any outstanding reports. 12.5 The School should provide an opportunity for the EA to give feedback arising from the performance of his / her duties and for the School to provide information to the EA on how the School has addressed issues raised in any previous report(s). 12.6 Subsequently, the School will forward each report of an EA, together with the written report on how the School has addressed the issues raised, to Registry and Academic Affairs (Quality and Student Management Systems team). 12.7 A letter is to be sent to each EA by the School on the actions or otherwise which have resulted from the report. A copy of each letter should be forwarded to Registry and Academic Affairs (Quality and Student Management Systems team). 12.8 It is the duty of the QSC to assure itself that any comments or recommendations of an EA have been addressed by the School and, if it is not satisfied, to seek to resolve the matter through a dialogue with the School Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}