{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2010.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2010. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. Some minor amendments have been made to the entry on Annual Review of Research Students at http://www.nottingham.ac.uk/quality-manual/research-students/annual-review.htm to clarify that the elements listed for Confirmation Review must all be included within this process conducted by Schools, and that where Schools are using the Annual Review process (eg for students registered for the degree of MPhil) the process should include an interview of the student by an Internal Assessor if the School if considering recommending that the student be transferred to a degree at doctoral level. Research Degree Programmes section updated. Minor amendment to UNQF. Minor text changes to e-Assessment Policy. The Extenuating Circumstances Form has had the notes and signature sections moved to provide clarity in relation to requirements for completion. A clarification of the procedures relating to students transferring course and repeating some or all of a stage. Minor amendments to regulations for Undergraduate Courses. A clarification has been made to the Feedback Procedure to make it clear that where a mark has been expunged from the record the process does not apply. Minor amendments to sections 5 and 6 within the Regulations for the Degree of Doctor of Philosophy (PhD) and Master of Philosophy (MPhil). Amendment to section 2.4 of Changes of Taught Course to reflect Quality and Standards Committee role. Following the update to the University’s Charter, Statutes and Ordinances in July 2010, regulation 5 of the Doctor of Philosophy and Master of Philosophy Regulations at http://www.nottingham.ac.uk/quality-manual/study-regulations/HigherDegreeRegs2.htm#PhD has been amended to take out the reference to Ordinance XXIII re applications to be staff candidates as this Ordinance no longer exists. An amendment has been made to the minimum English Language entry requirements entry at http://www.nottingham.ac.uk/quality-manual/recruitment-admissions/eng-lang.htm to include the Pearson Test of English on the list. The Quality Manual has also been more widely amended to reflect the new staff structure in Academic Services Division. Following consultation with the Students’ Union, the title of Student-Staff Feedback Committees has now been changed to ‘Learning Committee Fora’ (see http://www.nottingham.ac.uk/quality-manual/taught-programmes/student-feedback.htm for further information). An amendment has been made to the policy on submission and approval of new modules at http://www.nottingham.ac.uk/quality-manual/taught-programmes/new-modules.htm to give further information about the circumstances in which Schools may submit new modules for approval. The University of Nottingham Qualifications Framework at http://www.nottingham.ac.uk/quality-manual/QAstructures/UNQF.htm has been updated to reflect a change in the number of credits which must be taken at Level 4 for Taught European Masters Degrees. The regulations for undergraduate degrees at http://www.nottingham.ac.uk/quality-manual/study-regulations/undergraduate-regulations.htm have been amended to include a cross-reference to Fitness to Practice regulations where appropriate. The regulations for postgraduate taught courses at http://www.nottingham.ac.uk/quality-manual/study-regulations/taught-postgraduate-regulations.htm have been amended to include a cross-reference to Fitness to Practise regulations where appropriate. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}