{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/pol-alternative-english-qualifications.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on countries and qualifications which already meet its minimum English language requirements. Its content is primarily directed at prospective international students but may also be of interest to staff and current students across all of the UK, China and Malaysia campuses. Includes: English language equivalencies document; students on split site degree programmes Students whose first language is not English are required to have an appropriate result in an approved examination in English language before they can register on an academic programme. Details of recognised English Language qualifications are available on our Minimum English Entry Requirements page, which can be found here: Policy on minimum English entry requirements Students will automatically be classed as having an alternative acceptable English language qualification if they have either: Gov.uk - Student visa - knowledge of English Students on split site degree programmes (such as 2+2 programmes) who have undertaken the latter 2 years of their degree in the medium of English, at an approved English speaking institution, can be classed as having an acceptable alternative qualification. Includes: table indicating the level of vouching for B2 Level English equivalents; key Workspace links While the following countries are not on the Home Office list, the International Student Recruitment team has agreed that degree level qualifications from certain countries (recognised institutions only) are an acceptable alternative to B2 level English. For more information about recognised institutions, please consult the following (entering your university username and password when prompted): List of recognised institutions – Workspace (UoN Staff only) Includes: Secure English Language Test (SELT) All international applicants for non-Integrated foundation programmes are required by the Home Office to have taken a Secure English Language Test (SELT) and achieve the University’s minimum requirements for the programme. Includes: Acceptable alternative English language evidence form; performance at interview This policy is not suitable for students requiring sponsorship under the Student route of the immigration rules. If you wish to admit an applicant who does not meet the above criteria or the normal minimum requirements for their course but consider that the applicant has the required proficiency in English language you may submit acceptable evidence to the Head of Admissions. When compiling your evidence, please use the following online form: Acceptable alternative English language evidence form Such requests will only be considered where there is strong documented evidence that the student has attained the required level of English to meet the published requirements in all four elements (listening, reading, speaking and writing) but has not taken a recognised English language qualification. Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}