{
    "url": "https://www.nottingham.ac.uk/qualitymanual/academic-regulations/pol-students-who-teach.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on the management and utilisation of postgraduate students as teachers. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. Includes: quality of teaching; skills and training; monitoring; duties; payment; obligations 1.1 A Head of School may allow a postgraduate research student to undertake limited teaching* duties on a part-time basis within the student's own School, providing this policy and the guidelines are observed. For the purposes of this document such teachers are referred to as \"Postgraduate Student Teachers\". * Here \"teaching\" includes formal lectures, seminars, tutorials, demonstrating in laboratory classes etc. 1.2. The quality of the teaching provided by a Postgraduate Student Teacher must be broadly equivalent to that which might be expected of a new full-time member of academic staff - bearing in mind that Postgraduate Student Teachers will not have had the same level or amount of training as new full-time academic staff, and that their teaching duties are limited in scope. 1.3. A Postgraduate Student Teacher must have appropriate skills, experience and knowledge in the subject area being taught. 1.4. A Postgraduate Student Teacher must have received appropriate training before undertaking their duties. 1.5. The quality of the work of the Postgraduate Student Teacher must be monitored so that any problems can be resolved without detriment to the students being taught. 1.6. The nature and extent of the Postgraduate Student Teacher's duties are limited, as set out below. 1.7. A Postgraduate Student Teacher will be paid an appropriate rate for the teaching activity. 1.8. A Postgraduate Student Teacher may normally only be involved in the teaching of modules aimed primarily at undergraduate students. It is permissible for a Postgraduate Student Teacher to be involved in the teaching of postgraduate students if they have the skills, experience and knowledge appropriate to that level of teaching. 1.9. A Postgraduate Student Teacher's teaching duties must not interfere with their own studies, and their Supervisor must give prior assent to any such work on an annual basis to ensure that their ability to complete their thesis on time is not affected. 1.10. Unless specified in the terms of a studentship, postgraduate research students are not obligated to undertake any teaching. Includes: assessment of capability; maximum amount of teaching activities; supervisor consultation; performance monitoring; postgraduate student teachers assessment of teaching capability document 2.1. It is the responsibility of the Head of School to ensure that the requirements of the policy and guidelines are observed, and usually a named, senior member of the School's academic staff should be identified as having direct responsibility for this. These responsibilities include ensuring that: 2.1.1. The School publishes its policy and process for the recruitment of Postgraduate Student Teachers, and gives all its postgraduate research students a fair opportunity to be considered for any such work 2.1.2. An assessment is made of the teaching capability of any Postgraduate Student Teacher before they start teaching, including their ability to communicate clearly and effectively 2.1.3. On the basis of such an assessment they are given appropriate training 2.1.4. The maximum permissible amount of teaching activities (inclusive of preparation, delivery and marking) is 6 hours per week (averaged over 12 months), subject to the requirements of any scholarship they hold 2.1.5. The supervisor(s) has been consulted and has assented to the arrangement 2.1.6. The performance of the Postgraduate Student Teacher is monitored. Includes: written specification requirements; hourly basis 3.1. A Postgraduate Student Teacher must be given a clear specification of their teaching duties, total hours required, and pay, in writing. The document must also make clear the expectation regarding training, preparatory work, attendance at course/module meetings, and marking if any. 3.2. Postgraduate Student Teachers should be paid on an hourly basis according to the specified duties. If the work comprises demonstrating, the student should be paid at the relevant standard University rate. The hours worked should be based on a realistic assessment of the total amount of time to be worked by the Postgraduate Student Teacher including preparation time, contact time with students, marking, attendance at module meetings etc. Includes: mentor; hands-on experience; feedback 4.1. On appointment as a Postgraduate Student Teacher, an individual training needs assessment must be undertaken by a member of the School's academic staff. It is expected that unless the postgraduate student has direct relevant teaching experience, training will be required. The training needs analysis must be documented (sample form available) and written confirmation provided by the Postgraduate Student Teacher and the module convenor that the training has been completed satisfactorily prior to any teaching being undertaken. 4.2. Training may take a variety of forms (ranging from practical training on how to use equipment to more formal courses provided within the School, by the Graduate School or organisations external to the University) and will be determined by the sort of teaching being undertaken by the Postgraduate Student Teacher. 4.3. All Postgraduate Student Teachers should be assigned a mentor, such as the module convenor, who must be a member of academic staff, who can provide guidance and advice. 4.4. Postgraduate Student Teachers involved in demonstrating should be given hands-on experience with the equipment concerned and should be familiarised with health and safety issues. 4.5. Postgraduate Student Teachers should receive constructive and regular feedback on their performance (including strengths and weaknesses) by the module convenor or another member of full-time academic staff. The Postgraduate Student Teacher's performance should be monitored over the duration of the teaching and this should include classroom observation. Includes: responsibilities; moderation by academic staff 5.1. Assessment lies at the heart of the maintenance of academic standards, and the involvement of a Postgraduate Student Teacher in assessment must be limited and carefully controlled. 5.2. In respect of any assessment carried out by Postgraduate Student Teachers, Heads of School must ensure that: 5.2.1. They are supervised by a named member of academic staff 5.2.2. They are provided with training appropriate to their role in the assessment process 5.2.3. Assessments that contribute to the final module/course mark are: a) Moderated by a member of academic staff. Example methods of moderation include: b) Limited, as far as practicable, to those elements of assessment that do not contribute to the degree classification 5.2.4. Such assessments which do not contribute to the final module/course mark are second marked where appropriate on a sampling basis by a member of academic staff Includes: expectations; exceptions; Student Teachers Assessment of Teaching Capability document 6.1. The normal expectation is that postgraduates will not act as personal tutors 6.2. Schools may, however, employ postgraduate students as personal tutors where the following conditions apply: 6.3.1. Where the School employs the postgraduate student as a teacher in the context of operating a School-wide policy of allocating personal tutors to students they teach 6.3.2. Where the School makes arrangements for the training and support of postgraduate students both as teachers and as personal tutors, and allocates paid time for personal tutoring. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}