{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-professional-training-dappedpsy-before-september-2020.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Applied Educational Psychology (Professional Training) (DAppEdPsy) before September 2020. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. The regulations for the DappEdPsy are those which govern the PhD except where the following modify or supplement them. These regulations are applicable to students starting programmes in or after September 2018. A candidate for the Doctor of Applied Educational Psychology (Professional Training) must: a) Be a graduate of an approved university holding a Bachelors degree in Psychology or an equivalent subject recognised by the British Psychological Society as conferring Graduate Basis for Registration. This will normally be a first or upper second class honours but candidates with a lower second-class honours degree or other equivalent qualification may be considered if they have evidence of academic ability in psychology at postgraduate level. b) Have the personal and intellectual resources to pursue a challenging and demanding research oriented programme, including the: c) Have previous supervised practical experience relevant to training as an educational psychologist that demonstrates: d) Complete Criminal Records Bureau checks for acceptability for working with children and young people. 2. A candidate for the Degree of Doctor in Applied Educational Psychology (Professional Training) must have pursued in this University a full-time course of study comprising a taught component and two major research projects. The minimum period for registration for this programme will be three years full time supervised study. Candidates will also be entitled to a thesis pending period of one year. 3. The course has a modular structure and credits will be awarded on the basis of successful completion of each module. The 540 credits will comprise 14 taught modules (140 credits), 3 placement modules (250 credits), which include research components contributing to a research portfolio, a research project (50 credits) and a research dissertation (100 credits). 4. All taught modules will be at level 5 and the taught component of the course will continue throughout the three years of the course. The minimum pass mark for all taught modules will be 50%. All taught modules will be compulsory. The modules to be taken will be as notified to students in the School's programme handbook. The assessment will enable candidates to demonstrate a systematic acquisition and understanding of a substantial body of knowledge which is at the forefront of educational psychology professional practice. The assessments for the research methods training will comprise part of the research portfolio and are not assessed as part of the taught component of the course. The number of modules which can be reassessed may be limited by the requirements of the British Psychological Society. The maximum number of placement modules which may be reassessed is two. 5. The University's Regulations for Taught Master's Degrees, Postgraduate Diploma and Postgraduate Certificate courses shall apply with regard to satisfactory progression on the taught element of the degree. 6. The final assessment will comprise a portfolio of research completed on research methods taught modules and placement modules, a research project and a dissertation. Students will complete five assignments during the fieldwork placements for inclusion in the portfolio of research. Students will complete 3 placement modules during which they will be required to produce a portfolio of fieldwork activities for each placement in addition to the portfolio of research. 7. The research project (15,000 words) will extend over year 2 and be presented at the end of that year. Students will choose from a menu of research topics recommended by a national steering committee of local authority employers and university professional trainers and have the opportunity to contribute towards the collation of large nationally-gathered data sets. This project will contain the literature review for the year 3 research dissertation. 8. The research dissertation (35,000 - 40,000 words) will extend over years two and three and be presented in the second half of the third year. The research dissertation shall be of a standard to indicate the creation and interpretation of new knowledge through original research, which will extend the forefront of the discipline. The work reported will be of a quality to satisfy peer review and merit publication in a scientific journal. Normally candidates will submit their thesis by mid semester in year 3. The viva will be carried out in the summer period of year 3. In exceptional circumstances candidates may submit the dissertation and research portfolio up to one calendar year after the period of supervised study. 9. The degree of Doctor of Applied Educational Psychology (DAppEdPsy) will be conferred on candidates who have completed and reached a satisfactory standard in the taught modules, fieldwork placements, research portfolio, project and dissertation, as defined above. 10. Candidates who either do not undertake or fail the research component but successfully complete part or the whole of the taught programme may be considered for the following awards: Postgraduate Certificate in Applied Educational Psychology (60 credits), or Postgraduate Diploma in Applied Educational Psychology (120 credits). Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}