{
    "url": "https://www.nottingham.ac.uk/qualitymanual/personal-tutoring-student-support-and-development/academic-guides.aspx",
    "content": [
        {
            "p": "This page provides guidance on the responsibilities of Academic Guides. Its contents are primarily directed at Academic Guides but may also be of interest to staff and students across all of the UK, China and Malaysia campuses. Academic Guides are staff who support registered students throughout their studies, within an interdisciplinary team. They are also referred to as the ‘Here for You’ Academic Guides. This page describes the recruitment, roles and responsibilities of the Academic Guides. The University Senior Tutor will be responsible for regularly reviewing and updating these regulations, policies, and procedures to ensure alignment with the Quality Manual, and the University's overall student support framework and best practices. The Academic Guides will maintain accurate records of student interactions, student attendance at meetings with the Academic Guide, and any interventions provided. The lead School/Unit must allocate every undergraduate student an Academic Guide at the start of their course. The lead School/Unit must appoint Joint Honours students an Academic Guide from that School/Unit. In the non-lead school, the student will be appointed a Joint Honours Liaison Officer or an Academic Guide. The School/Unit will allocate appropriate workload in the Academic Guide's workload plan to ensure sufficient time for duties. Typically, the workload amounts to 0.2 FTE, encompassing responsibilities for overseeing typically 80-100 students. The School/Unit will signpost Academic Guides to ongoing professional development provided by the University in relation to student support, advising, coaching methodologies, and EDI best practices, and encourage Academic Guides to take up these training opportunities. The School/Unit will ensure Academic Guides receive regular updates on changes to university policies, procedures, and support services. The Academic Guide will not be involved in organising timetables, participating in EC panels, or, for UNUK students, engagement in dashboard monitoring. The School/Unit will use the University-agreed job description and person specification for the Academic Guide role, without adding or subtracting from the requirements outlined. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}