{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-mas-amusm.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Master of Musical Arts (AMusM), including information on admissions, examinations and transferring to a doctorate. However, please note that this programme is not currently running and its details will not be applicable to any staff or students. Includes: exceptional circumstances 1. A candidate for the degree of Master of Musical Arts must: (a) Be a graduate of this or any other approved university holding (i) a higher degree or (ii) a Bachelor's degree with first or second class Honours; or (b) Be a graduate holding a degree awarded by the Council for National Academic Awards with first or second class Honours; or (c) Hold such other qualifications as may be deemed by the University to be the equivalent of any qualification referred to in (a) above. In exceptional circumstances, the following may with the approval of the University be deemed to qualify under the above Regulation: (i) A full-time candidate who is a graduate with third class Honours; (ii) A candidate who has no qualification appropriate to (a)-(c) above but whose general educational qualifications and ability in musical composition are deemed sufficient for admission to a course whose minimum period of directed study shall for full-time students be one year longer and for part time students be two years longer than that prescribed under paragraph 2(a) and (b) below. Includes: requirements; period of study durations 2. A candidate for the degree of Master of Musical Arts must have pursued in this University a course of directed study approved by the University, which is either: (a) Full-time for a period of not less than 12 months, normally 24 months: or, (b) Part-time for a period of not less than 24 months, normally 48 months. Includes: requirements after period of directed study; composition; outcomes 3. A candidate for the degree of Master of Musical Arts shall be required after the conclusion of the period of directed study: (a) To submit a composition or compositions displaying originality of imagination, creative ability, technical understanding in usage of instrumental and/or vocal and/or electro-acoustic resources, structural control and, where appropriate, calligraphic skill and accuracy with regard to notation and presentation. Submitted compositions should be worthy of public performance, and (b) To be present at a viva voce examination on this submission and to satisfy the Examiners therein. 4. The composition or compositions submitted for the degree of Master of Musical Arts should normally be the result of work done mainly while the student is registered as a candidate for that degree in this University. A certificate to this effect, countersigned by the candidate's Supervisor, shall be attached to the submission. If a substantial part of the submission was completed before registration for that degree, the certificate should declare this fact and identify the part of the work so completed. 5. For the Master of Musical Arts degree the Examiners should submit independent reports on the composition portfolio to Student Services Development (Academic Processes) or equivalent or Head of School before the viva voce examination takes place. The reports should contain a full and frank assessment of the merits and weaknesses of the composition portfolio. For more information about the role and appointment of examiners, please consult the following: Assessment 6. For the Master of Musical Arts degree the viva will test the candidate's acquaintance with the general compositional literature of the twentieth and twenty-first centuries, knowledge of the relation of the submitted composition portfolio to the wider field of which it is a part, and the respects in which the portfolio advances, modifies, or otherwise affects this wider field of compositional scholarship . 7. The Examiners may recommend to the University the following outcomes of examination: 8. Where a Master of Musical Arts composition portfolio has been resubmitted and/or a second viva voce examination has occurred, the Examiners may recommend to the University the following outcomes of examination: 9. The joint report form is forwarded by the Examiners to the Head of School and s/he shall forward the independent and joint report forms to Student Services Development (Academic Processes) or equivalent for approval by the University. Student Services Development (Academic Processes) or equivalent will inform the student of the University's decision. 10. Successful candidates will be eligible to graduate once their thesis has been uploaded to the University's etheses service and approved by the Internal Examiner or, in cases where there are two external examiners, the lead External Examiner. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}