{
    "url": "https://www.nottingham.ac.uk/qualitymanual/prog-and-mod-design-and-approval/prog-spec-guidance.aspx",
    "content": [
        {
            "p": "This page provides the regulations on programme specifications. Its content is primarily directed at staff but may also be of interest to students across all of the UK, China and Malaysia campuses. A programme specification is required for all programmes on which a student may register (including ordinary degree programmes). There is no requirement for separate programme specifications for awards granted solely due to a student not satisfactorily completing the programme they are registered on. For Postgraduate Certificates and Postgraduate Diplomas, a separate programme specification is only required if direct application is possible. Where the Certificate or Diploma is awarded to students who do not complete a master's programme, their qualifications fall under the programme specification of the corresponding master's degree. For integrated master’s programmes, there is no requirement to produce a bachelor’s degree programme specification if students are effectively 'exiting' with the bachelor’s degree after three years. A programme specification would only be required if students can transfer to a bachelor's degree programme at an earlier point, and are registered for a period before receiving their degree. The University has endorsed seven principles for good curriculum design. Schools are asked to review the principles in the Curriculum design document as they design programmes. New Programme Design Principles Specify the qualification (e.g. BA, BSc, MA and others) and the subject title (e.g. Applied Linguistics) that will be reflected on students' degree certificates and transcripts. These will appear on students’ degree certificates and transcripts in this form. In the case of bachelors' degrees, please specify whether the qualification is with honours or ordinary. Please note no two programmes can share the same name. For 2-year Masters, the title must include (2yr) appearing on the end of the title to make a clear distinction between other variations of Masters course. This will only appear on programmes of 240 credits. Where programmes are of this duration as a result of non-credit bearing placements this identifier will not appear. Please consult the following for more information on each type of qualification: Please leave blank. A UCAS or Academic Plan code will be assigned by Registry and Academic Affairs (RAA) in UNUK, Academic Services Unit (ASU) in UNNC, and Student Registry Office (SRO) in UNM once a new programme has been approved. Identify the School responsible for overall management, administration, and quality assurance of the programme. If operational responsibilities for any of these matters are delegated to other Schools, please state these schools, specify their role and the percentage of their contribution. Please also specify the campus and location for the programme. Provide information on any placement arrangements including details of the partner and whether the programme is based on an existing one. Please consult the following for further guidance on partnerships and placements: Partnerships and placements The types of programme are defined as: Please consult section 7 of the following for detailed definitions: Choose full time and/or part time. For programmes offered in both full time and part time modes, a single programme specifications will be required. The programme specification will encompass two separate descriptions of the programmes of study (part time and full time), outlining the sequence in which modules are to be undertaken in each mode. Specify the mode(s) of delivery and location(s) (including University of Nottingham Malaysia (UNM) and University of Nottingham Ningbo China (UNNC) where applicable) from the list below: Please confirm the duration of the programme (if available both full-time and part-time please provide the duration for both modes of delivery. Please indicate whether it follows a standard or non-standard start. If the programme begins on a date other than the start of the academic year, please provide the specific start date and all relevant start dates, where there is more than one date of commencement. Provide the relevant HECoS code. Please consult the following for more information about HECoS codes: Higher Education Classification of Subjects (HECoS) codes Please state the following: Please state the Quality Assurance Agency for Higher Education (QAA) subject benchmarks which are most relevant to the programme. As there are few benchmarks for postgraduate study, it may not be possible to identify a relevant benchmark for postgraduate programmes – though it could still be helpful to list a benchmark for a corresponding undergraduate programme which would normally provide entry to the postgraduate programme. For more information about lists of benchmarks, please consult the following: Benchmarks on the QAA website In addition to the above, schools need to consider QAA characteristics statements published related to the proposed qualification to ensure that the distinctive features of the proposed qualification are articulated in module and programme specifications. For information on Characteristics statements, please consult the following: Characteristic statements on the QAA website Please state the fee band for home and international students. If sections B, C, or D of the programme specification vary significantly based on the mode of delivery, consider submitting separate programme specifications for each version. Provide any information of interest to applicants including a programme outline and duration as a minimum. Specify educational aims particularly if not stated in the prospectus entry. Please provide any information you think would be of interest to applicants for this programme. As a minimum, this must be an outline of the programme. Please provide a programme level overview of how students will be taught, rather than specific details which may vary from year to year. Prospective students will also see this information. Please provide a summary of the minimum qualifications necessary to be considered for entry to the programme, including English language requirements, and any necessary skills or experience applicants must have. English Language requirements must be set at one of the five levels designated by the University, details of which are available from the Admissions Office. If the programme is only available by internal transfer from another University of Nottingham programme and is therefore not open to external applicants, then this must also be indicated. Include Disclosure and Barring Service (DBS), requirements, if applicable, and any other requirements. For more information about the University's admission requirements, please consult the following: Admissions Admissions Office Align the programme structure to the University of Nottingham Qualifications Framework. Please consult the following for more information: For each stage of the programme, please state: Whether students have any unrestricted choices of modules. In all cases: Minimum expectations for levels of teaching and learning activity Please consult the following for more information on semester dates relating to the general teaching and examination periods at the University: University calendar dates Please indicate for each module whether it can be compensated (Compensatable with a Y) or not (Non-compensatable with an N) under University’s regulations for the compensation of fail marks. Please consult the following for more information about the University's assessment and marking policies: Assessment and marking policies Please be aware of the following: Where programmes allow for students to have a free choice for a module, please ensure that additional groups are added. For additional groups, please specify how many credits (or range of credits) students must take from that group. Please also specify the timing of these additional components within the programme. For more information, please consult the following QM page: Academic regulations The programme must adhere to the University's Undergraduate and Postgraduate taught assessment regulations. All teaching and assessment must be in English, except where the subject of study is a language or literature other than English. Standard University progression regulations will apply except in the following circumstances: integrated masters' programmes; honours degrees with a compulsory year out; and between a foundation year and qualifying year. In these cases, non-standard progression regulations can apply if clearly stated in the programme specification. For integrated masters' programmes, where applied, the single allowable enhanced progression requirement is that a student must achieve a weighted average mark of at least 55% at the first attempt. Regulation 20 states that a student can proceed carrying up to 20 credits if they have not progressed by September. Programme specifications may state an opt-out if it is impossible or unwise for a student to proceed carrying credits. Possible circumstances where an exception may be permitted include: Any requests for exemption must be approved by Quality and Standards Committee (QSC) and noted in the programme specification. The standardised weighting for a bachelor’s degree must be 33/67 for Parts I and II respectively, and that the standardised weighting for an integrated master’s degree (undergraduate) must be 20/40/40 for Parts I, II and III respectively, unless exempted from this due to professional, statutory, regulatory body (PSRB)requirements. Undergraduate degree classification is based on the weighted (arithmetic) mean mark achieved over identified stages (with defined weightings given to the stages being considered). If the award of an ordinary degree is available to students not meeting honours requirements this must be stated clearly in the programme specification and an ordinary degree programme specification must be held on Campus Solutions. For more information about UG classification, compensation and borderline regulations, please consult the following: Marking and classification Please note that from 2015/2016 transfer to the ordinary degree is not allowed. The award of the ordinary degree on exit is only allowed at the UK campus and University of Nottingham Ningbo China (UNNC). Postgraduate masters, diploma and certificates will be awarded with merit to students who achieve a final credit-weighted mark of at least 60% and with distinction to students who achieve a final credit-weighted mark of at least 70%. In addition, please note the following: For more information about PGT classification, compensation and borderline regulations, please consult the following: PGT Academic Regulations Please provide here details of any additional awards made by the University, e.g. ‘Distinction in Spoken French’ and/or any named Pathways* that may be awarded. *pathways are for the purpose of the award title, not for managing programme structures or enrolments and allow for a ‘specialism’ to be added to the title on the degree, and thus where the inclusion of a Pathway(s) has been approved, the School is then responsible for updating the programme specification of the existing programme to state what criteria would need to be met to have specialism added. The award title will take the format: Subject (Pathway) for example BSc Hons Animal Science (Physiology). Please note that pathways would NOT result in being able to recruit programmes individually by specialism i.e. applications must be to the main title. Please state here the title of the award which may be given to students who fail to meet the requirements of this degree. Where the title differs from that of the main award specific approval will be required. Regulations may deviate from standard if there is a demonstrable requirement dictated by a PSRB or accrediting body. Any such requirement must be explicitly outlined in the programme specification. Students failing to satisfy the more stringent requirements outlined in programme specifications associated with a PSRB or accrediting body, yet satisfying University regulations must have the option to transfer to a named ‘fall back’ non-accredited degree. Exceptions to this rule arise only where PSRB or local government mandates prevent the award of a ‘fallback’ degree or when a suitable ‘fallback’ option is unavailable. In such instances, this information must be clearly articulated in the programme specification. Where a fallback award (Foundation Certificate, UG Certificate, UG Diploma, PG Certificate, PG Diploma) has a different title than the original programme this must be explicitly stated in the programme specification. For example, the title may differ due to lack of accreditation, or it may not be appropriate to award the title to someone of lower credit value awards. Specify any other requirements for students which are in addition to those stated in the University’s regulations and the University of Nottingham Qualifications Framework (UNQF). If the programme's total absolute maximum is less than those defined on the Maximum period from initial registration for completion of studies page, this must be explicitly stated. For more information, please consult the following: Registration, attendance and study Maximum period from initial registration for the completion of studies Learning outcomes are (relatively) general statements indicating what a student is expected to know, understand and/or be able to demonstrate at the end of a period of learning. They are phrases which complete a sentence of the form \"A student who completes this programme successfully would be expected to …\", or \"… would be able to …\". It is good practice for learning outcomes to comprise a verb, object and context. An example (from Human Development) would be \"Critically examine (verb) theoretical frameworks (object) relevant to neonatal development and adaption (context)\". All three parts are needed to make the learning outcome workable. Learning outcomes play a crucial role in the design of programmes and modules, establishing a clear connection with the content and objectives. The purpose of assessment is to enable students the opportunity to demonstrate the extent to which they have achieved the intended learning outcomes. Programme learning outcomes must align with the Quality Assurance Agency (QAA) Subject Benchmark Statement, the level descriptors in the University of Nottingham Qualifications Framework (UNQF) and any professional or statutory body requirements. Please consult the following for more information: Benchmarks on the QAA site A curriculum map, provided as part of the programme approval (or curriculum change) process, will demonstrate how module learning outcomes fulfil to the learning outcomes of the programme. It is reasonable to have up to six learning outcomes for a module, with some variability depending on the credit value of the modules (typically with less learning outcomes for smaller credit sizes), and between 12 and 16 for a programme. Some cases, may warrant additional learning outcomes, for example due to PSRB requirements etc Module learning outcomes may be specific to the module, the programme, or a combination of module and programme learning outcomes. It is advisable to minimise the reoccurrence of the same learning outcome across multiple modules. This minimises the number of learning outcomes in each module and avoids assessing the same learning outcomes multiple times. Levels of assessment required to meet learning outcomes will be checked through the approval of the curriculum map. For further information please see module specification guidance: Module Specification Guidance Learning outcomes for both programmes and modules should be written under one or both of the following two categories (other categorisations may be used where there are PSRB requirements): These are outcomes which broadly describe the subject matter of the programme or module. These are outcomes which can come under one or more of the following three sub-headings: To achieve a learning outcome within a module, it is expected that a student at a minimum, has had the opportunity to acquire the necessary knowledge and develop the required skills, ultimately passing the module. The learning outcomes listed for a programme are expected to accurately reflect the modules on which a student can expect to enrol as part of that programme. In some instances, meeting all the learning outcomes specified for a programme may be mandatory for example, due to Professional, Statutory and Regulatory Bodies (PSRB) requirements. Provide a brief summary of the teaching, learning and assessment methods used to enable these learning outcomes to be achieved and demonstrated. For example: These statements are expected to demonstrate how the programme has been structured to enable students to achieve the intended learning outcomes in terms of workload, volume and nature of assessment, programme progression and increasing intellectual demand. They are expected to be general, not specific, in nature. Please map the learning outcomes of the programme against the modules comprising the programme. The curriculum map must show that a student cannot successfully complete the programme without having acquired all the learning outcomes listed in Section D of the programme specification. This can be demonstrated by ensuring that for each learning outcome there is at least one compulsory, non-compensatable module which delivers that outcome; or that the outcome features in a range of modules, such that it would not be possible for the student to complete the programme without passing at least one of those modules. New/revised curriculum maps are required with all new and changed programme specification. A template for a curriculum map can be found here: Curriculum map This template curriculum map is provided as a guide. Where there are PSRB requirements for a different format, this may be used. For more information about the information in a programme specification document, please consult the following: Programme specification template For more information about the information in a module specification docuemtn, please consult the following: Module specification guidance If you have any problems or queries relating to Programme specification guidance, please email: ss-curriculumadvice@nottingham.ac.uk If you have any problems or queries relating to Programme specification guidance, please email: ss-curriculumadvice@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}