{
    "url": "https://www.nottingham.ac.uk/qualitymanual/prog-and-mod-design-and-approval/credit-bearing-microcredentials-design-and-approval.aspx",
    "content": [
        {
            "p": "This page contains a step-by-step guide for the introduction of a new credit bearing micro-credential. Its contents are primarily directed at staff, but they may also be of interest to students at UoNO. Schools intending to introduce a new credit bearing microcredential should first discuss their plans with UoNO. UoNO will decide whether to progress to the formal design phase. UoNO will advise Schools on the development process. If this process is successful, then with the support of UoNO Schools may complete the New Credit bearing microcredential Information Template and submit it to Curriculum Leads in Registry and Academic Affairs. New Credit bearing micro-credentials will be approved by Curriculum Leads in Registry and Academic Affairs if they are in line with the requirements for credit bearing micro-credential specifications, otherwise they will be referred for consideration on behalf of Quality and Standards Committee (QSC) to the Curriculum Approvals and Advisory Team in Registry and Academic Affairs. If revisions are required, the form will be returned to UoNO and the School with guidance on how to proceed. Schools have a duty to consult with any other schools that are likely to have a legitimate interest in the creation of the credit bearing microcredential, e.g. if the subject matter of the new credit bearing micro-credential has any overlap with provision in another School. For more information about creating a new microcredential, please consult the following: In submitting a new credit bearing microcredential for approval, the following should be considered: Includes: Registry and Academic Affairs; Campus Solutions; Curriculum Updating Schools will be provided with clear information about deadlines in advance of the curriculum updating cycle. Module information in Campus Solutions is used for relevant central processes and will be published in the Online Module Catalogue. Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}