{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pol-proofreading.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on proofreading. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. Includes: expectations Proofreading should initially be undertaken by students themselves; it can be a valuable learning experience for students to identify their own errors and inconsistencies. However, the University recognises that, in the course of producing a high-quality piece of work for assessment, students may wish to ask a third party to proofread work prior to submission. Includes: overview; roles and responsibilities of staff; exceptions; collaborative assessment Proofreading might be undertaken by peers, housemates, family members, academic members of staff and professional proofreading companies. This policy, intended for the guidance of students and staff, relates to the proofreading of any text to be submitted as part of academic coursework and projects, including dissertations and PhD theses. This policy sets out what the University considers to be appropriate with regard to proofreading and what checks should be in place when proofreading is undertaken. Exceptions Whilst mindful of the parameters of the policy set out below, appropriate members of staff may use their professional judgement to provide advice and guidance during the course of formative assessment, based on the individual needs of a student to maximise their opportunity to learn and understand what is expected of them academically. Those staff members are: 1. Dissertation or project supervisors (UG and PGT) and PGR thesis supervisors 2. Staff from Disability Support Services and Academic Support Tutors 3. English for Academic Purposes Tutors In some disciplines and for particular pieces of assessment it may not be appropriate for any proofreading to take place e.g. where correct grammar is part of the assessment criteria or assessed work submitted relating to language and translation. For example, proofreading is not acceptable for pre-sessional courses (CELE) because language proficiency is one of the key learning outcomes. Where it is inappropriate for students to have their work reviewed, Schools and Departments should make students aware of this in guidance and in advance of students undertaking the assessment, for example, if project partners are not to be permitted to proofread each other’s individual reports. The University acknowledges that some assessments require students to work closely to produce a collaborative piece of work for assessment. The content for these assignments will necessitate a process of drafting and re-drafting of content by a number of different members of the team. This process is a key part of the learning experience. In these cases, students may actively edit content of other students within the group although it is expected that, collectively, the group is bound by the expectations set out in this Policy in respect to engaging with further third parties. This exception only applies to those pieces of work that are explicitly assessed as part of a group exercise. No form of collusion should take place regarding standard individual pieces of work and when detected, such cases may be subject to referral under the processes outlined in the Academic misconduct procedure. For more information about the Academic misconduct procedure, please consult the following: Student Services - Academic misconduct procedure Includes: academic misconduct procedure; academic misconduct policy; student declaration on submission The University expects that any piece of work submitted for assessment, whether credit-bearing or not, is the student’s own work. The Academic misconduct policy provides a non-exhaustive list of examples of academic misconduct, which include: 2.1.1 Plagiarism: representing another person’s work or ideas as one’s own. For example by failing to correctly acknowledge others’ ideas and work as sources of information in an assignment, and neglecting use of quotation marks. This also applies to the use of graphical material, calculations etc. in that plagiarism is not limited to text-based sources. 2.1.2 False Authorship: where a student is not the author of the work they have submitted. This may include a student submitting the work of another student. This may also include the submission of work that has been produced (in whole or in part) by another student or third party. As it is the authorship of an assignment that is contested, there is no requirement to prove that the assignment has been purchased. 2.1.3 Collusion: cooperation in order to gain an unpermitted advantage. This may occur where students have consciously collaborated on a piece of work, in part or whole, and passed it off as their own individual efforts or where one student has authorised another to use their work, in part or whole, and to submit it as their own. Students who submit pieces of work for assessment where proofreaders have acted in a way that compromises the authenticity of that work and who have acted outside of the limitations set out in this policy will be investigated under the Academic misconduct procedure. It is the student’s responsibility to inform their proofreader of the University’s proofreading policy and to check their own piece of work prior to submission to ensure that it is in line with University policy and expectations. Students will be required to make a declaration on submission that they have acted in line with University policy and expectations for proofreading. For more information about the Academic misconduct policy and procedure, please consult the following: Academic misconduct policy Includes: policy restrictions Third-party proofreaders are not expected to actively amend existing, or create new, content in draft work; instead they should support the student by identifying errors and/or making suggestions relating to, but not creating, content. Any third party reviewing work should be familiar with this policy and agree to operate within its expectations. It is the student’s responsibility to ensure that the proofreader is aware of the Policy and no proofreading should be undertaken if the individual concerned does not agree to align their practice with the conditions detailed below. At the point of submission, students will be expected to declare whether or not they have had their work proofread and if so, indicate that the proofreader has worked within the Policy’s restrictions (set out below). The University considers it acceptable for proofreaders to: The University does not consider it acceptable practice for proofreaders to amend existing content whether through addition or reduction and, in particular, they must not: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}