{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-alt-formats-thesis-submission.aspx",
    "content": [
        {
            "p": "This page provides guidance about alternative formats of thesis submission. Its content is primarily directed at staff and students involved in the programmes indicated, across all of the UK, China and Malaysia campuses. The regulations for the degrees listed below are the same as those which govern the PhD allowing for different submission formats: 1. In the case of MPhil/PhD students in Musical Composition, assessment is by submission of a portfolio of conventionally-notated compositions - in varying genres and for varying forces - initiated and completed during the period of study. These works will be developed through regular individual consultations with the supervisor. One of the compositions should be substantial and extended in length. The portfolio must be accompanied by a written commentary illuminating the composer’s methodology, aesthetic and communicative intentions, and their detailed evaluation of the portfolio when placed alongside contemporaneous works from other composers living both in this country and abroad. The commentary must also include precise analyses of selected aspects of the submitted compositions and must demonstrate how the candidate’s development of their compositional skills can be seen within the portfolio. 2. For submissions at MPhil level, the composition portfolio should amount to 40 minutes of music with a commentary of 12,000 words. The compositions should display originality of imagination and critical awareness of current issues, a high level of creative ability, a comprehensive understanding of techniques utilising instrumental and/or vocal and/or electro-acoustic resources, a systematic understanding of structural control and coherence and, where appropriate, impeccable skill and accuracy with regard to notation and presentation (whether calligraphic or computer-processed). Submitted compositions should be worthy of performance within a professional environment. For submissions at PhD level, the composition portfolio should amount to 60 minutes of music with a commentary of 20,000 words. The compositions should display an original and imaginative contribution to contemporary music, an advanced level of creative ability, technical mastery in usage of instrumental and/or vocal and/or electro-acoustic resources, accomplished structural control and coherence and, where appropriate, impeccable skill and accuracy with regard to notation and presentation (whether calligraphic or computer-processed). Submitted compositions should be worthy of a professional standard of performance. 1. In the case of MPhil/PhD students in Creative Writing assessment is by submission of an extended and original piece of creative work and a shorter critical evaluation in which this creative work and its contexts, are discussed and analysed. The creative element could be a novel, a manuscript of poems, a collection of short stories, a play, or another form of creative output, as required by the project. 2. For submission at MPhil level the word length of the creative element section will normally be 30,000 - 40,000 words (or equivalent, depending on genre or output as agreed with thesis supervisor), with a critical component of 10,000-20,000 words. The MPhil thesis should not normally exceed 60,000 words. For submission at PhD level the word length of the creative element section will normally be 50,000 - 70,000 words (or equivalent, depending on genre or output as agreed with the supervisor). The critical component will involve a self-reflective and evaluative analysis about some aspect of the creative or research process and will normally be 15,000-30,000 words in length. This may involve any of the currently debated topics in English or Theatre Studies as they relate to the candidate's creative work: thematic or generic preoccupations, wider literary, theoretical, or poetic contexts, and so on. The PhD thesis should not normally exceed 100,000 words. 1. In the case of Drama and Performance MPhils/PhDs involving an element of practice as research assessment the thesis submission may include a performance work or works and a critical evaluation in which this performance practice is discussed and analysed. The form of the performance work will be negotiated with and approved by the supervisors but may be pilot/exploratory practice and/or a finished performance as required by the project. 2. Taking the practice element into account, for submission at MPhil level the written component should not normally exceed 40,000 words and at PhD level should not normally exceed 60,000 words. In the case of MPhil/PhD students in Translation Studies, assessment may be either through submission of a thesis (which should be not more than 100,000 words for PhD or 60,000 words for MPhil), or through a combined extended translation and thesis option. The extended translation may be of material belonging to any genre, subject to prior approval. The accompanying thesis must engage with, and contribute to the development of, translation theory. 1. For submission at MPhil level, students opting for the translation and thesis option should submit an extended translation of 10,000 - 20,000 words. The translation should be of publishable or near-publishable standard. The translation should be accompanied by a thesis of 20,000 - 40,000 words. The total word-count for thesis plus translation together must be 40,000 - 60,000 words. 2. For submission at PhD level, students opting for the translation + thesis option should submit an extended translation of 20,000 - 40,000 words. The translation should be of publishable standard. The translation should be accompanied by a thesis of 45,000 - 80,000 words. The total word-count for thesis plus translation together must be 80,000 – 100,000 words. Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}