{
    "url": "https://www.nottingham.ac.uk/qualitymanual/concerns-complaints-and-appeals/unm-unnc-student-complaints.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on student complaints and related procedures. Its content is applicable to staff and students at the China and Malaysia campuses only. Students who are studying away from their home campus, for example on exchange to another University of Nottingham campus, should refer to the complaints policy and procedure which applies to the campus where the issues they wish to raise have occurred. Includes: complaint; feedback For the purposes of this policy a student complaint, as defined by the Office of Independent Adjudicators (OIA), is \"an expression of dissatisfaction by one or more students about a university's action or lack of action, or about the service provided by or on behalf of the university.\" A student may provide feedback which will be taken into account by a school, department or service when reviewing its policies and operations, without invoking this policy. Students are encouraged to provide feedback to the appropriate school or department representative, Students’ Union, Student Staff Forum (SSF) or service provider in a prompt and constructive manner. Includes: Level 1; Level 2; Level 3; opportunity for independent review There are three Levels to the University complaints procedure: After the internal University processes have been exhausted, complainants have the opportunity to have their complaint independently reviewed by the Office of the Independent Adjudicator (OIA). This complaints procedure may only be used by an individual who is, or has been, registered as a student of the University and who is not recorded as being a leaver (or, if they are a leaver, is complaining about events that occurred before they were a leaver, within the permitted timescales). This applies to students at all University of Nottingham campuses. Applicants wishing to make a complaint should seek information regarding Admissions feedback, appeals and complaints. For more information, please consult the following: Admissions feedback, appeals and complaints In addition, please be aware that: For more information on communications with third parties, please consult the following: For more information about the student complaints procedure, please consult the following Student Services page: The Student Complaint Procedure Apprentices should refer to and use the following policy which outlines additional considerations: Apprentice Complaints Policy The subject of the complaint should relate specifically to one or more of the following, or comparable issues: Complaints relating to allegations of bullying, harassment or victimisation by members of staff are associated with the Policy of Dignity within the University and should be addressed to the Director of Human Resources. If the complaint is within the scope of the Policy of Dignity within the University and informal resolution is not appropriate then a formal investigation in accordance with the policy will be undertaken. For more information about the Policy of Dignity within the University, please consult the following: Policy of Dignity within the University Student Services will be informed that a complaint has been made and against whom (no further details will be divulged). Once the Dignity Investigation Procedure has been completed, if the student's allegations are proven, then the student may bring a Level 2 complaint relating to the impact of the behaviour on their course of study within one month of the date of the outcome letter. If a student’s complaint relates to allegations of bullying, harassment or victimisation by members of staff and to matters which are eligible for consideration under the terms of the policy on student complaints, the University reserves the right to appoint one investigating officer to consider the issues within the parameters of the published procedures for both the Policy of Dignity within the University and the Policy on student complaints. Complaints about the behaviour of students towards other students are within the scope of the University Code of Discipline for Students. For more information about this code, please consult the following: Includes: academic appeals; areas with separate complaints procedures Public Interest Disclosure Code This also applies to cases that would be better suited to consideration under the Policy on academic appeals, including: Policy on academic appeals Includes: Unacceptable Behaviour Policy; quality assurance All complaints should be treated seriously and students must not suffer any disadvantage or recrimination as a result of making a complaint in good faith. However, it is expected that students or people communicating on behalf of a student will conduct themselves responsibly and treat the process and those members of the University involved in the process with respect at all times. Where behaviour falls outside of these expectations, the University’s Unacceptable Behaviour Policy will apply. For more information, please consult the following: In all cases, it is desirable that complaints are resolved informally and quickly between the relevant parties, and that the formal process is started only if that fails. Evidence of an attempt at informal resolution will be required. In addition, please be aware of the following: Complaints form part of the University's process of quality review and improvement and are considered as providing valuable feedback rather than criticism. We will widely publicise information about procedures to students and staff, and all schools and central services are required to provide a link to them through their websites. Students will be notified early in the process if the remedy sought within the complaint is beyond the power of the University to deliver. It is important for students to note that: It is important that complaints are monitored in order to improve the student experience. The Complaints and Conduct Team will record and provide reports to indicate the nature of complaints and complainants, and resultant action. Such reports will: student_registry@nottingham.edu.my Academic-Service-Office@nottingham.edu.cn Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/apprentice-complaints-policy.pdf",
        "uk_pdf_files/code-of-discipline-010120.pdf",
        "uk_pdf_files/unacceptable-behaviour-policy.pdf"
    ]
}