{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pol-joint-hons-progs.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on the management of Joint Honours programmes. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. Includes: appointment of Joint-Honours Programme Liaison Officer The Lead School should be responsible for all aspects of the management of a Joint Honours course (although responsibility for certain aspects of the course may be delegated to a partner School with the approval of all parties). The Lead School should be responsible for ensuring that there are clear procedures for consultation and negotiation with the partner School(s) on matters affecting course structure and assessment. In relation to students who entered Qualifying year or Part I before September 2015, all Schools managing Joint Honours programs should strive for as much consistency as possible across degrees, both Single and Joint Honours, with regard to borderline classifications. Where complete consistency is impossible due to diverging expectations or demands of different disciplines, borderline conventions should be agreed in advance between the partner Schools. Where there is no such agreement between the Schools concerned, the conventions for award which should be applied in the Exam Board Meetings should be those of the Lead School. The criteria for deciding degree class for borderline Joint Honours candidates should be clearly stated, and the Lead School is responsible for ensuring that they are specified in the relevant Programme Specifications and advertised to students at the start of and during their programme of study (normally in a Student Handbook). For students entering Qualifying year or Part I from September 2015 onwards, Schools should use only the standardised weighted profiling system for determining the degree class of borderline students. A student should be given the higher class if either of the following criteria are met: i) Half or more of the final stage credits are in the higher class; ii) Half or more of the final and penultimate stage credits are in the higher class. Includes: conventions; responsibilities of the lead School Exam Board Meetings considering degree awards for Joint Honours students should be applying previously agreed and published conventions. The timing and constitution of the Board of Examiners meeting will normally be that of the Lead School (including the External Examiner(s) appointed to that School). The Lead School should be responsible for ensuring that its Exam Board is held at a time which will allow all information and marks to be available from the partner School, even if the Lead School's Exam Board takes place ahead of that of the partner School. The recommendations for Joint Honours students should then be reported to the partner Schools for information. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}