{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-doc-amusd.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Musical Arts (AMusD), including information on admissions, examinations and transferring to a doctorate. However, please note that this programme is not currently running and its details will not be applicable to any staff or students. 1. A candidate for the degree of Doctor of Musical Arts must: (a) Be a graduate of this or any other approved university holding (i) a higher degree or (ii) a Bachelor's degree with first or second class Honours; or (b) Be a graduate holding a degree awarded by the Council for National Academic Awards with first or second class Honours; or (c) Hold such other qualifications as may be deemed by the University to be the equivalent of any qualification referred to in (a) above. Includes: requirements; full time period of study; part time period of study 2. A candidate for the degree of Doctor of Musical Arts must have pursued in this University a course of directed study approved by the University, which is either (a) Full-time for a period not less than 24 months, normally 36, except: (i) That in the case of graduates of this University, by permission of Senate, a period not exceeding one year of study under similar conditions elsewhere may be regarded as equivalent to a similar period of study in this University. (ii) That candidates (other than members of the University staff) may undertake paid duties in the University if the time given thereto during term does not exceed six hours per week. Paid work outside the University may be undertaken only by permission of the Head of the School concerned; or (b) Part-time for a period of not less than 48 months, normally 72, except that the period of study shall be not less than three years if the candidate either (i) Holds an appointment within the University but is not eligible as a staff candidate under Regulation 5 of the Phd and MPhil Regulations; or (ii) Holds a lecturing appointment within an Affiliated College of the University of Nottingham. For more information about PhD and MPhil regulations, please consult the following: Regulations for the Degree of Doctor of Philosophy and Master of Philosophy Includes: requirements after conclusion of directed study; composition; outcomes 3. A candidate for the degree of Doctor of Musical Arts shall be required after the conclusion of the period of directed study: (a) To submit a composition or compositions displaying originality of imagination, a high level of creative ability, technical mastery in usage of instrumental and/or vocal and/or electro-acoustic resources, firm structural control and coherence and, where appropriate, impeccable calligraphic skill and accuracy with regard to notation and presentation. Compositions should be worthy of public performance by professional musicians within a professional environment, and (b) To be present at a viva voce examination on this submission and to satisfy the Examiners therein. 4. The composition or compositions submitted for the degree of Doctor of Musical Arts should normally be the result of work done mainly while the student is registered as a candidate for that degree in this University. A certificate to this effect, countersigned by the candidate's Supervisor, shall be attached to the submission. If a substantial part of the submission was completed before registration for that degree, the certificate should declare this fact and identify the part of the work so completed. 5. For the Doctor of Musical Arts degree the Examiners should submit independent reports on the composition portfolio to Student Services Development (Academic Processes) or equivalent or Head of School before the viva voce examination takes place. The reports should contain a full and frank assessment of the merits and weaknesses of the composition portfolio. For more information about the role and appointment of examiners, please consult the following: Assessment 6. For the Doctor of Musical Arts degree the viva will test the candidate's acquaintance with the general compositional literature of the twentieth and twenty-first centuries, knowledge of the relation of the submitted composition portfolio to the wider field of which it is a part, and the respects in which the portfolio advances, modifies, or otherwise affects this wider field of compositional scholarship . 7. The Examiners may recommend to the University the following outcomes of examination: 8. Where a Doctor of Musical Arts composition portfolio has been resubmitted and/or a second viva voce examination has occurred, the Examiners may recommend to the University the following outcomes of examination: 9. The joint report form is forwarded by the Examiners to the Head of School and s/he shall forward the independent and joint report forms to Student Services Development (Academic Processes) or equivalent for approval by the University. The Student Services Development (Academic Processes) or equivalent will inform the student of the University's decision. 10. Successful candidates will be eligible to graduate once their thesis has been uploaded to the University’s eTheses service and approved by the Internal Examiner or, in cases where there are two external examiners, the lead External Examiner. For more information, please consult the following: Nottingham eTheses Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}