{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-dvetmed-dvetsurg.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Veterinary Medicine (DVetMed) and Doctor of Veterinary Surgery (DVetSurg). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 1. A candidate for the Doctor of Veterinary Medicine or Doctor of Veterinary Surgery must: (a) be a graduate of this or any other approved university holding a Bachelor's degree (normally first or second class Honours or equivalent); (b) or such other qualifications as may be deemed by the University to be the equivalent of any qualifications referred to in (a) above; and (c) be a Member or Fellow of the Royal College of Veterinary Surgeons with a legal ability to practise veterinary medicine in the UK; or (d) hold such other qualifications as may, on the recommendation of the School, be deemed by the University to be equivalent to the qualifications referred to in (c). Includes: D24RPL - Research plan; D24RPO - Research portfolio; D24LIT - Critical appraisal of literature 3. Students are expected to complete a minimum of 120 taught credit modules taken at level 4. Module credits will be awarded in the following areas: Candidates will be given specific training by their supervisor(s) and will be required to produce a systematic research plan involving appropriate project planning, evaluation criteria and assessment methods. The project plan will be between 6,000-8,000 words and is to be submitted within the first six months of the programme. Candidates should submit a research portfolio, comprising a minimum of 20 assets, evidencing research methods training and attending a viva voce examination, satisfying examiners regarding knowledge and research methods as appropriate to the research project. Candidates will be given specific training by their supervisor(s) and will be required to produce a critical review of literature in an aspect of clinical research related to their research area. The critical review will be between 8,000-10,000 words. The minimum pass mark for the taught module component will be 50%. Includes: candidates who do not undertake or fail research thesis/portfolio 6. The degree of DVetMed or DVetSurg will be conferred on candidates who have successfully completed the taught component of the programme (including the assessed critical appraisal and research plan) and have satisfied the Examiners as to the standard of the portfolio and thesis. 7. Candidates who either do not undertake or fail the research thesis/portfolio but successfully complete part or the whole of the taught programme may be considered for the following awards: Postgraduate Certificate in Veterinary Medicine and Surgery (60 credits), Postgraduate Diploma in Veterinary Medicine (120 credits), or degree of Master of Philosophy. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}