{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/ext-circumstances.aspx",
    "content": [
        {
            "p": "This page contains the University's extenuating circumstances regulation and provides links to the relevant procedures and associated guidance. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. During the course of a student’s degree programme, they might be faced with exceptional personal, medical or family problems and/or difficult and distressing events that are outside their control and that negatively affect their ability to take assessments and their academic performance. Such problems are known as 'extenuating circumstances'. Extenuating circumstances are situations or events that meet all of the following criteria: The extenuating circumstances regulation and associated procedures provides mechanisms by which students may bring extenuating circumstances to the attention of the University and allow for the consideration of the impact of those extenuating circumstances on their academic performance and the provision of measures to address the impact, where possible and appropriate. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. Where there are differences in regulation due to campus regulatory environment, these will be indicated. The regulation will be applied by the campus where the affected module is being taken. If a student believes that their circumstances are affecting their ability to study, prepare or participate in assessments, then it is the student’s responsibility to let University staff know about those circumstances in a timely manner. The University is committed to supporting its students and will seek to take account of extenuating circumstances where it is possible and appropriate to do so, and when they are informed in a timely manner. For the purpose of extenuating circumstances, assessments are either an exam or coursework. Ultimately the decision which type an assessment is for extenuating circumstances purposes is for the School/Department to decide and to inform students (usually via the module handbook). This coursework/exam distinction is important as it impacts the timeline for the extenuating circumstances claim and the possible outcomes. 4.1.1 The following gives guidance and examples of the types of circumstances and whether they might be considered as good cause for non-compliance with an assessment requirement or for missing teaching or required study. This is given without prejudice and for general guidance; it is not exhaustive, definitive or prescriptive. 4.1.2 In general terms the extenuating circumstances regulation and procedures are intended to support students with circumstances that meet all the criteria in Clause 2 above. This should be used sparingly by students to address only those circumstances where there is significant impact. 4.1.3 Normally students would not be expected to submit multiple extenuating circumstances claims for the same assessment. Where they do, the previous outcomes would be cumulatively taken into account in determining the new outcome, which may include rejecting the claim. 4.1.4 Where a student has suffered from a series of discrete short-term illnesses resulting in multiple extenuating circumstances claims, a meeting should be arranged with the Personal Tutor and Support and Wellbeing Officer (UNUK) or School Senior Tutor (UNNC) (or other appropriate staff member, e.g. PGR supervisors or SPSA) to consider the support options available, including the possibility of a voluntary interruption to study. For more information, please consult the following: Voluntary interruption of study 4.1.5 Extenuating circumstances would normally be limited to within one semester. A pragmatic approach with due regard for proportionality should be taken in this regard. Chronic conditions of the student would not be considered acceptable exceptional circumstances and the student should be advised to review the Policy on long-term conditions or disabilities affecting students' ability to study and complete assessments so that appropriate support for study or individual arrangements for examinations can be put in place. It may sometimes be necessary for a student to consider the possibility of voluntarily interrupting their studies until the circumstances have been resolved. Policy on long-term conditions or disabilities affecting students' ability to study and complete assessments 4.1.6 The University considers each claim of extenuating circumstances on its own merits, as an individual case and according to the relevant regulation and procedures. 4.1.7 The following table of examples of the kind of acceptable and unacceptable circumstances are given without prejudice and for general guidance; it is not exhaustive, definitive or prescriptive: Due regard should be given to the reasonableness and proportionality of the outcome in determining what are and are not acceptable circumstances. This is usually illness that spans more than 5 working days. However, sometimes an acute illness would warrant an exceptional circumstance (for coursework and/or exams). This includes students who have has a late diagnosis of a disability or long-term medical condition. Short-term illness are not normally acceptable circumstances with regards coursework, where the student is given a number of weeks/months to complete and submit such work. However, the precise circumstances and timing of events will be relevant. If you have recently had an accident, injury or are experiencing a short-term health condition (for the first time), you may be in a position to request a short-term adjustment for your upcoming in-person exams (e.g. a scribe if you have broken your hand, or more time/rest breaks). The claim should make clear the nature of the relationship between the student and the affected relative and how the student’s ability to study has been impacted. This would normally only include close relatives (i.e. parents, siblings) but, with that concept in mind, it should be recognised that family structures vary. These would usually be a short-term condition. However, where the circumstances are external to the student and extend over more than one semester, such as chronic illness of a relative, it may be appropriate to accept the same circumstances for a longer period than one semester if it is not appropriate for the student to voluntarily interrupt their studies. In such circumstances the student must discuss the situation with their School/Department and submit an extenuating circumstances form each semester to ensure that appropriate account is taken of the circumstances and appropriate support can be offered to the student. This relates to the period of an e-exam only (not for coursework or exam revision). This applies whether the exam is undertaken online remotely or on UoN facilities. Evidence will always be required. For e-exams, loss or corruption of files is not an acceptable extenuating circumstance. It is the student's responsibility to ensure that all work which is electronically stored, generated and/or submitted is sufficiently backed up, including backing up drafts of the work to the cloud or external sources. For assessed coursework (or exam revision), loss or corruption of files is not an acceptable extenuating circumstance. It is the student's responsibility to ensure that all work which is electronically stored, generated and/or submitted is sufficiently backed up, including backing up drafts of the work to the cloud or external sources. Please note, fathers are permitted to request extenuating circumstances for paternity leave. A student who is asked to undertake jury service that would affect their ability to meet any of the requirements of their programme should make a request to the Court for the Jury Service to be deferred. Only where the Court has refused such a deferral will Jury Service be considered as an acceptable extenuating circumstance. It is expected that students will ensure that any paid employment or voluntary work does not interfere with their ability to engage with their studies or assessments. It should be noted that examinations may be scheduled to take place on Saturdays during the published examination periods. The University has guidance for students undertaking employment or other activities during their studies. If a student has completed the Religious Observance Form by the published deadline and it has not been possible to make alternative arrangements centrally, the School/Department should take reasonable steps to provide an alternative assessment opportunity. Where this is not possible, the School/Department may consider a claim under this policy. Students may submit extenuating circumstance claims in respect of performance in assessments affected by symptoms attributable to religious observance (e.g. Ramadan). Absence from an assessment for reason of religious observance, where no Religious Observance Form has been completed, or where the relevant permission for absence has not been obtained prior to the assessment, will not be deemed an acceptable extenuating circumstance. It is not normally possible for the circumstance to have arisen more than 12 months before the affected assessment for a claim to be made under this regulation. Matters which extend over 12 months would need to claim under the Policy on long-term conditions or disabilities affecting students' ability to study and complete assessments so that appropriate support for study or individual arrangements for examinations can be put in place. Extenuating circumstance claims with evidence have a broader range of outcomes available to them than those without evidence. Also, some assessments are not allowed to have extenuating circumstances claims without evidence. Schools/Departments will notify students (e.g. via the module handbook) which assessments these are. Students studying on the UNM or UNNC campuses (whether full time or as an exchange student) are not permitted to have extenuating circumstances without evidence, whether exam or coursework, due to local regulations. Not applicable to circumstances relating to modules being undertaken at the UNM or UNNC campuses. Where a student is prevented from attending an individual summative examination due to circumstances which meet all of the criteria set out in the Extenuating Circumstances Regulation (Clause 2), they may use self-certification if they are unable to provide any other form of evidence. For clarity, this policy is intended for use by students who, unexpectedly, are unable to attend an examination due to short-term, acute circumstances e.g. a migraine or sickness and diarrhoea, and who are unable to obtain medical evidence of this. If a student wishes to give advance notice of their inability to sit an examination, evidence will be required for this as part of their EC claim. Self-certification is only available for individual, summative, in person examinations; it will not be accepted for: Students may self-certificate absence from an examination(s) for a maximum of 2 consecutive calendar days in an examination period, using the extenuating circumstances (EC) claim form. For absence of more than two consecutive calendar days, or for a further EC claim in the same examination period, medical or other evidence is required. The only potential outcome available in the event of a self-certificated absence claim is a further attempt at the assessment. That is, student who are absent from an examination and who self-certify will be required to undertake the examination at the next scheduled time the examination is run, normally in the August/September ‘re-sit’ period. The student will be offered a further attempt on the same basis as the missed assessment i.e. if a first sit attempt assessment was missed, a further first attempt will be offered, if a reassessment was missed, a further reassessment attempt will be offered. Bespoke examinations to facilitate progression, graduation etc. will not be scheduled i.e. there will be no opportunity to take reassessments outside the next scheduled period. Normally, the further attempt will be in the format of an examination, however, a different form of re-assessment to assess whether the learning outcomes are achieved, as determined by the School/Department, may be recommended if the same or equivalent of the original is no longer possible. Self-certified assessments are not eligible for discounting by Examination Boards for the purposes of calculating either module marks or degree classifications. Students should be aware that if they self-certify their absence from a reassessment examination, they may be prevented from progressing to the next stage of study, if the progression requirements of the course have not been met. Subject to the progression requirements of the course, some students may be able to proceed to the next stage of study, carrying the outstanding assessment but, if not, they will have to interrupt their studies until the next scheduled assessment opportunity. Registry and Academic Affairs will notify students of the impact of their non-attendance on progression after the meeting of the relevant progression or classification Examination Board. Schools may allow students to self-certify for other individual, summative assessments that are either e-exams or exams for extenuating circumstances purposes (see §xxxxx) for a maximum of 2 consecutive calendar days. Only assessments where a first sit opportunity exists may be eligible. Assessments where self-certification is permitted should be clearly indicated via Moodle/Course handbook. A School must robustly monitor attendance such that self-certification is only allowed for non-attendance at assessments. A student may not self-certify for an e-exam that they have viewed. When self-certifying absence, all students should read and understand the implications of the University’s Maximum period from initial registration which sets out that stages of study must be completed within a prescribed timeframe. For more information about the Maximum period from initial registration, please consult the following: Maximum period from initial registration for completion of studies The University reserves the right to review the use of self-certification by students and to require evidence for multiple and frequent use of self-certification, for example, more than twice in an academic session (year). The University holds a reasonable expectation that students will only self-certify their absence from assessments when prevented from attending by circumstances that align with acceptable exceptional circumstances. Claims which are believed to give fraudulent reasons for absence from the assessment will be investigated under the Academic Misconduct regulation. Where a student experiences circumstances which meet all of the criteria set out in the extenuating circumstances regulation (Clause 2) but where evidence is not available, and if the School/Department permits for that assessment, an extenuating circumstance claim may be made without evidence to extend a coursework deadline. Schools/Departments need to inform students if `no evidence’ extensions are not permitted (for example via module handbooks). It is possible for some assessments in a School/Department to be eligible for `no evidence’ extensions and not others. Unlike a ‘grace period’ there must be an associated circumstance and short term no evidence extension requests may be declined if the circumstances are not considered acceptable. (further explanation of acceptable and unacceptable circumstances can be found in section 4.1.7 above. The only outcome available in these circumstances is an extension of up to five working days.The extension request should align with the time impacted (e.g. if impacted for 2 working days, then the extension request should not be for more than 2 working days). If a student requires a different outcome, for example a longer extension, then evidence will be required for this as part of their extenuating circumstance claim. It is not possible to request a short term no evidence extension to add extra time onto an already upheld evidenced extension. If a second circumstance has occurred following an evidenced extension, then a further extenuating circumstance request can be made and it would require evidence (noting the circumstances around lengths of extensions in coursework outcomes 2 and 3). It is possible to request an evidenced extension after a short term no evidence extension, for example if the reason turned out to be taking longer to resolve than originally expected or if a second circumstance had occurred. If the request was upheld, the duration of the short term no evidence extension already granted, would be taken into account (for example, if outcome 2 were decided on then the no evidence extension duration plus the evidenced extension duration would not be more than 15 working days). Coursework assessments with ‘no evidence’ extensions are not eligible for discounting by examination boards for the purposes of calculating either module marks or degree classifications. The University reserves the right to review the use of ‘no evidence’ extensions by students and to require evidence for multiple and frequent use of ‘no evidence’ extensions, for example, more than twice in an academic session (year). The University holds a reasonable expectation that students will only use ‘no evidence’ extensions for coursework assessments when prevented from attending by circumstances that align with acceptable exceptional circumstances (see section 4.1.7 above for more guidance). Claims which are believed to give fraudulent reasons will be investigated under the Academic Misconduct regulation and procedure. Academic misconduct regulations 4.3.1 Independent, reliable documentary evidence is normally required to accompany an extenuating circumstance claim. The exceptions are: 4.3.2 The burden of proof to support a claim lies with the student at all times. 4.3.3 Evidence presented by students must meet the following standards and should: (a) Where written by appropriately qualified professionals who are independent of the student, be on headed paper and signed and dated by the author. Evidence presented by email may be acceptable if the email has been sent by the author from the official domain name of the author's organisation. Students should note that the Cripps Health Centre and the University Counselling Service in the UK or UNNC Health and Wellbeing Centre will be unlikely to provide such confirmation if the student has had no engagement with the service(s) prior to the affected assessment(s). (b) Confirm specifically that the circumstances were witnessed on the relevant date as opposed to being reported retrospectively. Evidence reported by the author as being informed retrospectively about the circumstances will not be acceptable evidence. (c) Be in English. It is the student's responsibility to provide supporting documentation and any translation should be undertaken by an accredited translator (e.g. be a member of the Association of Translation Companies (UNUK), or an accredited translator from a qualified translation institution (UNNC). Any associated costs must be met by the student. (d) Be unaltered by the student. Documentation that has been amended for any reason will be deemed inadmissible by the University and may be subject to investigation under the Academic Misconduct Procedure (UNUK, UNM, UNNC). 4.3.4 Schools/Departments could also consider evidence supplied by other members of staff known to the student, for example, Personal Tutors, Support and Wellbeing Officers or Hall Wardens. It is not possible for University staff to give evidence for medical conditions. People in these roles should only provide supporting evidence if: 4.3.5 The University reserves the right to take such steps as are deemed necessary to verify the evidence submitted, without prior notification. Where the University is unable to authenticate the material to its satisfaction, the claim may not be accepted. The University reserves the right to request sight of original documents, if necessary. If there is evidence that a student has fraudulently presented documentation to the University the matter will usually be referred for consideration under the University’s Academic Misconduct regulations (UNUK, UNM, UNNC). 4.3.6 The following table offers examples of the associated evidence that is normally required to accompany acceptable circumstances (noting the exceptions in clause 4.3.1). These are given without prejudice and for general guidance; it is not exhaustive, definitive, or prescriptive. Due regard should be given to the reasonableness and proportionality of the outcome in determining what is and is not acceptable evidence. Printouts from the NHS app which attest to the circumstances claimed in the form. Where possible, a letter from an appropriate medical professional or statement from the University Counselling Service (or equivalent) confirming the nature of the illness and the likely impact it is having on the student's ability to undertake formal assessment and/or study. This includes medical certificates supplied by online doctors, provided that they are UK based and CQC-regulated. China specific requirements: A letter of medical diagnosis issued by appropriate medical professional at AA or AA+ hospital in China (or equivalent) or statement from the UNNC Health and Wellbeing Centre confirming the nature of the illness and the likely impact it is having on the student’s ability to undertake formal assessment and/or study. The diagnosis letter should be issued in letterhead and stamped by the hospital as deemed official. Medical certificates supplied by online doctors are not acceptable. Discharge notes. A medical letter/certificate from the relevant hospital confirming the nature of the student's circumstances. Letter of appointment for a specialist consultation, investigation or outpatient treatment. Students should not need to visit a Health Centre to provide medical certification when they have an obvious physical injury. Corroboration, such as a note from a hospital casualty department, or from a tutor who has seen the injury, would normally be sufficient. Examples of obvious physical injury could include plaster casts or metal pins supporting broken bones. A discharge report issued by appropriate medical professional at AA or AA+ hospital in China (or equivalent) confirming the nature of the student’s circumstances , the period of hospitalisation and likely impact it may have on the student’s ability to undertake formal assessment and/or study. The discharge report issued in letterhead and stamped by the hospital as deemed official. Aforementioned China specific requirements would apply. A death certificate or a letter confirming the death from an independent person (usually not a family member) Evidence from a hospital Family Bereavement Centre, or equivalent. Where these are not available, an order of service from the funeral. Screen shots of the issue which demonstrate the timing and the longevity of the issue. Where relevant, a statement of disrupted service from an internet provider. If extenuating circumstance panels require further information, please contact the counselling service directly. It is unlikely that evidence will be given if there has been limited or no recent engagement with the service. Where the impact of the crime has led to a medical or other professional consultation, an original medical certificate or letter from an appropriate medical professional or a letter from the University Counselling Service (or equivalent) confirming the likely impact the reported crime had/is having on the student's ability to undertake formal assessment and/or study. The full range of recommendations open to a Panel are detailed below. An extenuating circumstances panel cannot change marks; marks or classifications can only be altered by reassessment or the setting aside of a module or element of a module when computing a mark or classification. Panels should always first consider allowing a student an additional attempt as opposed to disregarding of elements or modules, making this latter recommendation only when additional attempts are not possible or are undesirable. If a student’s Extenuating Circumstance claim for an exam is upheld, the extenuating circumstance outcome awarded will not be optional. That is, if the student is granted another attempt at that assessment, the student will need to take that assessment as the original (affected) assessment will not be marked or the mark not released to the student. If the student does not undertake the additional attempt granted by the extenuating circumsntances request, they would be given zero for non-attendance at the exam. Students will need to decide before submitting the extenuating circumstance claim whether they have been impacted. It will not normally be possible to decide on an outcome after assessment marks are released, and such circumstances would require an exceptional case to QSC for approval. If a student has made multiple extenuating circumstances claims, or perhaps extended study for other reasons (e.g. Voluntary Interruption of Study), a further extension or attempt at an examination may take the student over the maximum period for stage or registration. In such circumstances the extenuating circumstances panel must submit an Exceptional Case to the Quality and Standards Committee to seek an extension to the stage or registration (as appropriate) prior to sending a decision to the student for the extenuating circumstances claim. The panel will need to consider currency of learning, previous extensions and impact on the student in making the case. If this is approved, then a decision on the extenuating circumstance can be sent to the student. An extenuating circumstances panel may not make a recommendation which would change a penalty for academic misconduct imposed by a School, Department or an Academic Misconduct Committee e.g., a first sit cannot be offered for an assessment for which a penalty has been imposed. If an extenuating circumstances panel makes a recommendation before the academic misconduct is detected, the academic misconduct finding will void a recommendation made by an extenuating circumstances panel. Panels can determine one of the outcomes below: 1. The claim is not approved: i. because the grounds are not acceptable within the University’s extenuating circumstances regulation. ii. due to insufficient evidence. This would include, for example, evidence that does not cover the relevant period; is not from an approved source; is insufficient to support the claim of seriousness of impact, or is not provided within the required timeframe iii. an extension or further attempt would take the student over the maximum period for stage or from initial registration, and an extension to this has not been approved. 2. Where a School/Department permits for a given assessment, the claim is approved without evidence, because there are sufficient grounds for believing that the student’s ability to study and/or perform in the relevant assessment(s) has been adversely affected. 3. The claim is approved, and sufficient evidence has been provided, because there are sufficient grounds for believing that the student’s ability to study and/or perform in the relevant assessment(s) has been adversely affected. For students in their final year of study who have attempted and passed an assessment but have made a claim on the basis of affected performance, Schools/Departments may also list the following outcome: 4. The claim is provisionally approved, and sufficient evidence has been provided, but a final decision on the outcome and any recommendations will be deferred to a meeting of the extenuating circumstances panel at the end of the academic session when the full impact can be assessed. If approved, the extenuating circumstances panel may make one or more of the following recommendations to the relevant Board of Examiners: For Undergraduate students, Postgraduate students on taught programmes and Postgraduate Research students undertaking taught modules: Recommendations for coursework: 1. Where the extenuating circumstances claim does not include evidence, and if permitted by the School/Department for the given assessment, grant an extension to the deadline set for a submission of up to 5 working days, taking into account other deadlines that the student has to meet. Students should be informed of any change to the timescale for the return of coursework and associated feedback in accordance with the Policy on Feedback to Students. Policy on Feedback to students 2. Where the extenuating circumstances claim includes sufficient evidence, grant an extension to the deadline set for a submission of up to 15 working days, taking into account other deadlines that the student has to meet. This should consider any support plan extensions for the same piece of work. The two would be additive where the circumstances were distinct and where the timelines of the circumstances warranted this. If that coursework has had previous extenuating circumstance extensions, the extenuating circumstances panels should take those into account (i.e. extensions on the same assignment would usually get progressively shorter). Students should be informed of any change to the timescale for the return of coursework and associated feedback in accordance with the Policy on Feedback to Students. 3a. A student needing more than 15 working days of extension (due to an extenuating circumstance claim) is regarded as having been subject to serious circumstances that have impacted their work. To avoid on-going disruption to their studies, they will be required to submit their work in the resit period (or the School equivalent of this). 3b. For a student needing more than 15 working days of extension (due to an EC claim) AND where a new assignment is required in the reassessment period, the panel may grant a first sit oppertunity. The options available for both coursework and exams below are also available. For exams: 4a. For self-certification (i.e. without evidence) in the case of a first attempt, the only outcome available is to allow a further attempt as an equivalent sit for which the mark gained will, subject to section 4(d) of the Assessment Regulations and relevant Progression regulations (with or without attendance), count as the student’s first mark and therefore towards an award if relevant in the affected assessment(s). Note, the original assessment will not be marked/mark not released. To not attend the further assessment would result in a mark of zero. Assessment regulations 4b. For self-certification (i.e. without evidence) in the case of a reassessment, the only outcome available is to allow an additional attempt at the examination or coursework (at the same or equivalent assessment), in accordance with the relevant Progression regulations (with or without attendance). 5a. For claims for short-term adjustments, grant a short-term arrangement that will be put in place for any in-person exams for the next assessment period (the outcome letter should expand on what this arrangement is). This is a temporary arrangement that will expire at the end of this assessment period. 5b. For claims for short-term adjustments, where there is insufficient time to make the arrangement for this assessment period, grant the student more time and/or rest breaks for any in-person exams for the next assessment period (the outcome letter should expand on what this arrangement is). This is a temporary arrangement that will expire at the end of this assessment period. 5c. For claims for short-term adjustments, where there is insufficient time to make the arrangement for this assessment period, both of the above outcomes (clauses 1a and 1b) are available. 6. For extenuating circumstance claims for exams with sufficient evidence, both of the above outcomes (clauses 1a and 1b) are available plus all of the outcomes listed below. The options available for both coursework and exams below are also available. For coursework and exams 7. Recommend a different form of re-assessment, as determined by the School/Department, if the same or equivalent of the original is no longer possible, to assess whether the learning outcomes are achieved. Students have no automatic right to individual assessment of this nature. Approval from QSC will be required if this is outside regulation. 8. Disregard an element of a module assessment and re-compute module mark based on completed components subject to regulation 6 of the Assessment Regulations (subject to PSRB requirements). 9. Offer the student a repeat period of study and assessment (for which tuition fees will be payable) subject to this being an option supported by any sponsor, immigration legislation or legal obligation and to the University’s policy on Maximum Period from Initial Registration. Student status changes and implications for your student visa 10. In the case of final year students (this includes the taught stage for PGT students) when a further attempt at the assessment has not been possible before the relevant Examination Board is due to meet, disregard marks for specific affected module(s) to a maximum of 20 total credits across affected modules in computing the classification or credit weighted average for the final stage, subject to the provisions of the Regulations for Undergraduate, Taught Masters, Postgraduate Diploma and Postgraduate Certificate courses. Whilst a first attempt at the assessment must usually have been made for this option to be recommended, Section 6a of the Assessment Regulations should be taken into consideration at this point. The recommendation may only be applied at the end of the final year once the full marks profile is available, and is subject to PSRB requirements. If a further first attempt has been offered earlier in the year as a result of an extenuating circumstances claim and it has not been possible for the student to undertake the assessment before the meeting of the Examination Board, the application of this recommendation may still be considered. Academic regulations 11. When a student has experienced circumstances affecting their ability to study/take assessments in their final year of study, such that their final year performance is deemed unrepresentative of their academic profile, recommend that a case be made to QSC to for the purposes of recommending a degree classification outside regulations based on performance in earlier years. This recommendation should only be used in exceptional circumstances for cases where there is no prospect of the student undertaking first attempts within a reasonable period of time, for example, in the case of chronic or terminal illness of the student or the dependent of a student. Where options 5, 6, 7 or 8 have been applied no further consideration of the circumstances will take place at an Examination Board. For instance, where the School has offered a first attempt but the student does not take that opportunity, the circumstances will not be taken into account at the final Examination Board. For Postgraduate Research students at any stage of study the extenuating circumstances panel may: either (a) Grant an extension to the date set for the submission of the Progression Review report or (b) Grant an extension to the date set for the progression review meeting (c) If circumstances occur that mean the progression review meeting cannot be completed, permit the PGR to undertake a further Progression Review as a First Sit. Extenuating circumstances panels may also or alternatively make recommendations in response to an extenuating circumstances claim. Recommendations may include, but are not limited to: Should a student fail to seek appropriate support following a recommendation from an extenuating circumstances panel, further claims made due to similar circumstances may be rejected. Where students have a further attempt at an assessment for to an upheld extenuating circumstance, Schools/Departments can make a case to QSC to request a different form of re-assessment to assess whether the learning outcomes are achieved if the same or equivalent of the original is no longer possible. Where the conditions for a claim for Extenuating Circumstances no longer exist (e.g., cancelled jury service, recovery from illness or injury), or a student believes their performance in the assessment for which they requested the EC would no longer be strongly impacted, it is possible in some cases for the student to withdraw their EC claim, subject to the following conditions. These apply whether or not the student has received an outcome for the EC claim. No EC claim may be withdrawn after the mark for that assessment has been released to the student. An EC claim that is subject to Academic Misconduct investigation may not be withdrawn. All coursework EC claims may be withdrawn prior to the original coursework deadline. If a coursework EC claim is withdrawn, the usual lateness penalties will apply where the coursework is handed in after the original deadline. All Exam EC claims may be withdrawn prior to the scheduled time of the Examination. An Exam EC claim may also be withdrawn up to 5 working days after the Exam, provided the mark has not been released to the student. Requests to withdraw EC claims should be submitted via the ‘Ask a question’ option in the Student Enquiry Centre portal. Policy on circumstances affecting students' ability to study and complete assessments Extenuating Circumstances procedure Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/student-pregnancy-maternity-guidance-for-staff-and-students.pdf",
        "uk_pdf_files/student-pregnancy-maternity-guidance-for-staff-and-students.pdf"
    ]
}