{
    "url": "https://www.nottingham.ac.uk/qualitymanual/studies-away-from-university/partnerships-and-placements.aspx",
    "content": [
        {
            "p": "This page provides guidance on different types of partnership arrangements, as well as the University's guidelines on placement learning. This information is relevant to staff and students across all of the UK, China and Malaysia campuses and may also be of interest to external partners. The University of Nottingham’s guidelines for the approval of collaborative provision arrangements have been drafted to align with relevant guidance provided by the Quality Assurance Agency. For more detailed information, please consult the relevant page of the QAA website in Section 5 below. The sections \"Approval of partnership arrangements\" to \"Types of collaboration\" (below) only apply to partnerships leading to the award of a University of Nottingham qualification as set out in the University of Nottingham Qualifications Framework (UNQF). For more information about the UNQF, please consult the link below. For information about other types of partnership, please see the section entitled \"Partnerships not leading to a University of Nottingham qualification\" further down this page. For all partnership arrangements (as opposed to placement learning opportunities), a Memorandum of Agreement (MoA) must be signed on behalf of the University by an authorised member of University Executive Board (UEB) on behalf of Education and Student Experience Committee (ESEC) or (in regard to relevant postgraduate agreements) by Research and Graduate Services. Teaching collaborations with other institutions must follow University of Nottingham procedures and approvals to ensure they meet quality standards, regulatory requirements and diligence checks as outlined within the Quality Manual. We will endeavour to conclude agreements so that all campuses are included. The following types of collaboration constitute an exhaustive list and no other types of collaboration leading to a University of Nottingham qualification (that is to say, franchises and validations) will be permitted. This section applies to teaching-related partnerships that use the University of Nottingham brand but which do not involve the award of a qualification listed in the University of Nottingham Qualifications Framework (UNQF). see below for link. Such partnerships must have a Memorandum of Agreement (MoA) or other contractual document that follows the normal MoA template in all relevant matters, must involve consultation by way of Partnership Operational meetings if University of Nottingham student status is being granted to participants in the partnership, and be approved as follows: Any other partnerships of this type not leading to the award of a University of Nottingham qualification, and not covered above, must be referred to the Quality and Standards team for consideration of the most appropriate signatory. The University of Nottingham’s policy for placement learning is intended to be sufficiently broad to cover all types of work-based or study-based arrangements at the University and outlines the minimum requirements which schools and professional services are expected to meet in arrangements for exchange or placement learning. It is not intended to cover learning outside the University which is not a planned part of a programme of study, such as voluntary placements, part-time, term-time and vacation work which students have arranged for themselves. For more information about such activities, please consult the Careers and Employability Service using the link below. Within the University of Nottingham there are several different types of placement learning for students on undergraduate and postgraduate taught courses. These are: Where students participate in periods of study abroad at another educational institution which result in the award of marks and credit by the partner institution, the University undertakes to provide arrangements for the consistent transfer of credit and marks to Nottingham for the purpose of calculating final degrees. This will ensure that students on international exchanges are neither advantaged nor disadvantaged in relation to peers remaining in Nottingham. For more information, please consult the Credit and Grade Transfer Policy (linked below) A list of live and historical partnerships is maintained on the Collaborative Provision Register (hosted on Workspace), and linked to below. Schools must inform students of their responsibilities: Schools must inform students of their rights: Schools have a responsibility to ensure that the needs of students who have a disability and who are participating in exchanges or placements are considered to departure and that appropriate support is available before, during and after their placements. Schools must be able to assure themselves that placement providers and partner institutions know what their responsibilities are during the period of exchange or placement learning including their roles in providing appropriate learning opportunities, the assessment of students and the health and safety of students. Placement providers and partner institutions must also be informed of the mechanism for making complaints. The University has a three-stage approach to approval and review of teaching partnerships and formulation of Memoranda of Agreement (MoA) as follows: Approval of all partners and partnerships is subject to support being received from the relevant Head of School(s) and, in the case of partnerships involving University of Nottingham Malaysia (UNM) or University of Nottingham Ningbo China (UNNC), the relevant Vice-Provost(s) for Teaching and Learning. If certain criteria are met, the approval of the partner will be automatic. For all other cases within the UK, the approval of the partner must be given by the relevant Associate Pro-Vice Chancellor (APVC). For partnerships involving only an international campus, the role of APVC will be undertaken by an equivalent representative (on that campus) in consultation with the Vice-Provost for Teaching and Learning and the International Partnerships team in the UK. This approval will be granted on the basis of consideration of a Partnership Concept Paper (PCP) prepared by the International Partnerships team and/or the relevant school. The depth of scrutiny involved in approval of the basis for the partnership will vary depending on the type of partnership and whether it was necessary for a Partnership Concept Paper (PCP) to be considered. Please be aware that templates already exist for standard regulatory, quality assurance, administrative, financial and legal arrangements for each of the types of partnerships. Following consultation at the Partnerships Operational meeting, Student Services Development (Academic Processes) will provide the Memorandum of Agreement (MoA) with a commentary containing background information about the proposed arrangement, as well as any supporting documentation, to a relevant representative of Quality and Standards Committee (QSC). If satisfied, the QSC member will: If substantial quality and standards issues are deemed to exist, the member of QSC may choose to refer the matter to the whole committee. Once a recommendation to approve the MoA has been made by QSC, the International Partnerships team will arrange for the signing of international MoAs and another relevant professional service (for example, either Research and Graduate Services or Research and Innovation) will undertake this role in the case of UK MoAs. For more information about QSC, please consult the Quality and Standards Committee page linked below. Partnership programmes are subject to annual monitoring and Periodic Assurance and Continous Enhancement Reviews (PACERs) in the same manner as the University’s other programmes. In addition, the partnership is subject to review whenever a Memorandum of Agreement (MoA) requires renewal (the maximum period for an MoA is five years). For MoAs lasting less than three years, a renewal review is not needed if the initial approval or a review has occurred within the last three years. Further information about renewal reviews for MoAs is available from the Teaching Partnership Handbook. For more information about our monitoring processes, please consult the Programme monitoring and review (linked below) Resources have been made available to help staff with setting up and obtaining approval for exchange programmes and placements, including the Student Services Documentation Hub, an area of Workspace and the University of Nottingham Safety Office – Placements webpage. This covers the considerations to be taken into account when establishing a new exchange or placement, including the need to undertake a risk assessment for the potential exchange or placement at the outset and ensure the school can provide appropriate support and information for the assistance of students planning to undertake an exchange or placement. To access the Partnership development Workspace, please use the following link (entering your university username and password when prompted): For more information about placement considerations, please consult the Safety Office Website, Placements section (see link below) Schools must ensure that appropriate internal mechanisms are in place to monitor and evaluate placement providers and partner institutions and the learning opportunities offered. These due diligence procedures will be proportionate to the complexity and volume of the exchange or placement provision being offered. Students who undertake a UK based placement off campus during their studies will be hosted by a placement provider, e.g. the NHS for health sciences students. Students on placement are expected to adhere to the policies and practices of their host organisation and the requirements of workplace based assessments, including specified working days and working hours. As part of pre-placement preparation within Schools and at the placement provider, students will be advised on Equality, Diversity and Inclusion issues within the workplace, legal requirements of the placement provider and issues around the dignity of the customer/patient. Students undertaking placement work overseas will also receive preparation on the cultural expectations and differences in the host environment. Students are strongly advised to make themselves aware of the different cultural context in which they will be required to undertake their learning, assessment or research. Students wishing to request an adjustment to their placement on religious grounds must contact their home School at the earliest possible opportunity, and prior to the start of the placement, to discuss this. It will then be for the home School to assess and approve any adjustment and to liaise with the placement provider as necessary. The placement provider will take account of business needs and current policies and practices in reaching a decision and it cannot be assumed that the placement provider will grant permission. In some cases it will not be possible, due to legitimate reasons, for a religious observance request to be granted yet still necessary for a student to continue in the placement or with other work related learning. Schools must include information about exchange or placement learning in their programme specifications for relevant courses. This must include intended learning outcomes (which must be related to the programme learning outcomes) monitoring and review procedures and methods of assessment. The school must consider whether any assessment of exchange or placement learning is covered by their arrangements for internal moderation and external examining and whether the standards which are applied to any assessment of exchange or placement learning are consistent with available subject benchmarks and other relevant reference points and, where appropriate, fulfil professional or regulatory body requirements. Agreements with placement providers and partner institutions must also include information on requirements (academic or otherwise) for passing the placement, and consequences of failure. Where the exchange or placement learning is replacing learning that would otherwise take place within the University, schools must ensure that by the end of their studies the students will have achieved the learning outcomes set out in the relevant programme specification. It is therefore necessary for schools to assure themselves that the choice of subjects taken during the exchange or placement enables the integrity of the programme to be maintained as well as ensuring that the level and volume of study and the assessment of it warrants the award of the same number of credits as are being missed at the University. Where the partner institution or placement provider does not offer learning that delivers required learning outcomes that are not met by other parts of the student's programme, the school may require the student to undertake additional work during their exchange or placement or to take particular modules on their return to the University to achieve those learning outcomes. Any constraints on the allowed learning during a period of exchange or placement must be clearly stated in the relevant programme specification. All schools must: All Schools must: It is good practice to: While the management of the credit transfer process is the responsibility of Student Services, schools are responsible for carrying out the mark translation using the approved translation tables. Oversight of the processes is devolved to the Credit and Grade Translation Committee (CGTC) which is a sub-committee of Quality and Standards Committee (QSC). The ownership of an exchange scheme or approval of a university wide partner for student exchange rests at School level. It is good practice for School Teaching Committees (or equivalent) to play a role in the development of links and the approval of the workload of individual students. When developing exchange agreements at a School level, Schools must follow the guidelines/regulations issued by Student Services and submit a Quality Assurance Checklist as part of the Due Diligence process. Where an exchange scheme is being established with a new host university (i.e. one with no history of exchanges with University of Nottingham), the Quality Assurance Checklist as part of the Due Diligence process will record the assessment process at the partner and resit process, as applicable. This will be reported to the CGTC with reference to approved policies in the destination country and a proposed mark translation table. The Credit and Grade Transfer Committee (CGTC) is a sub-committee of QSC. The committee’s remit is to review the operation of the credit transfer process, including the detailed scrutiny of the conversion tables and to receive reports from Exam Boards. Schools and Student Services may refer any issues that arise from their application (and any other aspect of the policy) with a view to updating the tables as appropriate. The CGTC will be chaired by a member of QSC and have representation from each Faculty and from all three campuses. The CGTC will report on its activity to the October meeting of QSC. All schools must define and document the amount of work to be undertaken by the student at the exchange institution which corresponds most closely to the number of credits required for that period of academic study at Nottingham. This must be done by referring to the published guidelines of the CGTC and referring any queries to Student Services. Student Services will support the work of CGTC by maintaining a mark translation table for each host institution and the use of these tables in converting the unit marks supplied by the host into marks to be returned for the student’s record is now mandatory. Schools are responsible for applying these translation tables to generate marks for each student. These marks must be approved by the appropriate Examination Board. Where an Examination Board believes that the application of the translation table produces an unfair outcome for an individual student or group of students, they must make a case to QSC to allow an outcome outside of regulations. Schools must submit an annual report to the CGTC describing any issues arising from the application of the credit & grade transfer process. This report must include: A standard report pro-forma will be provided to School Examinations Officers by Student Services. Schools must ensure that host institutions report on how any extenuating circumstances (EC) experienced by students on an exchange have been dealt with. These reports must be considered by a School EC panel. If the actions taken by the host institution are not considered to be appropriate by the EC panel, they may recommend further remediation in line with the University’s EC policy. In exceptional cases where this is still felt to lead to an unfair outcome for the student, a case to QSC must be made for an outcome outside of regulations to be allowed. The relevant Board of Examiners must be made aware of the existence of such extenuating circumstances and the remediation agreed. Schools must ensure that each student undertaking an exchange has an individual Learning Agreement that is approved by the School and the student prior to their final commitment to undertaking the exchange. Learning Agreements must include the following elements: a. A link to the conversion tables(s) to be used. b. An explicit allocation of University of Nottingham credits to each module (or equivalent) to be taken at the host institution. It is good practice for students attending the same host institution to undertake a broadly equivalent workload to other Nottingham exchange students in the same subject area. Students who are spending one semester at an exchange institution normally take a minimum of 50 and a maximum of 70 credits worth of courses or modules at that institution. c. Clear identification of any modules that will be treated as non-compensatable. d. Clear information on the way that extenuating circumstances will be dealt with if they arise during the placement including links to the host institution’s relevant policies and a requirement to copy any correspondence (claims, outcomes etc) arising from the use of those policies to a named member of staff in the home school. e. Clear information on re-assessment opportunities available if a fail mark be returned by the host institution. This must include, where appropriate, links to the host institution’s re-assessment policies. The available options for re-assessment are: i. the re-assessment(s) are set, taken and marked by the host institution during the period of the exchange (requires the prior approval of the host institution); ii. the re-assessment(s) are set and marked by the host institution but taken at the University of Nottingham after the end of the exchange (requires the prior approval of the host institution); iii. the re-assessments(s) are set and marked by the student’s home school after the end of the exchange; iv. the student is required to enrol on a substitute module at University of Nottingham in order to accrue the credits not gained during the placement. This may entail the student enrolling on extra credits during the next stage of their programme in order to complete the previous stage. Alternatively, it may mean that the student is unable to progress to the next stage until the requisite credits have been gained by taking the substitute module(s) as a part-time student. Guidance on drafting Student Learning Agreements will be provided by the Global Engagement team. The school must inform the Assessments Teams within Student Services of the allocation of credits to be taken by each individual student for the purposes of module registration and marks processing. This must be done by completing the Credit Transfer Form. ‘Credit Transfer' modules will be created in the student record and assigned the appropriate amount of credit. The credit values of the modules must equate to Nottingham credit values (minimum of 10, and then multiples of 5). When completing your credit transfer, please use the Credit Transfer Form (linked below) Schools must arrive at a single mark for each unit of work (module equivalent) studied abroad. The marks must be recorded against the credit equivalent modules taken at the partner institution. UK Quality Code, Advice and Guidance: Partnerships Careers and Employability Service Credit and Grade Transfer Policy Collaborative provision register – Workspace To access the Workspace, please use the following link (entering your university username and password when prompted). Quality and Standards Committee Programme monitoring and review Partnership development – Workspace Credit Transfer Form Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/credit-and-grade-transfer-policy.pdf",
        "uk_pdf_files/credit-transfer-form.pdf"
    ]
}