{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/outside-regulation-case.aspx",
    "content": [
        {
            "p": "This section of the quality manual explains the process if someone needs to request permission to undertake an action which is outside of regulations. This information is relevant to staff and students, learners and apprentices across all of the UK, China and Malaysia campuses. There are two ways to raise an item with Quality and Standards Committee: 1. If a change to the Quality Manual is being requested, then a paper to the committee will be needed. This will usually need to be prepared by the person requesting the change. More information can be found via the following link: How to request a change to the Quality Manual 2. If a School or Department has a student or group of students who need permission to undertake an action that is outside of regulations, then a case to the committee will be needed (see below). If a School or department determines or is informed that an action is outside the provisions of the Quality Manual but still wishes to pursue that particular course, it is necessary to write and submit an ‘exceptional case’ request to the Quality and Standards Committee to seek permission to operate outside of regulations. To do this, School's should follow the procedure and use the forms linked to in section 5 below. Some of these cases are considered by RAA members exercising delegated powers and some by QSC members (depending on the circumstances). Either way, please remember, the person(s) reviewing the case will not be familiar with the faculty or course, so Schools should provide sufficient information. The most common reason for a delayed response is because requests for additional information are needed. Any questions regarding this process should be sent to the Registry and Academic Affairs Quality and Student Management systems team ss-qsc-cases@nottingham.ac.uk. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}