{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/regs-governing-registration.aspx",
    "content": [
        {
            "p": "This page contains the University's regulations in relation to the formal registration of full and part-time students, including how their registration status affects their ability to access key services. This information is relevant to staff and students across all of the UK, China and Malaysia campuses – where information is campus-specific, this has been clearly indicated. Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship Includes: overview; link to Academic Services - UNNC The regulations on this page (in the following sections) apply only to the UK (UNUK) and University of Nottingham Malaysia (UNM) campuses. The registration regulations for the University of Nottingham Ningbo China (UNNC) are published on the Academic services area of the UNNC website. For more information, please consult the following: Registration regulations – UNNC Includes: requirements for UK and Malaysia campuses; completion of process; criteria for discontinuing status; link to regulations governing attendance and engagement; guidance on non-registered statuses 1.1 Only a Registered Student may follow a programme of study leading to a University award, have access to relevant services and facilities (including attendance at classes, and assessment), and be entitled to the rights and privileges of University membership as a student. A student who is not registered is not entitled to any of the above except where otherwise stated in regulations. 1.2 On admission a student must complete a formal registration process. They will then be a Registered Student. 1.3 Thereafter, until the end of their programme of study, and normally at the start of each academic year, a student is required to complete the formal registration process again, unless for other reasons set out in regulations such registration is not allowed or is not appropriate. (For instance, a student owing fees will not be allowed to register, or a student who has interrupted their studies need not register.) Completing the registration process will renew the status as a Registered Student for that academic year. 1.4 In order to complete the formal registration process students must: 1.5 The University will publish the final deadline date for Registration for the next academic year. If a student fails to complete the formal registration process (as defined in Regulation 1.4 above) by that deadline, they will not be a Registered Student for that academic year and they will be suspended from study. Such a student will be allowed to register for that academic year in exceptional circumstances only, and may be required to pay a late registration fee. 1.6 During an academic year a Registered Student may stop being a Registered Student either temporarily or permanently, in circumstances specified by Regulations. Guidance on the meaning of Non-Registered Statuses is available. Re-registration does not imply satisfactory completion of a previous stage of study. 1.7 Students on modular taught programmes are also required to undertake a formal module enrolment process. The University will announce annually the final deadline date for completion of module enrolment for each semester. Students who fail to complete the formal enrolment process by that deadline will be enrolled for modules determined by their Head of School. 1.8 No student who is following a full-time programme in the University will be permitted to undertake full-time employment for any period during which they are required to be studying at the University. For more information, please consult the following: Guidance on employment during studies 1.9 Permission to register on a second programme to be taken concurrently must be sought in advance from the school with which the student is initially registered, except where the student is on a joint programme run by more than one institution. Students will not be permitted to register on two full-time programmes at the same time. 1.10 A student will be registered as a part-time student if they meet any one of these criteria: 1.11 A student’s registration will be discontinued if for any reason the student has been deemed to be withdrawn as detailed in the University’s Regulations Governing Attendance and Engagement. For more information, please consult the following: Regulations governing attendance and engagement 1.12 A student’s registration will be discontinued if a student does not provide the University with required information as detailed below (in the Contact details section). 1.13 A student’s registration will be discontinued if they are in breach of the law in a manner that makes them ineligible to satisfy the University’s attendance requirements. 1.14 A student’s registration will be discontinued if they breach any of the registration requirements stated above. For more information about registration statuses, please consult the following: Guidance on non-registered statuses 1.15 A student’s registration will be discontinued if they are an apprentice at the University who no longer has a supporting employer in place. Includes: condition of continuation; role of the portal; role of student services; approved methods of correspondence; internal communications; link to the emergency contact protocol 2.1 It is essential that the University has accurate and up to date information about each student's address, in order to contact them in a timely manner about matters relevant to their programme of study and their membership of the University. 2.2 It is a condition of continuing as a Registered Student during an academic year that a student keeps the University informed both of their current local address (where they may be contacted during times when they are expected to be attending the University) and of their permanent home address (where they may be contacted at any time and particularly at times when they are not expected to be attending the University) using an approved method. For the purpose of these Regulations, the approved method is: (a) through the portal (b) at the Student Services Centre (c) in the case of undergraduate students in the School of Education and undergraduate students of Nursing, Midwifery and Medicine at the relevant School Office. 2.3 For email correspondence the University uses the - username@nottingham.ac.uk - email address to contact students. If a student does not activate or use this account, the University will not be responsible for their not receiving important information such as details about classes, assessments, fees, registration and graduation. 2.4 Students should ensure that they read all letters and email communications sent to them by the University at the addresses provided and may not use non-receipt of information as a reason for non-compliance with University requirements where they have failed to keep their contact information up to date or where they have failed to read such information. 2.5 Registered students are strongly encouraged to provide up-to-date information on a person (such as their next of kin) who may be contacted in an emergency. The University has a protocol governing when and how this information may be used. For more information about emergency contacts, please consult the following: Emergency contact protocol Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}