{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-responsibilities-of-pgr-advisor.aspx",
    "content": [
        {
            "p": "This page explains the role and responsibilities of the School Postgraduate Student Advisor (SPSA), including the appointment procedure and recording of consultations. Its content is primarily directed at UK-based staff and students but may also be of interest to those at the international campuses. Please be aware that during academic year 2020/21, the University introduced additional guidance in response to the Covid-19 pandemic. This page was previously affected by these arrangements and has been documented accordingly. Further details can be found in the \"Additional guidance in 2020/21 due to Covid-19\" section below. Includes: numbers required Includes: responsibilities Heads of School shall nominate a School Postgraduate Student Advisor (SPSA) and shall inform the University of the name of the SPSA, which should also be included in the School Handbook. Includes: confidentiality; when also a student supervisor; additional services and support The SPSA shall have responsibility for providing support, as noted in section 1 above, to all Research Postgraduate students registered with their home school. Responsibility for PGRs does not extend to the corresponding school on an international campus, although cross campus cooperation between SPSAs is encouraged on common areas. The School Postgraduate Student Advisor (SPSA) is available to offer independent and strictly confidential advice and support to research students who, for example, have a query about University, Faculty and School regulations and procedures relating to research study; are concerned about the progress of their research work and the facilities or resources available to them; are having difficulties with the supervisory relationship (including a complete breakdown of that relationship); or who have any other query relating to their research studies at Nottingham. If the SPSA is the student's supervisor, the student should seek guidance from any other member of School academic staff. The SPSA should advise the student as is required and, if they cannot answer the student's query, should indicate to the student what sources of expert advice and support exist within the University (eg. Counselling Service, or Researcher Academy). For more information about these services, please consult the following: Researcher Academy The University Counselling Services Includes: expectations; confidentiality; reporting options When a research student requests a meeting with the School Postgraduate Student Advisor (SPSA) on a serious matter concerning their research studies and/or supervision, the SPSA should make a careful record of the problem and the discussions (the record should be agreed with the student), including the outcome and any proposed course of action. Where appropriate, the SPSA may offer to mediate between the student and other staff and students in the School, including the supervisor. Subject to the degree of confidentiality agreed with the student, the SPSA should report the problem to the Head of School and, if appropriate, Registry and Academic Affairs. Please be aware that the following guidance was developed and applied during academic year 2020/21 in response to the coronavirus pandemic. These additional responsibilities were specific to Heads of School, Supervisors and Directors of PGR Programmes and should be read in conjunction with all other content on this page: Responsibilities of the Head of School, Supervisor and Director of PGR Programme - Additional guidance for the 2020-21 academic year in response to Covid-19 This guidance appeared alongside the University's Exceptional Regulations that were developed and applied in response to the coronavirus pandemic. For more information about the Exceptional Regulations as a whole, please consult the following: Exceptional Regulations: Covid-19 - 2019/20 - 2020/21 Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}