{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pol-penalties-for-late-submission.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on penalties for the late submission of assessed work. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. Includes: standard deadline for submission of coursework; deduction of marks upon expiry The standard deadline for submission of coursework on all campuses should be 15:00 local time. A deduction of five percentage points i.e. 5% of the maximum possible mark (100%) shall be imposed upon expiry of the deadline, and an additional 5% per subsequent 24 hour period (weekends and University closure days do not count as days where a 5% is to be imposed). For example, an original mark of 67% would be successively reduced to 62%, 57%, 52%, 47% etc. It is understood that, exceptionally, there may be academic grounds for different penalties to apply. Includes: university procedure for coursework submitted late; penalty for late submission; extensions when a student is likely to miss a deadline; assessment regulations The University follows the following procedure when coursework is submitted late: 1. When coursework (including essays, laboratory reports, projects, performance or other similar activities) is to constitute part of the whole of the assessment for a module, students should be told in writing at the start of the module the deadline by which the coursework is to be submitted and the penalty for late submission. Deadlines should be set taking account of student workload,and must avoid the revision period. (In certain cases, deadlines during the examination period may be acceptable.) Friday deadlines should be avoided where practicable. 2. If coursework is submitted late without a valid extenuating circumstance claim being approved, it should be marked in the normal way, and a penalty then applied. For the benefit of the student, external examiners and others, the original mark and the penalised mark should both be clearly indicated to the student when work is returned. The pre-penalty mark should be used as part of the School/Department’s feedback and moderation processes and the post-penalty mark should be used in any progression or award calculation and will appear on a student’s Transcript or Diploma Supplement. To minimise disputes about timing or submission, coursework should be date-stamped and receipted in some way. 3. The standard University penalty for late submission should be 5% per day, until the mark reaches zero. A deduction of 5% of the actual mark achieved shall be imposed upon expiry of the deadline, and an additional 5% per subsequent 24 hour period (weekends and University closure days do not count as days where a 5% is to be imposed). It is understood that, exceptionally, there may be academic grounds for different penalties to apply, with the approval of the Head of School/Department, for example, when solutions are to be discussed on a particular date, so that work submitted after this date is essentially worthless. 4. The standard penalties are intended to be very easy to understand, to be sufficiently severe to discourage deliberate late submission (bargaining the penalty against potential improvements to the work), but to encourage late submission in preference to no submission. Any different penalties should, if possible have the same intentions. 5. A student who is likely to miss a deadline should discuss their situation as early as possible with their personal tutor and with the member of staff responsible for the coursework. Extensions to deadlines should not be allowed without extenuating circumstances to ensure fairness to those students who do manage to complete their assignments in good time the procedures laid down under the Assessment Regulations and Extenuating Circumstances policy should be followed. 6. The application of a late penalty may mean that a student fails the relevant piece of work and/or module and this may affect the student’s overall average for the relevant stage of their programme of study so that reassessment is necessary before the student can be considered for progression or award. 7. In circumstances where students have the right to a reassessment as outlined in the relevant undergraduate or postgraduate study regulations, Schools/Departments will determine the form of reassessment. 8. Schools/Departments may, where without penalty the work is a pass and/or where it is not appropriate to set a new piece of work use the pre-penalty mark as the reassessment mark at the exam board instead of requiring the student to take further assessment. The pre-penalty mark will be utilised for progression purposes only. The decision on whether or not it is appropriate to set a new piece of work is at School discretion and based on the pedagogy or duration of a particular assessment. For more information about the assessment regulations, please consult the following: Assessment regulations Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}