{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/admissions-procedures-criminal.aspx",
    "content": [
        {
            "p": "This page sets out the admissions procedures for applicants with criminal convictions. Its content is primarily aimed at prospective students based within the UK but may also be of interest to staff and current students at all of the University's campuses. Includes: UCAS and University requirements; DBS clearance; accommodation The UCAS application and the University direct application requires applicants applying to regulated courses to declare any relevant criminal convictions. Regulated courses are those which require a DBS clearance to enable a student to complete the course. Includes: point of consideration; process of admission; advanced checks and permission Any declaration of a criminal conviction will not form part of the initial academic assessment of the application. Should the Admissions tutor wish to make an offer of a place to an applicant who has declared a relevant criminal conviction for a regulated course, this will need to be considered prior to issuing the offer. In the event of an academic offer being agreed, the application will then be passed to the Head of Admissions (UCAS/UTT) or Head of Admissions (Direct). The Head of Admissions will contact the applicant to request further details of the offence, including, if applicable, references from probation officers. This information will then be sent to the course director (for the course applied for) and the Campus Life Director to consider whether the applicant is able to comply with regulatory requirements and to decide the applicants suitability to study on the regulated programme or to practice in the regulated profession. This may involve carrying out an enhanced DBS check prior to offer and consulting partner organisations (such as the NHS) - however, this will only be done with the applicant's permission. We believe everyone with the potential and ambition to go to university should have the opportunity to do so, regardless of background. People with criminal convictions face obstacles and barriers to accessing university, yet higher education has the power to transform their lives by helping them move forward and make a positive contribution to society. The University of Nottingham pledges to give applicants with a criminal record a fair chance. For more information, please consult the following: Unlock: a fair chance for students with convictions Includes: requirements; spent convictions; accommodation decisions (when unspent conviction is declared); Data Protection Policy The University will ask all applicants who make an application to stay in University owned or managed accommodation to declare any unspent criminal convictions. We will use this information to ensure we adequately assess any risk posed to others staying in University owned or managed accommodation. A criminal conviction can become 'spent' after a period of time. The length of time it takes to become spent is defined by the Rehabilitation of Offenders Act 1974 and depends on the sentence or disposal made by the court following the conviction. Until that period has passed, the conviction is considered 'unspent' and should be declared. Please note the following: Rehabilitation of Offenders Act 1974 If an applicant wishing to stay in accommodation declares an unspent criminal conviction the application will be passed to the Head of Accommodation Services who will contact the applicant to request further details of the offence, including, if applicable, references from probation officers. This information will then be sent to the Campus Life Director who will carry out a risk assessment to confirm if by staying in university accommodation the applicant poses a risk to other students or staff. The Campus Life Director may make one of the following decisions: Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}