{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-educational-dapppsyed.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Applied Psychology (Educational) (DAppPsyEd). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 1. A candidate for the Doctor of Applied Psychology (Educational) must (a) Be a graduate of this or any other approved university holding a Masters degree recognised by the Department for Children, Schools and Families as a professional qualification for work as an educational psychologist; or (b) Hold such other qualification as may, on the recommendation of the University be deemed by Senate to be equivalent to the qualifications referred to in (a). 2. Candidates will normally be expected to have a minimum of two years' experience as a local education authority educational psychologist. 4. The taught component requires the completion of 120 credits, completed during the first two years of the course. The taught component requires satisfactory completion of the modules as listed in the School's programme handbook. 5. The University's Regulations for Taught Master's Degrees, Postgraduate Diploma and Postgraduate Certificate courses shall apply with regard to satisfactory progression on the taught element of the degree. For more information, please consult the following: Postgraduate Taught study regulations Includes: candidates who do not undertake or fail research thesis but complete part 7. The degree of DAppPsy (Ed) will be conferred on candidates who have completed the taught programme, submitted a thesis in a form and of a standard outlined above and successfully completed the final module concerning research dissemination. 8. Candidates who either do not undertake or fail the research thesis but successfully complete part or the whole of the taught programme may be considered for the following awards: Postgraduate Certificate in Applied Psychology (Educational) (60 credits), or Postgraduate Diploma in Applied Psychology (Educational) (120 credits). Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}