{
    "url": "https://www.nottingham.ac.uk/qualitymanual/exceptional-regulations-covid-19-unuk.aspx",
    "content": [
        {
            "p": "This page contains the exceptional regulations that were developed in response to the coronavirus pandemic. Its content only applies to staff and students at the University of Nottingham UK (UNUK). During academic year 2019/20, the University introduced exceptional regulations in response to the Covid-19 pandemic. These were campus-specific and meant to be read in conjunction with any pre-existing content within the Quality Manual. From the beginning of academic year 2021/22, the active application of all Covid-19 exceptional regulations at the University of Nottingham UK (UNUK) has now ceased, with the exception of those concerning Admissions. These will remain active at UNUK until 30 September 2022 and can be found in the section below. Please note, however, that any outcomes from the application of the exceptional regulations during the 2019/20 and 2020/21 academic years will continue to be honoured and used in all future decisions regarding those affected. For more information about the exceptional regulations and the content that was affected during academic years 2019/20 and 2020/21, please consult the following: Exceptional Regulations: Covid-19 - UNUK - 2019/20 to 2020/21 The exceptional regulations for English language equivalencies are contained in the following document: This document should be read in conjunction with all affected regulations. For more information about these pages, please consult the following: Policy on minimum English language entry requirements Policy on alternative English language qualifications Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/covid-english-language-equivalencies-unuk.pdf"
    ]
}