{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2013.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2013. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. An amendment has been made to the double counting regulations in the Accreditation of Prior (Experiential) Learning policy such that University or Nottingham students who have taken an Integrated Masters programme are not disadvantaged compared with outside applicants. Instead of expressing the limitation in terms of modules taken as an Undergraduate student it is now expressed in terms of the level of the modules rather than of the student. A new set of regulations has been added for the Professional Doctorate in Workplace Health and Wellbeing. In addition, the Regulations for the Professional Doctorate of Education (EdD) have been revised to clarify the relationship between the taught and research stages of the programme, the fallback awards, and bring the outcomes of the examination of the research stage into line with equivalent PhD regulations. The regulations for the Doctorate in Forensic Psychology have been revised to reflect the addition of a required 100 days of relevant practice experience along with a British Psychological Society accredited Masters in Forensic Psychology for direct entry into year 2 of the programme. The title of the fallback award has been amended to Criminological Psychology in line with British Psychological Society requirements and the availability of a similarly named Postgraduate Certificate and Postgraduate Diploma has been added. The progression requirements between taught and research stage have been expressed such that an overall merit level is required in the taught element and the research dissertation and that the student will have completed 100 days of relevant practice in an appropriate setting and under appropriate supervision. The role of the HCPC registered Forensic Psychology Practitioner as co-ordinating supervisor is made explicit and finally, in line with PSRB requirements, the requirement for a successful viva voce examination for both the research thesis and practice portfolio is confirmed as being required for this accredited programme. The Changes of Taught Course Regulations have been amended to make it clear that a student cannot request a course transfer to pre-empt failure and thereby avoid the regulation that disallowed such transfers if more than 60 compulsory credits of the previous programme form part of the proposed new programme. Quality and Standards Committee has approved a recommendation that students should be required to submit an electronic copy of their thesis as well as softbound copies when submitting for examination unless there were good reasons for an exemption to be granted from this requirement e.g. where there were intellectual property concerns. The PhD/MPhil Regulations, Role and Appointment of Examiners and Responsibilities of the Supervisor entries have been revised to reflect this change in research degree submission requirements. QSC also approved a requirement that in circumstances where it is appropriate to the student’s discipline, students are required to submit all data collected during the period of study as a research student of this University to their School prior to arrangement of the viva voce examination. Failure to do so may mean that the thesis is withheld from examination. The PhD/MPhil Regulations and Responsibilities of the Supervisor entries have been amended accordingly. The Extenuating Circumstances Policy and Procedure has been amended following feedback from schools and consideration by Quality and Standards Committee as follows: In section 1.7 of the policy students with ongoing circumstances should now submit an extenuating circumstances form each semester (rather than year) to ensure that appropriate account is taken of the circumstances and appropriate support can be offered to the student. In section 1.8 of the policy it now states that students making a complaint should make the school aware they have made a complaint, or intend to do so, in writing. In section 1.13 it is now stated that students should first discuss the matter with their school if they are dissatisfied with the outcome of an Extenuating Circumstances claim, and that if they remain dissatisfied after that discussion they should submit a review request form by email. Academic Processes will then make an initial assessment and if it is considered there may be evidence of a procedural irregularity the matter will be transferred for consideration under the University's Academic Appeals Policy. In all other cases the Deputy Director (Academic Administration) in Academic Services Division will undertake a paper-based review on behalf of Quality and Standards Committee. In section 2.5 a clarification has been added to make it clear that a student will not get feedback on the first submitted version of coursework unless they fail to submit a further version of the work. In section 2.8 a note referring to the possibility of schools putting in place an alternative process to submission of an ECs form has been removed as a result of a QSC decision that all schools should use the EC policy and form as set out in the Quality Manual to avoid confusion for students. A new paragraph 2.11.3 has been added to state that where a claim has been accepted as being with good cause and the student requests to take the assessment again in order to gain a fully representative mark they should be permitted to do so and this would be deemed to be a full adjustment for the circumstance that would then not be taken into account in any award/progression decision. Changes have also been made to Appendix 1 - Guidance on Circumstances and Required Evidence - to make it clear that a level of judgment on each individual case is needed and some detailed consideration may need to be undertaken rather than refusing something in a blanket fashion because it appears in the list of unacceptable circumstances (or vice versa). These changes deal with accommodation disturbances and paid employment/voluntary work issues. The policy on use of vivas in the policy on Marking and Grading has been amended to reflect a decision by Quality and Standards Committee that vivas can only be used as part of a documented assessment procedure, not as part of any other decision making process and so cannot be used in making borderline decisions (in line with the Degree Classification regulations). The Academic Misconduct policy has been updated to add a paragraph (4.2.3) to state that where it is considered that a disciplinary offence may have been committed in order to commit academic misconduct, the Head of School should refer the case to the Chair of the Academic Misconduct Committee via the Secretary to the Academic Misconduct Committee, for liaison with the University Assessor to determine whether the case should be considered under the Code of Student Discipline in addition to, or instead of, the Regulations on Academic Misconduct. The PhD/MPhil Regulations (33 and 34) have been amended to reflect a decision by Quality and Standards Committee (following consultation with Schools) that examiners may exceptionally where a student has been previously registered as a part-time student and it has been demonstrated that circumstances exist such that it would be in the best interests of that student, the examiners may recommend that the degree be awarded subject to minor amendments being completed within six months rather than the usual three months. The entry on Role and Appointment of Examiners has been amended to state that where a candidate has a contract of employment with the University of Nottingham, schools should consider whether the appointment of an Internal Examiner would risk the introduction of the perception of bias into the examination process. Where such a risk is identified, schools should always take the option of appointing two External Examiners. Changes to the Extenuating Circumstances Policy and related Documents and Policies During the 2012/13 session discussions relating to the Extenuating Circumstances (ECs) Policy and related policies took place with a range of interested groups resulting in the redrafting of the policy. This redrafting has resulted in a significant suite of new and amended policies/guidance documents. The overall aim has been to ensure that all of the policies inter-link to ensure that the University is able to manage all types of non-attendance and engagement, whilst ensuring that ECs are appropriately taken into account. In particular there is an increased ability to take action at an earlier stage where students are failing to engage with teaching and/or assessment. The documents listed below have been amended or created and have been approved by the Quality and Standards Committee on behalf of the Teaching and Learning Board. The following paragraphs summarise the significant changes. Extenuating Circumstances Policy: Guidance on Student Employment during Studies: Extenuating Circumstances Form: Regulations Governing Attendance and Engagement: Regulations Governing Registration: Policy on Voluntary Interruption of Study: New forms for students to request an interruption – taught and research (available at bottom of page Guidance on Non-Registered Statuses UNQF: Maximum Period from Initial Registration: Assessment Regulations In addition there are minor wording changes to the Academic Misconduct Policy and Procedure and the Programme Specification guidance to accommodate linking to new/changed policies. The entry entitled Release of Personal Information has been updated to give clarification that it is University policy that permission always be sought from current students before disclosure is made about degree information relating to them. The Regulations on Academic Misconduct come into effect on 1 August 2013 and should be used for any cases of suspected academic misconduct from this date onwards. The Academic Offences Policy should now be used only for those cases where proceedings commenced prior to 1 August and will shortly be removed from the Quality Manual when it is no longer applicable. The EngD Regulations have been amended to state that thesis submission must be made by the end of four years of registered study. The Academic Appeals Policy and Procedure has been amended at 2.2.3 to cover cases where a decision making body makes a revised recommendation which differs from the student's preferred outcome. In such cases the student will be given the option of accepting the revised recommendation and ending the appeal process or continuing with the appeal. The MPhil and PhD regulations have been amended to make it clear that where there is an element of collaboration with another institution there may be additional requirements for a student to satisfy in order to receive an award (for example, where agreements require submission of extra copies of the thesis, having a different format for the viva, writing more reports etc.). The MPhil/PhD Regulations and Annual Review entries have been revised to state that where a sponsor report has been made during the year it should form part of the consideration of the student's progress at the annual review. Following discussions between the Dean of the Graduate School and academic colleagues some guidance on the norms for annual leave for research students has been developed, stating that their entitlement will normally be 25 days per year, plus public and University holidays. A minor clarification has been made to the policy on Feedback to Students to state that feedback on academic performance may be given prior to release of marks online, and may normally be given by the candidate's personal or course tutor. The Regulations for Undergraduate Courses (13, 15 and 20) have been amended as follows: Regulation 13: The right to one re-assessment in each failed module has been amended to read ‘a right to one re-assessment in each failed module where this might enable a student to satisfy progression requirements’ i.e. in circumstances where a student would be unable to progress, even if successful in an outstanding reassessment, there is no longer a right to a reassessment. Regulation 15 has been amended to clarify circumstances in which a reassessment may take place at a time other than in the August/September immediately following the first assessment subject to Regulation 16. This regulation is also now reads ‘(subject to Regulations 16 and 20 below)’ rather than ‘(subject to Regulation 16 below)’. Regulation 20: It was previously only possible to apply Regulation 20 (carrying 20 credits of failed modules to the next academic session without progressing from the previous stage) if used with Regulation 19 (exceptional second reassessment). Regulation 20 has been amended to permit use with Regulation 13 and Regulation 16 if the student is being reassessed in modules worth no more than 20 credits, at the discretion of the School. Schools using Regulation 20 should ensure that the student is aware of the additional assessment burden which will be placed on them and the risks associated with this i.e. failure to satisfy the progression requirements of the previous stage will mean that their course is terminated on the grounds of academic failure even if they successfully complete the next stage. Where possible, the reassessment opportunity should be arranged as early as possible in the academic year. Regulation 14 of the regulations for Taught Masters Degrees, PG Diploma and Certificate Courses has been amended. The right to one re-assessment in each failed module has been amended to read ‘a right to one re-assessment in each failed module where this might enable a student to satisfy progression requirements’ i.e. in circumstances where a student would be unable to progress, even if successful in an outstanding reassessment, there is no longer a right to a reassessment. Regulation 14 has also been amended to clarify circumstances in which a reassessment may take place at a time other than in the August/September immediately following the first assessment. The Academic Appeals Policy and Procedure has been amended to include further information at 2.2.10 about the constitution of the panel to be convened in cases involving appeals against the decision of a Fitness to Practise Committee or a Practice Assessment Panel. Additional information has been added to the Extenuating Circumstances policy clarifying the next steps which a student may take if their request for extenuating circumstances has been rejected, including the possibility of putting a case to the Office of the Independent Adjudicator. The Student Engagement policy has been revised, following approval by Teaching and Learning Board. The new policy reflects the University's compliance with the QAA Chapter B5: Student engagement in the Quality Code, and incorporates the former Quality Manual entries on Student Representation on School Teaching Committees, and Learning Community Fora (LCFs). Most importantly, the policy now requires Schools to hold at least 3 LCF meetings a Session, with at least one meeting each Autumn Term. The e-Assessment Policy has been updated to provide additional guidance to staff. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}