{
    "url": "https://www.nottingham.ac.uk/qualitymanual/academic-regulations/unqf.aspx",
    "content": [
        {
            "p": "This page sets out the University of Nottingham Qualifications Framework (UNQF) and explains how it is used to set and maintain the University's academic standards. This information is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: influences; key links; purpose The University of Nottingham Qualifications Framework (UNQF) has been drafted to be fully compatible with the Quality Assurance Agency (QAA)'s Framework for Higher Education Qualifications in England, Wales and Northern Ireland, as well as the qualifications framework adopted at the Bergen Summit of the Bologna Process for the creation of a European Higher Education Area. For more information, please consult the following: The QAA Quality Code European Higher Education Area How does the Bologna process work? Programme specifications based on the QAA Framework have been formulated for University of Nottingham courses. Building on this work, a University of Nottingham Qualifications Framework (the UNQF) has been devised to underpin future course approval and review activity. The purposes of the UNQF are to: Includes: relationship to the QAA qualification descriptors; table of credits in total and by stage; table of minimum requirements for award; table of periods of registered study for research awards 1. A University of Nottingham credit equates to 10 hours of notional study. Credits are awarded by the University at the levels described on the Relationship of the University of Nottingham Qualifications Framework (UNQF) to the Quality Assurance Agency (QAA) qualification descriptors page, which themselves relate to the QAA qualification descriptors on the QAA Qualification Framework page. Relationship of the UNQF to the QAA qualification descriptors The Quality Assurance Agency Qualification Framework 2. The number and level of credits which need to be gained for each taught award of the University is as follows: Qualifying Stage: 120 credits at level 1 or above Part I: 120 credits with at least 90 credits at level 2 or above Part I: 100 credits with at least 80 credits at level 2 or above Part II: 100 credits with at least 60 credits at level 3 Honours Degree (Hons)* *These requirements also apply to the award of an unclassified ('Pass') degree at the end of an honours course 360 credits** with at least 190 credits at level 2 or above and at least 100 credits at level 3 or above ** This will be 480 credits for the Bachelor of Education course run at the University of Nottingham Ningbo China (UNNC) and for the Bachelor of Pharmacy course run at the University of Nottingham Malaysia (UNM). Part II: 120 credits with at least 100 credits at level 3 or above Part III: 120 credits with at least 90 credits at level 4 and a further 10 credits at level 3 or above Taught Stage: 120 credits with at least 90 credits at level 4 Research stage: At least 60 credits of the course is devoted to a research project leading to a dissertation/comparable research output or the production of other output such as an artefact, business plan, performance or musical composition. These credits must be at level 4. Taught Stage: 120-180 credits with at least 120 at level 4 Taught Stage: 120 credits with at least 90 credits at level 4 or 180 credits with at least 150 credits at level 4 Please note the following: 3. Programme specifications may also set out additional non credit-bearing components of a course which must be undertaken for an award to be made. Where a standard of performance must be attained in the additional component for an award to be made, this standard will be described in the programme specification. 4. The Foundation Certificate, Undergraduate Certificate, Graduate Certificate, Postgraduate Certificate, and Postgraduate Diploma will all consist of a single stage. 5. Course structures must require students to gain the above number of credits at each level at each stage in order to obtain the appropriate qualification. 6. Programme specifications will specify whether: (a) An Honours degree or an Ordinary Degree is awarded as a: (b) An Integrated Masters is awarded as a: (c) A Taught Masters is awarded as a: 7. Subject titles of awards indicate whether the course is: The minimum requirements for title of awards are set out below. Course structures must require students to take at least the following number of credits in each subject: Awards which do not meet any of the above minimum requirements will have the title ‘X with Combined Studies’, ‘X and Combined Studies’, or just ‘Combined Studies’, as appropriate. Where a module involves more than one subject, all the credits from that module may count towards satisfying the minimum requirements for each subject. A module comprising material which, while not directly related to the subject, provides knowledge or skills necessary for its study, may also count towards satisfying the minimum requirements for that subject. 8. For research degrees, Masters and Doctoral awards relate to the descriptors for qualifications at Masters and Doctoral level in The Qualification Assurance Agency Qualification Framework. For more information about this Framework, please consult the following: The periods of registered study for each research award of the University is as follows: Minimum: 1 year (180) credits) 2 years (240 credits) Normal: 1 year (180) credits) 2 years (240 credits) Maximum: 1 year (180 credits) 2 years (240 credits) Minimum: 2 years (180 credits) 4 years (240 credits) Normal: 2 years (180 credits) 4 years (240 credits) Maximum: 2 years (180 credits) 4 years (240 credits) Minimum: 1 year Normal: 2 years Maximum: 3 years Minimum: 2 year Normal: 4 years Maximum: 6 years Normal: 1 year Maximum: 1 year Minimum: 2 years Maximum: 4 years Normal: 3 years Minimum: 4 years Normal: 6 years Doctor of Philosophy (PhD) Doctor of Medicine (DM) Maximum: 8 years Periods of part-time study are weighted 0.5 in comparison to full-time study in relation to these minima and maxima. Except for the circumstances given in 9 below, full-time research students are required to have a minimum of 12 supervisions per year and part-time students a minimum of 6 supervisions per year. These supervisions should take place at regular intervals throughout the year. 9. Regulations for the awards in 8 above may specify certain taught modules, research training, or other additional components which must be undertaken, and any performance level in them which must be achieved, in order for the award to be made. The number of supervisions research students are required to attend may be reduced where additional components are being undertaken. 10. Regulations will specify whether a Professional Doctorate is awarded as a: Framework for Professional Doctorates 11. Awards listed in the UNQF may be awarded jointly with other institutions, subject to the approval of Senate. 12. The language of teaching and assessment for all provision must be in English when students are registered for a University of Nottingham qualification. The only exception is where the subject of study is a language or literature other than English. Regulations for students who do not meet Honours requirements from September 2015 Regulations for students who did not meet Honours requirements before September 2015 European Credit Transfer System Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}