{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2023.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2023. PENALTIES FOR LATE SUBMISSION OF ASSESSED WORK The Policy on penalties for late submission of assessed work has been updated with minor changes to improve clarity. E-EXAMS The Policy on e-exams and the 'E-exams' section of the Assessment regulations have been updated to reflect the interim arrangement for academic year 2022-23 as the University prepares for the introduction of a new e-exams platform as part of the Curriculum Management and e-Assessment project. PARTNERSHIPS AND PLACEMENTS The Partnerships and placements page has been updated to include a section on 'Pre-placement preparation' and 'Adjustment to placement on religious grounds'. EMERGENCY CONTACT PROTOCOL The Emergency contact protocol has been updated to improve clarity in relation to who can be an emergency contact for a student, circumstances when the University may need to contact an emergency contact and the decision process for contacting an emergency contact. ADMISSIONS FEEDBACK The Admissions feedback, appeals and complaints page has been updated to reflect a new process with regards to 'Feedback' and 'Review'. ATTENDANCE AND ENGAGEMENT The Regulations governing attendance and engagement (UNUK) page has been updated to reference the student engagement dashboard. CONTINGENCY REGULATIONS Introduction of the University's Contingency regulations for classification and progression. MINIMUM ENGLISH LANGUAGE REQUIREMENTS The policy on minimum English language entry requirements has been updated to improve clarity on what applicants can use as an acceptable alternate English language qualification. SAFEGUARDING The Safeguarding page was updated to link to the revised Safeguarding policy. EXTENUATING CIRCUMSTANCES After long consultation, the University Extenuating Circumstances (ECs) policy has been significantly altered for academic year 2023/24. The key concept is to bring discussions around wellbeing and support ahead of assessments and deadlines, encouraging students to think about their support needs and prevent vulnerable students sitting unnecessary assessments. Headline changes include clearer definitions of exam/coursework for the purposes of extenuating circumstances; where permitted by a School for a given assessment, a student can take a no-evidence coursework extensions of 5 days; for exams, the award of a first sit will void original mark - attendance at the additional attempt will be compulsory; cumulative extensions of over 15 days would result in a new assessment during the resit period (or School equivalent); no change to support plan’s extensions interaction with EC extensions. ACADEMIC MISCONDUCT The policy on Academic Misconduct has been be updated from the academic session 2023/24. This is to update the policy on Artificial Intelligence (AI) software, include a reference to false qualifications, and to improve clarity on wording. POSTGRADUATE TAUGHT SUPERVISION From the academic session 2023/24 regulation and guidance relating to the supervision of the 60-credit project module where students complete an independent piece of research, that sits outside any taught elements of a PGT programme, has been added to the Quality Manual. The regulation of supervision will allow for a more equitable experience for both staff and students and will outline the responsibilities of students as well as the staff involved. A guidance document has also been produced which Schools should use as a model of best practice. PROGRAMME APPROVAL The programme approval and curriculum change sections of the Quality Manual has been updated from the academic session 2023/24. The changes will include clearer process flow diagrams for each campus and clarification around approval timing. MASTER OF RESEARCH (MRes) WORD COUNT The Regulations for the Degree of Master of Research (MRes) from September 2020, and the associated Supplementary Regulations for Degree of Master of Research (MRes) in specific schools from 2019 and 2020, have been updated from the academic session 2023/24 to indicate that the bibliography will not be included in the word count of the thesis to bring the regulations in line with sector norms. SUPPORT TO STUDY From the academic session 2023/24 the Fitness to Study policy will be replaced with the Support to Study Policy and associated procedure. In the Support to Study Policy and Procedure, greater emphasis will be placed on the supportive nature of the policy. Further differences to note include: MAXIMUM PERIOD OF REGISTRATION An update to the maximum period from registration regulations such that in cases of up to one year of voluntary interruption for a specific set of reasons (clarified within the text) the maximum period of registration is automatically extended. In compliance with national regulations in China, this modification does not apply to UNNC. LEARNING COMMUNITY FORUMS Learning Community Forums are now known as Staff Student Forums on the UK campus. There are associated updates to the relevant pages. These are designed to encourage collaboration and a participative approach. The changes were brought in with the Students Union after consultation with students and staff. END POINT ASSESSMENT (EPA) PROCESS DOCUMENT The addition to the Quality Manual of a new EPA process document which clarifies expectations and roles and responsibilities across the University in relation to the delivery and management of Apprentice Degree End Point Assessments. QUALITY AND STANDARDS COMMITTEE Templates and process for submitting papers for QSC consideration have been updated to increase clarity on mimimum requirements, timelines etc The Extenuating Circumstances (EC) regulations have had some clarifications made. These cover the interaction between support plan and EC extensions; the definition of short term circumstances (what is and is not permitted); the use of academic misconduct and/or disciplinary procedures; clarifying which exams self certification can be use for; clarifying the interaction between no evidence and evidenced extensions for coursework. A Q&A document has been produced for staff (staff access only) to sit alongside the already published student FAQs. CREDIT AND GRADE TRANSFER POLICY The Credit and Grade Transfer Policy has been finalised and added to the Partnerships and Placements page. Where students participate in periods of study abroad at another educational institution which result in the award of marks and credit by the partner institution, this policy provides the framework for the consistent transfer of credit and marks to Nottingham for the purpose of calculating final degrees. POLICY ON CIRCUMSTANCES AFFECTING STUDENTS' ABILITY TO STUDY AND COMPLETE ASSESSMENTS Section 15 has been updated to include a link to the updated Support to Study Procedure. SCHOOL EXAMINATIONS OFFICER ROLE The School Examinations Officer Role section of the Quality Manual has been updated to remove references to Saturn and replace with Campus Solutions. Details of the Offices at UNNC and UNM have also been provided to assist colleagues at those campuses. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/credit-and-grade-transfer-policy.pdf",
        "uk_pdf_files/support-to-study-procedure-august-2023-v2.pdf"
    ]
}