{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-internationalphd-phd.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the International PhD, leading to the Degree of Doctor of Philosophy (PhD). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: appointment of supervisors; minimum time spent at each institution A candidate for the International PhD must have pursued in this University and in the partner institution a full-time or part-time course of study. Completion of the International PhD requires a minimum of 2 years of full-time supervised study and a maximum of 4 years of full-time supervised study (normally 3 years), or a minimum of 4 years of part-time supervised study (normally 6 years, 8 years maximum). Supervisors will be appointed at Nottingham and at the partner institution. Candidates are required to spend a minimum of twelve months at each institution throughout the period of registered study, and the pattern of study will be agreed at the commencement of registered study. Progression from years 1 to 2, and 2 to 3 will be as for all PhD students at the University of Nottingham and will culminate in the submission of a progress report at the end of each year of study to the School. Students will also be required to comply with any progression requirements at the partner institution. Includes: submission of copies to each institution; appointment of examiners; compliance Candidates are required to submit an identical copy of their thesis to each institution, taking into account local regulations on formatting of the thesis. The University of Nottingham shall appoint examiners in accordance with the policy as set out in the Quality Manual. A viva voce examination will take place, which will be conducted in English, though with the option for part of the viva to be conducted in another language if appropriate. Candidates may also be required to comply with separate examination procedures at the partner institution. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}