{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pol-circs-affecting-students-study-assessments.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on circumstances affecting students' ability to study and complete assessments. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. Please be aware that during academic year 2019/20, the University introduced exceptional regulations in response to the Covid-19 pandemic. These were campus specific and meant to be read in conjunction with all pre-existing content. From the beginning of academic year 2021/22, the active application of the exceptional regulations affecting this page has now ceased, with the sole exception of those which cover extenuating circumstances at the University of Nottingham Malaysia (UNM). The following will remain active at UNM until further notice in light of the current situation in Malaysia: Any outcomes from the application of the regulations during academic years 2019/20 and 2020/21 across all three campuses will, however, continue to be honoured and used in all decisions regarding those affected. Further details about those regulations which have NOT been extended into academic year 2021/22 can be found in the \"Exceptional regulations applied in response to Covid-19\" section below. During their study students may encounter significant personal difficulties that are outside their control and impact on their ability to study and/or complete assessments. The Policy on circumstances affecting students’ ability to study and complete assessments provides mechanisms by which students may bring circumstances having a detrimental impact on their study to the attention of the University. The policy and associated procedures allow for the consideration of the impact of those circumstances on their academic performance and the provision of measures to address the impact, where possible and appropriate. Includes: criteria; application In order to be considered under this policy, such difficulties must meet all of the following criteria: This policy is applicable to all types of student on all programmes or courses. Two types of circumstances may affect student performance in study and/or assessment: (a) Long term conditions/disabilities including Specific Learning Differences, such as dyslexia, dyspraxia, and ADHD, a recognised disability and/or long-term health condition, autism spectrum disorders (ASD) and mental health difficulties. For more information, please consult the following: Policy on long-term conditions or disabilities affecting students' ability to study and complete assessments Students with Support Plans have access to coursework extensions The thesis pending period (including Policy on extensions) Voluntary interruption of study (b) Shorter term circumstances such as a self-limiting illness which require consideration as and when they arise and may affect study and/or assessment. For more information, please consult the following: Extenuating circumstances regulation i. Schools should ensure that all students are aware of this policy and associated procedures. As a minimum they are expected to include information in their initial induction packs and remind students each year of its existence. This may be done by inclusion in the School/Programme Handbook. Assessment level information (e.g. opt out of ‘no evidence’ extensions) needs to be included in module handbooks (so information is at module level for joint honours students). ii. Each School should ensure that students are aware of primary contacts for submission of claims and should ensure that advice about possible outcomes/consequences is easily available to students. There may be times when a School will need to respond to students in a short timeframe so their procedures must support the ability to do this. iii. Schools should ensure that their Personal Tutors are aware of this policy, associated procedures and their responsibility, if appropriate, to support and advise their tutees when they know of their intention to submit a claim. iv. Schools should consider and respond to claims in accordance with the associated procedures. i. Students are responsible for ensuring that they inform the University promptly of any circumstances that they consider are affecting their ability to study and/or undertake assessments. With early warning of a problem, the University can provide appropriate support. Students should be aware that the University cannot respond to a student's circumstances if they remain unaware of relevant information. ii. Where possible, students should contact their Personal Tutor, Support and Wellbeing Officer (UNUK), Disability Liaison Officer (UNNC) or other appropriate staff member in advance of engaging with associated procedures, so that they may receive guidance and support in these processes. iii. Students are expected to observe timeframes for the submission of claims defined in procedures associated with this policy. iv. Students are responsible for obtaining and providing the required evidence demonstrating their claimed circumstances. The University will not seek documentary evidence on a student’s behalf. v. Students should make every effort to ensure that they are fit to study and undertake assessment, and where a student feels that there are circumstances that are affecting them adversely it is their responsibility to seek advice and professional help, where relevant, to assist in resolving the problem. vi. Students are responsible for ensuring that they are available for all necessary study and assessment. A student will be in breach of the University’s attendance and engagement requirements if they do not attend an examination or comply with a coursework deadline and do not submit an appropriately evidenced claim in accordance with one of the procedures associated with this policy. For more information about the University's Regulations governing attendance and engagement, please consult the following: Regulations governing attendance and engagement i. Personal Tutors should support students making submissions related to the procedures associated with this policy, as appropriate. ii. If they have previously been made aware of circumstances affecting a student’s ability to study and/or complete assessments and believe those circumstances to have had an adverse impact on the student’s performance, at the student’s request, Personal Tutors should provide a statement as per the evidence requirements of associated procedures. iii. Personal Tutors should direct students to professional support for their circumstances and/or direct them to and help them navigate through University processes and procedures, and/or provide other appropriate support. iv. Personal tutors must ensure their knowledge of these policies is current and provide advice within the parameters of published policies and procedures. i. Support and Wellbeing Officers (UNUK) or Senior Disability Support Advisor (UNNC) should provide help and guidance to students in relation to their health and wellbeing within the parameters of published policies and procedures. They will direct students to professional support for their circumstances and/or direct them to and help them navigate through University processes and procedures, and/or provide other appropriate support. ii. Support and Wellbeing Officers (UNUK) or Senior Disability Support Advisor (UNNC) should support students making submissions related to the procedures associated with this policy. Often this will be part of a wider package of support provided to an individual student. iii. If they have previously been made aware of circumstances affecting a student’s ability to study and/or complete assessments and believe those circumstances to have had an adverse impact on the student’s performance, at the student’s request, Support and Wellbeing Officers (UNUK), or Senior Disability Support Advisor (UNNC) should provide a statement as per the evidence requirements of associated procedures. iv. Support and Wellbeing Officers (UNUK), or Senior Disability Support Advisor (UNNC) will attend and advise extenuating circumstances panels on student cases, but are not a member of the panel and are not part of the decision-making process. v. Support and Wellbeing Officers (UNUK), or Senior Disability Support Advisor (UNNC) may meet with students to explore support relevant to the issues identified in the claims the student has submitted. i. Staff will offer support, information and direction to relevant procedures and specialist services. Guidance provided will be within the parameters of published policies and procedures. ii. Staff will receive, log and process for consideration claims submitted by students. Staff will keep complete records of all claims and ensure that they manage and note extensions to deadlines and deferrals of examination such that relevant University offices are informed of the later assessment. iii. Staff will notify students of the outcome of their claims and update student records accordingly. iv. Staff will attend meetings of local extenuating circumstances panels to ensure records are kept and due process is followed. v. Staff will review outcomes of claims, provide data and highlight inconsistent or incorrect application of process or outcomes with the relevant Head of School/Department and, if appropriate, with Faculty Teaching and Learning Committees (UNUK), or Faculty Education and Student Experience Committee (UNNC). Guidance on types of circumstance and whether they might be considered as good cause for failing to comply with an assessment requirement is provided in each associated procedure. Where a student has had circumstances that affect their ability to study and/or take assessments for one period accepted but continues to be affected by or has a recurrence of the same circumstances, they should seek medical/other advice. If necessary, they should either refer to the Policy on long-term conditions or disabilities affecting students’ ability to study and complete assessments so that appropriate support for study or individual arrangements for examinations can be put in place or discuss with their School/Department the possibility of voluntarily interrupting their studies until the circumstances have been resolved. Further information regarding ongoing circumstances can also be found in the extenuating circumstances procedure. For more information, please consult the following: Extenuating circumstances procedure If a student has made, or is making, a complaint under the Student Complaint Procedure and feels that the matters covered by that complaint may have affected their assessment performance, they should make the School/Department aware in writing of their complaint such that it can be taken into account if appropriate. Student Complaint Procedure Policy on student complaints Timescales for submissions of claims will be published within the relevant procedure and must be adhered to. The timescales are deemed to be reasonable and allow students adequate opportunity to notify the University of circumstances affecting their ability to study and/or complete assessments. Includes: reasons for rejection All claims made under this policy must be supported by evidence/documentation as required in each procedure, except where explicitly permitted otherwise. Claims will be rejected if appropriate evidence is not included at the point of submission or provided within the relevant permissible timescales. Confidential information will only be shared within the University for the purposes of implementing this policy in a fair and rigorous manner. Any student wishing to restrict the sharing of such information should make their wishes known to the appropriate members of staff, preferably in writing. Normally such wishes will be respected unless to do so would be against the best interests of the University community or the interests of safety or security of any person. Data protection principles will be observed at all times and records of claims will be kept in accordance with the University’s records retention schedule. Registry and Academic Affairs (UNUK) or Faculty Office (UNNC) should inform students of the outcomes of claims in writing according to the relevant procedure in a timely and reasonable manner. Religious observance Policy on academic appeals Assessment regulations Support to study procedure Students required to withdraw on grounds of health and safety Status change immigration advice Policy on long-term conditions or disabilities affecting students' ability to study and complete assessment Students with Support Plans - access to coursework extensions The thesis pending period (including Policy on extension) During academic year 2019/20, the University of Nottingham also introduced exceptional regulations in relation to postgraduate research extensions (including for UKRI-funded programmes, as well as the Doctor of Philosophy (PhD) and MPhil awards). Outcomes from the application of those regulations during the 2019/20 academic year, in relation to PGR extensions, will be honoured, and used in all future decision making. However, from academic year 2020/21 onwards, the Covid-19 PGR Extensions (UKRI funded) Exceptional Regulations and Covid-19 Exceptional Regulations for PGR Students will no longer be actively applied to a student's period of study. Please be aware that the following Exceptional Regulations were developed and only applied in academic year 2019/20 due to the coronavirus pandemic. These records should be read in conjunction with all other content on this page. For more information, please consult the following: For more information about the Exceptional Regulations as a whole, please consult the following: Exceptional Regulations: Covid-19 - 2019/20 to 2020/21 Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/covid-ec-exceptional-regulations-unm.pdf",
        "uk_pdf_files/support-to-study-procedure-august-2023-v2.pdf",
        "uk_pdf_files/covid-ec-exceptional-regulations-unuk.pdf",
        "uk_pdf_files/covid-ec-exceptional-regulations-unnc.pdf",
        "uk_pdf_files/covid-pgr-extensions-to-period-of-registered-study-exceptional-regulations-unuk.pdf",
        "uk_pdf_files/covid-pgr-extensions-ukri-funded-exceptional-regulations-unuk.pdf",
        "uk_pdf_files/covid-exceptional-regulations-for-pgr-students-unuk.pdf",
        "uk_pdf_files/covid-exceptional-regulations-for-pgr-students-unnc.pdf",
        "uk_pdf_files/covid-exceptional-regulations-for-pgr-students-unm.pdf"
    ]
}