{
    "url": "https://www.nottingham.ac.uk/qualitymanual/2-documents/pgr-supervision-record-unm.docx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue.OKSee our policy External Examiners for undergraduate and taught postgraduate courses are appointed on an annual basis up to a normal maximum of four years' service. Council has the power to receive nominations and approve such appointments and discharges its responsibilities in this regard through the Quality and Standards Committee. Registry and Academic Affairs provides advice and guidance to the Committee, particularly regarding those nominations that fall entirely within the provisions of the Quality Manual. For Integrated Degree Apprenticeship programmes, Schools will also need to ensure that they nominate suitable candidates for the roles of External Assessor and Independent Assessor. Where a specific integrated Apprenticeship Programme's End-Point Assessment plan makes references to other specified assessment roles within the marking and assessment team arrangements, they should also be appointed in accordance with eligibility criteria contained within the Quality Manual. Nominations for the following session for both re-appointments and new appointments are sought in July / August. Registry and Academic Affairs sends lists of Examiners / Assessors and courses for the current session to Schools, and Schools are asked to: 1. Check the list and amend appropriately, indicating those Examiners / Assessors to be re-appointed, deleting those who have finished their term of office and adding to the bottom of the list the details of examiners who are being newly nominated to take on a role Schools are asked to return the lists to Registry and Academic Affairs, even if no changes are required 2. Ensure that for each new appointment of an External Examiner the following have been completed and returned: 3. For Integrated Apprenticeship Degree programmes, ensure that the following have been completed and returned: Please note that a current CV must accompany all nominations Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}