{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/about-the-qm.aspx",
    "content": [
        {
            "p": "This page provides important information about the University of Nottingham's Quality Manual, as well as its associated governance and responsibilities for compliance across all of the UK, China and Malaysia campuses. The Quality Manual sets out the framework that governs all teaching and learning at the University of Nottingham. It forms a central point of reference for all campuses (i.e. UNNC, UNM and UNUK); for staff, students. learners and apprentices. It draws together a series of interlinked activities that support quality assurance for programmes, modules, short courses, micro-credentials, and the award of credit from the University of Nottingham. In this way we can enable compliance with all our regulators through a high quality student experience and successful student outcomes. The purpose of the Quality Manual is to: This information is relevant to staff and students, learners and apprentices across all of the UK, China and Malaysia campuses. Note, in most circumstances references to ‘students’ in the quality manual also means apprentices and learners. Where there are separate procedures or requirements for particular campuses or groups of students/learners, this is stated within the Quality Manual. The University of Nottingham has Degree Awarding Powers (DAP) authorised by the Office for Students (OfS) in England. Where students have studied in Malaysia, the degree programme is accredited by the Malaysian Qualifications Agency (MQA) and recognised by the Malaysian Government. In China programmes run with the approval of the Chinese Ministry of Education. All of our degree awards are of equal merit and standing across the UK, China and Malaysia campuses. All of The University of Nottingham’s awards align with the sector standards and where applicable Professional, Statutory, Regulatory Body (PSRB) and Ofsted requirements. Quality regulations and processes are mapped against Office for Students’ conditions of registration for quality and standards to ensure compliance. We also adhere to the QAA Quality Code. QAA Quality Code Expectations for standards: Expectations for quality: The Framework supports the University of Nottingham’s values of inclusivity, ambition, openness, fairness and respect. Responsibility for the Quality Manual lies within the Quality and Standards Committee, which reports to the Teaching and Learning Committee, and thus the Education and Student Experience Committee. For more information, please visit the following links: Quality and Standards Committee Teaching and Learning Committee Education and Student Experience Committee Many of the processes underpinning the Quality Manual are managed by Registry and Academic Affairs(RAA). The key exception being the responsibility for the Annual Monitoring process and EEAR processes [add full term] which are managed by the Education Excellence Team. Some decisions of the Quality and Standards Committee are delegated to other committees or departments. RAA and School/Faculty colleagues are all able to monitor its ongoing effectiveness and to suggest improvements and corrections, plus relevant Associate Directors and QSC members review the content annually. This electronic copy of the Quality Manual should be seen as the most up to date version and supersedes any and all previously published versions either online or in print. Any changes to these regulations or processes must be submitted to QSC for consideration. Across all of our campuses, responsibility for quality assurance and for the implementation of the Quality Manual rests with the Head of School or Department, under the jurisdiction of Senate and its committees. Within each School/Department or Faculty and within RAA, there will be processes in place to keep practices under review and in line with the Quality Manual. Any Schools with provision on more than one campus will therefore be regarded as multi-campus entities for the purposes of the Quality Manual. Please refer to the International Campuses page for more details International Campuses and Quality Assurance The Registrar’s Department (i.e. Registry and Academic Affairs (UNUK); Academic Services Office (UNNC); Student Registry Office (UNM)) is responsible for interpreting the Quality Manual and thus, for determining whether an action is in accordance with its provisions and whether an approval at University-level is required. It is the Head of School’s responsibility to keep their School’s practice under review and in line with the Quality Manual, as reviewed through the Periodic Review process. Where responsibility is delegated, this should be formally documented and appropriate protocols made clear; where autonomy has been granted to another unit by the Head of School, the School is still responsible for ensuring that the policies and procedures within the Quality Manual are implemented. For more information on delegated responsibilities in relation to international campuses please see the following link: The Quality Manual applies equally across all campuses. Localised variations can exist where thay have been clearly noted. Where possible, national flags (representing the UK, China and Malaysia campuses) have been added to draw attention to any links and sections which are of relevance to a particular campus. These will appear as follows: The Quality Manual has been split into 12 categories, which can be accessed here [add link], with additional sections to cover Policies, Recent Changes and Coming Soon. These can be accessed through the tiles, or through the links in the navigation list on the left hand side of every page. Individual elements of the Quality Manual can often not be considered in isolation. Relevant additional pages are provided as links within that page, where possible, plus it is often useful to look back at the ‘parent’ page and the ‘sibling’ or ‘child’ pages. Where it is stated that Schools or students ‘should’ take particular actions or follow certain principles, this is a requirement with regulatory force across all of our campuses and must be complied with. I.e. please read ‘may’ or ‘should’ as ‘must’. Please note, we are currently undertaking work in the Quality Manual to replace ‘should’ with ‘must’, but in the meanwhile please consider ‘should’ to mean ‘must’. Please note that anyone can request a change to the Quality Manual by submitting a request to Quality and Standards Committee (QSC). For more information about this process, please consult the following: To ensure that its content is constantly available and up-to-date, the Quality Manual is only available on the web. Users are free to print off their own copies but should remember that these may become quickly outdated. The Quality Manual is reviewed each year to ensure that staff and students can be confident that all information contained in it is current. To supplement this activity a rolling programme of comprehensive reviews for each section once every three years will be introduced from the 23/24 session. New developments in external requirements, e.g., Office for Students, Institute for Apprenticeships and Technical Education, Malaysian Qualifications Agency, Ministry of Education in China, etc, may also result in a review of relevant sections within the Quality Manual. The Quality Manual is not a static printed document; it is subject to change as policies are revised or guidance is updated. When changes are made to the Quality Manual, these are routinely logged in an area which can be accessed at any time by using the “Recent changes” button in the lower right corner of every page (within the Quality Manual). Similarly, changes that have been approved but which are not live yet or which are being considered can be found in the ‘Coming Soon’ section of the Quality Manual. Coming Soon Recent and coming soon Quality Manual changes pages should be standing items on all Education and Student Experience committees. Regular summaries of changes are also emailed directly to key contacts. It is School’s responsibility to notify QSC of changes to key contacts (e.g. if a new Director of Education and Student Experience is appointed). Also, if you wish to be added to this circulation list, please email Quality-Manual-Enquiries@nottingham.ac.uk. 1.0 Reformatted to align with new University of Nottingham Policy Management Framework; Content also reviewed and updated to improve clarity. QSC July 2024 Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}