{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-students-studying-in-outside-organisations.aspx",
    "content": [
        {
            "p": "This page provides information for postgraduate researchers who wish to apply to conduct their research studies away from the University of Nottingham. Its content is relevant to staff and postgraduate researchers across all of the UK, China and Malaysia campuses. The research study of any postgraduate researcher may in appropriate cases take place away from Nottingham. This may be another higher education institution, a non-academic collaborating organisation, or another location where the candidate will continue to progress their research work or thesis. This includes where the candidate will be progressing their research or thesis at: Such arrangements may apply equally to full-time and part-time postgraduate researchers and may cover all or part of the total period of directed study including thesis pending in the case of UNUK and UNM registered students on a visa. Postgraduate researchers wishing to study for more than 4 weeks away from a University of Nottingham campus must make a request to the University about the arrangements for this, by completing the study away form: PGR students must have completed registration and commenced their doctorate before an application for study away from the university can be made. PGRs cannot commence their study away from the University except in the case of PGRs on collaborative arrangements where the formal agreement specifies this. All postgraduate researchers who study for part or all of their research degree away from Nottingham are subject to the normal regulations and procedures covering research students. The University of Nottingham supervisors are responsible for ensuring that the researcher complies with all programme requirements, such as, but not limited to supervisions and Monitoring and Progression Reviews whilst they are studying away. In addition, the following special considerations should be incorporated into the management of the student/programme. Includes: Memorandum of Agreement; local supervision at collaborating institutions; availability of facilities at collaborating institutions; level of support at collaborating institutions Many collaborative arrangements will arise from a formal Memorandum of Agreement (MOA) either at School or institutional level with another institution. In such cases the MOA should outline the supervisory arrangements and programmes of study for the candidates involved in the collaborative agreement, and may include special arrangements for examination. In other cases the collaboration will be between individual members of academic staff and in such cases the supervisory arrangements and programme of study should be considered on an individual basis. All candidates who are accepted for admission to a research degree which will require periods of time to be spent away from the University at a collaborating institution must be informed of their outline programme of study and any supervisory arrangements at the time the offer of admission is made. Where the postgraduate researcher is studying at a collaborating organisation, they will in addition to their University of Nottingham supervisors also usually have a local supervisor in the organisation in which they will be working. The local supervisor must have an appropriate level of understanding of the academic area of the candidate’s topic of research. The local supervisor would normally be expected to be a postdoctoral member of staff, or of equivalent status, at the outside organisation concerned and may in some instances be an Honorary Professor or Honorary Lecturer of the University of Nottingham. The School must notify Registry and Academic Affairs of the names and qualifications of any local supervisors and the supervision arrangements that have been put in place. In accepting or permitting study away from the University at collaborating institutions for extended periods, it is the responsibility of the Head of School to ensure that the essential facilities, including laboratory and library facilities, at the collaborating organisation are suitable and will allow the candidate to conduct their research at a satisfactory level. In addition, the Head of School should ensure that, as far as can reasonably be foreseen, the facilities and resources will continue to be available for the duration of the postgraduate researcher’s period of registered study. In all cases the Head of School should ensure that the arrangements for study and supervision at the external institution/organisation provide an appropriate level of support and reflect the ethos of the University's quality assurance framework. Where practice varies between the University and another institution, the School should ensure that the support provided is at least equivalent to that defined in the Quality Manual, although the detail may vary. Postgraduate researchers should be made aware of the individual arrangements that apply to them and where the precise Quality Manual arrangements will not apply. Where the postgraduate researcher is applying to study away in order to conduct fieldwork or archival research, this must comply with the University Health and Safety Travel and Off-site Working (including fieldwork) policy and guidance. For more information please consult the following page: Travel and off-site working (including fieldwork) policy Postgraduate researchers registered in the UK may be permitted to study away from the University including from either a UK location distant from Nottingham (from which it is not possible to readily commute to a University of Nottingham campus), or an overseas location when they have no current requirement for physical access to on-campus research facilities. In such circumstances the Head of School/Director of PGR Study should be assured that suitable remote supervisory and other arrangements are in place to enable the candidate’s research to progress and enable their engagement in relevant training and research activities. In such cases the fact that study was being undertaken away from the University cannot later be given as the reason for lack of progress or for the candidate’s inability to engage with or attend any mandatory course requirements. Where a candidate is following a programme under a formal Collaborative Arrangement agreement study away will only be possible if specifically stated in the Memorandum of Agreement. International postgraduate researchers on a visa should seek advice from the visa and immigration team before making an application under these circumstances. Postgraduate researchers registered at UNNC and UNM may be permitted to study away from the University when they have no requirement for physical access to on-campus research facilities. Postgraduate researchers should seek advice from their campus Graduate School and Visa and Immigration Team before making an application. In such circumstances the Head of School/Director of PGR Study should be assured that suitable remote supervisory and other arrangements are in place to enable the candidate’s research to progress and enable their engagement in relevant training and research activities. In such cases the fact that study was being undertaken away from the University cannot later be given as the reason for lack of progress or for the candidate’s inability to engage with or attend any mandatory course requirements. It is the responsibility of the School or Doctoral Training Programme, in conjunction with supervisors, to identify the training needs of individual postgraduate researchers, to ensure needs are met and to determine the means by which they are met. How completion of any mandatory training requirements will be met must be considered as part of any application to study away. Where possible research training should be undertaken at the University of Nottingham. However, some training may be more appropriately provided at a collaborating institution or external organisation. If you have any problems or queries relating to this page, please contact: Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}