{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2009.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2009. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. The Faculty of Medicine and Health Sciences Fitness to Practise Procedures have been updated to reflect changes in Faculty structures and nomenclature, and: Policy on the audio and visual recording of lectures and other interactions by students has been added to the Miscellaneous Policies section. A flow chart of progression, compensation and reassessment for Postgraduate Taught Courses has been added to the Regulations for Taught Masters Degrees, Postgraduate Diploma and Postgraduate Certificate courses. Regulation 18 of the Taught Postgraduate Regulations has been amended to allow students a second resit opportunity, at the discretion of individual Schools. Learning & Teaching Committee has agreed revisions to the University of Nottingham Qualifications Framework (UNQF) in light of changes to the QAA Framework for Higher Education Qualifications and the National Credit Framework for HE in England, both of which are effective from September 2009. The following changes have been made: http://www.nottingham.ac.uk/quality-manual/QAstructures/UNQF-AppendixB.htm http://www.nottingham.ac.uk/quality-manual/QAstructures/UNQF-AppendixA.htm Following the acceptance by Learning and Teaching Committee of recommendations made by the Marking and Classification Working Group the Quality Manual has been updated as follows. Full guidance may be viewed in the relevant sections. 1. School Examination Boards Where programmes are offered at the International Campuses, there should be appropriate involvement of International Campus Staff in the School Examination Board. 2. Code of Practice for External Examiners Powers of the External Examiner Point 9.2 relating to the entitlement to meet with students has been extended to include reference to meeting students from the International Campuses. Point 9.5 has been replaced by a new Point 9.5 and 9.6 relating to the involvement of External Examiners in adjusting marks and the signing of marksheets by External Examiners. Dealing with the External Examiner's Report Where programmes are offered at the International Campuses, Schools should ensure that a copy of the External Examiner report is available to the International Campus and that they International Campus is involved in the response submitted to the external examiner and University. In addition, the External Examiner Report Form has been updated to encourage specific reference to programmes offered at the International Campuses where these are offered. Late Submission of Extenuating Circumstances : revised guidance on the late submission of extenuating circumstances was approved by Learning and Teaching Committee in February, to be effective immediately. The guidance has been revised to state: ‘Schools are entitled to reject automatically and without consideration all extenuating circumstances claims that are submitted after the relevant marks or qualification outcomes have been published to students. The only exception to this provision is where the student provides authoritative evidence (e.g. from a doctor) that they were clinically unable to submit the extenuating circumstances any earlier.' Updates to the Assessment Section of the Quality Manual 1. The section on Rounding within the Marking and Grading guidance has been amended to provide more clarity. 2. Examples of Marking Schemes are available in the Good Practice Guide. Schools are encouraged to forward copies of marking schemes using the full range of marks (including categories above 70% and below 40%) to Sandra Mienczakowski for inclusion in the Guide. 3. Following the acceptance of recommendations from the Marking and Classification Working Group by Learning and Teaching Committee, the following updates have been made to the Quality Manual to be implemented for students registering on programmes from the 2009/10 academic year onwards: i) Use of Borderlines :http://www.nottingham.ac.uk/quality-manual/assessment/degree-class.htm Schools should use a weighted profiling system for determining the degree class of borderline students and this should be made explicit and clear to students at the start of their studies through School Handbooks. Examples of profiling systems are available in the Good Practice Guide and Schools are encouraged to forward copies of profiling systems already in use to Sandra Mienczakowski for inclusion in the Guide. ii) Approved degree classification weightings : http://www.nottingham.ac.uk/quality-manual/taught-programmes/programme-specifications.htm A list of approved degree classification weightings has been added to the Programme Specification Guidance. The use of these weightings in degree calculation should be applied to students commencing their studies in 2009/10 and graduating from 2011/2012. iii) Use of Vivas : http://www.nottingham.ac.uk/quality-manual/assessment/marking.htm . Further guidance on the use of individual vivas for borderline candidates on taught programmes has been added to the section on Viva Voce Examinations. Formal records of all such vivas should be kept. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}