{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-applications-for-restriction-or-embargo.aspx",
    "content": [
        {
            "p": "This page contains information in relation to a restriction or embargo being placed on a thesis containing politically, commercially or industrially sensitive content. This information may be of interest to staff and students from across all of the UK, China and Malaysia campuses. Includes: scope; external funding considerations; thesis restriction application form If a thesis includes work which is politically, commercially or industrially sensitive, it is possible for a student to apply for access to the electronic copy held in Nottingham eTheses (for UK and Malaysia) or Research Information System (RIS) for China, to be restricted. In such case an application for restriction should be included when the student submits their thesis. Some research projects are funded, partly or wholly, by outside agencies and a restriction may be stipulated in the contract which is drawn up with the University. If no contract exists, it is the responsibility of the student to put together a structured case to support their application for a restriction, in consultation with their supervisor. The University's Quality and Standards Committee (QSC) can grant a restriction of access to a thesis for a period not exceeding 2 years in the first instance with the possibility of an extension of that period up to a maximum of 5 years. Thesis restriction means that no part of the thesis, including the bibliographic details (author, title and abstract), is discoverable. Students should be aware that imposing a restriction means they will be unable to show their thesis is published within the repository. Restrictions will normally only be granted on the basis of the actual or potential confidentiality of the contents of the thesis, e.g. to protect a patent application. A restriction on a thesis does not affect the award of the degree in any way. An application form is available here: As part of the application the student's supervisor is responsible for providing a statement regarding the research being undertaken, including comments on the need for a restriction and the current research project number. Includes: application; submission; decision; extension; retrospective application The student concerned completes an 'Application for a Restriction to be placed on a Thesis' form (provided in the previous section) ensuring all boxes have been completed. Although the student may not know the relevant research project number, it is important that the student's supervisor provides this piece of information. The form is then submitted by the student, with their thesis, to Registry and Academic Affairs in the UK or the Graduate School in UNNC or the Student Registry Office in UNM, for processing. Once the Quality and Standards Committee (QSC) has made a decision about whether or not the restriction can be granted, the student will receive formal notification of the decision from the University. A copy of this notification is sent to the student’s supervisor and UoN Libraries to implement the restriction in Nottingham eTheses or RIS as required. A final decision on an application can be expected within approximately 6 weeks of receipt of the form by Registry and Academic Affairs in the UK or the Graduate School in UNNC or the Student Registry Office in UNM. It is possible to apply for an extension to the period of restriction once the initial period has lapsed and this is done by completing another copy of the original form. The onus is on the student to do this, as there is no process for notification of the expiry of the restriction. In the case of a retrospective application, the electronic copy may already be discoverable. In this case the form may be copied by the student or School to UoN Libraries to request immediate restriction as a temporary measure until the Committee reaches a decision. Requesting an embargo will defer publication of the thesis for a set period of time, usually a maximum of 1-2 years, before it becomes available to read. (For Creative Writing students only, an extended embargo of up to 7 years to enable publication of the work is permissible). Embargos are not formal restrictions as they can be directly requested by the thesis author at the point of upload to the Nottingham eTheses or RIS repository, as relevant. Before choosing to request an embargo, students should discuss the matter with their supervisor to ensure they take account of funder/sponsor expectations relating to open access for the thesis, as well as any other funding conditions. It is important to note that with embargoed theses, the bibliographic details (author, title and abstract) remain discoverable and available to read. A student should consider whether the abstract contains commercial or sensitive information in consultation with their supervisor when they are assessing whether embargo or a formal restriction is required. Where an embargo is applied to the thesis it cannot be released without author permission. Please consider pre-approving a request from supervisors to view the thesis during an embargo period. More information on how to request embargo can be found here: Submission information pack for PGRs Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}