{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/school-examinations-officer-role.aspx",
    "content": [
        {
            "p": "This page sets out the role and duties of a School Examinations Officer. This information is primarily directed at role-holders and Schools but may also be of interest to staff and students across all of the UK, China and Malaysia campuses. Includes: School responsibilities; specific duties; key documentation; Registry and Academic Affairs UNUK, Academic Services Office UNNC, Student Registry Office - Exams and Assessent Team UNM Schools must have detailed procedures to ensure effective operation of assessments and exams. It is essential to define clearly the responsibilities of individuals and deadline dates. The procedure must cover: The specific duties of a School Examinations Officer (or in the case of taught postgraduate examinations, the Examinations Officer for a particular taught postgraduate course), which may be one or multiple people, will depend on the organisational structure within the School. The School Examinations Officer, or delegates, will normally incorporate: Exam delivery facilitation including: Marks processing and Exam Board facilitation including: In addition, please provide Registry and Academic Affairs UNUK, Academic Services Office UNNC or Student Registry Office - Exams and Assessment team UNM with: For more information about the University's academic regulations, please consult the following: Academic regulations Includes: external or later sittings; clarity of procedures; reassessment details and notification Examinations Officers should also provide students with: Please be aware that during academic year 2019/20, the University introduced exceptional regulations in response to the Covid-19 pandemic. This page was previously affected by these arrangements and has been documented accordingly. Further details can be found in the \"Exceptional regulations applied in response to Covid-19\" section below. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}