{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/qsc.aspx",
    "content": [
        {
            "p": "This page contains information on membership duties and support, and the process of appointment and replacement. This may be useful for staff and students across all UK, China and Malaysia campuses. The purpose of the Quality and Standards Committee is to: Quality and Standards Committee (QSC) is key to university processes and ensuring standards, with a membership spanning all Faculties and Campuses. Additional members from Professional services departments and hold a post on QSC are 'ex offico' (i.e the role on QSC comes with the underlying role) For the faculty representatives in the UK, this will include separate representatives for undergraduate and postgraduate levels within each Faculty. The international campuses currently operate slightly differently in that the Associate Deans for Teaching and Learning are members, by virtue of their post. Thus for UNNC and UNM, there is one additional QSC representative for each Faculty (not two). The process and terms of appointment for the Faculty QSC Representative role is as follows: Responsibilities of Quality and Standards Committee (QSC) members include: Members of QSC may not be able to take on posts at school or faculty level which may sometimes be in conflict with the duties of the role as outlined above. Members of QSC will not be given items for consideration which have been put forward for approval by their own School. In all of the above activities, members can expect to receive full support and guidance from appropriate members of Registry and the Admissions team. This will include providing information on precedents in handling appeals cases and on arranging discussion of issues arising from the approval of programme specifications. In some cases, the Committee may need to take actions notwithstanding regulations. Guidance, in the event of such situations, can be found in the following: How to propose changes to the Quality Manual How to submit an 'outside' regulation case to the Quality and Standards Committee Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}