{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-regs-maresearch-mscresearch-sept18.aspx",
    "content": [
        {
            "p": "This page contains the regulations for the Degree of Master of Arts by Research (MA by Research) and Master of Science by Research (MSc by Research) from September 2018. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. For students commencing their programmes before this date, the MA/MSc by Research Regulations (pre-September 2018) will apply. For more information, please consult the following: Regulations for the Degree of Master of Arts by Research (MA by Research) and Master of Science by Research (MSc by Research) before September 2018 1. Requirements for admission to a research degree are set out in the Entry requirements section, which can be found here: Entry requirements 3. Students are required to study modules worth 180 credits, of which a maximum of 60 credits may be obtained from taught modules at Level 4. The remaining credits (between 120 and 180) must be obtained from a thesis module at Level 4. Any taught modules taken must be clearly cognate with the student’s research topic. Supervision while undertaking the thesis module will be as set out in the module specification and in line with the requirements for supervision as set out in the regulations for research degrees. Includes: period of research for the degrees of PhD and MRes Includes: module specifications; submission of thesis before end of registered study 5. The assessment of all modules is as set out in the specifications for those modules. In regard to the thesis module, the maximum word length of the thesis is as follows: The maximum word limits are all inclusive of appendices, footnotes, tables and bibliography. The Thesis should embody the result of the candidate’s advanced study and research. 6. Students are required to submit their thesis prior to the end of the period of registered study. Two copies of the thesis should be submitted to Student Services or equivalent (in a form prescribed by the University), who will forward the thesis to the Examiners. The thesis should not, whether in the same or a different form, have been submitted to this or any other University for the award of any degree. 7. The thesis must be the result of the student’s own work. The requirement does not preclude a student obtaining limited assistance with proof-reading and with the routine collection and/or processing of data under guidelines and instructions clearly devised by the student. When such help is obtained it should be with the prior approval of the supervisor who must be satisfied that the spirit of the 'own work' requirement is not breached. 8. The thesis is examined by both an External Examiner and an Internal Examiner appointed under the regulations governing the assessment of research degrees, who should provide independent reports on the thesis, indicating whether the thesis module has been passed; and also whether a viva voce examination is necessary. Where a viva voce examination is required, this should be conducted in line with the relevant regulations for MPhil degrees. Includes: award of degree; where a student obtains a fail mark or fails the thesis module; nottingham etheses service 9. The degree is awarded where all taught modules (if any taken) and the thesis module have been passed. The pass mark for the taught modules is 50%, but marks of 40%-49% can be compensated in up to 20 credits if the overall average for the taught modules taken is 50% or over. 10. Where a student obtains a fail mark in a taught module that is not compensated, or fails the thesis module, the student has one further opportunity to pass those modules. All reassessments must be completed within one year of the end of the student's period of registered study. 11. The qualification awarded to the student will include the subject of study undertaken as notified to the student at the time of admission. 12. Successful candidates will be eligible to graduate once their thesis has been uploaded to the University’s etheses service and approved by the Internal Examiner or, in cases where there are two external examiners, the lead External Examiner. Nottingham eTheses service Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}