{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2017.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2017. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. MINIMUM ENGLISH LANGUAGE ENTRY REQUIREMENTS Changes were made to the policy relating to Medicine, Nursing and Midwifery, Physiotherapy and Sport Rehabilitation, and Veterinary Medicine and Science. APPROVAL OF BUSINESS CASES FOR PROGRAMMES DELIVERED AND UNMC AND UNMC The policy on Programme Design, Development and Approval was updated (specifically para 5 under Approval). The effect of these changes are: POLICY ON LONG TERM CONDITIONS OR DISABILITIES Enhancement to the existing policy for the purposes of clarity: changes to indicate who is responsible for decision-making and additional text to ensure that students are aware of what is required of them in the event they have not been notified of an outcome by the time of the coursework deadline. UPDATED PGR FORMS A number of forms relating to PGR were updated; this includes Voluntary Interruption of Study, Request for an Extension to Thesis-Pending, Notification to Submit, and other related documents. PERSONAL TUTORING, STUDENT SUPPORT AND DEVELOPMENT Updates have been made to the Personal Tutoring, Student Support and Development Policy, specifically to clarify the roles and responsibilities of Schools, Senior Tutors and Personal Tutors. COMPLAINTS AND CONDUCT PROCEDURES Substantial amendments have been made in respect of the policy previously known as Extenuating Circumstances Policy and Procedure, which has been renamed Policy on Circumstances Affecting Students' Ability to Study and Complete Assessments, and the previous policy and procedure has been separated into a number of sub-processes and policies. The Extenuating Circumstances procedure itself has changed, resulting in alterations to the processing, consideration and outcomes of claims. These amendments have resulted in revisions to the Academic Appeals policy, including a new ground for academic appeal. There are a number of changes to Complaints and Conduct procedures* from the start of the 2017/18academic session to reflect amendments approved by QSC in May 2017. All policies and procedures now use the term ‘supporter’ to describe the person who accompanies a student to meeting, hearings etc. The pool from which the supporter can be drawn is limited to: SU Education Adviser (or equivalent at UNNC/UMNC), fellow student, member of staff, Union representative (eg BMA, RCN). A new policy on Communications with Third Parties has been introduced as well as an Unacceptable Behaviour policy in respect of students engaging with Complaints and Conduct procedures. *Academic Appeals, Academic Misconduct, Student Complaints, Code of Discipline, Fitness to Practise RETURN OF COURSEWORK NEAR EXAM PERIODS Changes have been made to the Feedback to Students policy (section 1, Assessed coursework) and Academic Misconduct policy (section 3.1.5) following recommendations made by a working group tasked with reviewing the approach of coursework return during exam periods when a student is suspected of academic misconduct. ANNUAL MONITORING QSC approved updates to the Annual Monitoring pages of the Quality Manual, to include more detail of the Annual Monitoring cycle and to clearly communicate responsibility for different aspects of the process. POLICY FOR APPROVAL OF CHANGES TO PROGRAMME SPECIFICATIONS QSC approved an update to the Policy for Approval of Changes to Programme Specifications pages of the Quality Manual, which included extending the definition of 'significant changes' to include instances where the number of compulsory modules is being increased in a manner that reduces student module choice, and requiring that applicants who have accepted an offer of a place on a programme be informed of significant changes to programme structures. STATEMENT OF RESPONSIBILITIES Devolution Statements were re-named Statement of Responsibilities. The associated policy, statement template and Taught Annual Monitoring form were updated in line with this. APPLICANT COMPLAINTS POLICY An Applicant Complaints Policy and Procedure was approved by QSC and the Quality Manual updated to reflect this. UPDATED FORMS The Course Transfer from Foundation to Honours Degree request form, Taught Course Transfer request form, Voluntary Interruption of Studies from a Taught Programme form and Notification of Withdrawal form were all updated in the Quality Manual. DEVOLUTION STATEMENTS Quality and Standards Committee approved the implementation of Devolution Statements and an associated standard template, to aid Schools in documenting their position in relation to devolution of responsibility for provision on UNMC and UNNC. The International Campuses and Quality Assurance section of the Quality Manual has been updated to reflect this. All Schools or Departments with provision on UNMC and/or UNNC is expected to ensure all provision is covered by a template (or multiple templates should this be necessary). The Annual Monitoring process will provide institutional oversight of this. STUDENT ENGAGEMENT The Student Engagement policy has been updated post approval by Quality and Standards Committee. Each School, Department and Division is required to hold an LCF meeting. All Teaching Committees (or equivalent) should ensure that they include student representation, and should include the Education Rep (for undergraduates). Consideration should be given to including Schools, Departments and Divisions, where appropriate, representatives from Information Services (IS), Student Services, Learning Technology of Libraries, Research and Learning Resources. Each Faculty must ensure that they have student representation at their Teaching and Learning Boards and Student Experience Committees (or equivalent, on each campus); in the UK for undergraduates this should include the Faculty Representative and for postgraduates this should include the relevant Postgraduate Sounding Board member. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/fitness-to-practise-procedure-faculty-of-medicine-and-health-sciences.pdf"
    ]
}