{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/max-period-from-initial-registration.aspx",
    "content": [
        {
            "p": "This page provides information to all students about the maximum periods for the completion of studies from their initial points of registration. This information is relevant to staff and students across all of the UK, China and Malaysia campuses. Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship Students may need to extend their normal period of engagement with an individual programme for a variety of reasons. The University is flexible in making such arrangements, but there is an expectation that students will complete their studies within an absolute maximum time period from their initial registration, regardless of individual circumstances, to ensure the currency of their knowledge, their competency and the quality of their degree. To that effect, please be aware of the following: An exception to the application of these maxima is where a student has a disability, or carer responsibility, that is causing, or has caused, the delay in completing their studies. Whilst the University would normally expect the maximum periods from initial registration to provide adequate opportunity for adjustment and support for students with disabilities, or carer responsibilities, there may be exceptional circumstances, beyond one year, in which further adjustment to maximum periods could be considered. In this case, the student must provide the school with an explanation and evidence of their circumstances. The school will then need to judge whether, in the light of these circumstances, it is possible for the student to complete their studies within a period that sufficiently ensures the currency of their knowledge, their competency and the quality of their degree. If the school believes that it is, on balance, appropriate to extend the absolute maximum for that student, they will then provide a new absolute maximum to which the student must adhere. Extensions to the maximum period of registration authorised by the School must be reported to the Quality and Student Management Systems Team in Registry and Academic Affairs (RAA). Extenuating Circumstances For more information concerning regulations for students who have not met their honours requirements, please consult the following category: Academic regulations Academic Regulations Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}