{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/marking-by-number.aspx",
    "content": [
        {
            "p": "This page contains the University's marking by number principles. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Marking by numbers (or anonymous marking) for all formal written examinations was adopted throughout the University from the 1996/97 session. An outline of the system is given in the next section. Schools should ensure that students are given information regarding where in the assessment process anonymity ends. As a minimum, anonymity should normally be retained until marking and internal moderation has been completed. 1. All formal written examinations should be included with the exception of multiple choice papers marked by Optical Mark Recognition (OMR) where marking by number is not appropriate. The system does not apply to pieces of coursework or class tests, although Schools may decide to devise a way of including these. 2. The student ID number is used to identify students. 3. Answer books with a fold-down flap under which the candidate's name is written are used. Using this type of answer book provides a safe method of marking by number as the name on each script can be revealed if necessary. 4. The name is revealed following agreement of a mark. There are various ways of doing this: the flap need not be opened as a list of names and numbers provided electronically from Campus Solutions can be used to transcribe marks. Marks considered at the Examiners' meeting will be listed by name so that extenuating circumstances may easily be reported. 5. In the examination room there will be two copies of the attendance register, one with name and number and the other with number only. The numbers only register must be enclosed with the scripts for use within the School, while the name and number register will be returned to the Examinations Office with the attendance cards. This procedure is outlined clearly in the notes for invigilators which is circulated to all Schools a few weeks before the examination period. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}