{
    "url": "https://www.nottingham.ac.uk/qualitymanual/personal-tutoring-student-support-and-development/teaching-timetable-arrangements-for-disabled-students.aspx",
    "content": [
        {
            "p": "This page provides information on teaching timetable arrangements for disabled students. Its content is directed at staff and students across all of the UK, China and Malaysia campuses. The University of Nottingham aims to ensure that disabled people have equal opportunities to benefit from, and contribute to, the learning and services available in higher education institutions. In the UK the Equality Act 2010 covers all aspects of the physical environment including access to, and facilities in, teaching rooms. The Persons with Disabilities Act Malaysia 2018 aims to ensure all students based at the Malaysia have equal access to educational opportunities. The Law of the People’s Republic of China on the Protection of Disabled Persons 2018 ensures the right to equal access to educational to disabled persons. The Quality Assurance Agency (QAA) Quality Code for Higher Education also makes reference to access to an inclusive environment for learning and aims to ensure that all students have equal access to educational opportunities. The University is strongly committed to equality of opportunity in its provision for all students, providing ongoing support with the focus being on providing accessible services and supporting students in completing their courses as independently as possible. As part of this commitment, the University believes that teaching rooms should be allocated and timetabled with the needs of disabled students in mind, including additional space for wheelchair users and scribes. This includes taking account of physical access to buildings/rooms, the surrounding environment (for example, parking provision) and facilities in the teaching rooms themselves. For more information about the services provided by Disability Support Services, please consult the following: UNUK Disability support services UNM Disability Services UNNC Disability support service There is a procedure in place for making alternative arrangements for disabled students: Information can be found at: UNUK Module enrolment UNM Course enrolment UNNC Academic services Disabled Students Examination arrangements for disabled students Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}