{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/pol-applicant-complaints.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on applicant complaints. Its content is primarily directed at applicants but may also be of interest to staff and students across all of the UK, China and Malaysia campuses. For the purposes of this policy, an applicant complaint is: \"an expression of dissatisfaction by one or more applicants about a University's action or lack of action, or about the service provided by or on behalf of the University.\" Includes: Level 1; Level 2; Level 3; link to the Applicant complaints procedure page There are 3 Levels to the University complaints procedure: For more detailed information about the procedure, please consult the following page: Applicant complaints procedure Applicants to any of The University of Nottingham campuses may use this procedure. Anyone wishing to make a complaint is encouraged to do so personally. Where a third party (such as a parent or guardian) makes a complaint on behalf of an applicant, the applicant’s express written consent that the third party is acting on their behalf will be required. All correspondence will be copied to the applicant as well as to their representative unless otherwise agreed. Anonymous complaints will not be considered unless there are exceptional and evidence-based reasons to do so. In many circumstances, raising a concern anonymously could impede investigation and communication of the outcome. Includes: Dignity at Nottingham Policy The subject of the complaint should relate specifically to one or more of the following, or comparable issues: Complaints relating to allegations of bullying, harassment or victimisation by members of staff are associated with the Dignity at Nottingham Policy within the University and should be addressed to the Director of Human Resources. If the complaint is within the scope of the Dignity at Nottingham Policy and informal resolution is not appropriate then a formal investigation in accordance with the policy will be undertaken. Student Services will be informed that a complaint has been made and against whom (no further details will be divulged). Once the Dignity Investigation Procedure has been completed, if the applicant’s allegations are proven, then the applicant may bring a level 2 complaint relating to the impact of the behaviour on their application within one month of the date of the outcome letter. For more information about the Dignity at Nottingham Policy, please consult the following: Dignity at Nottingham Policy Challenges to the academic judgement of a member of staff and/or School, including the outcome of an admissions decision. Disagreement with a policy/regulation rather than its application. A matter of public interest which may be better suited to the Whistleblowing (Public Interest Disclosure) Code. For more information, please consult the following: Whistleblowing (Public Interest Disclosure) Code Complaints should be treated seriously and applicants must not suffer any disadvantage or recrimination as a result of making a complaint in good faith. It is expected that applicants and their representatives will conduct themselves responsibly and treat the complaints process and those members of the University involved in the process with respect at all times. In all cases, it is desirable that complaints are resolved informally and quickly between the relevant parties, and that the formal process is only started if that fails. Evidence of an attempt at informal resolution will be required. Complaints must be substantiated with evidence, expressed in clear and succinct English and submitted within prescribed timescales. Complaints submitted outside of the timescales stipulated in the procedure will only be considered in the most exceptional circumstances and where there is good reason, supported by evidence, for the late submission. The University is committed to ensuring that complaints are handled in accordance with its published procedure. Occasionally, it may be sensible for the University to deviate from the procedure if strict adherence to it could give rise to perceptions of prejudice or bias. Complaint procedures are internal to a university and do not have the same degree of formality as a court of law. As such, legal representation in meetings is not necessary or appropriate for an applicant or the University during the complaints process and will not, therefore, be permitted. The University will not accept or investigate complaints which it considers frivolous or vexatious and observes Office of the Independent Adjudicator (OIA) OIA guidance to identify such complaints. For more information, please consult the following: Office of the Independent Adjudicator Complaints form part of the University's process of quality review and improvement and are considered as providing valuable feedback rather than criticism. Applicants will be notified early in the process if the remedy sought within the complaint is beyond the power of the University to deliver. It is important that complaints are monitored in order to improve the applicant experience. Admissions will record and provide reports to indicate the nature of complaints and complainants, and resultant action. Such reports will: Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}