{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/admissions-procedures-disability-medical.aspx",
    "content": [
        {
            "p": "This page provides information on admission procedures for applicants with a disability or long-term medical condition. Its content is primarily aimed at prospective students based within the UK but may also be of interest to staff at all of the University's campuses. Includes: requirements; Equality Act 2010 As a public sector body the University must show due regard (as outlined within the Equality Act 2010) to the need to: For more information about the Equality Act 2010, please consult the following: Equality Act 2010 Includes: University of Nottingham Malaysia; University of Nottingham Ningbo China Please be aware that our admissions practices differ for the international campuses. For more information about each campus' requirements, please contact the following: Includes: UCAS code descriptors; next steps; exceptional reasons for the rejection of an application As part of this commitment, the University believes that admissions processes should be as equitable as possible for all students. All applications from candidates who have disclosed a disability will be considered in the same way as any other application and a decision will be made that is based upon the candidate’s academic merit and potential. The legislation with which the University's policy complies is now the Equality Act 2010 (replacing the previous provisions that were outlined in the Disability Discrimination Act 1995 and the Special Educational Needs and Disability Act 2001) which applies equally to disabled students and disabled applicants. Applicants are encouraged to disclose a disability when they apply by completing the relevant section of their application form (Personal Details of the UCAS form, section 10 of the Postgraduate Application paper form, section 4 of the online Postgraduate application form). The codes on the UCAS form for Disability/Special needs (including dyslexia) and medical condition box are as follows: You have two more more impairments and/or disabling medical conditions A code other than A means the applicant has indicated some form of disability (for the purposes of this function, dyslexia is included as a disability) and reasonable adjustments may be required. Where an application made indicates a disability code other than A or G this application is referred by the Admissions Office to the Disability Support Team. The applicant’s requirements are considered and appropriate action is taken to ensure the applicant understands the support available. In some cases, a meeting will be organised with the applicant and the School to explore such requirements and how these may be met. Following this meeting, support services will be put in place and reasonable adjustments made at the University to address barriers which disabled students may encounter in the learning, teaching and assessment environment and which may affect performance. The Admissions Office will send a letter to all other applicants who have disclosed a disability and who Disability Support do not consider it necessary to meet. The letter is sent to those who have accepted conditional, unconditional and insurance offers, outlining services available at the University. A form is enclosed with the letter inviting the applicant to contact Academic or Disability Support with any requirements they may have. Whilst the provisions of the Equality Act 2010 normally make it illegal to reject an applicant on the grounds of disability, there are three instances in which a university can reject a disabled applicant if they have the entry criteria necessary and these are: Includes: Disability Liaison Officer; contacts and correspondence Each School has a Disability Liaison Officer (DLO) to provide a point of reference, advice and guidance for members of staff and students in the School about disability issues and support. Admissions staff should check with applicants whether they have any individual requirements prior to the interview or Open Day, and may wish to seek guidance from the School’s DLO beforehand. In certain situations, a Department or School will carry out its own admissions selection process (for example, research degrees). For more information about the DLO role, please consult the following: Student with disabilities To ensure that student performance at assessment is optimised and to comply with our legal obligations, any correspondence inviting potential students to an interview or assessment should always include the following text: \"Please inform me as soon as possible if you have any individual requirements which need to be made for you because of a disability in order to attend the interview, for example a ground floor interview room\". Academic or Disability Support may also be contacted before the visit if the candidate has any academic-related study requirements or issues relating to accommodation or transport prior to the student’s visit. Upon offer of a place to study at the University, the applicant should be referred to the Disability Support Team. For more information about the University's Disability Support Services, please consult the following: Disability Support Services Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}