{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pol-e-exams.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on e-exams, including an outline of its minimum expectations. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. Includes: definition; expectations; staff and School requirements; technical failure; student access 1.1 By electronic exams (e-exams) we mean summative assessments set in Moodle (including via Turnitin) or ExamSys for a whole module cohort of a duration of 24 hours or less. These may be assessments set during the University’s formal assessment or reassessment periods, and also includes assessments that are classified as ‘exams’ in Campus Solutions but take place outside of the University’s designated exam periods. This policy focuses on summative e-exams, so formative e-exams, such as formative class tests run during teaching periods, are not covered by this policy. Additionally, other modes of summative e-exam, such as presentations or language oral exams, which are typically arranged on a one-to-one basis, are not covered by this policy; they would be considered an ‘exam’ (not e-exam) under Quality Manual regulations, whether undertaken in person or remotely (e.g. on Teams). E-exams are therefore treated categorically as ‘exams’, and are separate from the rules governing ‘coursework’. For ExamSys (formerly Rogo) assessments, this includes both exams taken remotely, and exams taken under invigilated conditions on campus. 1.2 Summative e-exams (as defined above) should only be set using ExamSys, Moodle Assignments or Turnitin. Other e-exam platforms are not supported by the University and should not be used for summative exams (with the exception of certain specialist subject assessment tools already approved for use in certain areas). 1.3 The e-exams policy outlines the minimum requirements that the University expects to be met when delivering summative assessment electronically. The requirements of the policy are in addition to normal University policies, procedures and regulations relating to assessment, which will apply unless otherwise stated. 1.4 Module conveners should ensure that approval from their School Teaching and Learning Committee (or equivalent) is obtained before e-exam is used as a tool for summative assessment. 1.5 All staff members involved in the e-exam process must be familiar with the on-line environment and have attended the appropriate University training course prior to gaining access to the system. 1.6 Schools must ensure that e-exam is fit for purpose and does not compromise the assessment methodology and the integrity of what is being assessed. 1.7 Comprehensive University-wide plans should be in place to manage every aspect of the e-exam procedure ensuring that the process is robust, reliable, fair and efficient and that robust contingency plans are in place to mitigate against technical failure. 1.8 For ExamSys (formerly Rogo) e-exams invigilated on campus, where technical failure occurs within the first 75% of the time over which the examination is scheduled, the examination may be rescheduled and/or may be offered in paper form (if appropriate). If failure should occur within the last 25% of the time over which the examination is scheduled, the examination will be abandoned and marks gained may, at the discretion of the exam board, be scaled accordingly. 1.9 Students must be given access to, and be familiar with, the examination format, question types and the technology prior to the summative e-exam. Includes: roles and responsibilities 2.1 Schools wishing to use e-exams should ensure that they comply with the appropriate procedures and policies which include the roles and responsibilities of staff, both within and outside of the School, who are involved in the e-exam process. Schools are responsible for the academic aspect of the e-exam. 2.2 Registry and Academic Affairs (RAA) will be responsible for the practical arrangements for all summative examinations - this includes scheduling, room booking and invigilation. 2.3 RAA will be responsible for establishing a schedule of exams, setting up submission boxes on Moodle, arranging additional time for students with support plans, and communicating the schedule to students and staff. 2.4 DTS are responsible for the technical infrastructure, which enables assessment to occur including technical support during e-exams. 2.5 RAA colleagues will release all e-exam papers on Moodle at the designated times. Appropriate review of pressure points in the timetable will be undertaken by RAA colleagues prior to the exam periods and targeted interventions made to minimise the risk to Moodle. Module conveners will be contacted separately where this is the case. Also, communications on what to expect and how to manage periods of slow function or interruption will be distributed to staff and students ahead of the exam period and via prominent messaging on Moodle. 2.6 Module convenors should continue to provide details of what students should expect from all e-exams including the structure of the paper, the material it covers, and how to revise effectively. Module conveners are responsible for uploading ExamSys e-exams. Once the paper has been uploaded, module convenors are not permitted to answer any questions from students about the paper. Any corrective actions in the event of a question error will be considered during the moderation and marks adjustment processes. For more information about moderation and marks adjustment processes, please consult the following: Policy on marking and grading 2.7 Schools and Departments are recommended to make all students aware of the Essential Guidance for Students on Academic Integrity in Online Examinations. It is recommended that links to this document are also included in the submission box created by RAA colleagues for the e-exams. For more information about Essential Guidance for Students on Academic Integrity in Online Examinations, please consult the following: The Academic Misconduct Procedure Includes: integrity of the examination process; duration of e-exams; extra time for students with support plans; External Examiners 3.1 All e-exams in Moodle longer than 3 hours should be set with a duration of 24 hours. E-exams in Moodle with a duration of up to 3 hours are known as ‘short timed exams’ (STEs) and can be scheduled for 1, 2 or 3 hours. Assessments with a duration of longer than 24 hours are classified as ‘coursework’ and should not normally have deadlines set during designated exam periods, except where student cohorts are unlikely to be sitting significant numbers of exams. 3.2 For e-exams in Moodle of 24 hours, students should be clearly informed that they are not expected to work continuously during the 24-hour assessment window. An indication of active working time (an appropriate number of hours for students to spend on these exams) should be signposted in the rubric on the front of the exam paper: this should not normally be more than 3 hours. Students with extensions due to support plans should also be advised how to approach their assessment windows and active working time within them. 3.3 E-exams using ExamSys will routinely be set during a single working day. In line with current practice, any duration, not normally exceeding 3 hours, is permitted. 3.4 Upload time windows and late submission are covered in the ‘Assessment Regulations’ section of the Quality Manual. For more information about upload time windows and late submissions, please consult the following: Assessment regulations 3.5 For e-exams, students with support plans will be given 50% additional time, with the exception of students who require more than 50% additional time. This 50% extension already includes adjustments such as reading time and rest breaks. i.e. including additional upload times, this is 2 hours 15 minutes for a one hour e-exam, 3 hours 45 minutes for 2 hour e-exams, and 5 hours 15 minutes for 3 hour e-exams. 3.6 For 24-hour e-exams, students with support plans requiring 50% extra time will have an additional five working hours, so submission will fall within the same working day. Students who require more than 50% extra time may be asked to submit their work on the following day. 3.7 The University will explore what provision might be made for accommodating students with disabilities to sit their e-exams on campus, particularly where a scribe is required. 3.8 If Professional, Statutory and Regulatory Bodies (PSRBs) require a different approach to support plan accommodations that deviate from this policy, permission should be sought, via RAA, under the QSC procedure for cases outside of regulations. 3.9 The academic processes surrounding the compilation of e-exams should be the same as those for other forms of assessment but, in addition: i.) External Examiners should have knowledge of e-exams and be provided with appropriate training to allow for effective interaction with the University’s software ii.) In order to fulfil their responsibilities, External Examiners should be granted access to the e-exam software to review examination papers and student scripts in the format in which they are to be delivered. External Examiners should also be made aware of the checks that are put in place to ensure that academic misconduct does not occur. iii.) External Examiners should approve the base design of the e-exam as well as the checks that are put in place to ensure that academic misconduct does not occur. 3.10 In accordance with standard University procedure all questions should be peer reviewed. For more information about the role of External Examiners, please consult the following: Appointment and responsibilities of External Examiners 3.11 In order to protect the integrity of the examinations process, it will only be possible for students to take campus-based invigilated summative e-exams away from designated University examination venues where appropriate checks are put in place to ensure that academic misconduct does not occur. Schools should exercise academic judgement in determining what is appropriate within their subject areas and modes of assessment. Before seeking to implement any such approach, Schools much check the technical and logistical viability of their approach with DTS and RAA. 3.12 Requests to vary the University Assessment Regulations to accommodate e-exams should be made to, and approved by, Quality and Standards Committee (QSC) before the assessment is set. For example, it is recognised that in some cases PSRB requirements may require deviation from the regulations outlined above, and these should be sought, via RAA, under the QSC procedure for cases outside of regulations. For more information about the QSC procedure for cases outside of regulations, please consult the following: Quality and Standards Committee Includes: responsibilities 4.1 RAA will normally be responsible for scheduling all summative e-exams. If, however, the e-exams occurs outside the main exam periods, it is the School’s responsibility to ensure that any requested time slot avoids timetable conflicts for students. Schools should also be mindful of availability of computer rooms outside of the main exam period when they are being used for teaching activity. 4.2 It is the responsibility of Schools to adhere to the published timelines for summative examinations. If the published deadlines dates cannot be met it will be the responsibility of the School to support these examinations in-house. 4.3 It is the responsibility of Schools to ensure the suitability of checks to ensure that academic misconduct does not occur. 4.4 For STEs in Moodle and ExamSys, students will be clearly informed about release times. These will usually be 9am or 1.30pm, but may be 4.30pm or, if needed to protect system performance, release times could be released 15-30 minutes later than these times. 4.5 For 24-hour e-exams, these will usually be released at 9am (Monday to Friday). The submission time will be set on Moodle at the same time on the following working day (Tuesday to Saturday). 4.6 RAA will aim to create an exam timetable which avoids more than two STE exams timetabled in the same day. Students may find that they have two overlapping 24-hour exams, or a short-timed exam overlapping with a 24-hour exam, and these should be treated in the same way as two STEs, since the assessment windows will allow active working time for two assessments within the same working day. 4.7 If a student has a support plan and has a 24-hour exam with a deadline on the same day as another 24-hour exam, or on the same day as an STE, one additional working day will be permitted to complete that 24-hour exam. Therefore if the normal deadline is 09.00 on a Friday, the student’s deadline will already have been extended to 14.00 that same day due to a support plan, and if the student has multiple deadlines that day, their new deadline will be 14.00 on the Saturday. No further extensions can be granted, even if that student has another deadline on the Saturday. 4.8 All exams will be set according to UK time (BST/GMT) when Digital Technology Services (DTS) will be available (Learning Technologies will supplement with out-of-hours support where necessary). Includes: responsibility of the School; information provided to students; checking the accuracy of system generated marks 5.1 The School is responsible for ensuring that students are aware of contingency arrangements to cover technical failure on the day of a scheduled e-exam. 5.2 It is the responsibility of the School to approve all marking schemes which may include negative marking or compensation for baseline guess. Details of how these marking schemes are applied must be made clear to the students before the e-exam. 5.3 Comprehensive programme and/or module information must be provided to students which should include details of all e-exam requirements included marking criteria. 5.4 Students sitting e-exams for summative purposes must be given an opportunity to familiarise themselves with the software before formal e-exam takes place. 5.5 School procedures should include systems for checking accuracy of system generated marks, the accurate recording of these marks within the student record system and protocols for the amendment/removal of flawed questions in line with the moderation and marks adjustment processes. 6.1 Invigilation for centrally scheduled examinations will be through normal University procedures. 6.2 RAA will be responsible for ensuring that invigilation arrangements are appropriate for the medium of delivery. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}