{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/students-withdraw-on-health-and-safety.aspx",
    "content": [
        {
            "p": "This page sets out the University's regulation procedure for students withdrawing on the grounds of health and safety. This content is relevant to staff and students across all of the UK, China and Malaysia campuses. Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship This page sets out the University's regulation and procedure for students withdrawing on the grounds of health and safety. In circumstances where there is serious concern about an individual's physical and/or mental welfare, the University will take all reasonable steps to provide help and support to the student. However, in some exceptional circumstances, it may be inappropriate to allow a student to continue with their studies, and the University has the right to require the individual to withdraw on the grounds of health and safety. In addition, please be aware of the following: The Senate will appoint a Special Committee to deal with recommendations that a student will be required to withdraw either temporarily or permanently on grounds of health and safety will consist of: The presence of student representatives will be subject to the explicit consent of the student facing a recommendation. There will be no student members if the student facing a recommendation so requests. The Registrar will appoint a member of staff to act as Secretary to the Committee and will appoint an Investigating Officer to make the case that a recommendation to suspend or exclude be upheld. Where there are concerns about a student and the difficulties have not been resolved within the student’s home school, and the matter cannot appropriately be dealt with as a disciplinary matter, the Registrar may make a recommendation that a student be required to withdraw, either temporarily or permanently, from the University, or from some part of it. The Registrar may draw upon such professional/specialist advice as necessary in making a recommendation. The recommendation will be presented to a Special Committee of Senate appointed under this procedure. In any case where the Registrar is of the view that the student is to be suspended or excluded immediately, pending a decision of the Special Committee, he may do that by exercising powers under Section XXIV(2) of the University Ordinances. 1. If a school has serious concerns about an individual student's health or safety, the member of staff with primary responsibility (for example, the tutor or supervisor) must in the first instance discuss the difficulties with the student. The concerns must be clearly identified and appropriate support offered if possible. The content and outcome of the meeting must be recorded and the record retained by the school for the duration of the student's course. 2. If the situation is not resolved satisfactorily by this discussion, a further meeting may be convened with the student involving the Head of School (or their nominee). The content and outcome of the meeting must be recorded and the record retained by the school for the duration of the student’s course. 4. Where concerns about an individual student arise elsewhere than in a School, the Residential Experience Manager (for residential accommodation), the Chief Security Officer or another member of the University staff must make a report to the student's Head of School and the Director of Registry and Academic Affairs so that appropriate action may be taken in line with steps 1 to 3. 5. Under the provisions of Section XXIV (2) of the University Ordinances, the Vice-Chancellor, the Registrar or a Pro-Vice Chancellor (PVC) acting on the Vice-Chancellor’s behalf may suspend or exclude any student from any part of the University pending a decision by a Special Committee of Senate. 1. The Senate will appoint a Special Committee to deal with recommendations that a student will be required to withdraw either temporarily or permanently on grounds of health and safety, as detailed in 2.0 Roles and responsibilities. 2. The members of the Committee will be selected to ensure that any persons who have had any direct connection with the case or with the student concerned are excluded. 3. The student may object to any member of the Committee chosen to hear their case on giving reasons for supposing that member not to be impartial. The validity or otherwise of the objection will be determined by the Chair of the Committee, or by the Registrar where the objection is made about the Chair of the Committee. If a committee member is excluded following an objection, an additional member will be nominated by the Vice-Chancellor or the Students' Union, as appropriate. 4. The Committee reserves the right to seek specialist mental health advice when considering the case. 5. The Committee will convene a formal hearing, at which the student has the right to be accompanied by a friend or adviser. Students with a disability may also be accompanied by a support worker (for example, a sign language interpreter or mental health worker) as appropriate to their needs. 6. The student has the right to not attend a hearing. In all such circumstances, a representative of the student may attend on their behalf to present their case. 7. The Committee may in its discretion conduct or conclude a hearing in the absence of the student if, for example, the student fails to attend the hearing after all reasonable effort has been made to invite them. In such circumstances, the Committee will take steps to ensure that the process continues in a fair manner. 8. The Investigating Officer will provide the Committee with a written case supporting the recommendation to suspend or exclude the student. 9. The student facing any recommendation will be given both a copy of the case to uphold the suspension/exclusion and notice in writing of the date and time of the committee meeting to allow time to prepare their case. They will be given a copy of the Rules of Procedure governing the meeting, which will include information about the right to be represented or accompanied at a meeting and to present medical or other relevant evidence. 10. The Special Committee of Senate has the power to confirm or not to confirm a recommendation to require a student to withdraw temporarily or permanently from the University on the grounds of health and safety under the provisions of University Ordinances Section XV (20). 1. The Committee (with the Committee Secretary) will meet briefly in private to discuss procedure and ensure that there are no conflicts of interest. If the Committee is to hear oral testimony, the student, their representative, the Investigating Officer and any other University representative(s) with information relevant to the case will be asked to convene in a waiting area. 2. The Chair will invite the Investigating Officer to make a brief opening statement, and will then invite the Committee to ask questions. If other University representatives are present, they will be afforded the same opportunity to make a statement, and may themselves be questioned. 3. The Chair will invite the student or their representative to make a brief opening statement and will then invite the Committee to ask questions. 4. At each stage the Chair has discretion to allow reciprocal questioning by the various parties. 5. The Chair will ask the Investigating Officer and any other University representative(s), in turn, and finally the student (or the student’s representative) if they wish to make any closing statement and if they are satisfied that they have had a full opportunity to explain their case to the Committee. 6. The student, their representative, the Investigating Officer and any other University representative(s) will withdraw while the Committee considers its decision. 7. Any decision will be communicated to both the student and School in writing within two working days. 8. In all cases, a record of the proceedings must be kept and the student provided with a copy. 1. The Committee will determine whether a student is required to withdraw permanently, or temporarily until certain specified conditions have been met, or for a specified period (with or without a requirement to meet conditions). The student will be informed in writing of the decision and its reasoning. 2. Any exclusion that is not on a permanent basis will be subject to periodic review in the light of developments and any written representations made by the student or anyone acting on their behalf. Such a review would include medical evidence from the individual's medical practitioner, and would also allow for assessment from the University's own appointed medical specialists. Any such representations must be made in writing to the Registrar. 3. A student may appeal in writing against the Committee's decision within seven working days of receipt of written confirmation of that decision. Any suspension or exclusion will remain in place for the duration of the appeal and for any further period during which the matter is under consideration by a Special Committee of Senate. 4. An appeal against a decision of a Special Committee of Senate will be to a nominated Pro-Vice Chancellor (PVC) and can only be made on the following grounds: 5. The PVC may disallow the appeal or refer the matter back to the same or a new Special Committee of Senate for further consideration. A student who has had their appeal rejected at this or an earlier stage can request a completion of procedures letter and put their case to the Office of the Independent Adjudicator (OIA). For more information about the OIA, please consult the Office of the Independent Adjudicator Office of the Independent Adjudicator Code of Discipline for Students Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/code-of-discipline-010120.pdf"
    ]
}