{
    "url": "https://www.nottingham.ac.uk/qualitymanual/professional-work-based-learning/uono-microcredential-regulations.aspx",
    "content": [
        {
            "p": "This section contains the University's microcredential study regulations. These pages are only applicable to learners but may also be of interest to staff across all of the UK, China and Malaysia campuses, and in particular those staff within UoNO. Unless specified otherwise all sections within the University’s Quality Manual apply to Learners enrolled or enrolling with UoNO. For the purposes of the regulations contained within the Quality Manual, Learners study microcredentials (rather than modules) and are to be treated as students of the University of Nottingham (where a regulation refers to ‘student’, it also includes ‘learner’). Microcredentials are small (in time to study) learning blocks, which may or may not be credit bearing. For the purposes of those directly linked regulations, UoNO is to be treated as a School or Department of the University of Nottingham. In all Microcredentials, UoNO follows the Policy on e-learning and distance learning. 2.1 The enrolment processes will be managed by the University of Nottingham, Online (UoNO) as a part of the University of Nottingham. UoNO learners must enrol via the UoNO webpages. 2.2 A learner enrolled on a credit-bearing UoNO Microcredential may not concurrently hold the status of a registered student at the University of Nottingham. 2.3 Learners may enrol direct onto individual microcredentials, but not onto a degree programme 3.1 The Quality Manual pages on assessment provide most of the information learners will require in order to understand how assessment is regulated. 3.2 Key differentiating regulations for UoN Learners: 3.2.1 All Assessment must be completed electronically and submitted through the UoNO platform. 3.2.2 Each assessment and Microcredential will be awarded a grade of either a pass or a fail. The award of a pass will be made where the Learner has demonstrated mastery of each assessed competency at or above the level detailed in the competency standards. Feedback will be provided and marks returned, normally within 28 working days. 3.2.3 A learner enrolled on a microcredential may stay enrolled on that microcredential for a maximum of 12 months from the date of registration, unless there are extenuating circumstances. 3.2.4 All Microcredentials will permit the submission of assessment at three submission points throughout the enrolment period of the Learner’s enrolment on the Microcredential. Learners may submit to more than one submission point in order to pass the Microcredential. They receive feedback each time they submit. It is the responsibility of the Learner to ensure that they are aware of the date of each submission point and that they submit within the required timeframe. 3.2.5 The Extenuating Circumstances regulation applies to all Microcredentials offered by UoNO and provides Learners with details on how they can apply to extend their enrolment for a Microcredential. The impact of an extension to enrolment can be to give a Learner another assessment submission at a later date. 3.2.6 It is the responsibility of UoNO to ensure that submission points are clearly advertised through the UoNO platform. 3.2.7 If a Learner fails to submit their assessment by the last submission point, UoNO will issue them with a ‘Fail: No Resit/Resubmission’ for their Microcredential result. The same outcome will be issued if a Learner does not pass all the required assessments during the enrolment period. Learners will not be allowed another opportunity to submit assessment and will not be eligible to repeat study of that Microcredential at a reduced fee. Should a Learner wish to repeat study of that Microcredential at a later date, they will need to re-enrol for their Microcredential on the UoNO platform and pay the Microcredential fee in full. It will be at the discretion of the UoNO enrolment team as to whether a re-enrolment will be permitted. 3.2.8 Late submissions without an approved ‘Extenuating Circumstances’ claim are not normally permitted. Extensions to submission points are not permitted, excepting cases in which the UoNO submission platform suffers from a documented failure within 24 hours of a submission point. . 3.2.9 Any Learner needing to withdraw should consult the non-academic terms and conditions. 4.1 If a Learner enrols onto a Microcredential and satisfies all of the competency requirements, then they will be awarded the Microcredential. Some Microcredentials are credit bearing and some are not. 4.2 If a learner is awarded a Microcredential, they may be able to count that towards a University of Nottingham qualification. Only a limited number of qualifications expressly state that they will accept Microcredentials. Where they do so, the programme specifications will outline which Microcredentials may be counted towards the qualification and how many credits they will contribute. 4.3 Only those University of Nottingham Qualifications that expressly state that they will permit the counting of Microcredentials towards the University of Nottingham qualification are committed to doing so. These qualifications must satisfy the University of Nottingham Programmes regulations. 4.4 Courses expressly stating that they will permit the counting of Microcredentials towards UoN qualifications may do so through one of three structures: 4.4.1 An open pathway combined studies award (PG Cert or PGDip). For this award to be made, Learners will need to pass Microcredentials through UoNO that collectively count for 60 (PG Cert) or 120 (PGDiP) credits within the Combined Studies programme specification. 4.4.2 A restricted studies award (PG Cert or PGDiP). For this award to be made, Learners will need to pass specific, named Microcredentials that collectively count for 60 (PG Cert) or 120 (PGDiP) credits within the relevant programme specification. 4.4.3 A directed studies award (PC Cert or PGDiP). For this award to be made, Learners will need to pass specific, named Microcredentials, in a specific order, and that collectively count for 60 (PG Cert) or 120 (PGDiP) credits within the relevant programme specification 4.5 A Learner who satisfies the conditions for a directed studies award, may not be made a restricted or open pathway award. 4.6 For all such awards, Learners may only be made the award at a pass (awards of merit and distinction are not available). 4.7 Other courses may, at the discretion of the relevant School, count Microcredentials towards a University of Nottingham qualification under the Recognition of Other Learning regulations. 5.1 UoNO will provide an online mechanism for Microcredential Learners on each Microcredential to provide feedback on the quality of teaching and materials for each Microcredential. 5.2 UoNO will also periodically provide access to an online forum (Student Staff Fora) where Microcredential Learners can discuss with one another the strengths of and any concerns that they have with any given Microcredential. UoNO will consider this feedback three times per year, and report to the Microcredential Learner community any changes that will be made or that are planned, as a result. 5.3 UoN has student complaints and student appeals policies that are open to Microcredential Learners. Microcredential Learners wishing to lodge a complaint or appeal must use procedure described. 6.1 For any guidance provided within the UoN Quality Manual, learners are advised that UoNO has the same standing and responsibilities as a School, wherever regulation is flagged as relevant. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}