{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/assessment-regs.aspx",
    "content": [
        {
            "p": "This page contains the University's regulations for the completion of assessed coursework, examinations and mixed assessments. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: submission; hard copies; deadlines Includes: expectations; late arrival; Regulations 1 - 2 For more information about the Regulations governing attendance and engagement, please consult the following: Regulations governing attendance and engagement For more information, please consult the following: Extenuating circumstances Includes: leaving the examination; missing an assessment; weighted average; deadlines and penalties; student responsibilities; Regulations 3 - 8 (a) A student who misses an assessment (this includes not submitting assessed coursework prior to the meeting of the relevant Board of Examiners) may submit an extenuating circumstances claim. If the student is offered a further assessment, the timing and form of this will be at the discretion of the student's School/Department and will be regarded as the equivalent sit at the assessment. For more information about extenuating circumstance procedures, please consult the following: Extenuating Circumstances procedure (b) If a student misses an assessment and is offered and declines another opportunity to take the assessment, the original mark will not be used. The student would be awarded a mark of zero for the assessment. (c) If a student is offered another opportunity to take an element of assessment through the extenuating circumstances process, and declines the offer, then the original mark will not be used. The student would be awarded a mark of zero for the assessment. (d) If a student takes up the opportunity for further assessment described in (a) and subsequently achieves a lower mark, that lower mark will stand. For more information about the University's academic regulations, please consult the following category: Academic regulations (a) Students will be regarded as missing an assessment with sufficient cause if they have an upheld extenuating circumstances claim for circumstances in which the relevant Board of Examiners judges that it would be unreasonable to expect the student to have attempted the assessment. Boards will reach that judgement on the basis of evidence and recommendations provided by the School/Department. (b) Where possible, students must make their School/Department aware of circumstances that may constitute sufficient cause prior to the meeting of the relevant Board of Examiners/Extenuating Circumstances Panel. Where the student has, with sufficient cause and an upheld extenuating circumstances claim, missed an assessment which counts for 50% or less of the overall module mark, the marks obtained from completed assessments may be used as the overall module mark on a 'part for whole' basis. A Board of Examiners may recommend this course of action only after considering the relevant learning outcomes. This regulation does not remove the need to offer the student another opportunity to take an assessment. (a) A student who submits assessed coursework after the deadline (as modified by any extensions granted by the relevant School/Department) shall have the mark for that coursework reduced by 5% for each normal working day (including vacations but not weekends, public holidays or University holidays) that has passed since the deadline, until a mark of 0% is reached. For example, an original mark of 67% would be successively reduced to 62%, 57%, etc. For more information on the regulations on penalties for late submission, please consult the following: Policy on penalties for late submission of assessed work (b) Notwithstanding (a) above, a student's School may specify any length of time after the coursework deadline as the point at which a mark of 0% will be awarded, so long as: the period is not longer than that which would arise from the application of Regulation 8 (a) above; and the period is given in writing to the student at the beginning of the module. (c) In all circumstances, a student will receive a mark of 0% if, without sufficient cause, the coursework has not been submitted prior to the meeting of the relevant Board of Examiners. There is a requirement for completed e-exam papers to be uploaded within a given timeframe, which depends on the format of the e-exam (see below). 1. ExamSys (formerly Rogo) e-exams invigilated on campus: This timeframe is equal to the duration of the exam plus any period of ‘technical time’ permitted, added by the invigilator when a student has a technical difficulty. 2. ExamSys (formerly Rogo) e-exams sat remotely: An additional 10 minutes is now built in to allow for IT issues, so final submission time is the length of the paper plus a further 10 minutes if needed. 3. Moodle e-exams of up to 3 hours (STEs): In addition to the exam length, an additional 30 minutes will be permitted for all students to cover IT issues and upload time. Information provided to students will clearly state that the time permitted includes additional time for upload, and that work submitted after the end of the additional 30-minute period will not be accepted and will be given a mark of zero unless there are approved extenuating circumstances that are supported by evidence. 4. Moodle e-exams of 24 hours: No additional time is given for 24 hours as that already allows time for technical issues. Work submitted after the end of the 24-hour window will not be accepted and will be given a mark of zero unless there are approved extenuating circumstances that are supported by evidence. 5. Extenuating circumstances for late submission of e-exam: 5.1 The criteria to be used when considering such extenuating circumstances are: 5.2 It is noted that not all e-exams are taken in a format where late submission is possible and that some examinations are proctored. These exams are outside of the remit of this policy. Students should follow local guidance on how to proceed in these cases. 5.3 Possible outcomes Paying particular attention to the potential advantage that might have been gained through late submission and the consequences of decisions made by the EC panel for the student, the EC panel may approve the paper for marking. EC panels may offer a first sit reassessment; this reassessment will take place at the first opportunity. 6. E-exams are subject to self-certification, which allows a student to self-certify absence from exams for a maximum of 48 hours (two consecutive days). A student is not able to self-certify after the assessment window has opened. For more information about self-certification (which is covered by the extenuating circumstances regulations), please consult the following: Extenuating circumstances regulations 7. In the case of severe system performance issues: Academic and professional services leads will be provided with a summary report where there are documented system performance issues during any exam release, and QSC will advise Schools and Departments on approaches to extenuating circumstances. In exceptional cases (e.g. significant documented system degradation), Schools may seek permission from Quality and Standards Committee to offer a blanket extenuating circumstance to an entire cohort, offering a reassessment at the earliest opportunity. Such requests should be treated, via Registry and Academic Affairs, under the QSC procedure for cases outside of regulations. For more information about the QSC procedure for cases outside of regulations, please consult the following: Quality and Standards Committee Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}