{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-regs-for-subject-spec-masters.aspx",
    "content": [
        {
            "p": "This page contains information on the regulations for Subject Specific Masters by Research Degrees, including Arts, Humanities and Languages subjects. Its content is relevant to staff and students across all the UK, China and Malaysia campuses. 1. These regulations shall be subject to, and shall be read in the light of, the University regulations for Taught Postgraduate Degrees, Diplomas and Certificates. 2. The University offers a course of advanced study leading to the degree of MA by Research in European Integration. 3. Candidates for admission will normally be expected to hold a good Second Class honours degree, or an equivalent qualification. Exceptionally, other persons may be admitted who are not graduates of an approved University on the basis of professional qualifications or experience. In such cases admission will be by approval by the Senate on recommendation of the Humanities Academic Board. 4. Candidates for whom English is not the first language will normally hold an appropriate qualification in English Language (TOEFL 600 or equivalent) and may be required to attend and pass specified English Language courses offered by the University prior to entry. 5. The course of study will be for 12 months (full-time), or twenty-four months (part-time), starting in October each year. The taught component of the course will last two semesters (full-time) or four semesters (part-time). A dissertation of 25,000 words will also be completed. 6. The Masters course will normally consist of 3 taught modules and a dissertation. Of the taught modules, 3 (worth 60 credits) will be compulsory. Candidates must accumulate 180 credits with a credit-weighted average module score equal to or greater than 50 percent including a dissertation module score equal to or greater than 50 percent. With the exception of the dissertation module, modules scored between 40 percent and 49 percent (inclusive of the end points) may count toward the accumulation of credits and be included in the credit-weighted average. Modules scored at less than 40 percent may not count toward the accumulation of credits. Candidates must accumulate 60 credits over the Autumn semester. During the Spring and Summer periods, students are required to research and write a dissertation of approximately 25,000 words on a topic from within the field of European integration. Research supervision will be provided by appropriate members of staff in the School of Politics. 7. Candidates registered for the MA by Research who have achieved 50 percent or more in coursework, essays and the dissertation will be awarded the MA by Research degree. Candidates registered for the MA by Research who have achieved 70 percent or more in coursework, essays and the dissertation will be awarded the MA by Research degree with distinction. 8. Candidates who fail to satisfy the Examiners may be re-examined on such terms as the Senate thinks fit 1. The Department of German offers a full-time course of directed study of one academic year's duration or a part-time course of two years, leading to the degree of Master of Arts in German (by research). The course is intended both as an independent entity and as an introduction to research methods which will serve as the basis for progression to postgraduate degrees by research at the University of Nottingham or elsewhere. The course weight is equivalent to 180 credits. 2. Candidates for admission should normally hold a First Class or Upper Second Class Single or Joint Honours degree in German. 3. The course will have two elements: (a) A course in research methodology, covering such topics as library skills, the compilation of bibliographies, word-processing, presentation and referencing. (b) A course of guided reading in an agreed field of German studies. Two 5,000 word essays and one 20,000 word dissertation will be written under the supervision of an appropriate member of the academic staff. Although separate, the essays will be planned to lead up to and into the dissertation. 4. Assessment will be based on three components: (a) A skills project (10%) (b) Two essays of 5,000 words each (40%) (c) A dissertation (50%) At the discretion of the examiners candidates may be required to attend a viva voce examination. The two coursework essays and the skills project must be completed by the end of the second semester of study. Full-time candidates must submit the dissertation by 1 October at the end of their period of study. Part-time candidates may submit the dissertation by 1 May of their second year if they wish to graduate in the summer, or not later than 1 October if they wish to graduate in December. 5. Candidates who fail to satisfy the examiners may be re-assessed on such terms as Senate thinks fit. 6. A mark of distinction may be awarded to candidates who exhibit exceptional merit in all aspects of the course. Course Director: Head of Department of Classics or nominee 1. These Regulations shall be subject to, and shall be read in the light of, the University Regulations for Taught Postgraduate Degrees, Diplomas and Certificates. 2. Applicants should normally hold a First or Upper Second class BA degree (Single or Joint Honours), or equivalent, in Ancient History, Classical Civilisation, Classics or cognate disciplines which provides sufficient background for the course. 3. i) Candidates are required to follow a prescribed course of either 12 months full-time study, or not less than 24 and not more than 48 months part-time study. ii) The course will consist of one taught module (Level D: 60 credits) and a research project leading to a dissertation (Level D module: 120 credits). In the case of full-time students, the taught module will be taken in the Autumn semester and the research project in the Spring semester and Summer period. In the case of part-time students, the taught module will normally be taken over the first year of the course and the research project over the second year. The modules offered will be as advertised in the Catalogue of Modules for the relevant year. 4. The assessment for each module will be determined by the Module Convenor, and specified in the Module Catalogue. Candidates may be required to undergo a viva voce examination to the satisfaction of the Examiners. 5. Candidates must pass the taught element before proceeding to the writing of their dissertation. 6. The pass-mark for all elements of assessment is 50%. Candidates who fail to achieve the pass-mark in any element of the taught module may, at the discretion of the Examiners, be deemed to have passed the module if they (i) have no mark less than 40% and (ii) achieve an average of 50% or more for the module. A fail mark in the dissertation cannot be compensated. 7. Students who achieve an overall average of less than 50% in the taught module will be reassessed in elements in which they failed to achieve 50%. Coursework essays will be resubmitted at a date to be determined by the Examiners and not later than 1st May of the year following first submission. Candidates whose dissertation is awarded a mark of less than 50% may resubmit it within 12 calendar months of first submission. 8. Candidates who achieve an overall average of 50% for the taught element of the course and who pass the dissertation will be awarded the qualification of MA in Greek and Roman Studies (by research). 9. Candidates achieving an overall average mark of 70% or more will be awarded the degree of Master with Distinction. 1. The Department of Modern Languages and Cultures offers a full-time course of directed study of one academic year’s duration or part-time course of two years, leading to the degree of Master of Arts in Modern Languages (with a specification of the languages studied). The course is intended both as an independent entity and as an introduction to research methods which will serve as the basis for progression to PhD-level research. The entry requirements for this course are: 2. The curriculum will comprise the following: i) successful completion of the module R14036 Research Skills in Modern Languages and Intercultural Studies, including attendance at the Tradition of Critique lectures. The module mark does not count towards the degree classification. ii) a course of guided reading in agreed fields of study within the Department of Modern Languages and Cultures under the supervision of the appropriate members of staff. iii) a dissertation of approximately 35,000 words, deriving from the guided reading and prepared under the supervision of the relevant members of staff. iv) attendance at the Modern Languages postgraduate work-in-progress seminars and relevant research seminars in Modern Languages. 3. Candidates will be required: i) to take such tests as are deemed necessary to assess competence in research methodology and presentation; ii) to submit a dissertation, of between c. 35,000 words; iii) to attend a viva voce examination at the discretion of the examiners. In addition to required reading, satisfactory attendance at supervision meetings is a course requirement. Full-time candidates must undertake the required tests relating to the course in methodology and presentation at the time specified and must submit their dissertation by 1st October at the end of the year of full-time study. Part-time candidates must undertake the required tests relating to the course in methodology and presentation at the time specified in their first year of study and must submit their dissertation by 1st October at the end of their second year of part-time study. 4. Candidates who fail to satisfy the examiners may be re-examined. All reassessments must be completed within one year of the end of the student’s period of registered study. 5. Students gaining a mark of 60% or above will be awarded an MA with Merit. Students gaining a mark of 70% or above will be awarded an MA with Distinction. This is a full-time course of directed study of one year's duration, or a part-time course of two year's duration, leading to the degree of Master of Arts in Music (by research). This course is intended both to be self-sufficient and to be an introduction to research methods which will serve as the basis for progression to doctoral degrees at The University of Nottingham or elsewhere. Candidates should normally hold a First Class or 2:1 Class Honours degree in a relevant subject or be able to demonstrate equivalent professional qualifications and/or experience. The course weight is equivalent to 180 credits. Course Requirements 2:1 in Music or related subject Including Degree subjects should be relevant to course applied for International English Language Test (IELT) Requirements 6.5 (no less than 6.0 in any element) The curriculum will comprise the following: (i) One compulsory Departmental Research Techniques course (20 credits) Alternatively, students may opt to take one of the courses offered by the Faculty of Arts in consultation with the course director: (ii) Two compulsory departmental courses (20 credits each) entitled “Specialised Studies 1” and “Specialised Studies 2”, conducted via seminar work or independent study, as agreed with the Director of Postgraduate Studies and individual supervisor(s) (iii) Candidates will produce a research project (120 credits), under the supervision of appropriate member(s) of academic staff on a topic approved by the Director of Postgraduate Studies. Musicology: Dissertation of 25,000 words worth 100%. Performance: Recital of 50-60 minutes, and Lecture-recital of 30 minutes with submitted script, weighted 70 / 30%. Music Technology: Recorded Project of 60-70 minutes plus written document of 5,000 words, weighted 80 / 20%. Composition: Portfolio of at least 30 minutes’ duration, plus written commentary of 5,000 words, weighted 80 / 20%. Specific Music Marking Criteria will be used for assessment. (iv) The Graduate School provides a wide range of short courses that are designed to teach generic research skills. Students will have access to courses on topics such as planning research and time management, introduction to library skills and presentation skills. (v) Students are expected to attend the Department’s research events, including regular colloquia with guest speakers. The assessment for each course will be determined by the Course Convenor and specified in the Course Catalogue. Candidates must achieve a pass mark (50%) on assessment for all taught elements of the degree. Candidates who fail to satisfy the examiners will be offered one further opportunity to do so by re-submitting assessed work. To proceed to the 120-credit research project, candidates must achieve a pass mark on assessment for the School of Humanities Research Skills course. Full-time candidates must undertake the required assessment for taught modules at the time specified and must submit their special project by 30th September at the end of their first year of full-time study. Part-time candidates are normally required to sit and undertake required assessment for taught modules during the first year of study and submit research projects by the end of the second year of part-time study. However, alternative programmes of study may, under certain circumstances, be agreed by the Course Director. The maximum time allowed for the completion of the degree on a part-time basis is three years. In the event that a candidate fails to satisfy the examiners on taught modules, and is therefore taking re-assessments, the research project deadline may be extended. The research project deadline may also be extended in other circumstances. An extension request form must be completed and submitted to the Academic Services Division. For more information, please consult the Progression section: Progression In both instances, written support from the candidate's supervisor(s) and medical certificates, where appropriate, will be required. Candidates may be awarded the degree of Master of Arts in Music by Research if: Should the research project fail to satisfy the examiners, candidates may, at the examiners' discretion, be permitted to: A mark of Merit will be awarded to candidates with marks in the range 60% to 69%, and Distinction to candidates with marks of 70% or over. Examiners may award Merit or Distinction purely on the basis of the thesis, as long as the taught modules have been passed. In the event that the student intends to pursue a PhD after their MA year the option is available for transferring their registration, subject to a successful upgrading review. In this case students will submit a portfolio of work including a 15,000 word extract from their MA dissertation or equivalent demonstration of practice-based research as agreed with the Director of Postgraduate Studies, a plan of research of approximately 2,500 words, and course results by 15th August. This will be examined by a viva voce held in the first week of September by a review panel consisting of two members of academic or research staff from the Department appointed by the Director of Postgraduate Studies. The plan of research should cover the following: title, main aims, specific objectives, research methods, literature review, summary of chapter contents, indicative bibliography/sources. Should the student successfully clear the review process he/she will be transferred to the second year of the PhD programme at the end of September and will not be formally examined on the MA dissertation. In the event that the review panel rejects the application for PhD upgrade the student will have the option of submitting a completed MA dissertation by 1st October for assessment under normal procedures (see section 2 The Curriculum above). This allows the student the possibility of graduating with an MA degree. Course director: Head of Department of Philosophy or nominee 1 These Regulations shall be subject to, and shall be read in the light of, the University Regulations for Taught Postgraduate Degrees, Diplomas and Certificates. 2 Applicants should normally hold a First or Upper Second class BA degree (Single or Joint Honours), or equivalent, in Philosophy or cognate disciplines which provides sufficient background for the course. 3 Length i) The teaching-year will run from the beginning of the Autumn semester to the end of the Spring semester. The Summer period will run from the end of the Spring semester until 30th September of the same year. ii) Candidates are required to follow a prescribed course of study of: Either 12 months' full time study; Or not less than 24 and not more than 48 months' part time study. Structure i) The course of study will comprise a taught element and a dissertation.The taught element will comprise two Level D modules worth 30 credits each. The taught module will be taken in the Autumn semester. The dissertation will be completed during the Spring semester and in the Summer period. ii) The modules offered will be as advertised in the Postgraduate Catalogue of Modules for the relevant year. iii) Full-time students will normally take the two 30 credit modules during the Autumn semester, and will normally be assessed at the end of that semester according to assessment procedures detailed in the Postgraduate Catalogue of Modules for each module taken. Full-time candidates will write their dissertation during the Spring semester and Summer period and submit it by 1st October of their year of registration. iv) Part-time candidates will normally take the single 60-credit taught module during the Autumn semester of their first year of registration, and will be assessed at the end of the following Spring semester according to assessment procedures detailed in the Postgraduate Catalogue of Modules for that module. Part-time candidates must complete the taught element of their course before proceeding to their writing of their dissertation. They will normally be expected to submit their dissertation by 1st October following their second year of registration. 4 Assessment will consist of: i) Compulsory modules: normally 100% coursework. ii) A dissertation of c. 20,000 words. iii) If required by the examiners, a viva voce examination. 5 Students must complete the taught element of the course before proceeding to the writing of their dissertation. 6 The pass-mark for all elements of assessment is 50%. Candidates who fail to achieve the pass-mark in any element of their taught module may, at the discretion of the examiners, be deemed to have passed the module if: (i) they have no essay-mark less than 40%, and (ii) if they achieve an overall average of 50% or more for the module. 7 Students who achieve an overall average of less than 50% on the taught module will be reassessed in elements in which they failed to achieve 50%. Coursework essays will be resubmitted at a date to be determined by the examiners and not later than 1st May of the year following first submission. Candidates whose dissertation is awarded a mark of less than 50% may resubmit it within 12 calendar months of first submission. 8 Candidates who achieve an overall average of 50% for the taught element of the course and who pass the dissertation will be awarded the qualification of MA in Philosophy (by research). 9 Candidates achieving an overall average mark of 70% or more will be awarded the degree of Master of Arts with Distinction. 10 No Postgraduate Diploma is offered. 1. The Department of Russian and Slavonic Studies offers a full-time course of directed study of one academic year's duration or part-time course of two year's duration leading to the degree of Master of Arts in Slavonic Studies. Candidates should normally hold a First Class or Upper Second Class Honours degree in Russian or other Slavonic Language. i) a course in research methodology and presentation; ii) a course or courses of guided reading in an agreed field of Slavonic Studies or agreed fields of Slavonic Studies, leading to the preparation of a dissertation under the supervision of the appropriate member(s) of academic staff on an agreed topic. 3 Candidates will be required: ii) to submit a dissertation, of between 30,000 words and 40,000 words; In addition to required reading, satisfactory attendance at supervision meetings is a course requirement. Full-time candidates must undertake the required tests relating to the course in methodology and presentation at the time specified and must submit their dissertation by 1st October at the end of the year of full-time study. Part-time candidates must undertake the required tests relating to the course in methodology and presentation at the time specified in their first year of study and must submit their dissertation by 1st October at the end of their second year of part-time study. 4. Candidates who fail to satisfy the examiners may be re-examined in the following year on such terms as Senate thinks fit. 5. A mark of distinction may be awarded by the examiners on the basis of exceptional performance. This is a full-time course of directed study of one year's duration, or a part-time course of two year's duration, leading to the degree of Master of Arts in Science and Society (by research and thesis). This course is intended both to be self-sufficient and to be an introduction to research methods which will serve as the basis for progression to postgraduate degrees by research at The University of Nottingham or elsewhere. Candidates should normally hold a First Class or Second Class Honours degree in a relevant Natural or Social Science subject or an equivalent professional qualification. The course weight is equivalent to 180 credits. (i) three modules in research methodology as indicated below: (ii) Plus 10 credits from the following: (iii) Plus 10 credits from the following: (iv) candidates will produce a research thesis (120 credits), under the supervision of appropriate member(s) of academic staff on a topic approved by the course director. They are required to attend at least 10 supervision sessions. (v) The Graduate School provides a wide range of short courses that are designed to teach generic research skills which are highly relevant to their studies. Students are normally expected to take the following modules: Planning Research and Time Management Presentation Skills for Postgraduates in the Humanities Taught modules will be assessed by a combination of class and seminar participation, project work, extended essay and/or formal examination as appropriate to the subject matter. Graduate School modules are not formally assessed but you will be required to submit evidence of attendance. Candidates for the degree of MART must achieve a pass mark (50%) on assessment for all taught elements of the degree. Candidates who fail to satisfy the examiners will be offered one further opportunity to do so by re-submitting assessed work. To proceed to the research thesis, candidates must achieve a pass mark on assessment for the Research Thesis Proposal module. Candidates for the degree of MART will be required to submit a satisfactory research thesis of 20,000 (minimum) to 25,000 words (maximum) words on an approved topic. Candidates may be required to attend a viva voce examination at the discretion of the examiners. Full-time candidates must undertake the required assessment for taught modules at the time specified and must submit their research thesis by 30th September at the end of their first year of full-time study. Part-time candidates are normally required to sit and undertake required assessment for taught modules during the first year of study, and submit research theses by the end of the second year of part-time study. However, alternative programmes of study may, under certain circumstances, be agreed by the Course Director. The maximum time allowed for the completion of the degree on a part-time basis is three years. In the event that a candidate fails to satisfy the examiners on taught modules, and is therefore taking re-assessments, the research thesis deadline may be extended. The research thesis deadline may also be extended in other circumstances. An extension request form must be completed and submitted to the Academic Services Division. For more information, please consult the progression section. Candidates may be awarded the degree of Master of Arts by Research & Thesis (Science in Society) if: External examiners will be appointed for each candidate on an individual basis. Should the research thesis fail to satisfy the examiners, candidates may, at the examiners' discretion, be permitted to: A mark of distinction may be awarded by the examiners on the basis of exceptional performance in the research thesis. In the event that the student intends to pursue a PhD after their MA year the option is available for transferring their registration, subject to a successful upgrading review. In this case students will submit a portfolio of work including a 15,000 word extract from their MA dissertation, a plan of research of about 2,500 words, and module results by 15th August. This will be examined by a viva voce held in the first week of September by a review panel consisting of two members of academic or research staff from the Institute or partner Schools appointed by the Director of Research Students. The plan of research should cover the following: i. A statement of research questions for the proposed PhD thesis, and how these have developed over the course of the research. ii. An account of progress in respect of empirical work, if any (access negotiations, interviews, documents gathered, data analysis etc). iii. A brief discussion of your proposed chapter structure and its rationale. Should the student successfully clear the review process he/she will be transferred to the PhD programme at the end of September and will not be formally examined on the MA dissertation. In the event that the review panel rejects the application for PhD upgrade the student will have the option of submitting a completed MA dissertation by 1st October for assessment under normal procedures (see section 2 above). This allows the student the possibility of graduating from IGBiS with an MA degree. 1. The Department of Theology offer a full-time course of directed study of one academic year's duration or a part-time course of two to four year's duration leading to the degree of Master of Arts in Theology and Religious Studies. 2. Candidates should normally hold a First Class or Upper Second Class Honours degree in Theology and Religious Studies. 3. The course weight is equivalent to 180 credits. 4. The course will comprise the following: i) A course in research methodology and presentation; ii) A course of guided reading in an agreed field of study leading to the preparation of a dissertation under the supervision of the appropriate member(s) of staff on an agreed topic. 5. Candidates will be required: i) To undertake training as deemed necessary in research methodology and presentation; ii) To submit a dissertation of between 30,000 and 35,000 words. At the discretion of the examiners, candidates may be required to attend a viva voce examination. Full-time candidates must undertake the required tests and submit their dissertation by 1st October at the end of the year of full-time study. Part-time candidates must undertake the required tests at the time specified in their first year of study and must submit their dissertation by 1st October at the end of their second year of part-time study. 6. Candidates who fail to satisfy the examiners may be re-examined in the following year on such terms as Senate thinks fit. 7. A mark of distinction may be awarded by the examiners on the basis of exceptional performance. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}