{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-procedures-for-assessment.aspx",
    "content": [
        {
            "p": "This page sets out the criteria for the award of qualifications, examiner reports and feedback. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Please be aware that during academic year 2020/21, the University introduced additional guidance in response to the Covid-19 pandemic. This page was previously affected by these arrangements and has been documented accordingly. Further details can be found in the \"Additional guidance in 2020/21 due to Covid-19\" section below. Includes: receipt of information; formal notice; submission information Every research student and those members of academic staff eligible to act as Internal or External Examiners will receive information on the University's procedures for assessing research degree submissions. A student wishing to submit a thesis for examination must give formal notice to Student Services, (School Registry Office at the University of Nottingham Malaysia (UNM) or the Graduate School for the University of Nottingham Ningbo China (UNNC)) of the intention to submit (see the Documentation section for the form and Submission Pack). The form can also be submitted to the candidate’s School for onward transmission to Student Services. Student Services, UNM School Registry or the Graduate School at UNNC will make arrangements for the nomination and appointment of Examiners (see the Documentation section) and, provided that the thesis has been submitted, will forward the thesis to the Examiners within one week of receiving the Examiners’ written agreement to act. Includes: frameworks; presentation of thesis; originality requirements Research degrees will be awarded at Masters or Doctoral level to students who have demonstrated that they satisfy the relevant qualification descriptors contained in the University of Nottingham Qualifications Framework (UNQF). For more information about the UNQF, please consult the following: The thesis should be presented in a satisfactory manner. The subject matter must be clearly and precisely expressed, its arguments logical and intelligible, and its language appropriate. It must show that the student not only has ideas, but also has the ability to put them into suitable words. The thesis must be written by the student and be the result of the student's own work. The requirement does not preclude a student obtaining limited assistance with the routine collection and/or processing of data under guidelines and instructions clearly devised by the student. When such help is obtained it should be with the prior approval of the supervisor who must be satisfied that the spirit of the 'own work' requirement is not breached. Students are encouraged to publish papers in advance of submission of their thesis and prior publication of papers arising from the research being undertaken should not prejudice the assessment of the thesis. Includes: submission; format; merits and shortcomings of a submission The Examiners should submit independent reports on the submission to Registry and Academic Affairs, the Student Registry Office at UNM or the Graduate School at UNNC, or the Head of School before the viva voce examination takes place. The reports need not be provided in a standard format but must be written in English and word-processed or typed and must include the name and School of the student, the degree sought, the signature, name (printed), position of the Examiner (i.e Internal or External) and the date. They should contain a full and frank assessment of the merits and weaknesses of the thesis in the light of the criteria described above. It is suggested that a favourable report should normally fill at least one side of A4 paper. It is particularly important that the merits and shortcomings of a submission are provided in full and in detail if the report is unfavourable and, therefore, a lengthier report might be expected. It should be noted that Examiners' Independent and Joint reports will be given to the candidate when the examination outcome is notified and circulated to staff and students as part of the University's Appeals procedures if relevant. Includes: viva voce examination; formal written correspondence Following a viva voce examination, the student should be given immediate informal feedback on the outcome of the examination and should be advised that more formal details will be transmitted later in writing. The Internal Examiner should also write to the student formally conveying the joint views of the Examiners on the submission, describing in detail the academic and presentational reasons for their recommendation, and, if appropriate, providing clear advice about what matters should be addressed in any resubmission. For more information about viva voce examinations, please consult the following: Viva voce examinations Includes: joint report form; role of Student Services The Joint Report Form shall be forwarded by the Examiners to the Head of School for approval and signature and they shall forward the Independent and Joint Report Forms to Student Services for approval by the University. *NB the same procedure shall be followed with respect to students who submit their theses for examination at UNM or UNNC. The Student Registry or Graduate School should also receive copies of the Examiners' reports (including Head of School's signature) for information only. Staff in Student Services shall be responsible for ensuring that staff at UNM or UNNC are kept informed of the University's decision concerning such submissions. Student Services will write to the student within one week of the University's decision being made, informing them of the recommendation that the degree be awarded (or not) and advising them of the procedures for graduating, or for lodging an appeal, as appropriate. Includes: Information for Examiners, supervisors and candidates; guidance on submission by published works; submission pack for candidates; notification of submission of thesis guidance Please be aware that the following guidance was developed and applied during academic year 2020/21 in response to the coronavirus pandemic, and should be read in conjunction with all other content on this page: Covid-19 and doctoral examinations – additional guidance for examiners for doctoral candidates at the University of Nottingham The active application of these arrangements then ceased at the beginning of academic year 2021/22. Any outcomes from their previous application will, however, continue to be honoured and used in all decisions regarding those affected. For more information about the Exceptional Regulations as a whole, please consult the following: Exceptional Regulations: Covid-19 - 2019/20 - 2020/21 Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}