{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/guidance-non-registered-statuses.aspx",
    "content": [
        {
            "p": "This page provides information on non-registered statuses and in what situations this might be applicable. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. There are a number of policies and processes within the University that might result in a student not being registered with the University although a relationship with the University still exists and they are expected at some time to continue or complete their programme. This content is relevant to staff and students across all of the UK, China and Malaysia campuses Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship Where relevant, the student is expected to formally re-register when the circumstances below no longer apply. In order to re-register, a student must have: For more information about fees and financial support, please consult the finance and finantial support pages linked below: In the following circumstances, a student will not be registered and will be subject to the specified conditions. Depending on the length of suspension, such students may not have access to library or IT services. However, they are still subject to relevant regulations of the University, such as Traffic Regulations, the Regulations for Library and Computer Use and the University’s Code of Discipline for Students. Students whose registration status is suspended for any of the following reasons are not entitled to attend any teaching or take any assessments and will not pay tuition fees whilst unregistered. in the UK, students are not eligible for Council Tax relief nor for student support funding. Students who are in the UK under the Points Based System: Student route visa will be required to leave the UK whilst their registration status is suspended. Students who are not registered for the following reason will be subject to the same conditions as those above, except that they are permitted to take assessments for which they have been entered (for which a fee may be payable depending on individual circumstances). This applies when: Students whose registration status is suspended for the following reason will be subject to the same conditions as those above except that in addition, they will not have access to any IT, library or door access facilities. This applies when: The following types of student are also not registered with the University although they remain engaged in their study with the University: Such students have access to all usual University facilities and all regulations apply. For more information about fees, please consult the following: Registry and Academic Affairs - fees and finance A student ceases to be a registered student once they have completed their studies. However, until their award is conferred (if applicable), they will continue to have relevant engagement as a student of the University. For the majority of students with standard start dates and periods of study, the usual times that students are deemed to have completed their studies will be as follows: In addition, please be aware of the following: Voluntary interruption of study Changes of taught course Regulations governing attendance and engagement Fitness to practise procedures Withdrawal on the grounds of health and safety Code of Discipline for Students Policy on academic misconduct Finance Registry and Academic Affairs - Financial support Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}