{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pol-marking-and-grading.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on marking and grading. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. Includes: assessment process Quality assurance of assessment consists of several elements. These can be distinguished according to the different stages of the assessment process at which they operate: The appropriate combination of these elements of quality assurance will vary by discipline and assessment task, so some variation in practice between Schools is to be expected and not all elements will be appropriate to all assessments. Further information regarding moderation and marks adjustment can be found below. Includes: Postgraduate students with teaching responsibilities; responsibilities of Head of School All assessments for programmes and modules leading to a University award must involve both one or more internal examiners and one or more independent external examiners. In addition, all members of academic staff will act as internal examiners in the subjects in their School. The University of Nottingham policy on the appointment and responsibilities of External Examiners can be found online, and is linked below. The School has a duty to ensure that any individuals acting as internal examiners who are not academic staff of the University, are fully briefed and have relevant experience and sufficient knowledge of their subject area to assess students' knowledge and skills. For more information, please consult the Policy on occasional teachers linked below. Postgraduate students with teaching responsibilities may also act as internal examiners. For more information, please consult the Policy on University of Nottingham students who teach. In respect of any assessment carried out by postgraduate students with teaching responsibilities, Heads of School must ensure that: 1. Are moderated by a member of academic staff 2. Are limited, as far as practicable, to those elements of assessment that do not contribute to the degree classification Students must be informed by their School when and how they will receive results and the various stages of the process of distributing results. On integrated apprenticeship programmes the End-Point Assessment serves as a final credit bearing module for the degree. It also constitutes the summative assessment for the apprenticeship award. Each specific End-Point Assessment plan outlines the final classification criteria for the apprenticeship award. Thus assessment of this module will need to meet the requirements of the published apprenticeship End-Point Assessment plan in addition to contributing to the degree award. The Institute for Apprenticeships and Technical Education (IfATE) prescribes that the assessment of the End-Point Assessment is performed by suitably qualified Independent Assessors. These are appointed internally or externally and they will provide the grade for the overall outcome for the apprenticeship award. Dependent on the programme, the grade to contribute to the degree award may also be provided by the Independent Assessor/s, and thus may not be a member of University staff who is involved in the programme. Includes: role of School Boards; requirements of the School; Marking criteria examples; double-marking It is recognised that there is a need for School Boards to conduct the assessment of students in a manner that is appropriate to individual disciplines and to the methods of assessment employed. All Schools are required to have written marking criteria across the full range of marks available (0-100) which is published in School Handbooks. Marking criteria must include categories from 70% to 100% and 0% to 40%. Marking advice must be available to markers in relation to all forms of assessment used within the School/Department. The School's marking criteria must be signposted in its programme specifications (Section C. Supplementary Regulations, 3. Assessment). In pursuit of assessment practices that are fair, valid and reliable the University recognises double-marking (preferably \"blind\" where the first mark is not made known to the second marker) as good practice for all assessments where appropriate. For apprenticeship programmes, to meet requirements outlined by the Institute for Apprenticeships and Technical Education (IfATE), the criteria outlined in the specific End-Point Assessment plan for each apprenticeship standard must be followed. For more information please visit the Institute for Apprenticeships and Technical Education website, via the link below. Permitted differences to local School policy on marking criteria may be required, for example providing acceptable tolerances in assessment word count. Includes: role of external examiners; sample size; moderation assessment report form Moderation is the process of checking that standards have been applied correctly and consistently during the marking of an assessment. It is distinct from marking (including double marking) and from marks adjustment. Unlike double marking, moderation must not result in a change to the mark awarded to just one student; any changes to marks following moderation must be applied systematically to all affected students taking the assessment (e.g. all students who answered a given question). Unlike marks adjustment, moderation examines the application of standards to a unit of assessment, and does not compare marks across different cohorts. Moderation is also distinct from the scrutiny of assessment by External Examiners. External Examiners will not be involved in the marking process as their role is to ensure that policies and regulations have been appropriately applied, that the assessment process is fair and robust and to ensure that standards applied are consistent with subject benchmark statements and other institutions. All assessments that contribute to the determination or classification of an award must have been subject to moderation. Moderation must have been conducted by someone other than the first marker. An absolute minimum number of student submissions for each assessment must be reviewed by the moderator. That number is determined by the number of students registered to take the assessment as follows: Schools must decide for themselves the appropriate sample size for moderation for each assessment and it is expected that this will often exceed the minimum. This decision is based on the nature of the assessment, its weighting (i.e. number of credits), the number of first markers and their level of experience. Sampling for moderation must be random but should include at least one submission from each mark range (where they exist): 0-39, 40-49, 50-59, 60-69, 70-100. Schools must have a clear and explicit written policy governing the moderation of marking which should be available to students (for example via School handbooks and School Community Moodle pages). All markers in a School must be clearly briefed on these processes each academic year. These processes must specify: Schools must have a uniform system for fully recording the process of moderation so that examiners can clearly understand how moderation has occurred and what consequences have arisen from it. These records must be available to External Examiners as soon as possible and be tabled at relevant Examination Boards. An example of such a system is provided below from the Faculty of Arts: For apprenticeship programmes, moderation will be in line with School policy, unless there are alternative requirements specific to the End-Point Assessment module. Moderation of this module will be undertaken by the appointed Independent Assessors or by internal staff who are independent of prior teaching. This will be determined and arranged locally. Includes: role of external examiners; Report form for the use of marks adjustment A School is expected to consider data regarding marks on modules for which it has responsibility (for example, median mark and variance for each module) to identify possible issues with the delivery and assessment of the module prior to the Exam Board. Normally this analysis would also be taken into account in the School’s regular review of modules. Where there has been a clear flaw in the assessment process (e.g. mistakes on a question paper), Schools have a responsibility to ensure that this does not have a significant impact on the fairness or robustness of the final marks. Where such a flaw is identified Schools should develop a suitable adjustment to be applied to all marks and report this to the External Examiners. Where no potential flaws have been identified the summary report form linked below must be completed. Where potential flaws have been identified by markers, reported by students or may come to light because of comparison of marks profiles (e.g. comparison of median mark and variance) with other modules taken by the same cohort or with the same module taken by previous cohorts, the marks adjustment report for the affected module(s) must be completed, linked in section 5 below. Review and sign off of the marks adjustment form (including nil returns) must take place at the Exam Board. Any approved adjustment and its rationale must then be communicated clearly to all students who took the module (normally via the module feedback report) and communicated to Quality and Student Management Systems Team (within Registry and Academic Affairs) for report to Quality and Standards Committee (QSC) using the forms below. The module level information report must detail the rationale for marks adjustment; the method used; the method used to inform students; and any remedial measures implemented as a result of marks adjustment. These forms must be appended to the summary form submitted. A separate report form should be used for each module where marks have been subject to adjustment. Schools are expected to submit an annual report even if there is a nil return. Where there is a nil return a single summary form must be used. Reports must be submitted at the same time as the main Examination Board recommendations in June/July (Undergraduate programmes) and by November (Postgraduate Taught programmes). Viva voce examinations may only be used as part of a documented assessment procedure and must not be used as part of the consideration of borderline candidates or in the final decision making process. The only exception to this is where an external body requires that a Viva Voce examination is held as a separate assessment forming part of the decision-making process. In such a case the School must publish a written policy that must be included in the student handbook or otherwise drawn to the attention of students. This must address the following issues: Formal records of all such vivas must be kept. Schools are encouraged to organise meetings for external examiners with representative groups of students as a mechanism for ensuring quality and standards control but this should not form part of the assessment process. University policy on penalties for late submission of assessed coursework can be found online and linked below. University policy on legibility of work submitted for assessment can be found online. For more information, please consult the information linked below: Includes: marking by numbers For formal written examinations the University operates a marking by numbers (or anonymous marking) system. For more information about the marking by number system, please consult the Marking by Number page. Schools must also ensure that coursework is anonymous at the time of marking where this is possible and appropriate for the educational aims Schools must ensure that clear statements of the responsibilities of those involved in computation, checking and recording of assessment data exist. Includes: degree classification; progression For the purposes of classifying undergraduate degrees, marks will be rounded at the stages detailed under Degree Classification for each individual module. The University convention on rounding of numeric marks for all awards is as follows: Marks must be rounded at two stages only: Rounding means that any mark of x.5 and decimal fractions above, becomes the next highest integer e.g. 69.5 is rounded to 70, 59.5 to 60, and so on. Decimal fractions below x.5 are rounded to the next lowest integer - for example, 69.4 is rounded to 69. For the purposes of rounding, the mark should be truncated and only the first decimal place is used (e.g. 69.45 becomes 69.4, which is rounded to 69). Following the rounding convention set out above, overall marks of 39.5, 49.5, 59.5, and 69.5 will be rounded to 40, 50, 60 & 70 respectively. For the purposes of progression, overall average marks will be rounded to the nearest integer so that marks of 29.5, 39.5 and 49.5 will be rounded to 30, 40 and 50 respectively. Decimal fractions below x.5 are rounded to the next lowest integer - for example, 69.4 is rounded to 69. For the purposes of rounding, the mark should be truncated and only the first decimal place is used (e.g. 69.45 becomes 69.4, which is rounded to 69). Policy on occasional teachers Policy on University of Nottingham students who teach Appointment and responsibilities of External Examiners Institute for Apprenticeships and Technical Education Policy on penalties for late submission of assessed work Legibility of work submitted for assessment Marking by number For examples of marking criteria, please consult the following: Example moderation sysutem from the Faculty of Arts Summary Mark Adjustment form (where no adjustment is needed) Marks Adjustment form (when adjustment is needed) Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/markingcriteriaexamples.pdf"
    ]
}