{
    "url": "https://www.nottingham.ac.uk/qualitymanual/legacy-exceptional-regulations-covid-19-1920.aspx",
    "content": [
        {
            "p": "This page contains the exceptional regulations that were developed in response to the coronavirus pandemic. Its contents are only relevant to staff and students with affected outcomes during academic years 2019/20 and 2020/21. During academic year 2019/20, the University introduced exceptional regulations in response to the Covid-19 pandemic. These were campus-specific and meant to be read in conjunction with any pre-existing content within the Quality Manual. From the beginning of academic year 2021/22, the active application of all Covid-19 exceptional regulations across all three campuses has now ceased, with the exception of those which cover extenuating circumstances at the University of Nottingham Malaysia (UNM), and those concerning admissions to the University of Nottingham UK (UNUK). Please note, however, that any outcomes from the application of the exceptional regulations during the 2019/20 and 2020/21 academic years will continue to be honoured and used in all future decisions regarding those affected. For more information about the exceptional regulations that remain in effect at UNM and UNUK, please consult the following: Exceptional regulations University of Nottingham Malaysia (current) Exceptional regulations - University of Nottingham UK (UNUK) (current) For more information about the exceptional regulations and affected content during academic years 2019/20 and 2020/21, please consult the pages listed below. Exceptional regulations - University of Nottingham UK (UNUK) - 2019/20 to 2020/21 Exceptional regulations - University of Nottingham Ningbo China (UNNC) - 2019/20 to 2020/21 Exceptional regulations - University of Nottingham Malaysia (UNM) - 2019/20 to 2020/21 Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}