{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/high-perf-athlete-academic-flex.aspx",
    "content": [
        {
            "p": "This page contains the University's stance on academic flexibility in respect of High Performance Athletes (HPAs). This information is only relevant to staff and students based at the UK campus. This summary has been developed to enable dual-career support for highly talented sporting individuals persue their studies whilst competing at a high level in their sport. The University of Nottingham Sports’ Scholarship and Recruitment Manager (SRM) will identify High Performance Athletes (HPAs). Students on the Sports Scholarship Programme (SSP) and/or on the Talented Athlete Scholarship Scheme (TASS) would automatically qualify as an HPA and thus be eligible to receive support. Not all HPAs at the University of Nottingham will be on the SSP or TASS. At the start of each Academic year, the SRM will share a list HPAs with the Faculty Associate Pro-Vice Chancellors for Education and Student Experience (FAPVCs for ESE) (or their nominated deputy) for approval. These HPAs would then be eligible for the support outlined in this document as applicable. The approved list will be shared by the SRM with the Faculty HPA Leads to distribute to appropriate HPA tutors and teaching staff for each Faculty, and the Director of Registry and Academic Affairs (or their delegate) to distribute to the approprate process senior managers. For avoidance of doubt, HPA Tutors are additional to the student's usual Personal Tutor and are special tutors especially for HPAs who act as a key liaison for the student with their course teams. These academic staff would be identified by the FAPVC for ESE (or nominated deputy) and training provided, as necessary, by the SRM and their team. The SRM will meet all identified HPAs at the beginning of the academic year to outline the academic support available. These HPAs are then expected to identify and organise a meeting with their HPA Tutor and, if appropriate (for instance, for HPAs who are also SSP and TASS athletes) jointly with their Performance Lifestyle Advisor (PLA), where a range of support will be discussed and identified between them and to review the academic and sporting schedules for the year. This support will be reviewed periodically throughout the academic year where needed, depending on the training and competition schedule of the HPA. Support to HPAs will be provided in the ways detailed below. Staff and students referring to this guidance where the student is a student visa holder must note: UK Visas and Immigration Student sponsor guidance Includes: Extenuating circumstances, alternative methods of assessment Academic departments' primary support for students may be through the Extenuating Circumstances (EC) policy. Where an HPA’s sitting of an assessment is disrupted by sporting commitments, the EC Panel has discretion to award any relevant EC outcome. EC Panels are encouraged to be flexible. Student Services - Extenuating Circumstances Procedure Guidance on Acceptable Circumstances and Evidence (EC Procedure) EC requests which involve summative group work will be addressed on a case by case basis given the different nature of group work. In certain cases it may be necessary to explore alternative modes of assessment. Such cases would need to be discussed between SRM, HPA Tutor, Module Convenor, Exams Officer of the relevant academic department, and EC panel, and approved on a case by case basis. Student Services - Guidance on Recommendations for EC Panels Includes: location of exams; administration charges At times it is recognised that in exceptional circumstances a HPA may need to take an exam abroad if no other option is possible for them to complete the exam. An alternative may be to take the exam in the UK on the next assessment date. Services for Students - How to apply for an overseas examination The University has an administration charge for students taking exams as part of an Overseas Examinations Arrangement. It is requested that HPAs have this fee waived. Includes: adjustments to personal timetable; practical assessments; flexibility; group work; academic year splitting Where possible and with enough notice, a HPA may be allowed to change seminar groups for the academic year. The SRM, HPA Tutor and Module Convenor in collaboration with timetabling will work together to develop a viable solution. Where an HPA is unable to attend a test, lab or practical formative assessment, then the Extenuating Circumstances policy does not apply. Though it is respected that placements can be a challenge to alter, where foresight is possible and flexibility available, the SRM, HPA Tutor and Module Convenor (or whoever most appropriate school person is) will do their best to ensure an HPA receives placements that allow the HPA to continue their training and competition through being provided with placements in closer proximity to Nottingham and/or are understanding of HPA’s situations. In particular circumstances and if possible an HPA may be granted the ability to split an academic year into two within regulations relating to maximum number of credits per semester For more information, please consult the following: Taught module enrolment and registering for additional credits Includes: authorised absence recording; 1:1 academic support Some academic departments request mandatory attendance and engagement from a student. Due to sporting commitments a HPA may need to receive a authorised absence, which does not count against their mandatory attendance record. It is important to note that an exception to any flexibility with attendance applies where the student is in the UK on a student visa. Wherever the University acts as the student’s immigration sponsor in the UK, the student is expected to regularly and consistently attend and engage with their studies, prioritising academic studies and engagement over sporting activity and/or work, as required by their visa Regulations governing attendance and engagement Due to the nature of an HPA having to balance their academic and sporting commitments, this may result in an HPA missing some aspects of their academic studies. At certain times, due to major sporting competitions, a HPA may need to take some time out from their studies. An academic School will allow an HPA to interrupt their studies on these grounds subject to regulations concerning maximum periods of registration. Voluntary interruption of study Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Limitations on immigration sponsorship and Graduate Visa reporting For more information on the University's Extenuating Circumstances policy, please consult the following: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}