{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/admissions-feedback-appeals-complaints.aspx",
    "content": [
        {
            "p": "This page contains information on the procedure for feedback, reviews and complaints related to admissions. Its content is primarily directed at applicants but may also be of interest to staff and students across all of the UK, China and Malaysia campuses. Includes: legislation implications; correspondence with the applicant The University of Nottingham receives a considerable number of applications per place and as entry is competitive, it is, regrettably, unable to make every applicant an offer. Due to the requirements of the Data Protection Act and the University's policy on disclosure, the University will only correspond on any issue regarding an application with the applicant themselves, unless the applicant has provided written permission for the University to discuss their application with another person (for example, a parent, guardian or school adviser) or the person is listed as the undergraduate applicant's nominated contact on UCAS. Includes: statement of feedback All unsuccessful applicants will receive a statement of feedback on their application record, which gives the specific reason for the application outcome. Due to the large volumes of applications received, we are unable to provide more detailed feedback in addition to this. Includes: right of appeal; timeframes; additional relevant information There is no right of appeal against the outcome of an admissions decision. However, if additional relevant information can be provided by an applicant in support of their application - which was unavailable when the application was originally submitted - the University will take this into consideration and may review the application on the basis of such additional relevant information. To provide additional information, please contact us using this enquiry form. This should be done within 4 weeks of the admissions decision or before relevant UCAS / University deadlines, whichever is sooner. The additional information should be provided together with an explanation of why this was not available when the application was originally submitted. Includes: applicant rights; contact details Applicants have the right to express their dissatisfaction with the processing of their application. Complaints should be made following the Policy on applicant complaints. For more information, please consult the following: Policy on applicant complaints Applicant complaints procedure Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}