{
    "url": "https://www.nottingham.ac.uk/qualitymanual/academic-regulations/min-expec-tl-activity.aspx",
    "content": [
        {
            "p": "This page provides guidance on different types of scheduled teaching and learning activities, including the minimum expectations for a typical programme of study. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: provision dates The provisions which are outlined on this page were first introduced as follows and have been applied from the start of the following academic sessions: Scheduled teaching and directed learning activities include digital learning, delivered onsite or remotely and in-person teaching. Activities may be synchronous or directed asynchronous and include for example: Includes: typical hours; School requirements; expectations for a full-time programme The levels below relate to a student following a typical programme of study (based upon modules comprising 120 credits per year and there being 22 teaching weeks in the year) and provide the minimum number of scheduled learning hours per 10 credits: Study hours on placement modules may be counted towards the above totals. These are typical pathways. Any Schools which do not provide a typical pathway are still expected to aim for these levels as far as possible. This will not be directly applicable to UoN apprenticeship programmes where work-based learners have non-standard timetabling through each year of study (please refer to specific programme provision). Every taught postgraduate student completing a full Master's qualification (whether full or part time, on a professional course, or on a distance learning course) must be allocated a Master's project supervisor and must be informed of who this is prior to the start of substantive work on the Master's project. The assignment of a supervisor to each student will be the responsibility of the appropriate personnel within each School. If the allocated supervisor cannot fulfil their duties for unforeseen circumstances (e.g. illness), the School will allocate a replacement supervisor and notify the student of the change in a timely manner. Regulation around Master's project supervision provides that; For more information about PGT supervision please consult the PGT supervision guidance document: PGT supervision guidance document For more information about UKVI PGT supervision guidance, please consult the UKVI PGT supervision guidance document PGT masters project visa guidance document Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}