{
    "url": "https://www.nottingham.ac.uk/qualitymanual/prog-and-mod-design-and-approval/annual-review-of-curriculum.aspx",
    "content": [
        {
            "p": "This page provides guidance on when and how updates are made to programme and module specifications. Its content is primarily directed at staff but may also be of interest to students across all of the UK, China and Malaysia campuses. This page outlines when and how changes to curriculum (for programme and module specifications) can be made. This includes approval for changes to micro-credential programmes offered by UoNO Note, deadlines and processes vary by campus due to different regulatory environments. It is good practice for Schools to review their curriculum (that is, programme and module specification information and curriculum maps) on an annual basis. For example, this may follow local annual monitoring or other teaching review procedures. It is also necessary for Schools to annually check the accuracy of their published curriculum information, which includes the Online Course Catalogue and prospectus. Prospective students need to be able to rely on the published information in the Online Prospectus to make decisions about what and where to study. Also, the experience of students on a particular programme and/or module should reflect the curriculum information in the Online Course Catalogue. The annual curriculum review is different to annual monitoring, although the same source datasets are likely to be used for both. For example, External Examiner reports, student and staff feedback. For more information about annual monitoring please see here: Annual monitoring These curriculum reviews may lead to a need to make changes to that curriculum, which should be approved by School and Faculty following the relevant local processes. The curriculum review and School/Faculty approval can occur at suitable times agreed locally and in advance of the deadlines for submission of curriculum changes. In the UK, there will be different implementation schedules for material curriculum changes compared to changes which are not material. During the annual review, schools must consider whether maintaining the non-compensatable status of a module is still essential. This assessment should consider if a non-compensated pass is required for future study (serving as a pre-requisite for a subsequent compulsory module), achieving the programme’s learning outcomes, or meeting accreditation requirements It is important that the quality manual regulations in relation to new programmes and new modules are considered. Any changes to existing programmes and modules should comply with the new programme and module regulations (unless an exceptional case has been approved by the Quality and Standards Committee). Schools must consider the impact of any planned curriculum change on all stakeholders, which may include prospective students, current students, other programmes of study in the School, other Schools, partnerships and the China and Malaysia campuses. In the UK, consultation with students, including prospective students, may be necessary to ensure adherence to Competition and Markets Authority (CMA) guidelines. To implement the School/Faculty approved curriculum changes, it is necessary for those changes to be amended centrally. The curriculum record is held in the Student Record Systems and consists of Programme and Module Specifications and curriculum maps. This is also the lead source for prospectus information. Registry and Academic Affairs (RAA) in the UK or local Academic Services Unit (ASU) at UNNC or Student Registry Office (SRO) at UNM are responsible for maintaining the formal, approved record of curriculum. Deadlines for submission of curriculum changes vary slightly across the three campuses and are circulated to schools in the respective campuses ahead of the deadlines detailed below. In UNM/UNNC, there is one annual opportunity to update curriculum, managed by SRO and ASU respectively. Information is cascaded locally regarding how to request those changes. These changes (for all necessary changes) are usually made in January/February prior to the start of the academic year of implementation. In the UK, curriculum changes are submitted at two time points depending on whether that information is “material” or not. Information is cascaded locally regarding how to request those changes. Subsequent change to material and non-material information in the UK is not normally permitted unless in exceptional and unforeseen circumstances (see late change). Material information includes (but is not limited to): Please see Appendix 1 of the University of University of Nottingham's Consumer Protection Policy which provides a full list of information which is considered “material”. Please note, UK prospectus publication dates are shown in the table below: It is expected that once the prospectus and Online Course Catalogue are published, no further changes to curriculum information will be made unless essential. Every effort should be made to submit changes to curriculum within the relevant process timeframes. It is however accepted that there may occasionally be a need to make further changes to the curriculum for essential and/or unforeseen reasons after the relevant process deadlines. Changing material information at any point following the prospectus publication will only be permitted in exceptional circumstances, which might include responding to PSRB, employer or accreditation changes/requirements, or where the change clearly benefits or enhances the student experience. Local School/Faculty approvals must first be obtained. Then, RAA in UNUK or local academic services unit in UNM/UNNC will consider the change, consulting with other departments for advice as necessary (e.g., Legal Services, Governance and Marketing), and then make a recommendation to the relevant AFPVC (or delegate) who will accept or reject the request. Prospective students, specifically applicants and offer holders, and students where impacted must be informed in writing of any changes to material information that has been published in the Online Prospectus or Online Curriculum Catalogue. In some circumstances consultation may be required. All communications to prospective students regarding changes to material information will be managed by Admissions and Marketing in consultation with the School. All current student communications regarding material changes will be managed by the School/Faculty. All communications are drafted in consultation with RAA and the School and, where appropriate, the Legal team. When developing a new programme, appropriate regard must be given to the importance of promoting free speech. Please consult the following for further information about the Freedom of Speech Act: The UUK document ‘How can Universities prepare for the Higher Education (Freedom of Speech) Act? Office for Students guidance on free speech. In relation to programme and module development, approval, and delivery, it should be noted that academics would not be prohibited from developing or delivering a programme or module on the ground that it involves giving serious consideration to ‘controversial or unpopular opinions’. This is not a reason that the programme would be approved, rather it is not a reason it could be declined. For instance, there will remain business or logistical reasons to not grant approval to a programme or module. For more information about changes to Curriculum: Changes to programme and module specifications For more information about Consumer Protection Policy (includes list of material information in Appendix 1): For more information about UK curriculum change and deadlines, including information about how to submit late change requests in the UK: Curriculum Approvals and Advisory Team (CAAT) SharePoint (internal UK only) To view the published curriculum: Online Course Catalogue New/revised curriculum maps are required with all programme specification changes. A template for a curriculum map can be found here: Curriculum map For more information about any aspect of curriculum change, please email: ss-curriculumadvice@nottingham.ac.uk Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/Consumer-Protection-Policy.pdf",
        "uk_pdf_files/Consumer-Protection-Policy.pdf"
    ]
}