{
    "url": "https://www.nottingham.ac.uk/qualitymanual/2-documents/lcf-terms-of-reference.docx",
    "content": [
        {
            "p": "This page contains the regulations for the Degree of Master of Research (MRes) from September 2020, including admissions, examination and award of degree information. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. For students commencing their programmes before this date, the MA/MSc by Research Regulations and Master of Research (pre-September 2020) will apply except for Regulation 6 which applies to all students from September 2020. For more information, please consult the following: Regulations for the Degree of Master of Research (MRes) before September 2020 An individual undertaking an apprenticeship programme at the University of Nottingham (UK campus) will be considered as a part time student. All regulations in the Quality Manual that make reference to ‘students’, also apply to apprentices, unless otherwise stated. 1. Requirements for admission to a research degree are set out in the Academic entry requirements page, which can be found here: Academic entry requirements 3. Students are required to study modules worth 180 credits, of which between 20 and 60 credits (or equivalent) should normally be obtained from taught modules at Level 4 or from other units offering generic training within the University (such as the Researcher Academy) or from within any other relevant courses run within Schools. The remaining credits will then be obtained from the thesis at Level 4. Any taught modules and research training taken must be clearly relevant with the student’s research topic. 4. Students will receive regular supervision while undertaking the thesis component, specific to their learning needs and thesis topic. This will be as set out in the thesis description and in line with the requirements for supervision contained in the regulations for research degrees. For more information regarding minimum number of supervisions, please consult the following: Responsibilities of the supervisor Includes: module specifications; submitting thesis before end of registered study; viva voce examinations 6. In regard to the thesis, the maximum word length of the thesis is dependent on the credit size of the thesis and the following apply: The maximum word limit is inclusive of appendices, footnotes, tables but not the bibliography. The Thesis should embody the result of the candidate’s advanced study and research. 7. Students are required to submit their thesis prior to the end of the period of registered study. An electronic version saved as a searchable PDF, should be submitted to the relevant Registry and Academic Affairs PGR team or equivalent (in a form prescribed by the University), who will forward the thesis to the Examiners. The thesis should not, whether in the same or a different form, have been submitted to this or any other University for the award of any degree. 8. The thesis must be the result of the student’s own work. The requirement does not preclude a student obtaining limited assistance with proof-reading and with the routine collection and/or processing of data under guidelines and instructions clearly devised by the student. When such help is obtained it should be with the prior approval of the supervisor who must be satisfied that the spirit of the 'own work' requirement is not breached. 9. The thesis is examined by both an External Examiner and an Internal Examiner appointed under the regulations governing the assessment of research degrees, who should provide independent reports on the thesis, indicating whether the thesis module has been passed; and also whether a viva voce examination is necessary. Where a viva voce examination is required by the examiners, this should be conducted in line with the relevant regulations for MPhil degrees. For more information about the Viva voce examinations, please consult the following: Viva voce examinations Includes: award of degree; where a student obtains a fail mark or failed thesis or training credits; nottingham etheses service 10. The degree is awarded where all taught modules and training credits and the thesis module have been passed. The pass mark for all taught modules is 50%, but marks of 40%-49% can normally be compensated in up to 20 credits if the overall average for the taught modules taken is 50% or over. Training credits will be assessed on a pass/fail basis. 11. Where a student obtains a fail mark in a taught module that is not compensated, or fails the thesis module or training credits, the student has one further opportunity to pass those modules. All reassessments must be completed within one year of the end of the student's period of registered study. 12. The qualification awarded to the student will include the subject of study undertaken as notified to the student at the time of admission. 13. Successful candidates will be eligible to graduate once their thesis has been uploaded to the University’s eTheses service and approved by the Internal Examiner or, in cases where there are two external examiners, the lead External Examiner. For more information, please consult the following: Nottingham eTheses UNNC RIS 14. For apprenticeship programmes: On integrated apprenticeship programmes the End-Point Assessment serves as a final credit bearing module for the degree. It also constitutes the summative assessment for the apprenticeship award. Each specific End-Point Assessment plan outlines the final classification criteria for the apprenticeship award. On non-integrated apprenticeship programmes, the End-Point Assessment is undertaken after completion of the degree, and is taken as a standalone assessment external to the University. A course may only have progression requirements more stringent than those stated in regulation 10 above if there is a demonstrable requirement from a professional accrediting external body or is required to meet Education and Skills Funding Agency (ESFA) requirements for attainment on an apprenticeship programme. Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}