{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/monitoring.aspx",
    "content": [
        {
            "p": "This page explains the purpose and responsibilities surrounding monitoring, its associated documentation and feedback. This information is primarily directed at staff but may also be of interest to students across all UK, China and Malaysia campuses. Includes: expectations of Schools; responsibility of the School (at UNUK); involvement of the international campuses Schools are expected to monitor each of their courses to ensure that no major difficulties have arisen and that appropriate opportunities for improvement have been identified. This information feeds into a wider cycle of quality assurance and in turn enhances the student experience on programme. All taught programmes leading to a University award must be monitored, including those offered at the international campuses; this includes sub-degree and taught postgraduate courses. Other issues to be considered will be requirements of accrediting bodies and any issues arising from collaborative course provision. Joint Honours courses and other joint degrees should be monitored by the lead School. Undergraduate and postgraduate programmes will be monitored on separate cycles. The School at the UK campus (UNUK) should also ensure that programmes run at the international campuses (either separately or jointly across campuses) should be included in deliberations at School level. At the module level, the minimum requirement is for each module convenor to consider any changes needed to their modules and to submit these amendments to the School for approval. Includes: Schools; Education Excellence team; Planning, performance and Strategic Change; Students' Union; Quality and Standards Committee Schools are required to complete a monitoring return for each programme run in the year reported on (monitoring reflects on the previous cycle of activity). The UK head of School has responsibility for Quality Assurance (QA) activity (which can be delegated by way of a Statement of Responsibilities) and should ensure coverage of programmes, on all campuses, in returns. Feedback from previous reports, External Examiner reports, student feedback, in-School activity and changes, should be reflected upon to produce a written account and a summary of the actions which will be taken as a result. The return may encompass a number of related courses which are being monitored together. The completed return should be returned to the Education Excellence team by the designated deadline. The Education Excellence team will provide Schools with lists of the programmes for which reports are expected. Previous reports and External Examiner reports will be made available on the Monitoring Workspace, which can be found below. The team will run an annual training session on the process, and provide advice and guidance to Schools to support the process. When returns have been completed by the School, the Education Excellence team will complete the relevant sections of the forms ahead of review by Quality and Standards Committee (QSC). Education Excellence will also provide comment on the External Examiners’ reports and responses received, including confirmation of their view of the achievement of UK threshold academic standards. An overview report of the process, including External Examiner comments on comparison across campuses, positive and negative themes and an analysis of reports received from Schools will be produced for QSC. The Students' Union will complete a Monitoring Student Feedback form, which include pro forma questions on student engagement and experience and return these to the Education Excellence team for review by QSC. QSC receive and review all completed Monitoring returns and Monitoring Student Feedback forms, and complete a Pro Forma for each School. The Inter-Campus Quality Officer will review the summary of External Examiner comments on comparison across campuses and report any issues or areas of best practice to the Chair of QSC. The Chair of QSC will produce a summary report, by reviewing the Pro Forma produce by the Committee and feedback from the Inter-Campus Quality Officer, for Teaching and Learning Committee and the Education and Student Experience Committee. For more information on QSC, please consult the following: Quality and Standards Committee Includes: template for research programmes; template for taught programmes Schools will receive feedback following consideration of their Monitoring submissions by Quality and Standards Committee (QSC); this includes the completed Monitoring returns, Monitoring Student Feedback Forms and completed QSC Pro Forma. This will be made available to Schools on the Monitoring Workspace. For more information about monitoring, please consult the following: Monitoring - Workspace Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}