{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/alternative-prog-offers.aspx",
    "content": [
        {
            "p": "This page concerns information about alternative offers that may be offered where an applicant's original choice is not appropriate. Its content is primarily aimed at current and prospective students, as well as staff, based within the UK. Includes: timings; communication and UCAS Hub; consideration for reversal In some cases, the admissions manager/tutor may not be able to make an offer for your chosen course but may make an offer for an alternative, related course. This may occur at the original offer stage or at confirmation. If we are unable to make you an offer of a place on the original course for which you applied (due to competition for places or because you do not meet the exact entry requirements), we reserve the right to make you an offer on an alternative course. If you are being made an offer for an alternative course, this will be made clear to you by way of UCAS Hub and your University of Nottingham Offer Letter. If you are being offered a choice of alternative courses, this will be communicated to you via email and you will be asked to select an alternative course before the offer is made officially. If an alternative course offer is made and accepted at confirmation, consideration for change of course back to the original choice will only be considered if you meet the requirements, there are places available and your application was successful following interview. Includes: receipt of results; choice; next steps On receipt of your results, if you have accepted your offer as a firm or insurance choice but have not met the exact conditions of your offer, we may still make you an offer of an alternative course. This will be notified to you by way of email and will appear on UCAS Hub (for undergraduate applicants). You are under no obligation to accept this alternative course offer. However, for undergraduate applicants, if you choose to decline the offer, you will either be released to your insurance choice or into Clearing. Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}