{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/school-examination-boards.aspx",
    "content": [
        {
            "p": "This page provides information on the membership of a School Examination Board, their power and responsibilities, default agenda, records and the Chair's action. This may be useful for staff and students across all of the UK, China and Malaysia campuses. Includes: eligibility; involvement of the international campuses; responsibilities of the Head of School The chair is the Head of School or their nominee. Other eligible members are module convenors and module tutors. The external examiner(s) shall normally be present at any meeting of the Board at which recommendations are made for the award of degrees, diplomas or certificates. When, exceptionally and for good reason, this is not possible, the external examiner's absence must be approved by the Chair. Under such circumstances, the Chair shall ensure that the external has been fully involved in agreeing marks and that there is at the meeting a written record of the external's remarks and recommendations on classifications and failures. If absent, the external shall be consulted by telephone or some other effective means about distinction, first class, and failing decisions before the pass list is signed. Where programmes are offered at the International Campuses, there should be appropriate involvement of International Campus staff in the School Examination Board. This involvement may be through attendance at the Board (whether by video link or in person), or through consultation regarding the information presented to the Board and its decisions. The Head of School is responsible for ensuring that sufficient internal and external members are present to enable valid decisions to be taken. Includes: overview; consideration of extenuating circumstances; undergraduate final year candidates; candidates where programme specification states a progression point between taught and dissertation stages; postgraduate taught candidates at the end of programme; reporting outcomes The School Examination Board is the mechanism whereby a School makes decisions regarding progression and awards; in particular, it enables the requisite involvement of External Examiners in those decisions. The main business of the Board is: The Board is responsible for confirming marks in School modules taken by students who are following courses of study in other Schools, including exchange students. For Joint Honours programmes, the lead School is responsible for ensuring that its Examination Board is held at a time which will allow all information and marks to be available from the partner School, even if the lead School 's Examination Board takes place ahead of that of the partner School. The recommendations for Joint Honours students should then be reported to the partner Schools for information. This procedure obviates the need for External Examiners from partner Schools to attend the Exam Board of the Lead School where logistical difficulties prevent attendance. With the exception of small Schools/departments where it may not be practicable to do so, extenuating circumstances should normally be considered at a sub-committee/meeting which will make recommendations to the School/Department Examination Board. The group considering the extenuating circumstances claim should assess the validity of each claim and recommend an outcome in line with the Extenuating Circumstances Policy such that the full School Examination Board can make a final decision. Full records of the sub-committee/meeting should be kept by the School/Department and a brief summary of circumstances presented to the School Examination Board. The full details of circumstances should remain confidential to the sub-committee/meeting and should only be discussed at the full meeting of the School Examination Board if strictly necessary. A School Board may not alter marks, except in cases where for example a poor question has been included on an examination paper, to compensate for which all the marks for the whole suite of answer papers need to be raised by a certain percentage. In cases where Extenuating Circumstances of individuals are considered, a higher degree class than predicted by the marks profile may be recommended but the candidate's marks should not be changed to facilitate this. To recommend for formal approval candidates for the award of degrees, diplomas or certificates as appropriate. To recommend the conditions dependent on circumstances for final year candidates who have failed to satisfy the requirements to obtain an award: To determine, according to appropriate School supplementary regulations and University regulations: In the case of students who have been reassessed, to determine: Recommendations that fall within the remit of the School Examination Board are reported to Student Service Development (Academic Processes) or equivalent for action. Recommendations for awards outside the borderlines or notwithstanding the regulations should be referred to Student Service Development (Academic Processes) for approval by the Quality and Standards Committee (QSC). The default agenda is not exclusive and further items should be added for a particular meeting as Board business requires: Includes: requirements; conflicts of interest All Boards of Examiners are required to keep formal minutes of their proceedings, recording results and the reasons for recommendations relating to cases requiring discussion, including consideration of the degree classification of borderline students and reference to any documentary or other evidence as appropriate. Schools will be expected to use these minutes when requested by students to explain decisions made in regard to them. The Board of Examiners should take care to recognise when one or more of its members have had past dealings with a student that might be construed as giving credence to a charge of prejudice (e.g. involvement in a Fitness to Practise procedure involving that student), and should record carefully in those circumstances that the said member(s) of staff did not have a decisive role in determining the outcome for that student. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}