{
    "url": "https://www.nottingham.ac.uk/qualitymanual/prog-and-mod-design-and-approval/mod-design-approval.aspx",
    "content": [
        {
            "p": "This page provides instructions on how to request a new module. While it is primarily intended for staff across the UK, China and Malaysia campuses, it may also be of interest to students. In submitting a new UK-based module for approval, one of the following conditions must apply: When developing a new module, appropriate regard must be given to the importance of promoting free speech. Please consult the following for further information about the Freedom of Speech Act: The UUK document ‘How can Universities prepare for the Higher Education (Freedom of Speech) Act? Office for Students guidance on free speech. In relation to programme and module development, approval, and delivery, it should be noted that academics would not be prohibited from developing or delivering a programme or module on the ground that it involves giving serious consideration to ‘controversial or unpopular opinions’. This is not a reason that the programme would be approved, rather it is not a reason it could be declined. For instance, there will remain business or logistical reasons to not grant approval to a programme or module. The module specification template for a new module is provided here: New module information template For more information about completing a new module specification template, please consult the following: Module specification guidance For more information about the curriculum review cycle, please consult the following: Curriculum review of programme and module specifications Module information in Campus Solutions is used for relevant central processes and will be published in the Online Course Catalogue. Online course catalogue If you have any problems or queries relating to this page, please email: ss-curriculumadvice@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}