{
    "url": "https://www.nottingham.ac.uk/qualitymanual/personal-tutoring-student-support-and-development/safeguarding.aspx",
    "content": [
        {
            "p": "This page provides a link to the University Safeguarding Policy and the Report and Support process. Its content is relevant to staff and students across all of the UK campuses. This guidance aims to ensure that adults and children at risk (including students under the age of 18), and all those who work with them, are safe and appropriately supported within our institution and the activities we organise. We aim to achieve this by minimising risk of harm from discrimination, bullying, accidents, injury and abuse in all its forms. The aim is to protect all adults and children at risk from harm regardless of gender, race, colour, nationality, ethnic or national origin, age, socio-economic background, disability, religious or political beliefs, trade union membership, family circumstances, sexual orientation or other irrelevant distinction. The guidance applies to all University employees, students, apprentices, freelance practitioners, student ambassadors, alumni, volunteers and anyone else representing the University of Nottingham. Safeguarding Policy The University of Nottingham is committed to ensuring we do everything we can to provide a safe and supportive environment for everyone. Our campuses are a pleasant and inclusive place to study and work but, as with any community, issues can arise. If you or someone you know has experienced or witnessed an incident, you can tell us anonymously or ask to speak an advisor. Speaking to advisor does not mean that you are making a formal report to the university, it is to enable you to access the support you need to make an informed decision. Report and Support Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/UoN-Safeguarding-Policy.pdf"
    ]
}