{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pgt-deg-sept15-16start.aspx",
    "content": [
        {
            "p": "This page contains the degree classifications for all postgraduate taught students who began their awards from September 2015. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: commencement dates; former regulations These regulations take effect from 2015/16 for students entering Qualifying year or Part I from September 2015. Students entering Qualifying year or Part I before September 2015 are subject to the former regulations. For more information about the former regulations, please consult the following: Degree classification before September 2015 Standardised weightings between Parts apply unless an approved PSRB or other exemption has been given and this is stated in the relevant programme specification(s). Includes: unit marks; modules marks; weightings; weighted numerical average; borderlines 1. Unit marks (see footnote 1 in the All awards section) are numeric. 2. Module mark is calculated from unit marks and rounded to a numeric integer 3. Module marks are weighted accordingly to the number of credits attached to the module - for example, a 20 credit module is weighted double compared to a 10 credit module. 4. The relative weightings of Part I/II/III marks are given in programme specifications. 5. A weighted numerical average is calculated using the weightings indicated in 3 and 4 above. 6. The weighted numerical average is rounded. For more information, please consult the following: Policy on marking and grading 7. Weighted numerical average is translated into degree classification according to Table 1. Pass * that is, an unclassified degree and therefore awarded without honours. Only the following rounded marks will be regarded as “borderline”: Includes: classifications; borderlines; calculating an overall average Ordinary Degrees and Undergraduate and Graduate Certificates and Diplomas are classified using a weighted numerical average as defined under the Arithmetic Mean Model above. The classifications are: Only the following rounded marks will be regarded as borderline: When calculating an overall average, in the case of Ordinary Degrees, classification is based on the best marks obtained from 100 credits at Part I and the best marks obtained from 100 credits at Part II. In the case of Undergraduate Diplomas the classification is based on the best marks obtained in 120 credits taken in stage 2 or 3 including at least 90 credits at level 2. Includes: classification; postgraduate diplomas and certificates; borderlines The classification rules for Taught Masters, Postgraduate Diplomas and Postgraduate Certificates (that is, the award of Merits and Distinctions) are contained in the University’s Taught Postgraduate Regulations. The classifications are: Borderlines for these qualifications are: Includes: use of borderlines; extenuating circumstances; footnotes Following moderation an agreed algorithm is used to determine the final composite mark. If this falls within a borderline as defined above, the weighted profiling system as stated in the programme specification will be applied to determine the final classification (footnote 3). Students with acceptable extenuating circumstances should be considered in accordance with the extenuating circumstances policy and procedures. For more information, please consult the following: Extenuating Circumstances Procedure 1. “Unit mark” is the mark awarded for an individual piece of assessed work, which goes towards the computation of a module mark using a weighting formula. 2. For students registering on programmes from 2009/10 onwards, Schools should use only a weighted profiling system for determining the degree class of borderline students. The profiling system must be stated in the programme specification and made explicit and clear to students from the start of their studies through School Handbooks 3. For students entering Qualifying year or Part I from 2015/16 onwards, Schools should use only the standardised weighted profiling system for determining the degree class of borderline students. A student should be given the higher class if either of the following criteria are met: For students entering Taught Postgraduate programmes from 2016/17 onwards, Schools should use only the standardised weighted profiling system for determining the degree class of borderline students. A student should be given the higher classification if the following criterion is met: This does not preclude the consideration of Extenuating Circumstances of students, whether inside or outside the borderline. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}