{
    "url": "https://www.nottingham.ac.uk/qualitymanual/personal-tutoring-student-support-and-development/induction-and-tutoring-statements.aspx",
    "content": [
        {
            "p": "This page provides guidance on the format of student inductions and the content of all School tutoring statements. Its content is primarily directed at Schools but may also be of interest to students across all of the UK, China and Malaysia campuses. Includes: School responsibilities; provision of materials Schools must ensure that all of their students obtain a clear and timely communication of their induction arrangements. Introductory meetings for all new full-time students must be arranged by schools within their first two days at the University, and for part-time students as soon as is reasonably practical. Within the induction process, Schools must ensure that all of their students are provided with: Schools are also reminded that induction is not solely a Week One activity. Includes: requirements of the School; outcomes of tutoring Each School is required to produce a written statement of its arrangements for achieving tutoring outcomes for all of its undergraduate and taught postgraduate students. The tutoring statement may be an account of how each of the individual outcomes is achieved or may comprise a general description of how tutoring works within a School (perhaps taken directly from the student handbook) with a commentary or mapping exercise on how these arrangements secure the tutoring outcomes. A prime purpose of these statements is to identify practices in Schools that have a positive impact on students’ academic experience and that lend themselves to wider adoption. Tutoring statements should be made available to all students, either through inclusion in student handbooks or by other suitable means, such as the online Student Staff Forum (SSFs). For more information about SSFs, please consult the following: Student Staff Fora Careers and Employability Service Services for Students Nottingham Advantage Award Disability Support Services Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}