{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/applicant-complaints-procedure.aspx",
    "content": [
        {
            "p": "This page sets out the University's applicant complaints procedure. Its content is primarily directed at applicants but may also be of interest to staff at all of the UK, China and Malaysia campuses. Includes: Level 1; Level 2; Level 3 The following sections explain what this means, and what to do if a complaint is not resolved satisfactorily. There is a different process for complaints about fee status assessment. Please see here for details: Fee status assessment Includes: Table of expected time limits for each level of complaint; contact details If an applicant fails to proceed within the given deadlines of the complaints procedure they may not be able to progress through the internal complaints mechanisms of the University. The procedure has been separated into Responsibilities of Applicants and Responsibilities of those involved in the handling of the complaint on behalf of the University. You are expected to try to resolve a complaint directly, informally and quickly with the person/department concerned: You should complete the Level 2 Complaint Form within 1 month of notification of the outcome of Level 1. You must provide a clear explanation of how you attempted to resolve your complaint informally at Level 1. As a minimum, your explanation should include a specific date, a named member of staff to whom the complaint was reported and why the complaint was not resolved to your satisfaction at Level 1. Your complaint must be substantiated by evidence. This may comprise one, or a series of the following types of evidence: a timeline of events, reference to relevant policies, procedures and/or regulations, letters, emails, independent medical evidence, reports by professionals, witness statements, screenshots etc. Any evidence or appendices relevant to the complaint must be submitted at the same time as the complaint form and clearly referenced and labelled. If you are making a Subject Access request as part of your complaint, you are expected to submit this as soon as practicably possible after the outcome of your Level 1 complaint and to provide evidence of submission as part of your Level 2 complaint. It is your responsibility to make your case. Complaints will not be accepted for further investigation if: You are required to ensure that any evidence not written in English is translated and provided at the same time as the complaint paperwork. If your submission is unclear or unnecessarily long, you will be asked to resubmit the form in a manner that enables proper consideration of the complaint to take place. You will normally receive an outcome letter within 6 weeks of receipt of your Level 2 complaint form by the Admissions Team. If the investigation will take longer than 6 weeks, you will be informed of the reason and an expected date of response. If you are dissatisfied with the outcome, you can escalate your complaint to Level 3 on the following grounds: You should submit the Level 3 Complaint Form within 10 working days of notification of the outcome of the Level 2 complaint. You must set out the grounds of the complaint by making reference to the above standards, and must provide evidence to support your claim, including proof of why new evidence being presented was not available at the time of the submission of your Level 2 complaint. You will normally receive an outcome letter within 4 weeks of receipt of your level 3 complaint form by the Admissions Team. If the review will take longer than 4 weeks, you will be informed of the reason and an expected date of response. Hard copies of forms are available to applicants who, for reasons of disability, are unable to access the electronic form. You have the right to bring a friend to meetings arranged during the formal stages of the procedure. Solicitors or other legal representatives will not be permitted to attend. Staff dealing with complaints are encouraged, whenever practical, to meet with the applicant to establish the precise cause of dissatisfaction, to explore the remedy sought by the applicant and to foster a mutual understanding of the issues involved: On receipt of a level 2 complaint the Admissions Team will undertake an initial evaluation to check that the complaint is submitted under the right procedures, within the appropriate deadlines, and in the required format with supporting evidence: On receipt of a level 3 complaint form, the Admissions Team will undertake an initial evaluation to check that the complaint is submitted within the appropriate deadlines, meets the criteria for level 3 review and is in the required format with supporting evidence. A complaint without adequate grounds and evidence will be dismissed: Please be aware that these forms should only be completed for their stated levels of complaint; a Level 1 complaint does not require a form submission: Completed forms should be sent to the Admissions Team (as stated in the \"Responsibilities\" sections above). Admissions Team University of Nottingham Gatehouse Lodge Wollaton Hall Drive Derby Road Nottingham NG8 1AF Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}