{
    "url": "https://www.nottingham.ac.uk/qualitymanual/exceptional-classification-and-progression-regulations.aspx",
    "content": [
        {
            "p": "This page contains the exceptional regulations that were developed in May/June 2021/22. Its content applies to staff and students across all of the UK, China and Malaysia campuses. During the 2021-22 May/June examination period, University of Nottingham (UofN) will operate classification and progression regulations that differ slightly from the normal regulations and will partially resemble those operated during the summer of 19/20, when COVID-19 prevented UofN from being able to set and mark particular kinds of examination and coursework. The regulations apply to all 3 campuses. The exceptional UG progression regulations, and guidance on how to calculate a derived mark, are contained in the following documents: The exceptional UG classification regulations, and guidance on how to calculate a derived mark, are contained in the following documents: The exceptional Foundation and Qualifying Year progression regulations, and guidance on how to calculate a derived mark, are contained in the following documents: The exceptional PG Cert and PG Dip classification regulations, and guidance on how to calculate a derived mark, are contained in the following documents: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/exceptional-progression-regulations.pdf",
        "uk_pdf_files/how-to-calculate-a-derived-mark.pdf",
        "uk_pdf_files/exceptional-classification-regulations.pdf",
        "uk_pdf_files/how-to-calculate-a-derived-mark.pdf",
        "uk_pdf_files/exceptional-progression-regulations-fyqy.pdf",
        "uk_pdf_files/how-to-calculate-a-derived-mark.pdf",
        "uk_pdf_files/exceptional-classification-regulations-pg-cert-dip.pdf",
        "uk_pdf_files/how-to-calculate-a-derived-mark.pdf"
    ]
}