{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-regs-doc-medicine.aspx",
    "content": [
        {
            "p": "This page contains the regulations surrounding the Degree of Doctor of Medicine, including admission requirements, supervision and transfer (to a PhD) information. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. The regulations for the DM are those which govern the PhD with the following exceptions. For the DM, Regulation 1 (Admission) governing the degree of PhD is replaced by the following. Includes: requirements; relationship to other regulations A candidate for the Degree of DM must be: (a) A graduate in medicine (BMBS) of the University of Nottingham; or (b) A graduate in medicine of another recognised university whose qualifications confer eligibility for registration with the General Medical Council. A student who is not a graduate of the University of Nottingham will be expected to undertake most of the research in the University or one of its associated hospitals or general practices. The following regulations (as outlined in the subsequent sections) for the DM are additional to those governing the PhD. Includes: where research topic extends beyond staff expertise; role of principal supervisor In cases where the student's research topic extends beyond the expertise of academic staff, at least two supervisors shall be appointed. The principal supervisor will be a member of the academic staff of the University of Nottingham and the second supervisor will be in an outside organisation such as the NHS. The role of the principal supervisor will be to ensure, on behalf of the Head of School, that appropriate and continuous supervision is arranged during the student's period of registered study. Includes: criteria; role of principal supervisor The research study of a candidate (either part-time or full-time) who is a graduate in medicine (BMBS) of the University of Nottingham may in an appropriate case take place outside the Nottingham area. Candidates registered under this regulation shall be allocated at least two supervisors. The principal supervisor will be a member of the academic staff of the University of Nottingham, and the second supervisor will be based in the outside organisation. Candidates studying under this Regulation shall be subject to the requirements of Regulation 2 (Supervisors and Supervision) and to the minimum periods of study laid down elsewhere in these Regulations. However they need not attend at the University for a prescribed number of personal consultations with the principal supervisor if the Head of School concerned is satisfied that adequate supervision can be arranged by other means, for example, in an outside organisation or electronically. Includes: period of research; application for permission A candidate shall not be permitted to count the same period of research for both the degree of PhD and the degree of DM. However, a candidate for a DM degree may, after a period of not less than nine months study for the DM and before notification of intention to submit a thesis has been given, with the approval of the Supervisor and the Head of School concerned submit an application to the University for permission to be registered as a candidate for the degree of PhD instead of that of DM. Includes: normal pathway for degree of doctor of medicine; exceptional circumstances Registration as a research student and submission of a thesis as detailed in these regulations is the normal pathway for the award of the degree of Doctor of Medicine (DM). In exceptional circumstances it may be possible to submit published work for consideration for the award of a DM degree. This route is appropriate only for individuals of sufficient experience and seniority to enable them to submit a substantial volume of work already published in high quality medical/scientific journals. Such published papers submitted in lieu of a thesis must be related and accompanied by a statement preferably in the form of an essay describing the relationship between the various studies and placing the whole work critically into perspective with the general state of knowledge in the field of investigation to which the candidate's researchers are related. The statement should also clearly indicate the exact role of the applicant in the research on which the submission is based. Anyone considering such a submission should first consult with a member of Quality and Standards Committee (QSC). For more information about QSC, please consult the following: Quality and Standards Committee Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}