{
    "url": "https://www.nottingham.ac.uk/qualitymanual/academic-regulations/frame-professional-doct.aspx",
    "content": [
        {
            "p": "This page contains the University's Framework for Professional Doctorates and is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: descriptors Professional Doctorates are regarded by the University of Nottingham as research degrees. Qualifications which fall within the Framework for Professional Doctorates will in general terms satisfy the following qualification descriptor: Doctorates are awarded to students who have demonstrated: i) The creation and interpretation of new knowledge, through original research or other advanced scholarship, of a quality to satisfy peer review, extend the forefront of the discipline, and merit publication; ii) A systematic acquisition and understanding of a substantial body of knowledge which is at the forefront of an academic discipline or area of professional practice; iii) The general ability to conceptualise, design and implement a project for the generation of new knowledge, applications or understanding at the forefront of the discipline, and to adjust the project design in the light of unforeseen problems; iv) A detailed understanding of applicable techniques for research and advanced academic enquiry. Typically, holders of the qualification will be able to: (a) Make informed judgements on complex issues in specialist fields, often in the absence of complete data, and be able to communicate their ideas and conclusions clearly and effectively to specialist and non-specialist audiences; (b) Continue to undertake pure and/or applied research and development at an advanced level, contributing substantially to the development of new techniques, ideas, or approaches; and will have: (c) The qualities and transferable skills necessary for employment requiring the exercise of personal responsibility and largely autonomous initiative in complex and unpredictable situations, in professional or equivalent environments. Includes: qualifications for the degree; course of study; taught component; reassessment; interim awards; programme design, development and approval; thesis or final assessment to be completed satisfactorily to qualify for the award of the Professional Doctorate; award of qualification; failure When drafting Regulations for a specific Professional Doctorate, Schools should take account of the following: Admissions criteria: standard wording would be as follows: A candidate for the …….. degree must: (a) Be a graduate of this or any other approved university holding a Bachelor’s degree (normally first or second class Honours or equivalent) and normally holding an appropriate Master's degree from this or any other approved university or (b) Hold such other qualifications as may, on the recommendation of the School, be deemed by the University to be equivalent to the qualifications referred to in (a). Schools should then consider whether they need to include any subject-specific qualification criteria as appropriate. Students for the degree of …. must have pursued in this University a full- or part-time course of study comprising a taught component and one or more major research projects. The minimum period of registration for this programme will be two years full-time supervised study or four years part-time study (with the normal periods being three years full-time or six years part-time study). Students will also be entitled to a thesis pending period on completion of their period of registered study (one year for full-time students, two years for part-time students). Regulations should cover the following information: (a) The number of taught credits students are required to complete satisfactorily; students on a Professional Doctorate course must take a minimum of 120 credits and all modules taken must be at level 4 or 5. (b) The time limit by which taught modules should be completed (e.g. by the end of the first year for full-time students or by the end of the second year for part-time students). Regulations should also state that students should select modules in consultation with their supervisor(s) or that choice of modules is subject to approval by the Programme Convenor. (c) If available, the regulations should list the titles, codes and weighting of taught modules to be taken as part of the programme. If appropriate, further information on the form of assessment to be undertaken can also be included. (d) The minimum pass mark for taught modules on a Professional Doctorate is 50%. (e) If compensation is allowed for failing any of the taught modules, this should also be stated. Likewise, if students satisfy requirements for the taught component by achieving an average of 50% overall, this should also be stated. (f) It may be that some Schools will wish to include an element of generic research training by requiring students to take courses offered from within the Research Training Programme run by the Researcher Academy (or equivalent). In this case, regulations should cover requirements for satisfying completion of this part of the course (i.e. that students would be expected to obtain certificates for each course certifying at least 70% attendance). Regulations should also contain information on re-assessment for the information of students. A general paragraph could read as follows: Students who fail to satisfy the Examiners in any of the modules which are part of the taught component may be re-examined on such terms as the Academic Board, on the recommendation of the School, may decide. Students may normally be re-examined on one occasion only. Schools may wish to consider whether it would be appropriate for an interim award to be available for students, though this would only be an option where the taught element of the programme was sufficiently large to enable students to qualify for such an award under University Regulations for Taught Postgraduate Degrees (60 credits for a Postgraduate Certificate, 120 credits for a Postgraduate Diploma and 180 credits for a Master’s qualification). If so, this option should be covered as follows: Programme design, development and approval Guidance for this part of the regulations should cover the following factors: Schools should liaise with Student Services over the appointment of External Examiners with regard to the assessment of the modules comprising the taught element of the programme. It may be appropriate in some instances to consider how the thesis component of the course should be examined and whether it would be appropriate for an additional External Examiner (an expert practitioner in the field, for example) to be appointed in addition to an Internal Examiner and an External Examiner. Regulations should include a standard paragraph as follows: The degree of …. will be conferred on students who have completed the taught programme, submitted a thesis [or other form of assessment] in a form and of a standard as outlined above [plus any other requirements which the particular qualification requires]. Students are required to present themselves for a viva voce examination to be conducted by one internal (academic) Examiner, one external (academic) Examiner plus any further examiner as deemed appropriate for the particular qualification. The standard wording for this regulation should be as follows: “A student for the degree of … whose thesis fails to satisfy the Examiners may be allowed to: (a) make minor corrections to the thesis to the satisfaction of the internal (academic) Examiner; or (b) to represent the same thesis and attend a second viva voce examination; or (c) to represent the thesis in a revised form and take the whole examination; or (d) to represent the thesis without taking the whole examination. A student proceeding under this regulation shall normally be required to pursue a further course of directed study for a specified period that will not normally exceed one calendar year.” Again, where the assessment is in an alternative format to a thesis, the wording should be amended as appropriate. The possibility of being offered another award, when the Doctorate requirements are not met as a result of failure of the research component, should also be covered at this point. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}