{
    "url": "https://www.nottingham.ac.uk/qualitymanual/academic-regulations/reg-collection-and-use-of-set.aspx",
    "content": [
        {
            "p": "This page contains the University's regulations for the collection, use and publication of Student Evaluation of Teaching (SET) surveys. Its content applies to staff at the China campus only. Includes: EVALUATE; exceptions; failure to meet targets; justification 1.1 Student Evaluation of Teaching (SET) data must be collected using EVALUATE. The normal expectation is that staff included in the policy (see Section 2. Identification of staff and modules for SET) should conduct at least one SET survey during an academic year. 1.2 A School may decide in certain circumstances that some individuals are to be evaluated by SET more frequently over an agreed period of time. The following is a selection of such circumstances: 1.2.1 The individual is new to teaching and SET results will be useful to support the development of teaching skills. 1.2.2 The individual intends to apply for promotion and needs to collect SET over a period of time to fulfil the promotions criteria. 1.2.3 The individual has been identified through their Appraisal and Development Conversation (ADC) as needing to improve their teaching and frequent SET results are needed to track progress of this. 1.3 If any cases arise where a member of teaching academic staff has not conducted at least one SET survey in an academic year this should be brought to the attention of the Faculty Associate Dean for Education and Student Experience (UNNC), and justified. Includes: scope; Head of School responsibilities; relationship with previous SET; additional surveys All Research and Teaching and Teaching-focused staff who are teaching on Campus Solutions registered modules must be evaluated by SET. This applies regardless of the contracted hours with the University. Associates of the University can be evaluated by SET, including guest speakers and postgraduate research students who teach. 2.1 In rare cases a member of staff may only teach 4 hours or less in a teaching year. If this situation arises then the Head of School (or delegate) may decide that the individual should be exempt from SET, but they must have their teaching peer-observed. 2.2 The Head of School (or delegate) is responsible for identifying one module per year for which a member of staff should undertake SET. 2.3 That module should not normally be the same module that received SET the year before, and should where possible be a module for which the staff member is teaching a significant number of students (20 or more). 2.4 Any individual member of staff should be able to request additional SET surveys for any contribution they make to teaching for which they would like feedback (e.g. for professional development or module enhancement, or to support a promotion application or Lord Dearing Award application, etc.). Requests to set up additional SET surveys should be made directly to the Academic Services Office (UNNC). Modules which are not in Campus Solutions can be evaluated by using a non-standard survey. Includes: opening and closing dates; provision of information; time; Blue Castle; EVALUATE; discussion of reports. Staff who are being evaluated by SET have certain responsibilities that they must fulfil with support from their School. These are: 3.1 Ensure that an appropriate date and time for opening and closing the EVALUATE survey is agreed with the relevant Faculty office so as to maximise student participation. 3.2 Inform students at the appropriate time of the purpose of the survey and the period during which it will be live. 3.3 Ensure that students have time to complete the survey. 3.4 Display the information necessary to students to enable them to complete the survey. This is the Blue Castle address and the PIN if a non-standard survey is being used. 3.5 Consider using the Survey Monitor (in Blue Castle) to encourage participation. 3.6 Inform the relevent Faculty office if a survey fails to run for any reason so that the survey can be re-opened. 3.7 Be prepared to discuss SET reports as part of the Appraisal and Development Conversation (ADC). 3.8 Understand that there are no circumstances in which a student’s responses can be changed. The student can request that their responses are deleted by emailing the EVALUATE team, but will not be able to complete that particular survey again. Includes: confidentiality; permission to publish scores; promotions committee 4.1 SET results are regarded as confidential to the individual and a range of School, Faculty and University staff who have specified organisational roles to fulfil which require access to individual scores. 4.2 Staff should be permitted (but not required) to publish their SET scores. 4.3 Members of the Management Board and Faculty Associate Dean for Educations and Student Experience (UNNC) will have access to all Faculty and all School SET reports both for the current year and for all previous years. This will include the ability to view individual SET reports (both scores and comments). 4.4 Members of Promotions Committee will have access to the SET scores of individuals submitting promotion cases. 4.5 The Head of School has access to all individual SET reports within the School including scores and comments in the current year and in all previous years. The Head of School will also have access to the overall School SET report. 4.6 Other relevant Faculty and School based staff who might have good reason to be given access to individual reports can be identified by the Faculty Associate Dean for Educations and Student Experience (UNNC). Levels of access may vary between Schools and Faculties but the following staff should be considered for access: 4.7 Other University departments and individuals will from time to time require access to individual SET reports to fulfil their role or carry out a specific function. Examples include Human Resources for a range of actions including disciplinary, grievance and performance processes and the Lord Dearing Award judging panel. Includes: reporting abuse; University code of discipline; Student User Guide; disciplinary action 5.1 Abusive and personal comments are unacceptable and need to be removed from the EVALUATE system as quickly as possible. 5.2 Any individual receiving a comment that they identify as being abusive should report the abuse to a person agreed by the school, e.g. Head of School or Director of Learning and Teaching. The abusive comment should be reported by the agreed person to the EVALUATE team who will remove the student’s ratings and abusive comments. 5.3 In deciding whether a comment is abusive the agreed person should use common sense principles and if necessary refer to the University Code of Discipline and the Code of Practice for users of the University computing facilities. More information can be found here: 5.4 Students are informed of the seriousness of submitting abusive comments in the Student User Guide and it is recommended that Schools remind students of their responsibilities and indicate the seriousness of breaking the Discipline and Computing Facilities Codes. 5.5 In principle authors of offensive comments can be identified and disciplinary action could be taken if deemed necessary. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/regulations.pdf",
        "uk_pdf_files/evaluate-blucastle-student-guide.pdf"
    ]
}