{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/regs-on-conflict-of-interest.aspx",
    "content": [
        {
            "p": "This page contains the University's regulation on conflict of interest with regard to the delivery of End Point Assessment (EPA) and the appointment of Independent Assessors and External Assessors for Apprenticeship Integrated End-Point Assessment. This information is only relevant to staff and students based at the UK campus. The University of Nottingham as an apprenticeship End Point Assessment Organisation (EPAO) is required to deliver an independent, objective assessment of knowledge, skills and behaviours as set out in the relevant assessment plan that accompanies each apprenticeship standard. This regulation applies to those apprenticeship End Point Assessments undertaken where the University is the EPAO and applies to all staff taking part in or supporting an EPA. This includes individuals involved with any aspect of the delivery of an EPA, and also in the creation, distribution, marking or any other activity connected with tests and assessments, resources or services used within the EPA. Explicitly included in scope for this policy are all employees, contractors, agency or associate staff, verifiers/examiners and other support roles involved in making judgments in relation to the EPA outcome 2.1 A conflict of interest arises when an individual, or the University of Nottingham ,UK campus (UNUK) as a whole (including individuals or organisations contracted to deliver EPA on behalf of UNUK) has competing interests which could compromise, or appear to compromise, the outcome of an End Point Assessment. 2.2 Examples of actual or perceived conflicts of interest include (but are not confined to) i. is currently involved in delivery of the apprenticeship programme and/or on-programme assessment for the standard for which the University is acting as EPAO or has previously been involved in apprenticeship programm e delivery and/or programme assessment for the standard unless all students taught or assessed by the individual have completed their programme. ii. has a position of authority in one organisation that conflicts with their interests in another organisation. iii. has a prior link with the apprentice, or a link with their employer over the preceding five-year period (including having friends or relatives working with the apprentice or involved in programme delivery). iv. has friends, relatives or colleagues taking the apprenticeship programme to which the EPA is aligned. v. has personal interests, paid or unpaid, in the employer organisation undergoing the EPA. vi. has any other interest(s) that may compromise their assessment decisions. vii. has links to or works (paid or unpaid) for the same organisation as the apprentice. viii. stands to derive personal or business gain from the outcome of the assessment; or is working for an organisation in direct competition with the apprentice’s employer. 2.3 As an End Point Assessment Organisation, the University will ensure: i. That delivery of End-point assessment (EPA) is in accordance with the apprenticeship standard(programme) specific EPA plan. The Programme delivery team will be clearly separated from the decision on whether the apprentice has passed their EPA and the final grade they are awarded. ii. That anyone involved in the EPA process is free from any conflicts of interest that could adversely affect their judgement or objectivity in administering and undertaking robust and consistent EPA (in line with the requirements set out in the Assessment Plan for the Apprenticeship Standard). iii. That the recruitment process for those involved in EPA clearly set out the individual’s obligation to declare any actual or perceived conflict of interest. iv. That any involvement in the advice, support or training of the apprentice or apprenticeship programmes provided by the University does not conflict with the independence of the EPA process. v. Processes for the conduct of EPA and the identification and management of actual or perceived conflicts of interest are reviewed at least annually. vi. EPA assessment materials are treated as confidential and kept secure by those involved in the creation, administration and implementation of the EPA process, who must be independent of the apprentice. vii. That there is no collusion with employers, apprentices, other EPAOs, or those providing the apprenticeship programme, in the delivery of the EPA. This includes offering or accepting any incentives or inducements in relation to the delivery of EPA. 2.4 Programme Directors or nominee are responsible for the early identification of, and planning for, conflict of interest as part of their responsibilities and the planning for every individual EPA. 2.5 Where an EPA is to be hosted at the employer or provider organisation premises, the Programme Directors or nominee must, as part of the planning process, review any conflict of interest risks and, where identified, set out the actions required to avoid potential conflicts of interest in the EPA plan. Any alternative venue will need prior approval to be designated as a an official examination venue. 2.6 Individuals are expected to notify their Programme Director of nominee of any new conflicts of interest as they arise, to be recorded and managed in line with this regulation . 2.7 Concerns relating to actual or perceived conflicts of interest can be raised with Programme Directors, or nominee (Public Interest Disclosure) Code (see section 3 below). 2.8 Records of action in response to actual or perceived conflicts of interest will be retained in accordance with the University’s Document Retention Schedule. Includes: Employer, apprentice, integrated End-Point Assessment Conflict of interest is a key consideration in the appointment of Independent Assessors (IAs). The relationship between the assessor, the employer, the apprentice and the University will be considered within the appointment process as detailed in the guidance available for the recruitment of Independent and External Assessors. All IAs are required to declare conflicts of interest at the time of application to the University. Once appointed, IAs will be given names of the apprentices they are expected to assess for them to review and declare any conflict of interests. Upon reappointment the Independent Assessor will be required to declare if there has been any change of circumstances that may have bearing on their reappointment. Anyone who is included in the following categories or circumstances may not be appointed: i. a member of a governing body or committee of the appointing institution or one of its collaborative partners, or a current employee of the appointing institution; in an exceptional circumstance, an internal assessor may be employed by the University but must not have any interaction with the apprentice in this instance it would require Quality and Standards Committee (QSC) Approval ii. anyone with a close professional, contractual or personal relationship with a member of staff or apprentice involved with the programme of study or close connections to the employer iii. anyone required to assess colleagues who are recruited as apprentices to the programme of study iv. anyone who is, or knows they will be, in a position to significantly influence the future of apprentices on the programme of study v. anyone who is, or has been, significantly involved in current substantive collaborative research activities with a member of staff closely involved in the delivery, management or assessment of the programme(s) in question within the last three years vi. former staff or apprentices of the institution unless a period of five years has elapsed, and all apprentices taught by or with the independent assessor have completed their programme(s) vii. where a reciprocal arrangement involving cognate programmes at another institution is proposed, these cases will be referred to QSC for consideration viii. the succession of an IA by a colleague from the assessor’s home department and institution or organisation ix. the appointment of more than one IA from the same department of the same institution or organisation. Conflict of interest is a key consideration in the appointment of External Assessors (EAs). The relationship between the assessor, the employer, the apprentice and the University will be considered within the appointment process as detailed as detailed in the guidance available for the recruitment of Independent and External Assessors and managed by Registry and Academic Affairs. All EAs are required to declare conflicts of interest at the time of application to the University. Once appointed, EAs will be given names of the apprentices they are expected to assess for them to review and declare any conflict of interests. Upon reappointment the External Assessor will be required to advise if there are been any change of circumstances that may have bearing on their appointment. i. a member of a governing body or committee of the appointing institution or one of its collaborative partners, or a current employee of the appointing institution ii. anyone with a close professional, contractual or personal relationship with a member of staff or apprentice involved with the programme of study close connections to the employer vi. former staff or apprentices of the institution unless a period of five years has elapsed, and all apprentices taught by or with the external assessor have completed their programme(s) viii. the succession of an EA by a colleague from the assessor’s home department and institution and/or organisation ix. the appointment of more than one EA from the same department of the same organisation/institution. End Point Assessment Process Whistleblowing (Public Interest Disclosure Code) Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}