{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-role-and-appointment-of-examiners-for-research-degree-programmes.aspx",
    "content": [
        {
            "p": "This page sets out the role of Internal and External examiners for research degree programmes, including policy, criteria and appointment requirements. Its content is primarily directed at staff across all of the UK, China and Malaysia campuses. Please be aware that during academic year 2020/21, the University introduced additional guidance in response to the Covid-19 pandemic. This page was previously affected by these arrangements and has been documented accordingly. Further details can be found in the \"Additional guidance in 2020/21 due to Covid-19\" section below. Every research thesis will be evaluated by Examiners who have appropriate academic qualifications, relevant expertise in the area of research being examined, and a suitable level of experience in examining research degree submissions. Every member of academic staff of this University or another institution who is appointed to act as an Internal or External Examiner will receive information on the role of the Examiners. Includes: Submission information pack for postgraduate research students document The submission by the student of a Notification of submission of thesis for examination of a research degree form which has been signed by the supervisor will trigger the procedure for nomination of Examiners. The Notification form should be submitted at least three months in advance of the proposed submission of the thesis so that there is sufficient time to organise the appointment of Examiners before the thesis is submitted. On receipt of the Notification form, the Head of School will nominate individuals whom they wish to act as Internal and External Examiners for the research submission. The Head of School may involve the supervisor(s) and candidate in discussions on suitable examiners, but will be responsible for making the final decision on the nomination. Once discussions are completed, the nomination should be sent by the Head of School on the standard form to Registry and Academic Affairs, the Postgraduate Research Team or equivalent for approval by the University. There should be no contact between candidates and Examiners from the appointment of the Examiners up to the date of the viva voce examination, other than to make arrangements for the viva to take place. Includes: normal expectations; alternative arrangements; risks; duration of appointments Normally each research submission will be examined by one Internal Examiner who is a member of staff of the academic School at Nottingham to which the student belongs (or, if appropriate, a member of staff of another academic School), and one External Examiner who is a member of staff of another academic institution. Alternative arrangements (except that the examining board for any research submission must include at least one External Examiner) may be approved. For example, it is possible that in a small academic School there is no member of staff (apart from the supervisor who, of course, is disqualified from acting as an Examiner) with the expertise to act as Internal Examiner in the research area. The Head of School may reccomend that the submission be examined by two External Examiners, both of whom meet the published criteria for appointment, with a member of the internal staff acting as a co-ordinator of the examination proceedings. The role of the coordinator will be to organise and operate the administrative arrangements for examination of the student's thesis and to facilitate the smooth-running of the viva voce examination. One of the two External Examiners should be identified as the chair of the viva voce proceedings. Any cases where an individual examiner did not meet the published criteria for appointment should be considered by the Quality and Standards Committee. Where a candidate has a contract of employment with the University of Nottingham, Schools should consider whether the appointment of an Internal Examiner would risk the introduction of the perception of bias into the examination process. Where such a risk is identified, Schools should always take the option of appointing two External Examiners. The examiner appointments will last for the duration of the examination process, including re-submissions where this is the outcome of the first examination, unless exceptional circumstances arise. Includes: overview; submission of independent report The role of the Examiners is to consider whether the information, arguments and results of the student's research work as presented in the thesis and as defended in the viva voce examination (if appropriate) meet the academic standards relevant to the degree. The Examiners are required to submit independent reports on the thesis, a joint report on the viva voce examination (if a viva voce examination is required by the regulations), and a joint recommendation regarding the award of the degree. For more information about viva voce examinations, please consult the following: Viva voce examinations Includes: participation in viva voce examination; student defence of work; responsibilities The Internal Examiner must read the student's thesis and participate in the viva voce examination, and come to a view as to whether the student's research work and knowledge meet the standard which would normally be expected of a student in the School submitting for that degree, and the University's criteria for the award of the degree. They will receive the PDF version of the examination copy of the thesis and where appropriate share this with the External Examiner, subject to the agreement of the supervisor(s). In addition they should act as the facilitator of the administrative arrangements for the examination of the thesis and of the viva voce examination, including ensuring that any reasonable adjustments required for disabled students, including autistic spectrum conditions, disabilities, mental health difficulties, long-term health conditions, or specific learning differences are made. They should remind the External Examiner of the need to submit their independent report at least 3 working days before the viva, and also ensure that their own report is submitted at this time. Independent reports should not be shared before submission. They should seek to ensure that, during the viva voce examination, the student is given a fair opportunity to defend their work and that the External Examiner is aware of any extenuating circumstances which have a bearing on the student's case. Following a viva voce examination, the student should be given immediate informal feedback on the outcome of the examination and should be advised that more formal details will be transmitted later in writing. The Internal Examiner should also write to the student formally conveying the joint views of the Examiners on the submission, describing in detail the academic and presentational reasons for their recommendation, and (if appropriate) providing clear advice about what matters should be addressed in any resubmission. If corrections have been recommended, the Internal Examiner will be responsible for checking these and confirming with Registry and Academic Affairs that these have been completed. The Internal Examiner will be responsible for confirming that the final electronically submitted version of the work is that which has been approved by the Examiners if no corrections were needed after examination. Includes: responsibility of Head of School; eligibility The Head of School should ensure that the person nominated to act as Internal Examiner is a research-active member of the academic staff of the University who has the appropriate expertise in the student's research area. If Schools wish to recommend nominees who do not satisfy this criterion, this should be highlighted in the nomination form and a case provided for consideration by the Quality and Standards Committee (QSC). Internal Assessors who have been involved in the Progression Reviews may act as Internal Examiner if deemed appropriate by all parties, but it is not an expectation that they do so. Post-doctoral staff, Research Fellows below level 5, holders of honorary appointments who do not receive remuneration, Emeritus Professors, staff who do not hold a doctorate themselves and retired academic staff should not be permitted to act as Internal Examiners. Includes: recommendation of joint supervision; application to Quality and Standards Committee for permission An academic member of staff in their first appointment at the University of Nottingham can be permitted to act as sole Internal Examiner on their first postgraduate research degree examination occasion, as long as they have previous UK doctoral or MPhil PGR examining experience. Where internal examiner has no previous UK experience, an Independent Chair should be appointed who should monitor and report on their conduct in the joint report. However, Heads of Schools may apply to the Quality and Standards Committee (QSC) for permission to allow such a member of academic staff to act as the sole Internal Examiner without an independent Chair, if a good case can be made that the member of staff's educational and professional background makes it appropriate for them to act in this capacity. For more information about QSC, please consult the following: Quality and Standards Committee Includes: requirements; leading viva voce examination; judging standards The External Examiner must read the student's thesis and should lead the viva voce examination. The External Examiner must, in particular, come to a view as to whether the student's research work and knowledge are of a standard which are comparable to those of students being examined at other institutions for the same degree. Includes: members of staff from outside institutions; nominating individuals from other suitable environments; eligibility; approval of nominations Members of staff from outside institutions whom Schools wish to nominate to act as External Examiners for Nottingham research degrees should be research-active Professors, Readers, Lecturers or other teachers of their institution (or of equivalent status). However, it will be appropriate in some cases for Schools to nominate individuals from other suitable environments provided that those individuals are experts in the field of the student's topic of research and hold a professional status which is equivalent to a University Professor, Reader, Lecturer or teacher. In order to assess the eligibility of any individual to act as External Examiner who has not previously acted in this capacity for the University of Nottingham, the Head of School should obtain a brief Curriculum Vitae which should be forwarded to Registry and Academic Affairs, Postgraduate Research Team or equivalent, with the nomination on the standard form. They will retain the Curriculum Vitae for future reference. Nominations for Examiners will be approved by the University and Registry and Academic Affairs, the Postgraduate Research Team or equivalent, which will write to the External Examiners informing them of the terms and conditions of their appointment and their role as Examiners. The letter will include a request that the Examiner consider whether a potential conflict(s) of interest is likely to occur as a result of examining a candidate's thesis and if so, that they disclose it to the University. Includes: members of staff from other institutions; emeritus professors; retired academic staff A member of staff of another institution should not be invited to act as an External Examiner if they are a University of Nottingham graduate who graduated within the last three years. Also, ex-members of staff of Nottingham who left the University less than three years previously and holders of honorary appointments for which remuneration is given at the University of Nottingham should not be permitted to act as External Examiners. Emeritus Professors and academic staff who have been retired for more than three years should not be permitted to act as External Examiners unless it can be demonstrated that they continue to be research active. Includes: joint decisions; when particular weight should be given In the event of a disagreement on the appropriate outcome of a research degree examination between the Internal and External Examiner, the matter should be resolved by the Examiners on the basis of detailed argument about the specific academic points arising from the examination, and a joint decision should be reached. In this circumstance particular weight should be given to the views of the External Examiner. Where there are two External Examiners particular weight should be given to the chair. Includes: scope; attendance; availability for viva voce examination Members of the supervisory team may not act as Examiners for the student's submission. The supervisor(s) may not normally attend the viva voce examination except with the agreement of the External Examiner, in which case they may attend as an observer only or where required under the terms of an approved collaborative doctorate programme, in which case they may contribute questions but may not participate in making the Examiners' recommendation. However, it is recommended that at least one member of the supervisory team, preferably the primary supervisor, should be available in the School at the time of the viva voce examination in case the Examiners feel that their presence at the report of the outcome of the viva voce is required (for example, to give support to the student in the event of major corrections or a referral). Includes: instructions for examiners The Head of School must approve the appointment of the Examiners. Includes: nomination of examiners Please be aware that the following guidance was developed and applied during academic year 2020/21 in response to the coronavirus pandemic. This additional information was developed for examiners of doctoral candidates and should be read in conjunction with all other content on this page: Covid-19 and doctoral examinations – additional guidance for examiners for doctoral candidates at the University of Nottingham This guidance appeared alongside the University's Exceptional Regulations that were developed and applied in response to the coronavirus pandemic. For more information about the Exceptional Regulations as a whole, please consult the following: Exceptional Regulations: Covid-19 - 2019/20 - 2020/21 Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}