{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/pol-inappropriate-applicant-behaviour.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on inappropriate applicant behaviour. Its content is primarily directed at applicants but may also be of interest to staff across all of the UK, China and Malaysia campuses. Includes: University expectations; potential actions The University has clear expectations about the behaviour of members of its community. Details about the standards of behaviour expected and associated policies can be found on the University’s website. For more information, please consult the following: Student Community Student Conduct The University is committed to ensuring that any interaction with an applicant1 is conducted in a professional, courteous and respectful manner and it expects that any communication from an applicant is conducted in the same way. 1For the avoidance of doubt, “applicant” in the context of this policy refers to both those who are currently in the process of applying to the University and offer holders. In terms of this policy, a person remains an “applicant” until the point of registration. Applicants should note that the University may take action in response to inappropriate behaviour or language, both generally and specifically towards its employees or members of the wider University community (including other applicants). Hostile, aggressive or otherwise inappropriate behaviour or language, whether expressed verbally or in writing, and excessive levels of contact, will be viewed seriously and may adversely affect the consideration of an application, appeal or complaint. Where the University becomes aware of inappropriate language or behaviour by applicants, it will act to address this. The University will normally warn an applicant that his or her behaviour or language is inappropriate and that action is being considered, but where the behaviour or language is particularly inappropriate no warning need be given before action is taken. Such action may include the withdrawal of an offer or the rejection of an application. Conduct which constitutes a criminal offence may be referred to the relevant authorities. Includes: basis; potential actions; further investigation; role of Director of Student and Campus Life Where inappropriate behaviour or language is identified as requiring action it will be brought to the attention of the Director of Student and Campus Life. At that time, the applicant will be contacted by Admissions and asked to provide an explanation for the identified inappropriate problematic behaviour. On the basis of the evidence collated the Director of Student and Campus Life will take one of three actions: 1. Make a judgment on the basis of the available evidence and take one of the outlined actions within this process 2. Initiate an investigation to ensure that sufficient evidence is available to make an appropriate judgment 3. Dismiss the concern Where it is felt that further investigation is required, the Director of Student and Campus Life will commission this investigation from the Investigation and Conduct department within Campus Life. Whilst staff from Admissions and other departments may be used to assist with the collation of evidence, the Investigation and Conduct department must lead any investigation to ensure the independence of the investigation. Where the Director of Student and Campus Life believes they have sufficient evidence to make a judgment, they will choose one of the following actions: 1) Dismiss the concern 2) Provide the applicant with a formal written warning 3) Reject any/all applications made 4) Withdraw any offer that has been made to the applicant. To assist with their decision making, the Campus Life Director can take guidance and advice from colleagues on any case. Includes: process; consideration; potential outcomes An applicant may appeal an outcome of this process but must do so within seven days of receipt of written confirmation of the outcome. Appeals cannot be a rehearing of the original case and can only be brought on the following grounds: Appeals will be heard by the Deputy Registrar. Where the Deputy Registrar had involvement in the original case, the appeal will be heard by the Registrar. Upon considering the appeal, the Deputy Registrar may: 1. Allow the appeal and either: a. Reduce the outcome b. Dismiss the original concern 2. Dismiss the appeal The decision of the Deputy Registrar is final. Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}