{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2006.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2006. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. 20 December There have been several changes to regulations governing research degree students: 18 December The Policy on Personal and Academic Support has been reformulated and re-presented to explicitly, accurately and clearly inform students and Schools of their respective responsibilities in regard to personal and academic support. There has been no actual change to policy. 24 November There has been an amendment to the course approval process to clarify the requirements to seek external advice in programme design. External advice 'should' be sought when developing a new programme, and for any new programmes where more than 25% of taught modules (in credit terms) students will be required to take are new, then external advice 'must' be sought. This is in the Taught Programmes section. 24 November Guidance for Schools on Ordinary Degrees has been added to the Quality Assurance Structures section. The guidance has brought together existing policy in regard to these degrees and includes guidance on the structure of the degrees and programme specifications, transfer and progression. 6 November Following discussion at Recruitment and Admissions Committee, the minimum English Language Entry Requirements for students applying to the University of Nottingham have been streamlined in to five bands. This is in the Recruitment and Admissions section. 22 September The Assessment section has been revised to enable staff and students to access information more easily. There are no changes to existing policy, but the following revisions have been made: • The document on ‘Assessment Policies’ has been replaced by an Overview and individual documents relating to School Examination Boards, Role of the Assessment Group of Taught Courses Committee, Forms of Assessment, Retention of Assessed Work, Feedback to Students and Award of qualification • Information relating to Marking and Grading has been brought together in one document. • Links to a new document Guidance for Students Sitting University Examinations have been included in the Overview and Responsibilities of Students. 31 May An E-Learning and Distance Learning Policy has been published. The policy covers educational provision leading to an award or part of an award which is delivered and/or supported and/or assessed through means which generally do not require the student to attend particular classes or events at particular times and particular locations. The policy outlines the minimum requirements that the University expects should be met by Schools when delivering this provision. 31 May The Academic Appeals Policy and Procedure has been updated to reflect the replacement of Faculty Assessment Committees by the Assessment Group of Taught Courses Committee/Research Degrees Committee. 31 May The policy on Resources and Facilities that should be made available to research degree students has been revised following consultation with Academic Boards. This is within the Research Degree Programmes section. 23 May The University of Nottingham Qualifications Framework has been modified to reduce the number of credits required for Graduate Certificates and Diplomas, and within this to reduce the number of credits that would be required at level 3. This would bring the University into line with general practice in the sector, as highlighted in the Measuring & Recording Student Achievement Steering Group. 23 May A new entry has been added which clarifies current practice for approving changes to module specifications. This is within the Programme Approval, Monitoring and Review section. 10 May An addition has been made to the guidance on Marks and Credit Transfer for Students on Placements, to clarify how the University's study regulations should be applied for students on placements. It clarifies that the student’s Learning Agreement should state the manner in which reassessment will be undertaken if a fail mark is received during a placement. This is within the Placement Learning section. 8 May New policy and procedures for the Submission and Approval of New Courses have been added to the Programme Approval, Monitoring and Review Section. This policy applies for all courses starting in 2007/08 onwards. For courses starting in 2006/07 please see http://www.nottingham.ac.uk/quality-manual/taught-programmes/sub-app.htm 28 April The Assessment Group of Taught Courses/Research Degrees Committee has revised the entry for Extenuating Circumstances. There's no change to existing policy, but the following revisions have been made: The extenuating circumstances policy is within the Assessment Section. 31 March The Academic Offence Procedures have been revised following approval at the February 2006 meetings of Taught Courses Committee and Research Degrees Committee. The revisions allow Schools to impose a range of penalties which would previously had been the responsibility of Faculty Assessment Committees and include revisions to the powers of the Academic Offences Committee. The procedures are within the Assessment section of the Quality Manual. 31 March Regulations for the Degrees of Master of Arts by Research and Master of Science by Research have been added to the Research Degree Programmes section. These generic regulations were approved by Research Degrees Committee in February 2006 and allow for Schools to award MA/MSc by Research degrees with their own individual titles 27 March The Faculty of Medicine and Health Sciences Fitness to Practise Committee Procedure has been added to the Study Regulations section. The procedures, which were put into effect in 1999-2000, relate to students on any course leading to a professional qualification within the Faculty of Medicine and Health Sciences. 24 March Within the Study Regulations section, guidance for students wishing to change a taught course has been revised to include guidance for postgraduate taught course students. 24 March There had been a minor amendment to regulation 12 of the Regulations for Undergraduate Courses to allow supplementary regulations for Integrated Masters courses and certain Honours courses with a compulsory year away from the University to specify a higher progression average across a set of modules within a stage. 24 March The role of a professional proof reader for research theses has been defined in the Research Degree Programmes section. 14 February Within the Students with Disabilities section, Guidelines for Schools have been added which outline the minimum requirements that Schools must satisfy to meet the needs of students with disability, as legislated for under the Special Educational Needs and Disability Act (SENDA) 2001. It applies to overseas or EU students as well as to British students, and to those who are only taking part of a course. 10 February Regulations for the Degree of Doctor of Philosophy (PhD) and Master of Philosophy (MPhil) The revised Section 1 of the QAA Code of Practice for the Assurance of Academic Quality and Standards in Higher Education stated that “Institutional Regulations for postgraduate research degree programmes (PRPs) will be clear and readily available” (Precept 2) and accordingly at its meeting on 9 February 2006 Research Degrees Committee reviewed the clarity and format of its regulations for research students as well as for students on taught courses and approved a recommendation to introduce a new set of combined PhD and MPhil regulations with immediate effect. The new Regulations cover both degrees of MPhil and PhD, removing the present duplication between the two sets of Regulations. In addition to the existing provisions, new material has now been added, which has the benefit of putting all the most important provisions from entries on Progression and Assessment in the Research Degree Programmes section of the Quality Manual in one place, as follows: The effect of the more detailed Regulations is to put the information currently contained in two sets of Regulations and six Quality Manual entries in one six-page document, which has the advantage of ensuring students have all the important information applicable to their course in one place. The regulations are in the Study Regulations section of the Quality Manual. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}