{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-edd-lifelong-learning.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Education (EdD) (Lifelong Learning). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 1. A candidate for the Doctor of Education (Lifelong Education) must (a) Be a graduate of an approved university holding a Bachelor's degree (normally first or second class Honours or equivalent) and normally holding a MA or MEd from an approved university, or (b) Hold such qualifications as may be deemed by the University to be equivalent to those referred to in (a). 2. Candidates will normally be expected to have a minimum of two years' professional experience within the field of post-compulsory education. 3. All candidates will be interviewed. 6. The thesis component requires the candidate to undertake original research in an approved topic in the field of lifelong or post-compulsory education and complete a 40 - 50,000 word thesis. The thesis must (a) Offer an original application of knowledge in the area of lifelong education, and (b) Demonstrate the candidate's ability to integrate academic analysis with practical relevance and application. 7. The thesis should be the result of work done mainly while the candidate is registered for the degree. A certificate to this effect, countersigned by the candidate's supervisor, shall be submitted by the candidate when presenting the thesis. The submission should also be accompanied by evidence that the taught component of the award has been satisfactorily completed. Includes: assessment of taught component; progress from taught to thesis component; assessment of thesis 8. The pass mark for all modules is 50%. 9. Candidates who fail to satisfy the Examiners in any of the core modules may be reassessed on such terms as the University may decide. Under normal circumstances, only one reassessment opportunity will be afforded. 10. Candidates who have failed to satisfy the Examiners in any of the core modules may not progress to the thesis stage of the award. 11. Candidates are required to submit a thesis of 40,000 - 50,000 words on a topic approved by the appointed supervisor and Head of School. 12. Candidates are required to present themselves for a viva voce examination to be conducted by one internal (academic) Examiner who is not one of the candidate's supervisors and one external (academic) examiner, both of whom would normally be senior educators in the field of lifelong education. Includes: exceptional circumstances; candidates who fail to satisfy examiners 13. A candidate whose thesis has satisfied the Examiners will be awarded the degree of Doctor of Education (Lifelong Education). 14. A candidate for the degree of Doctor of Education (Lifelong Education) whose thesis fails to satisfy the Examiners may, by permission of Senate on the recommendation of the Examiners and the University, be allowed to (i) Make minor corrections to the thesis to the satisfaction of the internal (academic) Examiner, or (ii) Re-present the same thesis and attend a second viva voce examination, or (iii) Re-present the thesis in a revised form and attend a second viva voce examination, or (iv) Re-present the thesis without attending a second viva voce examination A candidate proceeding under this Regulation shall normally be required to pursue a further course of directed study for a specified period that will not normally exceed one calendar year. 15. Candidates proceeding under Regulation 14 who re-present their thesis and again fail to satisfy the examiners may be awarded the degree of Master of Philosophy without further periods of study. 16. In exceptional circumstances, candidates proceeding under Regulation 14 who re-present their thesis and again fail to satisfy the examiners may be granted, by the approval of the School Staff Committee on the recommendation of the examiners, the opportunity to undertake one further period of directed study of no more than one semester and re-present the thesis for the award of Master of Philosophy. 17. Candidates who fail to satisfy the examiners in the thesis component will be awarded the Diploma in Lifelong Education. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}