{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/independent-assessors-role.aspx",
    "content": [
        {
            "p": "This section contains detailed information with regards to the roles and responsibilities of the Independent Assessors for Apprenticeship Integrated End-Point Assessments. This information is only relevant to staff and students based at the UK campus. The following is only applicable for Integrated programmes. Where a specific integrated apprenticeship programme's End-Point Assessment plan makes references to other specified assessment roles within the marking and assessment team arrangements, the responsibilities noted below apply to all defined roles within that team. 1.1 Schools are responsible for providing nominations for the appointment of Independent Assessors (IAs) for their End-Point Assessments (EPA) on an annual basis. Council has the power to receive nominations and approve such appointments and discharges its responsibilities in this regard through the Quality and Standards Committee (QSC). 1.2 The IA may be appointed internally or externally, but must not be involved in the delivery of the apprenticeship training and must be independent from apprentices and employers. 1.3 It is the IA’s role to carry out the EPA, as set out in the assessment plan, and to ensure the assessment processes are reliable, fair and transparent and that they operate in line with the University’s Regulations. 1.4 The IA will be provided with guidance and undertake an induction and relevant training for the EPA delivery, which will be provided by the School. 1.5 The IA will be expected to engage in regular Continual Professional Development (CPD) activity related to their role in line with the relevant Apprenticeship Standard - and will be required to provide evidence of this to the School. 1.6 The IA will take part in marking, moderation and standardisation activities for the EPA and will produce a summary report to be reviewed at the Exam Board. 1.7 The School has a duty to ensure that a sufficient number of IAs are appointed, as outlined in the approved End-Point Assessment Organisation (EPAO) application documentation, which has taken into consideration the likely volume of EPAs to be undertaken within the given timeframe. 1.8 Schools should ensure that their apprentices are informed that it is inappropriate for them to directly contact IAs, and that other appropriate mechanisms are available for them to raise concerns regarding their individual performance in assessments, for example the Appeals or Complaints procedures. The main responsibilities of IAs are: 2.1 To be responsible for conducting End-Point Assessment (EPA) activities under the conditions, timescales and arrangements as set out in the EPA plan for the relevant apprenticeship Standard, including: 2.2 To participate in annual assessment training and assessment standardisation events 2.3 To annually submit evidence of CPD records to the relevant School within the agreed timescales 2.4 To annually review their conflict-of-interest declaration within the agreed timescales 2.5 To complete reports within university timescales Includes: Conflict of Interest; apprenticeship standards; assessment plans; CPD 4.1 Nominees should have experience and expertise of the following: 4.2 Be independent of the apprentice, the EPAO (University of Nottingham) and employing organisation who are involved in delivering the apprenticeship 4.3 Be able to demonstrate the knowledge, skills and experience required of an IA outlined in the EPA plan, and meet all external regulatory requirements 4.4 In view of the importance of the IA, the University reserves the right to review the appointment of an IA in the following circumstances: Includes: conflict of interest; categories and circumstances; reappointment restrictions 5.1 A conflict of interest is raised. For more information, please consult the following: Policy on conflict of interest 5.2 Appointment of an IA will be carried out on an annual basis by the School, in conjunction with Registry and Academic Affairs (RAA). 5.3 Re-appointment (or renewal) of an IA who has previously fulfilled the role may be allowed, on the basis that the individual in question continues to meet all of the requirements of the Academic Standard and has shown an acceptable level of involvement in the past. 5.4 An IA should normally hold no more than one other similar post during the period of their appointment. 6.1 IAs will be appointed on an annual basis. 6.2 Each IA will receive a formal letter of appointment from Registry and Academic Affairs (Quality and Student Management System Team), setting the programme(s) to be examined, the specific responsibilities and the fee. Includes: responsibility of Registry and Academic Affairs; appointments with no previous experience; responsibilities of the Head of School 7.1 Registry and Academic Affairs ensures that all IAs are informed about the University’s procedures and policies, including the University’s appeals and reassessment process, which may be by provision of an opportunity to attend a University or School induction event. 7.2 Where the individual appointed has no previous experience as an IA for any institution, the School should ensure that the appointment is, if practicable, made to a team of IAs, or that, with prior agreement, a more experienced IA will act as a mentor. 7.3 Heads of School are responsible for ensuring that IAs are provided with information on the University’s marking and grading policy, moderation practices and any additional requirements contained within the Apprenticeship Standard or EPA plan 7.4 The School should ensure that all IAs are given the opportunity to engage with training / briefing materials at both University and School level. Engagement with such materials by the IA is considered mandatory. 7.5 Heads of School are responsible for ensuring that IAs are given the relevant material and adequate time to carry out the role. Includes: requirements; Microsoft Forms report; annual report; final summary report 8.1 IAs are responsible for making assessment decisions. In doing so, they need to ensure that marking criteria have been applied rigorously and fairly and that the outcomes reflect the standards set out in the EPA plan. 8.2 IAs are responsible for providing the University with a summary report in a digital format, using the template provided. Reports are to be submitted within the prescribed timescales outlined in the EPA Plan. The IA’s summary report should be submitted through Microsoft Forms to Registry and Academic Affairs (Quality and Student Management Systems team), who will then arrange for the fee to be paid. 8.3 The report form is available on request, by emailing: indi-assessors@nottingham.ac.uk 8.4 Registry and Academic Affairs (Quality and Student Management team) will forward copies of the report to the Head of School (for action). Copies should also be made available to the External Examiner for the EPA, the Exam Board and Apprenticeship Committee. Includes: report explicitly on standards, assessments and awards; may also make a written report on confidential matters Includes: School responsibilities; opportunities for feedback; circulation; communication requirements; responsibilities of Quality and Standards Committee 10.1 It is the School's responsibility to ensure that the annual IA reports comply with the standard requirements outlined within the EPA plan. Summary reports must be available to the External Examiner, (EA) and the Apprenticeship Committee. If an IA fails to submit an annual summary report within the time stipulated by the School in order to meet the assessment board date, this may constitute grounds for not re-appointing the IA in a subsequent year. 10.2 To assist Schools in fulfilling their responsibility, Registry and Academic Affairs (Quality and Student Management Systems team) will notify them annually of any outstanding reports. The School should provide an opportunity for the IA to give feedback arising from the performance of his/her duties, and for the School to provide information to the IA on how the School has addressed issues raised in any previous report(s). 10.3 Subsequently, the School will forward each report of an IA, together with the written report on how the School has addressed the issues raised, to Registry and Academic Affairs (Quality and Student Management Systems team). 10.4 A letter is to be sent to each IA by the School on the actions or otherwise that have resulted from the report. A copy of each letter should be forwarded to Registry and Academic Affairs (Quality and Student Management Systems team) to be stored as a record. 10.5 It is the duty of the Quality and Standards Committee (QSC) to assure itself that any comments or recommendations of an IA have been addressed by the School and, if it is not satisfied, to seek to resolve the matter through a dialogue with the School. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}