{
    "url": "https://www.nottingham.ac.uk/qualitymanual/studies-away-from-university/recog-other-learning.aspx",
    "content": [
        {
            "p": "This page provides guidance on where other learning credit(s) can be awarded towards a University of Nottingham qualification. Its contents are relevant to staff and students across all of the UK, China and Malaysia campuses and may also be of interest to prospective students. Includes: definition; School responsibilities Recognition of other learning (ROL) covers all instances where credit towards a University qualification is awarded by the University by means other than enrolling on University modules or participating in formal placement or joint degree arrangements. Please be aware that: Includes: Recognition of Prior Certified Learning (RPCL); Recognition of Prior Experiential Learning (RPEL); Recognition of Prior Learning (RPL); terminology; Table of ROL contribution towards qualifications Recognition of other learning (ROL) can cover the following aspects: Recognition of prior certified learning (RPCL) – that is, recognition given in the form of credits to learning which is certified and at a higher education level but has not led to the award of higher education credits (such as professional development awards or employment-based awards). Recognition of prior experiential (or informal) learning (RPEL) – that is, an assessment process on the part of academic staff within the University leads to the recognition of learning gained through vocational or other experience, usually through the award of credit. Recognition of prior learning (RPL) – that is, where credits or qualifications have been awarded by a higher education degree-awarding body in accordance with the higher education qualifications framework. Credit transfer can be either on the basis of an individual application or as part of a formal arrangement with an external institution.The admitting school determines the status of that award (including considerations of volume and level) as it relates to the programme the applicant wishes RPL to be applied to. For more information, please consult the following page: Partnerships and placements The term Recognition of Other Learning (ROL) is used where certified (RPCL), experiential (RPEL) and Recognition of Prior Learning (RPL) are being referred to together. The effects of previous research study on the minimum periods of registration for research degrees are contained in the regulations for those degrees. More information can be found here: Regulations for PhD and MPhil The expectation is that all elements of a ROL application will be submitted in English except for official certification and where the subject of study is a language or literature other than English. The University’s policy on Partnerships and placements should be referred to for guidance about mark and credit transfer for students on study abroad placements at educational Institutions where this an integral part of their programme of study. For more information, please consult the following: Foundation Certificate 80 40 Undergraduate Certificate Undergraduate Diploma 160 Ordinary Degree (Part I only) *From 2015/16 this degree is only available as an exit award. 120 100 Honours Degree (Qualifying and Part I only) 240 Graduate Certificate 20 Graduate Diploma Integrated Masters (Qualifying and Part I only) Postgraduate Certificate Postgraduate Diploma Masters (Taught stage only) 60 Research Master (MRes, MSc (by Research), MA (by Research)) Professional doctorates (where the research element is weighted at two-thirds and the taught element weighted at one-third of the programme For more information about changes to availability, please consult the Academic regulations category: Academic regulations Includes: decisions; submission requirements; applications; potential fees Where the learning has occurred prior to the student being admitted to the University, application for Recognition of Other Learning (ROL) should be made before the student first registers with the University as schools may choose not to consider any applications for ROL submitted after admission. Decisions for all applications will be made by the admitting school, which can request any supporting evidence from the student which it deems necessary to reach a decision. The school may also wish to interview the applicant. As a minimum, applicants should include the following information within their submission for ROL (although schools may choose to waive some requirements where the ROL will only count towards the foundation or qualifying stage). For all applications: The number of credits for which ROL is being sought and the stage in the student’s programme at the University (e.g. Qualifying Stage, Part I) against which the credits will be counted. Any specific modules or category of modules from which exemption is being sought as a result of the ROL. Applications for ROL or Credit Transfer at Entry (CTAE): The title, location, and nature of the institution at which the learning occurred. The dates of attendance at the institution and of any qualifications obtained. A statement of the equivalence of any qualifications obtained to levels and qualifications detailed on the University’s qualifications framework page. Curriculum details of subjects studied at the institution. An authorised transcript of marks and details of the marking scheme used by the institution. For more information, please consult the following pages: Applications for Recognition of Prior Experiential (or informal) Learning (RPEL): An account of the activities undertaken which have resulted in learning, including the dates and duration of these activities. A detailed statement of what has been learned from these activities. Confirmation from an employer or other objective source of the activities and learning claimed by the student. Schools may choose to charge a fee for considering a ROL application; such a fee, though, should be kept to a minimum and only be designed to cover the cost of assessing the application. Where fees are charged, these are likely to be higher for an RPEL than for Recognition of Prior Certified Learning (RPCL) or CTAE application. Applicants should note that if RPEL is granted, and fewer credits are therefore studied, the resulting tuition fees will be as set out in the University’s fees regulations. Applicants should also note that the reduction in the number of credits being studied may prevent them from having the status of full-time students. Includes: school responsibilities; additional criteria; application for ROL admissions office form; admissions office Schools are responsible for approving Recognition of Other Learning (ROL) applications but should not approve them unless the following criteria are satisfied: The factual statements contained in the application have been substantiated (either by the school or the Admissions Office) such that there is sufficient evidence of the learning claimed and that it is clearly the result of the applicant's own efforts and achievements. The prior learning has taken place in the last ten years (many schools will, of course, require the learning to have occurred much more recently). The student has gained pass marks in those modules or units for which Application of Prior Learning (APL) is being claimed. There is a close match between the prior learning and the level and learning outcomes of those modules which will not be taken as a result of the ROL. The limitations on granting ROL contained in the policy on Limitations on ROL and policy on Double Counting have not been breached. The school may have additional criteria which must also be satisfied. All decisions to grant ROL must be reported to Registry and Academic Affairs by submitting the relevant form and recorded against the student’s academic record. For more information, and to make an application, please consult the following: Services for Students - Recognition of Other Learning Includes: UCAS; School responsibilities; decision Students applying for direct entry to Part I via UCAS will receive a decision on their application (by way of UCAS) in the same manner as other applicants. Students applying for Recognition of Other Learning (ROL) should be informed of this by the school and should also be told: Whether a fee will be charged for considering an ROL application and the amount of that fee. The information the student will be expected to provide and any deadlines for providing it. The likely timescale for considering the application. Whether they will receive feedback on their assessment on either a successful or rejected case. Alternatively, the applicant should be told that the school or programme has a policy of not granting ROL, if that is the case. Once a decision has been made by the school, the student should be told in writing by the school: Whether or not ROL is being granted. The number of credits being awarded, their level, and the stage of the student’s course against which the credits are being counted. The marks which have been attributed to the credits being awarded. Or, in the case of a student receiving ROL for which no marks have been attributed, the arrangements for progression and classification. Any specific modules or groups of modules from which the student is being exempted as a result of the ROL. Any restrictions on the student’s module choice over and above normal University and supplementary regulations. The written communication containing this information should be copied to Student Services Development (Academic Processes) or equivalent. Includes: group articulations on ROL; Memorandum of Agreement (MoA); monitoring and review; Schools may establish agreements with other educational institutions to grant Recognition of Other Learning (ROL) to groups of applicants to their courses who have obtained a particular qualification or successfully undertaken specified periods of study. Please note the following: The Memorandum of Agreement (MoA) underpinning group ROL should be drafted with reference to the QAA Quality Code for Higher Education Chapter B10 Managing Higher Education Provision with Others and the University’s guidance on MoAs and be submitted to Quality and Standards Committee (QSC) for consideration prior to signature. Details of the students being admitted through such agreements should be reported to Student Services Development or equivalent. Quality and Standards Committee All group ROL agreements should be reviewed by the School as part of periodic Educational Enhancement Assurance Review (EEAR). Statistics relating to the progress and achievement of group ROL students compared to the rest of the cohort should be considered by the School as part of annual monitoring of programmes. For more information about the EEAR process, please consult the following : Educational Enhancement and Assurance Review Includes: maximum amounts; table of maximum ROL contribution towards qualification; academic regulations The maximum amount of Credit Transfer at Entry (CTAE) or Credit Transfer Post Entry (CTPE) which can be awarded towards University of Nottingham undergraduate qualifications is two-thirds of the total credits for the programme. The maximum amount of Recognition of Prior Experiential (or informal) Learning (RPEL) which can be awarded towards University of Nottingham undergraduate qualifications is one-third of the total credits for the programme. The maximum amount of RPEL which can be awarded towards University of Nottingham postgraduate qualifications is two-thirds of the credits for the taught stage of the programme, except that: RPEL cannot be granted towards Part II or equivalent or Part III of an undergraduate programme, nor towards the dissertation stage of a Masters programme. If Recognition of Other Learning (ROL) based on a combination of certified, credited and experiential learning are granted to the same student, the overall number of credits awarded must not exceed the maxima for ROL. The limitations applied to group articulations of CTPE will be set out in the relevant Memorandum of Agreement (MoA). ROL granted for previous study at Nottingham is not subject to the limitations stated below. For more information, please consult the Double counting section located further down this page. Table of maximum ROL contribution towards qualifications Masters (taught stage only) For more information about changes to availability, please consult the following: Includes: granting of ROL; restrictions; admissions procedures; relevant exceptions; academic procedures Recognition of Other Learning (ROL) can be granted for all learning from other educational institutions, even if that learning has already resulted in the award of a qualification similar to, or the same as, the qualification to be awarded to the student by the University of Nottingham. Similarly, the University places no restrictions on other institutions awarding qualifications on the basis of credits or qualifications gained at Nottingham. ROL towards a University of Nottingham qualification may be granted for learning which has taken place in a previous period of study at the University, even if that learning has led to a Nottingham award. For example a student who has already left with a bachelor's degree may subsequently be allowed to return and take a further year for the award of an Integrated master's degree. No credits below honours level (university level 3) may be used as ROL for a postgraduate programme. In accordance with the admissions procedures, individuals who have previously registered for and been unsuccessful on a course at the University of Nottingham may not apply to the same programme again and the ROL procedure does not apply to such potential candidates. ROL from a University of Nottingham qualification may not be used to count towards a second Nottingham qualification which is both at the same level and in a similar subject to the first. For example, a student who has left with a BA Honours in Anthropology would not be able to count ROL from this programme towards a second BA Honours in Social Anthropology. The exceptions to this are that a student who has successfully completed a Postgraduate Diploma programme (that is to say, was not awarded a Postgraduate Diploma as a result of failure on a Master's programme) may subsequently be allowed to return and to undertake a dissertation for the award of a Master's degree and that a student who has successfully completed an Integrated master's programme may use credits from that programme towards a postgraduate master's programme subject to approval from the admitting school and to the limitations on ROL above. For more information on double counting, please consult the following: Admissions procedures Includes: where marks are awarded; where marks are not awarded; partnerships and placements In the case of credits gained through Credit Transfer at Entry (CTAE) and Credit Transfer Post Entry (CTPE), marks should, if possible, be attributed to the credits using the same procedure as for marks transfer of exchange students. Marks may also be awarded for Recognition of Prior Certified Learning (RPCL) and Recognition of Prior Experiential (or informal) Learning (RPEL) through appropriate assessment of the student’s portfolio of evidence. The compensation arrangements in the University’s study regulations will, however, only operate on the basis of modules studied at the University. In the case of undergraduate students, for example, a student must have passed 80 credits worth of modules taken at the University of Nottingham in order to be in a position to compensate any modules that have been failed at the University. Marks attributed to credits gained through Recognition of other learning (ROL) will, though, be used to calculate the student’s overall average for both compensation and classification purposes. If the school does not believe it has sufficient information to attribute accurate marks to the credits gained through ROL, the following arrangements are to be followed in determining compensation (for progression purposes) and classification of awards for students: In calculating the weighted average mark for purposes of compensation, only credits derived from modules on which the student has enrolled will be used. For example if a student has received 20 credits of ROL, then the student’s average mark will be obtained by dividing the weighted aggregate mark by just 100 rather than the normal 120. Credits gained through ROL will not count towards the minimum number of credits that must be passed in order for compensation to occur. In calculating the overall weighted average for classification purposes, only credits derived from modules on which the student has enrolled will be used. For example if an honours student has received 20 credits of ROL at Part I, then the student’s Part I average will be obtained by dividing the weighted aggregate mark for Part I by just 100 rather than the normal 120. If the student is enrolling on less than 100 credits in Part I of an undergraduate programme, the school may decide to set a non-standard Part I/II weighting for that student which allocates a lower than normal weighting to Part I. For more information in regards to exchange students, please consult the following: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}