{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/viva-voce-examinations.aspx",
    "content": [
        {
            "p": "This page sets out the procedures for viva voce examinations, including advice on timings, location, format and attendance. It content is relevant to staff and students across all of the UK, China and Malaysia campuses. The viva voce examination (if required, as will be the case for doctoral degrees) will normally take place at the University. However, the Head of School may give permission in appropriate circumstances for the viva voce examination to be held in another location or through online means provided agreement of the Examiners and the student is obtained and the proposed location/format is one that is deemed by them all to be suitable for the purpose. These decisions will be indicated on the Nomination of Examiners form, which will alert Registry and Academic Affairs to the proposed arrangements. If circumstances demand it, a viva voce examination may be organised in another form (e.g. by a video conference/other online platform). Before agreeing such an arrangement the School must check that appropriate facilities for an online viva voce are available to all participants, and shall ensure they have written confirmation that the student and the Examiners have agreed to the proposal. Hybrid viva conditions with only the candidate located remotely are not permitted. If a hybrid viva is unavoidable, if and where possible, the candidate should be co-located with either the Internal Examiner or Independent Chair. If an online viva voce format is agreed by all parties, this cannot subsequently be used as grounds for an appeal. Recording of the viva is not permitted, and no evidence based on unauthorised recordings of the viva will be permissible in any appeal process. If Schools wish to do so, an independent, non-examining Chair may be appointed to preside over the viva proceedings in order to ensure consistency between different vivas and to provide an additional viewpoint if the conduct of the viva should become the subject of a student appeal. Where the appointment of an independent Chair is not feasible, Schools should find alternative ways of assuring fairness and consistency which are acceptable to the student. Where vivas are being conducted by online methods where all parties are at different locations, an independent non-examining Chair must be appointed. Other circumstances when an Independent Chair must be appointed are detailed in additional guidance. When appointed or required for an online viva, the independent Chair will chair the viva and be present throughout but not take an active role in the examination or decision making. Supervisors may not normally attend the viva voce examination. If concerns about process or PGR support or performance are raised, an independent Chair should attend to ensure fairness and consistency of examination process. The Head of School has a right to attend as an observer at the viva voce examination of any research student in their School, unless they are the student's supervisor, in which case a deputy should be appointed to attend in their place (see paragraph 13 of the Role and Appointment of Examiners for the right to attend as a supervisor). For more information, please consult the following: Role and Appointment of Examiners Before the viva voce examination takes place the Head of School should first inform the Examiners, the student and the supervisor that they intend to attend. The Examiners may request that the Head of School attend a viva voce examination. If the viva voce is held online, the candidate may request that they have a supporter/observer present with them either for the entire viva, and/or for the communication of the decision. This individual must not contribute in any way to the viva, and must be introduced to all participants on camera at the start. The viva will include questions and discussions that determine whether the candidate has achieved the required doctoral outcomes. For more information about the UNQF, please consult the following: This will normally include questions and discussion designed to: ascertain that the thesis embodies the candidate’s own research; clarify aspects of the research presented in the thesis to ensure understanding; test the candidate’s general comprehension of the field of study within which the subject of the thesis falls; test the candidate’s acquaintance with the general literature of the subject and knowledge of the relationship of the work to the wider field of which it is a part; and determine the respects in which the work advances, modifies, or otherwise affects this wider field of scholarship. Following the viva voce examination the Examiners will complete and sign the Joint Report Form and shall come to agreement on the recommendation on the award (or not) of the degree. The option not to award any degree following the first examination is one which should only be chosen in extreme circumstances. Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}