{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/emergency-contact-protocol.aspx",
    "content": [
        {
            "p": "This page contains the student emergency contact protocol and explains why students are asked to provide the University with such contacts at registration. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship All students are asked to provide details of an emergency contact when registering for their course as part of the University’s approach to supporting the safety, welfare and wellbeing of students. This information is requested in the unlikely event that there is a serious incident, or there is serious concern for the safety, welfare and wellbeing of a student registered with the University. Whilst students are encouraged to record an emergency contact, it is not mandatory to do so. The information below sets out the possible circumstances when it may be necessary for the University to communicate with a student’s emergency contact. Where an emergency contact, or other concerned third party, communicates information to the University regarding a concern for student wellbeing or welfare, the University will act in a timely manner to make contact with the student to ascertain their safety and any follow up actions. Any communication back to the emergency contact or concerned third party will be in line with this protocol. In the event of a student death, this Emergency Contact Protocol will not apply. In accordance with the privacy information for students the University may provide emergency contact details to the Police who would normally be responsible for the initial, direct contact with the student’s next of kin. Only after initial Police contact would the University be in contact with the next of kin. For more information, please consult the Privacy information for students and applicants below. Limitations on immigration sponsorship and Graduate Visa reporting Students can nominate a parent, relative, guardian, partner, spouse or close friend to be an emergency contact. An emergency contact is not required to be a student’s next of kin. However, a nominated emergency contact does need to be able to act on the behalf of the registered student. Students are encouraged to take the following steps. The University recognises students as individuals with the expectation of having information securely stored and that personal information is not shared inappropriately. These expectations will be respected in making any decision to use emergency contact details. Each situation will be decided on a case-by-case basis, and where possible this will be in consultation and agreement with the student concerned. However, in some circumstances (for instance if a student is unconscious, or incapable of deciding) this may prevent gaining this agreement. Under current data protection legislation, the University is permitted to share personal information about students without consent where there is a belief that this is necessary to protect a student’s immediate interest or those of another person. This usually means that a student will have been involved in, or that there is a risk of, an incident or an emergency where it is believed that a student or others may come to serious or lasting harm. The Emergency contact information provided will be held on the University student record system, in accordance with the University's policy on 'Privacy Information for Students and Applicants' and in accordance with the General Data Protection Regulation (GDPR). For more information, please consult the following: Privacy Information for Students and Applicants Some scenarios in which the University may get in touch with an emergency contact and share personal information with them are detailed below. Each case will always be considered on its unique circumstances. Examples include, but are not limited to: Student Engagement Dashboard In the case of any student under the age of 18 years old, the University is always required to contact the parent or guardian when there are concerns about the health, safety, wellbeing or welfare of a student. The University’s Registrar (or Registrar’s nominee) will make a decision about this where necessary and in line with the University approach to the health, safety, welfare and wellbeing of students. Emergency contact details will not be used for the purpose of reporting on academic progress. The following staff may contact an emergency contact where required to do so: Associate Director of Student Wellbeing (or nominee(s)), and contact will usually be made by a member of the University’s professional support services. A decision to contact a student’s emergency contact or to share concerns about a student’s safety, welfare or wellbeing will be taken by the Director of Student and Campus Life or their nominee(s). The University will inform the student of this decision, unless to do so would increase the risk of harm to the student or another person. The Director of Student and Campus Life (or nominee) will keep a confidential record of the justification for this decision, the nature of the information shared, with whom, and the time and date of the information shared. The Director of Student and Campus Life (or Head of Security for decisions made outside of regular office hours) or their nominee will contact the emergency contact personally. Once a student has consented for the University to contact an emergency contact in specific circumstances (such as those set out above), this consent will be saved within the student’s case notes. The following staff may contact an emergency contact where required to do so: Associate Director of Student Wellbeing (or nominee(s)), and contact will usually be made by a member of the University’s professional support services. In circumstances where the University decides to contact the emergency contact without student consent, due to a student being unable or unwilling to provide consent, but there is serious concern about their safety, welfare or wellbeing, then: a) The responsible University staff member will set out the rationale for doing so and the nature of the serious concern about the student’s safety, welfare or wellbeing. b) During regular office hours, a senior University manager, such as the Director of Student and Campus Life or Associate Director of Student Wellbeing (or their nominee) will then consider this rationale and make the decision on whether to contact the students nominated emergency contact. c) Outside of regular office hours this decision may be taken by the Head of Security (or nominee). The University respects student’s personal information, and contact will only be made with an emergency contact with due consideration. The rationale for the necessity to contact an emergency contact will be provided by relevant professional support services staff to the Director of Student and Campus Life (or their nominee(s)) and this may be informed by advice from the Head of Data Protection. Privacy information for students and applicants Immigration and Sponsorship of International Students Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}