{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-appointment-of-supervisors.aspx",
    "content": [
        {
            "p": "This page sets out the University's position on the appointment of supervisors, including role eligibility and requirements. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: responsibility of Head of School; requirements for admission of PGRs Heads of Schools are responsible for arranging for PGRs in their School to receive appropriate and continuous supervision during their period of registered study. A PGR should only be admitted if the Head of School is satisfied that: The Head of School should also be satisfied that the above conditions are met for all members of the supervisory team including those from outside the School. Includes: allocation; appointing joint or lead supervisors; responsibilities; availability PGRs will be allocated a supervisory team containing at least 2 co-supervisors. This should normally occur prior to the PGR commencing their studies, but failing that and in exceptional circumstances supervisors must be allocated within 4 weeks of the commencement of their studies. At least one member of the supervisory team will be currently engaged in research in the relevant discipline(s), so as to ensure that the direction and monitoring of the candidate’s progress is informed by up to date subject knowledge and research developments. The other member(s) need not necessarily have relevant discipline expertise, so long as the breadth of experience and knowledge across the supervisory team means that the candidates will always have access to someone with experience of supporting PGRs through to successful completion of their programme. One of the supervisors in a co-supervisory arrangement must be designated as the lead supervisor and act as the main point of contact between the University and the PGR. The respective roles and responsibilities of the lead and other members of the supervisory team should be agreed and the candidate advised. More information on the role of the supervisor can be found here: Responsibilities of the supervisor If one of the co-supervisors is absent from the University at any point during the period of registration, and this period of absence exceeds 6 months, an alternative supervisor should be appointed at the earliest opportunity. If it is the lead supervisor who is absent, it should be agreed which member of the supervisory team will cover their responsibilities during the absence and the candidate should be advised. In the event of short periods of supervisor absence, supervisions should continue as required with the remaining member(s) of the supervisory team. Includes: research opportunities; responsibilities of the Head of School Research opportunities may be identified separately by supervisors, a candidate or a sponsor, or following discussions between a sponsor and the supervisors or a sponsor and the candidate. The key element linking the PGR and supervisors must be interest in and appropriate knowledge of the proposed area of research. There should be mutual agreement on the specific research topic, following discussions between the parties. The Head of School should involve both the PGR and the members of staff in the preliminary discussions about supervision and should seek their agreement to initial supervision arrangements. A form is available for use by Schools to notify changes to the supervision arrangements for a PGR (see below), to be signed by the candidate, supervisors and the Head of School. Registry and Academic Affairs (or equivalent) should always be notified in writing of changes to supervision arrangements and this will act as confirmation that the PGR has agreed to the change in supervisory arrangements. For UKRI funded PGRs, this information should also be shared with the Graduate School in order that they can notify relevant Research Councils and funders. There may also be a requirement to inform a candidate’s sponsor, in the case of PGRs supported by other routes. Subject to the following sections, any member of staff currently undertaking research in the relevant discipline may be nominated to supervise a PGR, provided that they intend to remain in post for the normal duration of the candidate’s registered period of study and irrespective of whether they are on an open or fixed-term contract. Senior Research Fellows (Level 5) who have experience of successful supervision may act as the lead supervisor. Postdoctoral research staff may act as second supervisors in a co-supervision arrangement. Honorary Professors, Honorary Lecturers, recently retired staff and Emeritus Professors may act as second supervisors in a co-supervision arrangement. Postdoctoral staff and Level 4 Research Officers (or equivalent) who do not meet these criteria may act as an assistant supervisor within a supervisory team working with a lead and second supervisor. Includes: lead supervisor; attending the course for postgraduate certificate in higher education; assigning a mentor; role of Head of School Staff who are appointed as supervisors for the first time are not normally permitted initially to act as the lead supervisor, but should first be required to gain supervisory experience by acting in a co-supervision arrangement with an experienced member of staff. Exceptionally, Heads of Schools may apply to the University for permission to allow a new member of academic staff to act as the main supervisor, if a good case can be made that the member of staff's experience makes it appropriate for them to act in this capacity. Staff appointed as supervisors or assistant supervisors for the first time, must undertake relevant training and development in supervisory practice (such as that offered by the Researcher Academy, Doctoral Training Centres and Partnerships). They must be in a co-supervision arrangement with a member of staff who has relevant supervisory experience and can and is willing to act as a mentor with respect to doctoral supervision. For more information on supervisory training and development opportunities, please consult the following: Researcher Academy Supervisory Sharepoint Includes: responsibility of Head of School Staff of outside institutions who are not members of the academic or research staff of the University of Nottingham may, in appropriate circumstances, be appointed to act as co-supervisors as part of a supervisory team e.g. industrial supervisors on an Industrial Cooperative Awards in Science & Technology (CASE) award, supervisors for PGRs registered under the regulations governing students registered in outside organisations (see below). In such cases the candidate must still have 2 University of Nottingham supervisors. This rule can be waived in cases where the PGR is a member of a Doctoral Training Programme (DTP) or Doctoral Training Centre (DTC) and the other supervisor is appointed through that DTP/DTC. Heads of Schools should consider the proposed external supervisor's expertise in the candidate’s research topic and their research standing and ensure that they are made aware of and enabled to fulfil the University's expectations of supervisors and are offered opportunities to engage in development activities. Includes: academic staff at lecturer grade; permission Academic staff at Lecturer grade who do not hold a doctorate themselves should not normally be permitted to act as the lead supervisor of a PGR. However, a Head of School may apply to the University for permission to allow such a member of academic staff to act as the lead supervisor if a good case can be made that the individual's research and professional background makes it appropriate for them to act in this capacity. Includes: responsibilities The Head of School has responsibility for determining the number of PGRs an individual member of staff may supervise. No maximum number is recommended but this should depend on the ability of the individual supervisor to deliver quality supervision as detailed in this Quality Manual under The Roles and Responsibilities of a Supervisor. For more information, please consult the following: Includes: MPhil/Doctoral supervision arrangements form; research supervisors - SharePoint Research supervisors - SharePoint Students studying in outside organisations Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}