{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/regs-governing-attendance-and-engagement-unnc-unm.aspx",
    "content": [
        {
            "p": "This page contains the University's regulations in relation to student attendance and engagement. Its contents are applicable to staff and students at the China and Malaysia campuses. Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship Includes: student responsibilities; link to the Policy on circumstances affecting students ability to study and complete assessments; voluntary interruption of study; school responsibilities; withdrawal on health and safety grounds; guidance for research students 1.1 Students must organise their residential and other arrangements to facilitate attendance and engagement as required by their programme. 1.2 The University monitors the attendance of its students and where required to will report non-attendance to the appropriate authorities. 1.3 Students must attend all teaching activities necessary for the pursuit of their studies, undertake all associated assessments and attend meetings and other activities as required by their school or the University. The Policy on Circumstances Affecting Students' Ability to Study and Complete Assessments details the processes that students and schools should follow where a student’s ability to study or take assessments is in any way affected. Where students wish to interrupt their study, they should follow the University's procedure on voluntary interruption of study. Retrospective interruption of study is not permitted. For more information, please consult the following: Policy on circumstances affecting students ability to study and complete assessments Voluntary interruption of study 1.4 It is the responsibility of the school to ensure by suitable means (normally the course handbook) that students are aware of the requirements. 1.5 Schools may have formal means for recording attendance and engagement, but there is no requirement that a systematic register is taken in order to follow this procedure. 1.6 The intention of this procedure is to ensure that students are engaging appropriately with the University and to provide a framework for managing non-engagement. 1.7 In the case of all students where responsibility is shared between schools, the owning school should ensure that any partner schools are informed of issues and the partner schools should involve the owning school in any processes relating to this policy. 1.8 The University has a policy regarding students required to withdraw temporarily or permanently on grounds of health and safety and it may be appropriate to manage non-attendance through that procedure rather than through these regulations. For more information, please consult the following: Students required to withdraw on grounds of health and safety 1.9 Annual leave for research students should be in accordance with the relevant guidance and where students do not comply with this they may be managed under this policy. Responsibilities of the student (PGR) Includes: taught course students - non-engagement with one or more modules; research students - non-attendance at supervision; all students - total absence This procedure applies where a student, in the opinion of their School, is not engaging with all activities necessary for the pursuit of their studies or is not submitting required formative assessments, but is attending some activities. Where students are attending no activities, the guidelines in the All students - total absence box applies. 2.1.1 A student who knows that they will be absent from the University for any period of time should make this known to their School, Division or Department in order that appropriate discussions can take place. 2.1.2 A student whose absence is unplanned should inform their School, Division or Department immediately that they are absent in order that appropriate discussions can take place. 2.1.3 The School and student should discuss how long the likely absence will be and what effect this may have on the student’s ability to undertake their programme satisfactorily. When the absence is with good cause, the School will where possible be flexible in responding to the needs of individual students. 2.1.4 If the absence is for a period of more than two weeks or any period considered to be significant by the School and notified to students (normally in the Course Handbook), the School may require the student to suspend their studies and return at a specified time in the future that will enable the student to resume the programme appropriately. In making the decision the School should take into account all the circumstances of the individual, including health and safety aspects, and the requirements of the programme and may specify that on their return a student will be required to take alternative modules to those originally taken. 2.1.5 At any point in this process the School may seek advice and guidance from the Head of Student Services or a member of the University Health Service, including advice on personal matters that the student has given consent for them to discuss, and advice on referrals to University services. Advice is also available from the Students’ Union. 2.1.6 Where the School wishes the student to suspend and the student does not wish to voluntarily interrupt their study the recommendation to suspend should be forwarded by the School to the Head of Student Administration for consideration on behalf of the Quality and Standards Committee (QSC). If the School’s recommendation is ratified the student will be required to suspend. 2.1.7 If a student is not attending the requisite timetabled sessions and/or not undertaking the requisite formative assessments, the module convenor should inform the student's Head of School or a member of that School's staff with delegated responsibility. The School should ascertain the extent of non-engagement by contacting all relevant module convenors, and then take appropriate steps, normally including interviewing the student, to ascertain the reason for non-engagement. If the School does not receive a satisfactory explanation for absence or non-completion of work, the School should send a written warning to the student, stating the course of action (described in 2.1.8 below) that will occur if the situation does not improve sufficiently. 2.1.8 The School should ask the module convenor(s) to report on whether the warning has the desired effect. If non-engagement continues, the School may either: (a) inform the student that a mark of 0% has been awarded for all remaining assessments (including examinations) on the module(s) affected. Where this action leads to the module(s) being failed and the student subsequently being unable to progress under the relevant regulations, the School can decide that the module be reassessed the following session and specify whether the student must be in attendance, rather than arranging a reassessment for the student in August/September. or (b) follow the procedure in paragraphs 2.1.4 and 2.1.6 (above), resulting in the suspension of the student’s registration for the remainder of the session. This section of the procedure applies when the non-attendance is not covered by evidence of extenuating circumstances and where: Where the student is not engaging at all, the procedure in the All students - total absence section (below) should be followed. 2.2.1 The supervisor should inform the student's Head of School or a member of that School's staff with delegated responsibility. The School should take appropriate steps, normally including interviewing the student, to ascertain the reason for non-engagement. If the School does not receive a satisfactory explanation, the School should send a written warning to the student that the non-engagement will feature in the student's progression review and may influence the outcome of the review, possibly with the result that the student's programme will be terminated. In the case of continued inadequate engagement following a warning, the School may also consider bringing forward the progression review. If this action is taken, the expectation would be that the normal progression review cycle is also maintained, but if the extra review is held within three months of the normally expected date the School may decide not to hold another review until the following year. 2.3.1 If reports to the School indicate that a student is not attending any modules, supervision or other required activities such as practice based placements and the student provides no explanation for this non-attendance when invited to do so, the matter should be referred to the Student Service Centre (or its equivalent on University of Nottingham Malaysia (UNM) or University of Nottingham Ningbo China (UNNC)). The Student Service Centre will write to the student stating that they will be deemed to have withdrawn from the University unless a reply to the contrary is received within a specified time period. If a student is deemed to have withdrawn their registration as a student will be discontinued in accordance with the Regulations Governing Registration. For more information about these regulations, please consult the following page: Regulations governing registration 2.3.2 Where a student does provide either the School or the Student Service Centre with an explanation for their absence, the School must determine whether the explanation provides good cause for the absence. If the explanation offered does not establish good cause, the student should be dealt with under the procedure contained in 2.1.7 and 2.1.8 (in the Taught course students: non-engagement with one or more modules box) above in respect of all modules, or under 2.2.1 (in the Research students: non-attendance at supervision and other activities box) above if a research student. 2.3.3 If a student has zero attendance and the School has no knowledge at all as to the student's whereabouts the School should contact the Student Service Centre (or its equivalent on UNM or UNNC) and the emergency contact protocol will be applied. For more information about the emergency contact protocol, please consult the following: Emergency contact protocol Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}