{
    "url": "https://www.nottingham.ac.uk/qualitymanual/prog-and-mod-design-and-approval/closing-or-suspending-prog.aspx",
    "content": [
        {
            "p": "This page sets out the University's procedures for closing or suspending a programme of study. While it is primarily intended for staff across the UK, China and Malaysia campuses, it may be of interest to students. This page outlines the procedures for closing or suspending a programme of study at the University. It aims to protect the interests of students, applicants and the University by detailing the necessary steps and considerations for such actions. A School cannot independently close or suspend a programme due to the contractual obligations between students, applicants, and the University. Decisions to close or suspend a programme may be driven by several factors, including, but not limited to: Decisions to close or suspend a programme of study must be taken in good time, and wherever possible, before programmes are advertised to students (around 18-21 months before the closure or suspension is to take effect). However, strategic or other reasons may necessitate shorter notice periods. This is to ensure the University meets it obligations in relation to Consumer Protection Law (CPL) and Competition and Markets Authority (CMA) guidance. In the UK, programmes of study are advertised to prospective students in the Online UG or PGT Course Prospectus (see publication dates below). Schools and Faculty staff are responsible to seek local approval to close or suspend a programme in accordance with local procedures, including consulting with partner Schools and current students as applicable. Then it is necessary to follow the procedure below to request the closure/suspension. When a request to close or suspend a programme is submitted the RAA curriculum team will gather data on prospective and current students and make a recommendation to the relevant Faculty. If there are no applicants or impacted students, the Associate Director (Curriculum and Timetabling) or the Senior Manager (Head of Curriculum) can approve requests to close or suspend programmes (otherwise the cases go to QSC for approval). After approval, RAA will liaise with the relevant departments. If a programme closure or suspension affects prospective students, then all communications with applicants must be undertaken by External Relations and Admissions or equivalent. School and Faculty endorsement is required to close or suspend a programme. All closures and suspensions, including administrative closures, will require endorsement at School and Faculty level before making the formal request. Endorsement for the closure or suspension of a programme must be sought at School level first (e.g. from Education and Student Experience Committee, Head of School, UNNC school meeting), followed by endorsement from the Faculty (in the UK this would be from the FPVC or FAPVC, UNNC Faculty Executive Board and UNM Campus Teaching and Learning Committee). There may be local variations for seeking endorsement, depending on School, Faculty or campus structures in UNM/UNNC; however, at the end of this stage there must be clear evidence of support from both the School and the Faculty to close or suspend the programme. Endorsement can be recorded via email or noted in committee minutes; evidence of endorsement must be retained for audit purposes. For joint, major/minor, and interdisciplinary courses, agreement from the partner School(s) is required before submitting a formal closure or suspension request. Programmes offered on multiple campuses should have consensus across all campuses prior to submitting the formal request to close or suspend the programme. At the University of Nottingham Malaysia (UNM) and the University of Nottingham Ningbo Campus (UNNC), the view of the relevant campus committee must be sought prior to the submission of a formal recommendation, so that the impact of the decision on the University as a whole can be taken into consideration. If there are any HR implications in relation to the closure or suspension of a programme, Schools must contact the relevant Faculty HR Business Partner for advice. If the recommendation to close or suspend the programme only affects new entrants (and not current students), then all current students must be allowed to complete their studies, for example, including any students on leave of absence/break in studies or who have a deferred place. A comprehensive teach out plan must be provided with the request. Where the recommendation is to close or suspend the programme and current students will be affected in some way, the views of current students (including those on leave of absence/break in studies) on the proposed arrangements must be sought by the School before submitting the request. The consultation must encompass the following: Schools have autonomy over how they invite students to share their views; however, Schools must ensure all affected students are directly contacted and invited to express their views if they wish. Receiving views from students might include one of more or the following methods: The School will be expected to provide, and retain for audit purposes, evidence that all affected students have been contacted on the proposed formal notification to close or suspend a programme of study, including detail about any objections raised by students in the consultation. Discussion at Student Staff Fora alone will not be sufficient to confirm direct contact with all students. Records of the consultation(s) must be retained by the School. Once Schools have appropriate School and Faculty endorsement and have consulted with programme partners and students as required (see above), the School must complete the form to formally request the programme closure or suspension. Request to close or suspend a programme of study - MS form The form requires the School to provide information in support of the recommendation, including: Closing a programme with no current students, applicants or offer holders is referred to as an administrative closure. For UNUK programmes with no current students, applicants or offer holders may be closed outside of the aforementioned UK closure/suspension time restrictions, with appropriate School and Faculty approval. For programmes with either current students, applicants or offer holders, the following must also be undertaken: Upon receiving the closure/suspension form, RAA will consult with the wider university to ensure the implications and consequences for prospective and current students, including those on leave of absence from their studies/break in studies, have been considered and mitigated. The departments to be consulted include: Concerns raised during this consultation will be communicated back to the School for comment. Recommendations for closure or suspension of programmes where there are no applicants or offer holders, and/or where the School demonstrates that there is no impact on current students, including those on leave of absence/break in studies, or other stakeholders, will be approved by the Associate Director (Curriculum and Timetabling) or the Senior Manager (Head of Curriculum) on behalf of the Quality and Standards Committee (QSC). All other cases will be submitted to QSC for consideration. Legal advice may also be sought in certain cases. The recommendation to close or suspend the programme will only be accepted if the rationale is sufficiently strong enough to justify any legal or reputational risk or disruption to applicants, offer holders, students and/or other stakeholders. The requirements in the previous sections must also be satisfied. When a recommendation for suspension or closure is approved, RAA will inform the following departments: The departments to be informed include: Once a closure or suspension recommendation has been accepted, the School must ensure that all necessary amendments are made to School publications and websites, and RAA to all University publications and websites. After approval is obtained for the suspension or closure, then RAA will notify UCAS, if applicable, by informing the University's UCAS correspondent. If a programme closure or suspension affects prospective students, then all communications with applicants must be undertaken by External Relations and Admissions or equivalent. Applicants must not be contacted until a closure or suspension request has been approved; however, Admissions may, at the request of the School and in consultation with RAA, suspend applications until a decision has been made. Schools need to consider and agree options for offer holders (including those that have accepted offers) before they are informed. If you would like any further information about the programme of study closure or suspension process, please email: ss-curriculumadvice@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}