{
    "url": "https://www.nottingham.ac.uk/qualitymanual/contingency-classification-and-progression-regulations.aspx",
    "content": [
        {
            "p": "This page contains the University's contingency regulations. Its content applies to staff and students across all of the UK, China and Malaysia campuses. The purpose of these contingency regulations is to mitigate against risk to student classification and progression where University business has been significantly disrupted. These regulations will be utilised when authorised by Senate. The contingency UG progression regulations, and guidance on how to calculate a derived mark, are contained in the following documents: The contingency UG classification regulations, and guidance on how to calculate a derived mark, are contained in the following documents: The contingency Foundation and Qualifying Year progression regulations, and guidance on how to calculate a derived mark, are contained in the following documents: The contingency PGT progression and classification regulations, and guidance on how to calculate a derived mark, are contained in the following documents: The contingency PG Cert and PG Dip classification regulations, and guidance on how to calculate a derived mark, are contained in the following documents: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/contingency-regulations-ug-progression.pdf",
        "uk_pdf_files/contingency-regulations-how-to-calculate-a-derived-mark-ug.pdf",
        "uk_pdf_files/contingency-regulations-ug-classification.pdf",
        "uk_pdf_files/contingency-regulations-how-to-calculate-a-derived-mark-ug.pdf",
        "uk_pdf_files/contingency-regulations-foundation-and-qualifying-year-progression.pdf",
        "uk_pdf_files/contingency-regulations-how-to-calculate-a-derived-mark-ug.pdf",
        "uk_pdf_files/contingency-regulations-pgt-progression-and-classification.pdf",
        "uk_pdf_files/contingency-regulations-how-to-calculate-a-derived-mark-pgt.pdf",
        "uk_pdf_files/contingency-regulations-pgdipcert-classification.pdf",
        "uk_pdf_files/contingency-regulations-how-to-calculate-a-derived-mark-pgt.pdf"
    ]
}