{
    "url": "https://www.nottingham.ac.uk/qualitymanual/personal-tutoring-student-support-and-development/examination-arrangements-disabled-students.aspx",
    "content": [
        {
            "p": "This page provides information about examination arrangements for disabled students. Its content is directed at staff and students across all of the UK, China and Malaysia campuses. Includes: University commitment; Disability Support Services This page applies to all disabled students with a Support Plan created by the Disability Support Services As part of its commitment to disabled students, the University believes that assessment methods should, as well as being appropriate to academic objectives of the course, minimise any impact of a student’s condition on performance in assessment. This means that some students may require alternative arrangements (‘accommodations’) for examinations or other assessments. For some students these will be described in their Support Plans. Students without Disability Support Plans can also discuss accessibility with their tutors. These guidelines set out the arrangements for organising the effective assessment of disabled students. Includes: scope; University responsibilities; student responsibilities The University aligns with the Quality Assurance Agency's Quality Code for Higher Education. In particular we are attentive to the following Principle: “Provides design assessments that test learning outcomes and are fair, reliable, accessible, authentic and inclusive. Where applicable, and sustainable, students are offered different options for undertaking assessments to promote accessibility and inclusion”. At the same time, the rigour and comparability of the assessment should be protected with the effect that one academic standard is applied to all students. Wherever possible, disabled students must undertake the same assessments as others on their course. The University will ensure that policies and procedures for requesting accommodations to assessment and examinations are widely publicised and easy for students to follow and will endeavour to apply them consistently across the institution. It is the University's responsibility to give students opportunities to disclose their disability and to ensure appropriate confidentiality. Students must be aware, however, that in order for alternative arrangements to be implemented, relevant staff will need to be informed of the disclosure. The main mechanism by which disabled students receive specific accommodations is through the issuance of a Disability Support Plan It is the student's responsibility to ensure that the University is aware of their disability and to apply for any accommodations in assessment conditions within deadlines which are established for this purpose. Any request must be supported by appropriate evidence. For more information, please consult the following: Submitting your evidence (UNUK) Submitting your evidence (UNM) Submitting your evidence (UNNC) Includes: link to Student Services Examinations section Disability Support Services are responsible for recommending reasonable adjustments after consultation where appropriate with relevant University staff or bodies. These alternative arrangements, outlined in a Disability Support Plan, will be implemented by Student Services for examinations controlled centrally, or implemented by Schools where examinations are held by Schools independently or where it involves another form of assessment. Information for students who wish to request alternative arrangements is available on the Exam Adjustments section. For more information, please consult the following: Alternative Exam Arrangements (UNUK) Alternative Exam Arrangements (UNM) Alternative Exam Arrangements (UNNC) Includes: Formal examinations, coursework and other assessments Specific provision may be necessary for students with Disability Support Plans for formal examinations. Alternative arrangements can be made in discussion with Disability Support Services who liaise with the central exam team and assessment teams. Some examples of adjustments can be found in the alternative exam arrangements section, where you will also find marking guidelines for students using exam stickers. Alternative exam arrangements Students should not be required to make a disclosure on cover sheets for coursework in order to allow them the same opportunities for anonymity that are available to other students. However, where there are requests for alternative forms of assessment or for extensions to deadlines, relevant staff may have to be informed of the accommodation. The University recognises that the production of written work may present particular challenges for some disabled students and has made provision for additional specialist support for these students. Therefore, the coursework of students with a Disability Support Plan is marked following the same criteria as that applied to all students. Students with a Disability Support Plan can request that Schools clarify their marking criteria so that they are aware of any penalties imposed for inaccurate spelling or poor presentation. Extensions to deadlines are deemed ‘a reasonable adjustment’ and will be one of the recommendations made by Disability Support Services in the Disability Support Plan shared with Disability Liaison Officers (DLOs) and other relevant colleagues. However, it is the responsibility of the student to request an extension to a deadline. Students requesting a deadline extension should complete and submit the Coursework Extension Request Form (CERF) available at the link below. For more information, please consult the following: Students with Disability Support Plans - access to coursework extensions A small number of disabled students may require an alternative form of assessment for coursework and examinations on occasion. In these instances, there should be consultation between the School, the student and Disability Support Services. For more information, please consult the following: UNUK Disability support services UNM Disability Services UNNC Disability support service Disabled Students Teaching timetable arrangements for disabled students Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}