{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/thesis-pend-period.aspx",
    "content": [
        {
            "p": "This page sets out the eligibility of a thesis pending period for research degree students, as well as entitlements and extensions. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Please be aware that during academic year 2019/20, the University introduced exceptional regulations in response to the Covid-19 pandemic. These were campus specific and meant to be read in conjunction with all pre-existing content. From the beginning of academic year 2021/22, the active application of the exceptional regulations affecting this page has now ceased, with the sole exception of those which cover extenuating circumstances at the University of Nottingham Malaysia (UNM). The following will remain active at UNM until further notice in light of the current situation in Malaysia: Any outcomes from the application of the regulations during academic years 2019/20 and 2020/21 across all three campuses will, however, continue to be honoured and used in all decisions regarding those affected. Further details about those regulations which have NOT been extended into academic year 2021/22 can be found in the \"Exceptional regulations applied in response to Covid-19\" section below. Please be aware that due to the ongoing coronavirus pandemic, some of the content on this page has also been amended as part of the University's mitigation efforts. Where this applies, it will be clearly indicated within each section below. This policy only applies to students on doctoral level and Master of Philosophy degrees who are eligible for a Thesis-pending period. Students on 1 year research degrees (for example, Master of Research) do not have a Thesis-pending period. Includes: facilities; meetings with supervisors Students who have completed their research and the period of registered study as required by regulations may enter the Thesis-pending period. In this period of 12 months (for students who were registered full-time) or 24 months (for students who were registered part-time) or less, the student will be entitled to the use of library facilities and University computing facilities but not to facilities for research. The PGR and supervisors should continue to meet regularly, in line with supervisor meeting requirements. PGR Responsibilities of the supervisor For avoidance of doubt, supervisory meetings should continue throughout the Thesis-pending period to support the PGR student to reach the point of final thesis submission in a timely way and minimise any extensions to registration. Supervisors will read and comment on one draft of the candidate’s thesis prior to (each) submission. Includes: plan requirements; exceptional circumstances; MRes, MSc and MA by research degrees; student fees and finance All applications should be submitted with supporting evidence to Student Services or equivalent for consideration on behalf of Quality and Standards Committee (QSC). The aim will be to notify the PGR of the outcome of their application within 2 weeks. Other than in exceptional circumstances applications will only be considered if received by Student Services no less than 3 months in advance of the end of the thesis-pending period. All applications require the support of the principal supervisor and Head of School. All applications should include a plan detailing: Requests for extensions will only be considered as a result of circumstances affecting the thesis pending period, and not the period of registered study. Students on MRes, MSc and MA by Research degrees are not entitled to a Thesis-pending period, but nonetheless must use this procedure if they need to apply for an extension to their submission deadline. If an extension request is granted, the fee listed in the University's Fees Schedule will be payable. For more information, please consult the following: Student fees and finance Includes: circumstances that would not normally warrant an extension to Thesis-pending period The following have been agreed by the University as circumstances that would normally result in an extension being granted and those which would normally not. Examples of circumstances which would normally lead to the approval of an extension to the Thesis-pending period: Examples of circumstances which would not normally warrant an extension to the Thesis-pending period: During academic year 2019/20, the University of Nottingham also introduced exceptional regulations in relation to postgraduate research extensions (including for UKRI-funded programmes, as well as the Doctor of Philosophy (PhD) and MPhil awards). Outcomes from the application of those regulations during the 2019/20 academic year, in relation to PGR extensions, will be honoured, and used in all future decision making. However, from academic year 2020/21 onwards, the Covid-19 PGR Extensions (UKRI funded) Exceptional Regulations and Covid-19 Exceptional Regulations for PGR Students will no longer be actively applied to a student's period of study. Please be aware that the following Exceptional Regulations were developed and applied in academic year 2019/20 due to the coronavirus pandemic. These records should be read in conjunction with all other content on this page. For more information, please consult the following: For more information about the 2019/20 Exceptional Regulations as a whole, please consult the following: Exceptional Regulations: Covid-19 - 2019/20 to 2020/21 Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/covid-ec-exceptional-regulations-unm.pdf",
        "uk_pdf_files/covid-ec-exceptional-regulations-unuk.pdf",
        "uk_pdf_files/covid-ec-exceptional-regulations-unnc.pdf",
        "uk_pdf_files/covid-pgr-extensions-to-period-of-registered-study-exceptional-regulations-unuk.pdf",
        "uk_pdf_files/covid-pgr-extensions-ukri-funded-exceptional-regulations-unuk.pdf",
        "uk_pdf_files/covid-exceptional-regulations-for-pgr-students-unuk.pdf",
        "uk_pdf_files/covid-exceptional-regulations-for-pgr-students-unnc.pdf",
        "uk_pdf_files/covid-exceptional-regulations-for-pgr-students-unm.pdf"
    ]
}