{
    "url": "https://www.nottingham.ac.uk/qualitymanual/concerns-complaints-and-appeals/pol-investigation-by-independent-following-a-complaint-to-su.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on complaints made by independent persons following a previous complaint to the Students' Union. This information is relevant to staff and students who are based at the UK campus but may also be of interest to those at the international campuses as well. Any student or students who are dissatisfied in their dealings with the Students' Union, or claim to be disadvantaged by reason of their having exercised the right to withdraw from membership, shall be entitled to have their complaint considered in accordance with the Students' Union's complaints procedure which is available to all students who are eligible to be members. This procedure includes the right of appeal to a person independent of the Students' Union (appointed on behalf of University Council) at the point at which the Student has completed all of the stages of the Students’ Union Complaints Procedure. For more information about Students' Union Policy and Procedures, please consult the following: Students' Union - policies and useful links Includes: role of the Registrar; role of an independent person; communication of outcome For more information about the Registrar's department, please consult the following: Registrar's Department Includes: end of procedure; completion of procedures letter; options for further pursuit There is no further right of appeal within the University. At the end of the procedure a Completion of Procedures letter may be provided by the Registrar of the University. If the complainant remains dissatisfied they may chose to pursue their complaint through the Office of the Independent Adjudicator’s (OIA) complaint scheme. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}