{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-mvm-mvs.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Master of Veterinary Medicine / Master of Veterinary Surgery (MVM / MVS). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 1. A candidate for the Master of Veterinary Medicine or Master of Veterinary Surgery must: (a) be a graduate of this or any other approved university holding a Veterinary Bachelor’s degree (normally first or second class Honours or equivalent) (b) be a Member or Fellow of the Royal College of Veterinary Surgeons with a legal ability to practise veterinary medicine in the UK, or (c) hold other qualifications which, on the recommendation of the School, are deemed by the University to be equivalent to the qualifications referred to above. Includes: course elements; general training; clinical practice; taught modules; clinical research thesis The course comprises three elements: 1. Generic training (20 credits) 2. Clinical practice 3. Up to 40 credits of taught modules at level 4, or exceptional level 3 (0-40 credits) 4. Clinical research thesis (120 - 160 credits depending on the number of taught credits taken) A candidate for the degree of Master of Veterinary Medicine or Master of Veterinary Surgery shall be required after the period of directed study: A candidate may choose, with the agreement of the supervisor, to take up to 40 credits of taught modules. These must be selected from level 4 level modules (or, exceptionally, level 3) and must be clearly cognate with the student's research topic. In this instance the candidate will be required to take any relevant assessments associated with these modules. At the discretion of the School, when students take taught credits as part of their MRes degree, the word limit for the dissertation can be reduced. Includes: where a thesis has been resubmitted; where a second viva voce examination has occurred Candidates who fail to satisfy the Examiners in any taught modules may be re-examined on such terms as the University, on the recommendation of the School, may decide. Candidates may normally be re-examined on one occasion only. Where a thesis has been resubmitted and/or a second viva voce examination has occurred, the Examiners may recommend to the University the following outcomes of examination: Includes: outcomes of examination recommended by Examiner The Examiners may recommend to the University the following outcomes of examination: Includes: residency training; School code of practice Students will be expected to undertake residency training for membership of the relevant European College or American Boards, or to undertake the relevant RCVS Diploma. Students offered a place on the course will be required to accept the School Code of Practice by signing a Student Entry Agreement. A candidate that who to meet these standards will be required to appear before the Faculty of Medicine and Health Sciences Fitness-to-Practice Committee. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}