{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2003.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2003. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. 29 October The Minimum Age of Admissions document has been updated within the Admissions section of the Quality Manual. 28 October There has been a new document added to the Students who have a Disability section of the Quality Manual. Teaching Timetable Arrangements for Students who have a Disability. 14 October There has been a new document added to the Admissions section of the Quality Manual. Minimum English Language Entry Requirements 6 October The Careers Development section within the Quality Manual has been updated. 29 September There are two new documents which have been added to the Taught Programmes section of the Quality Manual: Submission and Approval of New Courses and Course Submission Document . Also a revised version on 'Procedures for dealing with applicants with criminal convictions' which is in the Recruitment & Admissions part of the Quality Manual has been added. 23 June Updated versions of the Dictionary and Calculator Rubrics http://www.nottingham.ac.uk/quality-manual/forms/dictionary-calculator-rubrics.doc , Instructions on the layout of exam papers http://www.nottingham.ac.uk/quality-manual/forms/exam-layout-papers.doc and the examination example paper http://www.nottingham.ac.uk/quality-manual/forms/example-paper1.doc have been put into the Quality Manual. 20 January The Degree Class Appeals procedure has been revised following the Taught Courses Committee's agreement that such appeals should come within the Academic Appeals Committee's remit, rather than being determined by the Registrar. The revision contains no changes of principle, but clarifies grounds for appeal and the procedure for obtaining \"documented evidence\" by the student from the Head of School. The scope has been formally extended to include taught postgraduate awards. A revised policy on Closing or Suspending a Taught Course has been produced. This clarifies the University procedures in order to protect the interests of students, applicants and the University. \"A Working Group of Taught Courses Committee has been looking at the University's procedures for claiming extenuating circumstances. The result has been the production of Procedure and Guidance for dealing with Extenuating Circumstances for Students on Taught Courses. There have been no changes in policy; it is an attempt rather to pull together relevant information on the procedures into one place. The one major addition is in section 4 where examples of what constitutes extenuating circumstances and appropriate documentary evidence are given. As is made clear, this list is not exhaustive and if you feel that it would be useful to add any other examples to the list, please e-mail lucy.baker@nottingham.ac.uk The Extenuating Circumstances Form and Absence from Examination Form have also been updated to make them clearer. The text has been removed from the back and instead the procedural document should be issued with the forms. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}