{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pol-long-term-conditions-affecting-study-assessment.aspx",
    "content": [
        {
            "p": "This page contains the University's policy in relation to long-term conditions or disabilities affecting students' ability to study and complete assessment. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. This policy should be read in conjunction with the Policy on circumstances affecting students’ ability to study and complete assessments. For more information, please consult the following: Policy on circumstances affecting students’ ability to study and complete assessments Includes: examples of long-term conditions or disabilities The University of Nottingham has a long-established support provision for students who describe themselves as disabled, as covered by the Equality Act 2010. The University of Nottingham is strongly committed to equality of opportunity for all students and the provision offered to disabled students begins at the application stage. All students who declare a disability at application stage are contacted by Disability Support Services before arrival at the University to ensure that, as far as possible, appropriate support is available to meet the needs of the individual. Disability Support Services consists of Specialist Study Support Tutors who work with students with Specific Learning Differences, such as dyslexia, dyspraxia, and ADHD, whilst the Disability Advisers work with students with a recognised disability and/or long-term health condition, autism spectrum disorders (ASD), and mental health difficulties and the ACCESS Centre. Disability Support Services Includes: role of Disability Liaison Officer Disability Support Services will contact applicants who have indicated that they have a disability, Specific Learning Difference, ASD, mental health difficulty, long-term health condition or other long-term circumstances in their application prior to coming to the University. Where appropriate, Disability Support Services are responsible for identifying reasonable adjustments (referred to as ‘accommodations’) in the form of, for example, alternative examination arrangements and in-class arrangements. Disability Support Services will share details of accommodations with relevant members of staff, including the Student Support and Wellbeing Officer and Disability Liaison Officer (DLO) in the student’s academic school and the central examinations office. Disability Support Services will facilitate the Disability Liaison Officers network. Each academic school has a Student Support and Wellbeing Officer and a DLO. The Disability Support Services Team will liaise with the Student Support and Wellbeing Officer, DLO and other members of the academic school to discuss the individual support needs of a student if this is required. For more information about the DLO, please consult the following: Students with disabilities Disability Support Services will provide staff and students with general advice in relation to Specific Learning Differences and other disabilities, long-term health conditions or mental health difficulties at any point during the academic year. Disability Support Services will provide advice on accommodations for examinations and in-class arrangements, such as an extension to a coursework deadline. Disability Support Services will provide a range of support services to students, including; one to one and drop-in sessions, small group work, workshops and direction to screening tools. Disability Support Services provide staff training sessions to all staff in order to increase understanding of disability, raise awareness of reasonable adjustments and inclusive practice. In addition to core responsibilities set out in the Policy on circumstances affecting students’ ability to study and complete assessments: i. Students who are aware of a disability, long-term health condition or other long-term circumstances (as outlined in the Principles section of this policy) that is expected to have an impact on their performance should make their School aware of those circumstances at the earliest possible opportunity. ii. Students should ensure that they access relevant support services that are available to them to ensure that all possible assistance is provided. For more information about the Policy, please consult the following: The following processes are in place to support students requiring accommodations: Such arrangements are intended to make full adjustment for the condition/disability so no further adjustment or consideration would be appropriate. It may be appropriate for students to consider voluntarily interrupting their studies whilst arrangements are made and appropriate support is put in place. Examination Arrangements for students who have a disability or long-term medical condition i. Students who have a Support Plan have access to possible coursework extensions, which indicates that Schools and Departments should consider requests for extensions, wherever possible, on the grounds of their circumstances and they are not expected to submit an Extenuating Circumstances claim. A Coursework Extension Request form is available on the Student Services webpages and students making the request on the basis of a Support Plan should seek approval from the designated member of School staff BEFORE the original submission date. It is the School’s responsibility to inform students who the designated member of School staff is in their School. Student Services - students with support plans ii. Where a student has submitted a Coursework Extension Request form but has not had a response to indicate whether an extension is being granted by the time of the deadline, the student should submit whatever work they have completed at the time of the deadline such that, if necessary, it can form the assessment. Having submitted the work done to date, students should continue working in order that, should an extension be granted (which would be from the original submission date), they are able to take full advantage of any extra time allowed. iii. Students seeking an extension who do not have a Support Plan indicating that Schools and Departments should consider requests for extensions should submit a claim using the Extenuating Circumstances procedure. For more information, please consult the following: Extenuating Circumstances procedure Where Disability Support Services has assessed a student as requiring adjustment to normal arrangements for assessment but it is too close to a scheduled examination for the adjustment to be put in place for a centrally arranged examination the School should follow the procedure on the Student Services – Service Development website and if possible arrange for the assessment to take place in the School. If this is not possible the student may request deferral of the relevant examination(s) such that the adjustment can be made to a centrally arranged examination. Where diagnosis of a long term health condition/disability is made after an assessment has taken place it may be appropriate to annul assessments from the current session and allow the student to take them again such that they can gain a properly representative mark or to take the circumstances into account at the Board of Examiners at the award classification stage under the relevant Study Regulations. Further backdating of any adjustment will not occur. Where diagnosis of a long term health condition/disability that requires support for study to be put in place is made during the academic year it may be appropriate to allow the student to repeat the relevant year/semester (for which a fee would be payable). Further backdating will not occur. Alternatively one of the outcomes may be applied: (a) For any student provide support for the student to compensate for the circumstances. If this is provided and is intended to make due adjustment for the circumstances, the same circumstances cannot be considered under any other University procedure. or (b) For Undergraduate Students and Postgraduate Students on taught programmes Bring the circumstances forward for consideration at the Board of Examiners which may consider annulling the affected year/semester and offering the student a repeat period of study (for which tuition fees will be payable) subject to this being an option supported by any sponsor or legal obligation and to the University’s policy on Maximum Period from Initial Registration. (c) For Postgraduate Research students One or more of the following actions should be applied: (i) Undertake a further annual review if the student fails their annual review. (ii) Support the student in applying for an additional period of registered study and to the University’s policy on Maximum Period from Initial Registration. (iii) Support the student in applying for an extension to their thesis pending period and to the University’s policy on Maximum Period from Initial Registration. For more information about the maxima, please consult the following: Maximum period from initial registration for completion of studies Where a student has not had appropriate adjustment in the current session for a late diagnosis they should submit a claim under the Extenuating Circumstances procedure as soon as the diagnosis is confirmed. Where the condition is not covered by the Equality Act 2010, extenuating circumstances claims will be considered if submitted within the timescales provided for at section 9 of the Extenuating Circumstances procedure. For more information, please consult the following: Where the student’s condition is covered by the Equality Act 2010, a School must consider claims submitted before a Board of Examiners (or equivalent for PGR students) has reached a decision on the student’s results. The University will also consider the circumstances if an Academic Appeal is submitted within one month of the notification of a progression or award decision. The Academic Appeal submitted by the student will need to demonstrate that new evidence was not, and could not have been, made available to the Board of Examiners at the time of its original decision. Any such matters which could have been raised before the meeting of the Board, but, without good reason, were not raised, will not be considered in the event of an Appeal. In making a decision on the action to be taken, Schools/Appeal handlers should consider what adjustment would have been made had the disability, long-term health condition or other long-term circumstances been known earlier in the session. If any appropriate adjustments have already been applied, no further action is necessary, otherwise actions should be backdated to cover the most recent session only. Advice on the Equality Act is available from the University’s Disability Support Services website. For more information, please consult the following: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}