{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-responsibilities-of-student.aspx",
    "content": [
        {
            "p": "This page sets out the responsibilities of a postgraduate research student, including participation in their studies and completion of training. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Postgraduate research students should participate fully and to some extent take the initiative in planning and executing their research studies and any necessary training, and will share with their supervisor the responsibilities involved in monitoring progress. Research students are expected to adhere to the following requirements: Students must familiarise themselves with University, Faculty, and School requirements and procedures for research study by reading the School Handbook, the University Guide for Students, and the Guide to Intellectual Property Management and Commercialisation. Students must follow safety codes and advice scrupulously and participate in any mandatory Health and Safety training before commencing research activities. Students are expected to participate in planning, progressing, and completing their studies, including preparing for reviews regarding confirmation of their MPhil or doctoral registration or transfer from MPhil to doctoral. They must participate as required in the process of monitoring their progress. Research students must share responsibility with their supervisor for keeping up good communications and arranging meetings with their supervisor, attend the agreed meetings and prepare for them, and take the initiative in raising problems or difficulties. Research students must participate in designing a training programme and attend the recommended courses and other School activities designed for postgraduate students. Students should also ensure that they are familiar with the content of The Code of Research Conduct and Research Ethics and obtain ethical approval if required for their research project. For more information, please consult the following (entering your university username and password when prompted): Code of research conduct and research ethics - SharePoint Research students must submit written work on time, undertake examinations, other assessments and progress reviews as required by the School and Faculty. Research students are expected to write up all or much of their theses by the end of their registered period of study. Includes: School expectations The University recognises the importance of taking holiday for the health and wellbeing of students engaged in postgraduate research. This should be taken in line with School expectations (for example not taking leave during postgraduate training courses, School research events, seminars etc.), any contractual obligations (for example Research Council terms and conditions), and by arrangement with supervisors. As a guide, postgraduate research students may normally take up to 25 days holiday in each year plus public and University holidays. Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}