{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/vol-interruption-of-study.aspx",
    "content": [
        {
            "p": "This page provides information on the process and associated implications that apply when a student wishes to interrupt their studies. This information is relevant to staff and students across all of the UK, China and Malaysia campuses. Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship When a student interrupts their study, their registration with the University will be temporarily suspended and all relevant authorities (where known) will be informed. A student whose registration is suspended because of voluntary interruption of study is not entitled to attend any teaching or take any assessments and will not pay tuition fees in accordance with the University’s fee schedule. However, they are still subject to other, relevant regulations of the University, such as the Traffic Regulations, the Regulations for Library and Computer Use and the University’s Code of Discipline for Students. The considerations to be applied by the school in making the decision to agree an interruption are: Schools may wish to consider or request supporting evidence (for example, from medical or counselling services) before agreeing to an interruption. For more information, please consult the Extenuating circumstances page. An interruption of study may begin immediately in cases where a student’s absence from the University is unavoidable or urgently required. In all other cases, the interruption of study of taught course students must begin from the end of a semester (that is, after the end of the examinations attached to that semester) so that there is a clearly identifiable point at which a return to studies will occur. The interruption of a research student’s study will usually commence at the beginning of a month. Interruptions must not be granted just before the start of examinations simply as a means of allowing students to avoid (or postpone) failure in a number of modules, as this would provide these students with an unmerited advantage. Students who are considering an interruption of study or who are advised to interrupt must be advised to consult the Visa and Immigration Team for immigration advice before submitting their interruption request to the Student Service Centre or equivalent office. The request to interrupt study form also ensures that relevant students are in receipt of immigration advice before proceeding with any change of circumstances. A student's ability to repeat modules in attendance, as detailed in the 'Return to study' section below, may be restricted by the University's limitations on immigration sponsorhip policy and this must be taken into account when considering a request for interruption. An interruption must be for a definite period. Where it would seem insensitive to designate a date of return to studies, the student may be informed that the interruption is until a proposed date but subject to review and the proposed return date will be entered into relevant systems. In this case, Registry and Academic Affairs in the UK, Student Registry at UNM or Academic Affairs Office at UNNC must be informed by the school annually whether the interruption is continuing. In some cases, it may be appropriate for the school to require a student to provide medical certification of fitness to return to study before allowing re-registration to occur. The University requires all students to complete their programme within a set period after initial registration regardless of individual circumstances. These are laid down in the guidelines on Maximum periods from initial registration. For more information, please consult the Maximum period from initial registration page linked below. A School must refuse to allow a student to interrupt their study if that would result in it being impossible for that student to complete their studies within the defined time frames or those imposed by external requirements or individual programme specifications. Where an interruption is granted, the School may require the student (on their return) to repeat modules already passed where the syllabus for that module has been updated, or to take new modules to replace outdated modules previously passed. In these cases, the marks from the repeated or new modules will replace the marks gained from the outdated modules. Where a student is on an accredited degree or a programme leading to professional registration and their normal period of study has been extended it may be necessary for them to undertake additional assessment in order to prove competency prior to conferral of their award. A student who has interrupted their study will change cohort on their return to study and the regulations applying to the cohort they have joined will be applicable, which may have implications for their progression or final award for the programme. Undergraduate and postgraduate taught students will be sent a return to study form at least one month prior to returning from an interruption of study requesting confirmation of the return to study details. For apprentices, the School will agree with the employer and apprentices the most appropriate point for return to study which would usually be expected to be up to 12 months. Funding rules prevent apprentices from undertaking repeat learning. Adjustment of the apprentice’s individual learning plan will be undertaken. In circumstances where the Voluntary Interruption of Study comes as the result of the Support to Study policy, the University reserves the right to request contemporaneous evidence that a student is able to re-engage, as required, with their studies and the University community (with or without adjustments). For more information on the Support to Study policy and procedure, please consult the pages linked below: Students must make their request to their school, and it is for the school to decide whether or not to recommend the interruption, taking into account the information in other sections. Registry and Academic Affairs in the UK, Student Registry at UNM or Academic Affairs Office at UNNC must be informed as soon as an interruption has been recommended, in order that in can be approved on behalf of Quality and Standards Committee (QSC) and will confirm the approval and terms of the interruption in writing to the student. It is the student’s responsibility to ensure that any sponsor or legal requirements are complied with when taking an interruption of study. For apprentices, the Professional and Work-based Learning team will oversee the funding and contractual process. For apprentices, an interruption may require a change in the contracted agreement with the University and employer. Requests to interrupt must be made in advance of the interruption. Retrospective interruptions of study will only be granted in exceptional circumstances (or with regard to apprenticeships please see below). Requests to interrupt must be made on the relevant form from the list below: Students who have an agreed interruption of study and wish to request an amendment to the previously agreed interruption of study are advised to consult with their personal tutor and/or course director who will be able to decide if an extended interruption of study is the appropriate course of action before completing the request an amendment to agreed interruption of study form. It is the student’s responsibility to ensure that any sponsor or legal requirements are complied with when amending the interruption of study. Students whose nationality is non-British/non-Irish will need to seek approval from the Visa and Immigration team before submitting the amendment to agreed interruption of study form. In the case of research students who have already had an interruption of a year, any further extension will only be approved in exceptional circumstances to ensure that registration on the programme of study is not protracted over a lengthy period of time. For apprentices, any interruption of studies is handled in conjunction with the Break in Learning process, as outlined in the appropriate Education and Skills Funding Agency funding rules (linked below). Schools must always remind students of the need to consult their funding body before interrupting their study, and remind them that the University is not able to guarantee the resumption of any external grant or loan. If a student interrupts their study and returns to repeat a stage or semester, the student will be charged the appropriate tuition fee for the repeat period of study. For postgraduate students in the UK with a research council or other funding award, Schools and students will need to ensure that they have prior permission in writing from their funding body before informing the Student Service Centre or appropriate office of the interruption and will be required to enclose copies of the related correspondence with the interruption form in confirmation of this. Where students hold an award under the University’s Postgraduate Studentship scheme, the appropriate forms must also be completed and sent to the Finance Department. In the UK where a student is supported through research council funding the School must ensure that the appropriate information is submitted to the relevant council and that the Finance Department is informed about any suspension of the stipend. During the period of interruption, students in the UK will not normally receive any statutory student support from the Government (for example, student loans) or any University bursary or scholarship (such as Core Bursary). Students must be advised to contact the Financial Support Team within Registry and Academic Affairs for advice on the financial implications of interrupting their studies. For more information, please consult link below. For apprentices, interruption of study (Break in Learning) will be managed and reported to the Education and Skills Funding Agency by the Professional and Work-based Learning team. Due to the nature of Break in Learning protocol, retrospective applications to schools, supported by the employer, may be necessary. Withdrawal from Study Extenuating circumstances Maximum period from initial registration Support to Study policy Support to Study procedure Education and Skills Funding Agency Funding and financial support Optional placement year Student Services UG and PGT students: Academic-Service-Office@nottingham.edu.cn PGR students: GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/voluntary-interruption-of-study-plan-form-unm-v2.pdf",
        "uk_pdf_files/Support-to-Study-Policy.pdf",
        "uk_pdf_files/support-to-study-procedure-august-2023.pdf",
        "uk_pdf_files/voluntary-interruption-of-study-plan-form-unm-v2.pdf"
    ]
}