{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/pgr-monitoring.aspx",
    "content": [
        {
            "p": "This page explains how research degree programmes are monitored, including links to important documentation and resources. This information is primarily directed at staff but may also be of interest to research students across all of the UK, China and Malaysia campuses. Includes: provision; responsibilities; purpose 1. On an annual basis, a Quantitative Data Set (QDS) will be provided to Schools in regard to their research degree programmes. The information will include: 2. For comparative purposes, Schools will also be provided with aggregate data for their Faculty and for the institution as a whole. The same data set will be available to Quality and Standards Committee (QSC) and QSC will approach any Schools where the data suggested difficulties might exist in order to discuss the remedial action to be taken. QSC will also consider the institutional totals with a view to identifying any need for changes to policy or procedures. 3. It will be left up to individual Schools to decide on a School procedure for the monitoring of research degree programmes. Typically, a School Postgraduate Students Committee or equivalent will consider the data in 1 above, along with any other relevant information (eg from a Student Staff Forum), and determine whether anything gives cause for concern. Where a problem is detected, this should then be brought to the attention of the School management through the School’s communication and decision-making channels. 4. The University Educational Enhancement and Assurance Review process will be used to check that annual monitoring of research degree programmes is taking place in Schools and that effective use is being made of the results of the monitoring. *PGR monitoring is currently on hold and will resume in 2022/23 Includes: template for research degree programmes; link to the annual monitoring workspace All Schools should use the following: For more detailed information, please consult the following: Monitoring - Workspace Monitoring Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}