{
    "url": "https://www.nottingham.ac.uk/qualitymanual/concerns-complaints-and-appeals/f1arcp-outcome4-appeal-procedure.aspx",
    "content": [
        {
            "p": "This page sets out the F1 ARCP Outcome 4 appeal procedure, including evidence and timescales. Its content is only applicable to staff and students who are based at the University of Nottingham's Medical School in the UK. Includes: Medical Act; Foundation programmes Under the Medical Act, the General Medical Council (GMC) has determined that the graduating UK university or medical school is responsible for the recommendation for full registration. This procedure is set within the provisions of the current UK Foundation Programme Reference Guide (FPRG). For more information, please consult the following: UK Foundation Programme UK Foundation Programme Reference Guide Includes: F1 ARCP outcome 4 appeal form a) Graduates of the University of Nottingham Medical School should lodge their appeal with the Postgraduate Dean, or nominated representative, by completing an appeal form and submitting it to the Postgraduate Dean within one month of notification of the Annual Review of Competence Progression (ARCP) Outcome 4 decision. The Postgraduate Dean will contact the Dean of the School of Medicine at the University of Nottingham, or their nominated Deputy, and forward a copy of the appeal form and any other documentation provided by the trainee as part of the appeal. On receipt of an appeal form, the Dean, or their nominated Deputy, will: i) Notify the Complaints and Conduct Team who will log the case. ii) Assess whether the appeal is eligible for consideration. Only claims evidencing at least one of the following circumstances will be considered: b) If the appeal appears to be eligible for consideration, the Dean of the School of Medicine, or their nominated Deputy, will arrange for an appeal hearing. The key issues of the appeal must be explained in a clear, coherent and concise manner. If the submission is unclear the trainee will be asked to resubmit the form in a manner that enables proper consideration of the appeal to take place. A timescale for resubmission will be set. The appeal must be substantiated by evidence and/or a compelling argument in support of their claims. This may comprise one, or a series of the following types of evidence: a timeline of events, reference to relevant policies and/or regulations, letters, emails, independent medical evidence, witness statements, screenshots. Any evidence or appendices relevant to the appeal must be submitted at the same time as the form and clearly referenced and labelled. It is the responsibility of the trainee to make their case. An appeal will not be accepted for consideration if: the grounds for appeal are unclear, it is unnecessarily long, it is submitted without evidence or fails to include important dates, times and other details necessary for determining the eligibility of the appeal. Requests for adjustments on the basis of a disability which will enable the trainee to access the procedure effectively, should be emailed to the Dean or their nominated Deputy. If the appeal is not substantiated by evidence or a compelling rationale to support their concerns, or if the trainee’s appeal is submitted out of time for consideration (for example more than one month after notification of the decision), the trainee will be issued with a Completion of Procedures letter. When applying for an appeal, please complete the following: A formal appeal hearing should normally take place, where practicable, within six (6) weeks of the appeal being received by the University of Nottingham. If it is not possible to comply with this timescale, the trainee will be notified in writing of the reasons for the delay and the revised timescale. More information on the grounds for appeal can be found here: Student Services – Complaints and conduct a) The Dean of the School of Medicine, or their nominated Deputy, will arrange for a case handler from the Complaints and Conduct Team to act as a point of contact for the trainee with regard to the running of the hearing. b) The Case Handler will contact the relevant Foundation School to request; (i) That a representative is appointed to make the School’s case at the hearing. The Foundation School Representative should have detailed knowledge of the case and of the reasons for the ARCP Outcome 4 decision. (ii) To provide paperwork in support of the decision made. Paperwork could include, but is not limited to; • A copy of the Outcome 4 decision communicated to the trainee • Details of the warning of a possible Outcome 4 prior to the ARCP meeting • A copy of all paperwork considered by the panel which issued the Outcome 4 decision, details of the membership of that panel and confirmation of the rationale for the Outcome 4 decision • A copy of documentation relating to the review of the decision, if applicable • Details of meetings that were held with the trainee to discuss progress and identify concerns and details of written confirmation of those concerns • Details of any reasonable adjustments in place for the trainee or mitigating actions taken to support the trainee during the course of the Foundation Programme c) The trainee will receive a written invitation to the hearing from the case handler at least 10 working days in advance of the hearing and will be asked to confirm in writing his/her intention to attend. The trainee will receive a copy of the documentation provided by the Foundation School. d) Trainees may support their appeals with further written evidence, but this must be received at least five (5) working days before the hearing meets so that the panel is able to consider it in detail. e) The trainee will be notified of the names of the panel members and should notify the case handler immediately of any conflict of interest. The final decision as to what constitutes a “conflict of interest” lies with the Dean of the School of Medicine, or their nominated Deputy. f) The panel and the trainee will all have access to the same documentary and verbal evidence. g) The appeal panel Chair should consider postponing the appeal hearing if the appropriate documentation has not been circulated to the panel and/or the trainee within the stated timescales. It may, however, be appropriate to proceed if there is agreement on the day between the appeal panel Chair and the trainee. a) Members of the appeal panel act with the full delegated authority of Senate. b) The appeal panel should include: c) A case handler will also be present to take notes. a) The trainee is entitled to bring a supporter. The supporter must be either: The supporter may take notes on the trainee’s behalf, make representations on the trainee’s behalf and ask questions, but may not answer questions on the trainee’s behalf. b) The trainee must inform the case handler of the name and status of their supporter at least five (5) working days prior to the hearing. The trainee may be asked to choose a different supporter if, for example, it is perceived that the chosen supporter may cause a conflict of interest or if their presence may prejudice the meeting. c) Requests to accept representations by way of a legal representative will be considered on a case-by-case basis. Where requests of this nature are approved, the University will normally appoint legal counsel to act on its behalf. If a trainee wishes to be represented by a lawyer, then legal representatives will be reminded that appeal hearings are not courts of law and the panel governs its own procedure, including the questioning to be allowed of others by the legal representative. a) If the trainee has indicated their, or a supporter’s, intention to attend, but is prevented from doing so for good reason and contacts the case handler before the meeting to that effect, the chair will agree to defer consideration of the case and will agree alternative arrangements for an appeal. The chair will have discretion as to what constitutes \"good reason\". b) If the trainee has indicated their intention to attend, but fails to attend without reasonable explanation, the panel will hear the case in the trainee’s absence. The chair will have discretion as to what constitutes a \"reasonable explanation\". c) If a panel member or a foundation school representative is absent from the hearing, the chair will have discretion as to whether the hearing should proceed in their absence, or should be deferred. This section defines the steps which should be followed during the appeal hearing itself: The chair has discretion to vary the practicalities of these arrangements as they think fit. a) The chair will ask if any member has been personally involved in the trainee's case at any prior stage and, if so, will ask them to withdraw for the duration of the case. b) The case handler will escort the trainee and/or supporter (if attending) and the foundation school representative, into the meeting. c) The chair will introduce by name the members of the panel and will explain the powers of the panel and the potential outcomes. d) The chair will invite the trainee to address the panel to summarise the reasons for appealing the ARCP Outcome 4 decision. e) Members of the panel will be invited to question the trainee. f) The Chair will invite the Foundation School representative to make a statement summarising the reason for the Outcome 4 decision. g) The Chair will invite questions to the Foundation School representative. h) The chair will ensure that the members of the panel have completed their questioning. i) The chair will ask the trainee if they wish to make any closing statement, and if they are satisfied that they have had a full opportunity to explain their case to the panel. j) The chair will ask everyone except the panel members and note-taker to leave the meeting and will ask them to wait pending a preliminary discussion. k) If the panel requires clarification of any aspect of the case requiring further questions to any party, they must all be invited back into the meeting for questioning to take place. They will then all leave the meeting again. The panel can either; 1. Reject the appeal, in which case this is the final internal decision on the matter; or 2. Uphold the appeal, in which case the trainee will be provided with information as to who to contact to consider next steps. a) Trainees will be notified in writing of the panel’s decision with reasons within five (5) working days (where possible) of the appeal hearing. The decision of the appeal panel is final and there is no further right of appeal. b) The Postgraduate Dean will be notified of the outcome. c) A Completion of Procedures letter will be issued to the trainee by the University of Nottingham upon request, provided that a request is made within one calendar month of the date of the appeal panel outcome letter. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}