{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/regulations-on-employment-during-studies.aspx",
    "content": [
        {
            "p": "This page contains information around students undertaking employment alongside their studies. This information may be of interest to staff and students across all of the UK, China and Malaysia campuses. Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship Whilst the University realises that students may find it necessary to work in order to support themselves, they must not arrange any employment or other activity that will cause them to be unable to attend and engage with required activities or undertake required private study. Any students who are considering part-time employment are advised to discuss their position with their tutor before committing to that course of action. Apprentices who are part time students on a programme designed to integrate with, and be supported by their contractual employment are expected to maintain supportive employment for the duration of their studies. Notwithstanding this, the University recognises the value of practical experience as part of the overall University experience and understands that students may wish to take up opportunities that will enhance their future employability. When considering any employment opportunities students must bear in mind the possible impact on their studies and only accept employment that is manageable alongside their student workload. It must be noted that examinations may take place on Saturdays during the published examination periods and that reassessment examinations (for those required to take them) are normally held during August. The University has a range of financial support packages that students may be eligible to access. For more information, see the link within 3.0 Related Regulations, Policies and Prcedures. The requirements of employment or other activities are not considered to be an acceptable extenuating circumstance. For more information about extenuating circumstances, please consult Extenuating circumstances pages directly, linked below. International students on Points Based System: Student route are not normally allowed to work for more than 20 hours per week during term-times or required periods of engagement and, if they were to do so, they would be in breach of the immigration regulations and potentially subject to cancellation of their visa. Advice for international students is available from the Visa and Immigration team within Student Services. For more information, please consult the following: VISA and Immigration Support Includes: contact details Differences may be present in the guidance and/or regulations concerning student employment during studies between the UK campus (UNUK) and University of Nottingham Ningbo China (UNNC). Student services - Financial support Visa and Immigration Support Support packages Extenuating circumstances Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}