{
    "url": "https://www.nottingham.ac.uk/qualitymanual/governance/appointment-responsibilities-external-examiners-for-taught-programmes.aspx",
    "content": [
        {
            "p": "This page sets out the appointment and role of External Examiners for taught programmes. This information is primarily directed at staff but may also be of interest to students across all of the UK, China and Malaysia campuses. For information relating to the role and appointment of examiners for research degree programmes, please consult the following: Role and appointment of examiners for research degree programmes Includes: School responsibilities; responsibilities of the University; collaboration implications 1.1 Schools are responsible for providing nominations of external examiners for their undergraduate and taught postgraduate courses on an annual basis. Council has the power to receive nominations and approve such appointments, and discharges its responsibilities in this regard through the Quality and Standards Committee (QSC). 1.2 The University’s Charter requires that all assessments for programmes and modules forming part of the programme of studies required for University Degrees, Diplomas and Certificates must involve one or more independent external examiners. The specific responsibilities of each external examiner will be clearly specified in letters of appointment. 1.3 Where the award is made by the University of Nottingham and the programme is collaborative, the appointment of examiner(s) will be the responsibility of the University of Nottingham. Appointments of examiners for joint and dual awards will be determined when the partnership agreement is negotiated. Where the external examiner is appointed to a collaborative programme, the report may be made available to the partner institution on a confidential basis. 1.4 The School has a duty to ensure that a sufficient number of external examiners is appointed to ensure adequate expertise is available to cover all the major areas of the syllabus being examined, including the requirements of professional, statutory and regulatory bodies which may also include requirements that extend beyond the confines of the syllabus. 1.5 The School has a duty to ensure there is an appropriate match between the numbers of external examiners nominated and the quantity of material being examined. 1.6 Where programmes are offered across one or more of the University’s campuses, the remit of the examiners appointed should cover all relevant campuses so that they are in a position to provide a judgment on the comparability of quality and standards of provision and performance across the campuses. 2.1 The main responsibilities of external examiners are: Includes: requirements; non-Higher Education backgrounds; the right to review appointments 4.1 External examiners can be appointed if they show appropriate evidence, which is likely to be by providing an outline career summary rather than a full curriculum vitae, of satisfying the following criteria: I. knowledge and understanding of UK sector agreed reference points for the maintenance of academic standards and assurance and enhancement of quality II. competence and experience in the fields covered by the programme of study, or parts thereof III. relevant academic and/or professional qualifications to at least the level of the qualification being externally examined, and/or extensive practitioner experience where appropriate IV. competence and experience relating to designing and operating a variety of assessment tasks appropriate to the subject and operating assessment procedures V. sufficient standing, credibility and breadth of experience within the discipline to be able to command the respect of peers and, where appropriate, professional peers VI. familiarity with the standard to be expected of students to achieve the award that is to be assessed VII. fluency in English, and where programmes are delivered and assessed in languages other than English, fluency in the relevant language(s) (unless other secure arrangements are in place to ensure that external examiners are provided with the information to make their judgements) VIII. meeting applicable criteria set by professional, statutory or regulatory bodies IX. awareness of current developments in the design and delivery of relevant curricula X. competence and experience relating to the enhancement of the student experience. 4.2 Nominees from backgrounds other than higher education, for example business, industry or the professions, may not be able to fulfil all the criteria above but would nonetheless be able to make a significant contribution as an external examiner. Consideration can be given to such nominations being approved by Quality and Standards Committee (QSC), in particular where the appointee may be part of a team or examiners, or where the School is able to confirm that appropriate training and support will be provided. 4.3 In view of the importance of external examiners’ reports in the quality assurance process, the University reserves the right to review the appointment of an external examiner who fails to fulfil the terms of contract, or if a conflict of interest arises which cannot be satisfactorily resolved. Includes: categories and circumstances; reappointment restrictions 5.1 Anyone who is included in the following categories or circumstances may not be appointed: I. a member of a governing body or committee of the appointing institution or one of its collaborative partners, or a current employee of the appointing institution or one of its collaborative partners II. anyone with a close professional, contractual or personal relationship with a member of staff or student involved with the programme of study III. anyone required to assess colleagues who are recruited as students to the programme of study IV. anyone who is, or knows they will be, in a position to influence significantly the future of students on the programme of study V. anyone who is, or has been significantly involved in current substantive collaborative research activities with a member of staff closely involved in the delivery, management or assessment of the programme(s) or modules in question within the last three years VI. former staff or students of the institution unless a period of five years has elapsed and all students taught by or with the external examiner have completed their programme(s) VII. a reciprocal arrangement involving cognate programmes at another institution VIII. the succession of an external examiner by a colleague from the examiner’s home department and institution IX. the appointment of more than one external examiner from the same department of the same institution. 5.2 No external examiner may be reappointed for the same or similar course within five years of finishing their previous appointment. Such reappointments will only be permitted in exceptional circumstances, with the approval of Quality and Standards Committee (QSC). 5.3 External examiners should normally hold no more than one other external examinership during the period of their appointment. 6.1 External Examiners can be appointed on an annual basis up to a normal maximum of four years. However, this period can be exceptionally extended by one year to ensure continuity, for example where a programme is being brought to an end. To extend an appointment, a written statement with reasons for the extension should be submitted for the approval of Quality and Standards Committee (QSC). 6.2 Every new external examiner will receive a formal letter of appointment from Registry and Academic Affairs, Quality and Student Management System Team setting out the period of office, the programme(s) and/or module(s) to be examined, specific responsibilities and the fee. External examiners will also be given the link to the University’s Code of Practice for External Examiners and a web page containing relevant information. Includes: responsibilities of the Head of School; external examiners' report availability 7.1 The Head of School is required to ensure that the name, position and institution of external examiners is provided to students in programme and module information (which may be via the publication of examiners’ reports in the Student Staff Forum or equivalent). This information will also include a statement where an external examiner has been appointed to fulfil a role on behalf of a professional body. 7.2 Schools should ensure that external examiners’ reports are made available in full to students, with the sole exception of any confidential report made directly, and separately, to the Vice-Chancellor. For this reason external examiners will be asked not to identify any individual students or staff by name in their reports. 7.3 Schools should ensure that their students are informed that it is inappropriate for them to contact external examiners direct, and that other appropriate mechanisms are available for them to raise concerns regarding their individual performance in assessments, for example the Appeals or Complaints procedures. Includes: responsibility of Registry and Academic Affairs; appointments with no previous experience; responsibilities of the Head of School 8.1 Registry and Academic Affairs ensures that all external examiners are informed about the University’s procedures and policy which may be by provision of an opportunity to attend a University induction event, and the value accorded by the institution to the feedback from external examiners as part of the University’s broader system of quality assurance and enhancement. 8.2 Where the individual appointed has no previous experience as an external examiner for any institution, the School should ensure that the appointment is, if practicable, made to a team of examiners, or that with prior agreement a more experienced external examiner will act as a mentor. The School should ensure that all external examiners newly appointed should be given the opportunity to attend an induction event, to allow them to become familiar with the University and its assessment procedures. 8.2 Heads of School are responsible for ensuring that external examiners are given the relevant material they require, such as programme specifications, marking conventions, degree classification information, information on the course structure, syllabus, module details (where appropriate), a copy of the previous external examiner’s final report and relevant University Regulations. Where appropriate, information about fitness to practice procedures should also be included. They are also responsible for ensuring that external examiners are given adequate time to carry out the role. Includes: suitability of type and content of assessments; adherence to assessment procedure; endorsing assessment outcomes; annual written report; adherence to PSRB requirements 9.1 External Examiners are responsible for assuring the University on the suitability of the type and content of assessments for the subject, the students, the level of study and the learning outcomes being tested. 9.2 External Examiners are responsible for assuring the University that the assessment procedures being followed (including marking criteria and marking schemes and the consideration of extenuating circumstances) are fair and reasonable, protect academic standards, and are in line with the University’s own regulations and procedures. 9.3 External Examiners are responsible for endorsing assessment outcomes. In doing so, they need to be assured that marking criteria have been applied rigorously and fairly and that the awards being made to students reflect the standards set by comparable UK universities. In the event of an External Examiner being unwilling to endorse the outcomes of an assessment process, the matter should be referred to the Registrar. 9.4 External Examiners are responsible for providing the University with an annual written report in compliance with the standard requirements outlined in the report form and a final summary report at the end of their appointment. 9.5 Where there are Professional, Statutory and Regulatory Bodies (PSRB) requirements outside of the normal PSRB-led processes (e.g. there is a requirement for an annual report to the PSRB from the External Examiner), External Examiners are responsible for assuring the university on adherence to Professional Statutory and Regulatory Body requirements. Includes: access to documents; information about assessment procedures; meetings with staff and students; access to examination scripts, coursework and other marked assessments; right to attend meetings; Board decisions and validity implications 10.1 External Examiners must have whatever access they deem necessary to any documents (including drafts of examination papers, coursework titles or other forms of assessment) with a view to discharging their responsibilities in 9.1 and (where applicable) 9.5 of the previous section. 10.2 External Examiners must be provided with information about assessment procedures and other procedures sufficient for discharging their responsibilities in 9.2 and (where applicable) 9.5 of the previous section. Any queries External Examiners may have about assessment procedures should be answered in a timely, accurate and comprehensive fashion. 10.3 External Examiners may request meetings with groups of staff and students from the Nottingham and international campuses (eg via video-conferencing) in order to contextualise their judgements. Any reasonable requests of this kind should be facilitated as far as is practicable. Where it is not logistically possible to meet international campus students annually, an opportunity should be given a minimum of once every three years. 10.4 External Examiners must have whatever access they deem necessary to examination scripts, completed coursework and other marked student assessments with a view to discharging their responsibilities in 9.3 and (where applicable) 9.5 of the previous section. External Examiners should not normally be involved in adjusting individual marks either prior to, or at the examination board, unless there are exceptional circumstances, for example in cases where a poor question has been included on an examination paper, to compensate for which all the marks for the whole suite of answer papers need to be raised by a certain percentage. 10.5 External Examiners have the right to attend meetings of Boards of Examiners and this will normally be necessary in order to discharge their responsibilities. Attendance can be either in person or virtually (e.g. via video-conferencing). 10.6 Decisions of the Board of Examiners are not valid unless formally endorsed by an External Examiner. If particular circumstances arise in regard to individual students that delay a decision on their assessment outcome (i.e. beyond the date of the Board of Examiners’ meeting), the External Examiner may delegate endorsement of the final decision to the Chair of the Board of Examiners. Includes: requirements; Microsoft Forms report, annual report, final summary report; submission and contact details; next steps 11.1 The External Examiner is required to provide an annual report in a digital format, and a final summary report at the end of the period of appointment via Microsoft Forms. The report form is available on request from the email address below. More information on External Examiners for taught programmes can be found on the link: External examiners for taught programmes 11.2 The External Examiner's report should be submitted through Microsoft forms to Registry and Academic Affaris, Quality and Student Management Systems Team, who will then arrange for the fee due to be paid. 11.3 Registry and Academic Affairs, Quality and Student Management Team will forward copies of the report to the Head of School (for action). Includes: report explicitly on standards, assessments and awards; may also make a written report on confidential matters 12.1 In their Report, the External Examiner is asked to report explicitly on standards, assessments and awards using the standardised report form provided and to draw attention in particular to any good practice, or areas requiring attention. If, to fulfil additional PSRB requirements as indicated in Section 9.5 (in the responsibilities of external examiners section above), additional information is required this should be submitted as supplementary material to the main report. 12.2 The External Examiner may also make a written report on confidential matters to the Vice-Chancellor. In exceptional cases, where the concern is systemic and not a one-off case of ineffective practice, and the external examiner has exhausted all published applicable internal procedures, including the submission of a confidential report to the Vice-Chancellor, the Quality Assurance Agency (QAA)’s concerns scheme or relevant professional, statutory or regulatory body, may be informed. More information on making a complaint to the QAA can be found here: QAA - how to make a complaint Includes: School responsibilities; opportunities for feedback; circulation; communication requirements; responsibilities of Quality and Standards Committee 13.1 It is the School's responsibility to ensure that the annual and final reports comply with the standard requirements outlined in the report form and are available to, and considered by the School's Student Staff Forum or equivalent, and Quality and Standards Committee (QSC). If an external examiner fails to submit an annual report within a reasonable period of time, this may constitute grounds for not re-appointing the external examiner in a subsequent year. 13.2 To assist Schools in fulfilling their responsibility, Registry and Academic Affairs, Quality and Student Management SystemsTeam will notify them annually of any outstanding reports. 13.3 The School should provide an opportunity for the external examiner(s) to give feedback arising from the performance of his/her duties, which may be either or oral or written, and for the School to provide information to the examiner(s) on how the School has addressed issues raised in any previous report(s) from the examiner(s). 13.4 Where programmes are offered at the International Campuses, Schools should ensure that a copy of the external examiner report is available to the International Campus and that there is International Campus involvement in the response submitted to the external examiner and University. 13.5 Subsequently the School will forward each report of an external examiner, together with the written report on how the School has addressed the issues raised in it, to Registry and Academic Affiars, Quality and Student Management Systems Team. 13.6 It is the duty of the School to ensure that any external professional body is informed if their requirements form the subject of an external examiner’s report. 13.7 A letter is to be sent to each external examiner by the School on the actions or otherwise which have resulted from the report. A copy of each letter should be forwarded to Registry and Academic Affairs, Quality and Student Managment Systems Team. 13.8 It is the duty of the QSC to assure itself that any comments or recommendations of an external examiner have been addressed by the School, and if it is not satisfied, to seek to resolve the matter through a dialogue with the School. Please be aware that the following Exceptional Regulations were developed and applied during academic year 2019/20 in response to the coronavirus pandemic. These records applied to all of the University's campuses and should be read in conjunction with all other content on this page. The active application of these arrangements then ceased at the beginning of academic year 2020/21 (except for exceptional cases to help with continuity purposes in academic year 2020/21 only). Any outcomes from their application during academic year 2019/20 will, however, continue to be honoured and used in all decisions regarding those affected. For more information about the Exceptional Regulations as a whole, please consult the following: Exceptional Regulations: Covid-19 - 2019/20 - 2020/21 Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/covid-external-examiner-extensions.pdf"
    ]
}