{
    "url": "https://www.nottingham.ac.uk/qualitymanual/concerns-complaints-and-appeals/unm-unnc-academic-appeals.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on academic appeals. Its content is applicable to staff and students across China and Malaysia campuses only. For the purposes of this policy an academic appeal, as defined by the Office of the Independent Adjudicator (OIA), is a \"request for a review of a decision of an academic body charged with making decisions on student progress, assessment and awards.\" Includes: campus variations For more information about the academic appeals procedure on each campus, please consult the following: Academic Appeals Procedure: University of Nottingham Malaysia Campus Academic Appeals Procedure: University of Nottingham Ningbo Campus The following applies to UNNC and UNM only, for UNUK please see the following: Student Academic Appeals Code of Practice The appeals procedure is available to students of the University of Nottingham, with the exception of students who have had their registration suspended by the University, other than at their own request under the voluntary interruption of studies procedure. For more information about voluntary interruption of studies, please consult the following: Voluntary interruption of studies Students have the right to appeal to the Academic Appeals Committee against the following final decisions of an academic body charged with making decisions on assessment, progression and awards: (a) The conditions imposed and/or the requirement to take reassessments to progress to the next stage of a taught course or phase of research study. (b) A decision to terminate a student's current programme of study. This includes students whose programme of study is terminated but who are offered a transfer to another taught course or research degree. (c) A classification decision.1 In addition to appeals against the class of honours degree awarded, this also includes appeals against the classification of postgraduate awards and of other undergraduate awards. 1 A student who did not make the University aware of serious circumstances affecting their study before a progression Examination Board made its decision and who has met the progression requirements of the course, may appeal to be allowed further assessments in affected modules to mitigate a possible effect on their future degree classification. Such an appeal would be considered if submitted within one month of the marks confirming progression being published and where the student demonstrates compelling reasons why they were unable to make the University aware of circumstances affecting their study prior to the Examination Board decision – for example, reasons associated with a disability, medically-evidenced incapacity to engage with support procedures. (d) A decision not to award the qualification for which a student is registered. This relates to decisions made at the end of a student's taught course or research degree; and includes appeals against decisions not to award any qualification or to award a lower qualification. (e) A decision of a University Fitness to Practise Committee or Practice Assessment Panel. This is relevant to students on professional courses who have been the subject of Fitness to Practise procedures. For more information, about Fitness to Practise procedures, please consult the following: Fitness to practise procedures (f) The outcome of an Extenuating Circumstances claim. For more information about extenuating circumstance procedures, please consult the following: Extenuating circumstances 5.1 It is for the student to establish the case and only claims of at least one of the following circumstances will be considered as grounds for appeal: (i) That parts of the documented assessment procedure were not applied and that this procedural irregularity, which has disadvantaged the student, was significant enough to have materially affected the decision or recommendation made, rendering it unsound. (ii) That prejudice or bias on the part of one or more of the examiners took place and can be proven or there are grounds to support a reasonable perception of prejudice or bias. (iii) That the decision making body took a decision which no reasonable person would find comprehensible. Disagreement with the decision does not make it manifestly unreasonable. To apply this ground the student must provide substantive argumentation as to why no reasonable person could have arrived at the decision that was made. (iv) The student’s performance was materially affected by circumstances and there is new evidence of these circumstances which was not, and could not have been, made available to the Board of Examiners at the time of its original decision. 5.2 The following circumstances will not be considered grounds for appeal: (a) Perceived shortcomings in tuition, supervision or support. Concerns relating to the quality of teaching or supervision, or other circumstances that relate to the delivery of a programme of study should be raised under the Policy on student complaints before the point of assessment or the submission of a thesis or dissertation. Cases where complaints are upheld and there has been a clear impact on an academic outcome may lead to an academic conclusion e.g. allowing a student a further attempt at an assessment. For more information about the Policy on student complaints, please consult the following: Policy on student complaints (b) Matters of academic judgement of a School Board of Examiners or individual. The student will not be permitted to argue the academic merits of their work. The student's assertion that the result unfairly reflects the merit of their work or their ability is not a ground of appeal. (c) Disagreement with the actual mark awarded for a piece of assessed work except where grounds can be established above. If a student wished to have clarification about a mark received for an individual assessment or module they are advised to contact their School or module convener directly. Errors in calculating or recording marks on the basis of which the original decision was made cannot be submitted as grounds for appeal, unless these errors have been brought to the School's attention but not accepted by the School. (d) Appeals against provisional marks. (e) Any matters relating to circumstances affecting study which could have been raised before the meeting of the Board of Examiners. Includes: timescales; treatment of the appeal; advice from the Students' Union The decisions made will be reasonable and, where required, provide appropriate redress. It is important that appeals are monitored in order to improve the student experience. The Complaints and Conduct Team will record and provide reports to indicate the nature of appeals and outcomes. Such reports will: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/Academic-Appeals-Procedure-UNMC-effective-from-26-Sep-2016.pdf",
        "uk_pdf_files/unacceptable-behaviour-policy.pdf"
    ]
}