{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/assessment-overview-and-school-responsibilities.aspx",
    "content": [
        {
            "p": "This page contains essential information around assessments, including an outline of School responsibilities. Its content is primarily directed at staff but may also be of interest to students across all of the UK, China and Malaysia campuses. Includes: compliance with section on Assessment in the UK Quality Code for Higher Education The University is committed to ensuring that methods of assessment are effective in enabling every student to demonstrate the extent to which they have achieved the intended learning outcomes for the credit or qualification being sought in an equitable, valid and reliable way. The University meets that commitment through its policies and procedures. These guidelines have been written to signpost the relevant policies and procedures and were written using the Advice and Guidance sections for Assessment in the UK Quality Code for Higher Education. For more information about Assessment, please consult the following on the Quality Assurance Agency (QAA) website: UK Quality Code, Advice and Guidance: Assessment Includes: established principles; exceptions Includes: in-house exams, assessment guidelines, marking by number, recognition of other learning The School is responsible for the following: * Guidance for students is also available in the Quality Manual's student engagement category; general guidance for examinations is available for sitting University examinations' and about the legibility of work submitted for assessment. For more information, please consult the Related links for students section. Recognition of Other Learning For more information about this system, please consult the following: Marking by number Student engagement and representation Guidance for students sitting University examinations Policy on the legibility of work submitted for assessment Policy on marking and grading Degree classification External examiners Information about the provision of Higher Education Responsibilities of the School Examinations Officer Policy on Occasional Teachers Policy on students who teach Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}