{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2014.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2014. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. As a result of revisions to the QAA Quality Code there has been a change in terminology and some other amendments to the policy associated with awarding credit to students for studies elsewhere, either prior to or during study. Previously known as ‘Accreditation of Prior (Experiential) Learning’ the policy is now titled ‘Recognition of Other Learning’ or ROL. It encompasses policies on: I. Credit Transfer At Entry (CTAE). Here the admitting School determines the status of that award (including considerations of volume and level) as it relates to the programme the applicant wishes to study. II. Credit Transfer Post Entry (CTPE). Where credit transfer takes place during a students’ period of registered study as a result of mid registration study with another University. The term Recognition of Other Learning (ROL) is the over-arching term for Certified (RPCL), Experiential (RPEL) and Credit Transfer (CTAE and CTPE). Other updates to the policy include statements that: Further guidance will be issued shortly to Schools from the Admissions Office. Policies relating to Assessment: The assessment section of the Quality Manual has been revised to provide greater clarity and guidance for Schools on their responsibilities in this area. For the most part this has resulted in additional statements which cover practices already in place in Schools, such as the expectation that: The section on moderation in policy on ‘Marking and Grading’ has had a small amendment emphasising the importance of markers keeping their own notes indicating the rationale for the awarding of marks, especially where the assessment will not involve the production of physical evidence such as presentations or performance. Other policies to receive updates include Assessment Regulations, Assessment Overview, Module Specification Guidance and Information about Provision of Higher Education. Schools are advised to review their understanding of these policies as well as those listed above. Policies relating to programme and module approval and review: Changes have been made to the policies associated with the design, development and approval of new programmes to be offered at the University. Any School currently developing plans for new programmes should refer to the Quality Manual for the most up to date guidance, policy and templates. In particular please note that: Policies to receive updates include: Programme design, development and approval (previously ‘Submission and Approval of New Programmes’), External Advice on Programme Approval (previously ‘External Advice on Course Approval’), Business Case for a New Programme, Programme Specification Regulations and Guidance, New Module Approval, Module Specification Guidance, Policy for the Approval of Changes to Programme Specifications and the Policy for the Approval of Changes to Module Specifications. Schools are advised to review their understanding of these policies as well as those listed above. The Policy for the Provision of Careers Information and Guidance has undergone minor revisions and now has a downloadable 'Statement of Entitlements for students, alumni and staff' attachment available. A change has been made to the policy on Feedback to Students to remove the reference to Bank Holidays and other days of closure within the time limit for giving of feedback to students within 21 days of the published submission deadline. The policy now reads: \"In normal circumstances, marked coursework and associated feedback should be returned to students within 21 days of the published submission deadline, i.e. students submitting work before the published deadline should not have an expectation that early submission will result in earlier return of work. This time limit includes weekends.\" The Quality Manual policy on the Minimum Age Requirement for entrants to the University's courses has been amended to reflect that international students under the age of 16 cannot be admitted as the University is not able to sponsor them for their Tier 4 visa. A new appendix has been added to the Regulations for the Degree of Doctor of Philosophy (PhD) and Master of Philosophy (MPhil) to allow for alternative submission types where the thesis might include such things as Musical Composition, Creative Writing or Translation Studies. The regulations for submission by Musical Composition have been moved into this appendix (from Regulations 22 and 23) and the numbering of the subsequent regulations has been updated. Changes have been made to the regulations for the Degree of Doctor of Forensic Psychology (DForenPsy) to reflect that the first year of study will no longer be delivered as a Taught Masters but will instead be an MSc (by Research) in Criminological Psychology. These changes take effect from the start of the 2014/15 Session. A clarification has been made to the Appointment of Supervisor entry to state that a 'Change of Supervisor' form is available for notifying Academic Services or equivalent offices of any changes to supervision arrangements. If schools do not use this form, such changes should always be notified in writing and will act as confirmation that the student has agreed to the change in supervisory arrangements. The Quality Manual has undergone a restructure and the table below should assist users with finding content. If you are not able to find what you are looking for, please email Quality-Manual-Enquiries@nottingham.ac.uk Quality Assurance Structures China and Malaysia Programme Design and Approval Programme Monitoring and Review Registration, Attendance and Study Taught Module Enrolment & Registering for Additional Credits Changes of Taught Course Regulations Governing Attendance and Engagement Voluntary Interruption of Study FMHS Fitness to Practise Committee Procedures Practice Assessment Panel Procedures Students required to withdraw on grounds of Health & Safety Regulations Governing Registration Maximum Period from Initial Registration Guidance on Non-Registered Statuses Guidance on Student Employment During Study Scheduled Teaching and Learning Activities for Full-Time Undergraduates Policy on Occasional Teachers Accreditation of Prior Learning E-Learning and Distance Learning Policy Managing Higher Education Provision with Others (collaborative provision and placement learning) Assessment External Examining Academic Appeals Academic Misconduct Regulations for Undergraduate Courses Application of Regulations for students who fail to meet Honours Requirements Regulations for Taught Masters Degrees, PGDiplomas and PGCertificates Career Development Students with Disabilities Student Support and Development (Personal Tutoring) Student Engagement Complaints Research Degree Programmes Regulations for Research Degrees Policy on Students who Teach The entry on Role and Appointment of Examiners has been amended as a result of a decision by Quality and Standards Committee to allow recently retired academic staff to act as External Examiners for research degrees. Emeritus Professors and academic staff who have been retired for more than three years will only be permitted to act as External Examiners if they can demonstrate that they continue to be research active (10.2). The Extenuating Circumstances Policy and Procedure has been updated to clarify that students should not submit new evidence as part of the review procedure (paragraph 1.13) but should submit this to their school, together with an explanation as to why this could not be submitted at the time of making the original claim, and it will then be considered by the school in line with the time limits on submission of claims set out in the Policy. Regulations in Malaysia which previously required Malaysian nationals to undertake Bahasa Malaysia, Malaysian Studies and Religious Studies modules in addition to their degree have been extended. These will now apply to all nationalities of students who are registered for and graduating with a degree programme from our Malaysia campus. The study regulation relating specifically to the Malaysia campus found at http://www.nottingham.ac.uk/academicservices/qualitymanual/studyregulations/studyregulationschinaandmalaysia.aspx has been amended to cover this amendment. The entry on Feedback to Students has been amended to clarify that the 21 day feedback period includes weekends, Bank Holidays and other days of University closure if such days fall within the 21-day period. The section covering the University of Nottingham's admissions policies has been re-named \"Recruitment, Selection and Admissions\" in line with the title of the recently published Chapter B2 of the QAA Quality Code to reflect the intention to cover recruitment activities within the remit of the Chapter. Minor amendments have also been made to the entry on Admissions Procedures. Documents containing updated guidance and Frequently Asked Questions have been added to the Regulations for the Integrated PhD (see foot of page). The Extenuating Circumstances Form has been amended to add tick boxes to indicate whether a student has an Academic Referral or Disability Referral form (towards the bottom of page one). The entry on Appointment and Responsibilities of External Examiners has been updated (sections 9 on Responsibilities and section 10 on Powers of External Examiners). The entry on Minimum English Language Entry Requirements has been amended to remove references to TOEFL iBT to reflect the fact that the Home Office has recently removed this from the list of secure English Language tests. An amendment to the Student Engagement entry has been made at 7.4 to clarify that selection of student representatives is undertaken by the students they represent. The information relating to appeals and complaints for applicants has been amended to allow for the possibility of a Level 2 complaint for applicants within the University's Complaints Procedure, in order to bring the handling of complaints about the processing of applications into line with the procedure for student complaints. The Extenuating Circumstances Policy and Procedures have been amended to take account of guidance from the Office of the Independent Adjudicator to make it an explicit requirement that where a condition is covered by the Equality Act 2010, claims should be considered up to one month after the notification of a progression or award decision (with full evidence possibly taking longer). In addition, Hall Wardens have been added to the list of people in certain positions from whom schools might accept supporting evidence and 2.11.3 has been amended to limit the ability of students to take first sits should they specifically request these to instances where the affected assessment is worth at least 5 credits. The ECs Form and template letters available for use of schools have also been updated. The entry on Voluntary Interruption of Study has been amended to include clarification that a student who has interrupted their study will change cohort on their return to study and the regulations applying to the cohort they have joined will be applicable, which may have implications for their progression or final award on the programme. A new entry entitled Managing Higher Education Provision with Others replaces the former entries containing the University's policies on Collaborative Provision and Placement Learning. A checklist is also available for the use of staff seeking approval for new Memoranda of Agreement from Quality and Standards Committee. Programme and module specification guidance/regulations have been updated to include the following: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}