{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/admissions-procedures.aspx",
    "content": [
        {
            "p": "This page sets out the different admission procedures for all taught and research degrees. Its content is primarily aimed at prospective students based within the UK but may also be of interest to staff across all of the University's campuses. Includes: University admissions policy; factors in the selection process; key information All Schools will admit students in line with the University’s admissions policy. Entry criteria are set by individual Schools and should be transparent and justifiable. Consideration will be given as to whether applicants will be able to fulfil the objectives of the programme of study and achieve the standards required. A range of factors additional to (and in some cases instead of) formal examination results is considered as part of the selection process. These factors can include: Since entry is competitive, achieving examination grades equivalent to or above the standard offer for a course does not automatically entitle a candidate to an offer. Applications will not be considered from candidates who have previously registered for and been unsuccessful on the same course at the University of Nottingham for which the application is being made. Includes: Undergraduate; Postgraduate; handling and assessment Procedures for handling applications may vary from subject to subject. Most offers are based purely on the information provided on the appropriate application form or at interview, and may be conditional on obtaining a certain standard in specified subjects in examinations. In addition, Schools may, at their discretion, ask applicants to attend for interviews, undertake supplementary assessments or provide examples of work. In such cases, the School should clearly explain how and why this will be used in assessing the candidate and treat all candidates on an equal and fair basis. For more information about taught course application criteria, please consult the following: Criteria for assessing applicants Includes: opportunities to meet potential supervisors; School responsibilities Where practical, applicants should be offered the opportunity to meet potential supervisors to discuss research plans of mutual interest. Interviews may also be used in selection procedures. A School must ensure that appropriate supervision and facilities will be available to support the proposed research project. Prior to admission, all applicants should be provided with relevant information by the admitting School on research opportunities and facilities in their areas of interest and expertise – including information on start dates and training, together with all other relevant information. Undergraduate study Postgraduate study Admissions Office Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}