{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-dhsci.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Health Science (DHSci). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 1. A candidate for the Doctor of Health Science must: (a) be a graduate of this or any other approved university holding either a bachelor's degree with first or upper second class honours (or equivalent); (b) or such other qualifications as may be deemed by the University to be the equivalent of any qualifications referred to in (a) above. Candidates will normally be expected to have a minimum of two years' relevant post-registration practical experience. 3. The taught component requires the successful completion of 120 credits of modules normally during the first 3 semesters (18 months) of the course and first 6 semesters (3 years) of the course for part-time candidates. 100 credits are from 5 taught modules and 20 credits from generic research training. The modules to be taken are notified to students in the School's programme handbook. 4. The University's Regulations for Taught Master's Degrees, Postgraduate Diploma and Postgraduate Certificate courses shall apply with regard to satisfactory progression on the taught element of the degree. For more information, please consult the following: Postgraduate Taught study regulations Includes: candidates who do not undertake or fail research portfolio 6. The degree of DHSci will be conferred on candidates who have successfully completed the taught component of the programme and have satisfied the Examiners as to the standard of the thesis. 7. Candidates who either do not undertake or fail the research portfolio but successfully complete part or the whole of the taught programme may be considered for the following awards: Postgraduate Certificate in Health Science (60 credits) or Postgraduate Diploma in Health Science (120 credits). The qualification of Master of Science in Health Science may be awarded to a candidate who registers for the DHSci, but who does not complete the course, provided that the candidate has passed 180 credits of modules and satisfies the University's Regulations for Taught Master's Degrees as above in regulation 4 (of the Taught component section). Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}