{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-edd-school-improvement-cpd-teachered-litored-leadership.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Education (EdD) in School Improvement and Continuing Professional Development or Teacher Education or Literacy of Educational Leadership. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 1. A candidate for the degree must: (a) Be a graduate of this or any other approved university normally holding a Bachelor's degree (normally first or second class Honours or equivalent) and normally holding an appropriate Masters degree from this or any other approved university, or (b) Hold such other qualifications as may, on the recommendation of the School, be deemed by Senate to be equivalent to the qualifications referred to in (a). Candidates will normally be expected to have a minimum of two years' relevant professional experience. Includes: candidates who fail to satisfy examiners; candidates who successfully complete taught programme but not the thesis 3 The taught component requires the completion of 120 credits as directed by the School of Education, normally during the first year of the course for full-time students or the first two years of the course for part-time students. 4 The assessment for each module shall consist of a formal assignment of 5,000- 6,000 words or equivalent. Work is assessed as either pass or fail using established School criteria for work at this level. Candidates are required to achieve a pass mark in the assessment for each module. There is no compensation offered for failed work. 5 Candidates who fail to satisfy the Examiners in any of the above courses may be re-examined on such terms as decided by the Senate, on the recommendations of the School Exams Board. Candidates may normally be reexamined on one occasion only. 6 Candidates who complete successfully the taught programme but do not successfully complete the Thesis may be awarded a Postgraduate Diploma in School Improvement and Continuing Professional Development or a Postgraduate Diploma in Teacher Education or a Postgraduate Diploma in Literacy or a Postgraduate Diploma in Educational Leadership. Includes: candidate proceeding under this regulation 10 A candidate for the degree of EdD whose thesis fails to satisfy the Examiners may, by permission of Senate on the recommendation of the Examiners be allowed to: (a) make minor corrections to the thesis to the satisfaction of the internal (academic) Examiner; or (b) re-present the same thesis and attend a second viva voce examination; or (c) re-present the thesis in a revised form and attend a second viva voce examination. or (d) re-present the thesis without attending a second viva voce examination. A candidate proceeding under this regulation shall normally be required to pursue a further course of directed study for a specified period which will not normally exceed one calendar year. Candidates who re-present their thesis and again fail to satisfy the examiners may be awarded a Master of Philosophy as set out in (6) above. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}