{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/reg-retention-of-assessed-work.aspx",
    "content": [
        {
            "p": "This page contains the University's regulations on the retention of students assessed work. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses and covers both students assessed work and materials that support the assessment process e.g. assessment briefings, marks schemes, etc. These regulations relate to all assessment types both online and paper based. Where assessment results in a physical artifact, Schools are not required to retain the physical object but must consider retaining photographic or video evidence of the students work. Schools should maintain and use sample marked scripts in all subject areas to ensure maintenance of academic standards. The University must retain appropriate evidence of students assessed work together with appropriate supporting materials i.e. assessment briefs, examination question papers, marking criteria, mark schemes, model answers, submission deadlines, etc for a specified period in order to meet academic, statutory and regulatory requirement and legal obligations. The regulations and procedures for the retention and disposal of assessment material form part of a wider Document Retention Schedule, which is prepared in accordance with the University’s Record Management Policy. Schools in liaison with Learning Technologies should retain appropriate records of students accessed work together with contextual documentation that inform the assessment process. The documents retained must allow for judgments on rigour of assessment to be made to draw reliable conclusions about the entirely of the provision in relation to the University’s compliance with the Office for Students conditions of registration B4 and B5. Retained documentation will also be used to support the External Examiner process and where appropriate provide information to support the complaint and appeal process. Appropriate records should be retained for the periods as set out in the University’s records retention schedule and must facilitate judgement about the effective assessment and credibility of the awards conferred by the University. All assessed work that is retained in accordance with the University’s records management policy. Records Management (internal only) The disposal of student work must only be done on the authority of the relevant Department, and in compliance with the University’s Data Retention policy. Where submitted work is coursework and this has been returned to the student for the purposes of providing feedback, Schools should ensure that either a copy has been retained within the School or that on request work can be returned to the School at a later date. Any work retained should be kept until at least the end of the academic session following the session in which the assessment occurred. Where assessments are submitted electronically Schools may wish to consult the Learning Technologies team to ascertain whether the chosen submission method fulfils the assessment and administrative requirements. Past marks should be used to analyse trends in results in order to evaluate the maintenance and development of academic standards. If your School uses Campus for marks processing, comparative statistics can be produced from this system. Please contact Student Services (Assessment Team) for further details. For more information about the Student Service team or the Learning technologies team, please consult the following: Services for Students homepage Libraries - Learning Technologies Educational Excellence - Learning Technologies Section Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}