{
    "url": "https://www.nottingham.ac.uk/qualitymanual/concerns-complaints-and-appeals/deg-class-appeals.aspx",
    "content": [
        {
            "p": "This page provides guidance for graduating students who are appealing against their degree classification. Its contents are primarily directed at graduating students but may also be of interest to staff across all of the UK, China and Malaysia campuses. Includes: period between publication of results and graduation ceremony; options; request to defer; contact details The period between the publication of the results and the graduation ceremonies is very limited, and it is often not possible for an appeal to be resolved in time for any change to a classification to be made in time for the ceremony in the case of a successful appeal. A student may therefore opt to either: 1. Graduate at the ceremony immediately following the publication of their results with the classification as published on the Pass List. If the classification is subsequently changed on appeal a revised certificate will be issued and the office record amended; or 2. Defer graduation to the following set of ceremonies (that is, December instead of July, or July instead of December) by which time the appeal will normally be resolved. If the appeal is successful and the examiners change the classification, then it will be conferred with the revised classification and the University's records amended accordingly. For students wishing to take option 2 (deferral) a request to defer must be made to the Graduation team (please put 'Request to defer graduation' in the subject line) or equivalent in writing no less than 15 working days before the relevant graduation ceremony to allow the ceremony proceedings to be altered. If deferral is not requested in this way or is requested after this deadline, option 1 will be actioned. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}