{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-dpp.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Public Policy (DPP). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: applicants whose native language is not English 1. A candidate for the Degree of Doctor of Public Policy (DPP) must: (a) Be a graduate of this or any other approved university holding a Bachelor’s degree (normally first or second class Honours or equivalent) and normally holding an appropriate Masters degree from this or any other approved university or (b) Hold such other qualifications as may, on the recommendation of the School, be deemed by Senate to be equivalent to the qualifications referred to in (a). 2. Candidates will normally be expected to have a minimum of two years’ relevant practical experience. 3. Applicants whose native language is not English, with the exception of those with special permission of the University based on written evidence, must as a minimum fulfill one of the following conditions: (a) British Council IELTS average final score of 6.5, with a minimum of 6.0 in any element, achieved no more than 2 years prior to admission (b) A TOEFL paper-based score of 573 or computer based score of 230, including in either case a minimum score of 4.5 in the test of Written English, or a iBT score of 88 or more with no less than 19 in any element, achieved no more than 2 years prior to admission. Includes: taught component; progression; thesis component A candidate for the Degree of Doctor of Public Policy must have pursued in this University a full- or part-time course of study comprising a taught component and one or more major research projects. The minimum period of registration for this programme will be two years full-time supervised study or four years’ part-time study. Candidates will also be entitled to a thesis pending period on completion of their period of registered study (one year for full-time students, two years for part-time students). The taught component requires the completion of 120 credits normally completed during the first year of the course (or two years if part-time). The taught component requires satisfactory completion of the following courses as part of a training programme in the theory of public policy and in research design and methods: All modules are at level 4. The assessment for each module shall consist of a formal assignment of 5,000-8,000 words or equivalent. Candidates are required to achieve a pass mark (50 per cent) in the assessment for each module. There is no compensation offered for failed work. The topic for the Proposal for Research in Public Policy or Management will be selected in consultation with supervisors and should reflect the student’s proposed research topic or interrelated topics for their thesis. The proposal includes a literature review. Candidates who fail to satisfy the Examiners in any of the above courses may be re-examined on such terms as the Senate, on the recommendation of the University, may decide. Candidates may normally be re-examined on one occasion only. Admission to the research element of the course is normally dependent upon successful completion of the taught component. Candidates who complete successfully the taught programme but who do not successfully complete the thesis may be awarded a Postgraduate Certificate, Diploma, or Masters in Public Policy. The taught component uses new modules based on existing modules for Masters in Arts Public Policy, but taught as a three day block. Candidates are required to submit a thesis of a minimum of 60,000 words and a maximum of 80,000 words on an approved topic or up to three interrelated topics. Where the thesis covers more than one topic, the minimum number of words for each topic is 20,000. The thesis should offer an original application of knowledge in the area of public policy and should demonstrate the candidate’s ability to integrate rigorous academic analysis with practical relevance and application. The thesis should be the result of the student’s independent and original research done mainly while the candidate is registered for the degree. The candidate shall submit a certificate to this effect, countersigned by the candidate’s supervisor, when presenting the thesis. The submission should also be accompanied by evidence that the taught programme has been satisfactorily completed. Includes: failure The degree of Doctor of Public Policy (DPP) will be conferred on candidates who have completed the taught programme, submitted a thesis in a form and of a standard as outlined above. Candidates are required to present themselves for a viva voce examination to be conducted by one internal (academic) Examiner who is not one of the candidate’s supervisors, one external (academic) Examiner plus any further examiner as deemed appropriate for the particular qualification. A candidate for the degree of Doctor of Public Policy whose thesis fails to satisfy the Examiners may, by permission of Senate on the recommendation of the Examiners and the University, be allowed to: (a) Make minor corrections to the thesis to the satisfaction of the internal (academic) Examiner; or (b) To represent the same thesis and attend a second viva voce examination; or (c) To represent the thesis in a revised form and take the whole examination; or (d) To represent the thesis without taking the whole examination. A candidate proceeding under this regulation shall normally be required to pursue a further course of directed study for a specified period that will not normally exceed one calendar year. Candidates who re-present their thesis again and fail to satisfy the Examiners may be awarded a Postgraduate Diploma or a Masters in Public Policy without further periods of study. The qualification of Postgraduate Diploma in Public Policy may be awarded to a candidate who registers for the DPP, but who wishes to withdraw early from the programme, provided that the candidate has passed modules amounting to 120 credits and has achieved an overall average in those modules of 40 per cent. The qualification of Master of Public Policy may be awarded to a candidate who registers for the DPP, but who wishes to withdraw early from the programme, provided that the candidate has passed modules amounting to 120 credits (including AP(E)L) and has achieved an overall average in those modules which achieve a mark of 50 per cent and submits a thesis equivalent to 60 credits (15,000 words). Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}