{
    "url": "https://www.nottingham.ac.uk/qualitymanual/prog-and-mod-design-and-approval/info-about-the-provision-of-he.aspx",
    "content": [
        {
            "p": "This page sets out the information that must be provided to current and prospective students by Schools. Its contents are primarily directed at staff but may also be of interest to students across all of the UK, China and Malaysia campuses, as well as to prospective students. These guidelines have been drafted to comply with the requirements of Principle 7 of the UK Quality Code for Higher Education ‘Designing, developing, approving and modifying programmes’ and the expectation that higher education providers produce information for their intended audiences about the learning opportunities they offer that is fit for purpose, accessible and trustworthy. These contents are relevant to staff, and may also be of interest to current or prospective students, across all of the UK, China and Malaysia campuses. The University undertakes to provide appropriate and sufficient information to prospective students to enable them to select their programme of study, and to know what will be expected of them when they register to study at the University. This information is available through a variety of routes, including open days, virtual open days or offer holder events, the prospectus, the University’s web pages, videos and social media channels. Guidance and advice is available from staff in schools, the Admissions Office and staff in the Student Recruitment Team’s Enquiry Centre to assist prospective students through the applications process. In addition, information is available about the University’s teaching and learning facilities, student life at Nottingham, support services, opportunities for exchanges and study abroad, as well as information about employability of graduates as part of the requirement to provide course information through the Key Information Set. The University has agreed that there must be a minimum level of information which must be provided for undergraduate and postgraduate students about their chosen programme of study. Additionally, students must know at the start of their course an overview of how their courses will be taught and assessed. The following comprises information which School and teaching groups must supply and some suggestions for layout and style. The information which is supplied to students about their course must be accurate. It is reasonable for the more detailed information to follow after the start of the academic year, particually if students know when that information will be provided. Information must be supplied about the following: Each School or department should have an appropriate mechanism in place for recording that a student has read and understood the guidelines on plagiarism, and that their work falls within those guidelines. Students are entitled to receive a full record of their academic achievements when they leave their programme of study. Degrees and diplomas are conferred at a degree ceremony. If a graduand is unable to attend the ceremony the degree will be conferred in absentia and certificates will be sent six to eight weeks after the ceremonies have finished. Students graduating from 2006 onwards will also receive a diploma supplement at the same time as they receive their degree certificate. Throughout the period of study, students are able to request transcripts of their marks and to see information about their programmes, including modules and marks, by way of the MyNottingham app. For more information about the UK Quality Code for Higher Education and the qualification types and structures in use at the University of Nottingham, please consult the folowing: UK Quality Code for Higher Education Qualification types and structures For more information about the diploma supplement, please consult the following Student Services page. Student Services - Diploma Supplement page Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}