{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-regs-doc-agrifood.aspx",
    "content": [
        {
            "p": "This page contains the regulations for the Doctor of Agrifood, including admission requirements, progression and examination information. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. The regulations for the DAgrifood are those which govern the PhD except where the following modify or supplement them. Includes: minimum relevant experience 1. A candidate for the Doctor of Agrifood must: (a) be a graduate of this or any other approved university holding either a bachelor's degree with first or upper second class honours (or equivalent) in agriculture, food or other relevant biological sciences area; or (b) such other qualifications as may be deemed by the University to be the equivalent of any qualifications referred to in (a) above. Candidates will normally be expected to have a minimum of one years' relevant post-graduate experience in the Agrifood industry. 2. A candidate for the degree of DAgrifood must have pursued at this University a full or part-time course of study comprising a taught component and a portfolio of integrated research projects with a common theme carried out in industry and supervised by academic staff of this University. Completion of the DAgrifood programme requires a minimum of two and a maximum of four years of full-time supervised study, and a minimum of four and a maximum of eight years of part-time supervised study. Includes: requirements; compliance 3. The taught component requires the successful completion of 120 credits of modules normally during the first 3 semesters (18 months) of the course or first 6 semesters (3 years) of the course for part-time candidates. The modules to be taken are those available from the Agrifood Advanced Training Partnership (AATP) or Agrifood Training Partnership (AFTP), with a minimum of 40 credits required to be taken at the University of Nottingham, including the compulsory 10 credit statistics module. 4. The University's Regulations for Taught Master's Degrees, Postgraduate Diploma and Postgraduate Certificate courses shall apply with regard to satisfactory progression on the taught element of the degree. Includes: before starting the research project; policies with regard to supervision and annual review 5. Before starting the Research project, each DAgrifood candidate will be allocated at least one academic supervisor and one industrial supervisor. They will be expected to complete an assessed critical literature review of current research of approximately 10,000 words and a research plan, of approximately 6,000 words, that will include a clear statement of the problem to be investigated and the rationale behind the design of the study, as well as an analysis of resource implications. The literature review and research plan will be developed with guidance from the supervisors. Progression to the Research project is dependent upon achieving a pass mark (>50%) for this assessment. 7. The candidate shall submit a thesis for examination in accordance with the requirements of the centre/programme. The thesis may be in the form of: (i) the traditional PhD thesis or (ii) published works (a format suitable for submission for publication in a peer reviewed journal) with appropriate additional integration and explanation. For more information, please consult the following: Regulations for the Degree of Doctor of Philosophy (PhD) and Master of Philosophy (MPhil) 8. Candidates shall be examined by one Internal Examiner, one External academic Examiner and normally one External Examiner who is an industrialist, although the latter may be dependent upon any confidentiality/ proprietary information issues. Includes: conferral of degree; candidates who do not undertake or fail research thesis but complete part of whole of taught programme 9. The degree of DAgrifood will be conferred on candidates who have successfully completed the taught component of the programme (including the assessed critical literature review and research plan) and have satisfied the Examiners as to the standard of the Research and thesis. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}