{
    "url": "https://www.nottingham.ac.uk/qualitymanual/prog-and-mod-design-and-approval/external-advice-prog-approval.aspx",
    "content": [
        {
            "p": "This page contains requirements in relation to external advice in programme approval. Its content is primarily directed at staff but may also be of interest to students across all of the UK, China and Malaysia campuses. Schools must seek external advice when developing a new programme of study. The external adviser’s comments will provide constructive advice to the school on the proposed programme, which will inform developments of the programme. However, there may be instances when the school considers the comments but decides not to incorporate certain elements into the proposal. This would consist of advice from some, or all, of the following groups: *External advice must always be sought from an academic peer external to the institution when developing a new programme. **External advice must always be sought from employers and/or professional bodies where a new programme is aimed at preparing students for a particular profession. Advice or guidance received from external advisers in the development of the business case must be noted in the relevant section on the business case. Formal advice from academic peers, needed for all new programmes of study, must be provided on the template provided below (the ‘External Advice for a New Programme of Study’ Form). It is expected that academic peer(s) complete this form once they have seen the relevant programme specification and business case to ensure a thorough review. All external advice must be submitted with the other curriculum documentation required for new programmes. 2.2 What to request from the external adviser The role of the external adviser is to provide independent and professionally objective advice to the school on the development of a new programme of study. The external adviser should be asked to comment on: For a template on the provision of external advice, please refer to the business case stage (section 5) of the new programme approval process, link in Section 3.0 For more information about the programme approval process and development of a business case, please consult the following: Programme design, development and approval For further information about external advice in relation to new programme approval, please contact: ss-curriculumadvice@nottingham.ac.uk Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}