{
    "url": "https://www.nottingham.ac.uk/qualitymanual/admissions/min-age-requirements.aspx",
    "content": [
        {
            "p": "This page provides guidance on the minimum age requirements for all applicants to taught or research-based programmes run by the University within the UK. Its content is primarily directed at prospective students and their families but may also be of interest to staff who are based at the UK campus. Includes: waivers; University remit This requirement may be waived on behalf of Quality and Standards Committee (QSC) for applicants who will be less than 18 years of age on admission, on an individual basis, providing that their parents or guardians have given their written agreement in advance to additional safeguards and requirements. This includes acknowledging that the University will not act in \"loco parentis.\" Includes: immigration sponsor limitations; visa implications The University is unable to act as an immigration sponsor for international students below 16 years of age. Consequently we cannot accept international students below the age of 16 where they will need a student visa to enter or remain in the UK. Includes: procedures; UCAS forms; accommodation The following outlines the University procedures for handling applications from candidates who will be under 18 years of age at the start of their course: 1. UCAS1 forms for applicants who are under 18 years of age at the start of their chosen course will be highlighted on the applications sent to admissions decision makers. 2. If a School decides that it wishes to offer a place to an applicant who will be under 18 years of age on the relevant date, the admissions tutor should return the UCAS form1 to the relevant office to process the offer. The admissions administrator should then request the necessary parental consent by forwarding a letter, information sheet and pro forma of consent to the candidate. 3. On receipt of the signed pro forma of consent from the candidate, the Head of Admissions can act on behalf of Quality and Standards Committee (QSC) to waive the minimum age requirement. Once a decision has been taken, an offer will be sent to the candidate. 4. In August, following confirmation, the Head of Undergraduate Admissions will create a list of under-18 candidates with unconditional firm offers to be circulated to relevant Heads of School and the Accommodation Office. The Accommodation Office will inform wardens of the under-18 students who will be joining their hall of residence. 1Please note, this applies to UK undergraduate admissions only. Admissions Office Admission queries UNUK Admission queries UNNC Admissions queries UNM Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}