{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-darch.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Architecture (Darch), including admissions, assessment, progression and awards information. However, please note that this programme is not currently running and its details will not be applicable to any staff or students. Includes: requirements; taught modules; subject matter and availability of modules 3. Candidates for the DArch degree are required to follow a prescribed course of study of 24 months full-time, or not less than 24 and not more than 48 months part-time in conjunction with approved professional training in accordance with RIBA rules. The taught modules of the course will total 240 credits, 80 of which will be prescribed within the selected field of study and 40 will be chosen from other approved modules; prescribed practice-linked modules will total 120 credits, 60 credits of which will comprise an evaluation of practical experience. A research project will lead to a thesis completed subsequent to the period of prescribed study. The taught modules will take place in Autumn and Spring Semesters. The practice-linked modules will be the subject of periodic three and four day courses throughout the year and will normally be examined during October/November. The thesis will be completed during the subsequent 12 months for submission no later than the end of October. The subject matter and availability of modules comprising these courses, together with any prerequisites, corequisites and other requirements applicable to them, shall be as specified in the Catalogue of Modules. Includes: candidates who do not achieve a pass mark in any modules; progressing from taught and practice-linked modules to thesis 5. Candidates who do not achieve a pass mark in any of their modules may be required to submit such supplementary work, in accordance with such conditions, as the Head of School may require, or may be required to retake their failed modules at dates to be prescribed. In order to progress from the taught and practice-linked modules to the thesis, candidates shall normally be expected to have passed in all of their modules and have had approved the topic of their research. Includes: pass mark for modules and thesis 6. Candidates who have achieved a pass mark in all their modules and have satisfactorily completed the thesis will be awarded the degree of Doctor of Architecture. The pass mark for all modules and thesis shall be 50%. Candidates who do not achieve a pass mark for their thesis following a second submission, but have passed all their other modules, will be eligible only for the degree of Master of Architecture. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}