{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-dclinpsy-sept19.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Clinical Psychology (DClinPsy) from September 2019. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 1.1 A candidate for the Doctor of Clinical Psychology (DClinPsy) degree must: (a) Be a graduate of this or any other approved university holding a Bachelor’s degree in Psychology or an equivalent subject recognised by the British Psychological Society (BPS) as conferring Graduate Basis for Chartership. This will normally be a first or upper second class honours but candidates with a lower second-class honours degree or other equivalent qualification may be considered if they have a postgraduate degree at Masters level or higher. The only entry to the programme is at the beginning of Year 1. There is no provision for advanced entry based on Recognition of Other Learning (ROL) or Recognition of Experiential Learning (ROEL). (b) Meet the essential characteristics of the NHS person specification for a Clinical Psychologist in Training and course specification. (c) Have the personal and intellectual resources to pursue a challenging and demanding research oriented programme. (d) Have previous supervised practical experience relevant to clinical training. (e) The programme covers a wide geographical area and teaching is provided at both the University of Nottingham (UoN) and the University of Lincoln (UoL) (the universities). It is therefore a requirement that students are able to make their own personal arrangements to travel to and from the universities and their respective work placements. Students should expect to have to travel for at least 3 hours a day (e.g. between universities and from base to placement). (f) Candidates will be subject to an interview process and must complete Disclosure and Barring Scheme checks and health checks for acceptability as an NHS employee. (g) Applicants whose first language is not English and who have not previously studied in Higher Education in English, must as a minimum, have one of the following: 2.1 A candidate for the degree of DClinPsy must have pursued at one of the universities a full-time course of study comprising a taught component, clinical placements and one research project. Completion of the DClinPsy programme requires a minimum of 3 years of full-time supervised study. 2.2 The universities’ Regulations for Taught Masters Degrees, Postgraduate Diploma and Postgraduate Certificate courses shall apply with regard to satisfactory progression on the taught element of the degree. All modules on the programme are compulsory and non-compensatable. For more information, please consult the following: Postgraduate Taught study regulations University of Lincoln - Undergraduate regulations 2.3 Students on the DClinPsy programme are called ‘trainees’. Each trainee on the programme is enrolled at both the University of Lincoln and the University of Nottingham, and on successful completion shall be awarded the degree by one or other of the universities. 2.4 The University of Nottingham’s Fitness to Practise procedures, as set out at Annex C, shall apply to all trainees. Annexes B, D, E, F and G specify which of the two universities’ regulations shall be followed in respect of Extenuating Circumstances; Student Complaints; Academic Offences (UoL)/Misconduct (UoN); Academic Appeals; and Student Conduct and Discipline. 3.1 Structure of Awards The standard modules in the DClinPsy award are multiples of 5 credit points, as appropriate to the level of study, with 1 credit point equating to 10 notional learning hours. The modules will be at Master (M) or Doctoral (D) level according to the table below: 3.1 The programme shall be structured according to the following principles: (a) 180 credits of taught provision (b) 80 credits of placement/taught provision (c) 280 credits of research project provision resulting in production of Research Project Portfolio (maximum 45,000 words plus appendices, etc) (d) 180 credits / 6 modules designated as taught and 280 credits / 3 modules designated as research. (e) 100 credits at Level 7; the remaining 440 credits being at Level 8. A description of the programme structure is at Annex A 4.1 Compensation cannot be offered for failure of any component within a module. 4.2 All placement assessments are graded on a pass or fail basis. 4.3 Where no formal extension has been agreed, a late submission will be deemed a failed submission. 4.4 All placements are assessed by the trainee’s supervisor, Clinical Tutor and, where appropriate, Co-Director (Clinical Practice). Supervisor assessments for taught placements are regarded as recommendations to the Programme Directors with the final decision to pass or fail the placement made by the Board of Examiners. 5.1 Trainees who have failed modules shall be offered one opportunity to be reassessed with the following exceptions: 5.1.1 Taught Modules Taught modules assessed by a Practice Based Learning Assessment (PBL): Only one PBL module may be reassessed. If a trainee fails one component or more of a second PBL module assessed by a PBL assessment, no further reassessment will be allowed and the trainee will not be permitted to continue on the programme. 5.1.2 Placement Modules Placements are assessed by a combination of case studies (written and oral) and clinical assessments. Trainees will be permitted one opportunity to resit one placement module. If a trainee fails one component or more of a second placement module, no further reassessment will be permitted and the trainee will not be permitted to continue on the programme. (a) Trainees who require funding to re-sit a placement failed by the clinical assessment will need the agreement of NHS Commissioners to continue funding an extension of the trainee’s employment and studies during the course of the three-year programme (see below). (b) Where a trainee requires an extension of the training contract, the University may be asked to confirm that the trainee is expected to satisfactorily complete and is suitable to work as a registered Clinical Psychologist, adhering to the expectations of NHS employment practice. 6.1 The Board of Examiners shall have responsibility for assessment in respect of the taught elements of the programme (see programme structure in Annex A) which will feed into the considerations of the Programme Research Annual Review (RAR) panel which shall have responsibility for assessment of the research elements of the programme and for confirming a student’s entitlement to progression. 6.2 Determination of a student’s entitlement to conferment of the final award shall be the responsibility of the Board of Examiners. 6.3 All meetings of the Board of Examiners are deemed to be held jointly between the universities and no restrictions on the exchange of information shall apply. 6.4 In recognition of the link between academic progression and employment status, the programme may communicate directly with trainees who are in danger of programme failure and thereby of losing their employment. The Programme Directors will have responsibility for informing trainees’ NHS employers of concerns about trainees’ employment status and programme failure. Includes: taught components; research components 7.1.1 In order to progress through subsequent years, trainees shall have passed all the required elements of the taught modules at each stage of the programme. 7.1.1 Each candidate will have at least two academic supervisors for the Research Modules that comprise the Research Project Portfolio. 7.1.2 Progress records shall be confirmed by Programme Research Annual Review (RAR) panels at least annually and make recommendations to the Board of Examiners. 7.2.3 Upon receipt of the progress record, the trainee transcript and any additional information that it has required, the RAR panel can recommend to the Board of Examiners that: (a) the enrolment of the trainee shall continue or (b) the enrolment of the trainee shall continue and the student must be reassessed in failed elements of the annual review (c) the trainee’s course of studies be terminated and the award of the MSc in Applied Psychology be considered or (d) the trainee’s course of studies be terminated and no award be made 8.1 The candidate shall submit a Research Project Portfolio for examination, which shall comprise of a draft journal paper, an extended paper (including an updated literature review and extended methods, analysis, results and discussion sections), a critical reflection and a poster. 8.2 The Research Project Portfolio shall be of a standard to indicate the creation and interpretation of new knowledge through original research, which extends the forefront of the discipline. The work reported shall be of a quality to satisfy peer review and merit publication in a scientific journal. 8.3 Candidates will submit their Research Project Portfolios in February of their third year of training, to be examined viva voce by May that year. Candidates who miss the February deadline can only next submit their portfolio in June, to have their viva voce examination in September. Precise dates will be published at the beginning of each academic year. Candidates who submit after June will have their viva voce examination conducted in line with the timeframes specified in university regulations. 9.1 The Examiners may recommend the following outcomes of examination for candidates: 1.1 The degree of DClinPsy will be conferred on candidates who: a) have successfully completed the taught component of the programme, and b) have satisfied the Examiners as to the standard of the Research Project Portfolio, and c) have achieved all standards of proficiency required by the Health and Care Professions Council (HCPC) and core competencies required by the BPS, and d) have supplied all raw data for the research portfolio to the school administrators, and e) have obtained confirmation from the primary research supervisor that they have prepared a submission ready journal paper, and f) are not subject to any Fitness to Practise Proceedings. 1.2 The DClinPsy degree is awarded as a simple Pass, without classification or distinction/merit categories. 11.1 A candidate for the degree of DClinPsy who achieves less than 540 but 180 or more credits may be eligible for the award of Master of Science Degree in Applied Psychology. To be awarded this MSc trainees must have successfully completed a total of 180 Level (M, D) credits with at least 60 credits from research modules. 11.2 There is no provision for the award of a Postgraduate Certificate or Postgraduate Diploma. 1 PRS Professional Skills 7 40 Academic ICI Individual Client Interventions 1 & 2 FPA Foundation Placement A: (placement activity) Essential placement activity not credit rated Placement FPB Foundation Placement B: (Placement activity and case study) 2 Case study 20 credits ERA Research Ethics & Design 8 80 Research Research Systematic Literature Review LSD Lifespan Development 20 ISO Integration & Specialist Options SYP Second Year Placement – A Second Year Placement – B BRM Data collection & analysis, APEs 100 3 BRP Research Portfolio and Viva FGI Families, Groups & Indirect Work SOS Systems and Organisations TYP Third Year Placement - Specialist 1 or 2 Two case studies 40 credits Third Year Placement - Final The Extenuating Circumstances regulations of the University of Lincoln shall apply to this programme. These regulations can be accessed via: University of Lincoln - Extenuating Circumstances As Health Service professional and full-time NHS employees, trainees have an obligation to be aware of any impairment to their fitness to work. This extends to academic work and the completion of assessments and assignments. If the submission of any assignment is likely to be adversely affected through illness or other significant personal circumstances outside their control, trainees must ask for an extension in advance of the submission date using the Extension Request Form. Extensions of up to two weeks can be agreed by the module convenor/module co- ordinator. Extensions of more than two weeks require the approval of the Co-director (Practice Learning) for Clinical Practice Reports or of the Co-director (Academic and Research) for all other assignments. Trainees who require a prolonged extension would normally be required to interrupt their studies. Where trainees are aware of a disability or long-term medical condition, or other circumstances that are expected to have an impact on their performance in assessment, they should make their Personal Tutor aware of their disability or long-term medical condition at the earliest possible opportunity so that appropriate arrangements can be put in place. Where trainees are aware of circumstances beyond their control that might adversely affect the submission of their Research Project Portfolio, they should inform their academic supervisor at the earliest opportunity, so that alternative hand-in dates can be agreed. Claims for extenuating circumstances after the submission date for an assignment has passed would normally raise a concern about the trainee’s fitness to practise, as they should have been aware of their impaired performance and requested an extension. In such a case, the module convenor / module co-ordinator would normally complete a Concern Form (see Fitness to Practise Procedure). Trainees who wish claim extenuating circumstances should complete and sign the relevant form and submit it to the Extenuating Circumstances Panel of the University of Lincoln. The Fitness to Practise regulations of the Faculty of Medicine and Health Sciences at the University of Nottingham shall apply to this programme, subject to the following adjustments: The term ‘trainee’ shall be used throughout in preference to that of ‘student’. Concerns that a trainee may not be fit to practise Clinical Psychology shall be made to the Programme Co-Director at the trainee’s degree-awarding university. References to ‘the head of studies’ shall be read as referring to the relevant Programme Co-Director. In the section headed ‘Investigations’, the reference to “the University’s Occupational Health Service” shall be read as referring to the trainee’s employer’s Occupational Health Service. These regulations can be accessed via: Registration, attendance and study The current form of the regulations, as they apply to the programme are as follows: Fitness to Practise Procedure 1.1. Any concerns that a trainee may have acted in such a way or may suffer from a health problem which may render that trainee a person not fit to be admitted to and practise Clinical Psychology should be disclosed to the Programme Co- Director at the trainee’s degree awarding university. 1.2. The disclosure should normally be made in writing using the concern form. In cases where the initial disclosure is not in the concern form format e.g. notification of criminal conviction, then the relevant Co-director should ensure that a concern form containing the disclosure is completed. The person making the disclosure must identify themselves; disclosures which are raised anonymously will not normally be considered. In exceptional circumstances the discloser’s identity may be permitted to remain confidential. 1.3. The raising of a concern form does not usually indicate a fitness to practise issue. However, the existence of multiple concern forms may show a pattern which does indicate a fitness to practise issue. Therefore on the receipt of an individual concern form which on its own does not raise a fitness to practise issue the Co- directors, should jointly review whether other concern forms have been raised, which when all considered together raise issues regarding the trainee’s fitness to practise, e.g. professional behaviour. 1.4. Where there are concerns that are serious then a trainee may be excluded from clinical placements by their Clinical Tutor on advice of the Co-directors. Some examples of a serious concern would include, but not as an exclusive list, situations where: Concerns may be such that trainees can be suspended from their course with immediate effect by the Dean or by the head of studies. If this decision is based on a concern related to discipline or health and safety then appropriate procedures as set out within the Code of Discipline for Students and the Quality Manual should be followed. If trainees are allowed to return from suspension, they will be expected to comply with any conditions decided by the School or imposed as part of the outcome of any other procedure. 1.5. A trainee will not be allowed to graduate from either University if they are subject to a fitness to practise investigation or hearing which has not been completed. 2.1. On receipt of a disclosure which gives rise to a fitness to practise concern, the relevant Co-director shall promptly, and normally within 5 working days, arrange for the matter to be investigated and shall notify the trainee of the following: 2.2 The trainee can register an objection to the appointment of the investigating officer on the basis of a lack of impartiality. Such an objection needs to the relevant Co-director within 5 working days. Examples would include where the investigating officer has initially raised the concern e.g. probity issues, or where the investigating officer has had interaction with the trainee on an unrelated contentious issue. If this objection is upheld a new investigating officer should be appointed. 2.3 The investigating officer may request members of staff connected with the case to provide written comments on the trainee’s conduct and/or health, explaining why there is concern as to fitness to practise. Factual information about the trainee’s professional progress on the course and any other relevant documentation should also be provided. 2.4. The investigating officer shall interview relevant individuals including the trainee themselves. At such interviews the investigating officer shall be accompanied by an assistant who shall prepare a written note of the interview 2.5. The investigating officer should ensure that the trainee is advised of appropriate pastoral support mechanisms within their University and Trainees’ Union. 2.6. The trainee is entitled to have a person of their choosing attend the interview with them in order to support them at the meeting. The trainee should confirm the name and status of the person accompanying them in writing to the Investigating Officer in advance of the interview. The person supporting the trainee is not attending the interview as an advocate or character witness. 2.7. The trainee may be required to attend their employer’s Occupational Health Service in order that advice on his or her fitness to practise on medical grounds may be sought. In cases where there is evidence of recurring health problems or with addictive behaviours, Occupational health referral is required. 2.8. Save in exceptional circumstances, the investigating officer shall, no later than 15 working days after the referral by the Co-directors, make a written report of the results of the investigation to the Secretary to the Faculty of Medicine and Health Sciences at The University of Nottingham detailing all evidence obtained. From this point onwards all further stages of the Fitness to Practise Procedure are handled by the Faculty of Medicine and Health Sciences at The University of Nottingham. 3.1 Promptly on receipt of the report from the investigating officer, and in any event within 5 working days, the Secretary to the Faculty of Medicine and Health Sciences shall consult the Dean of the Faculty who will determine, in the light of the seriousness of the matter and the strength of the evidence, whether the case should be referred to the Fitness to Practise Committee. 3.2 The Secretary to the Faculty of Medicine and Health Sciences will notify the trainee in writing of the following. 3.3 In the event that the Fitness to Practise Committee is to be convened, the Secretary to the Faculty of Medicine and Health Sciences will notify the trainee of the identity of the Committee members and the date of the proposed meeting of the Committee and make available to him/her, all of the evidence detailed in the investigating officer’s report. 3.4 The trainee shall be allowed at least 15 working days in which to prepare his/her case. All information on which the trainee intends to rely must be received by the FTP Secretary to the Faculty of Medicine and Health Sciences, who will then distribute this information to the members of the Fitness to Practise Committee and the Investigating Officer, at least 5 working days before the date set for the meeting of the Committee. 3.5 In exceptional circumstances the Dean may determine that a warning should be issued to the trainee without a Fitness to Practise Committee hearing as the means of disposal of the FTP procedure, according to section 7 (below). The usual example of when this would be considered is when a criminal conviction or caution has been admitted. This disposal shall only be considered when the following four conditions are met: 4.1 The trainee will be required to attend the meeting in person.If the trainee fails to attend without reasonable explanation, the Committee will consider the case in the trainee’s absence. The Chair will have discretion as to what constitutes a ‘reasonable explanation’. 4.2 The University’s case will be presented by the investigating officer or his or her nominee. 4.3 At the discretion of the Chair, the Committee may also call upon other persons (whether or not a current member of the University) to provide advice on specific aspects of the case in writing or in person. 4.4 The trainee is entitled to have a person of their choosing attend the hearing with them (referred to here as \"the friend\"), and is permitted to have the person of their choosing speak on their behalf. The trainee should confirm the name and status of the person accompanying them in writing to the Secretary no less than four working days before the hearing. 5.1 The Committee will comprise as a minimum the Chair (a senior member of the academic staff from outside the professional discipline of the trainee) and two members. At least one member should be a clinically active member of the same professional discipline as the trainee. The Committee will be serviced by a Secretary who is not a member but will be present throughout the proceedings. 5.2 Anyone who is asked to be a member of the Committee, who has been personally involved in the trainee's case at any prior stage needs to inform the Secretary to the Faculty of Medicine and Health Sciences of this. This person will then not be able to be a member of the Committee and another member will need to be appointed. This section is a guide to the conduct of the meeting itself. The Chair has discretion to vary these arrangements as they think fit. 6.1 Prior to the meeting the Secretary to the Committee will ensure the trainee has copies of all documents circulated to members of the Committee and is aware of the procedures to be followed. 6.2 The Chair will ask if any member has been personally involved in the trainee's case at any prior stage and, if so, will ask them to withdraw from the meeting. 6.3 The trainee, the friend (if attending) and staff will then join the Committee. 6.4 The Chair will introduce by name and explain the functions of the members of the Committee, the staff, and any others present. 6.5 The Chair will explain the powers of the Committee, as set out in section7. 6.6 The Chair will invite the investigating officer (or nominee) to make an opening statement and then invite the Committee to ask questions. Other staff attending will be offered the same opportunity to make a statement and may be asked questions. 6.7 The Chair will invite the trainee or the friend to make a statement. The Chair will explain that the Committee will wish to hear directly from the trainee in their own words. 6.8 Members of the Committee will be invited to question the trainee. 6.9 The Chair will invite any other person(s) called upon by the Chair to attend the meeting (as referred to in section 4.3), to make a brief statement, and will then invite the Committee to ask questions. 6.10 At each stage the Chair has discretion to allow reciprocal questioning by the various parties. 6.11 Once the Chair is satisfied that the Committee has completed their questioning and the trainee and staff have had a full opportunity to convey information to the Committee, both the trainee and members of staff will withdraw. 6.12 The Committee will then discuss the case. 6.13 If for any reason the Committee requires further clarification of any aspect of the case from either the trainee or staff members they must be all invited back into the meeting while the questioning takes place. When the Chair so determines they will then leave the meeting again. 6.14 The Committee will make its decision on the basis of the balance of probabilities and shall be taken by a simple majority of the members present and voting. The Chair shall have a casting vote in the event of a tie. 6.15 The decision, and any findings of fact, will be conveyed to the trainee and the other parties as soon as possible, and will in any event be conveyed to the trainee in writing within two working days of the decision being reached. 7.1 The Committee, following consideration of the case, has the power to: a. permit the trainee to continue with the course with no warning or sanction; b. warn the trainee that there is evidence of misconduct but the trainee’s fitness to practise is not impaired to a point requiring any of the sanctions listed below; c. impose a sanction. Beginning with the least severe, the sanctions are: i. undertakings ii. conditions iii. suspension from the course; iv. expulsion from the course. (Guidance on the imposition of these sanctions is offered in the GMC document Medical trainees: professional behaviour and fitness to practise (2007) and the RPSGB (Royal Pharmaceutical Society of Great Britain) document Guidance on trainee fitness to practise procedures in schools of pharmacy (2009)). 7.1 Where a trainee’s studies are terminated, assistance will be given to the trainee to transfer to an alternative course of study which does not provide a license to practise, if this is considered appropriate. 7.2 Where it proves impossible to continue to offer the course because the trainee is deemed incapable on non-academic grounds (such as health) of completing it and will not therefore be fit to practise, every effort will be made to offer an appropriate alternative course of study. 8.1 The trainee may appeal to the University’s Academic Appeals Committee against any warning or sanction imposed by the Fitness to Practise Committee. 8.2 The policy and procedure for an appeal are set out in the Quality Manual. The personal data of trainees will be processed by the University in compliance with the Data Protection Act. However, it may be necessary to pass personal information to other organisations such as the NHS, professional accrediting bodies or other institutes of higher education where there is a real issue about a trainee's fitness to practise and where this represents a risk to patients or members of the public. The investigation and determination of complaints shall follow the Complaints Procedures of the University directly responsible for the matters or persons or events complained of, and which has the authority to provide remedies where the complaints are upheld. Where a complaint contains substantive elements relating to both universities, investigation and determination shall follow the Complaints Procedures of the trainee’s degree-awarding university, and the other university shall provide full co-operation. University of Lincoln - Student Complaints Concerns, complaints and appeals The Academic Offences Policy of the trainee’s degree awarding University shall apply to this programme. These regulations can be accessed via: University of Lincoln - Academic Offences Policy on academic misconduct The Academic Appeals Policy of the trainee’s degree awarding University shall apply to this programme. These regulations can be accessed via: University of Lincoln - Academic Reviews and Appeals Policy on academic appeals The Conduct and Discipline Policy of the trainee’s degree awarding University shall apply to this programme. These regulations can be accessed via: University of Lincoln -Student Conduct and Discipline Student Services - Regulations Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}