{
    "url": "https://www.nottingham.ac.uk/qualitymanual/studies-away-from-university/pol-e-learning-and-distance.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on the delivery and support of online and distance learning. Its content is applicable to staff and students across all of the UK, China and Malaysia campuses. This policy covers educational provision leading to an award or part of an award that is delivered and/or supported and/or assessed through means which generally do not require the student to attend particular classes or events at particular times and particular locations. This includes practices such as e-learning, distance learning, blended learning, flexible learning, instructor-led training and the use of web-based materials to supplement classroom-based learning. The policy outlines the minimum requirements which are expected by the University to be met by Schools when delivering this provision. The requirements of this policy are in addition to the normal expectations on schools which are detailed throughout the Quality Manual. Prospective students should receive a clear and realistic explanation of the expectations placed upon them for study of the programme or elements of study, and for the nature and extent of autonomous, collaborative and supported aspects of learning. Students must have access to: Students must have: Schools must ensure that students have access to: Schools must also ensure that students can be confident that: For more information about the University's review processes, please consult the Programme Monitoring and Review documents linked below Schools must ensure that students can be confident that: The Learning Technologies section of University of Nottingham Libraries has responsibility for meeting the requirements below for the Virtual Learning Environment (VLE) systems which they maintain, namely Moodle. However, if schools use delivery systems which are not supported by Information Services (IS) then they would be expected to assume responsibility for ensuring that the following requirements are met. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}