{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2011.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2011. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. The introductory section to the Quality Manual entitled ‘About the Quality Manual’ has been amended to incorporate the previous section entitled ‘Compliance with the Quality Manual’ in response to comments from colleagues and auditors. In particular this is intended to give greater prominence to the guidance on School responsibilities in relation to all campuses including those in Asia. An Overseas Campus workspace has been set up and further guidance on operational issues that relate to quality assurance is published at http://workspace.nottingham.ac.uk/display/OCD/General . Documentation includes detailed guidance on the relationships across campuses, guidance on establishing new units at the international campuses and details of the process for approving programmes to be delivered at the international campuses. The section relating to the Annual Review of Research Students has been revised following approval by Quality and Standards Committee. There has been a substantial reorganisation of existing material. The major change is that a requirement for students to have a focused annual review in the year before they will be writing up their thesis has been incorporated, including a requirement to submit a detailed plan for submission. The changes have been made as a result of Management Board’s decision to implement a four-year submission rate policy for all full-time research students, which will apply regardless of the length of their period of registration. Students on 48-month PhDs (for example, the Integrated PhD or some programmes in Doctoral Training Centres) will therefore still be expected to submit within 4 years of their start date. In support of this, 48-month PhD Schemes of Study will only be set up where there is a requirement to do this as a result of funding body or sponsors’ requirements, and Schools must ensure that applicants to any Schemes of Study which have been created are legitimately in receipt of 4 years of funding (which will be either from a Research Council or a sponsor). The four-year submission rate policy will apply to all full-time research students on doctoral programmes who commenced study from October 2009. Section 7 (Unacceptable Circumstances) of the Extenuating Circumstances policy has been updated to clarify that if a student is convicted of a criminal offence any disruption caused by the investigation or sentence is not an acceptable extenuating circumstance. A new entry entitled Scheduled Teaching & Learning Activities for Full-Time Undergraduates has been put in the Quality Manual (currently under Miscellaneous Policies). The entry sets out an implementation schedule for Schools to introduce average weekly levels of scheduled teaching and learning depending on a student's year of course with effect from 2012/13. An addition has been made to Assessment Regulation 3 (incorporating current practice in some Schools) stating that where students have with sufficient cause missed an assessment or had their performance affected and have taken up the offer of another opportunity but gained a lower mark at that attempt the original (higher) mark will be used. An amendment has been made to the Extenuating Circumstances policy (regulation 8) to clarify that Schools must consider each case of extenuating circumstances on an individual basis and that marks should not be changed as a result of a claim of extenuating circumstances. In cases where the assessment process has been disrupted appropriate adjustments may be made to the outcomes of the affected cohort, including potentially to marks. The relevant section of the Academic Offences Policy (2.2.2) has been amended to include a note about proof-reading to state that proof reading of written work by a third party is acceptable but the editing of a piece of work which results in substantial changes to content and structure may be deemed to be plagiarism. The definition of the role of a Proof Reader has also been updated to reflect the fact they may be used by all students, and not just research students. The Extenuating Circumstances policy has been amended at section 5 (Acceptable Circumstances) to differentiate between treatment of cases of long-term illness and short-term illness. A statement that the Cripps Health Centre and the University Counselling Service will be unlikely to provide evidence if the student has had no prior engagement with the service(s) prior to the student's claim is included. A number of forms available from the Quality Manual, including the Course Transfer form, extension request form for research students and nomination of examiners form have been updated. The Nomination of Examiners form available at the Procedures for Assessment entry has been updated to include some notes for guidance on viva voce examination arrangements and to advise Schools to check informally with individuals before they are nominated to be examiners that they are able and willing to act as examiner. Further clarification on how Schools should handle late submission of extenuating circumstances has been included in the Extenuating Circumstances policy at sections 2.4 and 8. Instructions for Examiners for Master of Research and MA/MSc by Research degrees is now available at the bottom of the entry on Role and Appointment of Examiners, in support of new Report Forms for these degrees. The entry on Degree Classification has been amended to include guidance on the classification of Undergraduate Diplomas. Regulation 24 of the Regulations for Undergraduate Courses has been amended to clarify that marks awarded for modules in the foundation or qualifying stage do not contribute to the final mark classification except in the case of Foundation Certificates and Undergraduate Certificates. The wording of Regulations 11 and 13 have also been modified for clarification. The Academic Appeals Policy and Procedure has been revised. The Policy, including an overview of the Procedure, sits within the Quality Manual but the detailed operational Procedure now forms a separate document on the Academic Services Division webpages, where the Appeals FAQs and appeal form can be found. The ground for appeal of ‘Error in Calculating or Recording Marks’ has been removed, though students may still appeal on the grounds of procedural irregularity if an error has been identified by the student but is not accepted by the School. If an appeal is upheld at a panel hearing, the Academic Appeals Committee may require a recommendation to be reconsidered, either by the original decision making body or by the Chair of QSC in cases where the Committee believes there are good reasons not to refer the case back to the original decision making body. As a result of the introduction by the UKBA of more stringent English Language requirements for non-EEA applicants for visa purposes, the University has had to make some adjustments to the University Minimum English Language requirements. Please see the revised entry for full details of the revised requirements. Templates have been placed for use by Schools in carrying out the annual monitoring exercises for their taught courses and research degree programmes at the bottom of the entry on Annual Monitoring. Schools are invited to trial these on a voluntary basis in the 2011/12 Session with a view to returning completed templates to the Secretary to Quality and Standards Committee after 31 July 2012. The PhD and MPhil Regulations have been amended to enable Heads of School to give permission for the viva voce examination to take place at a location other than a University of Nottingham campus, as long as written agreement from the examiners and the candidate have been obtained (Regulation 28 refers). The PhD and MPhil Regulations have been amended to enable Heads of School to give permission for the viva voce examination to be organised in another format, for example by video-conference, as long as written agreement has been obtained from the examiners and the candidate (Regulation 29 refers). Deviation from the normal viva voce examination arrangement should not be considered where the independent reports of the Examiners indicate that the submission is a borderline case or is not of the required standard for the award of the degree, in which case permission must still be sought from the University. A change has been made to the entry on the Role and Appointment of Examiners for research degrees as a result of changes to the terms and conditions of honorary appointments, to specify that holders of honorary appointments who are in receipt of remuneration as a result should not be permitted to act as External Examiners. A new entry on School Tutoring Statements has been added to the Quality Manual in the Section on Student Support and Development. The entry sets out the University requirements for Schools to produce a written statement of its arrangements for achieving outcomes of tutoring for all its taught students. A sentence has been added to section 4 of the Extenuating Circumstances Policy to state that extenuating circumstances claims will not be considered by Schools if they are submitted more than one month after notification of the outcome of an examination board and will not be considered at all if the recommendation was a final outcome (either an award or a termination of programme) and therefore no comparative performance data would be available for consideration by the School. Supplementary regulations for the International PhD leading to the degree of Doctor of Philosophy have been added to the Quality Manual. The policy for the approval of changes to Module Specifications has been amended to include a change to the assessment regulations which makes it more difficult for the student to pass the module has been added to the list of items on which students enrolled on the module should be given the opportunity to comment. The entry on Feedback to Students has been amended to note that following a decision by Teaching and Learning Board the turnaround time for returning marked coursework and associated feedback to students will change from 28 days to 21 days with effect from Session 2011/12. A new policy on Student Representation on School Teaching Committees has been added to the Miscellaneous Policies section of the Quality Manual. The new policy, agreed by Teaching and Learning Board, requires Schools to ensure they have student representation on their School Teaching Committees or equivalent as from Session 2011/12. The limits for accreditation of prior learning allowed for postgraduate taught qualifications have been raised for Postgraduate Certificates (from 20 to 40 credits), Postgraduate Diplomas (from 40 to 80 credits) and for the taught stage of a masters degree (from 60 credits to 80 credits) to bring postgraduate limits in line with APL allowed for undergraduate qualifications. The Academic Offences Policy has been updated under 2.2.2 to include guidance to Schools on the marking of assessment material which has been submitted by a student on a previous occasion. An amendment to the Changes of Taught Course policy has been added at 3.8 to give guidance when supplementary regulations for a student's new course contain any compulsory modules which the student has already taken. The Marking and Grading section has been updated to give clarification on instances where Schools can make adjustments to module marks. The University of Nottingham Qualifications Framework has been updated with regard to the European Masters qualification which may now have a taught stage of either 120 credits or 180 credits and a research/dissertation stage which may be either 60 credits or 120 credits. The introduction to the Quality Manual has been amended to clarify that for the purposes of the Quality Manual the term 'School' is used to represent the person or body with requisite authority to act on behalf of the School according to the organisational arrangements of that School. In the Research Degree Programmes section of the Quality Manual, the entries on Responsibilities of the Student and Responsibilities of the Supervisor have been updated to highlight students' and supervisors' responsibilities with regard to being familiar with the content of The Code of Research Conduct and Research Ethics and obtaining ethical approval for research projects where this is appropriate. Regulation 5 of the PhD regulations has been amended to reflect a recent change in University policy on Staff Candidates, who may now submit for a research degree by publications only and not by thesis. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}