{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-change-of-supervisor.aspx",
    "content": [
        {
            "p": "This page sets out the procedure for changing supervisor, including the temporary absence of a supervisor, problems with a supervisor, and withdrawals. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. Includes: allocation of supervisory team; requesting a change to supervision arrangements From the academic session 2007/08, new students will be allocated a supervisory team containing at least two supervisors. Schools have the option to appoint joint or lead supervisors within the supervisory team. These regulations apply to any member of that supervisory team. If a supervisor is unable to continue with the supervision, the postgraduate student is entitled to have a new supervisor who is suitable for the task assigned promptly to them on either a temporary or permanent basis to ensure that they are not subject to undue periods of unsupervised study. Students and supervisors will also have the opportunity to request a change to the supervision arrangements in the event of insuperable difficulties arising from that relationship. Includes: continuous supervision throughout period of registered study; student funded on a studentship The Head of School is responsible for ensuring that students are provided with continuous supervision from the beginning of and throughout their period of registered study. Therefore, if a supervisor is unable to continue supervising a student or if the supervisory relationship breaks down, the Head of School must take all reasonable steps to find a replacement supervisor with the appropriate expertise and supervisory experience who is acceptable to the student (and, if appropriate, to the student's sponsor). Where a student is funded on a studentship awarded to a particular supervisor or on a specific research grant, it may not always be possible to change the supervisor. When there is a change to the arrangements for a student's supervision, the Head of School should inform Student Services or equivalent. In the case of the short term and temporary absence of a supervisor (for example, through illness) the Head of School must nominate a temporary supervisor who has the qualifications and qualities to meet the immediate needs of the student. \"Short-term\" supervisory arrangements should not normally exceed 3 months. If a longer term but still temporary absence is anticipated the Head of School should discuss with the student (and if appropriate) the original supervisor, the relative benefits of operating extended temporary supervision arrangements up to but not exceeding 6 months, or allocating a new permanent supervisor. If a supervisor permanently ceases supervision (for example, through moving to a post at another institution), then the Head of School should discuss with the student the options which are available and which benefit the student. One option will be to allocate a new permanent supervisor and the Head of School should make all reasonable efforts to identify another member of staff at Nottingham with the appropriate academic background and supervisory experience. However, it may not always be possible or in the student's best interests to allocate a new supervisor. Other options which then might be considered are to ask the supervisor who has moved to another institution to continue to supervise at a distance and to appoint a second local supervisor at Nottingham, or to seek to facilitate the student's transfer to the supervisor's new institution. Research students who find themselves without supervision or who are unhappy with their supervision for any other reason should discuss the matter with their supervisor and/or joint/lead supervisor in the first instance, or (if this is inappropriate) with the School Postgraduate Student Adviser or the Head of School, or member of staff with delegated authority at UNM or UNNC and should ask that appropriate action be taken to resolve the difficulty. These discussions must be undertaken in confidence and without fear of recrimination with the aim of resolving the difficulty amicably. Includes: mediating between student and supervisor; responsibilities Heads of Schools should designate a full-time member of academic staff to act as an independent School Postgraduate Student Adviser (SPSA) to advise research students about general procedures and, in particular, to deal confidentially with any concern raised by a postgraduate student about their studies and supervision. If the supervisory relationship has broken down, the SPSA should be available to advise and support the student. If appropriate, the SPSA should also offer to mediate between the student and the supervisor and, subject to confidentiality, should be prepared to advise the Head of School on a possible solution. For more information about the responsibilities of the SPSA, please consult the following: Responsibilities of the Postgraduate Student Advisor Includes: supervision arrangements form Student Services Graduate School - PGR GS-PGR@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}