{
    "url": "https://www.nottingham.ac.uk/qualitymanual/academic-regulations/pol-occasional-teachers.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on the appointment and utilisation of occasional teachers who are not academic members of staff or research students at the University. Its contents are applicable across all of the UK, China and Malaysia campuses. Includes: definition of occasional teachers 1. Occasional teachers are defined as individuals who undertake teaching in the University but who are not: More information on this group can be found here: Policy on students who teach 2. The policy below only applies to occasional teachers who: Schools should, though, still have some means of monitoring the performance of occasional teachers who do not meet these criteria e.g. sporadically observing occasional teachers while engaged in teaching. Includes: School responsibilities; training; mentors; feedback on performance; assessments 1. In selecting an occasional teacher and allocating teaching tasks, the School should ensure that the occasional teacher has the appropriate skills, experience and knowledge in the subject area being taught. 2. On appointment as an occasional teacher, an individual training needs assessment should be undertaken by a member of the School's academic staff. Training may take whichever form is deemed appropriate by the School (including courses provided within the School, by Professional Development, or by organisations external to the University) in light of this assessment and the sort of teaching being undertaken by the occasional teacher. 3. All occasional teachers should be assigned a mentor, who must be a member of academic staff, who can provide guidance and advice. 4. Occasional teachers should receive constructive and regular feedback on their performance (including strengths and weaknesses) by the module convenor or another member of academic staff. The occasional teacher’s performance should be monitored over the duration of the teaching and this should include classroom observation. 5. In respect of any assessment carried out by occasional teachers, Schools should ensure that Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}