{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2012.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2012. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. The Assessment Regulations have been updated to state that where a student arrives late for an examination this can only be taken into account if they have submitted, and had accepted, a claim for extenuating circumstances. As a result of the recent publication of the QAA Chapter B11 Research Degrees, some amendments have been made to the Quality Manual as follows: The Appointment of Supervisors entry has been amended at 8.1 to state that where external supervisors are appointed, they should be made aware of the University's policies on supervision and be offered opportunities to engage in developmental activities if appropriate. The Annual Review policy has been amended at point 2 (Minimum elements of annual review) to include a statement that students undergoing the annual review process are to be allowed the opportunity to meet with their Internal Assessor(s) without their supervisor(s) being present. The policy on Students Who Teach now includes a requirement that Schools ensure a student's ability to undertake his/her research and submit his/her thesis on time is not affected by their teaching commitments. The Attendance Procedures policy has been updated to include a clarification that if a student fails to progress because of failure in a module due to non-attendance as described in the Attendance Regulations, the School may require that their resit is with attendance rather than in August/September. The entry on Minimum English Language requirements has been updated to include qualifications which are recognised by the UK Border Agency which were not previously included and to amend TOEFL requirements. Restructure of the Quality Manual The Quality Manual has been restructured to map on to the Quality Assurance Agency's new Quality Code for Higher Education, which has been implemented with effect from the 2012/13 Academic Session. There are a number of changes as a result, with some entries being moved or removed, and new sections being created. These new sections include: Student Engagement; Accreditation of Prior Learning (a move from the Study Regulations section); Programme Monitoring and Review (with annual monitoring and school review policies now being in their own section separate from Programme Design and Approval); and Provision of Information. A number of policies formerly under the Miscellaneous Section have now been moved and have new URLs, though hopefully the number of changed URLs has been kept to a minimum. A detailed document on the changes (including new URLs) is available here. The content of the majority of entries which have been removed (which are mainly procedural documents re examinations) have now been incorporated into the Academic Services Division web pages. A new entry on Provision of information about higher education at the University of Nottingham has been added to the Quality Manual, which incorporates the former entry \"Information to be provided to students about their programme of study\". The entry sets out the ways in which the University aims to meet the requirements of the new Part C: Information about higher education provision, recently published by the QAA in the Quality Code. Regulation 28 of the Undergraduate Study regulations previously required that any programme with stricter rules as a result of accreditation must have a non-accredited fallback programme for students who satisfied normal university regulations but were unable to meet the requirements of the accredited programme. Whilst this will still normally be the case Regulation 28 has been amended to recognise that in some Schools it is not practical to offer a non-accredited fallback. An example might be in a specific career orientated programme, such as medicine or pharmacy, where students fail to progress from the Qualifying Year or Part I by virtue of accrediting body requirements but it is not feasible to create a fallback programme because of the highly targeted and practical nature of the teaching in the School. If this is the case it must be stated in the Programme Specification for the accredited degree and students will not be able to transfer to a non-accredited programme. In such instances the student will be awarded the non-accredited award commensurate with the number of credits successfully accrued under standard university regulations (for example an Undergraduate Certificate or Diploma). The guidance on Application of Regulations for students who fail to meet Honours requirements has been amended to include information on Pass degrees. The entry covering handling of applications from Applicants who have a long-term disability or medical condition has been amended to include a requirement for Schools carrying out their own admissions process to ask potential students being invited for an interview to state any individual requirements they may have which need to be considered in order to enable them to attend. The MPhil and PhD regulations have been amended to streamline the policy on making arrangements for viva voce examinations to be held by video conference. Final decisions on this can now be made at the time examiners are appointed and do not involve making a pre-judgement on the quality of the thesis, and the requirement to inform Academic Services Division when vivas have been held via video conference has been removed. The Quality Manual entry on External Examiners has been revised as a result of the publication of a new Chapter (B7) on External Examining in the Quality Assurance Agency's Quality Code for Higher Education, with a requirement for its provisions to be implemented with effect from Session 2012/13. The new entry Appointment and Responsbilities of External Examiners replaces the former entries entitled Appointment of External Examiners, Code of Practice for External Examiners and (in due course) External Examiners Fees and Expenses. Relevant information about the procedure for the appointment of examiners, including details of expense claims, is available on the Teaching and Learning Directorate web pages. The main changes include: • a list of indicators setting out minimum expectations for the appointment and duties of external examiners (rather than the former Precepts); • common national criteria for appointments including a person specification and circumstances which would constitute conflict(s) of interest; • a strengthened requirement for induction and training where appropriate; • publication of the name, position and institution of external examiners in module and programme information provided to students • a requirement for external examiners’ reports to be made available to students, in order to involve them in the quality assurance process • the possibility of the use of the QAA’s concerns scheme where an external examiner has a serious concern relating to systemic failings with the academic standards of a programme or programme(s). Other amendments which have resulted in a change to Nottingham’s policy are: • A limit for appointments to be for a normal maximum of four years’ service (this is currently five years) • Reappointments of External examiners will only be possible in exceptional circumstances and after a period of five years has elapsed since their last appointment (this is currently three years) • External examiners may not be succeeded by a colleague from the examiner’s home department and institution • External examiners may hold no more than two external examiner appointments (this is reduced from three) • Former members of staff or graduates of the University of Nottingham staff may not be appointed to act as External examiners within five years of leaving Nottingham (currently three years) • It is not possible to appoint more than one External Examiner from the same department of the same institution. Regulations 18 and 19 of the PhD and MPhil Regulations have been updated to include a statement that the thesis to be submitted by the student must be written by the student, and that students are encouraged to publish papers in advance of submission of their thesis. These changes have also been made to the policy on Procedures for Assessment. A new paragraph has been added to the entry on Responsibilities of the Supervisor at paragraph 6.2 to state that supervisors have a responsibility to ensure that other members of the supervisory team are kept informed of the student's progress, and any issues which may be having an impact on their programme of study. The Academic Offences Policy has been updated at 2.5 to include a new definition of 'failure to obtain ethical approval for a piece of work when this is required. The policy on Collaborative Provision has been updated to reflect the Quality Assurance Agency's definitions of terminology and also to add a new section 7 to give guidance on factors to be considered by a School when they wish to ask Transnational Education Committee to consider renewing or extending an existing agreement. A form has been added to the policy on Accreditation of Prior Learning (APL) for the use of Schools in informing Admissions where requests for APL from applicants have been granted. Regulation 13 of the Regulations for Undergraduate Courses has been amended to provide clarification in relation to the circumstances in which final year students may be offered reassessments. The Regulations for Taught Masters Degrees, Postgraduate Diploma and Postgraduate Certificate Programmes have been amended and the new Regulations will apply to all new students admitted to postgraduate taught programmes from Session 2012/13. In summary, the following amendments have been made: A clarification has been made to the Annual Review of Research Students policy in Section 4 (possible outcomes of annual review) to ensure that it is clear that where a student is failing to progress the student should have been made aware of concerns during the year, not just at the review. The Business Case template for new programme approval has been updated to include a requirement that Schools state the minimum number of students for which any new programme would be considered not viable and therefore eligible for programme closure or suspension. It is intended that by considering this at the outset during the approval process Schools will have clear criteria against which to judge the continued viability of any new programme. The entry on Feedback to Students has been amended to make it clear that it is not appropriate for students to be challenging marks when they receive feedback on written examinations. The Attendance Procedures have been amended to enable Schools to manage non-engagement by research students by bringing forward the annual review process. The Appointment of Supervisor entry has been updated at point 3.5 to include a statement that if a supervisor is not going to be available for more than six months during a research student's period of study at the University, a replacement supervisor should be appointed. Other member(s) of the supervisory team can continue to offer regular supervisions during the period of the supervisor's absence. The Responsibilities of the Supervisor entry has been amended to include a definition of a 'supervision meeting'. The PhD/MPhil regulations have been updated to state that students may enter the thesis pending period when they have completed their research as well as the period of registered study. The entry on provision of Feedback to Students has been amended to state that where coursework will not be returned within 21 days for good reasons, eg in circumstances which make this unavoidable but may also include the length of the piece of coursework submitted, students should be informed of the timescale for the return of the coursework and associated feedback. A clarification has been made to the Accreditation of Prior Learning entry under the heading of Double Counting to state that a postgraduate student may subsequently be allowed to return and undertake a dissertation for the award of a Masters degree when he or she has previously successfully completed a Postgraduate Diploma programme (ie was not awarded a Postgraduate Diploma as the result of failure on a Masters programme). Regulation 25 of the Regulations for Undergraduate Courses has been amended to include a cross-reference to the stage weightings permitted in the University of Nottingham's programme specification guidance. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}