{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-regs-doceuro.aspx",
    "content": [
        {
            "p": "This page contains the regulations for the Degree of European Doctorate (DocEuro), including course of study and assessment information. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. The regulations for the European Doctorate are the same as those which govern the PhD except where the following modify or supplement them. The criteria with which candidates must comply are those set out by the Confederation of European Union Rectors’ Conferences. Includes: frameworks In addition to complying with the periods of registration as set out in the University of Nottingham Qualifications Framework (UNQF), a candidate for the European Doctorate must spend at least one Academic Semester (or equivalent for a part-time student) conducting research in another European country during their period of study. For more information about the UNQF, please consult the following: Includes: submission of thesis; viva voce examination Candidates for the degree of European Doctorate shall be required after the conclusion of their period of directed study to submit a thesis for examination in accordance with the University’s requirements, and to attend for a viva voce examination. In addition: (a) Part of the viva voce examination must be conducted in a European language other than English, normally an official language of a European country. The examiners conducting the viva voce examination must include at least one from a higher education institution in a European country other than the UK. (b) The examiners must include at least two from universities in two separate European countries other than the UK. For more information about the viva voce examination, please consult the following: Viva voce examinations Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}