{
    "url": "https://www.nottingham.ac.uk/qualitymanual/personal-tutoring-student-support-and-development/personal-tutoring.aspx",
    "content": [
        {
            "p": "This page provides guidance on the role and responsibilities of personal tutors, including about effective delivery. Its contents are primarily directed at tutors but may also be of interest to staff and students across all of the UK, China and Malaysia campuses. In the academic year 2024/25, a number of students will be allocated to small interdisciplinary tutoring teams consisting of both staff and student representatives, instead of individual personal tutors.These students are first and second year undergraduate students in the Schools of Psychology (UK & UNM) and Law (UK), as well as postgraduate taught students in the Schools of Psychology (UK) and Computer Science (UK), first-year undergraduate students in the Nottingham University Business School (UK) and qualifying-year undergraduate students in the School of Education and English (UNNC). Where 'personal tutor' is referred to within the Quality Manual, for the students detailed above, this includes 'here for you guides'. See: Academic Guides. Includes: expectations; personal tutor meetings; goal setting and action planning; School responsibility regarding Senior Tutors; evaluation of personal tutoring; programme monitoring and review Every taught postgraduate student (whether full or part time, on a professional course, or on a distance learning course) should be allocated a personal tutor and informed of this at the start of their course. In particular, Schools should ensure that PGT personal tutoring programmes provide: PGR students should receive personal and academic support from their supervisor and from their School Postgraduate Student Adviser. For more information about the role and responsibilities of the School Postgraduate Student Advisor, please consult the following: Responsibilities of the Postgraduate Student Advisor Responsibilities of the School (PGR) There should be a clear stage appropriate developmental agenda for every personal tutor meeting, with appropriate time for reflection and action planning/goal setting around the following areas, in addition to discipline specific activity: Personal, professional and employability developmental goals may relate to any area of potential achievement other than those for which students are explicitly provided with an assessment grade or academic award. By setting, achieving and reflecting on their academic performance and their personal, professional and employability developmental goals with their personal tutor, students may be assisted in maximising their experience in their time at the University of Nottingham, and should improve both their employability prospects and their general wellbeing. It is suggested that the best goals will be simple, tangible, memorable and achievable. Examples of some goals include: In addition personal wellbeing goals may include: For more information about the role and responsibilities of Senior Tutors, please consult the following: Role and responsibilities of Senior Tutors Each school should take steps to monitor the effectiveness of its arrangements for the provision of student support and development. The Senior Tutor(s) should take a lead role in undertaking this monitoring. It is the responsibility of the University Senior Tutor to monitor the operation of student support and development across the University and to bring issues of concern to relevant University committees. One aspect of the University's Educational Enhancement and Assurance Reviews (EEARs) is to determine whether adequate overall provision is made for student support and development support. Central support services providing student support and development are also subject to periodic reviews by the University. For more information about these processes, please consult the following: Programme monitoring and review As part of their School’s student support, development and personal tutoring programme, all personal tutors in the University of Nottingham are expected to support, encourage and guide those registered students who are their tutees’ so that they are supported in maximising their academic potential, personal development, and professional and employability skills acquisition throughout their time as a registered student at the University. Personal tutors can enable their tutees to achieve this by helping them to review their progress regularly by encouraging self-appraisal and self-development strategies, by helping them to identify learning needs or goals and monitor their progress towards achieving their goals, as well as by exploring developmental opportunities available both within and outside the University. The personal tutor will also act as a gateway to the wider support and development provision at the University. Personal tutors are not expected to be able to advise on all matters of personal and professional development and support. They are, however, expected to have sufficient knowledge of their School and the wider University so that they can help students to find the assistance they require. Such information will be made available to them, either by way of training or through their Senior Tutor. Includes: student responsibilities All students need to appreciate that a successful undergraduate or postgraduate career will involve more than passing assessments to achieve a University award. The University (both centrally and at a School level) provides a wide range of support and development services to assist students in difficulty, as well as to improve the wellbeing, personal and academic development, understanding of University practices, employability and sense of community of every student. However, it is the responsibility of every student to gain an adequate knowledge of what services are available to and appropriate for them, and to make use of these services as their individual needs and circumstances require. In particular, students should make all reasonable efforts to prepare for and attend all scheduled meetings with their personal tutor, and to keep their personal tutor informed of their personal development progress. Students are reminded that they are likely to require references for employment or further study from their personal tutor, and that it is unreasonable to expect their personal tutor to be able to supply an adequate reference if they have not engaged in a reasonable level of interaction with them. In the academic year 2023/24, first-year undergraduate students in the Schools of Psychology (UK & UNM) and Law will be allocated to small interdisciplinary tutoring teams consisting of both staff and student representatives, instead of individual personal tutors. For more information about the pilot, please consult the following: Academic Guides Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}