{
    "url": "https://www.nottingham.ac.uk/qualitymanual/recent-changes/changes-in-2005.aspx",
    "content": [
        {
            "p": "This page contains a record of all changes made to the Quality Manual in 2005. Please be aware that this page is an historical record and thus, may contain information which has been altered or removed. 9 December Policy on allowing students to exceptionally Register for Additional Credits has been added to the Study Regulations section. The normal expectation is that registered students of the University enrol for modules in accordance with the appropriate University regulations and programme specification. Exceptionally, however, a student may be allowed to register for a maximum of 20 additional credit-bearing modules in any one academic year. 7 December An addition has been made to the Voluntary Suspensions of Registration entry to clarify the set period after initial registration within which all students are expected to complete their course. This is within the Study Regulations section. 6 December The following changes have been made to the Assessment section: Re-Appointment of External Examiners An amendment (highlighted in italics) has been made to the following statement: ‘No External Examiner may be re-appointed for the same or similar course within three years of finishing their previous appointment’. This modification is to allow for the possibility of an External being used for a quite different course from a previous appointment e.g. for an MSc course largely unrelated to an undergraduate course which they have examined. Boards of Examiners’ Minutes A sentence has been added stating: ‘Schools will be expected to use these minutes when requested by students to explain decisions made in regard to them.’ The purpose of this change is to clarify one of the functions of the minutes and to reiterate that students may have access to information about themselves contained in the minutes (as is already made clear in the entry on data protection in the Quality Manual). Retention of Scripts A new statement says that: ‘Schools should retain scripts until at least the end of the academic session following the session in which the examinations occurred.’ This replaces the original retention policy that: ‘Schools should retain scripts for a year after a student has graduated, (eg four years for a student on a three-year course).’ The original retention policy was based on the requirements of QAA Subject Review, which has now been discontinued. The new retention policy is commonplace at other institutions. Instructions for the Layout and Timing of Examination Question Papers Instructions have been added that: 'In the case of foreign language examinations the question rubric should clearly indicate which language answers should be given in.' 2 December Guidance on School responsibility for compliance with the Quality Manual, and on the role of the Academic Office in helping to interpret the Quality Manual has been added to the Quality Assurance Structures section. 28 September The Research Degree Programmes (RDP) section of the Quality Manual has been updated to ensure that the University's guidance complies with Section One: Postgraduate Research Programmes of the Quality Assurance Agency's Code of Practice, which was revised in late 2004. A working group of Research Degrees Committee met several times during Session 2004/5 to consider these revisions, and its recommendations were signed off by that Committee at its final meeting in 2004/5. The main changes are: (1) information on admissions has been taken out of the RDP section and is now included in the Recruitment and Admissions Section (2) the Training entry now includes guidance on Induction (3) Criteria for award of MPhil and PhD have been replaced by the M Level and D Level Descriptors where appropriate (4) there is a new guidance on the viva voce examination (5) the thesis-pending period extension request form has been updated (6) references to the \"Research Students & Supervisors: a Guide\" have now been removed. The Guide was discontinued with effect from the start of the 2005/6 Session and its content incorporated within the Quality Manual. 30 August The Extenuating Circumstances procedure and guidance has been updated to cover students who are unable to take examinations on a particular day during the published examination periods for reasons of religious observance (see section 4.8). These students should complete and submit the Religious Observance Form by the published deadlines. The procedure and guidance is within the Assessment section. 2 August Following consultation with Academic Boards and approval at Taught Courses Committee (see minutes 05/18) a revised Programme Specification template and accompanying guidance has been published in the Programme Approval, Monitoring and Review section of the Quality Manual. This template should be used for all new course proposals from September 2005 onwards Taught Courses Committee (see minutes 05/19) has also approved policy providing clarification of the University policy regarding amending Programme Specifications, including which type of changes require approval by the Academic Board Programme Committees (or equivalent). This is included in the Programme Approval, Monitoring and Review section of the Quality Manual as Policy and procedure for the approval of changes to Programme Specifications. 1 August Following approval at Taught Courses Committee (see minutes 05/08) the procedure for Academic Appeals Committee and Academic Offence Committee hearings have been revised to include provision for a student representative on the panel of Academic Appeals / Offences Committees, to run for a trial period in the 2005/06 academic year. The procedures are in the Complaints and Appeals and the Assessment sections of the Quality Manual. 27 July Revisions have been made to the procedure for the approval of collaborative provision as a result of a review of previous procedures against the revised QAA Code of Practice Section 2: Collaborative provision and flexible learning (September 2004). The revisions ensure that the requirements of the Code are being met, and also streamline the procedure in order to increase efficiency and to clarify the process. It is anticipated that this should shorten the time taken to gain approval for collaborations while at the same time reducing the administrative burden upon Schools and the Collaborative Courses Committee. 5 July At the request of Teaching Committee (see minutes), the following changes have been made to simplify the structure of the Quality Manual and bring it more into line with the QAA Code of Practice : - Revised undergraduate and taught postgraduate regulations have been incorporated in the section on ‘Attendance and Progression’. This section has been renamed ‘Study Regulations’. The Regulations for Undergraduate Courses take effect from 2005/06 for students admitted during or after September 2004. The Regulations for Taught Masters Degrees, Postgraduate Diploma and Postgraduate Certificate courses take effect from 2006/07 for students admitted during or after September 2006. - The section on ‘Student Information, Input and Feedback’ has been removed and relevant parts of it have been placed in the ‘Quality Assurance Structures’ section. - The section on ‘Graduation’ has been removed and relevant parts of it have been placed in the ‘Assessment’ section. - The section on ‘Staff Development’ has been removed and relevant parts of it have been placed in the ‘Quality Assurance Structures’ section. - Material on academic offences has been relocated from ‘Complaints and Appeals’ to ‘Assessment’. - A new section on ‘Flexible and Distributed Learning’ has been created in line with the new part of the QAA Code of Practice. 30 June The award of ‘Practitioner Doctorate’ has been added to the University awards available in the University of Nottingham Qualifications Framework (UNQF). 29 June Minor changes have been made to the Council Grievance Procedure within the Complaints and Appeals section to reflect the role of the Office of the Independent Adjudicator for Higher Education and to introduce a specified time limit of one month from an initial refusal by the Chair of the Panel, within which a student must submit a revised appeal. 30 March Several changes have been made to the Research Students section. The following forms have been added to the Procedures for Assessment page: Research Students can now hand in their Notification of Intention to Submit Forms to Schools as well as the Registry. The following forms have been added to the Role and appointment of examiners of research degrees page: Examination for the degree of MPhil Examination for the Degree of PhD 28 February A revised suspension form and a revised withdrawal form have been added to the Voluntary Suspensions of Registration page. These forms have been changed to take into account the University's responsibility to let the Home Office know when an international student suspends or withdraws. This is in the Attendance and Progression section. 25 February Two minor changes have been made to the Code of Practice on Recruitment and Admissions: A statement has been added to the Admissions Procedures section stating that applications will not be considered from candidates who have previously registered for and been unsuccessful on the same course at the University of Nottingham for which the application is being made; and a statement has been added to the Intake and Offers section regarding targets for international student intake. 11 February The Code of Research Conduct has been moved from the Guide for Research Students and Supervisors (shortly to be removed from the General Information and Regulations for Students web pages) and is now in the Research Degree Programmes section of the Quality Manual. 10 February The following changes have been made within the Assessment section of the Quality Manual: External Examiners The Code of Practice for External Examiners (Undergraduate & Taught Postgraduate Programmes) and the guidance on the Appointment of External Examiners have been reviewed and minor amendments, clarification and additions made to reflect the revised QAA Code of Practice on External Examiners published in August 2004. Assessment Policies and Procedures Minor amendments have been made to the Assessment Policies and Procedures for Students on Taught Courses section to reflect current policy and practice. Additional guidance relating to 'In-house' examinations and tests and relating to the consideration of Joint-Honours students has been added. Overseas Resits A formalisation and strengthening of existing policy and practice relating to Overseas Resit examinations has now been included in the Quality Manual. 10 February The Examination Arrangements for Students who have a Disability, Dyslexia or Long-Term Medical Condition section has been updated to reflect deadlines for 2004/05 and minor amendments to reflect current policy and practice. This is in the Students who have a disability section of the Quality Manual. 8 February Minor revisions have been made to section 12 of the Programme Specifications Template to reflect changes in the structure (and names) of the various units in Student Services. This is in the Taught Programmes: Approval, Monitoring and Review section of the Quality Manual. 31 January The guidance for section 15 of the Programme Specifications Template has been amended to ensure that Schools describe, for undergraduate courses, which degree class algorithm is used to convert marks to classes, where the marks boundary for identifying a candidate as borderline falls (in particular for the Upper Second/First boundary) and how the degree class of borderline candidates will be decided. For postgraduate courses Schools should describe how Merits/Distinctions etc are awarded. This is in the Taught Programmes: Approval, Monitoring and Review section of the Quality Manual. 21 January The procedure for Monitoring Research Degree Programmes has been added to the Research Degree Programmes section of the Quality Manual. It outlines the responsibilities of Schools and Research Degrees Committee in considering the Quantitative Data Set (QDS) which will be provided to Schools on an annual basis in regard to their research degree programmes. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}