{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-engd.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Engineering (EngD). Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. 1. A candidate for the Doctor of Engineering must be a graduate of this or any other approved university holding a Bachelor's degree (normally first or second class Honours or equivalent) in an engineering or related subject. 2. In keeping with the wording used by the Engineering and Physical Sciences Research Council a candidate who is accepted onto the EngD programme shall be designated by this University as a Research Engineer. 4. The taught component will be taken at this University and at any other Universities which are members of the relevant research council or doctoral training centre/programme. The taught component requires the successful completion of up to 180 credits of modules as specified in the Centre's regulations, normally during the first two years of the course. 5. The University's Regulations for Taught Master's Degrees, Postgraduate Diploma and Postgraduate Certificate courses shall apply with regard to satisfactory progression on the taught element of the degree. For more information, please consult the following: Postgraduate Taught study regulations 6. Each Research Engineer will have at least two academic supervisors and one industrial supervisor. 7. The University's policies with regard to supervision and annual review of progress shall apply, together with any further requirements specified by the centre/programme. Includes: candidates who do not undertake or fail research portfolio 11. The degree of EngD will be conferred on candidates who have successfully completed the taught component of the programme and have satisfied the Examiners as to the standard of the portfolio thesis. 12. The Examiners may recommend to the University the following outcomes of examination: 13. Candidates who either do not undertake or fail the research portfolio but successfully complete part or the whole of the taught programme may be considered for the following awards: Postgraduate Certificate (60 credits), Postgraduate Diploma (120 credits) or MSc (180 credits) depending on the specifications of the individual programme. 14. Where a thesis has been resubmitted and/or a second viva voce examination has occurred, the Examiners may recommend to the University the following outcomes of examination: Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}