{
    "url": "https://www.nottingham.ac.uk/qualitymanual/research-degree-progs/pgr-supregs-dclinpsy-sept23.aspx",
    "content": [
        {
            "p": "This page contains the supplementary regulations for the Degree of Doctor of Clinical Psychology (DClinPsy) from September 2023 for its 2023 intake. Its content is relevant to staff and students across all of the UK, China and Malaysia campuses. This document sets out the general principles and regulations that apply to the Trent Doctorate in Clinical Psychology (DClinPsy) - a professional doctoral-training programme delivered jointly by the Universities of Lincoln and Nottingham and delivered in Partnership with NHS England (previously HEE). These Regulations supersede all previous Regulations for the DClinPsy (which are hereby revoked) and represent the primary regulatory framework for the DClinPsy programme. Where a policy, procedure, or process is not specified below, the regulations governing Professional Doctorates at the Universities of Lincoln and Nottingham shall apply. 1.1 The DClinPsy is a three-year postgraduate doctoral training programme. Graduates from the DClinPsy training are able to register with the Health Care Professions Council (HCPC) as practitioner psychologists, can use the protected title Clinical Psychologist, and can gain Chartership with the British Psychological Society (BPS). 1.2 Students on the DClinPsy programme are called 'trainees'. 1.3 Trainees formally enrol with both Universities but are designated a base University at the point of their placement offer. Placement offers are dependent upon allocation of the trainee to a specific Healthcare Trust and trainees are made aware of their assigned Trust and base University prior to the point of enrolment. 1.4 Programme structure The programme is structured according to the following principles: 1.5 Doctoral Award 1.5.1 Upon successful completion of the programme trainees will be awarded their degree from the base university and shall not be eligible for a degree from the other University with which they are enrolled. 1.5.2 The DClinPsy degree is awarded as a Pass. 1.5.3 The degree of DClinPsy will be conferred on trainees who have fulfilled all programme requirements. 2.1 There is no Accreditation of Prior Learning (APL, APEL, Recognition of Other Learning) for entry to the programme. 3.1 There is no compensation between assessment elements or modules. 3.2 A late submission without an approved extension will be counted as a non-submission. 3.3 Taught Components 3.3.1 In order to progress to subsequent years, trainees shall have passed all elements of the taught modules at each stage of the programme. 3.3.2 If a trainee fails a taught assessment element, they will be offered a single in-year re-sit opportunity for that assessment element. Failure of a re-sit will result in programme failure. 3.3.3 Where students reach a progression point but have outstanding first-sit or resit opportunities, the Board of Examiners shall permit “proceed with conditions” to the next level of study pending completion of the outstanding elements. A Board decision on progression or withdrawal will be made at the next available Monthly Board. 3.4 Clinical Placements 3.4.1 A trainee is only entitled to a single resit opportunity against one failed clinical placement. Failure in a second clinical placement will result in programme failure. 3.4.2 Clinical placements may be assessed via single or multiple clinical placement modules. Where a placement is assessed by two modules, the first module constitutes a prerequisite for the second. Failing of the pre-requisite module constitutes a failure of the whole clinical placement. 3.4.3 A Trainee who fails the prerequisite clinical placement module and although they are not able to be assessed in the second module for that placement may continue to engage in the second element of this placement as part of their employment contract. This may be subject to Fitness to Practice Regulations. 3.4.4 Where a trainee has to re-sit a clinical placement, the Exam Board has the discretion to allow trainees to proceed to the next year and participate in the academic programme pending formal progression. 3.4.5 Where a trainee requires an extension to their training contract, which impacts upon the duration of study, the Board of Examiners can extend the duration of studies subject to confirmation of the trainee’s employment extension and accompanying conditions. 3.5 Research Components 3.5.1 Each trainee’s progress will be monitored and confirmed by the Research Annual Review (RAR) Panel who meet annually. 3.5.2 The RAR panel can recommend to the Board of Examiners either that: 3.5.2.1 the trainee can progress, 3.5.2.2 the trainee must be reassessed in failed elements but can proceed (continue with their studies), 3.5.2.3 the trainee’s course of studies be terminated. 3.5.3 If a trainee fails a research assessment element in the first two research modules, they will be offered an in-year re-sit opportunity for that assessment element. Failure of a re-sit will result in programme failure. 4.1 Trainees will be offered two submission points for their Research Project Portfolio. Trainees who submit their Research Project Portfolio in February of their third year of training will be examined by viva voce by May that year. Trainees who miss the February deadline can only next submit their portfolio in June, to have their viva voce examination in September. Precise dates will be published at the beginning of each academic year. 4.2 Trainees who are authorised to submit after June will have their viva voce examination conducted in line with the timeframes specified in university regulations. 4.3 The Examiners may recommend the following outcomes of examination for Trainees: 4.3.1 Pass the research component of the degree 4.3.2 Pass the research component of the degree subject to minor corrections within one month 4.3.3 Pass the research component of the degree subject to minor amendments to be completed within three months 4.3.4 Require the trainee to attend for a second viva voce examination and resubmit the same portfolio (which may be subject to minor amendments to be completed within three months) 4.3.5 Require the trainee to resubmit the portfolio in a revised form within twelve months with or without attending a second viva voce examination 4.3.6 Fail the research component of the degree with no further opportunity for resubmission 5.1 Resits will normally be submitted within 6 weeks of formal notification to the trainee of assessment failure. 5.2 All trainee resits and other progression issues will normally be dealt with at the next available monthly board regardless of its primary remit. 6.1 All meetings of the Board of Examiners are deemed to be held jointly between the two partner universities and no restrictions on the exchange of information shall apply. 6.2 In recognition of the link between academic progression and employment status, there are three exceptions to the confidentiality and communication of exam board results: 6.2.1 the programme may communicate directly with trainees who are in danger of programme failure and thereby of losing their employment. 6.2.2 The Programme Directors will have responsibility for informing trainees’ NHS employers of concerns about trainees’ employment status and programme failure. 6.2.3 The programme will normally communicate directly with the HCPC and other accrediting bodies directly following an Award Board, giving names of trainees who have successfully completed all components of the DClinPsy to allow immediate registration as Clinical Psychologists. 8.1 Where leave in relation to sickness has been given by the NHS manager, an extension of equal duration for assignment deadlines will normally be given. 8.2 Where leave in relation to a period of approved Interruption to Studies has been given by the University of Nottingham or the University of Lincoln, an extension of equal duration for assignment deadlines will normally be given. 8.3 Notwithstanding the above, all trainees must submit extension requests to the University of Lincoln with supporting documentation, which may include a PASS/Learning Support plan. 9.1 All trainees are subject to Mitigating Circumstances process at the University of Lincoln. 9.2 Trainees who apply for Mitigating Circumstances that have affected, are affecting or will affect their Fitness to Practice have a duty to inform the programme team and their employing service as soon as possible. 11.1 The investigation and determination of complaints shall follow the Complaints Procedures of the University directly responsible for the matters or persons or events complained of, and which has the authority to provide remedies where the complaints are upheld. 11.2 Where a complaint contains substantive elements relating to both universities, investigation and determination shall follow the Complaints Procedures of the trainee’s degree-awarding university, and the other university shall provide full co-operation. 12.1 The Conduct and Discipline Policy of the trainee’s degree awarding University shall apply to this programme. 13.1 All trainees are subject to the University of Nottingham’s Fitness to Practise procedures. Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}