{
    "url": "https://www.nottingham.ac.uk/qualitymanual/registration-and-attendance/changes-of-taught-course.aspx",
    "content": [
        {
            "p": "This page contains guidance for undergraduate and postgraduate taught students about how to change course. Although primarily directed at students, this information may also be of interest to staff across all of the UK, China and Malaysia campuses. Please note that students in the UK on a Student Route visa are also affected by the University's Policy on Immigration Sponsorship. Where academic policies and immigration policies seem to be contradictory, immigration policies will take precedence. For more information, please consult the following: Immigration sponsorship Includes: options; request to transfer taught course form; responsibilities 1.1 Students may request to change from the course on which they are currently registered to another course offered by the University. They may either: In all cases, the School that the student is leaving must be aware of the student's request and the school that the student is joining must agree to the change. Not all courses offer the opportunity for transfer on to them, and students must follow the guidance below to see which courses may be available. Students should check the following lists to determine course availability for an internal transfer: Students should refer to the Academic Services Office page on Moodle to determine course availability for internal transfer: Academic Services Office Students should confirm course availability with the relevant school. For all transfers, students must meet the entry criteria for the course. Students must check that they meet the entry criteria on the online course catalogue before requesting a transfer. Online course catalogue A change of course form should be completed indicating the support of both Schools. Request to transfer taught course form In some cases, the agreement of the Quality and Standards Committee (QSC) to the change of course is also required. The ability to change course may also be subject to the student's immigration status. In the case of Joint Honours or major/minor courses, the administering School accepting or giving up a student should inform its partner School of the change. 1.3 There is no requirement on Schools to agree to a request for a course change, and Schools are free to turn down such requests. 1.4 Content in this policy referring to ‘students’ applies equally to apprentices unless otherwise stated. Apprentices considering a change of taught course are required to discuss the matter immediately with their employer and their School. There are implications to their current employment contract, their apprenticeship commitment statement and thus contractual arrangement with the University of Nottingham. If considering moving to a non-apprenticeship programme, the apprentice should note they would become personably responsible for their tuition fees whether as part time or full time student. Includes: time limits; transfer criteria 2.1 All changes of course without going back a stage can only occur in the first three weeks of the session, or at the end of the Autumn semester, or at the end of the session (unless module choices for the old course satisfy those for the new course and so no change in module selection is required). 2.2 Where a student wishes to transfer at the end of the Autumn or Spring semester of the Qualifying Year without restarting the new course, the school responsible for the student's new course must be satisfied that the student has the necessary prerequisite knowledge to be able to perform adequately on that course. 2.3 Where a student wishes to transfer after the start of Part I without going back to the beginning of Part I of the new course, one of the following criteria must be met: 2.4 If none of the criteria in 2.3 are met, but the School still wishes to recommend a change of course without going back to the start of Part I, a case should be made for consideration on behalf of Quality and Standards Committee (QSC). The case should demonstrate that the student has already substantially achieved the learning outcomes of the modules they have missed, or will be able to do so during the rest of their new course. 2.5 If the change is made at the end of the Autumn semester, the marks from the old course will be used for progression and degree classification purposes along with the Spring semester marks from the new course (the Part I/II/III weightings for degree classification purposes will, however, be those for the new course). If a year-long module was being taken on the old course, the relevant School should be asked to allocate a mark for the Autumn semester element of the module on the basis of performance during that semester (which may mean placing a semester-long version of the module on relevant systems for this purpose). 2.6 If the change is made at the end of the session, it will be necessary for the student to be in a position to progress under University regulations (though not necessarily supplementary regulations) to the next stage of the old course before being allowed to begin the next year of the new course, Includes: students who are progressing satisfactorily who choose to request a transfer of course; students who cannot progress on their original course and wish to transfer to another course 3.1 Schools may, if they wish, agree to accept students who submit a request to leave their old course at whatever stage they have reached and begin their new course from scratch, so long as the student meets the normal admission requirements for the new course. 3.2 Schools may also accept students who are in or at the end of Part I, or in Part II or III, of their old course and wish to start their new course from the beginning of Part I. Schools must, though, be satisfied that the student has the necessary prerequisite knowledge to be able to perform adequately on the new course. 3.3 Students in Part II or III of their course wishing to transfer to a new course from the beginning of Parts II or III respectively must be able to satisfy one of the criteria listed in 2.3 (of the previous section) or the school must provide a case as specified in 2.4 (of the previous section). 3.4 In choosing options, students changing course must not select modules which they have previously taken. Where the range of options stipulated by supplementary regulations is so limited as to make this impossible, the arrangements set out in 3.5 will apply. 3.5 In certain cases, supplementary regulations for a student's new course contain compulsory modules which the student has already taken. In these circumstances, the school may decide either: (a) that the module(s) should be taken again, in which case the mark gained at the first attempt (that is, on the previous course) will be the one used for degree classification purposes and the higher of the two marks gained used for progression purposes, or; (b) that the student should be registered on agreed modules rather than repeating enrolments on compulsory modules that have been successfully completed. Where (b) applies the compulsory modules will be included in the degree classification and the additional modules will not contribute to the degree award. 3.6 (i) A change of course involving going back one or more stages can take place at any time in the session. Students can either choose to complete the session on their old course or suspend their registration for the rest of the session. If the session is completed, there is no need for the student to be in a position to progress in order to change course if going back one or more stages. (ii) Schools may not, though, accept such a student if the compulsory modules on the student's proposed new course include more than 60 credits that the student has already studied. 3.7 A student who cannot progress after having one reassessment opportunity (including where the student's course has been terminated) may be allowed to change course (going back one or more stages), with the agreement of the schools involved, rather than be required to withdraw from the University. Schools may not, though, accept such a student if the compulsory modules on the student's proposed new course include more than 60 credits that the student took on the course from which they could not progress. 3.8 Where supplementary regulations for a student's new course contain any compulsory modules which the student has already taken, the module(s) should be taken again and the higher of the two marks gained used for progression purposes. The mark gained at the first attempt (that is, on the previous course) will, though, be the one used for degree classification purposes. Includes: requirements; request to transfer form; impact of student immigration status Students on some Foundation programmes are required to choose the Honours programme they will transfer to if successful at the end of the foundation year. Where this applies, students will be advised when this choice must be made and are required to complete the ‘Request to Transfer Taught Course – Foundation Year to Honours Degree only’ form and return it to the Director of the Foundation Programme by the published deadline. Request to transfer from a foundation taught course to an honours degree form Failure to do so may mean a student is unable to start an honours programme in the next academic year. The ability to transfer to a selected course may be subject to the student’s immigration status. Includes: requirements; request to transfer taught course form; conditions of transfer Where a postgraduate student on a taught course (PGT) wishes to transfer course, a change of course form (obtainable from Registry and Academic Affairs and below) should be completed by the student, obtaining written approval from the school(s) involved. Such a course transfer can only take place in the first three weeks of either the Autumn Semester or the Spring Semester. If the transfer is taking place in the Spring Semester, the school responsible for the student's new course must be satisfied that the student has the necessary prerequisite knowledge to be able to perform adequately on that course. If either of these conditions is not met, the school will be required to make a case to Quality and Standards Committee (QSC). Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}