{
    "url": "https://www.nottingham.ac.uk/qualitymanual/assessment-awards-and-deg-classification/pol-on-feedback-to-students.aspx",
    "content": [
        {
            "p": "This page contains the University's policy on feedback that is provided to students for pieces of assessed work, including coursework and written examinations. Its contents are applicable to staff and students across all of the UK, China and Malaysia campuses. Schools/Departments must ensure that where feasible, appropriate feedback is provided to students on assessed work in order to facilitate improvement and promote learning. Feedback must be related to the assessment criteria, in order to help students identify areas for improvement as well as commending them for evident achievement. Includes: provision and format; marks location; extenuating circumstances; returning of marks; definition of work day Feedback should be given on all forms of coursework where practicable. Feedback should be written and supplemented where appropriate with oral comments. Where coursework has been submitted electronically, feedback must be provided electronically. The only exception to this is where a member of staff has a reasonable adjustment. Where appropriate, it is good practice for marks for coursework not submitted electronically to be fed back on electronically. An exception would be made where a member of staff has a reasonable adjustment. Marked coursework and associated feedback will normally be returned to students within 20 working days1 of the published submission deadline for Qualifying Stage modules and 15 working days for all other undergraduate and postgraduate taught modules. This will be 28 working days for UoNO learners. Students submitting work before the published deadline should not have an expectation that early submission will result in earlier return of work. Where coursework will not be returned within the time frames above for good reason - for example, in circumstances where a student has been granted an extension of the deadline, unexpected absence of the module convenor or assigned marker, lengthy pieces of coursework and others - students must be informed of the timescale for the return of the coursework and associated feedback. Where a student has claimed extenuating circumstances and has been granted a further attempt at an assessment, resulting in the mark being expunged from the record, this procedure will not normally apply. In normal circumstances, marked coursework and associated feedback must be returned to students before the main University examination periods. If necessary, coursework can be returned after the main University examination periods. However it is likely that this will then be outside of the normal time frames (see above). It is good practice to inform students in advance of submission of the timescale for the return of the coursework and associated feedback. If it is necessary for students to receive feedback on coursework during the exam period, then it must be returned without the mark. Summative marks should only be given after the exam period. For these purposes, coursework refers to all assessments other than unseen written examinations taken during the main University examination periods. 1 A working day is a day when the University is open for normal business. Weekends and University Closure Days are not regarded as working days. However, periods outside of University term (vacation periods) are regarded as working days (unless they are weekends or University Closure Days). Similarly, the booking of Annual Leave by a staff member does not change the status of a day being a working day. Includes: examination script instructions; student opportunities to receive satisfactory feedback; optional examination feedback form Hard copies of examination scripts must not be returned to students. However wherever it is feasible and helpful for students to discuss their examination performance with staff and with reference to marked scripts, this can be facilitated. The purpose of this is for feedback, not to challenge the marks awarded. All students must be given a clearly advertised opportunity to receive feedback on their examinations. Where no other suitable mechanisms exist for providing feedback the module convenor must supply on the web a generic feedback report (which need be no more than one side of A4) for each module to the relevant group of students which: If you require a template, please use or consult the following: Includes: feedback upon request; expectations on Schools/Departments; timings Each candidate is entitled to be informed of the marks they have been awarded in all examinations and assessments which contribute to the award of a degree or other qualification. This includes all Foundation Year, Qualifying and Parts I, II and III marks. All students failing a module must be given feedback on request which, as a minimum (though only where relevant), comprises a breakdown of their marks question-by-question. Schools/Departments must ensure that students are informed how and when marks/results will be released to them. Personal tutors, course tutors, examinations officers, or other delegated authorities in Schools/Departments are permitted to present marks as part of the process of feedback on academic performance prior to release online. In the case of marks for Autumn Semester examinations the candidate must be made fully aware that the marks are provisional until they have been finalised by the relevant Examinations Board at its annual meeting, which most commonly occurs in June/July for undergraduates and in the autumn for postgraduate students taking taught modules. Guidance on the examination information students are entitled to can be found at the link below: Privacy Information for Students and Applicants Student Services Academic-Service-Office@nottingham.edu.cn student_registry@nottingham.edu.my Quality-Manual-Enquiries@nottingham.ac.uk Portland Building, University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}