{
    "url": "https://www.nottingham.ac.uk/research/groups/applied-and-behavioural-ecology/index.aspx",
    "content": [
        {
            "p": "Our research focuses on terrestrial and aquatic ecosystems and the challenges they face through pollution, climate stress, and land use change, with a particular focus on questions relating to global food security and sustainable land and water management. We aim to evaluate the impacts of stressors on environmental conditions, biodiversity, and ecosystem functioning, and to develop strategies for mitigating effects. Of particular interest are the pathways of water pollutants in natural environments, alongside the interplay between land-use change and the functioning/resilience of land-to-surface water pathways for both water and carbon. We are also interested in the effects of habitat change on biodiversity and ecosystem functions in tropical terrestrial and freshwater habitats, and strategies for managing agricultural systems more sustainably, including ecological approaches for pest control and carbon sequestration. Our research spans cellular processes, physiology and ecology, and uses a wide array of techniques including field studies, laboratory experimentation, chemical analysis, taxonomy, statistical analyses and modelling. The research undertaken is multidisciplinary and we have active collaborative projects with those from other disciplines within the School of Biosciences, in addition to staff in the Schools of Engineering, Life Sciences and Geography. The university research farm also facilitates multidisciplinary agroecology projects with agronomists, soil, animal and atmospheric scientists and microbiologists. Beyond the university, we also collaborate widely with a range of other universities, NGOs, and industry. Other projects are also underway integrating the physical understanding of pollutant behaviour into locally led solutions to target plastic and other water pollution, ensuring the priorities of the community are embedded. This involves co-developing an innovative and transdisciplinary citizen science toolkit for community driven solutions to address water quality challenges in both the UK and India. We are also exploring the role of citizen science in determining plastic pollution across freshwater ecosystems in addition to monitoring greenhouse gas emissions from small artificial bodies of water to investigate the role of nutrients and carbon in determining emissions. COOK, S., ABOLFATHI, A., GILBERT, N.I. (2021) Goals and approaches in the use of citizen science for exploring plastic pollution in freshwater ecosystems: A review. Freshwater Science 40: https://doi.org/10.1086/717227 PEACOCK, M., AUDET, J., BASTVIKEN, D., COOK, S., EVANS, C. D., GRINHAM, A., HOLGERSON H, M. A., HÖGBOM, L., PICKARD, A. E., ZIELIŃSKI, P., & FUTTER, M. N. (2021) Small artificial waterbodies are widespread and persistent emitters of methane and carbon dioxide. Global Change Biology, 27: 5109-5123. https://doi.org/10.1111/gcb.15762 COOK, S, CHEN, H.L, ABOLFATHI, S, BENDING, G.D, SCHÄFER, H and PEARSON, J.M, 2020. Quantifying microplastic transport in aquatic flows using fluorometric techniques Water Research 170: 115337. COOK, S, OLIVER, P, KING, A, FINNEGAN, R, EGMOND, R, SCHAFER, H, PEARSON, JM, ABOLFATHI, S and BENDING, GD, 2020. Bedform characteristics and biofilm community development interact to modify hyporheic exchange Science of the Total Environment 749: 141397. SAVAGE, JESSICA, COOK, SARAH and YEBOAH, GODWIN, 2021. Tourist Traps: Assessing the Role of Tourism in Sustaining Life Below Water. In: FILHO, WALTER LEAL, ANABELA MARISA, BRANDLI, LUCIANA, LANGE SALVIA, AMANDA and WALL, TONY, eds., Life Below Water. Encyclopedia of the UN Sustainable Development Goals Springer. THORNTON, S.A, COOK, S, ASTIANI, D, HAPSARI, K.A, VARKKEY, H, COLE, L.E, DARGIE, G.C, SJOGERSTEN, AS, ZAWAWI, N.Z and PAGE, S.E, 2019. “Pushing the Limits”: Women in Tropical Peatland Research. Marine & Freshwater Science 71: 170-178. SARAH H. LUKE, ANDREAS DWI ADVENTO, ANAK AGUNG KETUT ARYAWAN, DWI NUGROHO ADHY, ADHAM ASHTON-BUTT, HOLLY BARCLAY, JASSICA PRAJNA DEWI, JULIA DREWER, ALEX J. DUMBRELL, EDI, AMY E. EYCOTT, MARTINA F. HARIANJA, JULIE K. HINSCH, AMELIA S.C. HOOD, CANDRA KURNIAWAN, DAVID J. KURZ, DARREN J. MANN, KIRSTY J. MATTHEWS NICHOLASS, MOHAMMAD NAIM, MICHAEL D. PASHKEVICH, GRAHAM W. PRESCOTT, SUDHARTO PS, PUJIANTO, DEDI PURNOMO, RIZKY RAJABILLAH PURWOKO, SYAFRISAR PUTRA, T. DZULFIKAR S. RAMBE, SOEPRAPTO, DAKOTA M. SPEAR, SUHARDI, DAVID J. X. TAN, HSIAO-HANG TAO, RIBKA SIONITA TARIGAN, RESTI WAHYUNINGSIH, HELEN S. WATERS, RUDI HARTO WIDODO, WHENDY, CHRISTOPHER R. WOODHAM, JEAN-PIERRE CALIMAN, ELEANOR M. SLADE, JAKE L. SNADDON, WILLIAM A. FOSTER and EDGAR C. TURNER, 2020. Managing Oil Palm Plantations More Sustainably: Large-Scale Experiments Within the Biodiversity and Ecosystem Function in Tropical Agriculture (BEFTA) Programme Frontiers in Forests and Global Change 2 SARAH H. LUKE, ELEANOR M. SLADE, CLAUDIA L. GRAY, KOGILA V. ANNAMMALA, JULIA DREWER, JOSEPH WILLIAMSON, AGNES L. AGAMA, MIKLIN ATIONG, SIMON L. MITCHELL, CHARLES S. VAIRAPPAN and MATTHEW J. STRUEBIG, 2019. Riparian buffers in tropical agriculture: Scientific support, effectiveness and directions for policy Journal of Applied Ecology 56: 85-92 Biogeochemistry and biogeochemical modelling Environmental change Plant-soil interactions C26 Gateway Building, School of Biosciences The University of Nottingham, Sutton Bonington Campus Nr Loughborough, LE12 5RD telephone: +44 (0) 115 951 6052"
        }
    ],
    "pdf_files": []
}