{
    "url": "https://www.nottingham.ac.uk/research/groups/nutrient-gene-interactions/index.aspx",
    "content": [
        {
            "p": "There is increasing recognition that nutrients have the capacity to directly regulate metabolic processes through impacting on the expression of enzymes, receptors, hormones and other proteins. As such they can impact on growth, ageing and susceptibility to non-communicable diseases. Our interests span the impact of macro- and micro-nutrients on food intake, tissue differentiation, growth and repair and diseases processes such as atherosclerosis and muscular-skeletal degeneration. A greater understanding of such nutrient: gene interactions should lead to improved nutritional advice and pharmacological interventions to maintain lifelong health and prevent, or delay the onset of, chronic diseases commonly associated with the aging process. Application of molecular techniques it elucidating the impact of nutrients on disease processes. The group has significant experience of applying biochemical, molecular, cell biology and systems biology expertise to problems including: Regulation of hepatic lipid metabolism (funded by MRC in collaboration with Prof Victor Zammit, University of Warwick) – looking at impact of dietary fatty acids on triacylglycerol synthesis and secretion in the liver. Regulation food intake and energy expendiuture (funded by BBSRC)- Interaction between nutrients and specific peptides in hypothalamic regulation of food intake and energy expenditure. Role of micronutrients in regulating cell growth and differentiation. Early life nutrition Microbiology and food safety Animal production Biomaterials: Processing, properties, perception Nutrient gene interactions Developmental Programming of Health and Disease Reproductive Biology Sensory Science centre The University of Nottingham 31 North Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6120 email:andrew.salter@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}