{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Recognising-and-celebrating-Malaysia's-literary-traditions.aspx",
    "content": [
        {
            "p": "Through poetry, prose and drama, Malaysian authors have expressed their view of themselves and their place in the world. Since it emerged in the 1950’s, Malaysian literature in English is now well established; adding threads and colour to a transnational literary tapestry and providing an important perspectives on post-colonial society. We are proud to highlight two of our academic staff in the School of English who are contemporary leaders in this literary tradition. As an established poet and writer in his own right, Emeritus Professor Malachi Edwin Vethamani has devoted much of his academic career to curating and promoting Malaysian literature written in English since it emerged in the 1950s. Dr Shivani Sivagurunathan, Assistant Professor, continues the tradition of writing Malaysian literature in the English language. She’s an up-and-coming young author whose unique style explores multicultural identities in Malaysia through a metaphysical lens. At the heart of Prof Edwin’s work is the notion of literature as a part of national identity. His work has been truly pioneering since he has single-handedly charted the landscape of Malaysian creative writing in English. Many of these works had hitherto remained unexplored. His opus magnus includes the first ever bibliography of Malaysian literature in English over the past 70 years (2015), and the most recent anthologies of Malaysian poetry (2018) and short stories (2020) in English, both covering a period of 60 years. These books are cultural artefacts that preserve vibrant Malaysian voices and his research has made a major contribution, not only to South East Asia, but also to the worldwide theme of post-colonial studies. It’s no wonder that he’s been described as “a literary impresario”. Dr Shivani’s creative writing heralds a distinctive new voice. As a Malaysian of Sri Lankan Tamil origin, she often uses her work to unpack her own sense of identity, but also touches on a diverse array of themes. Her writing engages with multicultural Malaysia, its post-colonial history and even the nature of the mind. It retains a thoroughly Malaysian flavour but is also infused with her first-hand experiences with spirituality and metaphysics. She enjoys blurring the lines between the real and the fantastical—in one of her stories, her characters talk to bats and bake cakes to cure cancer. It’s an unorthodox style that she terms Malaysian mystical fiction, a bold re-imagination of a genre that enlivens the literary landscape. Malaysia’s landscape of writers and themes mirror the socio-political trajectory of the nation. To read Malaysian literature is to listen to the stories of a nation and its people. Our researchers are steering this scene, at the same time as ensuring that those stories written by others can passed through the generations. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}