{
    "url": "https://www.nottingham.ac.uk/research/groups/fruit-and-vegetable-crops/index.aspx",
    "content": [
        {
            "p": "Fruits and vegetables are high value crops important to human diet and health and global food security. The research on fruit focuses on tomato as a model for understanding the development and ripening of fleshy fruits. In vegetables, our primary focus is on resource-use and edible quality of leafy Brassica crops. In both cases work is jointly funded by both industry and RCUK. Work on other crops includes collaborations with the Nottingham Malaysia campus for genetic analysis of oil palm, date palm and other tree species. Also on underutilised crops through Crops for the Future Research Centre; a major international project funded by Government of Malaysia. The Seymour lab aims to understand the molecular, genetic and epigenetic basis of tomato fruit development and ripening. Tomato is the established model for understanding fruit ripening and a systems approach is being used to identify regulatory genes controlling shelf-life to reduce postharvest waste and improve health benefits, without compromising flavour. Martin Broadley is investigating resource capture in brassica and biofortification of this crop. Work by Sean Mayes is focused on QTL mapping in major and minor crops and understanding the genetic basis of important crop traits, while Colin Black is investigating resource capture in crops in the semi-arid tropics. Understanding the mechanistic basis of fruit development and ripening for improved quality and reduced post-harvest waste (Graham Seymour) Resource capture and biofortification of Brassica crops (Martin Broadley) Application of biotechnology and breeding to underutilised crop species using bambara groundnut as an exemplar (Sean Mayes). Abiotic and Biotic Stress Fundamental Research Using Model Plants Models to Crops Cereal Crops Centre for Plant Integrative Biology - CPIB Nottingham Arabidopsis Stock Centre Crops for the Future Research Centre - CFFRC The University of Nottingham C14 Plant Sciences, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6323 email:graham.seymour@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}