{
    "url": "https://www.nottingham.ac.uk/research/groups/functional-biointerfaces/index.aspx",
    "content": [
        {
            "p": "This website is the virtual home of the research group led by Dr Mischa Zelzer. In the Functional Biointerfaces group we are exploring the design of biologically active and responsive surfaces and materials to interface cells with man-made devices. The overall aim is to advance the bio-material interface design and provide cells and materials at this interface with the ability to ‘cross-talk’ to each other. This work has implications for cell-instructive materials, the interfacing of biomaterials and biomedical devices in living tissue and therapeutic applications. Research in the Functional Biointerfaces group is themed around the need to improve both understanding and control over the interactions of biomaterials and biomedical devices with living tissue. Key concepts include the improvement of the efficacy of healthcare technologies such as medical implants, development of novel treatment modalities such as stem cell therapies and the exploration of advanced concepts for new healthcare technologies such as the effective interfacing of neurons with artificial materials. We are a multidisciplinary research group that relies on researchers with various backgrounds to work in a dynamic, diverse and highly interactive scientific community. Key expertise areas are We are using physical and chemical methods to modify the surfaces of biomaterials. Physical methods include spin coating and dip coating of polymers. Chemical methods are adapted for the requirement of each project and include solid phase peptide synthesis from 2D surfaces, coupling of ligands and surface initiated polymerisation. A wide range of analytical techniques to characterise biomaterial surfaces and biointerfaces are available to the group. Physical characterisation and imaging is performed by AFM, SEM, TEM, QCM and ellipsometry. Chemical characterisation techniques include ToF-SIMS, XPS, WCA, IR and ATR. Information on the spatial distribution of compounds in a biological sample is critical to understanding the performance of biomaterials and the uptake of drugs into cells and tissue. We are interested in developing and applying 3D depth profiling via ToF-SIMS to obtain label free chemical images of biological samples. We have expertise in preparing peptide materials, including short self-assembling peptides and oligopeptides that are grafted from the surfaces through SPPS protocols. Polypeptides are prepared via N-carboxyanhydride polymerisation to obtain longer peptide chains that can be designed into random copolymers or block-polymers with specific secondary structures and self-assembling properties and enzyme responsiveness. Cell-material interactions are investigated through collaborations using various cell lines including embryonic stem cells (Lee Buttery, Chris Denning), mesenchymal stem cells (Virginie Sottile, Matt Dalby) and neurons (Noah Russell). We are interested to study cell responses such as adhesion, proliferation and differentiation on the functional surfaces we generate using a variety of cell assays. Zelzer Group Blog The University of Nottingham Boots Science Building, University Park, Nottingham, NG7 2RD telephone: +44 (0) 115 74 84519 email:M.Zelzer@nottingham.ac.uk/a>"
        }
    ],
    "pdf_files": []
}