{
    "url": "https://www.nottingham.ac.uk/research/groups/hosttumourinteractions/index.aspx",
    "content": [
        {
            "p": "The Host-Tumour Interactions Group aims to understand unique molecular mechanisms responsible for immune deviation in patients with advanced cancer. Identifying these key targets permits us to develop the next generation of immunotherapeutic strategy. -- Andrew M Jackson & Poulam Patel, Head Host-Tumour Interactions Group In patients with advanced cancer the immune system is often underrepresented, suppressed or misdirected. However at present only a limited understanding of the molecular mechanisms responsible for immune-suppression exists. Our research focuses on identifying how tumours suppress immunity with a view to devising novel ways to restore immune function. We aim to understand the role played by intracellular signalling pathways on the relationship between Dendritic Cells (DC) and T-cells. 1. Targetting intracellular signalling pathways in Dendritic Cells Identified immunoregulatory roles for signalling pathways including ATM-kinase, MEK-ERK and p38-MK2 MAPK in DC. Targeting these pathways in DC influences CD4+ T-cells, selectively promoting Th1 and Th17 responses. The role of ER-stress UPR are under investigation (collaboration with Jane Goodall, University of Cambridge). 2. Monitoring the immune system in cancer Aim to develop robust, sensitive and accurate assays for immune function that can rapidly be conducted in small samples of unfractionated blood. We are focussed on three areas of immune interest: i. Treg : Th17 balance ii. Dendritic cells (BDCA-1+ myDC, BDCA-2+ pDC, slanDC) iii. MDSC (IL-10 / Arginase expression by myeloid and granulocytic MDSC) 3. Aging and Immunity (Immunosenescence) Test the hypothesis that the balance of regulation and inflammation alters with healthy aging by measuring the abundance and function of nTreg, iTreg, Th1 and Th17 in a cross-sectional study of healthy individuals. A collaboration with the Intelligent Modelling & Analysis Group (Prof. Uwe Aickelin) at Nottingham aims to develop advanced software tools for objective, automated analysis of complex functional flow-cytometry data (e.g. whole-blood assay of leucocyte sub-populations). The group comprises post-docs, technicians, PhD students, and clinical research fellows and derives its funding from the MRC, Wellcome Trust, industry (X-BioCell Ltd.), Matt’s Trust Fund for Cancer Research and the University of Nottingham. Our work has been published in leading peer reviewed journals including PLoS One and Journal of Immunology. Please see individual group members' profiles for publication details. Group members We are constantly seeking talented and enthusiastic new members for the team. Informal enquiries should be addressed to Dr Andrew Jackson. The University of Nottingham Division of Oncology, School of Medicine Nottingham City Hospital Hucknall Road, Nottingham NG5 1PB, UK telephone: +44 (0) 115 82 31860 email:andrew.jackson@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}