{
    "url": "https://www.nottingham.ac.uk/research/groups/paediatricneurosciences/index.aspx",
    "content": [
        {
            "p": "To pursue and support paediatric neuroscience research activities, both with colleagues in the University of Nottingham, in Nottingham Children’s Hospital at the Nottingham University Hospitals NHS Trust and beyond. We are also committed to research training and support and supervise undergraduate studies for BMedSci, BSc, BM BS degrees, and post graduate studies for MSc, PhD, and MD qualifications. Paediatric neurosciences underpin child development and disorders of child development. The central nervous system (brain and spinal cord) and peripheral nervous system account for acute illness and long term conditions in 25-33% of paediatric inpatients and outpatients. From preterm infants to adolescents, advances in paediatric neurology have made a huge contribution to understanding and health care. Many of the advances have been achieved by non-neurologists, e.g. neonatologists, paediatric oncologists, developmental psychiatrists, neurosurgeons, and others, indicating the far reaching and diverse influence of paediatric neuroscience. We are involved in clinical trials and systematic clinical audit and service evaluations. The diagnosis and management of epilepsies in children and young people is a very challenging area, and the Care Quality Commission has recently funded our national “Epilepsy 12” audit for a second round. We have been involved in clinical trials and assessments of new treatments. We have led the development of innovative autonomic function testing in children and young people, and systematic evaluation of the investigation and management of transient loss of consciousness. We have been involved in trials and in developing a national teaching programme for paediatricians. We host a nationally funded clinic for this rare life-shortening disease, and have been leading an international consortium in developing a neurology tool for clinical assessment. We hope to use this in trials in the future. We are working with colleagues in adult neurology in Nottingham and in paediatric neurology in the UK to study the disease using 7T MRI, and the natural history in a prospective cohort study. Projects Some key publications Our group is sited at the Queen's Medical Centre where our research group and laboratory facilities are located in an embedded unit within the Children’s Hospital. Group members Division of Child Health, Obstetrics and Gynaecology School of Medicine The University of Nottingham Queens' Medical Centre, E Floor, East Block Nottingham, NG7 2UH telephone: +44 (0) 115 924 63328 email:william.whitehouse@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}