{
    "url": "https://www.nottingham.ac.uk/researcher-academy/news/latest-news/looking-back-on-the-pint-of-science-festival.aspx",
    "content": [
        {
            "p": "Alexandra Kremmyda, PhD student in Food Sciences, reflects on her experience of organising the Pint of Science festival as a leader of the Creative reactions team. The Pint of Science festival is organised every year by students around the world and aims to communicate science with the public in an entertaining and informative way. Being part of the Pint of Science team has been a key in developing my communicational and organisational skills. This year I was leading the Creative reactions team, which encourages the collaboration of two fascinating and different worlds, science and art. One of the first things I had to do as a team leader was to set up an online collaboration between UK-based artists and Brazilian scientists! The same year the Nottingham team organised the first face-to-face Pint of Science festival after the Covid-19 era. This time I was asked to organise my team and set up a face-to-face gallery exhibition and a closing night performance, based in Nottingham. Being in this role was a big challenge for me. What I tried to achieve during my time as a team leader was to bring together my team, identify the strengths and show my appreciation for the excellent work the team put into our common goal. Organising a gallery and a performance event means that there is a big checklist, many tasks and details to think about and each month there are different priorities and goals to set up before the big day! I had to make sure everybody was updated, all questions answered, and problems solved or discussed with the relevant people. During my role, I felt that I had to be flexible, creative and decisive. However, despite all challenges, seeing smiley faces in both the audience and the artists on the day of the events was so fulfilling that I forgot all the stress and difficulties. UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": []
}