{
    "url": "https://www.nottingham.ac.uk/research/groups/comparative-medicine/index.aspx",
    "content": [
        {
            "p": "Translating scientific and clinical knowledge of human and veterinary medicine to advance the well-being of people and animals. Comparative medicine seeks to promote the health and welfare of animals and people by exploiting advances in clinical and scientific knowledge of diseases arising in animals and humans. By identifying where disease processes are similar in animals and people, therapies developed for human medicine may be applicable to treat the disease in companion animals. Similarly an understanding of disease processes in animals can identify novel approaches to prevent and or treat pathogenesis in animals and humans. At Nottingham, researchers with expertise in human and veterinary diseases collaborate to ensure advances can be applied as soon as possible. We apply the most advanced molecular and genomic technologies including next generation sequencing, epigenomics, metabolomics, molecular biology. Our research efforts are supported by having expertise in bioinformatics, biostatistics and bioethics within the School of Veterinary Medicine and Science. At present our research strengths are thematically organised, studying comparative aspects of 1. Cancer Pathogenesis 2. Cardiovascular Disease 3. Musculoskeletal Disease 4. Age-related Disease Future directions We aim to consolidate Nottingham’s position as the leading national centre for the Study of Comparative Medicine, linking with the Centre for Evidence Based Veterinary Medicine (CEVM) and existing centres of biomedical research excellence in human medicine at the University of Nottingham, the Queen’s Medical Centre and Royal Derby hospital. We will extend our client and practice-based network of spontaneous disease in companion animals and use this as a unique opportunity to secure funding from research councils, industry and other stakeholders to study the one medicine of the future – Comparative Medicine. Plos One Article Oxford Journal Article Science Direct Article The University of Nottingham School of Veterinary Medicine and Science Sutton Bonington Campus, Leicestershire, LE12 5RD telephone: +44 (0) 115 951 6116 email: Email our Research Theme Leader"
        }
    ],
    "pdf_files": []
}