{
    "url": "https://www.nottingham.ac.uk/research/groups/law-and-interdisciplinarity/index.aspx",
    "content": [
        {
            "p": "Law and Interdisciplinarity Discussion Group at the School of Law provides a forum for discussion and exchange of ideas regarding research projects or publications which combine legal insights with those from other disciplines, primarily from the social sciences and the humanities. Law and Interdisciplinarity Discussion Group connects legal scholars from the School of Law with researchers from other disciplines within the University of Nottingham (for example, politics and international relations, business and economics, sociology, cultures, media, and languages etc), to enable them to benefit from each other’s expertise, for the purposes of advancing individual or collaborative research projects or publications, and to receive feedback on their completed and ongoing works. The monthly meetings take place in a hybrid format and invite discussion on a range of theoretical and methodological challenges found at the intersection of law and interdisciplinarity. Thus, our Law and Interdisciplinarity Discussion Group aims to foster the development of cutting-edge research through a variety of meeting formats, for example, individual or joint presentations delivered by its members or external guest speakers, work-in-progress seminars, roundtable discussions, book club etc. Dr Sofiya Kartalova is a Teaching Associate at the School of Law of the University of Nottingham. Prior to joining the University of Nottingham in January 2024, Sofiya spent three years working as a Postdoc at the Department of Public Law at the Max Planck Institute for the Study of Crime, Security and Law in Freiburg im Breisgau, Germany. In 2020, Sofiya successfully defended her doctoral thesis at the Faculty of Law at the University of Tübingen in Germany. Dr. Sofiya Kartalova specialises in the interdisciplinary study of EU constitutional law and public security law. Thus far, Sofiya has explored the potential of insights from linguistics and from the social sciences to enrich doctrinal legal analysis. Law and Interdisciplinarity Discussion Group was officially established at the School of Law in the beginning of July 2024 by Dr Kartalova. Dr. Sofiya Kartalova is the founder and convenor of this Group. The group comprises a total of 41 members (as of August 2024), drawn from the School of Law and various other disciplines within the University of Nottingham. Contact Dr Kartalova, if you would like to join Law and Interdisciplinarity Discussion Group as a new member, or if you would like to register to attend one of its meetings, in person or online. The group also welcomes expressions of interest from scholars, experienced in the field in law and interdisciplinarity, to remotely participate in our activities, or from research institutions, to build strategic partnership on a domestic or international level. Please bear in mind that membership requests can only be made by PhD candidates or academic staff of the University of Nottingham, through their individual institutional email. Further, registration requests for attendance of meetings must be made through an institutional email, whether from the University of Nottingham or from another higher education or research institution in the UK or abroad."
        }
    ],
    "pdf_files": []
}