{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Anita-Chakrabarty.aspx",
    "content": [
        {
            "p": "My research is about understanding consumers, which is the foundation of marketing. Specifically, my work is about why consumers buy, what they like or don’t like, how they behave towards certain products or company actions, and what influences them. My current research examines organisation’s and individual consumers’ acceptance of biocoal, an alternative green and sustainable fuel or energy source. I’m investigating how factors such as convenience and practicality, cost and availability, amongst other things, influence ct their acceptance.This is part of a multidisciplinary research project, which received funding from the Newton-Ungku Omar Grand Challenge initiative called Waste to Wealth. My findings will help to formulate strategies to encourage use of biocoal in Malaysia. One of the biggest challenges is encouraging Malaysian companies to respond to requests for interviews or to complete questionnaire surveys. Perhaps market research is not considered by them to be as valuable as other forms of research. I am currently co-supervising a student who is examining how actors in the wider organisational network innovate services or products by working together. This is an interesting study because it examines co-creation efforts between main and peripheral actors for end products and services. We’ve also been collecting data for case studies on how firms have altered their marketing strategies during the C0VID-19 pandemic. It is widely recognised that non-renewable fossil fuel is detrimental to the environment. My research aims to provide a way to assist greater adoption of the waste to fuel idea for companies, and acceptance of a sustainable fuel source to communities. This indirectly enhances individual and community health and wellbeing. Furthermore, funding organisations now favour multidisciplinary research in waste to wealth and sustainability efforts, and this is also one of the major thrusts for the United Nations sustainability development goals. I was very happy to be accepted for a project for the Ministry of Health, specifically the Traditional and Complementary Health division, funded by the World Health Organisation. The outcome of the project was a Consumer Guideline for the use of Traditional and Complementary Health products and services. This guideline also hopes to help reduce consumers believing in fake claims and hoaxes by many unscrupulous producers and service providers. The World Health Organisations are interested in adapting our consumer guideline for other countries. As the pandemic has clearly shown us, individuals thrive and problems are resolved when there is collaboration. The outcome is always greater than the sum of what those individuals can achieve alone. In the process, we learn from each other and in turn, this enriches our knowledge for future research. In the top ranking journals, we often find papers written by multiple authors with interdisciplinary expertise or from different countries. This is one of the keys to a successful academic career. First, I would advise them to find their community and develop relationships with others. By community, I mean researchers in the same area or discipline. Second, is to ask questions and not be afraid to ask for help. Patience is a key requirement as early career researchers need to gain expertise in their chosen area. A research career does not mean publishing on your own. It means becoming the ‘go to expert’ so that others approach you for your knowledge and skills on a certain subject matter. My personal motto has always been to work for other experienced researchers to gain experience, and in this pursuit be the humble learner. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}