{
    "url": "https://www.nottingham.ac.uk/research/groups/the-treaty-centre/index.aspx",
    "content": [
        {
            "p": "The Treaty Centre was founded in 1983 by Michael Bowman and David Harris. Its objectives are to foster, conduct, and disseminate research in to the law of treaties and the practice of treaty-making. The centre was established following a generous grant of £10,000 from the University for the development of resources on international law. The centre makes an award each year to the best performing student on the Law of Treaties LLM module and the best dissertation on a treaty related topic. Any enquiries related to the Treaty Centre should be directed to Dino Kritsiotis, Professor of Public International Law (dino.kritsiotis@nottingham.ac.uk). A number of large-scale, often collaborative research projects are ongoing within the centre's major areas of substantive interest: Highlights in this area were undoubtedly the two major international workshops held in Nottingham in September 2012 and London in January 2013. Sessions were chaired by Dino Kritsiotis and Michael Bowman and involved presentations from leading academic, several highly promising scholars from both the UK and abroad, as well as jurists with extensive experience. A number of major works have recently been produced by members in this area, including Sarah Dromgoole's Underwater Cultural Heritage and International Law (2013 Cambridge University Press). A series of essays have been published based on presentations given by members of the Centre on the role of institutional arrangements in international environmental treaties. The essays were published in a special issue of the International Community Law Review (Vol 15, Issue 1, 2013). They include studies of the role of plenary political bodies with regard to non-compliance with treaty obligations, and of the question of institutional governance viewed from an ecological perspective. Centre members have published numerous works on the question of climate change in recent years, and two PhD students are nearing completion: In 2012, Tom West was awarded the 2012 Simon Bell prize for student achievement in the field of environmental law for his dissertation entitled, 'Environmental justice and international climate change legislation: a cosmopolitan perspective'. School of Law Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD +44 (0)115 951 5700"
        }
    ],
    "pdf_files": []
}