{
    "url": "https://www.nottingham.ac.uk/research/researchwithus/fellowships/internally-funded.aspx",
    "content": [
        {
            "p": "You've got the skill. You've got the passion. You've got the ambition. Join us. Fellows have exciting opportunities to become a research leader at a world top 100 university* that’s 7th in the UK for research power**. *QS World University Rankings 2023; **according to REF2021 analysis by Times Higher Education Join our pioneering research fellows and get the generous funding, specialist support and unique opportunities you need to be a research leader. Our fellows are essential to our mission of delivering exceptional research that transforms lives in the UK and across the world. up to three years’ independent research funding, covering salary costs the link to a permanent academic post, subject to performance funding for research expenses childcare costs access to mentoring, career development and networking with the wider fellowship community Fellows join a university with a diverse, thriving community and a reputation for transformative discoveries. We recognise that exceptional people come from many backgrounds, with diverse career paths and circumstances that are as individual as you are. We are committed to an inclusive and dynamic research environment, and welcome applications from those wishing to work part-time to meet personal responsibilities. We are especially interested in supporting those from Black and Asian backgrounds. You must discuss your research proposal with your host school or faculty, and you must have been awarded your PhD or equivalent, such as a postgraduate MD/DM for clinical application, to apply. We are flexible with start dates but it is anticipated that the next cohort of successful fellows will start in 2026. For enquiries about the scheme, please contact the Fellowships team: fellowships@nottingham.ac.uk. Fellows are essential to our mission to deliver exceptional research that transforms lives in the UK and across the world. They are the research leaders of tomorrow, working with inspirational pioneers from across disciplines to find solutions to complex global problems. We have two schemes, each offering the same package of support: Anne McLaren fellowships are aimed at outstanding female postdoctoral researchers in science, technology, engineering and medicine, who are at the early stage of their academic careers and wish to establish a research career in the UK Nottingham Research fellowships are aimed at outstanding postdoctoral researchers who are at the early stage of their academic careers from all academic disciplines represented at the university Both schemes are open to external – including international – and internal candidates. Candidates must have been awarded their PhD – or equivalent such as postgraduate MD/DM for clinical applicants – prior to the closing date for registering interest in the scheme. This scheme is aimed at early career researchers, and candidates who do not normally have more than eight years' post-doctoral experience. However, there are no eligibility rules based on years of post-doctoral experience as this doesn’t allow for variations of career paths across disciplines. Candidates will be assessed on their quality, potential, trajectory and track record, relative to their career stage. We invite applications from all academic disciplines across the university. Candidates for the Anne McLaren fellowships must be pursuing a career in a STEM subject. Female researchers are typically under-represented in STEM subjects and female applicants are strongly encouraged. Candidates for the Nottingham Research fellowships can be from any academic discipline across the university. Candidates should be able to demonstrate: Part-time appointments will be considered on a pro-rata basis. Candidates are not normally expected to have a permanent position, as they may be considered to have achieved the aims of the scheme already. The University of Nottingham will act as sponsor for any candidate who does not have the right to work in the UK. For more details on what makes a good application, details of current fellows and the characteristics of successful fellows, meet some of our fellows and explore what makes a good candidate. You can also find answers to the most frequently asked questions. We recognise that exceptional researchers come from a diverse range of backgrounds and career paths and we embrace diversity across our research community. Find answers to the questions we get asked the most regarding fellowships at the University of Nottingham. \"For my areas of focus, Nottingham is unbeatable for its world-class facilities\" — Anne McLaren Research Fellow, Pearl Agyakwa Contact us about our fellowships. How we support external fellowships. Results from the 2021 Research Excellence Framework (REF2021) reaffirm Nottingham as among the best universities in the UK for the strength of our research. Back to the top"
        }
    ],
    "pdf_files": []
}