{
    "url": "https://www.nottingham.ac.uk/research/groups/ceacs/index.aspx",
    "content": [
        {
            "p": "The CEACS facilitates innovative research into and critical debate on cultural thinking and practices related to China, Taiwan, Japan and South Korea. The Centre for Contemporary East Asian Cultural Studies (CEACS) was founded in March 2012. In 2018, CEACS joined the University of Nottingham’s Asia Research Institute and became one of the research centres that the institute hosts. CEACS contributes to the university’s overall strategy to expand and develop Asia-related research. CEACS members contribute to a number of the University’s Research Priority Areas including Languages, Texts and Society; Creative and Digital; and Rights and Justice. CEACS understands ‘East Asia’ broadly, as a geographic region, a cultural imaginary and a critical method. East Asia includes national, subnational, regional, transnational and diasporic East Asian communities and cultures. CEACS recognises the transnational nature of East Asia and pays meticulous attention to inter-regional and intra-regional cultural flows. CEACS embraces interdisciplinary research. It understands culture in the broadest possible sense. It recognises the intersection of culture with politics, economy, law, geography and society. It also acknowledges the political nature of culture and the cultural mediation of politics. In encouraging interdisciplinary research, CEACS aims to facilitate a decolonial and anti-hegemonic research culture based on conversation and collaboration. Whilst CEACS embraces the contemporary critical turn within the humanities, it also seeks to engage critically with differing cultural perspectives associated with traditional and contemporary East Asian cultural thought and practice. The Centre works closely with cultural institutions, creative industries and cultural practitioners to support the public dissemination of knowledge about East-Asian cultures within an international context. Through its work the Centre also Through its work, the Centre seeks to contribute to the activities of cultural institutions, practitioners and related communities of interest. Drawing on established expertise at the University of Nottingham’s campuses in the UK, China and Malaysia, CEACS provides a unique focus for interdisciplinary research networking, international mobility, knowledge transfer and public impact involving scholars, research students and practitioners engaged in the study of East-Asian cultures both within East Asia and beyond. The centre welcomes offers of funding to support its activities from interested individuals and institutions. Lonán Ó Briain is currently working on RadioAsiaPacifika: Cultural Broadcasting in the Asia Pacific region, a project funded by AHRC. Xiaoling Zhang has succeeded in winning research grants from the British Academy, the Arts and Humanities Research Council, Chiang-chin Guo Foundation, the British Council and the Chinese National Soft Science Fund. Thomas Barker was Visiting Research Fellow at the National ChengChi University (NCCU), Taiwan. 2 April – 30 June 2018. Asia Research Institute Centre for Critical Theory Nottingham Confucius Institute Institute for Screen Industries Research Centre for Research in Visual Culture Taiwan Studies Programme Institute of Asia and Pacific Studies, University of Nottingham, Malaysia campus Study with us Please see our events section for all upcoming, recent and past events. News and events The University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 951 5757 or 84 66437 email:hongwei.bao@nottingham.ac.uk or ting.chang@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}