{
    "url": "https://www.nottingham.ac.uk/research/researchwithus/wellcome-prime-scholarships/current-scholars.aspx",
    "content": [
        {
            "p": "How to apply for Wellcome Prime funding. About two weeks after the start of human development three main lineages are specified from the pluripotent epiblast. This event sets the foundation for the formation of about 200 different specialized cells in the adult. How these early lineages are specified in human has been primarily studied using mouse embryos as model. However recent work from our lab, and others, shows fundamental differences between human and mouse early embryos. We showed that expression of genes regulating the formation of gut and germ cell progenitors are shared between humans and pigs, but not mice. This new work sets the foundation for developing the pig embryo as a model for investigating human development (Kobayashi et al., 2017, Nature, 546(7658):416-420). We want to extend these studies to other lineages and establish key developmental principles in pig embryos that can inform early lineage decisions in humans. Our laboratory is the first to demonstrate the relevance of this model system for humans and our aim is to continue to lead the research efforts in this area. When the Ebola crisis hit West Africa in 2014, aid agencies and governments around the world scrambled to contain the outbreak. Writing in the New Statesman in October 2014, the founder of Translators without Borders highlighted a factor that was being routinely overlooked in efforts to stop the spread of the disease: “People need to know how to prevent infection and what to do if someone around them catches it. The problem is that – unbelievable as it may seem – most information about how to prevent Ebola is not available in the languages understood by the people most at risk.” Translating information into languages that local people can understand is key to successful healthcare communication, particularly where infectious disease prevention or vaccination programmes are concerned. In regions like West Africa, where around 885 different languages are spoken and information provided in the official languages of French or English caters only to the educated minority, it is particularly pressing. Yet the need for translation is rarely built into the strategic plans of aid agencies or governments. This project aims to raise awareness of the importance of translation in healthcare in Africa and to encourage wider take-up of existing best practice. Influenza A viruses occur as different subtypes (e.g. H3N8) named according to the proteins that project from their surface (haemagglutinin, H, and neuraminidase, N). The majority of the known subtypes circulate in waterfowl without causing disease (indicating that wild ducks are a ‘reservoir host’). Occasionally, certain subtypes emerge and become established in other hosts, notably chickens, pigs, horses and people, and recently, an equine subtype was transmitted to dogs. What allows certain subtypes to jump to a new host and cause disease is not understood. Recognition of relevant receptors on host cells is one factor. However, there is mounting evidence that differences between species in cell signalling pathways, which determine how cells respond to virus infection, play a key role. This project will focus on species differences in one of these pathways, called the PI3K pathway, which interacts with a highly variable virus protein called NS1. Understanding how different interactions between host pI3K pathways and influenza virus NS1 proteins are responsible for interspecies transmission will enable better prediction of whether emerging viruses have the potential to cause future pandemics. Where possible, disease elimination through vaccination is safe, effective and cheap, and the Wellcome Trust has a significant interest in generating protective vaccines for Neglected Tropical Diseases. There is currently no effective vaccine against the human disease sleeping sickness, caused by African trypanosomes – extensive antigenic variation of the parasite's major surface protein enables it to evade host immune recognition. My lab has recently identified 110 novel surface proteins that are unique to the parasite, exposed to the extracellular space and predicted to be essential for survival. These molecules are also invariant, raising the possibility that one or more could be exploited for the development of a vaccine. I propose to investigate this possibility, and identify functionally-relevant antigens that offer pan-protection across parasite strains encountered in Africa. Through a metagenomic project, the Wellcome Prime Scholarship will allow us to look at how antigen repertoire changes through space and time, and what effect it has on disease protection. This will enable us to narrow vaccine search space and invest our resources in the most promising targets. Candidates identified during the Scholarship will then be tested in vitro and in vivo, and successful ones will follow established pipelines for vaccine development and clinical trials. For the cells of our body to function they must establish and maintain specialised internal structures (organelles) whose function is essential for life e.g. energy production. Transport of these organelles is vital for their function, and transport blocks result in many diseases e.g. Cystic Fibrosis, heart disease, neuro-degeneration and cancer. To allow organelle transport, cells have evolved a (protein-based) machinery termed the cell-skeleton that can move organelles. Researchers consider that cell-skeleton microtubule and actin tracks and their associated motor proteins regulate intracellular transport in a manner akin to the transport system of a developed nation. This model (referred to as the ‘highways and local roads’ model) suggests that microtubules are tracks for fast long-range transport (highways) between the cell centre and periphery driven by organelle associated motors, and actin filaments are tracks for short-range transport (local roads) driven by myosin motors. Accordingly microtubules and actin form long and short tracks in cells, respectively. Contrary to this, using pigment granules of skin pigment cells as a model, we have discovered that the actin system can efficiently drive long-range organelle transport without assistance from microtubules. This project aims to unravel how this novel transport process works. The genome is the complete ordered set of DNA bases found in almost all cells and carries the code to generate a complete organism and regulate its function. The human genome was sequenced in 2001 costing in excess of 1 billion dollars. Now it is possible to sequence a human genome for as little as $1,000, yet the exact definition of a ‘complete’ genome, even for humans, is complex. Genomes are sequenced by shattering DNA into numerous tiny fragments, sequencing these at great depth and then reassembling these much like a jigsaw puzzle. Where these pieces are extremely similar to one another, the jigsaw becomes impossible to complete. Recent advances in in sequencing technology use nanometre sized pores to separate and sequence DNA and allow ‘ultra-long’ reads greater than 100,000 bases. These long reads enable us to generate near complete genome assemblies by spanning repeated sequences. Alongside this, using methods developed at Nottingham it is possible to target sequencing to specific regions of a genome which contain gaps allowing economical and time effective completion of genomes on any scale. These methods will have broad application to fields such as medicine, biology, disease and infection and many other fields. Although it has been demonstrated that iminosugars are important therapeutic targets for a range of diseases, difficulties associated with synthesising these compounds has led to a bottleneck and has severely hampered the development of this compound class as key pharmaceutical leads. This research aims to develop a method to synthesise iminosugars from readily available and sustainable sugar feedstocks, using designer enzymes. We rely heavily on our senses when navigating and interacting with the world. However, sensory information is often noisy and incomplete. How the brain deals with this uncertainty when forming decisions and planning actions is a fundamental question in contemporary sensory neuroscience. An influential idea is that the brain performs a form of Bayesian inference, integrating noisy sensory information with prior knowledge to optimise performance on a given task. In some instances, these ‘priors’ likely reflect innate knowledge of stable statistical regularities in the environment. However, it is clear that humans can also rapidly learn approximations of the statistical properties of recent sensory input. One in six people will have a stroke during their lifetime. A key goal of my research group is to investigate factors that lead to poor recovery following stroke. This project will examine how infection, most commonly urinary tract infections or pneumonia, during recovery from stroke increases disability. We have data that shows patients who develop an infection in the weeks-months following a stroke have worst disability. For the patient this could be the difference between being able to walk unaided and not being able to take care of themselves without assistance. Infection is common in stroke patients, but giving preventative antibiotics does not appear to be of benefit. We want to find out what is changing in the brain to reduce recovery. We think that cells in the brain that respond to infection are altered due to the stroke. This means that when the person then gets an infection these cells over react and cause inflammation in the brain. This inflammation may interfere with the recovery processes which are happening in the brain. We will examine how this is happening and develop ways to improve recovery of patients. During cell division, genetic material must be faithfully transmitted to offspring. In eukaryotes, this is achieved by a multi-protein machine called the kinetochore, which links individual chromosomes to moving filaments. One group of parasites that cause severe tropical disease build kinetochores from different components to those in animals, plants and fungi. In addition, they move >100 chromosomes with only a handful of kinetochores. How they do this is an important question in evolutionary cell biology, and also has the potential to identify drug targets that are essential to the parasite but not present in the host. We have recently characterised a new family of essential proteins that attach parasite kinetochores to division filaments. The next question is how this non-canonical attachment is regulated and maintained. My lab has developed new genetic systems that enable us to screen for modifiers of chromosome segregation and for the molecular motors that move chromosomes once attached. These new technologies offer really exciting new prospects for parasite research, but are technically demanding. The Wellcome Prime Scholarship will provide me with teaching cover for 2 years, enabling me to spend more time on exploitation of these new systems in the lab. Pipecolic acid is a key pharmaceutical intermediate found in wonder drugs such as antibiotics (actinomycin analogues), anaesthetics (ropivacaine), and immune suppressant (rapamycin), with vast medical applications. The importance of this molecule has attracted significant attention in the scientific community and several methodologies for its production, ranging from traditional synthesis to microbial cell factories have been developed. The market value of pure pipecolic acid is around £500 per gram and efficient strategies for its preparation are highly desirable. Using microorganisms to make valuable molecules is a benign alternative to synthetic methods, however the productivity is rarely as efficient and, especially in the case of pharmaceutical building blocks, there is the concern that traces of biological contaminants may go undetected into the final product. Here we propose an alternative approach to its manufacturing which mimics an artificial cell but it performed cell-free, and is continuous. The naturally abundant amino acid L-lysine is the starting point in our synthesis and we will convert it into pipecolic acid by combining two enzymes which will be immobilised and packed into a column reactor and catalyse a two-step reaction. L-lysine will flow in and pipecolic acid will flow out in a completely sustainable process. In the first ten years of life the way that we deal with multisensory information changes dramatically. Previous research in my lab has shown that when we have to integrate information from different senses (eg when watching and listening to someone talking), children rely more on auditory information whereas adults rely more on visual information. In the current project we will explore whether this is also the case when segregating information from different senses to avoid being distracted (eg ignoring someone talking nearby when reading a book). We will also investigate the impact of how relevant the visual and auditory information is. This research will help us to understand what is driving the considerable changes in dealing with information from multiple senses that typically take place during childhood. Sudden hearing loss is a rare medical condition that needs urgent treatment. We do not have good information on how many people experience sudden hearing loss each year and how many people are living with this condition. Current guidelines say that GPs should send patients whose hearing changes suddenly to hospital. We do not know if people go to their GP with this condition and, if they do, if their GP sends them to hospital and what treatment they then receive. The UK is a world leader in conducting research using large databases of information about how patients are diagnosed and treated in GP practices and hospitals across the country. Nottingham is home to the world’s leading researchers in this area at the University of Nottingham. It is also home to a large leading hospital (Queen’s Medical Centre) where doctors have expertise in treating sudden hearing loss, and to an internationally-recognised hearing research centre. This proposal brings together these researchers and clinicians in a new collaboration to better understand: (a) how to find people with sudden hearing loss in large healthcare databases; (b) how often people experience sudden hearing loss; and (c) how people with sudden hearing loss are treated. Stress, lack of oxygen or tissue damage contribute to worse health outcomes for patients, particularly after they have suffered a heart attack, heart failure or stroke. Our bodies naturally release a purine, called adenosine, which is produced locally in many organs to both help protect against tissue damage and regenerate tissues after injury. Because adenosine has beneficial effects, particularly in the cardiovascular system, it has potential therapeutic applications in the treatment of heart disease, control of cardiac rhythm and in ischaemic injury (where the heart does not have enough oxygen) or heart failure. The main issues with using adenosine is the broad spectrum of cardiovascular actions, non-cardiovascular side effects and the short duration of action, because adenosine is rapidly metabolised and its receptors quickly become desensitised. We want to find out how other compounds (allosteric modulators), which work in a similar way to adenosine, enhance the local release of adenosine via activation of its receptor, but with better pharmacological profiles and fewer side effects. This means that patients would benefit from a treatment that could help them recover from a heart attack or stroke, with minimal side effects seen in the rest of the body, particularly the cardiovascular system. Cancer is a major healthcare challenge which affects one in two people in the UK. However, the majority of new cancer cases diagnosed are in low/middle income countries (LMICs). While cancer survival rates are improving in developed countries, this is largely due to improved screening, early diagnosis and the development of next generation cancer therapeutics. These tools are not widely available in LMICs. This project seeks to address this disparity by developing better approaches to diagnose and guide treatment of African cancer patients. We are focusing on prostate cancer, which is the most common cancer affecting men and because prostate cancer is particularly lethal in African men. To date prostate cancer has been studied primarily in Caucasian, African-American and Afro-Caribbean men, rather than in African patients. For this reason in this project we partner with the University College Hospital, Ibadan, Nigeria to apply advanced genomics-informed pathology to understand why prostate cancer is more lethal in African patients. This knowledge will not only enable us to better diagnose and inform treatment for African prostate patients; it will also provide unique knowledge of how prostate cancer becomes aggressive. This knowledge is relevant to all prostate cancer patients, regardless of ethnicity. Anxiety-related disorders (eg panic, post-traumatic stress, phobias) are twice as common in women compared to men. Despite this striking sex difference, the biological factors involved remain poorly understood. One reason for this lack of understanding is that the vast majority of relevant basic research studies have neglected to include females, which has greatly hindered progress in this field. We are addressing this important issue by investigating sex differences in fear memory processing using rodent models of relevance for understanding the deficits in emotional regulation observed in these disorders. We have found that females show impaired inhibition of learned fear, compared to males, which is associated with altered activity in the prefrontal cortex. This brain area is crucial for emotional regulation and its function is abnormal in anxiety-related disorders. Our work is the first demonstration of this link between altered brain activity and differences in learned fear inhibition between males and females in rodent models of anxiety-related disorders. This paves the way for future research investigating how certain neurotransmitters and hormones are involved in these sex differences. This will help us to understand why anxiety-related disorders are more common in women and may eventually lead to new treatments for these disorders. The mitotic spindle is the apparatus that drives cell division. It is built from microtubules and is critical to faithful segregation of chromosomes. Microtubules are long, slender polymers of the protein tubulin. In cells, the organisation and dynamics of microtubules are tightly controlled by accessory proteins. The fidelity of chromosome segregation depends on the correct attachment of a single microtubule bundle to a single chromosome. Each chromosome of a duplicate pair must be attached to microtubules emanating from a different side of the spindle, so that sister chromosomes are guided into separate daughter cells. Correct segregation requires stabile microtubule-chromosome attachments, yet these must be sufficiently dynamic to permit correction of mis-attachments. How this balance is achieved remains unclear. However, it clearly depends on the activity of microtubule depolymerising proteins. We propose to determine the level of microtubule depolymerisation activity required for successful chromosome segregation. Using a set of variants of a microtubule depolymerising protein, covering a wide range of activity, we will quantify the effect of altering depolymerisation activity in dividing cells to determine the minimum and maximum required for persistent faithful segregation of chromosomes. Many tumours mis-segregate chromosomes at very high rates, we want to help understand this phenomenon. Investigating the role of FOSL2 in transcriptional heterogeneity and its regulation by kinases in hypoxic colorectal cancer Colorectal cancer is the third most common cancer and leads to 500,000 deaths a year worldwide. As tumours grow they need blood vessels to transport oxygen into the tumour. However tumours often outgrow their blood supply and contain regions that do not have enough oxygen. These regions are frequently found in half of colorectal cancers. The colorectal tumour cells in these areas change at a molecular level and become more \"aggressive\". These changes make the cells resistant to chemotherapy and radiotherapy and make it more likely the tumour will spread. Patients with tumours that contain regions of low oxygen are less likely to survive. Therefore it is important to find new ways of killing these therapy resistant cells in regions of low oxygen to increase patient survival. Our research has identified a protein which enables tumours to survive in low oxygen conditions and regulates the changes that occur at a molecular level. In the planned research we will use state of the art technologies to:"
        }
    ],
    "pdf_files": []
}