{
    "url": "https://www.nottingham.ac.uk/research/groups/paediatricrespiratorymedicine/index.aspx",
    "content": [
        {
            "p": "Led by Professor Alan Smyth, the Paediatric Respiratory Medicine research group aims to improve the health of children with respiratory diseases. In the UK, 10% of children and young people have a chronic respiratory disorder. These include common illnesses such as asthma and less common conditions such as cystic fibrosis (which affects almost 5000 children in the UK). Worldwide, almost half of all deaths in children under 5 years are due to pneumonia (1.4 million deaths per year). There is much we still do not know about the best ways to prevent and treat respiratory illness in children and health professionals may be slow in implementing therapies based on good evidence. Hence, whilst new clinical research is needed, existing research findings need to be put together in systematic reviews and then adopted by guidelines, in order to improve medical practice. Our group undertakes systematic reviews, clinical trials and laboratory research in the area of chronic lung infection with organisms such as Pseudomonas aeruginosa and Staphylococcus aureus in people with cystic fibrosis (CF). These infections cause bronciectasis and ultimately respiratory failure. Dr Sally Palser talks about the 3D-CF study which is looking at a new hearing test for patients with CF. We also hope to help in the fight against antibiotic resistance by using existing antibiotics in such a way that we enhance their effectiveness and reduce their side effects. This means more infections can be treated with conventional antibiotics while new antibiotics are being developed. More Professor Alan Smyth talks about antibiotic strategies for eradicating Pseudomonas aeruginosa in people with cystic fibrosis. We also conduct research looking at how the best evidence showing which treatments are safe and effective can be introduced rapidly into routine clinical practice. The group has a passionate belief that everyday clinical decisions, affecting the care of sick children, should be guided by high quality evidence. This stems from our involvement in clinical trials and systematic reviews. We therefore have a keen interest in identifying and overcoming barriers to putting research evidence into practice. These barriers may be caused by are a paucity of suitable trials, failure to publish the results of trials (which is surprisingly commonplace) or failure to incorporate these results into clinical guidelines for the treatment or prevention of disease in children. We have published some key papers in this field [ BMJ 2012; 344:d7373 & J Cyst Fibros 2012;11:14–17]. Prof. Smyth is co-chief investigator for the multicentre TORPEDO trial which compares intravenous with oral therapy for the eradication of early P. aeruginosa infection (HTA funded £1.5 million). Prof. Smyth is Co-ordinating Editor of the Cochrane Cystic Fibrosis and Genetic Disorders Group, which has published over 100 systematic reviews of randomised controlled trials in CF, haemoglobinopathy, coagulopathy and inborn errors of metabolism. These systematic reviews have been incorporated into guidelines and have changed practice. In some cases a review has acted as a springboard for a funding for a large randomised controlled trial (eg. TORPEDO). Prof Smyth is also the author of five systematic reviews. Dr Matt Hurley runs an innovative programme called CF Unite ( http://cfunite.org) which organises web conferences where the patient community meet scientists and clinical scientists to discuss advances in cystic fibrosis research. The conferences are web based because patients with CF cannot meet because of the risk of transmitting infection. Hurley MN, Fogarty A, McKeever TM, Goss CH, Rosenfeld M, Smyth AR. Early Respiratory Bacterial Detection and Antistaphylococcal Antibiotic Prophylaxis in Young Children with Cystic Fibrosis. Ann Am Thorac Soc 2018; 15(1): 42-8. Rowbotham NJ, Smith S, Leighton PA, Rayner OC, Gathercole K, Elliott ZC, Nash EF, Daniels T, Duff AJA, Collins S, Chandran S, Peaple U, Hurley MN, Brownlee K, Smyth AR. The top 10 research priorities in cystic fibrosis developed by a partnership between people with CF and healthcare providers. Thorax 2018; 73(4): 388-90. Prayle AP, Cox T, Smith SJ, Rycroft-Malone J, Thomas KS, Hughes DA, Smyth AR. Do guidelines for treating chest disease in children use Cochrane Reviews effectively? A systematic review. Thorax 2017 (e pub ahead of print). Prayle AP, Jain K, Touw DJ, Koch BCP, Knox AJ, Watson A, Smyth AR. The pharmacokinetics and toxicity of morning vs. evening tobramycin dosing for pulmonary exacerbations of cystic fibrosis: A randomised comparison. J Cyst Fibros 2016;15(4):510-17. Clinical practice - Children's Respiratory Service at Nottingham Children's Hospital PhD opportunities More news from the Division of Child Health, Obstetrics and Gynaecology Our group is sited at the Queen's Medical Centre where our research group and laboratory facilities are located in an embedded unit within the Children’s Hospital. Group members Division of Child Health, Obstetrics and Gynaecology School of Medicine The University of Nottingham E Floor, East Block, Queen's Medical Centre Nottingham, NG7 2UH telephone: +44 (0) 115 823 0612 email:Group Administrator"
        }
    ],
    "pdf_files": []
}