{
    "url": "https://www.nottingham.ac.uk/research/beacons-of-excellence/propulsion-futures/grant-awards/index.aspx",
    "content": [
        {
            "p": "Led by Professor Patanè, researchers in the Schools of Physics and Astronomy, and of Chemistry have received a £2.94 million Strategic Equipment Award from the Engineering and Physical Sciences Research Council (EPSRC). They will team up with industry and over 30 leading research institutes to place the UK at the forefront of research on the next generation of semiconductors pushing the frontiers of modern technologies. The new facility will provide complementary research facilities and access to advanced materials, supporting the Beacons commitment to tackling global challenges. It will provide a unique capability for the transformative miniaturisation and functionalisation of semiconductors, allowing a wide-ranging programme of fundamental science and application-driven research in the UK and internationally. For more details on EPI2SEM (EPitaxial growth and In-situ analysis of a new generation of 2-dimensional SEMiconductors), please contact: Prof. Amalia Patanè. Dr Tanvir Hussain has been awarded a 5-year EPSRC Fellowship for Advanced Ceramics for Aerospace Propulsion, with the aim of building a Centre of Excellence at the University of Nottingham. He said, “Ceramics are an important group of materials and their processing into aerospace coatings and components requires specialist techniques. Current approaches for new materials discovery and production are wasteful, costly and energy inefficient.” Read more about this award here or for more information please contact Dr Tanvir Hussain. Chris Gerada, Professor of Electrical Machines said, “We are extremely happy to have been awarded this grant from UKRI. The advanced manufacturing equipment will exploit the University’s expertise in Power Electronics and Electrical Machines by working closely with industrial partners to develop the next generation of Power Electronics, Machines and Drives (PEMD) products, helping to deliver the UK net zero commitments. The investment will also reinforce the UK’s and the Midlands’ effort to capitalise on the significant PEMD market opportunity.” Read more about this grant here or for more information contact Prof. Chris Gerada."
        }
    ],
    "pdf_files": []
}