{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Kuan-Hon-Lim.aspx",
    "content": [
        {
            "p": "My research focuses on the discovery of natural chemical compounds that possess interesting or useful biological properties from Malaysian plants. Recently, we have isolated from a local fig plant a series of new natural compounds that dilate blood vessels, which has the potential application in decreasing blood pressure. We are also currently synthesising new chemical compounds that mimic the structures of the new natural compounds with the aim to discover effective medicines to treat resistant hypertension – high blood pressure that doesn't respond well to existing treatments. Currently there is no single medicine that can treat resistant hypertension, so our research, should we be successful, has the potential to change many lives worldwide. In addition to synthesising the natural compounds in our lab, we are making lots of other molecules that mimic the structures of the bioactive natural compounds with the aim to discover compounds with improved or superior anti-hypertensive properties. Hopefully this process will pave the way to the discovery of drugs to treat resistant hypertension. Since research in drug discovery is highly multidisciplinary, it is only natural for us to collaborate with different research groups from within and beyond the university so that scientists from different field of expertise can be pulled together to address different aspects of the research project. For instance, Prof Kang Nee Ting and her team from Department of Biomedical Sciences at the University of Nottingham Malaysia are currently looking at the mechanism by which the new natural compounds and some of the synthetic compounds that we synthesised in our lab elicit their blood vessel dilation activity. Based on the preliminary research data obtained from Prof Ting’s group, the compounds tested might be eliciting their activity via an important pathway that may be key to the establishment of a novel approach to treat resistant hypertension in the future. Press on, don’t give up and let your passion to discover drive you forward. Try to do your best, whatever situation you are in. Two of my three PhD students are working on the discovery of new alkaloids from Malaysian plants that may possess useful anticancer activity. My third PhD student is working on the synthesis of a series of new natural compounds that possess anti-hypertensive properties (discussed above). His project also involves the preparation of numerous compounds that mimic the structures of the new compounds. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}