{
    "url": "https://www.nottingham.ac.uk/researcher-academy/excellence/index.aspx",
    "content": [
        {
            "p": "In addition to our Research Fundamentals courses covering the foundational skills and knowledge that every successful researcher needs, our programme features specialist courses and activities grouped by theme in seven key areas that will give researchers the skills to take their research further. Our training themes include Innovation and Knowledge Exchange, Policy Engagement, Public Engagement, Research Methods, Research Communication, and Research Administration and Management, Coaching and Leadership Programmes. Researcher Academy placements match researcher skills to cutting edge projects to help researchers recognise the breadth of their potential and highlight future opportunities. Each placement involves a discreet project at an external organisation for which the postgraduate researcher acts a specialist consultant. This means that our placements alumni don’t just get to list some new skills on their curriculum vitae but are able to demonstrate real world experience of delivering a complete business project. A study has shown that Researcher Academy placements alumni generally achieve better degree outcomes, are more employable and command higher salaries than their peers. Could you describe your research engagingly in just three minutes? This is the question that the Three Minute Thesis 3MT® competition sets for postgraduate researchers. An academic research communication competition originally developed by The University of Queensland (UQ) in Australia, 3MT® challenges doctoral researchers to explain the complexity and relevance of their research to a non-specialist audience in a concise and engaging way. The Researcher Academy offers support to University of Nottingham 3MT® entrants including pre-application presentation training, and video and filming support for winners who are progressing to entry in external 3MT® competitions. Thanks to these activities University of Nottingham entrants have had successes in 3MT® competitions both nationally and internationally. The needs of Research Supervisors and Postgraduate Researchers are different but fundamentally connected. The Researcher Academy network is working on various projects to bring these two groups together to recognise and celebrate best practice, to ensure clarity of expectations for supervisors and supervisees, to develop opportunities for professional development for Supervisors, and to standardise training requirements for lead and co-supervisors. The Researcher Academy also supports Supervisors and researchers funded from UKRI sources and manages the studentship funding from these. The Researcher Academy performs a talent management role in the university's researcher development strategy, offering two application and selection based leadership excellence programmes targeted by career stage to have maximum benefit. These are the Nottingham Research Leaders Programme, designed to enhance the professional development of high-performing researchers, and the Early Career Researchers Programme designed for researchers in the early stages of their research career who have aspirations and potential to lead in their research field and to be an effective team leader. UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": []
}