{
    "url": "https://www.nottingham.ac.uk/research/groups/col/index.aspx",
    "content": [
        {
            "p": "The Computational Optimisation and Learning (COL) Lab was launched in the summer of 2019. We are a group of academics, researchers and PhD students based in the School of Computer Science at the University of Nottingham. Our research and teaching are primarily around the application of novel optimisation and learning methods in real world applications, with a strong theoretical input. COL has come out of a highly successful research group – the Automated Scheduling, Optimisation and Planning (ASAP) group. ASAP existed for 22 years with a highly successful research track record in terms of PhD completions, publications, project funding and, most importantly, impact. For example, ASAP contributed 3 of the 5 impact case studies for the School of Computer Science in REF 2014. However, the nature of the group changed over time with a gradual change towards optimisation and learning with new academics and new funding so in 2019 as a group we decided to relaunch as COL which better represents who we are and what we research. We are at the cutting edge of new methodologies and techniques for optimisation and learning. We have expertise in tackling a diversity of optimisation problems such as airport operations, personnel scheduling, vehicle routing, transport logistics, network routing, predictive maintenance, wind farm operations, portfolio investing, cutting and packing and educational timetabling among others. In this era of ‘big data’, bringing together optimisation and learning can provide outstanding solutions to real world problems across various sectors including transport, energy, food production, logistics, healthcare, manufacturing, aerospace, communications, finance, build environment, etc. We have significant funding including from EPSRC, Innovate UK and the EU all around optimisation and learning in real world applications with industry. We are always happy to talk to companies about how we might work together. In the first instance please contact Professor Dario Landa-Silva (pszjds@exmail.nottingham.ac.uk) who is also the REF Impact Lead for the School of Computer Science. NATCOR: A National Taught Course Centre in Operational Research We are actively involved in NATCOR, a collaboration between ten universities, to develop and deliver taught courses in Operational Research to PhD students. We host the course entitled Heuristic Optimisation and Learning. Please visit our Projects pages for the full listing of our current and completed projects Conceptual Programming with Python Thorsten Altenkirch, Isaac Triguero Thorsten and Isaac have written this book based on a programming course we teach for Master’s Students at the School of Computer Science of the University of Nottingham. The book is intended for students with little or no background in programming coming from different backgrounds educationally as well as culturally. It is not mainly a Python course but we use Python as a vehicle to teach basic programming concepts. Hence, the words conceptual programming in the title. http://www.conceptual-programming.com KTP Best of the Best Awards 2019 Finalists Congratulations to Simon Kingston, KTP Associate with EventMap and the COL Lab who has been selected as one of the best future innovators. Simon Kingston has been working with Dr Ender Ozcan to further the collaborative work with EventMap in the emerging area of ‘fairness’ measures in timetabling and scheduling. For more information:- https://ktn-uk.co.uk/news/ktp-best-of-the-best-awards-2019-finalists-announced Hyper-heuristics: Theory and Applications Nelishia Pillay, Rong Qu Dr Rong Qu has jointly authored a book titled \"Hyper-heuristics: Theory and Applications\" in the Springer Natural Computing Series. This is the first authored book on hyper-heuristics, presenting fundamental theories and the recent applications of hyper-heuristics to combinatorial optimisation problems. It also illustrates the HyFlex framework and the EvoHyp toolkit, presents advanced topics in future research directions, and in the appendices offers details of the definition, problem model and constraints for the most tested four combinatorial optimisation problems. NATCOR Heuristic Optimisation and Learning Course 2022 and ATI's Turing Network Award The NATCOR training on Heuristic Optimisation and Learning will take place in person in Nottingham from 25-29 April 2022. 6 applicants were supported by the University of Nottingham through the Alan Turing Institute’s Turing Network Development Award to attend this training. The Nottingham NATCOR course covers the main techniques for heuristic optimisation algorithms (local search, meta-heuristics, multi-objective heuristics, hyper-heuristics, evolutionary algorithms) as well as an insight into complexity theory, automated algorithm design, big data science and machine learning in the context of heuristic optimisation. The course is delivered by experts in the field with strong publication records and experience in the design and deployment of these methods on real-world problems in various business and industry scenarios. EventMAP Ltd - The Timetabling and Scheduling Specialists Staff Roster Solutions - Fast, intelligent, rostering automation Sorry, there are no events at present We are based in Computer Science, Jubilee Campus, on B Floor Map and Directions Twitter Facebook Email The University of Nottingham School of Computer Science Jubilee Campus Wollaton Road Nottingham, NG8 1BB telephone: +44 (0) 115 9514206 email: pszjds@exmail.nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}