{
    "url": "https://www.nottingham.ac.uk/research/groups/primarycareepidemiology/index.aspx",
    "content": [
        {
            "p": "Our research group includes clinicians, statisticians, epidemiologists, computer scientists and patient representatives. The group undertakes large scale research into: We make extensive use of a number of databases including QResearch. Set up by Professor Julia Hippisley-Cox in 2002, QResearch is the largest database of its kind worldwide, containing a wealth of longitudinal data from over 25 million people in over 1,500 UK practices linked to secondary care data for hospital admissions, mortality and cancer registration. Whilst clinical trials are undertaken during the development and testing phases for new and commonly used drugs, these trials tend to be in small numbers of selected participants for limited periods of time. Once a drug is licensed, it tends to be used in large numbers of unselected individuals over long periods of time. read more It is therefore important to have independent systematic research into the risk and benefits of new and commonly used drugs to identify and quantify both intended and unintended effects on patients. We use QResearch and other databases to undertake such studies which are of national and international importance. In one project, we are examining the use of antidepressants when patients are already on other drugs or have other health conditions, and assessing whether these will lead to potential problems. We will then create a decision aid for use in clinical practice to help GPs and patients decide on the best antidepressant for the patient. This work is from the Mental Health & Technology theme of the NIHR Nottingham Biomedical Research Centre (BRC). Much of clinical practice involves assessing the probability that a patient either has a particular disease or may develop it at some point in the future and also what the risks and benefits of various treatments or interventions are. Doctors need better information to inform discussions with patients and decisions to investigate, refer and treat individuals. Both doctors and patients need better information to ensure patients are fully informed about the risks and benefits of clinical decisions, so they can give consent. New approaches to risk estimation were needed to take account of the characteristics of the population to which the tool should be applied and which can be updated over time as the population changes and national guidelines for prevention evolve. A suite of innovative risk prediction models has been developed by the group using the QResearch database which is a large anonymised repository of electronic health records for medical research, created as part of a not-for-profit partnership between the University of Nottingham and EMIS – a leading supplier of GP clinical computer systems in the UK (www.qresearch.org). QRisk tool [1] is a tool for predicting an individual’s 10-year risk of cardiovascular disease. In 2014, it replaced Framingham as the risk engine of choice in the NICE lipid modification guideline[2] and is central to policy guidance such as NHS Health Checks[3]. The QRISK lifetime version of the tool[4] is used by Public Health England on its NHS Choices website to estimate heart age; by September 2017 it had been used by 3 million people[5]. It is recommended by the American Heart Association as the risk engine of choice for South Asians[6]. QStroke tool [7]. QStroke was published in 2013 and predicts 10-year risk of ischaemic stroke to identify patients for whom stroke prevention measures (such as anticoagulation) are likely to be beneficial. QBleed tool [8]. Originally published in 2014, QBleed predicts the risk of upper gastrointestinal bleeding and intracranial bleeding with anticoagulation. It is designed to be used with QStroke to help patients weigh up the risks and benefits of anticoagulation. QCancer tool [9,10,11]. This estimates the risk of a patient having an existing but as yet undiagnosed cancer based on the pattern of symptoms and risk factors for 12 different types of cancer. The research underpinning the QCancer tool was widely cited in the 2015 NICE guidance on referral for suspected cancer[12]. QCancer-10 tool estimates the 10-15 year risk of developing cancer. The colorectal cancer tool had the best performance of any colorectal cancer risk assessment tool in an independent external validation by Cambridge University using the UK-Biobank cohort[13]. QFracture tool [14] predicts 10-year risk of fragility fracture of hip, spine, wrist and shoulder so that high risk patients can have interventions to lower this risk. In 2017, an international independent validation of QFracture showed that QFracture outperforms existing tools[15]. It was implemented by EMIS in 2014. QFracture is recommended by NICE guidelines[16] and in the 2017 NICE Osteoporosis Quality Standard (QS149) [17] and the technology appraisal on Bisphosphonates for treating osteoporosis (TA464) [18]. It is recommended by SIGN (142) in Scotland[19]. It was included as an indicator in the GP Quality and Outcomes Framework national contract for GPs in 2014. QDiabetes tool [20]. This predicts 10 year risk of developing type 2 diabetes so that patients can have interventions to lower their risk. The QDiabetes® algorithms have been validated by ourselves and others in independent groups of patients using UK primary care databases such as QResearch[21], CPRD[21], THIN[22]. It has been independently and externally validated in international populations and compared with other diabetes risk prediction models and shown to have the best performance[23]. QDiabetes is recommended in the NHS Health Checks[24] and National Institute of Clinical Excellence (NICE) guidance on the prevention of type 2 diabetes in people at high risk[25] and the NICE guidance on promoting health and preventing premature mortality in black, Asian and other ethnic minority groups (QS167) [26]. It is also used by the NHS Diabetes Prevention Programme (NHS DPP). QDiabetes was implemented in EMIS in 2013/4 (see link). QAdmissions tool [27] identifies patients at high risk of unplanned hospital admission, so they can have preventative measures to reduce hospital admissions. It is recommended by the 2016 NICE guideline on multi-morbidity (NG56) [28] and the NHS England’s designated enhanced service. It was implemented by EMIS in 2014. QMortality [29] and QFrailty[29]. The QMortality algorithm was published in 2017 and quantifies risk of death over the next 12 months and the new QFrailty tool is a novel outcomes based classification to identify the most frail patients to meet the requirements of the 2017 GMS contract. It will be implemented by EMIS in 2018 All of the risk prediction tools developed by the group are publicly accessible and the majority have been integrated into the major GP clinical system (EMIS Health) which supplies computer systems to over 55% of GP practices nationally covering a population in excess of 30 million. The tools are also available as free open source software to facilitate use internationally. The Department of Health uses both QRISK and QDiabetes as integral parts of the NHS Health Check prevention programme in England. This programme offers a risk assessment of health issues such as heart disease, stroke and type 2 diabetes, to adults aged 40-74 years in England, and helps to identify ways to reduce their risks. Interventions include weight reduction, smoking cessation, blood pressure lowering treatment and cholesterol lowering treatment. Similar tools which estimate risk of other conditions such as osteoporotic fracture are also now recommended in national guidelines and tools embedded in clinical computer systems. QRISK, QFracture, QDiabetes and QAdmissions are recommended by NICE guidelines. QRISK software, which is embedded in > 99% of UK GP clinical computer systems, runs calculations every night which generate a rank-ordered list of those at high risk of heart disease or stroke. Similar tools which estimate risk of other conditions such as osteoporotic fracture ( QFracture) and diabetes ( QDiabetes) are also recommended in national guidelines and embedded in GP clinical computer systems. The tools help identify those patients at high risk of developing a disease for whom preventative measures can be considered. More news from the Division of Primary Care Group members The University of Nottingham School of Medicine, Tower Building Nottingham, NG7 2RD telephone: +44 (0) 115 846 6915 email:carol.coupland@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}