{
    "url": "https://www.nottingham.ac.uk/research/groups/medicinesafetyeffectivehealthcare/index.aspx",
    "content": [
        {
            "p": "This group conducts research on the safe and effective use of medicines and is at the forefront of patient safety research in the UK and internationally. We aim to influence policy and practice so that effective interventions to improve patient safety are rolled out across the health service. --Tony Avery Professor of General Practice Medication errors, particularly those relating to prescribing or insufficient medication monitoring, are often associated with considerable risk of patient harm, including hospital admissions. The highest rates of medication errors tend to be found in patients taking multiple medications and also in relation to certain drugs that are frequently associated with preventable morbidity e.g. anticoagulants and diuretics. By identifying interventions aimed at reducing the prevalence of medication errors, this research has potential to improve the quality of care for patients, prevent medication-related harm, and improve the cost-effectiveness of care. Our research focuses on investigating the prevalence, nature and causes of medication errors in general practice; evaluating patient safety initiatives, including interventions aimed at reducing the prevalence of medication errors; undertaking epidemiological work to assess the benefits and harms of medicines used in primary care; and assessing the safety of primary care organisations. Much of our research is done in collaboration with colleagues from NIHR Greater Manchester Patient Safety Translational Research Centre. Issue 1: Safety of prescribing in primary care We have four broad themes within this area: Issue 2: Patient safety culture in primary care organisations Current projects include: In terms of impact, our research meets the challenges of the Quality, Innovation, Productivity and Prevention (QIPP) agenda in that it has the potential to improve quality and safety of care for patients, enhance service delivery, accelerate the translation of evidence to practice and has the potential to provide cost savings to the NHS. We are currently working closely with NHS England, the National Institute for Health and Care Excellence (NICE) and the Chief Pharmaceutical Officer for England to look at ways of translating our research findings into main-stream general practice. Our key publications A project led by Prof Tony Avery, a patient safety toolkit for general practices, has been named as one of the top 10 achievements of the NIHR School for Primary Care Research (SPCR) over the last 10 years. The Patient Safety Toolkit for General Practice is hosted on the Royal College of General Practitioners (RCGP) website. More news from the Division of Primary Care Group members The University of Nottingham School of Medicine telephone: +44 (0) 115 823 0209 email:anthony.avery@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}