{
    "url": "https://www.nottingham.edu.my/Research/Research-groups/Institute-for-Aerospace-Technology-IAT.aspx",
    "content": [
        {
            "p": "Specialists from global aerospace companies and aviation leaders have joined forces with our researchers and academics across our three campuses in Malaysia, UK and China. Together, we are creating an extraordinary future for aerospace technology. We at IAT share Malaysia’s ambition to be the leading aerospace nation in South East Asia by 2030, and to become an integral part of the global market. We are working closely with the Aerospace Malaysia Innovation Centre (AMIC) under the National Aerospace Industry Coordinating Office (NAICO), Ministry of International Trade and Industry (MITI) and we share a laboratory centre located in German Malaysia Institute (GMI), Kajang. Our ambition and drive makes the Institute of Aerospace Technology (IAT) a partner of choice for addressing two key research goals, closely aligned to AMIC: Factory of the future Improving the manufacturing capability of aerospace industry Sustainable aviation Finding novel solutions for sustainable development such as bio-jet fuels and use of recycled materials Our academic staff have internationally recognised expertise in the following topic areas: We’re always searching to discover the next innovation within aerospace bringing people and projects together, and we’re always pleased to hear from commercial organisations and other universities with ideas for collaboration. If you share our ambition and passion for smarter, greener and faster aircraft, we’d like to hear from you. We’re also uniquely placed to benefit from our global expertise. The Institute for Aerospace Technology at the University of Nottingham has over 70 externally funded projects valued at over £75 million with an inspirational team of 400 scientists and engineers. For general enquiries: Director, Dr Lim Chin Seong email: ChinSeong.Lim@nottingham.edu.my For research collaboration and business engagement enquiries: email: RKE.Hub@nottingham.edu.my An Aerospace Technology Institute, such as UNM’s IAT, is a specialised research institution that focuses on advancing aerospace technology. It is a hub for cutting-edge research, innovation, and development within the aerospace industry. Here’s why you should consider joining UNM’s programme: State-of-the-art research facilities equipped to empower our faculty, researchers and students in their aerospace research work Experienced and knowledgeable team of research faculty members who can guide and mentor students. Our aerospace research initiative spans a wide spectrum of disciplines. You will have the opportunity to explore areas such as aerodynamics, propulsion systems, materials science, space exploration, aviation safety, and sustainable aerospace solutions. We are a part of a global network with international collaborations. You will gain hands-on experience. Yes, UNM offers scholarships, grants and other financial aid to deserving students. These funds can be used for tuition fees, research funding or living expenses, depending on the financial support obtained. Yes, we welcome international students to all our campuses. Visit our international students page or contact us for more information on requirements and admissions. Researchers at UNM currently aim to improve the aerospace industry’s manufacturing capabilities and find solutions for sustainable aviation. Our faculty members are experts in bioprocessing, chemical engineering, manufacturing, material engineering, robotics design and renewable energy, all of which are potential research areas students can look into. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}