{
    "url": "https://www.nottingham.ac.uk/research/groups/reproductivephysiology/index.aspx",
    "content": [
        {
            "p": "The aim of our group is to produce new insight into the physiology and pathophysiology of human pregnancy which will translate to improving the future health of mothers and their babies. Our research is multidisciplinary in nature. We work with a range of tissues and cells from the female reproductive tract to elucidate pathways that distinguish a normal, healthy pregnancy from disease. --Dr Raheela Khan, Associate Professor Reproductive health is crucial to successful conception, pregnancy and delivery. Globally, 15 million babies are born before they are 'ready' and within the UK, preterm birth accounts for ~8% of all deliveries. High profile conditions such as gestational diabetes and obesity in pregnancy pose new challenges. Thus, there is a need for early diagnosis, prevention and cure of several pregnancy specific disorders as current clinical treatments are limited or non-existent. A better scientific understanding of the biological mechanisms that determine reproductive outcomes is an important goal. Techniques Although the triggers for both term and preterm labour are not known, switches in expression and function of proteins that favour a contractile phenotype are thought to be activated too early. More We have previously described changes in myometrial and decidual ion channels with the onset of labour that highlight the complex regulation of uterine function. Our current work is focussed on the role of ion channels, inflammatory mediators and lipids to identify potentially new means of detecting and treating preterm labour. This condition, characterised by hypertension and proteinuria, is present in 1-5% of pregnant women. It originates in early pregnancy but symptoms present much later. Pre-eclampsia is a multi-system disorder that can affect the mother, her baby or both and may be associated with the development of cardiovascular disease in later life. Research in our lab is underway on comparing vascular and immune function in the placentae of pre eclamptic and normal women. Approximately 1 in 7 couples seek advice for infertility. For some 25% of these infertile cases, there is no known explanation. The endometrium provides a favourable environment to facilitate implantation however there is only limited information on the physiological factors within the endometrial milieu that determine receptivity. We have begun studies investingating loca factor within the human endometrium that may play a role in successful pregnancy outcome by coupling to membrane proteins modulated by, for example pH, oxygen levels, stretch and local mediators. Our research has led to publications in leading peer-reviewed journals. Find out more from the individual group member's profile. Selected publications Group members Division of Medical Sciences and Graduate Entry Medicine School of Medicine The University of Nottingham Royal Derby Hospital Uttoxeter Road, DE22 3DT telephone: +44 (0)1332 724622 email:gem@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}