{
    "url": "https://www.nottingham.ac.uk/research/groups/cffp/news/2019-national-debate-on-effects-of-screen-time-on-young-people.aspx",
    "content": [
        {
            "p": "Professor Kevin Browne (Professor of Forensic Psychology & Child Health, Director of Centre for Forensic and Family Psychology – School of Medicine Division of Psychiatry and Applied Psychology) has spoken extensively with the BBC across the country expressing his concern with the latest Royal College of Pediatrics and Child Health Report and press release which claims there is little evidence that time spent in front of screens effects mental health of young people. The RCPCH report stated a typical day for 109 young people (aged 11 to 24 years) surveyed was 2 hours TV, 3 hours on mobile phone and 2.5 hours on computer/laptop or tablet = 7.5 hours in total not including time at school/work. Professor Browne drew attention to the 88% of young people who said it had a negative affect on their sleep (average 1.5 hours screen use before falling to sleep), 41% said it affected their play/fun, 35% said it had negative impact on mood and mental health and 18% claimed a negative impact on family life and school/work. The RCPCH primary recommendation is that: “Families should negotiate screen time limits with their children based upon the needs of an individual child, the ways in which screens are used and the degree to which use of screens appears to displace (or not) physical and social activities and sleep”. Screens should also be avoided for an hour before a young person’s planned bedtime. The RCPCH pose four key questions for families to use as a guide to examine their screen time, but has not yet produced formal guidelines: In addition to the RCPCH report, a new paper published in the BMJ in early January considered findings from 13 reviews: Effects of screen-time on the health and well-being of children and adolescents: a systematic review of reviews The authors of this paper report: There was no or insufficient evidence for an association of screen-time with eating disorders or suicidal ideation. However, previous research (Browne and Hamilton-Giachritsis, 2005) has shown that the content on the screen can have profound effects on psych-social and mental health. The greater the time on screen the more likely that age inappropriate violent and sexual images will be seen, which in turn may provoke aggression or fear responses. Recent research at the Centre for Forensic and Family Psychology led by Professor Browne, has found that 42% of 1,786 emerging adults (18 to 25 years) first viewed internet porn under the age of 13 years and that this was associated with earlier sexual activity, underage sex and both sending and receiving explicit sexual images (sexting) for both males and females. Therefore, Prof. Browne stated it is misleading for the RCPCH to claim ‘there is little evidence that time spent in front of screens effects mental health of young people’ and very unhelpful to parents attempting to set limits and boundaries for their children. He said that the images and content on the screen also have an effect and need to be taken into account, as well as the technology. It is more helpful to suggest that children and young people (under 18 years) left unsupervised for long periods with access to screens, adult games and DVDs and/or the internet is irresponsible parenting. telephone: +44 (0) 115 846 7898 email:forensic@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}