{
    "url": "https://www.nottingham.ac.uk/researcher-academy/partnership/index.aspx",
    "content": [
        {
            "p": "The Researcher Academy DTPs have been able to advise and support Schools on bid development, while these DTPs have in turn benefited from the insights and skills of partners in the Researcher Academy Placements and Training and Development teams, the university’s Careers Service, and industry partners. M4C DTP: The AHRC-funded Midlands4Cities Doctoral Training Partnership, in partnership with the AHRC and seven other universities across the Midlands, as well as an exciting range of regional, national and international partners including local galleries and museums such as Nottingham Contemporary and the National Justice Museum and national archives and institutes including Historic England, the Shakespeare Birthplace Trust and Tate galleries. BBSRC DTP: The Biotechnology and Biological Sciences Research Council funded Doctoral Training Partnership, in partnership with Nottingham Trent University and the National Biofilms Innovation Centre (NBIC). ESRC DTP: The Economic and Social Research Council funded Doctoral Training programme, encompassing the ESRC Doctoral Training Centre (ESRC DTC) and the ESRC Midlands Graduate School Doctoral Training Partnership (MGS DTP), which is a consortium of six universities across the Midlands. NERC DTP: The Natural Environment Research Council funded Doctoral Training Partnership, a consortium led by Lancaster University, in partnership with the Universities of Nottingham and Bangor. Researchers on these doctoral training programmes benefit from studentship funding and enhanced support for professional training, expert supervision within and across partner organisations, extensive networking and collaboration opportunities nationally and internationally, and links to partners in other sectors. Midlands4Cities students have used funding to deliver training, conferences, symposia and workshops for students across arts and humanities research. Themes include: Posthumanism, the changing landscapes of Rome, contemporary collecting practices in galleries and museums and the logic of archives. The Researcher Academy Researcher Academy Conference, Travel and Training Fund fund provides financial support for professional development opportunities beyond the university for both in-person and online conferences and training events. Over the course of nearly two decades we have awarded over half a million pounds in funding to facilitate researcher mobility, collaboration novel interdisciplinary research activity. Information for applicants A number of awards have led to research collaborations, publications, post-doctoral opportunities and employment post-PhD. The awards are an excellent opportunity to create a link between the University of Nottingham and other leading international universities. STAHRC is a research-focused collective, directed by Dr Alan Chamberlain. The collective spans disciplines enabling us to work with a range of Researchers, Academics, Artists, and leading experts to carry out research, create artworks/performances and develop technology for social benefit. The Researcher Academy Placements programme are lead partners in the ERDF Productivity Through Innovation programme (PTI), working with Nottingham Trent University and the University of Derby). This three year, £7.1 million collaborative programme involves local universities, academic staff, postgraduate students, and regional businesses working together to enhance the economic productivity of the local region. We also offer placements in partnership with the EPSRC (NPIF Innovative Placement Funding) and ESRC (NPIF) Accelerating Business Collaboration. The Researcher Academy Placements team provide advice and support to the BBSRC DTP’s PIPS programme whose students have undertaken placements with over 130 organisations, with over 30% of these taking place internationally. The Researcher Academy's Midlands4Cities team also works closely with partners in the cultural, creative and heritage sectors to develop placement opportunities. As part of the M4C programme students can spend up to 3 months with a host organisation to undertake an employability skills focused placement. As part of the ESRC MGS DTP programme students could spend up to three months with a non-academic organisation either in the UK or overseas to undertake a funded placement with a demonstrable knowledge exchange element. In addition, many ESRC DTP students undertake placements via the UKRI Policy Internship Scheme. The Researcher Academy is part of the East Midlands Doctoral Network (EMDoc), a partnership between the nine universities within the East Midlands region. Together we are united in our missions to share best practice, resources and insights into postgraduate research, as well as providing opportunities for collaboration and networking amongst the organisations’ students. Our M4C doctoral training programme offers Collaborative Doctoral Awards (CDAs) which are co-designed between an M4C university and an external partner organisation. CDAs offer a project with established research aims, responding to particular needs in the cultural, creative and heritage sectors. The supervisory teams are pre-established and are made up of academics from a Midlands4Cities university and a member of the external partner organisation. Each year the ESRC MGS DTP offers a number of Collaborative Studentships involving research or other activities with external public, private or third sector organisations. These projects are developed in collaboration between academics at a Midlands Graduate School DTP institution and an external partner organisation and will often involve a dedicated supervisor from the partner organisation. Joint ESRC DTP Studentships are also available each year where a student is registered and hosted at one Midlands Graduate School institution, but will have a second supervisor at another MGS institution. Both Collaborative and Joint studentship opportunities are advertised as individual projects. UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": []
}