{
    "url": "https://www.nottingham.ac.uk/research/groups/precision-manufacturing-centre/index.aspx",
    "content": [
        {
            "p": "We have state-of-the-art high and ultra precision manufacturing equipment, and unrivalled engineering expertise. These hold the key to solving the most rigorous and complex engineering challenges. Working with the team at the Precision Manufacturing Centre as part of the Aerospace UP project has enabled AIE to explore the specific design needs and requirements of component design when machining additive manufactured components. The PMC team's core expertise and experience has enabled AIE to not only truly understand the massive potential for this technology in our engines' design but also at the same time the limitations that need to be considered regarding tolerancing and material allowance to achieve high-quality, high-precision components. Nathan Bailey, Managing Director, Advanced Innovative Engineering (UK) Ltd. We needed a supplier we could rely on to produce accurate components, which would meet the high standards of our tool. The PMC gives us confidence that the parts we receive will be of excellent quality. The advice Mark and the team can give us for higher volume production is vital to our expansion across different markets. Peter Smith, Mechanical Design Engineer, Scintam Engineering Ltd. We were introduced to the PMC through the Aerospace UP programme and were impressed by their willingness to engage with SMEs as well as their advanced inspection and machining facilities. Working closely with the team we have been able to move the project from prototype phase to full production on what is a major telecoms satellite project which adds to the strategic space capability within our region. Anne Ford, Managing Director, PGM Reball Ltd. All of this was provided at no cost to ourselves and our IP is protected. I was extremely impressed with the PMC’s knowledge, practical skills and overall professionalism. In addition to this, they are a friendly team to work with, with good communication throughout the project. Peter Spiby, Director, 4CSoftware Svetan Ratchev Joel Segal Daniel Symes Mark Strickland Institute for Advanced Manufacturing Faculty of Engineering The University of Nottingham Jubilee Campus Nottingham, NG8 1BB telephone: +44 (0) 115 748 6717 or +44 (0) 115 748 4786 email: pmc@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}