{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Wong-Tze-Peng.aspx",
    "content": [
        {
            "p": "My biggest challenge right now, is the pandemic. The drastic change in early intervention and education landscapes have disadvantaged children from the minority groups. We have to adapt to the changes quickly, from innovating online research paradigms to collect the data that we need to improving on intervention and teaching methods that will support these students’ learning. Developing methods to understand language and social communication learning and difficulties from the perspective of conversational entrainment (or coordination of communicative actions such as speech rate, and language units), and exploring effects of culture on social-communication and cognitive outcomes of a parent-mediated intervention for children with autism. We are also exploring equality, diversity and inclusion at UNM by understanding factors that affect inclusion among students, and students’ experiences with assignment feedback. As the interconnection between cultural and developmental differences is complex, I’d like to gradually increase cognitive, cultural and linguistic factors that I have not explored, into my future research. There is a consensus that we need sufficient resources to support children who are neurodevelopmentally diverse in any contexts. Changes at all levels of the community is needed to level up intervention and learning support systems. One way to achieve this is by having a comprehensive understanding on the mutual relationship between the biophysical aspects of human development and the environment – this is the driver of my research motivation. Being able to generate findings that could potentially answer questions that clinicians, educators and parents need in order to better support their young children especially those who are neurodevelopmentally diverse. I hope that we’ll be able to continue to unravel more culture and language universal and specific elements in our understanding of social-communication development, literacy acquisition, and inclusive practices, and eventually identify highly effective intervention, teaching methods and systems to support equality, diversity and inclusion of children from the minority population and their families. To me, collaboration is important for knowledge and skills exchange, and sharing of resources. I enjoy learning from collaborators of different fields and experiences. They are also a great source of social and emotional support when I hit a stumbling block in research! The end of one’s PhD is just the beginning of their research career. So continuous engagement in different research activities such as dialogues and training, collaboration with experienced researchers, and making the efforts to disseminate our findings, are all important to keep our passion and momentum in research going. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}