{
    "url": "https://www.nottingham.ac.uk/research/groups/spmic/sir-peter-mansfield-imaging-centre-celebration-13th-january-2017.aspx",
    "content": [
        {
            "p": "We are organised a one-day meeting on 13th January 2017 to celebrate the 25th anniversary of the establishment of the Magnetic Resonance Centre at the University of Nottingham and to look forward to the future of the Sir Peter Mansfield Imaging Centre, which was recently formed by bringing together the School of Medicine’s Medical Imaging Unit and the School of Physics and Astronomy’s Sir Peter Mansfield Magnetic Resonance Centre. The first part of the event took place in the Sir Clive Granger Building on University Park, while the evening Social Event was held in the nearby Hemsley. Key-Note Speakers Professor Richard Bowtell is the current Director of the Sir Peter Mansfield Imaging Centre. He joined the Department of Physics in 1984 as a PhD student of Sir Peter Mansfield, and then stayed on as a member of academic staff, serving as Head of the School of Physics and Astronomy from 2008-2014. His research focuses on the development and application of new techniques and hardware for biomedical imaging. Professor Peter R. Luijten received his training in physical and theoretical chemistry from 1972-1979 (Amsterdam). After finalizing his thesis on NMR studies of molecular dynamics in liquid crystals (1984, Amsterdam, San Diego), he became a research scientist at Philips Medical Systems in the Magnetic Resonance Imaging division. He developed multiple new technologies resulting in several patent applications and peer reviewed scientific journals. In 2005 he was appointed Professor of Functional Medical Imaging at the University Medical Center in Utrecht and Chair of the Imaging Department in 2014 and Director of the UMC Utrecht Center for Image Sciences in 2015. His research focuses on the development and the implementation imaging in the clinic. Professor Steve Williams is the Director and Head of the Centre for Neuroimaging Sciences based at the Institute of Psychiatry and Maudsley Hospital, King’s College London. He graduated from Loughborough University in 1985 then spent a formative year working in high resolution NMR spectroscopy for Beecham Pharmaceuticals in Harlow before seeking a higher degree. In 1988, he became the University of Cambridge’s first PhD in Magnetic Resonance Imaging. He went on to set up a University of London Intercollegiate Imaging facility at Queen Mary College which focused on the development and application of magnetic resonance techniques in a wide range of pre-clinical models of disease. In 1994, he moved to the Institute of Psychiatry to champion the application of neuroimaging in CNS disorders. Steve has co-authored over 400 papers and chapters in leading neuroscience journals. His recent work has focused on the translation of imaging techniques from bench to bedside with an ever-increasing emphasis on the development of new tools for diagnosis and prediction of response to treatment. Professor Peter Morris studied theoretical physics at Cambridge before undertaking a PhD in solid state NMR in Nottingham supervised by Sir Peter Mansfield. In the late 1970s he was part of a team which constructed a whole body MRI system which is now in the London Science Museum. He helped to establish the fundamental principles of MRI (“Mansfield and Morris”, 1982) before moving to the Medical Research Council’s National Biomedical NMR Centre and then to Cambridge as a University Lecturer in Biochemistry. He returned to Nottingham in 1990 as Professor of Physics and, following Sir Peter’s retirement in 1994, became Director of SPMMRC/SPMIC. He retired as Director in 2016 but continues to lead a research programme on the development of techniques for ultra-high-field MRI, multimodal imaging (fMRI, EEG and MEG) and the use of 1H and 13C MRS to understand the metabolic basis of neural activation. He was awarded a CBE in the 2016 New Year Honours in recognition of his services to Science and Medicine."
        }
    ],
    "pdf_files": []
}