{
    "url": "https://www.nottingham.ac.uk/research/groups/dcw/index.aspx",
    "content": [
        {
            "p": "Drama and Creative Writing is a dynamic research group dedicated to the production and study of performance and creative practice. The group covers a wide range of research and creative activity. These creative and critical interests feed directly into our doctoral, postgraduate and undergraduate teaching and supervision. The research group combines two distinct, yet interlinked, discipline areas: Drama and Performance, and Creative Writing. Drama and Performance covers a rich span of performance types and historical periods. We also have a strong track record of collaboration with regional creative and cultural industry partners. Our particular expertise includes the following: Creative Writing at Nottingham covers a wide range of skills and techniques, including scriptwriting, poetry and fiction (including short stories, novels and digital texts). We are all published writers and practitioners. There is an emphasis on the practicalities of getting published in our teaching activities, from the initial writing, through to editing and publication or performance. Guest and honorary lecturers provide additional context and work-based experience. Our writer-in-residence is the award-winning novelist and short-story writer Professor Jon McGregor. Students have the opportunity to work alongside Jon McGregor on The Letters Page, the School of English’s literary journal. See more news... See more events... School of English Events Dr Jem Bloomfield Dr Chris Collins Dr Sarah Grandage Dr Spencer Jordan Dr Thomas Legendre Dr Lila Matsumoto Professor Jon McGregor Professor Jim Moran Dr Lucie Sutherland Dr Matt Welton Dr Anna Blackwell School of English Trent Building The University of Nottingham University Park, Nottingham NG7 2RD telephone: +44 (0) 115 951 5900 Fax: +44 (0) 115 951 5924 email:english-enquiries@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}