{
    "url": "https://www.nottingham.ac.uk/researcher-academy/news/latest-news/my-experience-of-the-bbsrc-doctoral-career-development-fund.aspx",
    "content": [
        {
            "p": "As many of you may have also experienced, the Covid-19 pandemic did not arrive with excellent timing. Having entered the third year of my PhD studies in the University of Nottingham Doctoral Training Partnership (DTP), I was ready to jet off to Halle, Germany for a much-anticipated three-month professional internship for PhD students (PIPS). Sadly, the week I was due to leave Boris Johnson appeared on our TVs and brought our lives to a screeching halt. After a few weeks of reading papers, writing up methods and completing more jigsaw puzzles than I would like to admit, I found an opportunity to do something productive during the lockdown: volunteering to process Covid PCR tests at the lighthouse lab in Milton Keynes. Whilst it was great to contribute something at that time and I made a lot of new friends, I could not honestly say that pipetting thousands of saliva-laden samples into 96-well plates was a key developmental experience or a boon to my future job prospects.So, it was with great interest that I heard the announcement of the Doctoral Career Development Fund. This fund allowed recently-graduated PhD students at the University of Nottingham to propose six-month placements to develop skills in addition to their PhD experience. The great thing about this fund was its flexibility, with the organisers willing to consider a range of projects and potential hosts that applicants put forward. As a plant molecular biologist, I loved being at the lab bench with pipette in hand. However, I knew that I had gaps in my knowledge of bioinformatics: the use of computer programs to analyse biological data such as gene sequences or expression levels. What’s more, many of the postdoctoral positions that I hoped to apply for listed bioinformatics experience as a core skill for prospective employees. Being something of a technophobe, I considered the leap from the occasional one-hour computing seminar to actually utilising bioinformatics tools to be very intimidating. I therefore submitted an application to work in the Diane Saunders’ lab at the John Innes Centre (JIC) in Norwich. The JIC is a world-leading plant and microbial research institute, and Diane had recently published several fascinating papers including many of the bioinformatic analyses that I was interested in, so for me it was a perfect match. I knew that, with this position, I would be able to develop a bioinformatics skill-set that was relevant to my area of study, whilst also contributing to scientific research in the area. Fortunately, the University granted me funding to work in Diane’s lab for six months. Starting in early March, I was working on a research project looking at the fungal species that causes “yellow rust” disease in wheat. A recently identified gene in this fungus appeared to be present or absent in different yellow rust strains, leading us to suspect that it might play a role in the fungus’ ability to infect certain wheat cultivars. My role was to analyse the presence and expression of this gene in different isolates of the yellow rust fungus (and other related fungi), to build up a picture of its relevance to the infection process. As part of the project I was working with Tony, one of Diane’s research assistants and my extraordinarily patient teacher in all things bioinformatics. At every stage of my training - from basic coding problems through to carrying out analyses on large datasets – Tony was on hand to answer my endless questions with incredible patience. I’m happy to say that we got some really interesting results (that I won’t bore you with here), and I gained a lot of experience and confidence in this area of research. Whilst I wasn’t able to do everything that I wanted, I feel I’m now in a great place to keep developing my skills and to contribute to future research projects. In addition, being part of an institute environment now that Covid restrictions have finally been lifted - with regular “coding club” group meetings and a range of departmental and institute-wide lecturers - have allowed me to feel re-engaged with the scientific community, and have rebuilt my confidence as a researcher. The weekly badminton with other members of Diane’s group and the range of PhD/post-doc community social events have also been great fun, and allowed me to settle into life at the JIC. Diane was a brilliant, attentive boss, who regularly enquired about my search for a position following the placement, giving valuable advice and insight into her experiences as an early career researcher. What’s more, thanks to the skills I’ve gained over the past six months, I landed a post-doc position at the University of Cologne: finally achieving my goal of working in Germany (and after a few more years of Duolingo practice, too!). I’ll be starting there in November, working on a project that includes (among other things) using some of the bioinformatics skills that I have picked up over the last six months. I may not have had this opportunity without the support of the University of Nottingham DTP organisers who secured the funding for my placement, so I am hugely grateful both to them as well as to Diane and Tony for training me. I hope that the future cohorts of DTP students can have the same opportunities to gain experiences to supplement their PhD research, either through their PIPS or other placements. I would encourage them to grab the opportunity with both hands, as it’s a great time to develop new skills and contacts for your future career – whether in academia or not. Chris Stephens UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": []
}