{
    "url": "https://www.nottingham.ac.uk/research/groups/property-law/index.aspx",
    "content": [
        {
            "p": "The Property Law Research Group brings together like-minded colleagues from within the School of Law who are conducting research/scholarship and/or who have an active interest in any area of property law, including from a teaching pedagogy perspective. It also aims to engage more broadly with our student population, with colleagues in other areas of the university who have an interest in property law related matters (including colleagues across the social sciences and more broadly) and with those working in external organisations. This group therefore facilitates a space which brings interested parties together to report on and to help to develop high quality research, scholarship projects and grants and to inspire and support one another in creating outputs and engaging with the latest developments related to property law. The long-term aim of the group is to encourage and support collaborative outputs, inspire innovation, and build interdisciplinary connections within the property law community both within the school and externally with associated colleagues (including those external to the school, the wider property law community [including non-academic colleagues]), policy makers and beyond. The group therefore aims to conduct a range of activities including supporting members to prepare collaborative funding bids to produce high-impact research using a range of methodologies, including pedagogical research on innovative property law teaching to support the school’s delivery of the relevant core and optional modules. In this way we also aim to support students and include both undergraduate and postgraduate students in our community, particularly with dissertation students. The group accordingly strengthens ties between research and teaching and help build a sense of community between staff and students within the school. The Property Law Research Group therefore promotes the School of Law as an important home for leading research in property law. Christopher Sargeant - Christopher Sargeant is an Assistant Professor who specialises in property law. His teaching interests are predominantly in the areas of land law and trusts law and more recently in the law of outer space. Dr Sam Bannister - Sam's research involves considering future development of family property law, particularly in disputes between cohabiting couples. His PhD thesis contemplated the use of the doctrine of unjust enrichment in this context and his current research considers the doctrine's potential relationship to widespread mistaken beliefs as to the rights of cohabiting couples. Chukwuemeka Castro Nwabuzor"
        }
    ],
    "pdf_files": []
}