{
    "url": "https://www.nottingham.ac.uk/research/open-research/open-research.aspx",
    "content": [
        {
            "p": "Open research, also known as open science, is a set of principles and practices whose aim is to make the outputs and process of research freely accessible and usable to promote greater public access. Research outputs, data, protocols, software, lab notes and other processes are provided freely online, under terms that enable reuse, reproduction and redistribution, enabling collaborative working and sharing. The concept of ‘open research’ is making a significant impact on scholarly activities, with funding councils and research organisations increasingly placing a focus on research that is transparent, accountable and accessible to a worldwide audience. As a leading research organisation, the University of Nottingham is committed to sharing its knowledge and expertise as widely as possible. The online services listed below provide open access to the university’s published research outputs, research data and higher-level theses. Open access means free, online access to research publications that would otherwise require payment. The Repository@Nottingham showcases publications authored by University staff. The University's open access website contains information on funder requirements, University policies and practical guidance on how to make publications open access. Research data sets are a valuable resource providing insight into the underlying data. Sharing research data for scrutiny and reuse will help drive transparency, improve cooperation and strengthen the quality of research. Access the University of Nottingham Research Data Management Repository or click here for a list of subject repositories. Many research funders now encourage or require data to be shared, especially research data that is part of a research publication. It is also a requirement of the University’s RDM policy that researchers share their data. The University Libraries’ Research Data Management website and the Digital Research SharePoint site (internal access) provides advice, guidance and information on how and when research data should be shared and what might limit or prohibit data sharing. An electronic archive of research degree theses from the University of Nottingham, offering open access to the full text wherever copyright permits. In a research context a “protocol” is a time-stamped record of the context, objectives and methodology of a project. Pre-registering and then openly sharing protocols signals engagement with a topic to the community, supporting reproducibility and countering bias in reporting outcomes. This can also be an advantage when journals have strict word limits, as you can link out to a separate description of methods. There are methods sharing websites, such as protocols.io, where you can usually receive a DOI to make your protocol easily citeable. Registering of systematic review protocols is well established in medicine and health sciences, using tools like Prospero. Protocols associated with other disciplines can be registered in Open Science Framework (OSF) or a domain-specific registry. Software that is created during the course of your research, either as a way of analysing your data, or as a research output in itself, can be shared openly similarly to sharing data or journal articles. Software requires different licenses to other open research outputs to allow you to differentiate between sharing a compiled program, and sharing the underlying code. Further details can be found on Choose a License. Software can be shared through the UoN data repository or through external platforms such as GitHub or Open Science Framework. For the purposes of research assessment, it’s important that the quality, value and impact of individual research outputs are all considered. A broad range of impact measures should always be used in recruitment, promotion and funding decisions, which look beyond the publication channel, journal metrics or publisher. Here at Nottingham we support the core principles set out in the San Francisco Declaration on Research Assessment (DORA), became a signatory in 2019 and have developed our own set of core principles to promote responsible use of research metrics. More information can be found on the library page including a publications checklist."
        }
    ],
    "pdf_files": []
}