{
    "url": "https://www.nottingham.ac.uk/research/groups/crelm/index.aspx",
    "content": [
        {
            "p": "The Centre for Research in Educational Leadership and Management (CRELM) focuses on how leadership is done, for what purpose, and by whom, in educational settings from the early years to higher and adult education. We aim to understand leadership and governance in education. We address questions about purpose, for example: We address questions about how leadership is done. For example, we draw on diverse leadership models, social and critical theories to recognise the complexity of leadership principles, structures and processes as they operate in interconnecting educational and social systems. We address questions about who does leadership, and how leaders prepare for and develop their leadership. We believe educational leadership is enacted by policymakers, formal post-holders, teaching and support staff, students and families. We ask questions about the representation of women and other marginalised groups in leadership. We investigate leadership preparation and development. We also provide professional leadership learning for beginning and serving teachers and leaders through our popular MA Educational Leadership and Management programme. We investigate the enactment of education policy. We adopt critical perspectives to analyse unequal power structures in policy, leadership and management and their effect on learning and the work of teachers and leaders. As social scientists we use quantitative, qualitative and mixed methods methodologies to generate empirical data from close-to-practice leadership and governance. We investigate leadership in educational settings in learning phases from early years to higher and adult education. We are a diverse group of scholars from diverse backgrounds at different stages of our research careers. At the heart of our research projects, is our passion for recognising diversity, promoting inclusivity, and successful leadership for learning, leadership for social justice, socially just and culturally responsive leadership. We undertake research in multiple international contexts, including with a valued and vibrant group of postgraduate researchers. We share our research by publishing books and in international peer reviewed journals, presenting at international conferences, giving keynote talks across continents and engaging in multi-media. Themes that are particulary associated with CRELM are: Research in educational leadership has a long history at the University of Nottingham. Our research centre is one of the biggest in the UK. Our research is impactful. We are a centre of excellence in leadership research. Our scholars are included in the top five most cited in our field globally. Our research is insightful. We work closely with local schools and trusts by contributing to leadership development programmes. Meet the CRELM team Key CRELM projects Join the CRELM team See all School of Education news See all School of Education events Centre for International Education Research Centre for Research in Human Flourishing Learning Sciences Research Institute Observatory for Mathematical Education Researching Inclusion and Social justice in and through Education (RISE) Centre CRELM in Malaysia School of Education University of Nottingham Jubilee Campus Nottingham, NG8 1BB +44 (0)115 951 4543"
        }
    ],
    "pdf_files": []
}