{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Vengadeshvaran-Sarma.aspx",
    "content": [
        {
            "p": "Exploring inclusive growth in Asia My research focuses on development and inclusive growth. I aim to understand how poor or marginalised communities are affected by state policy and how they respond to it. I’m working on three broad thematic areas: (1) labour migration (2) land acquisition (3) education and the labour market. My current work spans across India, Indonesia, Laos, Malaysia, Nepal, Sri Lanka, and the Philippines. You can read more about my work on land acquisition HERE. My work on education and the labour market focuses on policies for reducing educational inequalities and on how persons with disabilities (PWDs) can be helped to become entrepreneurs and active participants of the economy through targeted entrepreneurship training and mentorship. Engaging policy makers can be challenging. Much of our work focuses on learning from and improving the life of poor and marginalised communities. It’s important that our findings and recommendations translate to tangible policy making so that the welfare of the poor and marginalised can be improved. Our biggest struggle is ensuring that our research informs policy making. We continue to work with local think tanks, NGOs and the University of Nottingham’s Institute for Policy and Engagement to enable our research reach policy makers. The University supports our research in many ways. The Research and Knowledge Exchange Hub offers us support in connecting us with funding bodies, providing us with advice on research proposals, etc. The Institute for Policy and Engagement provides us with support in writing impactful policy briefs and advice on reaching out to external stakeholders who influence policymaking or work with multilateral donor agencies. The University also provides an excellent environment that fosters research and encourages interdisciplinary and collaborative research both within and outside the institution. In our collaborative work on migration, we’re now studying how parental migration affects other members in the household and how government policy aimed at lowering female migration is affecting households, especially intergenerational wealth transfers between mothers and their daughters. In my partnership on land acquisition, we’re continuing to explore various frameworks for land acquisition that can lead to more sustainable land acquisition practices across the global south. We are studying frameworks that have worked well in the developed world and exploring newer frameworks such as blockchain based land management. On educational inequalities in Sri Lanka, we’re now assessing how educational inequalities contribute to labour market inequalities and how they perpetuate a vicious cycle that disadvantages marginalised and poor communities. With regards to persons with disabilities, we’re exploring how they’re affected by the C0VID-19 pandemic and what additional training or mentorship may help them in their entrepreneurial ventures. We are also exploring on working with other stakeholders in assisting this group of individuals to carry out their ventures even when they are faced with external crises. I hope to see my research have a direct influence on policy making in developing countries. I continue to engage with government agencies (education agencies in Sri Lanka), NGOs (land acquisition related work in Nepal and India) and the private sector (for research on people with disabilities in South East Asia) in developing multilateral frameworks that are research-led, inclusive, sustainable, and solve pertinent issues that affect the poor and/or marginalised communities. I’m hopeful that this work will foster more inclusive growth strategies across the Asia Pacific and the developing world at large. While my research currently impacts particular groups directly, my goal is to achieve influence in policy making more broadly in order to benefit wider society. It is important to frame good research questions. In dealing with development issues, a good starting point may be to focus on current issues faced by poor or marginalised groups. It is also very important to engage with multiple stakeholders, especially policy makers, NGOs and community groups that can inform research and further amplify its impact. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}