{
    "url": "https://www.nottingham.edu.my/Research/Clusters/Interdisciplinary-Research-Clusters.aspx",
    "content": [
        {
            "p": "Discover how our research transforms lives and shapes the future. We are committed to using research to improve the quality of life in our rapidly changing world. Our research is organised around five major focal points - our five Interdisciplinary Research Clusters (IRCs) IRCs break down the traditional disciplinary boundaries. They emphasise a culture of collaboration, and serve as incubators for new ideas and innovation. IRCs create a supporting framework that enables our researchers to deliver scientifically-leading and impactful research. The earth’s population is estimated to increase by another 2 billion people by 2050. Producing enough food to sustain this growth is a major challenge, especially as the world grapples with a changing climate and environmental issues. As we face the critical challenges of food scarcity, Future Foods is geared towards finding new ways to sustainably feed the world, while acknowledging the complex and multi-dimensional layers of this pressing global issue. Under MiND, we deep dive into how conditions that arise from brain dysfunction, such as autism, attention-deficit/hyperactivity disorder, Alzheimer’s disease, and more affect quality of life, educational achievement and mental well-being of children, adolescents and adults. Our research is situated within a wide range of settings, including educational institutions and the workplace or society. We are stewards of the planet we inhabit. The Sustainable Environments cluster is dedicated to conducting impactful interdisciplinary research to understand and resolve a range of environmental problems and challenges faced by our planet; our goal is to find solutions to ensure a more sustainable, equitable and resilient world. The Sustainable Environments cluster converges around six (6) focal areas that align with the UN’s Sustainable Development Goals (SDGs). Asia is undergoing a swift transition from communicable to non-communicable diseases (such as diabetes, Cardiovascular diseases (CVDs), and cancer), driven by shifting epidemiological patterns within its population. Through this cluster, we address the urgent need to generate research-based evidence to facilitate the development of systemic disease control strategies to tackle the rising burden of non-communicable diseases (NCDs) in Asia. Industrial Revolution 4.0 (IR4.0) is marked by the convergence of several cutting-edge technologies, enabling a new era of industrialisation. This cluster works to advance the seamless integration of cyber-physical systems to revolutionise industrial operations, through multi-disciplinary research that combines physical processes, computer algorithms, and smart systems. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}