{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Preserving-Malaysia-as-one-of-the-world's-major-biodiversity-hotspots.aspx",
    "content": [
        {
            "p": "Rivers are the arteries of our planet. Teeming with life, they are home to many different plant and animal species. Since ancient times they’ve been essential for human survival too. Nowadays, we put a lot of pressure on river water resources for drinking, for irrigation, as a coolant in industry, and for producing hydroelectric power. The more we use, the less is available for the aquatic organisms living in our rivers, and this ultimately has a detrimental impact on biodiversity. Our researchers are working to understand these impacts and are sharing their knowledge with governments, conservation agencies and commercial organisations to help them operate in more environmentally sensitive ways. Professor Chris Gibbins is a hydro-ecologist in the School of Environmental and Geographical Sciences. His work focuses on understanding the links between habitat conditions and animal and plant life in rivers and wetlands. He’s passionate about working hand in hand with major partners to find solutions that balance our need for water with the health of rivers and the ecosystems they support. His current work focuses on hydroelectric power. Paradoxically, while hydropower is seen as a green form of energy production, it can be very damaging to the environment, most notably by modifying flows in the rivers downstream from dams. These flow changes tend to be damaging to river ecosystems. For example, patterns and volumes of water released from dams can alter river channels, sometimes causing erosion and sometimes causing the bed to become unnaturally stable; such alterations can threaten the local fish populations, as well as other species. Prof Chris is actively working on a number of projects around the world. Partnerships include hydropower companies in Malaysia and an ongoing series of projects in Spain, funded by the Spanish Ministry of Science. One strength that attracts both national and international partners is his ability to draw on a multidisciplinary team, whether from Malaysia or elsewhere. These experts provide specialist knowledge and skills in river geomorphology, flow hydraulics, and remote sensing - to name but a few. Another strength is the application of innovative monitoring and analytical tools. For instance, his team uses drones fitted with thermal sensors to map water temperatures downstream from dams. We know that dams typically release water that differs in temperature from that in rivers, so this information can be used to assess the magnitude of temperature effects and how far downstream thermal impacts extend. He also used drones fitted with standard digital cameras; these images can be used to build 3-D models and simulations (‘virtual rivers’) to assess the impact of dams on the habitat on fish and other animals. The future of the world’s rivers depends on sustainable water management. Workforce capacity, public engagement and conservation policies all have an important role to play in achieving impactful long-term change. Prof Chris’s work shows a commitment to all of these activities. While influential partnerships such as with the World Wildlife Fund and the Malaysian Nature Society are crucial for translating his work into tangible on-the-ground impact, Prof Chris recognises that training the next generation of river scientists is also vital if Malaysia is to lead the way in river conservation and sustainable water management across the ASEAN region. To this end he leads a group of 8 post-graduate students, all Malaysian and all committed to river conservation, click HERE to read more. So far it’s been very encouraging to see how committed hydropower companies are to operating dams in more environmentally sensitive ways. Achieving sustainable water management will not only preserve Malaysia’s rich natural heritage, but will also help to secure the livelihoods of its people that rely on rivers for food. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}