{
    "url": "https://www.nottingham.ac.uk/research/groups/rehabilitationmedicine/index.aspx",
    "content": [
        {
            "p": "The aim of our group is to assess the impact of long term conditions on everyday life and to evaluate the effectiveness of different rehabilitation approaches. We seek to strengthen the evidence base that underpins rehabilitation practice and to gain a better understanding of the factors that can help reduce the impact of disability and improve quality of life. odio. Long term neurological conditions can occur at any age, they can progress in severity over time and are often associated with multiple physical or cognitive impairments. Collectively, these impairments can have an impact on several aspects of everyday life such as walking, communication, swallowing and memory. The treatment required is often complex and involves several statutory and voluntary agencies. Further research is required to improve management, particularly of rare neurological conditions. We have well established connections with patient groups and with colleagues in a variety of disciplines and relevant clinical services, which are an invaluable resource when planning new initiatives. 1. Prevalence and impact of chronic oedema in people with long term conditions We are conducting studies to determine how commonly chronic lower limb oedema occurs in people with multiple sclerosis. We are also assessing the impact of oedema on everyday life to gain a fuller understanding of the priorities for rehabilitation services in the management of chronic oedema. 2. Prevalence and management of dysphagia in people with long term conditions We have assessed efficiency of swallowing and coordination of respiration during swallowing in children and adults with a number of long-term conditions. Currently, we are assessing the management of dysphagia in people with multiple sclerosis, Parkinson’s disease and muscular dystrophy when they are admitted to hospital as an emergency. We are also studying the factors that influence decision making and determine when clinicians refer patients for specialist swallowing and nutritional assessments. 3. Physical activity and fatigue in people with neuromuscular conditions We have assessed the levels of physical activity and the impact of fatigue in those with neuromuscular conditions. Currently, we are assessing a pilot multidisciplinary intervention to manage fatigue in people with Charcot-Marie-Tooth disease. 4. Management of mobility impairments in children with cerebral palsy People with cerebral palsy often find it difficult to walk. In some instances, people are advised to wear orthoses (plastic splints that extend across the foot and ankle to control movement) when walking. However, the process by which ankle-foot orthoses are fitted can be subjective as it is often determined by observation alone. We are using several objective methods to determine if ‘fine-tuning’ orthoses can improve efficiency of walking. 5. Health and social interventions for people with myotonic dystrophy type 1 (DM1) We are collaborators on a number of national and international projects concerning DM1, and have recently initiated a local project to assess how the cognitive and behavioural impairments in DM1 affect social functioning and use of health services. 6. Management of spasticity in people with long term neurological conditions We have participated in a number of international trials concerning the use of botulinum toxin. We are also leading a multi-centre study (CHASM) designed to assess the unmet treatment needs of people with neurological conditions who have spasticity and live in care homes. We have published a variety of research articles and reports commissioned by the Department of Health on aspects of rehabilitation and concerning the evaluation of medical and specialist assistive technologies. View individual profiles for more publications. We are involved with a number of important national organisations and rehabilitation groups, such as the British Society of Rehabilitation Medicine and the College of Occupational Therapy. Staff in our group have contributed to the work undertaken by these groups and have also contributed to the postgraduate education of many current and senior members of these organisations. We also act as external examiners, referees for a wide variety of national and international peer-reviewed journals and charitable, professional and Department of Health research committees. We offer projects on various aspects of rehabilitation and the assessment or management of young people and adults with long term neurological conditions. PhD opportunities in the School of Medicine Group members Division of Medical sciences and Graduate Entry Medicine The University of Nottingham Royal Derby Hospital Uttoxeter Road Derby DE22 3DT telephone: +44 (0) 1332 724622 email:gem@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}