{
    "url": "https://www.nottingham.ac.uk/research/groups/cadre/home.aspx",
    "content": [
        {
            "p": "The Centre for Ancient Drama and its Reception (CADRE) was founded by the University of Nottingham’s then Department of Classics in 1998 to promote research on Greek and Roman drama and its impact on later traditions. It now sits within the Department of Classics and Archaeology. CADRE was founded to provide a framework (in French, un cadre) for the study of ancient drama by staff, students and visiting scholars at the University of Nottingham. The international reputation of Alan Sommerstein’s work in Greek comedy and tragedy has attracted many collaborators and students to Nottingham over the years; the growth of the Department of Classics in the early 2000s brought in more Greek drama scholars as well as expertise on Roman drama and on a variety of aspects of Reception (including African reception, opera, and television). Links have also been made with colleagues in other schools and departments (German, Music, English Studies). Please see the Members page for details of individuals’ expertise. CADRE links scholars across the world who have worked and studied at Nottingham; former students, post-docs and visiting scholars continue to work together on conferences, publications and public engagement, in a true spirit of international collaboration. Department of Classics and Archaeology Research Seminar programme Departing the Polis Greek Tragedy on the Small Screen blog Sacrificing Iphigenia through the ages Edmund Stewart (Director) Heike Bartel (Nottingham) Lynn Fotheringham (Nottingham) Naomi Scott (Nottingham) Alan Sommerstein (Nottingham) Judith Fletcher (Wilfrid Laurier University) Lynn Kozak (McGill) Cressida Ryan (Oxford) CADRE Facebook @tv_tragedy Department of Classics Facebook @UoNClassics Argonauts and Emperors blog Department of Classics and Archaeology University of Nottingham Nottingham, NG7 2RD telephone: +44 (0)115 951 4800 fax: +44 (0)115 951 4811 email: Naomi Scott, CADRE Director"
        }
    ],
    "pdf_files": []
}