{
    "url": "https://www.nottingham.ac.uk/research/covid-19/covid-19-emergency-appeal/covid-19-emergency-appeal.aspx",
    "content": [
        {
            "p": "Together, all over the world, we are battling with the impact of Covid-19 on human health and the global economy. With your support, we can overcome these urgent challenges. Our team of leading multidisciplinary researchers are developing a Covid-19 vaccine, looking for new treatments and looking beyond this outbreak to identify future threats. Meanwhile, we are doing all we can to support every student suffering financial hardship as a result of the pandemic. Donate now Our leading researchers are using their extensive virology knowledge to help develop a safe and effective vaccine to prevent Covid-19. Led by Professor Lindy Durrant, in collaboration with colleagues and partners Scancell, work is underway to adapt an existing cancer vaccine platform for use against Covid-19. This DNA vaccine has potential to provide a vital effective and durable immune response to Covid-19. The vaccine has potential to also protect against new strains of coronavirus that may arise in the future. Alongside work on the vaccine, experts at our Centre for Research on Global Virus Infections are also involved in developing novel treatments for Covid-19, as well as assessing the risk for future pandemic events. They have already identified new coronaviruses in rodents. We now need to investigate their potential to jump species and establish new outbreaks in humans. Your support will go directly to our essential research efforts – finding the best vaccine to combat Covid-19, discovering vital new treatments and protecting the world against future outbreaks. The coronavirus pandemic has created overwhelming hardship for many of our students at home, in the EU and internationally. Our Student Services team has stepped in to provide the financial support desperately needed, enabling students to safely return home to loved ones and continue their studies without distraction. Annually the University allocates over £300,000 to support students through times of hardship and crisis, but we are already seeing unprecedented need and expect this to continue increasing as students and their families feel the financial effects of the pandemic. We are already seeing a notable increase in applications for financial support, with many family members losing jobs and students finding it more difficult to continue part-time work to support themselves – and these applications may well increase when students return in autumn too. Over 200 students have so far applied for emergency financial assistance directly as a result of the pandemic and we have already received 45 requests for help based on anticipated hardship which we cannot support at this time. This is where you can help change lives. By contributing to our crisis and hardship funds, you will help ensure that students have the essential financial support they need to continue their studies. We bring together virologists across veterinary and human virology. The University of Nottingham has a leading vet school and a leading medical school – this rare combination allows us to fully understand the dynamic interplay between animal and humans that allows deadly spillover events like the coronavirus outbreak to occur. Working with active clinicians means our ideas and inventions can be rapidly progressed to help prevent and treat current and future virus outbreaks.” Professor Jonathan Ball, Director, Centre for Research on Global Virus Infections To lead the fight against Covid-19, protect against future outbreaks and ensure we can offer support to any student suffering hardship, we urgently need your support. Donating to our Emergency Appeal will advance our essential coronavirus research and emergency student support, including: Donate now to this critical work"
        }
    ],
    "pdf_files": []
}