{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Creating-a-harmonious-co-existence-between-humans-and-the-Malaysian-elephant.aspx",
    "content": [
        {
            "p": "A global and immediate crisis that mankind is facing alongside climate chance, is biodiversity loss. This finding presented by the Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services (IPBES) in 2019 underscores the importance of conserving Malaysia’s remaining wildlife species. In just 40 years, Peninsular Malaysia has lost 68% of its elephant range in human-occupied landscape and two thirds of the remaining range are experiencing human-elephant conflict. The existence of this giant pachyderm now depends on how willing people are to tolerate living with elephants in the same landscape. The University of Nottingham Malaysia is proud to be a leading partner in a long-standing collaboration with Yayasan Sime Darby and the Department of Wildlife and National Parks Peninsular Malaysia (PERHILITAN) that’s advancing elephant conservation efforts here in Malaysia. The Management and Ecology of Malaysian Elephants (MEME) project is one of our pioneering sustainability programmes, established in 2011. Prior to MEME’s inception, there was no long-term study on Malaysia’s elephants. But thanks to the support of our partners, we’ve been able to study the impact of translocation on wild elephants, the role of elephants in the ecosystem, and the challenges faced by communities residing close to elephant habitats. To do this we’ve used a range of scientific methods, such as geospatial mapping patterns of elephant movement using GPS collars, ethnographic study of indigenous communities, biochemical (hormone) analysis, and evaluation of government policies to name but a few. MEME’s current Principal Investigator is Dr Wong Ee Phin, an Assistant Professor in the School of Environment and Geographical Sciences. Her current research focuses on managing human-elephant conflict to promote coexistence among agricultural communities including smallholders and plantations. Our research findings have helped us to understand how and why elephants damage palm oil plantations and other food crops. For example, in one study looking at over 200,000 damaged palms, we found that 99% of crop damage involves trees aged 5 years and below, indicating the possibility for elephants to move in areas comprising of older trees where it is less likely to incur damage. Fostering people’s tolerance and improving their co-existence with elephants is key to ensure the species’ well-being and survival. In the third phase of MEME, Dr Wong will be using an interdisciplinary approach incorporating social sciences, psychology, economics and elephant behaviour, and in assessing new evidence-based standard operating procedures that are intended to champion co-existence between humans and wild elephants. The MEME team will work with local communities to test the efficacy of these procedures, as well as in encouraging different stakeholders in Malaysia to adopt elephant-friendly policies. The University of Nottingham Malaysia is playing a vital role in preserving the role of wild elephants in Malaysia’s ecosystem by enabling local authorities and other policymakers to make evidence-based decisions. The sheer ambition and scale of the MEME programme is remarkable, but complex questions require equally complex answers if we are to succeed to changing practice. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}