{
    "url": "https://www.nottingham.ac.uk/research/groups/csp-cs/index.aspx",
    "content": [
        {
            "p": "We facilitate cutting-edge research into and debate on the interrelations between war, conflict, history, culture, gender and national identity. Because conflict is timeless and universal, we consider the study of post-conflict societies, worldwide, from classical and medieval to modern times to be our remit. The Centre brings together academic staff and research students from various fields within the university, as well as creating research links and networks between Nottingham academics and UK and international partners. It forms part of a much broader International Consortium for the Study of Post-Conflict Societies and is currently the ‘host’ research centre for the work of the International Consortium. The Centre was originally founded in Nottingham in 2004 as the Centre for the Study of Post-Conflict Cultures. Since that time, it has coordinated academic activities at Nottingham in the field of post-conflict studies, organised regular international colloquia and conferences, and published research findings in the series Studies in Post-Conflict Cultures of (CCCP Press). From its inception, the Centre has also attracted distinguished and ground-breaking researchers from a growing network of international universities and centres of excellence outside the university sector, as well as providing mentorship for early-career academics at the university and beyond. In 2012, the Centre was a founding member of the International Consortium for the Study of Post-Conflict Societies, and it is currently the host research centre for the activities of the consortium. Both bodies foster research in the area of empirical and theoretical war, conflict and post-conflict studies. The Centre has two major areas of activity: The Centre has a comprehensive historical and interdisciplinary profile. It has addressed historical periods and cultural areas from medieval to contemporary conflicts in such topics as: The Consortium's profile spans the following disciplines: Cuba research The University of Nottingham School of Cultures, Languages and Area Studies University Park Campus, NG7 2RD email:rui.miranda@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}