{
    "url": "https://www.nottingham.ac.uk/research/groups/experimental-medicine-metabolic-and-nutritional-physiology/home.aspx",
    "content": [
        {
            "p": "Part of the Division of Physiology, Pharmacology and Neuroscience within the School of Life Sciences, our research efforts are focussed on the study of metabolic and nutritional physiology in the context of health and disease. Our outstanding human volunteer research facilities housed in the David Greenfield Human Physiology Unit enables us to use integrative physiology and exprimental medicine approaches which are delivered by specialist clinical and research staff. We also deliver excellent multidisciplinary post-graduate research training activity to meet current UK skills gaps. Our research straddles schools and institutional research centres of excellence, producing impactful collaboration. We have close links with colleagues at the Centre of Metabolism, Ageing and Physiology and the Sir Peter Mansfield Imaging Centre. We are core members of established research centres of excellence, including the Medical Research Council/Versus Arthritis Centre for Musculoskeletal Ageing Research, the Centre for Sport, Exercise and Osteoarthritis Research Versus Arthritis, and the NIHR Nottingham Biomedical Research Centre. How to find us School of Life Sciences Division of Physiology, Pharmacology and Neuroscience (PPN) Follow us on X Follow us on Instagram Get involved in our latest research studies Learn more about our current teaching programmes Find out about our teaching and research facilities We currently have a wide range of research studies ongoing and a currently recruiting volunteers for: CHAIN I: Concurrent multi-organ response to CHronic physical Activity and INactivity intervention, to increase research discovery in human health and wellbeing CHAIN II: Concurrent multi-organ response to CHronic physical Activity and INactivity intervention, to increase research discovery in human health and wellbeing CRNitrateMRI Study: The combined effects of beetroot juice and caloric restriction on the brain and vascular functions Leucine Study: Leucine supplementation strategies to enhance muscle anabolic responses in older age Menopause & Muscle Mass Study: Muscle mass, quality, and the menopause; sex-specific strategies to mitigate sarcopenia in ageing population Menopause & Muscle Repair Study: The importance of oestrogen in the muscle repair process; Implications for the menopause Pectin Study: The impact of pectin fibre intake on appetite in older adult Sodium-MRI Study: Investigation of the impact of high load eccentric exercise on muscle damage and recovery in health, young male volunteers using sodium MR imaging methods David Greenfield Human Physiology Unit School of Life Sciences Medical School University of Nottingham Nottingham, NG7 2UH"
        }
    ],
    "pdf_files": []
}