{
    "url": "https://www.nottingham.ac.uk/research/groups/renal/index.aspx",
    "content": [
        {
            "p": "The Centre for Kidney Research and Innovation (CKRI) aims to deliver an innovative programme of clinical and translational research in the areas of kidney disease and dialysis therapy, which will directly lead to improvements in treatments and outcomes for patients. Broadly speaking the research can be divided into 3 themes: i) chronic kidney disease, ii) acute kidney injury and iii) dialysis treatment. The kidney plays a central role in the elimination of waste products of metabolism, in regulating body water content, in controlling blood pressure and has several important endocrine functions. Perception of the importance of kidney health is generally low; kidney disease is often silent and goes unrecognised. Research has an important role in better describing the prevalence and the impact that kidney disease has on patients, to develop new techniques of detecting and imaging kidney damage, and to develop better treatments. The latter includes improvements to dialysis therapies, which at present are life saving but have significant complications and can negatively affect patients' quality of life. Chronic Kidney Disease (CKD) refers to kidney damage over months to years that increases the risk of developing kidney failure and cardiovascular disease. However, not everyone is at the same risk. We are improving understanding of these risks and developing better methods to predict them. Acute Kidney Injury (AKI) means a sudden reduction in kidney function over hours to days. AKI is common and associated with dramatic reductions in life expectancy. We are researching methods of improving detection of AKI in clinical practice, better delivery of basic care to patients with AKI and discovering new ways of identifying patients who may be at risk of long term complications. Dialysis treatment is associated with negative effects on the heart, brain, bones and muscles. We are investigating why these changes happen so we can develop and test new techniques and methods of delivering dialysis to better prevent these. See current projects We have published in peer reviewed journals on all of the above subjects. Please see individual staff profiles for our publications. We are involved in multiple national and international collaborations. Prof Taal is President-Elect of The British Renal Society, which seeks to promote multi-professional working and research in the kidney community and is also Co-Chair of the UK Kidney Research Consortium’s CKD Clinical Study Group. Dr Selby is Chair of the UKKKRC’s AKI Clinical Study Group. Together these external roles help us to remain at the forefront of kidney research. We also are involved in active collaborations with the Universities of Leeds, Cardiff, Surrey, Southampton, Western (Ontario) and, the UK Renal Registry. More news from the Division of Medical Sciences and Graduate Entry Medicine There are no results that match your criteria. More events in the Division of Medical Sciences and Graduate Entry Medicine PhD opportunities Radiological Sciences Sir Peter Mansfield Magnetic Resonance Centre Group members The University of Nottingham Royal Derby Hospital Uttoxeter Road, Derby, DE22 3DT telephone: +44 (0)1332 724622 email:gem@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}