{
    "url": "https://www.nottingham.ac.uk/research/groups/cier/index.aspx",
    "content": [
        {
            "p": "The Centre for International Education Research (CIER) aims to advance understanding of global and local educational practices, policies, and theories by fostering interdisciplinary research and collaboration across diverse cultural and geopolitical contexts. We collaborate with a range of institutions, organisations and individuals including NGOs, policy makers and politicians to generate impactful insights that promote sustainable equity and innovation in education worldwide. Our research seeks to enable education as lifelong and life-wide practice that promotes social, ecological, environmental and epistemic justice as well as equality, citizenship and democracy. CIER has a long history within the School of Education. We explore the complexities of educational systems, the interplay of global and local influences, and the development of policies that support inclusive and equitable education for all. Our research is driven by a commitment to understanding and addressing the challenges faced by educational institutions and communities globally. We investigate how educational practices can be improved to foster better learning outcomes and social justice. By examining the intersections of culture, policy, and practice, we aim to contribute to the development of educational environments that are responsive to diverse needs. At the core of our activities is a dedication to promoting equity and innovation in education. Our research informs educators, policymakers, and practitioners, providing them with the knowledge and tools to create more effective and inclusive educational systems. We draw on a wide range of theoretical perspectives and methodological approaches, including sociological, historical, philosophical, decolonial, self-reflexive, and statistical analysis. Through our interdisciplinary approach, we seek to ensure that our research has a tangible impact on educational practices and policies worldwide. Themes that are particularly associated with CIER are: This theme emphasises the importance of global collaboration in enhancing educational practices and skills development. It addresses the integration of cultural and environmental education to tackle global challenges, the promotion of social and vocational education in diverse contexts, and the empowerment of individuals and communities through innovative educational models. The focus is on building capacity, fostering economic and sustainable empowerment, and improving educational outcomes through international partnerships and community engagement. This theme underscores the need for systemic and sustainable changes in education, driven by collaborative efforts and knowledge exchange among stakeholders from various sectors. A key component of this theme is the UNESCO Chair in International Education and Development, which unites key stakeholders to develop strategic, transdisciplinary solutions for systemic change in global education, focusing mainly on Africa and Asia. It addresses internationalisation, decolonisation, capacity building, curriculum design, teacher training, and leadership, contributing significantly to the Sustainable Development Goals by fostering quality education and global citizenship. Meet the CIER team Key CIER projects Join the CIER team Centre for Research in Educational Leadership and Management Centre for Research in Human Flourishing Learning Sciences Research Institute Observatory for Mathematical Education Researching Inclusion and Social justice in and through Education Centre CRIE in Malaysia School of Education University of Nottingham Jubilee Campus Nottingham, NG8 1BB +44 (0)115 951 4543"
        }
    ],
    "pdf_files": []
}