{
    "url": "https://www.nottingham.ac.uk/research/groups/tib/index.aspx",
    "content": [
        {
            "p": "Welcome to the Translational Infection Biology Research Group at The University of Nottingham’s School of Veterinary Medicine and Science. Together, we’re breaking new ground in science and technology and tackling issues with huge medical, societal and economic relevance. At the heart of everything we do is one central aim: to enhance worldwide health and quality of life by fighting infectious diseases. Our research aims to expand the understanding of pathogens and their interaction with the hosts they infect. We’re achieving this by specifically connecting genetic sequences to the molecular mechanisms that underlie the progression and transmission of infectious disease. While scientists can already rapidly generate genomic data from pathogens, in each genome there remains a high proportion of uncharacterised sequences. This means there’s a pressing need to directly correlate more sequences with their functionality, identifying elements important for infection and disease. Here at The University of Nottingham, our multidisciplinary team is meeting this challenge by combining machine learning, bioinformatics, synthetic biology, mutation mapping technology and phenomic analysis. We’re developing clear pathways from genomic sequencing to real understanding of biochemical function, host interaction and other microbes present. Combined with population prevalence and variation information, this vital new knowledge provides an innovative framework for developing novel diagnostics, therapeutics and vaccines with the potential to control microbes that cause infectious diseases. Our research is focused around four key themes, each an example of research excellence in the biological science of infection, big data analysis and processing. Collaborating in an interdisciplinary way gives us the synergy to stimulate innovative approaches, identifying new and novel solutions to combat some of today’s most challenging conditions. Discover our work on insertional mutation mapping systems and connecting genetic sequences to phenotypes. Find out how we’re mapping the antimicrobial resistance of ESKAPE pathogens and developing phage-based control strategies. Explore our multi-faceted approach to analysing microbiomes and the way they change in relation to health and disease across a range of animal species. See how we’re breaking new ground in genomics, bioinformatics, system and computational biology, data mining, machine learning, algorithm design and software engineering. The Advanced Data Analysis Centre (ADAC) gives us the vital infrastructure to undertake advanced data analysis in multi-disciplinary contexts. ADAC offers skilled data analysis expertise, involving several types of data across varied subject areas and applications. Find out more about our staff and their fields of speciality Find out about study opportunities aligning to our research The University of Nottingham School of Veterinary Medicine and Sciences Sutton Bonington Campus Nottingham, LE12 5RD Contact us: Associate Professor Sabine Totemeyer Dr Sharon Egan"
        }
    ],
    "pdf_files": []
}