{
    "url": "https://www.nottingham.ac.uk/research/groups/rph/index.aspx",
    "content": [
        {
            "p": "Welcome to the Ruminant Population Heath Research Group at The University of Nottingham’s School of Veterinary Medicine and Science. We conduct cutting-edge research into the health and welfare of UK cattle and sheep, with a special focus on endemic disease in populations. Together, we aim to enhance knowledge of the causes, detection, treatment and prevention of disease and poor welfare. We transfer our research findings effectively throughout the relevant sectors to help the agricultural industry become more profitable, robust and sustainable. We’re a thriving research community, proud to work in close collaboration with farmers, vets, retailers, consumers and a whole host of other stakeholders across the UK livestock industry. Our multidisciplinary research explores the experiences and attitudes of all of these groups and the impact they have on today’s farming practices – as well as tomorrow’s livestock industry. Working to improve the health and wellbeing of dairy cows, and the sustainability of the industry, by conducting research of international quality and collaborating with farmers to create powerful new resources for on-farm use. Spanning epidemiology, flock health welfare and production, our multidisciplinary research aims to improve the health and welfare of sheep flocks and drive positive change on UK farms. Using both traditional on farm data collection and innovative technologies including wearable sensors and livestock-based internet of things, to capture ‘big data’ on ruminant health and welfare. Using sociology, psychology, economics and consumer science to understand the attitudes of farmers, vets, retailers and consumers – and their impact on the livestock industry. Find out more about our staff and their fields of speciality Find out about study opportunities aligning to our research Discover the latest news School of Veterinary Medicine and Science University of Nottingham Sutton Bonington Campus Leicestershire, LE12 5RD"
        }
    ],
    "pdf_files": []
}