{
    "url": "https://www.nottingham.ac.uk/research/groups/models-to-crops/index.aspx",
    "content": [
        {
            "p": "Understanding the fundamental mechanisms controlling plant development (Strand 1) will allow the development of knowledge-based strategies for crop improvement to address the challenge of Global Food Security. Research in Strand 2 focuses on investigating key developmental processes in plants using Arabidopsis and other model species, e.g. Petunia, and translation of that information for modulating key traits in major crop targets that include wheat, rice, Brassica and tomato. Projects often have industrial sponsorship along with funding from the RCUK. The Bennett lab uses systems analysis to understand the biological basis of root architecture involving a multidisciplinary and multi-scale approach working with colleagues in the Centre for Plant Integrative Biology. Zoe Wilson works on regulating crop fertility for increased yield and sustainable agriculture using Arabidopsis and translating the information to cereals. The overall aim of this work is to develop tools/understanding for targeted breeding and hybrid formation to enhance crop yields under varying environmental conditions. Tim Robbins is focused on self-incompatibility in plants using Petunia as a model system. Neil Graham is exploiting comparative genomics and transcriptomics between Arabidopsis and crop species, focusing on mineral nutrition in Brassica. Using Systems Biology approaches to understand the mechanisms controlling root growth and development and use this information to reengineer crop root architecture (Malcolm Bennett). Regulation of crop fertility using model plant systems to understand the molecular mechanisms regulating pollen development and release and then translation of this information to cereal crops for yield enhancement (Zoe Wilson). Abiotic and Biotic Stress Fundamental Research Using Model Plants Cereal Crops Fruit and Vegetable Crops Centre for Plant Integrative Biology - CPIB Nottingham Arabidopsis Stock Centre Crops for the Future Research Centre - CFFRC The University of Nottingham A04 Plant Sciences, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 3255 email:malcolm.bennett@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}