{
    "url": "https://www.nottingham.ac.uk/research/research-areas/index.aspx",
    "content": [
        {
            "p": "We are committed to addressing the key challenges of our age through collaborative research and partnerships that brings together academics from across subject areas. Our five interdisciplinary Global Research Themes and our flagship institutes draw upon our university’s strengths: our ability to focus the depth and range of our research, international and business partnerships and, not least, the inspirational people who are dedicated to driving innovation that will ultimately change lives. The National Rehabilitation Centre (NRC) in partnership with Nottingham Hospital University Trust (NUH) and Loughborough University are working together it will to help transform outcomes for people who have encountered life-changing injury, trauma, or illness. At the NRC, research, innovation, education, and training will be fully integrated with clinical practice. The partnership is uniquely placed to pioneer international research into clinical rehabilitation and rehabilitation products and technologies and attract experts in the field. In an increasingly connected, fast-changing world, we are faced with complex questions about identity, diversity and a sense of belonging. By understanding how we communicate, and how our cultural identities are formed, we can address these challenges and better understand our place in the world and how we relate to those around us. Understanding the role of creative, cultural and heritage industries within society to provide new insights. The world’s largest group of rights and justice scholars. Histories, stories and the value of cultural research Urgent political, social, environmental and economic challenges confront us all. The scale of these challenges demand future-proof responses that can be sustained. Our interdisciplinary approach and globally recognised expertise will help to inform research agendas, shape policy and create new ways of living to allow societies to flourish in the face of adversity. Disruptive world class research on ecological transitions in diverse societies. Solving global water challenges for generations to come. Exploring and improving public policy for policymakers, practitioners and the public. How will societies adapt to a changing world? Developing holistic solutions across transport, mobility and cities to co-create future cities. Better understanding of mathematics and computing can help deliver incredible new technologies and unpick issues of vast complexity and scope. By bringing together expertise from science, engineering, social sciences and the arts, we can use data more effectively to model behaviours, find solutions and make decisions that will have a positive impact on lives across the globe. Tackling the challenges of complex data analysis for strong societal impact. Delivering digital technology to place patients at the heart of healthcare. Enhancing therapeutics to meet clinical need. How we're using 3D printing to create structures with biological uses. Promoting interdisciplinary research collaborations to improve health and wellbeing. Harnessing diverse expertise to develop life-saving technology. It has a huge impact on how we live now and in the future. By focusing our multidisciplinary expertise across areas such as quantum systems, advanced manufacturing, and molecular materials, we will develop and deliver novel technologies that will benefit societies and truly transform the world we live in. Supporting UK manufacturing through innovation and collaboration. World class cross-disciplinary research delivering innovative molecular materials. The second quantum revolution has started."
        }
    ],
    "pdf_files": []
}