{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Discovering-sustainable-ways-to-treat-palm-oil-mill-effluent.aspx",
    "content": [
        {
            "p": "Palm oil is one of the stalwarts of the Malaysian economy. Over the past few decades, Malaysia has emerged as the world’s second largest producer of the crop and reaped the benefits of its highly productive fruit in terms of economic growth and employment. In recent years, however, the chorus of international concern over the environmental impact of palm oil has grown louder. Those opposing it decry its contribution to climate change and deforestation caused by expansion of cultivation areas. The European Union has labelled it unsustainable, even planning to ban European use of palm oil for the production of biofuels by 2030. Such a move would deal a major blow to the Malaysian economy, so it’s absolutely crucial to make palm oil production cleaner and greener. Ir Dr Chan Yi Jing, Associate Professor in the Department of Chemical and Environmental Engineering, is working towards this goal. Her work seeks to discover more efficient ways to process oil palm waste thereby creating useful by-products. Palm oil milling activities produce a wastewater that is 100 times more polluting than municipal sewage because the high concentration of organic matter requires vast quantities of oxygen to break it down. There is a silver lining however. When treated, the effluent produces biogas, and this can be harnessed to produce a renewable source of energy. Malaysian palm oil mills generally employ open ponding systems to treat the effluent, but these systems are inefficient, time-consuming, and take up a lot of space. Even then, only a fraction of the biogas produced ends up being used. The rest is lost to the atmosphere. Dr Chan’s mission is to first reduce the polluting effects of treating the effluent, then find a way to capture a greater proportion of the biogas produced and cut down on the time-consuming processes of purification, all in a cost-effective manner. To this end, she has been involved in developing a novel integrated anaerobic aerobic bioreactor. This work has already won a Biotechnology Award under highly commended category at the Institution of Chemical Engineers (IChemE) Global Awards 2018. The pilot bioreactor has demonstrated performance that is 30 times less polluting than before, and faster too. It takes just 5-7 days to treat the effluent instead of the usual 60. Additionally, the biogas produced is pure enough to be used to generate electricity right away, so that further processing isn’t required. More recently, supported by two industry grants from Cenergi Pantai Remis Sdn Bhd and the Indonesia-based Sinar Mas, Dr Chan has been investigating different operating conditions to fine-tune the treatment process. Because palm oil is such a major contributor to the Malaysian economy, international trade restrictions would be devastating. Dr Chan’s work is guiding the industry towards innovative and sustainable solutions that will change global perceptions of the palm oil sector. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}