{
    "url": "https://www.nottingham.ac.uk/research/groups/ucn/index.aspx",
    "content": [
        {
            "p": "The Urban Culture Network brings together schools and departments within the Faculty of Arts and other units within the University of Nottingham to foster interdisciplinary research on urban culture. We build links with UK and international institutions to encourage collaborative research in this area. The Network is devoted to research into the culture of cities all over the world from classical antiquity to the early Middle Ages to the present day. It offers an exciting research environment for postgraduate study, and promotes dialogue between the disciplines. The Network is dedicated to organising regular events and workshops and invites international scholars to contribute to its biennial multi-disciplinary research workshops on themes of urban culture and history, which have resulted in a number of collaborative research projects and conference papers, journal articles and books. The Centre for Urban Culture was founded by Helen Meller in History in 2000 as a counterpart to the Centre for Urban History at Leicester. The Centre was administered and staffed principally by the School of History until 2011 when it was renamed as the Urban Culture Network. From that year, the committee was represented by staff from each of the seven departments from the newly-reconstituted and rehoused School of Humanities, as well as Geography and Architecture and Built Environment. We also now have a large cohort of research students who work on urban-related themes. The Network organises regular events and workshops and invites international scholars to contribute to its biennial multi-disciplinary research workshops on themes of urban culture and history, which have resulted in a number of collaborative research projects and conference papers, journal articles and books. We have recently identified four common areas of interest that cut across much of our membership: Our interests and membership are ever-expanding and evolving, so if your research has any kind of urban dimension and you would like to explore approaches to these topics and themes in other disciplines in the university, please do not hesitate to join in. B26a Sir Clive Granger Building University Park Nottingham, NG7 2RD telephone: +44 (0) 115 95 15442 email: Jake.Hodder@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}