{
    "url": "https://www.nottingham.ac.uk/research/groups/csva/about.aspx",
    "content": [
        {
            "p": "The Centre draws together a significant range of research and expertise on the Viking Age and its aftermath, in both Scandinavia and the Viking diaspora, for the benefit of academics, students and the general public. Within the School of English and elsewhere in the University of Nottingham, academic staff, research fellows and postgraduate research students work on diverse aspects of the languages, literatures, history, and material and visual cultures of Scandinavia, Iceland, Britain and Ireland in the early and high medieval periods, and their connections with other parts of the world. The Centre – unique in its aims and scope worldwide – also acts as a focus for regional, national and international collaborations. The Viking Age (ca. 750-1100 CE) and the resulting Viking diaspora (up until ca. 1500 CE) are transformational periods in the history of northern Europe and its interactions with the wider world. Vikings were groups of Scandinavians and others of northern European origin who had a major impact on the then-known world. They explored, traded, raided and settled in regions from the Black Sea in the east to Greenland and North America in the west. The Viking impact was especially felt in large parts of England and Scotland, with parts of the latter remaining within the Scandinavian political and cultural orbit until the middle of the fifteenth century. We can trace this impact through the evidence of language, place-names, inscriptions and literary texts as well as history and archaeology. This evidence highlights the importance of gender, language and culture in understanding the period. The extensive body of literature from medieval Iceland is both a product of this diaspora and a key to understanding it. The last few decades have seen a growing interest in Vikings and the Viking Age, both in the historically-curious general public and in various branches of popular culture (especially games, music and films). Ultimately, the foundation of all such interest is scholarly research in Viking Studies, and we see it as our responsibility to make this both accessible and understandable to all. We also see it as our responsibility to counter the misappropriation of some aspects of the Viking Age by extreme nationalists, white or male supremacists and far-right groups. Only education can counter these misuses of what is a fascinating area of study. The CSVA conducts outstanding and scholarly research that has a positive and transformational impact on people and culture. We aim to do this through these core strategies: Trent Building The University of Nottingham University Park telephone: +44 (0) 115 951 5900 fax: +44 (0) 115 951 5924 email: csva@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}