{
    "url": "https://www.nottingham.ac.uk/research/groups/crhf/index.aspx",
    "content": [
        {
            "p": "The Centre for Research in Human Flourishing (CRHF) promotes the idea that flourishing is the overall goal of all education. We are interested in understanding and advancing the role of education in promoting flourishing, through studying personal growth processes, developing person-centred pedagogy for human flourishing, studying flourishing practices oriented towards optimal functioning across the life span and enhancing well-being. Applications to professional practice include work in the fields of educational, psychotherapeutic, and organisational systems. The Centre for Research in Human Flourishing (CRHF) was established in 2015 to study the processes and outcomes of optimal functioning, with interests in person-centred pedagogy, well-being education, human potential, agency and autonomy, mindfulness, character strengths, social behaviour, and human systems. The CRHF adopts an interdisciplinary approach to understanding lifelong human flourishing. We study human relations and the nature of social environments that promote or inhibit human flourishing and identify those factors that best nurture its development. We are interested in how this knowledge can be applied to support individual thriving, personal and professional growth and flourishing in policy and practice contexts. The CRHF views education as a social, relational and personal growth process, maximising the potential for people to thrive. At the heart of our activities is a humanising and compassionate approach towards identifying, developing, and supporting the processes that enable human flourishing. Our research aims to inform educators, leaders, counsellors and other helping professionals in education, social work, and health services by influencing policy development, training, and practice. Our research covers approaches to flourishing from philosophical, social, political and psychological perspectives. Themes that are particularly associated with CHRF are: The question of what is education for is at the heart of our research interest. We take the view that education of the whole person is important, and that educational systems should be concerned with facilitating the development and growth of the person cognitively, emotionally, their personality, and relationally. We provide a critical perspective on formal, traditional educational systems, how they can be harmful as well as helpful, and the ways in which educators can be involved. We have interests in developing person-centred pedagogy based on person-centred psychology. We investigate positive educational applications and their use in schools and educational institutions and have investigated the constructs of mindfulness and authenticity that are of interest in recent years. Research is supportive of the use of interventions based around these ideas, and we have also brought a critical perspective to the human capital approach to education. We see psychotherapy and counselling as educational processes, concerned with the development and growth of the whole person. We are interested in understanding the factors involved in successful therapeutic relationships and in the training of therapists, coaches, and educators in therapeutic skills, which can be transferred to the consulting room, classroom and to educational leadership. Researchers in the CRHF collaborate with educators in schools and colleges, other academics in psychology and philosophy, and practitioners in psychotherapy and counselling, to study different contexts of human development and experience. We have written textbooks for practitioners in counselling, education and psychology. Centre staff and students work closely with the Nottingham-based Human Flourishing Project (HFP) which provides individual therapy focused on personal learning, growth and development. The HFP is a research clinic directly lifting wellbeing within the city. Meet the CRHF team Key CRHF projects Join the CRHF team See all School of Education news See all School of Education events Please visit the CRHF Youtube channel to view past seminars Centre for International Education Research Centre for Research in Educational Leadership and Management Learning Sciences Research Institute Observatory for Mathematical Education Researching Inclusion and Social justice in and through Education (RISE) Centre Centre for Research in Human Flourishing Malaysia School of Education University of Nottingham Jubilee Campus Nottingham, NG8 1BB +44 (0)115 951 4543"
        }
    ],
    "pdf_files": []
}