{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Inspiring-people.aspx",
    "content": [
        {
            "p": "We have developed a new technique to process simple proteins for human consumption. Food security issues mean we increasingly need to source our protein in new, environmentally-sound ways. We do this by extracting a live organism from waste by-products. These microorganisms produce bacteria. They grow rapidly and produce an enzyme, which can be reduced to express the protein. However, this protein is not very clean, so we use our bio-separation method, called liquid biphasic flotation to separate, and purify the protein. For one litre, the technique can produce around five grams of dry protein. So, it’s highly efficient, which is why lots of industries have taken up the method. One example is the milk industry, which needs an easily-absorbed protein in its baby milk formula. Another is when some hospital patients cannot absorb protein directly from meat or vegetables. They need a special type of protein to stay healthy. Our method can specify which protein to separate and extract and supply it to those patients who can absorb it 100 per cent. In addition to the protein powder for human consumption, our lab can also produce protein for animals to eat. As part of our studies, we collect out-of-date milk from supermarkets to extract the protein. While expired bio-product cannot be used in any edible products for people; it doesn't go to waste. After we extract the protein, a liquid by-product is left. We convert this into a cheese which can feed livestock. We are working together with collaborators from Japan, China and Taiwan. We also have local research links with the University of Malaya, Universiti Sains Malaysia and Universiti Putra Malaysia. From industry, we are collaborating with pharmaceutical firms, recycling companies and milk manufacturers. We are still fine-tuning the bioprocessing system. Next, we will use electricity to increase the efficiency of the bio-product separation. We’re not only working in protein. We’re also now working in carbohydrates as well as lipid from microalgae. I hope more industries will harness this research to separate other edible compounds, minerals and vitamins. In Malaysia we have a huge livestock market, so I want the research focus to move beyond cows. Perhaps in another phase we will shift our attention to chickens or ducks. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}