{
    "url": "https://www.nottingham.edu.my/Research/Research-groups/Future-Food-Malaysia.aspx",
    "content": [
        {
            "p": "In the face of climate change we need to develop new resilient crops, and to feed the additional two billion people expected by 2050 we need to increase crop yields. The growing prevalence of pollutants, nutrient deficiencies and over-processed foods means that better access to healthier, safer, more nutritious food is more important than ever before. Future Food Malaysia is working towards identifying sustainable local solutions in Asia to these global challenges, through collaboration and shared facilities and equipment. Future Food Malaysia represents an inter-disciplinary platform that enables our technology-based research to be driven by an understanding of the economic, legal, social, cultural, historical, and ethical issues that underpin and shape food systems. We are addressing the United Nations Sustainable Development Goals: Zero Hunger (goal 2), and Good Health and Well-Being (goal 3) and Responsible Consumption and Production (goal 12). Global challenges of particular interest include: finding solutions to the unique regional problems caused by agricultural practices such as burning, destruction of wildlife habitats, monocrop mega-plantations, and displacement of indigenous/local communities optimising use of local resources for food security, minimising waste at all points of the food system, discovering natural therapeutics, understanding the interactions between food cultures, behaviour and human health, and combatting malnutrition in all its forms. Future Food Malaysia complements the Future Food Beacon of Excellence established at the University of Nottingham UK in 2017. Future Food Malaysia consolidates long-standing research excellence at University of Nottingham Malaysia, established over the years within various teams including the Centre of Excellence for Post-harvest Biotechnology, Centre for Food and Bioproduct Processing, and Centre of Sustainable Palm Oil Research. Our expertise includes: We can also access various data sets, equipment, and supporting platforms through our extensive partnerships, including the Future Food Beacon of Excellence [https://www.nottingham.ac.uk/research/beacons-of-excellence/future-food/index.aspx] on our UK campus. If you have any R&D questions about sustainable food and nutritional security, please contact us. We’re always pleased to hear from commercial organisations and other universities with ideas for collaboration and requests for consultancy and contract research. We’re particularly keen to work with countries in the ASEAN region eligible to receive Official Development Assistance support for research on food systems. For general enquiries: futurefoods.malaysia@nottingham.edu.my You can also directly contact one of our three co-Directors who co-ordinate activity in three broad areas: Dr Chin Chiew Foan, Sustainable food crops: increasing food production in ways that use the land responsibly email: Chiew-Foan.Chin@nottingham.edu.my Prof Show Pau Loke, Sustainable food processing: Discovering new technologies that enhance the nutritional value of the food we eat email: PauLoke.Show@nottingham.edu.my Dr Christina Vimala Supramaniam, Sustainable palm oil: Promoting ways to sustain oil palm plantations, to manage the value chain for global palm oil and to transfer good practice to other oil crops email: Christina.Supramaniam@nottingham.edu.my For research collaboration and business engagement enquiries: email: RKE.Hub@nottingham.edu.my telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}