{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Dominic-Foo.aspx",
    "content": [
        {
            "p": "All my computational research is connected to resource conservation. During my early work in water recycling, I used process integration methods to identify the maximum recoverable water rates. The technique was later extended to gas and solid waste recycling and recovery. Lately I have extended the method to CO2 reduction to ensure we can have a cleaner environment. This is an engineering design approach to problem-solving. Many process industries discharge huge volumes of waste water a second, which goes on to pollute the water courses with disastrous consequences for people and wildlife. In many developing countries in Asia where water scarcity is an issue, effective recycling techniques are vital. It is cheaper and more efficient to reduce the amount of fresh water or resources needed at the design stage of the process plant than to treat and discharge the effluent at the end. This is what my algorithm can accurately predict. With our process integration method, we will need the concentration, the flow rate, and with some quick equations, I can then calculate how much fresh water is needed and how much waste water is produced from the process. We can also work out if a filter or purifier is needed to help with recycling and the correct size to buy, so money is not wasted. This technique can identify all this in just 10 minutes, which is why it is so popular with industry worldwide. My students are my co-workers. We developed solution algorithm together. We spend long hours discussing and fine-tuning our approaches so that we have sensible and cost-effective solutions that the industry can adopt. Sometimes, my students undergo industrial attachments where they collect plant data for the research work. More so, I send them for research attachments so that they get to work with overseas research collaborators to co-develop effective solutions for tricky problems. In Malaysia, our industrial development started somewhere around 1990s. I witnessed its boom at a time when the regulations were relatively relaxed. My PhD focused on a water conservation project. Many plants and factories were operating in the country with waste water discharging to the rivers and sea. I was researching how to reduce their effluent pollution, so it didn't impact endangered wildlife or tourism. It began a long-term desire to protect the environment, which is the main driving force behind my recycling work for the last decade. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}