{
    "url": "https://www.nottingham.ac.uk/research/groups/lsri/index.aspx",
    "content": [
        {
            "p": "The Learning Sciences Research Institute (LSRI) researches the fundamental cognitive, affective and social aspects processes of learning to enhance education in formal, informal and non-formal contexts. We aim to understand learning at every level and time scale: from a neuron to a society and from a millisecond to the century. We conceptualise what and how people learn as happening through action in context, mediated through representational tools and practices, and impacted by the cultural contexts where these processes occur. Learning scientists are interdisciplinary: we draw on cognitive science, psychology, computer science, anthropology, sociology, information sciences and neurosciences to conduct research in education. Our approach is inherently collaborative as we work with educators in schools, universities, workplaces, and arts and cultural organisations to advance and refine theory, shape educational practices, and inform policy across the world. Our methods are broad drawing on laboratory studies through to ethnography and case studies, and often involve designing innovative learning activities. Themes that are particularly associated with LSRI are: Human learning is fundamentally social as we learn from our parents, friends, fellow students, and colleagues. But that does not mean we are automatically good at it and need no help to thrive at collaborative learning. Consequently, we explore how to support learners to develop the necessary skills such as self-regulation, group awareness and supportive communication. We also explore the role of digital technology in computer-supported collaborative learning (CSCL) addressing issues such as the availability of awareness tools or the impact of anonymous interactions. An increasingly prevalent theme is how collaboration changes with learners interacting with non-human agents generated through AI. So much learning involves representations such as pictures, written and spoken language, animation, sounds, or augmented reality. Research in LSRI draws on theoretical frameworks such as embodied or distributed cognition, and social semiotics to explore learning topics as diverse as chemical kinetics, second language learning, fashion design and data literacy. Our research is sometimes about practices of learning with representations made by others (for example webpages or museum exhibits) but more frequently concerns forms that learners create themselves such as drawings or musical performance. We like to design. We particularly like to design and research interactive learning environments considering both their technological affordances and pedagogical needs. We design learning experiences with educational games, simulations, collaboration tools, AI, hypertexts, virtual learning environments and many more. We frequently co-design working with educational practitioners to address pressing issues (such as data and AI literacy, climate change) to inform theory and practice. Research in the LSRI frequently adopts a co-design method where we work with educators in schools, colleges and museums to create innovative experiences that work in context. Examples of this work include designing interactive exhibits of evolution for museums, interactive comic books on climate change for primary school children and mobile learning toolkits that support inquiry learning. We are writing a textbook on how learning sciences can inform teaching. Please keep an eye out for announcements. Are you a student, wanting to apply strategies from learning sciences to help you learn? Check out our Sway for evidence-informed strategies with advice about how to apply them and what to avoid. If you are a Masters or PGCE student, use this Sway with more research background included. Meet the LSRI team Key LSRI projects Join the LSRI team Centre for International Education Research Centre for Research in Educational Leadership and Management Centre for Research in Human Flourishing Observatory for Mathematical Education Researching Inclusion and Social justice in and through Education (RISE) Centre School of Education University of Nottingham Jubilee Campus Nottingham, NG8 1BB +44 (0)115 951 4543"
        }
    ],
    "pdf_files": []
}