{
    "url": "https://www.nottingham.ac.uk/research/groups/medieval-heresy-and-dissent/index.aspx",
    "content": [
        {
            "p": "This research network, based in the Department of History and the Institute for Medieval Research, is concerned with the historical study of a range of forms of heresy and religious dissent in medieval Christendom. The network is an institutional focus for heresy studies, providing a forum for staff and students researching this area at the University of Nottingham. We also aim to draw in external scholars working in this field in the UK and beyond, and actively engage the public in events and discussion about religious dissent. To join our mailing list, please email heresy@nottingham.ac.uk. Nottingham Medieval Studies is pleased to announce the publication of Volume 63 (2019) – a special issue featuring the proceedings of the ‘Heretical Self-Defence’ conference organised by the Medieval Heresy and Dissent Research Network (MHDRN) and hosted here at Nottingham at Easter, 2018. The conference addressed themes and questions raised in modern historiography of medieval Christian heresies from the specific perspective of highlighting historical agency on the part of those accused of it. Each of the articles highlights episodes or strategies of resistance by groups and individuals from the second to fifteenth centuries, from England to the Eastern Mediterranean, from the perspective of the accused. Across this long period, dissident groups adopted heresiological strategies in their attempts at self-defence in ways which highlight how the boundary between orthodoxy and heresy was subjective, contingent and shifting. The articles collectively indicate that accusations of heresy and responses to them were struggles over the very nature and limits of orthodoxy itself and the discourses and processes by which it was defined and policed. The volume demonstrates the value in integrating consideration of the actions and arguments of those accused of heresy in the Middle Ages with the wider historical discourse surrounding the subject. Not only does this special issue open up new ways of thinking about specific societies and events covered in depth in its articles, it also reinforces the realisation that medieval heresy controversies are stories with multiple sides. The volume is dedicated to Bernard Hamilton who sadly passed in 2019. The authors and editors acknowledge his enormous influence in the field of medieval heresy studies, and he is very much missed by his former students and scholars, particularly those of Catharism. PETER DARBY, ROB LUTTON AND CLAIRE TAYLOR, ‘Introduction: Heretical Self-Defence in late Antiquity and the Middle Ages’. RAÚL VILLEGAS MARÍN, ‘The Best Defence is a Good Offence: Arnobius the Younger’s Praedestinatus and the Debates on Predestination in Mid-Fifth-Century Rome’. PAUL LINJAMMA, ‘The Heresiology of the Heretic: The Case of the Valentinians’. CARL DIXON, ‘Paulician Self-Defence and Self-Definition in the Didaskalie’. MAJA ANGELOVSKA-PANOVA, ‘’Turning Towards Heresy: Bogomils and Self-Defence’. SAKU PHIKO, ‘Talk, Communication and the Avoidance of Inquisitors in Thirteenth-Century Languedoc’. JUSTINE L TROMBLEY, ‘Self-Defence and its Limits in Marguerite Porete’s Mirror of the Simple Souls’. FIONA SOMERSET, ‘Scripting Defence: Textual Arguments and their Readers amid the Pursuit of Heresy in England’. ESTHER LEWS, ‘Resistance, Self-Defence, or sticking up for your Friends? A Discussion of Purgation in the Prosecution of Fifteenth-Century Lollardy’. This is always a challenge to medievalists, so we aim also to open up scholarly debate to a wider community. We want to make a sustainable and gradual, but solid and timely contribution to the scholarship. This contribution will grow out of the contacts and informal networks we already have whilst adding something structurally to them, for example, by intervening at key points to initiate symposia to help focus and drive the scholarship. At the heart of the network will be semi-regular events so that ideas and perspectives can develop organically, through frequent discussions. As well as providing a platform for scholars to present their own specialised research via our events, and organising and linking up with joint events, we will also suggest areas which might provide novel forms of thematic collaboration. These could include events exploring and questioning the divide between ‘elite’ and ‘popular’ heresy, or work to throw a spotlight on the anti-heresy activity at the Fourth Lateran Council, which had its 800th anniversary in 2015. Claire Taylor Rob Lutton Peter Darby Justine Trombley To find out about events and news email heresy@nottingham.ac.uk to request that you are added to our mailing list. Drawing medievalists from over 60 countries, with more than 2,000 individual papers as well as public concerts, performances, excursions, bookfairs and more, the International Medieval Congress (IMC) is Europe's largest forum for sharing ideas in medieval studies. There are no results that match your criteria. The University of Nottingham University Park Campus Nottingham, NG7 2RD telephone: +44 (0) 115 846 8093 email:heresy@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}