{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Examining-Southeast-Asian-filmmaking-past-present-and-future.aspx",
    "content": [
        {
            "p": "Asian cinema has been well established for many decades - from its 'Golden Age' following the end of World War 2 to the present day. Nowadays, films produced on the Asian continent are increasingly accepted into mainstream cinema, culminating in an Oscar for best picture –the film industry’s greatest honour– awarded to the South Korean scathing comedy-thriller “Parasite” in 2020. The first non-English language film to do so. Southeast Asian cinema has been thriving too. A new generation of regional filmmakers are offering diverse and exciting new perspectives. Their films shine a spotlight on uniquely Southeast Asian stories, and they boldly struggle with universal questions of identity and belonging. Dr Khoo Gaik Cheng, Associate Professor of Film and Television in the School of Media, Languages and Cultures, navigates these issues in her research. Gaik’s research predominantly focuses on independent filmmaking in Southeast Asia, particularly in Malaysia. Whether the film tackles gender, race, class or culture, she analyses the way the filmmaker presents these issues and sets the work in broader historical, sociological and anthropological contexts. Gaik hopes that her insights will help people to gain a greater appreciation of those films both as artistic expression and as a social document. As a researcher, she’s keen to unravel what it means to be citizens of the world in solidarity with one another regardless of background, and how films reflect that by demonstrating an affinity with universal values. For her, the 1998 Reformasi protest movement was a turning point for independent filmmakers in Malaysia. Perhaps for the first time, it offered Malaysians a new political voice to speak out for justice and reform. She sees independent filmmaking as one of the mediums through which Malaysians expressed that voice. Many of these films embrace Malaysia’s multiculturalism and celebrate what holds the nation together, what she terms “creative acts of citizenship”. In addition to this scholarly work, Gaik is involved in numerous engagement activities that advance the study of Southeast Asian cinema. In 2004, she established the Association of Southeast Asian Cinemas Conference and has been pleased to see this attracting growing numbers of scholars, regional filmmakers, archivists, activists and critics year on year. As Southeast Asian cinema gains momentum worldwide, she continues to reinforce her position as an authority on the subject, as an invited guest, judge and speaker at various workshops, symposiums, film festivals and competitions across Asia, Europe and the US. Her latest project is a collaborative venture with colleagues across the global University of Nottingham; a collection of essays examining Southeast Asia's cinematic development from 1945 to 1998, before the post-2000 revival and the advent of digital filmmaking. Throughout this period, Southeast Asian film industries had distinctive and colourful histories shaped by unique national and domestic conditions. Films are not simply artistic works, but they offer fascinating glimpses at the intersection of history, politics, society and culture. More than merely a medium of entertainment, films have the incredible capacity to speak volumes of the society they document. Gaik’s research reminds us of that unique and valuable lens onto the world. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}