{
    "url": "https://www.nottingham.ac.uk/research/groups/cohd/index.aspx",
    "content": [
        {
            "p": "We are an internationally renowned global research centre in occupational health in the University of Nottingham. Find out more about us Centre expertise lies in occupational health and occupational psychology specialising in the promotion of organizational health and development. Find out more by exploring our key research themes and checking out our staff pages. Our work aims at developing healthy and sustainable workplaces. Developing a healthy psychosocial work environment and promoting well-being at work are key themes in our research. We regularly develop guidance and tools on the work environment working with key stakeholders. See also our WHO programme of work. Jachens, L., Houdmont, J., & Thomas, R. (2016). Effort-reward imbalance and heavy alcohol consumption among humanitarian aid workers. Journal of Studies on Alcohol and Drugs, 77, 904-913. Our work in this area focuses on a number of employment sectors and the impact of specific psychosocial factors on health, safety and work-related outcomes. Our work aims to facilitate good work organisation, design and management in sectors like policing, education, healthcare, oil and gas and mining industry. Video: Dr Jonathan Houdmont’s presentation at the 2016 annual conference of the Police Federation of England and Wales. Houdmont, J., & Randall, R. (2016). Working hours and common mental disorders in English police officers. Occupational Medicine, 66, 713-718. SANTOS, A. and TIN, J.J., 2016. The nature, extent and impact of educator targeted bullying on school teachers in West Malaysia British Journal of Guidance and Counselling. 1-14 SANTOS, A., RAMOS, H., RAMASAMY, G. and FERNANDES, C., 2014. Prevalence of musculoskeletal pain in a sample of migrant workers in the manufacturing industry in Malaysia Public Health. 128(8), 759-761 Our work in this area examines various aspects of organisational culture including leadership, psychological and social capital, and human resource practices, and their relationship with organisational performance in terms of positive work behaviour, innovation, and quality of work. We have examined these relationships both in large and small organisations in various countries and occupational sectors. Our work in the area of business ethics and sustainability focuses on the identification and evaluation of responsible business practices contributing to the 2030 global agenda on Sustainable Development Goals. This includes examining the role of softer forms of policy, such as voluntary standards, social dialogue and responsible business practices, in the area of managing working conditions and promoting equality, diversity, health and well-being, particularly in developing countries where legislative frameworks may be weak or non-existent. Several of our research programmes are policy-oriented. We work with international organisations such as WHO, ILO and institutions such as the European Commission and its agencies, trade unions and employer associations to develop guidance and standards on the work environment. We also provide policy recommendations and evaluate policy and practice in the UK, Europe and internationally. Our work in this area focuses on promoting a lifespan perspective and supporting healthy working lives. Key themes include chronic illness, return to work and the effectiveness of organisational and health service interventions to support the timely return-to-work of people with absence due to a range of health conditions. Our work in this area examines the implications of a diverse workforce and specifically addresses issues such as gender, ageing, and migration. Key themes in our research are stereotyping, discrimination, and the development of appropriate workplace policies and management practices for a diverse workforce. Our stream of work in this area examines the development needs and effectiveness of training interventions for the health and social care workforce. This includes a national evaluation of the Care Certificate training for unregistered care workers. The second stream of research in this area focuses on career development needs and opportunities for adolescents and young adults, with an emphasis on the assessment and development of career decision making tools and interventions. Our research in this area focuses on three streams of inquiry. The first focuses on emotional labour and the strategies workers employ in dealing with emotionally demanding work involving frequent employee-customer/client interactions. The second stream derives from a positive psychology perspective on emotion regulation, and in particular, the role of emotional intelligence in combating the negative consequences of challenging work. The third stream focuses on work and non-work trauma and our research has looked at both antecedents and coping of victims of traumatic experiences like war and major disasters, and the use of narrative approaches to dealing with traumatic stress. This body of work focuses on the relationship between social identity, psychological factors and appearance. Much of this work has focused on alopecia. We are exploring the relationship between appearance and psychological problems (e.g. anxiety, depression, PTSD), as well as its link with wider interpersonal, social and workplace issues. Work and Organisational Psychology MSc Management Psychology MSc Occupational Health - Psychology and Management (PhD) Workplace Health & Wellbeing MSc (Distance E-Learning) MPhil/PhD in Applied Psychology MSc Management Psychology MSc Occupational Health & Safety Leadership (IOSH accredited) There are no results that match your criteria. Follow us @COHD_UoN More news and events Dr Angeli Santos, Associate Professor in Applied Psychology The University of Nottingham School of Medicine telephone: +44 (0) 115 846 6639 email:angeli.santos@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}