{
    "url": "https://www.nottingham.ac.uk/research/groups/clinicalepidemiology/index.aspx",
    "content": [
        {
            "p": "Our clinical epidemiology research, which has impacted substantially on healthcare policy, spans multiple disease areas including:- Particular methodological strengths are development and use of large e-health databases, conduct of cohort studies in developing countries, systematic reviews and meta-analyses. Across many different clinical areas there are gaps in our knowledge of the true burden of disease, those most at risk of developing disease, short and long-term consequences of illness and the effectiveness and safety of current therapies. Clinical epidemiology is a broad discipline which contributes much needed evidence to try and fill some of these gaps and is used by practising clinicians and by health policy makers. Cancer epidemiology Studying the causes and outcomes of cancer and strategies for early detection, making extensive use of e-health databases. More information about cancer epidemiology research Gastrointestinal epidemiology One of the UK’s leading gastrointestinal epidemiology research groups describing the epidemiology, aetiology and consequences of malignant and non-malignant acute and chronic gastrointestinal disease. More information about gastrointestinal epidemiology research Perinatal epidemiology Research in this area is concerned with identifying risk factors for adverse outcomes in pregnancy and early life. More information about perinatal epidemiology research Respiratory epidemiology This research focuses on the aetiology and natural history of asthma/allergic disease, idiopathic pulmonary fibrosis, lung cancer, cystic fibrosis and hereditary telangiectasia and delivery of care for people with lung cancer, using e-health databases and collection of original data. More information about respiratory epidemiology research We make use of several eHealth databases including THIN, CPRD and NHANES. More news from the Division of Epidemiology and Public Health Epidemiology and Public Health PhD Master of Public Health (MPH) Master of Public Health (International Health) Group members The University of Nottingham School of Medicine email:email us"
        }
    ],
    "pdf_files": []
}