{
    "url": "https://www.nottingham.ac.uk/research/groups/haematology/index.aspx",
    "content": [
        {
            "p": "The Nottingham Haematology Group, headed by Professor Nigel Russell, encompasses both clinical and laboratory research. Our aim is to learn more about learn more about the biology of the diseases, discover and characterise new drug targets, test new drugs, and to identify better treatments for people with blood-related disorders. In the UK, around 30,000 people are diagnosed with a haematological malignancy, or related disorder, every year. Whilst big advances have been made in the treatment of some of these diseases, such as acute lymphoblastic leukaemia in children, other haematological disorders remain challenging with the only chance of curative treatment being a haematopoietic stem cell transplant. Our laboratory research focuses on understanding both the pathogenesis of acute myeloid leukaemia and the chemoresistance phenotype often seen in the disease, particularly in the dormant stem cells. The group's clinical research has a pioneering interest in the development of peripheral blood stem cells for matched and unrelated donor transplantation. Laboratory research within the group focuses on acute myeloid leukaemia (AML). Of particular interest is why some cells are killed by chemotherapy drugs whereas others live resulting in disease progression. read more ... We study a number of different cellular pathways and mechanisms and how they contribute to chemoresistance, these include: The research aims to identify ways to maximize the therapeutic efficacy of existing drugs and to evaluate new treatments for AML. The group has one of the UK’s largest bone marrow transplant (BMT) programmes with participation in national and international clinical trials in BMT and cord blood transplantation. The team is heavily involved in clinical trials and Professor Russell is the Chair of the National Cancer Research Institute (NCRI) AML Working Group and the Chief Investigator of the NCRI AML 17, 18 and 19 trials. In general the survival for Acute Myeloid Leukaemia in younger patients has improved in the last 25 years with 85% of entrants to NCRI Trials entering remission and 50% of entrants now surviving long-term. Data from the MRC AML database indicates that this sort of outcome is achieved in a wide variety (small or large) of the 170 participating centres irrespective of geography, thus giving patients equality of access to the best available treatment. Many commissioners only agree to local treatment if the patients are treated in the national trial. Approximately 80% of patients in the UK with AML aged < 60 years enter these trials. Our studies in this age group have resulted in significant improvement in survival over the years and represent the state of the art worldwide Key publication BURNETT AK, GOLDSTONE A, HILLS RK, MILLIGAN D, PRENTICE A, YIN J, WHEATLEY K, HUNTER A and RUSSELL N, 2013. Curability of Patients With Acute Myeloid Leukemia Who Did Not Undergo Transplantation in First Remission. Journal of Clinical Oncology : official journal of the American Society of Clinical Oncology. (In Press.) Group members PhD opportunities School of Medicine The University of Nottingham Clinical Sciences Building Nottingham City Hospital Hucknall Road Nottingham NG5 1PB, UK telephone: +44 (0)115 962 7708 email:nigel.russell@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}