{
    "url": "https://www.nottingham.ac.uk/research/groups/orthopaedicsandtrauma/index.aspx",
    "content": [
        {
            "p": "Our mission is to pursue international excellence in multidisciplinary, translational research, to enhance understanding of arthritis pain, bone and joint injury and repair, novel biomaterials and methods of delivering antimicrobials to improve patient care. -- Brigitte Scammell Professor in Orthopaedics The group achieves a balance of clinical versus basic science research by collaborating with NHS and university colleagues, and recruiting and training high quality undergraduate and postgraduate medical and biomedical students. It benefits greatly from working very closely with the Arthritis Research UK (ARUK) Pain Centre at the University of Nottingham, which investigates the mechanisms that lead to the chronic pain experienced by sufferers of arthritis, and to improve the treatment of that pain. Collaborative projects are also ongoing with the ARUK Sport, Exercise and Osteoarthritis Centre. Research is undertaken by a multidisciplinary team based in the Schools of Medicine and Life Sciences. With collaborators in the ARUK Pain Centre and NHS, we will be starting a feasibility clinical trial of Cognitive Behavioural Therapy for patients with high levels of preoperative anxiety and depression undergoing knee replacement surgery with the aim of improving their postoperative pain and outcome. This study is funded by an NIHR Research for Patient Benefit grant. Traditional metal plates sometimes need to be removed particularly in children as their bones continue to grow. We are investigating a novel resorbable plate and so far have been able to show that the materials are non-toxic and hold promise. Osteoporosis is currently treated on the whole using drugs which prevent bone being resorbed resulting in increased bone fragility. The only drug on the market which can increase bone density by anabolic mechanisms is PTH(1-34) also known as teriparatide. Currently this drug is administered by injection as an oral delivery route is not suitable. We are developing a nasal delivery formulation such that the drug can be taken using a simple nasal spray. 1. Quantitative sensory testing, pain beliefs, knee and brain MRI pre- and post- knee replacement surgery (T Kurien, D Auer, D Walsh, N Lincoln, R Pearson and BE Scammell) Mechanisms of pain in OA are still poorly defined but involve a complex interplay between peripheral structural and biochemical changes within the joint, alterations in the central sensory processing in the spinal cord and brain as well as psychosocial factors involving distress and anxiety. Not all patients respond well to a total knee replacement in terms of pain relief even if they have received the same operation performed to an equal standard. We are identifying changes which can further define the range of pain states within this patient group. This is being addressed using an extremely broad range of methodologies including questionnaires, quantitative sensory testing, and cutting-edge MRI, within a highly interdisciplinary team. What is learnt from this research will be fed-back into current treatment practices to provide patient benefit from this research. This on-going research already involves the active participation of a patient group suffering from pain due to osteoarthritis. 2. Prevention and treatment of infection with an antibiotic-impregnated synthetic bone scaffold (J McLaren, R Bayston, KM Shakesheff and BE Scammell) Funded by an MRC DPFS award, £340k 3. PTH nasal delivery for the treatment of osteoporosis (Dr A Williams, Professor A Perkins and Dr RG Pearson, University of Nottingham and Critical Pharmaceuticals) Technology Strategy Board 2012, £230k Specifically this research is a strategy to develop a nasal spray formulation of the drug which is currently marketed as teriparatide, based on the amino acid residues 1-34 of parathyroid hormone, PTH(1-34). This drug can be used in the treatment of osteoporosis which is estimated to affect 200 million women worldwide - approximately one-tenth of women aged 60, one-fifth of women aged 70, two-fifths of women aged 80 and two-thirds of women aged 90. Osteoporosis is a reduction in bone density that increases the risk of fragility fractures particularly of the spine, hip and wrist at a costs to the NHS of >£2bn per annum. The nano-enabled formulation proposed in response to the Technology Strategy Board call is expected to increase efficacy and patient adherence to the therapy regimen thereby reducing healthcare costs. 4. Development of a resorbable fracture fixation plate (I Ahmed, H Na, A Parsons, C Scotchford, R Pearson, A Qureshi, BE Scammell, C Rudd) Department of Health, £400k We are developed a novel bioresorbable plate for fracture fixation made of a phosphate-based glass fibre reinforced polylactic acid composite with similar Young’s modulus to bone. The theoretical benefit is that the plate results in reduced stress shielding and does not need removal. This is the first study investigating the in vivo effects of implantation of this novel composite plate. This is a highly interdisciplinary research group comprising of engineers, bone biologists, surgeons and business. The research involves several key companies involved in this market sector including the DuPuy who have a long track record of supporting novel research within this field. The patients affected by the disease or trauma are informed through patient participation groups where in addition data is collected which can influence the future direction of our research. Academic and a wider readership are informed through peer reviewed scientific publications in internationally recognised peer reviewed journal. The outcomes of our research is also fed back to the funders of the research, both charities and the publically funded research councils. KURIEN T, PEARSON RG and SCAMMELL BE, 2013. Bone graft substitutes currently available in orthopaedic practice: The evidence for their use. The bone & joint journal. 95-B(5), 583-97 PEARSON, R.G., KURIEN, T., SHU, K.S.S. and SCAMMELL, B.E., 2011. Histopathology grading systems for characterisation of human knee osteoarthritis: reproducibility, variability, reliability, correlation, and validity Osteoarthritis and Cartilage. 19(3), 324-331 Please refer to the profiles of individual researchers for more publications. Group members PhD opportunities School of Medicine The University of Nottingham C Floor, West Block, Queen's Medical Centre Nottingham, NG7 2UH telephone: +44 (0) 115 823 1115 email:oas-admin@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}