{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Examining-Innovation-and-Sustainability-of-Asian-Business-Organisations-for-solving-humanities-problems.aspx",
    "content": [
        {
            "p": "The word “innovation” is derived from the Latin verb ‘innovare’, which means to renew. I today’s dynamic and turbulent environment, innovation is even more crucial for organisations, business and others to be able to create value for all involved. An important development is the introduction of the Sustainable Development Goals (UN SDGs) by the UN with specific targets to achieve by 2030. The UN has started working along with business organisations, startups, NGOs, governments, and other organizations to solve some of humanity’s greatest challenges with these goals Mohan strongly believes Asian businesses, in own their unique ways, have been and can provide innovative solutions to societies problems while also generating economic/financial gains. Through his field-based research, he’s keen to illustrate how business organisations can contribute to sustainable development through their innovation and strategy. Mohan is involved mostly in applied research underpinned by the concept of Innovation Systems – investigating about linkages business organisations (both large and small) develop with other organisations such as research institutes, civic society organisations etc. for innovation and also responsible/sustainability-oriented business strategies. He started his work studying how companies developed inter-organisational linked in regional technology clusters which provide an eco-system for entrepreneurship / innovation and now has move on to research inter-organisational linkages in a boarder remit. At the business school, Mohan has formed and lead the sustainability in business research group which has now been integrated into the tri-campus International Centre for Corporate Social Responsibility (ICCSR), a globally renowned research centre of Nottingham University Business School (NUBS). He also coordinated all activities related to UN-Principles of Responsible Management Education (UN-RME) - NUBS has been a UN PRME Champion School for the past 8 years. In addition to applied research work, Mohan engages with industry and non-government organisation that promote innovation and sustainability. He has been a resource person for the workshops organised by World Technopolis Association in collaboration with UNESCO – speaking on how businesses can innovate through inter-organisational linkages. He has been actively involved in the growth and development of the Asian Society for Innovation and Policy in its agenda to be the forum for all scholars interested in Asian management and policy issues related to Innovation. In 2021, he orchestrated the collaboration between the university and UN Global Compact Malaysia & Brunei (GCMY&B) to synergise the organisations common interests in promoting the adoption of sustainable development goals (SDGs) in business and society. With Asia taking centre stage in world politics and business, business organisations in this region are able to play an importantly role in offering solutions to many of the societal problems. Asian businesses, in addition to focussing on their financial commitments, have always been supportive of society and community. They offer models of fascinating ways to contribute to economy, environment and society through their innovations and strategies. Mohan is keen on researching and developing case studies of such ‘organisations with purpose’, to bring into class for educating the young and experienced in matters of innovation and sustainability. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}