{
    "url": "https://www.nottingham.ac.uk/research/groups/east-midlands-hydrogen-innovation-zone/index2.aspx",
    "content": [
        {
            "p": "Welcome to the East Midlands Hydrogen Innovation Zone. Hydrogen is critical to the UK reaching its net zero target by 2050. Hydrogen has the potential to provide the UK with secure, reliable and clean energy for transport, industry and heating. There are key challenges to be resolved around its suitability for different sectors, the projected usage, the production capacity required, storage capability, the increased electrical supply required for conversion as we move from blue to green hydrogen and initial targets for 2030 and beyond. The Government has set a national target of 5GW hydrogen production capacity by 2030. It will publish the dedicated hydrogen strategy in 2021, with a series consultations. It has created a £240m Net Zero Hydrogen Fund for capital co-investment with industry over the next four years, and it plans industrial-scale heating in a ‘Hydrogen Neighbourhood’ by 2023, a ‘Hydrogen Village’ by 2025 and ‘Hydrogen Town’ by 2030. The independent Committee on Climate Change has set a faster timetable, however, in its progress report to Parliament and Sixth Carbon Budget plan in 2020. It asserts that the UK will fail to decarbonise without hydrogen at the heart of the future energy mix, and argues that the transition to clean hydrogen needs to be kick-started now so that the big strategic decisions on hydrogen’s future are taken by the end of the decade. We agree the current plans, while welcome, need a significant step change if the foundations of a hydrogen economy are to be in place by 2030. We cannot underestimate the complex challenges in creating national hydrogen capability. We believe not resolving these issues risks hydrogen being limited to specific coastal areas, creating significant challenges for inland areas to reach Net Zero. Establishing proximity and availability of green and blue hydrogen, grid connectivity, high pressure gas networks, storage and renewable energy sources. Building appropriate strategic infrastructure, based on accurate assessment of growing usage across multiple sectors. Securing investment over the whole system lifecycle, based on policy techno-economics; regulatory reform; market analytics; and community and public engagement. Significant retraining and upskilling of the workforce is required. Professor David Grant, Director of Propulsion Futures Beacon, Professor of Materials Science and Director of University of Nottingham Energy Institute. Professor Frank Kirkland, Professor of Technology Innovation for Aircraft Propulsion. Dr Simon Gerrard, Corporate Partnerships Senior Executive. EMHIZ@nottingham.ac.uk email: EMHIZ@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}