{
    "url": "https://www.nottingham.ac.uk/research/nrc/nrc-news-events-and-opportunities.aspx",
    "content": [
        {
            "p": "Please check back at a later date for more opportunities Nothing scheduled at the moment but check back later for our next one. 26 November 2024 Construction of the country’s first NHS National Rehabilitation Centre continues at pace and this month’s photos give us the first glimpse of what inside the building will look like. 21 November 2024 Find out more about the EMERGE accelerator project 30 September 2024 Posting 12 months on from the official ‘green light’ moment, the potential of the NRC is becoming even clearer with the building shaping up and the wider programme picking up pace as the NRC gets ready to start treating patients in 2025. Find out more about the NRC progress 28 August 2024 An ice hockey Paralympian and international leader in disability access who had his leg amputated as a teenager has been named as the very first ambassador for the new National Rehabilitation Centre. Mark Briggs, 47, from Ollerton in Nottinghamshire, was five years old when he was kicked in the shin at school, triggering a rare genetic condition with only seven recorded cases globally and no cure. 27 August 2024 Equipment tracking, artificially intelligent CCTV and voice-activated environmental controls are just some of the technologies being trialled at Nottingham University Hospitals NHS Trust (NUH) to support plans to create a national centre of excellence for rehabilitation. The digital trials are underway at the Linden Lodge unit at the City Hospital site – a 25-bed unit for patients requiring neuro-rehabilitation – and staff and patients have been heavily involved to develop the technologies to their needs. Plans for rehabilitation research at the NRC are set to take another leap forward following the appointment of the NRC's Research Director. Professor Rui Loureiro, Head of the Department of Orthopaedics and Musculoskeletal Science at University College London, has been selected to be the new NRC Research Director and will set the research agenda for the NHS-led centre. A special accessible garden created for the RHS Chelsea Flower Show with the National Rehabilitation Centre (NRC) in mind could become a therapeutic space to help NHS patients on their recovery journey after the London show. Read more here A significant milestone in the construction of the first NHS National Rehabilitation Centre (NRC) was cause for celebration this week for the project partners committed to making the facility a reality. The \"Topping Out Ceremony\" marked the building reaching its highest level and completion of the building’s frame, symbolising another important milestone in the journey of this pioneering rehabilitation centre. Newly-released drone footage, images and timelapse show progress of National Rehabilitation Centre (NRC) due to open in 2025. Construction of the first NHS National Rehabilitation Centre – a 70-bed purpose-built facility near Loughborough – continues to progress, with the concrete frame of the building almost complete. See a video about the construction on Youtube The £105million NRC project aims to transform rehabilitation care, research, and training in the UK, will be run by Nottingham University Hospitals NHS Trust, and is due to open to patients next year. The National Rehabilitation Centre (NRC) was pleased to welcome Health Minister Lord Markham for a tour of the construction site to see the progress of the revolutionary facility. The visit included a tour of the construction site, as well as a comprehensive update on the plans for the centre which will provide life-changing support for patients following a serious illness or injury, and which aims to transform the field of rehabilitation on a national scale. The National Rehabilitation Centre (NRC) Programme has appointed Integrated Health Projects (IHP) as main contractor to construct the NRC. A new network connected to the National Rehabilitation Centre (NRC) is bringing together technology experts to develop next-generation solutions to transform clinical rehabilitation. Experts from the University of Nottingham are part of a major new study aimed at identifying new ways to accurately predict whether patients will develop long-term complications as a consequence of concussion. The National Rehabilitation Centre will be exhibiting at this year’s Royal Society Summer Science Exhibition. Revolutionising Rehabilitation will demonstrate some of the latest scientific advances and allow the audience to try technologies for themselves. We aim to challenge everyone’s view of rehabilitation and show them how this cross-cutting work will directly shape the life potential of patients who have suffered serious injury or illness."
        }
    ],
    "pdf_files": []
}