{
    "url": "https://www.nottingham.ac.uk/research/groups/pathology/index.aspx",
    "content": [
        {
            "p": "Academic Pathology is made up of researchers studying the pathology of breast disease, colorectal cancer, inflammatory bowel disease and gynaecological disease. The Nottingham Breast Pathology Group aims to refine breast cancer prognostication and outcome prediction, identify new targets for therapeutic development and improve patient management. The aim of the Molecular Pathology Group is to develop an understanding of the molecular basis of neoplastic and inflammatory gastrointestinal disease and use this to improve patient care. The main research output of the Nottingham Breast Pathology Group is focused towards use of histological and molecular methods in diagnosis and clinical and basic research and specifically to improve the existing classification systems for breast disease. Our working hypothesis is that development of a modern clinically relevant classification system based on morphological and molecular genetic alterations will identify new targets for therapeutic development and improve patient management through improved prognostic information and therapeutic response prediction. Find out more. Gastrointestinal disease is a major cause of morbidity and mortality in the Western population. Our focus is mainly on the lower gastrointestinal tract (i.e. colon and rectum) and, at this site, the major diseases are neoplastic disease (colorectal cancer) and inflammatory bowel disease. In both of these diseases there is a need to improve our understanding of how these diseases develop and to identify the key molecular players. This knowledge will allow novel targeted treatments can be developed and diagnostic tests to be improved. Find out more. Our research is published in leading peer-reviewed journals. Please see our members' profiles for publication details. Molecular Pathology (MSc by Research) PhD opportunities More news from the Division of Cancer and Stem Cells Nottingham Breast Cancer Research Centre Nottingham Molecular Pathology Node Group members The University of Nottingham School of Medicine, Queen's Medical Centre Nottingham, NG7 2UH telephone: +44 (0)115 969 1169 email:ian.ellis@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}