{
    "url": "https://www.nottingham.ac.uk/Researcher-academy/Advocacy/RAFL.aspx",
    "content": [
        {
            "p": "Ifty's University of Nottingham profile Engineering Research Futures I am an Associate Professor within the Faculty of Engineering’s, Advanced Materials Research group. My research interests span Biomaterials, Bioglasses, Biocomposites and my research group mainly work on Phosphate-Based Glasses. These materials have been investigated for biomedical applications where the temporary presence of an implant is required, consequently negating the need for implant removal. More recently, I have developed a unique processing method for manufacturing dense and highly porous microspheres from a range of inorganic materials. In my role as Researcher Academy Faculty Lead (RAFL) for Engineering, I work with an excellent group of research fellows from varying research groups, as well as with staff in the Researcher Academy and Engineering Research Office to support the training and development of the Faculty’s researcher community. I am Professor of Water & Resource Processing in the Department of Chemical & Environmental Engineering and I am a member of, and lead the Faculty of Engineering’s Food Water Waste Research Group. My research focuses on sustainable and circular resources, with a passion for water. Taking an interdisciplinary and systems approach, I look at understanding and developing solutions to more intelligently use and reuse water and interconnected resources, without depreciating the environment. I lead the University of Nottingham’s Interdisciplinary Research Cluster, Water Works comprising >140 academics, which actively supports Nottingham to become the UK’s first carbon neutral city and features in the Carbon Neutral Nottingham 2028 Action Plan. I am the Director for Researchers and Postgraduate Researchers for the Faculty of Engineering where I champion researchers to develop ownership and make informed choices that enhance their PhD experience and/or postdoctoral research career. As one of the two Researcher Academy Faculty Leads (RAFL) for the Faculty, I interact with and support PGRs and researchers across our diverse research groups, ensuring they each make the most of their time with us and have access to the support, facilities, environment, and training to help them realise and achieve their full potential. Rachel's University of Nottingham profile I am an Assistant Professor in Molecular Virology in the School of Life Sciences. My research investigates mechanisms of virus entry and immune responses to chronic and acute viral infections. I am particularly interested in hepatitis C virus, hepatitis B virus and, more recently, SARS-CoV-2. This research contributes to development of novel antiviral therapies and informs vaccine design. I previously represented research staff within the University as the Faculty of Medicine and Health Sciences representative on the Research Staff Group. I have also represented the University at the UK Research Staff Association. In my role as Deputy Researcher Academy Faculty Lead for Medicine and Health Sciences I am representing the interests of all research staff in the Faculty, working with the Researcher Academy and individual schools to support research staff in their career development. I am an Assistant Professor in Molecular Biochemistry and Biophysics at the Faculty of Medicine and Health Sciences. My research primarily delves into exploring the 3D structure and molecular dynamics of RNAs and their relevance to cellular health and disease. While our main focus is on HIV pathogenesis as a model, our projects also encompass other RNA viruses like Arenaviruses and RNA misfolding diseases such as Muscular Dystrophy. We employ a range of techniques, including integrated biophysics, cryo-Electron Microscopy, Mass Spectroscopy, and computer simulations, and often engage in innovative method development for RNA structure analysis. In my role as the Deputy RAFL for MHS, I collaborate with Alex Tarr to support the professional growth and development of research staff within our Faculty across various stages of their career journey. My own career path has been deeply rooted in research, complemented by a history of holding multiple fellowships. This personal experience particularly makes me passionate about addressing the unique challenges faced by Postdoctoral Fellows (PDFs) and Early Career Researchers (ECRs). I am situated at the Vet School on the Sutton Bonington Campus, and I'm always open to a friendly chat over coffee if you'd like to connect. I am an Associate Professor within the School of Mathematical Sciences. My primary research interest is the study and classification of Fano varieties, the \"atomic pieces\" of geometry from which all other geometric shapes are made. This involves developing massively parallel computer algebra software and large databases of geometric objects, applying tens of centuries of computing time to make substantial and important theoretical mathematical advances. Through this work my group and I have pioneered the use of techniques from data science and machine learning in Pure Mathematics to uncover new mathematical structure. I am also the editor-in-chief for the journal Experimental Mathematics. As the Researcher Academy Faculty Lead (RAFL) for Science, I help promote the outstanding research done within the Faculty, and coordinate training and development opportunities. I am particularly interested in providing cross-discipline training in data science and machine learning. I am an Associate Professor in the School of Computer Science at the University's UK campus. My interests are primarily in artificial intelligence. In particular, I am keen to understand how we can use AI and machine learning to find and fix faults in software. I also enjoy collaborative work, applying AI to other areas of research or in the wider world. Over the years, I have worked on projects applying AI to such diverse areas as railway engineering, pure mathematics, audio technology, bioinformatics, and digital humanities. I am also co-author of the most recent edition of \"How to get a PhD\", a study skills book for PhD students. As Deputy Researcher Academy Lead for Sciences, I am keen to ensure that everyone involved in research has opportunities for professional development, and to provide opportunities for researchers to meet and learn from each other. I am an Associate Professor in Critical Theory and Cultural Studies in the Faculty of Arts. My research is interdisciplinary, even transdisciplinary in nature. I work on the grey areas between media, philosophy, science and technology studies and politics. My interests include: the role of digital technologies, and more specifically, software, in shaping contemporary culture; changing forms of media and cultural practice; methods and forms of cultural analysis, micropolitics, untranslateability, and the philosophy of technology. I am particularly interested in exploring the experimental use of theory and do work as a translator too (primarily of philosophical texts, from French to English). I am a Professor of War Studies in the School of Politics and International Relations. I have been at the university since 2011. My research revolves around the political management of conflict. As RAFL for the Social Sciences I hope to work closely with the faculty’s PGR body and its research staff. I see the RAFL role as being a lynchpin in the rather complex ecosystem in which researcher training and development exists. I want to harness the views and concerns of PGRs in the seven schools across our Faculty, whilst getting them to feel part of a wider PGR community, whilst also fostering greater awareness within the RA of the needs of social scientists. UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": []
}