{
    "url": "https://www.nottingham.ac.uk/research/groups/biomaterials-discovery/index.aspx",
    "content": [
        {
            "p": "1) University of Nottingham, Boots Science Building, 2) Coated Catheter (Camstent Ltd), 3) Time-of-flight secondary ion mass spectrometer, 4) Cell Polymer Microarray (Asha Patel, 2015) 5) Patient stem cell-derived cardiac cells on topographies. The EPSRC Large Grant in Designing bio-instructive materials for translation-ready medical devices was launched in 2023 with the goal to address some of the major issues of implanted medical devices, namely the mortality, morbidity and costs associated with their failure due to foreign body reaction and infections. In the EPSRC Programme Grant \"Next Generation Biomaterials Discovery\", we uncovered physical surface patterns (topographies) that, combined with novel polymers, were able to reduce bacterial biofilm formation and increase the immune acceptance of materials in vitro and in vivo in preclinical infection models. In this project, we will utilise 3D printing to manufacture ChemoTopoChips that will allow over a thousand polymer chemistry-topography combinations to be tested with semi-automated in vitro measurements. The same fabrication approaches will be used to make devices for preclinical testing in vivo. These information streams will be merged using artificial intelligence (specifically machine learning) to build effective models of performance and provide mechanistic insights. Ultimately, our partnerships with medical device industries will ensure that the optimal material-topography combinations and associated mechanistic understanding will be taken on to the next steps in the construction of medical devices. The project has four research themes: Yinfeng He Advanced Materials and Healthcare Technologies, School of Pharmacy, The University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 846 6246 email: BiomaterialsDiscovery@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}