{
    "url": "https://www.nottingham.ac.uk/research/groups/stroke/index.aspx",
    "content": [
        {
            "p": "Stroke aims to perform world-leading research that informs and improves clinical stroke care. We comprise clinical, laboratory and statistical scientists, and work closely with the Clinical Trials Unit, NHS Stroke Service, and their patients, at the highly-rated Nottingham University Hospitals NHS Trust. Philip Bath, Stroke Association Professor of Stroke Medicine Approximately 150,000 people in the UK suffer a stroke every year, due either to a blocked blood vessel (causing ischaemic stroke), or a burst blood vessel (which causes haemorrhagic stroke). Whilst there are effective treatments for stroke (stroke unit care, thrombolysis, thrombectomy) unfortunately many patients still die or are left disabled and dependent on others. Our clinical research covers the whole stroke pathway from the management of acute stroke (blood pressure lowering, remote ischemic conditioning, tranexamic acid for intracerebral haemorrhage), acute prevention of recurrence (antiplatelets), ISMN (Isosorbide Mononitrate commonly used to treat angina), Cilostazol (used to prevent more strokes from happening), enhancing recovery (stem cell mobilisation), and prevention of cognitive decline (intensive blood pressure and/or lipid lowering). Our laboratory studies investigate the blood brain barrier and how its integrity may be maintained after a stroke. The Nottingham Stroke Trials Unit runs a number of large multi-centre phase 3 clinical trials, both in the UK and Internationally. In addition, we also run a number of smaller phase II clinical trials, as well as performing systematic reviews and meta-analysis. (List of clinical stroke trials.) Clinical Pharmacology/Therapeutics Types of studies Current Trials Cochrane Collaboration Our translational studies focus on the elucidation of the mechanisms that may account for the breakdown and recovery of the blood-brain barrier (BBB) with an aim to discover novel therapeutic mediators that can effectively prevent or reverse the formation of brain oedema, the main cause of death within the first week after an ischaemic stroke. Translational stroke studies Our research impact is reflected in the following: Publications in leading journals e.g. Stroke, Lancet, New Eng Journal See details of more publications under individual researchers' profiles. Research grants Safety and Efficacy of Triple Antiplatelets for reducing dependency after Ischaemic Stroke; The TARDIS randomised controlled trial. Tranexamic acid for hyperacute primary Intracerebral Haemorrhage (TICH-2). Rapid Intervention with Glyceryl trinitrate in Hypertensive stroke Trial-2 (RIGHT-2): Assessment of safety and efficacy of transdermal glyceryl trinitrate, a nitric oxide donor, and of the feasibility of a multicentre ambulance-based stroke trial. DMT-EPC Endothelial progenitor cells: potential biomarkers for diagnosis and prognosis of ischaemic stroke. See our other major awards from funders including the NIHR HTA and the Stroke Association. NIHR Senior Investigator award Professor Philip Bath, head of the Stroke Research group, has been named an Emeritus Senior Investigator after the closure in March 2020 of his previous award of NIHR Senior Investigator. Senior Investigators are the NIHR’s pre-eminent researchers and include some of the nation’s most outstanding leaders of clinical and applied health and social care research. We maintain strong collaborative links with key groups both within the University of Nottingham and outside with colleagues in the UK, Europe and worldwide. Projects recently collaborated include: UK: Edinburgh (LACI-2, R4VAD, RESTART); UCL (CROMIS-2), LSTHTI (TICH-2) More news from the Division of Clinical Neuroscience Postgraduate research opportunities There are no results that match your criteria. More events from the Division of Clinical Neuroscience Vascular Research Neuroscience @ Nottingham Stroke @ Nottingham CLAHRC Stroke Rehabilitation theme Group members The University of Nottingham Clinical Sciences Building Nottingham, NG5 1PB telephone: +44 (0)115 823 1765 email:strokeadmin@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}