{
    "url": "https://www.nottingham.ac.uk/research/groups/biomaterialsrelatedinfection/index.aspx",
    "content": [
        {
            "p": "The aim of the research group is to investigate the causes and mechanisms of surgical infection, particularly that involving implantable devices, so as to advance treatment of such infections and particularly their prevention. Our research underpins our teaching, to undergraduates and postgraduates as well as training of senior doctors in international masterclasses. --Roger Bayston, Professor of Surgical Infection, Head of Biomaterials Related Infection Group Modern surgery often involves the use of devices made from biomaterials. These are prone to a particular type of infection, in which the research group has a special interest. Such surgery includes neurosurgery, critical care, trauma, spinal and orthopaedic surgery, ear infections, dialysis for kidney failure, and longterm bladder drainage. Our research involves the causes of surgical infection, how to diagnose and treat it more efficiently, and importantly how to prevent it. Much of our research is on development of antimicrobial materials for surgical use and we already have some of these in clinical use. 1. Causes of surgical infection We are carrying out research to optimize preoperative skin disinfection, and we are also reviewing the antibiotics currently used for prophylaxis. More basic research involves investigation of infections caused by bacterial biofilms. Some of these require special approaches such as anaerobic conditions. 2. Orthopaedic infections Elective surgery such as for hip or knee replacement depends heavily of antibiotics but we are working with our orthopaedic colleagues to investigate better ways to deliver these, both form prevention and for treatment when an infection occurs. We are also researching faster, better ways of diagnosing infection in these procedures. Bone trauma is often contaminated with bacteria and we are investigating ways of dealing with this rapidly and effectively, to cut time in hospital while improving outcomes for patients. Some of this work involves biodegradable polymers. 3. Neurosurgical infections 4. Ear infections Otitis media with effusion (OME) is common in children and can lead to chronic illness and deafness. We have clarified its cause and we are now collaborating with otolaryngologists to investigate ways of treating it to increase first-time success rates. Part of this research, at a very early stage, involves the use of magnetic nanoparticles. 5. Peritoneal dialysis 6. Longterm urinary catheters Catheterization of the bladder is necessary for very long periods after spinal injury, some strokes and other debilitating conditions, and patients rarely escape bladder infections and incapacitating complications. We have collaborated with Professor Morgan Alexander’s group on discovery of anti-adhesive polymers to reduce infection, the subject of a paper in Nature Biotechnology. We have also developed an antimicrobial catheter that gives antimicrobial activity for 2-3 months and promises a much – improved quality of life for catheter users. Professor Bayston has established the clinical and commercial viability of the platform technology and his strong interest in antimicrobial biomaterials has resulted in a patented process which has been used to develop a clinically successful \"anti-infective\" hydrocephalus shunt, with over 150,000 recipients worldwide, and a device for neurocritical care with over 750,000 patients worldwide. read more Further developments are under way to address infection in orthopaedics, neurosurgery, peritoneal and haemodialysis, renal medicine and in patients using central venous access devices. A second patent in this area has now been filed in several countries and has been granted in some. Having for antimicrobial neurosurgical implants, we have now extended this to include broader spectrum antimicrobial catheters for external ventricular drainage in neurocritical care, dialysis catheters and an antimicrobial longterm urinary catheter with activity for more than 80 days. Our research has been published in leading journals. Please see publications records under the individual profiles of our members. PhD opportunities There are no results that match your criteria. NIHR Nottingham Hearing Biomedical Research Unit National Biofilms Innovation Centre Group members Division or Rheumatology, Orthopaedics and Dermatology The University of Nottingham C Floor, West Block, Queen's Medical Centre Nottingham, NG7 2UH telephone: +44 (0) 115 823 1115 email:oas-admin@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}