{
    "url": "https://www.nottingham.ac.uk/research/groups/projectvttess/index.aspx",
    "content": [
        {
            "p": "Project Variable-Temperature Thermochemical Energy Storage System (VTTESS) aims to investigate to better understand the barriers to the uptake of community-based heat networks so that any socio-economic, socio-technical or environmental issues can be addressed. The project's vision is to develop high density, efficient and compact fluidised thermochemical energy storage system for low carbon district heating in partnership with all stakeholders through a co-design framework, that will decarbonise the heating systems in UK buildings sector in an engaged and sustained manner. The overarching aim of this project is to develop a thermochemical energy storage - district heating system using a co-design framework working at micro, macro and meso scales, that will contribute to reductions in carbon emissions, leading to more effective use of renewable and low carbon resources, whilst meeting societal and economic needs.The specific objectives are therefore to: The VTTESS project brings together a cross-disciplinary team of investigators and reserarchers with expertise in district heating and low carbon technology, materials science, business development, social science and policy. Our industrial partners (Hubl Ltd, NRGSense Ltd and Sustainable Direction Ltd), and a local district heating provider (Nottingham City Council) will bring their experience in large scale low carbon energy production, storage and district heating. The system involves a very unique double-acting agitated heat recovery and heat charging mechanism to store and discharge the heat. The system also consists of two fluidised beds of inorganic oxide compounds that have very high energy density. The heat can be stored in this material and then at a later date be reactivated by means of chemical reaction. The project is looking at the most effective material to store heat for later application. Basic materials are commercially-available but they have limitations. Part of the research is to characterise all available materials in the lab and then enhance their heat transfer capabilities. While conventional thermochemical energy storage systems require intermittent operation, thanks to the mechanism and material to be developed for the project, the novel system proposed will operate continuously at variable temperatures. To maximise its supply, the new system will be able to collect heat from different sources and temperatures. It will be flexible and smart; able to sense the temperature that is being delivered and store it appropriately. It will also be relatively cheap to run compared to conventional systems, which store heat in large water tanks at fixed temperature. At domestic level, it removes the fossil fuel cost, and the financial burden of boiler purchase, servicing and maintenance. Our system is decentralised. With that you can minimise the amount of heat lost through very long communal heating pipe systems. It can retain the energy in its absorbed state, with near-zero losses and so potentially allow storage inter-seasonally, e.g. storing solar energy in summer during low demand and discharging in winter during high demand. Kur, A.; Darkwa, J.; Calautit, J.; Boukhanouf, R.; Worall, M. Solid–Gas Thermochemical Energy Storage Materials and Reactors for Low to High-Temperature Applications: A Concise Review. Energies 2023, 16, 756. https://doi.org/10.3390/en16020756 There are no results that match your criteria. This area can be used to link to internal and external global research. The title of this section is yet to be finalised. University Park Nottingham NG7 2RD +44 (0) 115 951 5151 research@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}