{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Harnessing-nanotechnology-for-precision-medicine.aspx",
    "content": [
        {
            "p": "Cancer is the second leading cause of death worldwide, after heart attack and stroke. In Malaysia, breast cancer and colorectal cancer are the most common, with over 15,000 new cases in 2018 alone. When detected early, cancer can often be treated effectively, with a good prognosis. But early cancer detection remains challenging. Most cases of these cancers are diagnosed at a late stage. For breast cancer, 43% of patients present at an advanced stage of the disease and for colon cancer its even higher at 65%. Dr Kasturi Muthoosamy and Dr New Siu Yee are two of our Associate Professors with a background in chemistry. Both have a shared interest in the development and application of nanotechnology-based biosensors for effective and affordable cancer diagnosis and treatment. “Nano” describes tiny particles that are 100 thousand times smaller than the diameter of a human hair. Their small size makes them perfectly suited to faster absorption and targeted uptake in specific locations in the human body. Dr Muthoosamy looks to nanotechnology as a more acceptable alternative to current diagnostic methods for colorectal cancer which are somewhat invasive and cause fear in some patients. This work is a collaborative effort with experts in molecular biophotonics, biosensors and chemical engineering. The team is developing a nano-enzyme system by growing gold nanoparticles in a protein enzyme. Her innovation is a biosensor, imaging and therapeutic agent combined. When injected, the idea is that the agent will bind to the cancerous cells in the colon and emit a red fluorescence signal which can then be detected using bioimaging techniques. Another benefit of this biotechnology is that its even capable of delivering targeted drug therapy because the protein enzyme can digest part of the cancer cells and cause cell death. This would make it an ideal alternative to anti-cancer drugs and chemotherapy that not only destroy cancer cells, but healthy cells too. Although much more testing is needed before it can be adopted in clinical practice, if proven to be safe and effective the new therapeutic would reduce side-effects and extend life quality for cancer survivors. Metal nanoparticles and nanoclusters are also central to the work of Dr New Siu Yee; again with collaborative inter-disciplinary partnerships being key to success (UK, USA, and China). The goal for her work is to develop biosensors that are cheap to construct, and simple to use without the need of sophisticated instruments or highly trained healthcare professionals, yet clinically sensitive from a diagnostic point of view. These factors are important if any new technology is to be adopted across clinics in Malaysia and Southeast Asia especially in rural communities with limited access to facilities and expertise. One of her solutions works by detecting the protein telomerase, which is usually observed as a cancer biomarker and found in 80% of cancerous tumours. This biosensor has been shown to outperform current methods. Their passion about nanotechnology has not only fueled their ambition to achieve life changing benefits for patients in Malaysia and beyond, but it’s also given them unique opportunities for personal growth. These research achievements have been recognised in various national and international competitions that have put them in the public spotlight. We recently celebrated Dr Muthoosamy’s selection to represent Malaysia at the prestigious Women in Chemistry seminar in the Netherlands, while Dr New won an Invention and Innovation Silver Award at the Malaysia Technology Expo 2020. Through their work, they both serve as aspirational role models for women entering Science and Technology. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}