{
    "url": "https://www.nottingham.ac.uk/research/groups/crme/index.aspx",
    "content": [
        {
            "p": "The Centre for Research in Mathematics Education (CRME) is internationally known for the quality of its research and design on mathematics education policies, curricula, assessment, CPD and classroom practice. Its particular strength lies in its emphasis on designing and analysing processes, products and experiences with and for teachers and learners. This centre incorporates and continues the internationally recognised work of the Shell Centre for Mathematics Education and the Mathematics Assessment Resource Service (MARS). As part of its long-term work to raise standards in the design of educational materials and processes, the centre has worked with others to set up and develop the International Society for Design and Development in Education (ISDDE). The e-journal Educational Designer, based at the centre, is a key element in increasing the impact of the society's work. The centre's current research agenda has four interrelated themes and each research project addresses several. These are: How can we analyse, theorise and influence policy formation and implementation processes considering issues of participation, curriculum and assessment, CPD and pedagogy? How can we understand 'who gets what mathematics?' focusing on learner experiences, engagement, outcomes and trajectories? How can we design classroom learning experiences that develop the full intended range of concepts, skills and problem solving processes in a form that motivates students and encourages mathematical thinking? How can we assess the intended variety of mathematical performances in a holistic form that provides access to students of all abilities and backgrounds? What are the affordances and constraints of using technology in the assessment of mathematics? What models of CPD exist and what is their purpose? What are the effects of existing CPD products and programs on teachers' practices and beliefs? What support do teachers need to help them implement new developments in curriculum, assessment and pedagogies? How can technology - such as multimedia, the internet and social networking - contribute to CPD programmes? What role do tasks play in developing mathematical reasoning? What constitutes 'effective' pedagogies? What is the range of pedagogical strategies and skills needed to enable students to develop the intended variety of mathematical thinking and performance? How do teachers' classroom practices develop from novice skills through routine expertise to adaptive expertise? See all news See all events School of Education University of Nottingham Jubilee Campus Nottingham, NG8 1BB +44 (0)115 951 4543"
        }
    ],
    "pdf_files": []
}