{
    "url": "https://www.nottingham.ac.uk/research/groups/cancerbiology/index.aspx",
    "content": [
        {
            "p": "The Cancer Biology unit within the Division of Cancer & Stem Cells is a multi-disciplinary research centre working on biological basic of cancer, and how we can use this to translate new findings on mechanisms and cancer processes into novel therapeutic approaches for cancer and other diseases. We are funded by medical and cancer research charities, research councils and industry and have an active and lively basic and clinical scientific training programme at undergraduate and postgraduate levels. --Professor David Bates, Head of Cancer Biology The research in the unit spans basic biology to clinical research focusing on translating new findings to clinical treatments, and involves strong collaborations with clinicians and industry. Current research areas include imaging of key biological parameters within tumours, mechanisms of cancer growth, apoptosis, angiogenesis and metastatic pathways and stem cell evolution. read more... This includes in vivo and ex vivo modeling of the tumour microenvironment including: the process of epithelial-mesenchymal transition; analysis of paracrine interactions in tumour progression including HGF/c-met, Hedgehog, Gastrin, Vascular and Fibroblast growth factors; use of siRNAs using novel delivery systems for target validation; pre-clinical validation/target identification of compounds identified through indigenous knowledge systems; molecular biology of cancer progression, including contributions of regulation of alternative splicing, intestinal stem-cell transcription factor and tumour suppressor gene to carcinogenesis. A large proportion of anti-cancer drugs fail in early clinical trials. Our aim is to improve cancer models so that they are more relevant to individual patients, and so are better able to predict whether a particular patient is likely to respond to a specific anti-cancer therapy. We have developed models that incorporate close-to-patient cancer epithelial cells for a number of the hard-to-treat solid cancers including colorectal, lung, oesophageal, and pancreatic cancer, which are more representative of real patient tumours. In addition, the models include supporting cell-types such as fibroblasts which, through paracrine signalling, influence the growth and metastastic capacity of the cancer epithelial cells as well as their response to anti-cancer drugs. Incorporation of bioluminescent/fluorescent probes allow the growth and response of individual populations of cells to be tracked in real-time during each assay and changes in the tumour microenvironment/onset of biological processes that may influence drug response (e.g. hypoxia, angiogenesis, apoptosis) to be monitored. Our 3D in vitro models allow a range of drugs and drug combinations to be tested in a 384-well format, thereby enabling prediction of how cells with particular molecular characteristics respond to specific drugs/drug combinations. Application of this technology in the clinic will allow better patient stratification and increase the success-rate of anti-cancer drugs. A mixture of cell populations exists in a tumour but it is the small population of cancer-cells, called cancer stem-cells (CSCs, tumour-initiating-cells), which replenish themselves and sustain the tumour growth. We try to explore the cellular origin of cancer following the lineage-tracing, isolation, reprogramming strategies and understanding of the mechanisms regulating the different steps of cancer initiation and progression. We generate in vivo and in vitro models in defining the molecular and cellular origin of tumours which allow the expression and/or deletion of key regulators involved in: i) protein metabolism and intracellular pathway mediating protein degradation via the E3-ubiquitin ligase FBXW7 (hCDC4), ii) nuclear transcriptional programs through canonical Wnt/β-catenin signalling and iii) key pluripotent stem cell (PSC) regulators such as NANOG. We’re also developing methods for PSC-derived human intestinal tissues and selective-targeting of CSC-differentiation (differentiation-therapy). Our current projects include: Exonate Limited is a speciality pharmaceutical company recently spun out of The University of Nottingham. It focuses on the discovery and development of the first in a new class of drugs--SPHINXes--which will modulate angiogenesis. Read more Exonate’s founders have discovered and patented a novel approach underlying the mechanism of action of VEGF to bring significant advances to VEGF based therapeutics. VEGF is a validated therapeutic target and anti-VEGF-directed therapy currently constitutes the gold-standard treatment for AMD and other neovascular diseases of the eye as well as being one of the mainstays of treatment for several cancers. Our research is published in leading peer-reviewed journals such as Cancer Cell, Journal of the American Society of Nephrology and Stem Cells. Recent publications SHAH,M.;MONGAN,N.;CARDENAS,R.;WANG,B.;PERSSON,J.;GRABOWSKA, A.M.;ALLEGRUCCI,C,;HOXCB Regulates self-renewal, differentiation and transformation of breast cancer stem cells. In press in Molecular Cancer (2017) IVANOV,D.P.;GRABOWSKA,A.M.;Spheriod arrays for high-throughput single-cell analysis of spatial patterns and biomarker expression in 3D. In press in Nature Scientific Reports (2017) SAUNDERS,J.;ONION,D.;COLLIER,P.;DORRINGTON,M.S.; ARGENT,R.H.;CLARKE,P.A.;REECESMITH,A.M.;PARSONS,S.L,; GRABOWSKA,A.M.; Individual patient oesophageal cancer 3D Models for tailored treatment. In press in Oncotarget (2017) IVANOV,D.P.;COYLE,B.;WALKER,D.A.;GRABOWSKA,A.M.; In-vitro models of medulloblastoma:Choosing the right tool for the job Journal of Biotechnology 236:10-25 (2016) IVANOV,D.P.;AL-RUBAI,A.J.;GRABOWSKA,A.M.;PRATTEN,M.K. Seperating chemotherapy-related developmental neurotoxicity from cytotoxicity in monolayer and neurosphere cultures of human fetal brain cells. Toxicology in Vitro 27:88-96 (2016) IVANOV,D.P.;WALKER,D.A.;COYLE,B.;GRABOWSKA,A.M.;Data on the number and frequency of scientific literature citations for established medulloblastoma cell lines. Date in Brief 9:696-698 (2016) LORENZI,FEDERICA.,BABAEI-JADIDI,R.,SHEARD,J.,SPENCER-DENE,B., NATERI,S,A., Fbxw7-associated drug resistance is reversed by induction of terminal differentiation in murine intestinal organoid culture; Modelling drug treatment response in organoid culture. Molecular Therapy - Methods & Clinical Development. 3,1-9 (2016) GRIMES,D.R.,KANNAN,P.,MCINTYRE,A.,KAVANAGH,A.,SIDDIKY,A., WIGFIELD,S.,HARRIS,A.,PARTRIDGE,M. The role of oxygen in a vascular tumor growth. PLoS One. 18;11(4):e0153692 (2016) MCINTYRE,A.,HULIKOVA,A.,LEDAKI,I.,SNELL,C.,SINGLETON,D.,STEERS,G., SEDEN,P.,JONES,D.,BRIDGES,E.,WIGFIELD,S.,LI,J.,RUSSELL,A., SWIETACH,P.,HARRIS,A.L. Disrupting hypoxia-induced bicarbonate transport acidifies tumor cells and suppresses tumor growth. Cancer Research. Accepted in press (2016) DA MOTTA,L.L.,LEDAKI,I.,PURSHOUSE,K.,HAIDER,S.,DE BASTIANI,M.A.,BABAN,D.,MOROTTI,M.,STEERS,G.,WIGFIELD,S., BRIDGES,E.,LI,J.,KNAPP,S.,EBNER,D.,KLAMT,F.,HARRIS,A.L.,MCINTYRE,A. The BET Inhibitor JQ1 Selectively Impairs Tumour Response to Hypoxia and Downregulates CA9 and Angiogenesis in Triple Negative Breast Cancer (TNBC) Oncogene. Accepted, in press. (2016) SALMON, A.H.J., FERGUSON, J.K., BURFORD, J.L., GEVORGYAN, H., NAKANO, D., HARPER, S.J., BATES, D.O. and PETI-PETERDI, J., 2012. Loss of the endothelial glycocalyx links albuminuria and vascular dysfunction Journal of the American Society of Nephrology. 23(8), 1339-1350 SOLIMAN, M., NASANIT, R., ABULATEEFEH, S.R., ALLEN, S., DAVIES, M.C., BRIGGS, S.S., SEYMOUR, L.W., PREECE, J.A., GRABOWSKA, A.M., WATSON, S.A. and ALEXANDER, C., 2012. Multicomponent synthetic polymers with viral-mimetic chemistry for nucleic acid delivery Molecular Pharmaceutics. 9(1), 1-13 BABAEI-JADIDI R, LI N, SAADEDDIN A, SPENCER-DENE B, JANDKE A, MUHAMMAD B, IBRAHIM EE, MURALEEDHARAN R, ABUZINADAH M, DAVIS H, LEWIS A, WATSON S, BEHRENS A, TOMLINSON I, NATERI AS. 2011. FBXW7 influences murine intestinal homeostasis and cancer, targeting Notch, Jun, and DEK for degradation. Journal of Experimental Medicine. 208(2), 295-312. See more publications under individual member's profiles. Selected key grants PhD studentship. McIntyre A., Is EIF4A2 a regulator of miRNA function and hypoxic tumour cell survival, and an indicator of worse patient survival in colorectal cancer patients? £74,996. PhD studentship. McIntyre A., Targeting hypoxia regulated sodium driven bicarbonate transporters to reduce breast cancer metastasis. £89,322 Wellcome Seeding Drug Discovery Award (2016). Structure-based discovery of CaMK1D kinase inhibitors with in vivo activity as targeted therapeutic agents for breast cancer. Butterworth,S.,Fischer,P.,Overduin,M.,Berditchevski,F.,Grabowska,A., Kenyon,D. £3,324,487 for 30 months EPSRC Impact Fellowship (2016). Bar-Coded Biomaterials - Designing Self-Authenticating Medicines. Alexander,C.,Martin,S.,Grabowska,A.,Spriggs,K. £532,664 for 2 years RedX Pharma (2016): Pre-Clinical Oncology platform feasability study. Grabowska,A. £18,927 CRUK programme grant (2016): Oesophageal International Cancer Genome Consortium (ICGC). Fitzgerald,R and the OCAMMS consortium. £4,375,973 for 5 years The Brain Tumour Charity New Ideas Awards (2016): TRIGER: Targeting Residual Invasive cells for Glioblastoma ERadication. Smith,S.,Rahman,R.,Lourdusmany,A.,Grabowska,A. £95,485 for 1 year Cancer & Polio Research Fund. Ilyas M., (2015). Investigating the role of Cten and CD24 in colorectal cancer. £33,000 MRC & Industrial Collaborator. Ilyas M.,Co-I (2015). Nottingham Molecular Pathology Node, £4m. European Foundation of the Study of Diabetes (2015): Determining the link between diabetic vasculopathy and spinal cord neuron dysfunction, Hulse R.,Bates D. Euro 99,300 for 2 years Pancreatic Cancer UK (2015): Target validation of Annexin A2-S100A10 protein protein interactions in pancreatic cancer. Dekker L, Martin S, Aaitoun A, Grabowska A, Clarke P. £71,764.39 for 1 year EPSRC Programme grant (2015): Next Generation Biomaterials Discovery. Alexander M, Alexander C, Shakesheff K, Davies M, Hague R, Irvine D, Williams P, Ghaemmaghami A, Wildman R, Denning C, Grabowska A. £2,866,417 for 5 years MRC Confidence in Concept (2015): Transient Immortalisation for Human Stem Cell Expansion and Therapeutic Application. Dixon JE, Shakesheff K, Clarke P, Grabowska A. £59,786 for 7 months Wellcome Trust Pathfinder Award (2015) Nanoparticles for safer and efficient delivery of radionuclides for cancer diagnosis and therapy. Roberts C, Perkins A, Grabowska A. £99,559 for 1 year. University of Denmark. Bates D., Study to determine the preclinical properties of our anti-MFA04 antibodies in models of age related macular. £53,623. MRC UK-Thailand Research Collaborations, Newton Fund (2015): Role of heparin binding growth factors in O.viverrini induced Cholangiocarcinoma (O-CCA) development, progression and angiogenesis. Bates D.,Wongprasert K.,Grabowska A.,Tohtong R.,Janvilisri T.,UK component of grant £368,828 for 3 years British Heart Foundation Intermediate Basic Science Research Fellowship (2015) awarded to Dr Hiten Mistry, Professor David Bates and Dr. Raheela Khan. 'A new approach to an old problem: The roles of aldosterone and salt in normal pregnancy and pre-eclampsia' £478,874, for 4 years BHF Project Grant (2015) : Novel nanosensors for real time determination of shear stress experienced by the endothelial surface layer – development, validation, and use in growing vasculature. Dr Kenton Arkill Prof David Bates £113,822 for 18 months Breast Cancer Now: Targeting hypoxia regulated sodium dependent bicarbonate co-transporter to enhance radiotherapy. McIntyre A, Martin S, Harris A L, (Ref:2015 MaySP524). 12 months: £21,935. A study to investigate blood vessel function during angiogenesis was recently awarded a £398,000-project grant by the Medical Research Council. The work, led by Professor David Bates, will identify how blood vessels control their function as they grow, leading to new targets to prevent or stimulate exchange of nutrients or drugs between circulating blood and surrounding tissues. (April 2013) More news There are no results that match your criteria. More events in the Division of Cancer and Stem Cells Self-funded vacancies led by Professor David Bates and Dr Abdolrahman Shams Nateri are available. Search opportunities. Find out more about postgraduate research at the School of Medicine. Unit members School of Medicine The University of Nottingham D Floor, West Block, Queen's Medical Centre Nottingham, NG7 2UH telephone: +44 (0) 115 82 31135 email:cancer-biology@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}