{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Promoting-the-values-of-media-freedom.aspx",
    "content": [
        {
            "p": "In any country, the media exerts a powerful influence over determining how society perceives politics, the economy and cultural affairs. Media freedom is a key marker of democracy. A free press provides a channel for open debate that can challenge, as well as praise, government policies and actions. Over the years, there have been many barriers to a free press in Malaysia, but the situation seemed to take a positive turn after the 14th General Election in 2018, which saw the Pakatan Harapan coalition sweeping to power in a watershed moment. According to 2019 data from Reporters Without Borders, Malaysia rose 22 places in their World Press Freedom Index after this new government assumed office. Gayathry Venkiteswaran has long been a defender of the rights to freedom of speech in the media. Prior to her current appointment as Assistant Professor in the School of Media, Languages and Cultures, she worked for 20 years as a journalist, editor, activist and media educator, not just in Malaysia but across Southeast Asia. Her work evaluates the patterns of media coverage of significant political events in Malaysia, notably around election times. During the 14th general election Ms Venkiteswaran collaborated with UNM colleague Professor Zaharom Nain, independent groups such as Bersih and Pusat KOMAS, the Southeast Asian Press Alliance, regional press councils and Universiti Sains Malaysia to collect information on how news media outlets covered the election, how media content was shaped by ownership, political affiliation, and journalism practices and how it influenced voting outcomes. Sharing the Malaysian experience with scholars from across ASEAN enriches the project by exploring how civil liberties, transparency and press freedom are closely tied to political systems, and understanding what factors might drive media reform. The impact of this research project was amplified through a regional forum entitled “Media Reforms: Opportunities and Challenges for Malaysia, Lessons from Southeast Asia” supported by the Southeast Asian Press Alliance. This workshop brought together media practitioners to discuss the future of the Malaysian media industry and to reflect on lessons to be learned on media reform. Some topics discussed were the feasibility of setting up a media council that can self-regulate, the importance of strengthening local institutions such as the police and judiciary, and repealing laws that curbed press freedom such as the Anti Fake News Act and the Printing Presses and Publications Act. Findings were presented as a set of policy recommendations to the government, as well as being featured in scholarly debates on the media and democracy. Recent political developments have unseated the Pakatan Harapan government, and since then we’ve already witnessed crackdowns on the media aimed at stifling journalistic integrity. At this juncture, Ms Venkiteswaran’s work is more crucial than ever. She continues to advocate editorial independence, freedom of expression, and a media that is empowered to speak out for citizens without fear or favour. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}