{
    "url": "https://www.nottingham.edu.my/Research/Clusters/Future-Foods.aspx",
    "content": [
        {
            "p": "Future Food’s mission is to deliver a holistic food system approach by integrating cutting-edge research in plant science, food processing, manufacturing, and food quality monitoring while considering the socio-economic, cultural, ethical, political, and historical perspectives surrounding food-related issues. Our commitment to generate interdisciplinary solutions entails bringing researchers across disciplines, producers, consumers, and governments together to achieve secure, healthy, and sustainable food systems. Future Food focuses on addressing the problems of the food system, from agricultural production, marketing, and consumption, up to agrifood waste management. We recognise that any effort to understand our food systems would require not only input from various academic disciplines, but also from non-academic stakeholders that have intimate knowledge and different experiences of processes in food systems. Future Food aims to become a leading research and education hub for food systems via knowledge exchange, with the aim of better understanding and influencing production and consumption behaviours. We seek to impact policy by engaging with the public, government entities, and key stakeholders including NGOs. By identifying the appropriate crop and food-related targets for intervention, delivering in-depth scientific solutions, and ensuring the delivery of appropriate technology to farmers, food industries and consumers, Future Food works towards achieving the Sustainable Development Goals (SDGs) specifically to end poverty (Goal 1), promote healthy lives and well-being (Goal 3), and foster sustainable consumption and production patterns (Goal 12). Future Food is led by a team of academics from a variety of disciplines, ranging from plant biotechnology and business to media, languages, and cultures. By embracing a multidisciplinary approach, we seek to foster innovation, promote responsible practices, and address the challenges presented by the food system elements. Future Food recognises the importance of considering the entire spectrum of factors influencing our food systems to create a sustainable and resilient future. This includes converging external drivers such as biophysics and the environment; technology and infrastructure; sociocultural factors, demographics, and beyond when developing research. FSSIDS is established as a consortium to harness the biodiversity in the region for food production, nutrition security and the preservation of food cultural heritage, and to use scientific evidence to improve food systems in small islands and developing states across the Asia Pacific region. This research theme encompasses several researchers in cross-disciplinary areas (Agri-Food Economics and Social Science, Biomedical Science and Food and Nutritional Sciences, Pharmacy, Sustainable Agricultural and Food Systems) across different schools. Researchers are looking into the Transforming the Food System Strategic Priority, which focuses on the “production and preservation of healthy, sustainable food systems”. The research focuses on improving the quality of food crops, including their nutritional value, appearance, yield, flavour, and shelf life, as well as helping consumers make healthy dietary choices. The leaf of Carica papaya Linn., commonly known as papaya, contains a compound called carpaine that can help treat fevers, especially dengue fever. With the optimisation of its extraction method and drying technique, Assoc. Prof. Ir. Dr. Hii Ching Lik now strives to develop a fast-acting treatment for dengue fever in the form of a nano-emulsion. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}