{
    "url": "https://www.nottingham.ac.uk/research/groups/surgery/index.aspx",
    "content": [
        {
            "p": "Each year in the UK over 250,000 people get cancer. While surgery remains one of the few treatments capable of curing cancer, surgery is often unpleasant and carries some risk. We aim to better understand how cancer develops and create tools for its early detection and novel therapies to prevent or control its progression. We hope in the future to reduce the need for surgery and the risk of surgery, and improve patients’ outcomes if they do have surgery. Building on our successful track record of the last 10 years we aim to develop the following areas of research over the next decade: By understanding the human genome (the DNA from which we are all made) and gaining an insight into the role of “junk” DNA, which was previously believed to have no functioning role, we are beginning to recognize the role this DNA plays in the development of certain common cancers. We are comparing normal and tumour samples to identify repetitive DNA sequences that are unique to tumours. We are interested in whether these repeats can be found in blood of affected individuals and developed into biomarkers for early detection of cancer. We are investigating which factors cause the activation in cancer of particular repetitive DNA sequences and what are the consequences of this activation. In the future novel treatments can be designed which target these factors and individual repeats proven to contribute to cancer. Due to the pressing need to undergo surgery in cancer there is little time between diagnosis and operation. In the past this has meant that little could be done to improve a patient’s physical fitness before surgery. However we have designed exercise programmes that can significantly improve physical fitness in as little as 4 weeks. We now need to test if this type of programme can be used in a larger group of patients about to have surgery. It is vitally important during major surgery that the blood supply and health of the patient’s main organs (brain, kidney, liver etc) are well preserved. Traditionally this has been difficult to judge as no direct measure has been available. Recently, using techniques we have refined in healthy volunteers, we have been able to use a new ultrasound scanning technique in surgical patients to do just this. Over the next 5 years we hope to investigate the use of this technique during major surgery and on the intensive care unit. We have published in peer reviewed journals on all of the above subjects. See our individual profiles for more publications. Postgraduate study in the School of Medicine There are no results that match your criteria. Division of Medical Sciences and Graduate Entry Medicine The University of Nottingham, Royal Derby Hospital Uttoxeter Road, Derby DE22 3DT telephone: +44 (0) 1332 724622"
        }
    ],
    "pdf_files": []
}