{
    "url": "https://www.nottingham.ac.uk/research/groups/agricultural-and-environmental-systems-analysis/index.aspx",
    "content": [
        {
            "p": "Our research uses modelling, survey, and field-based approaches to improve our understanding of agri-environmental systems, including the management and policy interventions that can influence these systems. We aim to assess the effects that controllable and uncontrollable factors have on these systems, and also to develop strategies for managing them more productively and sustainably. Research is conducted in both the UK and overseas, and has addressed adaptation to climate change at the catchment level, modelling of uncertainty, nutrient budgeting and N-loss mitigation, approaches to model simplification, and strategies for managing agricultural systems more sustainably. Understanding interactions between agriculture and the environment requires farm-systems approaches. Stakeholder co-development has been used to assess trade-offs and identify key leverage points in the food system to create more sustainable futures. We use representative surveys or field-based observations and experiments to collect data, or draw on existing primary and secondary data sources, including the Farm Business Survey for England and stakeholder engagement across the agrifood chain. We then use these data to construct models of the underlying systems with particular emphasis on the mitigation of negative externalities (greenhouse gases mitigation and removal, nitrate loss, ecotoxicity, pesticide use, biodiversity loss) and considering resulting trade-offs in approaches. The group have expertise in conducting field-based experiments and studies, conducting surveys with farmers, modelling ecosystems, and working closely with a range of stakeholder groups. Research is conducted collaboratively within the group and also with the wider research community within the University of Nottingham, plus national and international collaborators (for example, British Beet Research Organisation, Centre for Ecology and Hydrology, Processors and Growers Research Organisation, University of Cambridge, Sinar Mas Agro Resources and Technology Research Institute (SMARTRI), IPB University, Universiti Putra Malaysia, Wild Asia). The University of Nottingham 332 South Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6075 email:paul.wilson@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}