{
    "url": "https://www.nottingham.ac.uk/research/groups/stemcellbiology/index.aspx",
    "content": [
        {
            "p": "We focus on understanding and modeling disease using human pluripotent, neural and mesenchymal stem cells. Our goal is to foster new opportunities to maximise translation of our fundamental stem cell biology. We are located in purpose-designed laboratories in the Centre for Biomolecular Sciences that link physically to the Medical School. This best links our multidisciplinary science directly with clinical and industrial end users. Professor Chris Denning, Head of Stem Cell Biology Group Stem cells drive development of the fertilised human egg to form the diverse cell types of the body. We recapitulate these processes in the laboratory to model the initiation and progression of human disease. Stem cell-derived sources of heart, liver and brain cells help us study diseased tissues that are not normally accessible from patients. We study genetic, epigenetic, nutritional and metabolic disorders to find treatments and use high through-put robotics to enable the search for safe new drugs. Our work on human pluripotent stem cells is used to model heart disease and to generate hepatocytes to model metabolic disorders. Watch video: How do you mend a broken heart? We use mesenchymal stem cells to study bone formation and neural stem cells to understand Alzheimers. Our stem cell models are uncovering how epigenetic mechanisms regulate human development. Our high throughput robotic capability provides unique screening capabilities to maximise the potential of our cell models. Since our formation in 2008 we have attracted a research funding portfolio of over £8M from BBSRC, EPSRC, MRC, British Heart Foundation, Heart Research UK, Alzheimer’s Society and Industry. Our research is published in leading peer-reviewed journals. See individual staff publication records. More news from the Division of Cancer and Stem Cells MSc in Stem Cell Technology PhD Opportunities Biomaterials Discovery Group members The University of Nottingham Centre for Biomolecular Sciences University Park Nottingham NG7 2RD telephone: +44 (0) 115 823 1231 email:Administrator"
        }
    ],
    "pdf_files": []
}