{
    "url": "https://www.nottingham.ac.uk/research/groups/neph/index.aspx",
    "content": [
        {
            "p": "NEPH is a cross disciplinary group of people interested in how plants respond to the environment. We bridge faculties and campuses at the University of Nottingham and study topics from root to shoot, cell to ecosystem, biotic and abiotic stress and cover a range of species with a strong focus on crops. Nottingham and especially the Sutton Bonington campus (home of the university farm) has certainly made an impact in the plant and crop physiology world, here are some famous examples:Professor John Monteith pioneered the methods and principles of measuring canopy radiation (light) use efficiency (RUE) which is now a cornerstone of crop physiology. He also co-developed the Penman-Monteith equation to predict evapotranspiration, used by the FAO. Roger Slack, a graduate of Nottingham was the co-discoverer of C4 photosynthesis along with Hal Hatch. C4 is a fascinating photosynthetic adaptation permitting high productivity in warm climates and he subject of much current interest for crop improvement. Georgina Barratt has been awarded funding from Kesteven Scholarship Fund to attend the International Sugar Beet Congress in February 2020 where she will give a paper entitled ‘Understanding water use efficiency in sugar beet.’ Lucy Tillier will be presenting a poster on the first year results of her PhD at the same meeting. Georgina Barrett also spent a few weeks last summer working in Lawren Sack’s lab at UCLA. Magdalena Cobo-Medina won the poster prize at PEPG ECR event held at Eden project 2019. The next PEPG workshop in Portugal September 2020 is organised by Amanda Rasmussen (UoN, NEPH). Cousins OH, Garnett TP, Rasmussen A, Mooney SJ, Smernik RJ, Cavagnaro TR (2019) To stress or not to stress: Plant and soil responses to variable water and nitrogen supply. Plant Science. 290: 110146 doi.org/10.1016/j.plantsci.2019.05.009 Rasmussen A, Dobrijevic DP, Ola A, Ishaya FD, Lovelock CE (2019) Aerial root physiology: Reaching for the sky or down to earth? Annual Plant Reviews https://doi.org/10.1002/9781119312994.apr0668. Hartman T, Lydon SJ, Rasmussen A (2019) Hunting for Answers: Linking lectures with the real world using mobile treasure hunt app Plants People Planet; doi.org/10.1002/ppp3.33. Kumssa DB, Lovatt JA, Graham NS, Palmer S, Hayden R, Wilson L, Young SD, Lark RM, Penrose B, Ander EL, Thompson R, Jiang LX, Broadley MR. (2019) Magnesium biofortification of Italian ryegrass (Lolium multiflorum L.) via agronomy and breeding as a potential way to reduce grass tetany in grazing ruminants. Plants and Soil. doi:10.1007/s11104-019-04337-x Wright, AJD, Sparkes, DL, Stevens, M and Back, MA (2019) Hatching dynamics of the beet cyst nematode, Heterodera schachtii, following exposure to root leachates from cultivars of sugar beet, white mustard and radish. Nematology, 21, 813-825. Wright, AJD, Back, MA, Stevens, M and Sparkes, DL (2019) Evaluating brassica trap crops to manage Heterodera schachtii (Schmidt) infestations in Eastern England. Pest Management Science 75, 438-443. https://doi.org/10.1002/ps.5134 Kaczmarek, AM, King, KM, West, JS, Stevens, M, Sparkes, D, Dickinson, MJ (2018) A loop-mediated isothermal amplification (LAMP) assay for rapid and specific detection of airborne inoculum of Uromyces betae (sugar beet rust). Plant Disease. https://doi.org/10.1094/PDIS-02-18-0337-RE Jones, S, Farooqi, A, Foulkes, J, Sparkes, D, Linforth, R, Ray, RV (2018) Canopy and ear traits associated with avoidance of Fusarium head blight in wheat. Frontiers in Plant Science. https://doi.org/10.3389/fpls.2018.01021 The University of Nottingham Division of Agriculture and Environmental Science School of Biosciences Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0)115 95 16293 email: a.rasmussen@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}