{
    "url": "https://www.nottingham.ac.uk/research/groups/icarus/index.aspx",
    "content": [
        {
            "p": "Integrated ClimAte Resilience UnderStanding (ICARUS) Belize is a project funded by the Leverhulme Trust (RPG-2021-288). It is based in the UK bringing together Belizean and Mexican researchers to develop a new approach to understanding how we can build resilience to climate change by learning from both the past and the present. The project aligns with number of the United Nations Sustainable Development Goals, (SDGs) including SDG17 – Partnerships for the goals, SDG15 - Life on land and SDG13 – Climate action. Belize is classified as a Small Island Developing State (SIDS) with a political alignment to the Caribbean, despite being located in Central America. Increasing temperatures, decreasing rainfall, more intense tropical storms, and droughts make Belize highly vulnerable. Hurricane activity has been on the rise since the 1970s, and Belize has experienced the direct or indirect impact of multiple hurricanes, including Nana, Eta (Figure 1), and Iota in 2020. Droughts are also becoming increasingly severe. The intensity of the 2019 drought resulted in crop losses and the declaration of a partial state of emergency. This situation presents an opportunity to develop innovative approaches for comprehensively assessing resilience to climate change, which can be valuable not only to other SIDS but also to similar areas with limited monitoring and research infrastructure and economies that are highly exposed to climate risks. Integrated ClimAte Resilience UnderStanding (ICARUS) Belice es un proyecto financiado por Leverhulme Trust (RPG-2021-288). El proyecto está basado en el Reino Unido y reúne además a investigadores beliceños y mexicanos con el fin de desarrollar un nuevo enfoque para comprender cómo podemos aumentar la resiliencia al cambio climático aprendiendo tanto del pasado como del presente. El proyecto se alinea con varios de los Objetivos de Desarrollo Sostenible (ODS) de las Naciones Unidas, incluidos el ODS 17 (Alianzas para lograr los objetivos), el ODS 15 (Vida de ecosistemas terrestres) y el ODS 13 (Acción por el clima). A pesar de estar situado en América Central, Belice está clasificado como Pequeño Estado Insular en Desarrollo (SIDS, por sus siglas en inglés) con una alineación política con el Caribe. El aumento de las temperaturas, el cambio en la variabilidad de las precipitaciones, el incremento en la intensidad de las tormentas tropicales y las sequías hacen que Belice sea altamente vulnerable. La actividad de los huracanes ha ido en aumento desde la década de 1970, y Belice ha experimentado el impacto directo o indirecto de múltiples huracanes, incluidos Nana, Eta (Figura 1) y Iota en 2020. Las sequías también son cada vez más severas. Por ejemplo, la intensidad de la sequía de 2019 provocó grandes pérdidas de cosechas y la declaración de un estado de emergencia parcial. Esta situación presenta una oportunidad para desarrollar enfoques innovadores para evaluar exhaustivamente la resiliencia al cambio climático, los cuales pueden ser valiosos, no solo para otros SIDS, sino también para áreas similares con una infraestructura limitada de monitoreo e investigación y economías que están expuestas a los riesgos climáticos. Figure 1. a), b) and c) Trajectory of Hurricane Eta 2022; d) Flooding at San Ignacio, Belize after Eta. Figura 1 – a), b) y c) Trayectoria del huracán Eta 2022; d) Inundación en San Ignacio, Belice después de Eta. The project aims to develop new ways of understanding climate resilience and how this changes over time. Through the integration of information from Earth Observation data, meteorological instrumental records, local-community knowledge and experience, historical records and palaeoenvironmental data this will enable a deeper understanding of resilience to extreme climate events in Belize. El proyecto tiene como objetivo desarrollar nuevas formas de entender la resiliencia al cambio climático y su evolución a lo largo del tiempo. A través de la integración de datos de percepción remota, registros meteorológicos, conocimientos y experiencias de las comunidades locales, registros históricos y datos paleoambientales se podrá entender holísticamente la resiliencia ante fenómenos climáticos extremos en Belice. This project aims to develop a new approach to understanding resilience to extreme climate events in Belize by combining methods over a range of timescales. The project is led by Professor Sarah Metcalfe at the University of Nottingham, in collaboration with colleagues within Nottingham, the University of Liverpool and the University of Stirling. View the latest news updates from the Integrated ClimAte Resilience UnderStanding (ICARUS) Belize project. It is a collaborative effort with the project partners and advisory panel (the Ya’axche Conservation Trust (Figure 2), the Caribbean Community Climate Change Centre, the Ministry of Agriculture, Food Security and Enterprise in Belize, ECOSUR in Mexico, Baylor University in USA and Northumbria University in the UK). El proyecto está dirigido por la Prof. Sarah Metcalfe de la Universidad de Nottingham, en colaboración con otros colegas de Nottingham, de la Universidad de Liverpool y de la Universidad de Stirling. Se trata de un esfuerzo de colaboración con los miembros del proyecto y el panel de asesores (Ya'axche Conservation Trust (Figura 2), Centro de Cambio Climático de la Comunidad del Caribe, Ministerio de Agricultura, Seguridad Alimentaria y Empresa en Belice, ECOSUR en México, la Universidad de Baylor en EE.UU. y la Universidad de Northumbria en el Reino Unido). Figure 2. Meeting with Ya'axche Conservation Trust, during the first fieldwork (January 2023). Figura 2. Reunión con Ya'axche Conservation Trust durante el primer trabajo de campo (enero 2023). sarah.metcalfe@nottingham.ac.uk Follow us on Twitter @ICARUS_Belize"
        }
    ],
    "pdf_files": []
}