{
    "url": "https://www.nottingham.ac.uk/researcher-academy/news/latest-news/how-postgraduate-placements-helped-us-to-manage-increased-interest-in-our-business.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy October 5, 2022, by Postgraduate Placements Nottingham Research Consulting Offices at the Ingenuity Centre. Photography by Alex Wilkinson Media Research Consulting has a long and successful history of working with University of Nottingham graduates and students. The various placement schemes offered by the University have been the main way we’ve done this over the past few years, with five current members of our team joining us through Nottingham-led schemes, and a further seven Nottingham students being employed by us in various roles since 2013. Most recently, two members of our team – Ellie Cox and Emily Quigley – joined us through the Productivity in Innovation scheme in 2021 and 2022. In this post, we’ll share just a few ways that our fantastic placement students have supported us in our work. As a small, but growing consultancy firm based in Nottingham, Research Consulting has a tight-knit team of eleven staff. We are based at the University of Nottingham Innovation Park and, since 2013, we have worked with a growing set of clients in the UK and internationally including government departments, research funders, universities, and not-for-profit organisations to enhance the effectiveness and impact of research and scholarly communication. Over the years, our team has become accustomed to working in a fast-paced environment and managing a high workload. However, following the peak of the COVID-19 pandemic, when streams of enquiries and opportunities began flowing back in, and demand for our support started to rise, this became even more apparent. To help us manage the increasing interest in our work, we contacted the placements team at the University, to see how they could help. Following a flood of applications, and a busy interview period, we welcomed Ellie to the team in 2021. In early 2022, Emily joined us to take up a similar role. Throughout their placements, Ellie and Emily have been working with us on a part-time basis, split between our office and from home. This has offered them the same flexibility as full-time members of our team and has allowed them to balance their roles at Research Consulting with their other, ongoing, academic commitments. As PhD candidates in Medieval History, both Ellie and Emily’s skill sets have been well-suited to our work. However, the placement has provided experiences and insight to pathways beyond academia. Over the course of their placements, both students have supported us across projects, exposing them to new topics such as open access publishing, the transformation to digital research services, and even genomic viral data sharing. Emily, for example, put it this way: As part of their placements, Ellie and Emily have also got to grips with new tools like Zotero and NVivo that help us to manage and analyse the qualitative data we collect, such as during literature reviews and interviews. For example, when Ellie first joined us, she supported us with the literature review on a project commissioned by Wellcome, UK Research and Innovation and the Bill & Melinda Gates Foundation, investigating the impact of a Joint Statement, urging publishers to make COVID-19 content immediately and freely accessible. After providing some initial training in using NVivo, having an extra pair of hands to help with the qualitative analysis was incredibly valuable to us. Equally, Ellie added a new tool to her qualitative research toolkit, giving her the opportunity to expand her skillset. Here’s what Ellie thought about her experience: Through the Productivity in Innovation Scheme, we’ve received 800 hours of support across our research projects. The additional capacity we’ve gained through the scheme has now had knock-on impacts across the team, giving us more flexibility to take on and deliver work for our clients. In addition, the opportunity to undertake a paid work experience placement has been valuable to the placement students, giving them both insight into careers beyond academia, and the opportunity to develop transferable skills. Overall, the impact of the placement students in our team has been entirely positive. As a result, we extended both Ellie and Emily’s contracts so that they’ll both be with us until at least the end of 2022. We’ve already seen so many benefits emerge from the scheme, and we can’t wait to see what the next four months will bring! No comments yet, fill out a comment to be the first Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}