{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Reconsidering-racialised-identities-in-the-Malay-world.aspx",
    "content": [
        {
            "p": "Race has become so deeply rooted in the Malaysian narrative that its people often struggle to untangle themselves from racialised perspectives. The same is said to be true for Malaysia’s neighbours: Indonesia and Singapore. Yet these three countries were once part of a rich shared history. Dr Sumit Mandal, Associate Professor in the School of Politics, History and International Relations, is intrigued by this era of interconnectedness. His work has delved into the histories of these three ASEAN countries to uncover much inter-mixing and interaction between its peoples. As part of his work, he situates the Malay world against the broader backdrop of the Indian Ocean and contemplates patterns of trade, migration and cultural exchange, observing how these patterns created inter-mixed societies that defied social categorisation. One of the best known outcomes of his scholarly work has been his book Becoming Arab: Creole histories and modern identity in the Malay world, published by Cambridge University Press in 2018. The book explores thriving Arab communities in the Malay world of the 16-18th centuries. These communities traced their origins to Hadhrami Arabs migrating from Yemen, who integrated quite comfortably into local societies. The arrival of colonial powers in the 19th century led to the introduction of a system of racial categorisation that partitioned inter-mixed societies. Dr Mandal suggests that this colonial system became institutionalised, eventually shaping the racialised lens through which modern-day communities in Malaysia, Singapore and Indonesia view one another. Recognising his outstanding scholarship in Southeast Asian studies, in 2020, Becoming Arab was awarded the Harry J. Benda book prize by the US-based Association for Asian Studies. Dr Sumit regularly draws from his research to reinterpret contemporary identities, sharing his findings in academic publications, talks, podcasts and public media discussions. His expertise has also been called upon in the planned revamping of the Malay World Gallery in the Islamic Arts Museum of Malaysia. In light of deepening ethnic tensions between communities in Southeast Asia, his research serves as a reminder of a shared past and a call for a greater appreciation of human diversity. His perspective offers a refreshing counterpoint to the race-based politics that to continues to have a grip on the world. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}