{
    "url": "https://www.nottingham.ac.uk/research/groups/vascularmedicine/index.aspx",
    "content": [
        {
            "p": "The Vascular Medicine group, based at the Royal Derby Hospital site, aims to perform high quality research in diseases associated with vascular dysfunction to improve patient care. --Professor Richard Donnelly, Head of research group Diabetes, stroke, chronic kidney disease and peripheral vascular disease are some of the UK more prevalent, chronic and life threatening disease. Underpinning all of these, and other, pathologies is vascular dysfunction. 1. Stroke a) Investigating the impact of remote ischaemic conditioning following ischaemic stroke b) Assessing the effects of G-CSF and other colony stimulating factors in promoting stroke recovery through generation of haematopoietic stem cells c) Studying the role of the endocannabinoid system and cannabinoids in blood-brain-barrier dysfunction and the potential therapeutic effects of cannabinoid supplementation 2. Diabetes a) Investigating new therapeutics in the treatment of vascular and metabolic dysfunction associated with diabetes in preclinical models, healthy volunteers and clinical trials b) Novel therapeutics, dietary and exercise aspects for the management of obese patients with diabetes c) Exploring the vascular impact of human and analogue insulin d) Epidemiological and population studies investigating safety, efficacy and treatment strategies in diabetes and non diabetes cohort using retrospective database analysis – THIN / CPRD e) Clinical trials for the management of foot ulcers in patients with diabetes 3. Vascular calcification a) Exploring the role of hydrogen sulphide in vascular calcification associated with ageing and CKD b) Investigation the effects of bone derived hormones (particularly osteocalcin) and factors on body systems and how these might be manipulated to reduce disease, including vascular disease and calcification c) Investigating the effects of drugs and hormones on bone physiology, with a particular emphasis on leptin, endocannabinoids, and drugs for treating obesity, diabetes and osteoporosis Our research is published in leading peer-reviewed journals. Recent publications ENGLAND, T.J., BATH, P.M.W., ABAEI, M., AUER, D. and JONES, D.R.E., 2013. Hematopoietic stem cell (CD34+) uptake of superparamagnetic iron oxide is enhanced by but not dependent on a transfection agent. Cytotherapy: Journal of Cell Therapy. 15(3), 384-390 BATH P, SPRIGG N and ENGLAND T, 2013. Colony stimulating factors (including erythropoietin, granulocyte colony stimulating factor and analogues) for stroke. Cochrane Database of Systematic Reviews. Doi: 10.1002/14651858.CD005207.pub4 ENGLAND, T.J., ABAEI, M., AUER, D.P., LOWE, J., JONES, D.R.E., SARE, G., WALKER, M. and BATH, P.M.W.,2012. Granulocyte-colony stimulating factor for mobilizing bone marrow stem cells in subacute stroke: the Stem Cell Trial Of Recovery Enhancement After Stroke 2 Randomized Controlled Trial Stroke. 43(2), 405-411 More publications under individual members' profiles. PhD opportunities Group members Division of Medical Sciences & Graduate Entry Medicine School of Medicine The University of Nottingham Royal Derby Hospital Centre Uttoxeter Road, Derby, DE22 3DT email:S.osullivan@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}