{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Advancing-the-field-of-psychology-through-a-global-collaborative-network.aspx",
    "content": [
        {
            "p": "Concerns have been growing about the reliability of psychological research findings. Studies conducted by individual researchers tend to collect data from samples that are not very representative of the population at large and have insufficient statistical power. As a consequence, many reported scientific findings can’t be replicated. In other words, another laboratory might conduct the same experiment but obtain different results. Without doubt, this throws into question the original conclusions. Crowdsourcing can provide a pragmatic solution by supporting large-scale studies that are conducted collaboratively across multiple laboratory sites. Professor Steve Janssen in the School of Psychology is part of a worldwide initiative that is overcoming these challenges by promoting more comprehensive and reliable evidence-gathering in psychological science. The Psychological Science Accelerator seeks to better understand behavioural patterns through a global reach ̶ 500 participating psychology research laboratories spanning 70 countries on 6 continents ̶ that enables much more diverse, inclusive and representative data sampling. Although similar projects have been initiated in the past, none have matched the scale or structure of the accelerator. All members are welcome to submit research proposals, which are evaluated in a fair and democratic process. Approved studies are carefully planned from the very start and all members can participate in multiple studies each year. As Assistant Director for the Logistics team, Prof Janssen plays an important role that includes matching studies with laboratories that want to participate. So far, the scope of research covers a wide variety of topics from face perception, visual object processing, and beliefs and stereotypes. The very first study, about social judgments of faces, asked whether the dimensions of trustworthiness and dominance identified previously in a US study are universal across other countries and cultures. Over 150 laboratories participated from 41 countries, recruiting more than 11,000 participants. Unlike the previous study, not only were the participants more diverse, but the faces that were used as stimuli were also more diverse. Overall the results replicated the initial findings when the analysis method was constrained to be the same, but when an alternative methodology was used some interesting regional differences emerged. In the spirit of inclusion, Prof Janssen engages University of Nottingham Malaysia students wherever possible. The experience not only exposes them to a large-scale international collaboration, but also instils in them the core principles of the network as a valuable lesson for lifelong learning: diversity and inclusion, democratic decision making, transparency, openness to criticism and scientific rigour. The Psychological Science Accelerator provides an ideal context in which to train early-career psychological researchers, and in which scientists of all career stages can learn about new methodological practices and paradigms. There is a promising future ahead for the Psychological Science Accelerator and it’s great to see that University of Nottingham Malaysia playing a key role in driving forward this ground-breaking initiative. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}