{
    "url": "https://www.nottingham.ac.uk/research/groups/paediatricmedicines/index.aspx",
    "content": [
        {
            "p": "The aim of our group is to improve knowledge and practice of the safe, rational and effective use of medicines in neonatal and paediatric patients. We seek to strengthen the evidence base in areas where paediatricians, pharmacists and nurses practise on a daily basis. The use of unlicensed and off label medicines (medicines without a license or used outside the license) is needed in the everyday care of neonates and children. This lack of suitable, licensed products and the lack of necessary evidence and information for use in these patients leaves children vulnerable to medication errors and adverse drug reactions. Our research has highlighted this at an international level and European law has now changed. Despite this children are still regularly exposed to unlicensed, off label, irrational and sub-optimal use of medicines resulting in subsequent toxicities or lack of therapeutic effect. Our research aims to explore, describe and create a scientific evidence base from which to improve the use of medicines in children. We have had several PhD students doing projects in this area exploring issues such as the nature and prevalence of medication errors in children in the UK; educational interventions to reduce prescribing errors, competency assessment of paediatric prescribers, effectiveness of double checking in drug administration to children and the role of the paediatric clinical pharmacist in reducing risk. We have had a number of PhD students conducting research in drug toxicity. These have included systematic reviews of the literature on the toxicity of important medicines in children e.g. anticonvulsants, corticosteroids, anti-infective and sedative agents. We have performed prospective studies of antiepileptic drugs in children and are planning a national study. We also have longstanding collaboration with the Uppsala Monitoring Centre, and have analysed the WHO database on adverse drug reaction reports which has resulted in several publications. Related work includes clinical research studies on the palatability and tolerability of commonly used oral medicines in children e.g. analgesic agents and corticosteroid drugs.. We are conducting work to explore whether drugs are prescribed for children in a rational way and to identify which are the key groups of drugs where this is not the case. There is currently a lack of tools to evaluate and measure this in a systematic and robust way which are easy and practical to use so we have a PhD student working in this area. In addition we have another PhD student who will continue this work, extending it to neonates. We have previously studied access to medicines in children from deprived groups – refugees and travellers. We plan to repeat the study in refugee children as there have been more refugee children since the last study. We will also do qualitative research in this group, i.e. semi-structured interviews exploring any problems they have in accessing healthcare. Child mortality rates in children with asthma are higher than in other European countries. We plan to interview health professionals/parents of children who died from asthma to identify barriers to effective treatment. It is well known that many adults do not take their medicines as prescribed and it is thought that this is an even bigger problem in children. This can lead to serious consequences for patients and their families and is a waste of huge amounts of NHS resources. We are currently exploring ways to help children and their families to optimise their medicines use. We have published extensively in all of the above fields. Please click on our individual member profiles to see our publications. We are involved at a high level with a number of important paediatric medical, pharmacy and pharmacology groups with our members of staff playing important roles in these organisations: We offer projects in various aspects of paediatric clinical pharmacology and the use of medicines in neonates and children. We are particularly interested in inequalities and access to medicines. Group members School of Medicine The University of Nottingham Royal Derby Hospital Uttoxeter Road Nottingham, DE22 3DT telephone:+44 (0)1332 724622 email:gem@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}