{
    "url": "https://www.nottingham.ac.uk/research/groups/cebhs/index.aspx",
    "content": [
        {
            "p": "The Centre for Evidence Based Hand Surgery (CEBHS) is a collaboration between the British Society for Surgery of the Hand, The University of Nottingham and Nottingham University Hospitals NHS Trust, working with patients and the wider community of all those involved in hand surgery care. The CEBHS core membership comprises clinicians, academics and researchers from Academic Orthopaedics, Trauma and Sports Medicine and the Nottingham Clinical Trials Unit (NCTU). We aim to undertake research into common hand conditions of direct relevance to patients, clinicians and the NHS. We support a collaborative approach to study design, with patients, medical staff and clinical trial experts working together to develop high quality studies to improve clinical practice. Please see our Projects section to find out more about our research. In order to summarise what is already known and identify gaps in knowledge, we conduct systematic reviews of the evidence. We bring surgeons, therapists and patients together to prioritise research uncertainties, which can then be addressed by conducting research studies, such as randomized trials. The CEBHS aims to involve patients, carers and the public in all of its research activity. This will help to ensure that we focus on research questions that are relevant to all and improve the care of patients in the NHS. We also try to develop and signpost reliable and unbiased information about hand surgery. If you are a patient, clinician or NHS manager and want to know more about our research and how to get involved please see our \"For patients\" section, or contact us at CEBHS@nottingham.ac.uk. Find the best evidence in our HandSRev database of systematic reviews by topic. Sign up to our free Hand Surgery Evidence Updates service to find out what is new. The concept and creation of a Centre for Evidence Based Hand Surgery was based on the advice and experience of Professor Hywel Williams of the University of Nottingham, who set up the Centre of Evidence Based Dermatology. More news CEBHS@nottingham.ac.uk Orthopaedic and Trauma research Sports and Exercise Medicine Arthritis Research UK Pain Centre The University of Nottingham C Floor, West Block, QMC Nottingham, NG7 2UH email:CEBHS@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}