{
    "url": "https://www.nottingham.ac.uk/research/groups/digital-culture-research-network/digital-culture-research-network.aspx",
    "content": [
        {
            "p": "The Digital Culture Research Network (DCRN) is an interdisciplinary group of researchers based at the University of Nottingham who are currently exploring the ‘doing’ of the digital in relation to social media, video games, data analytics, networked technologies, film distribution, political activism, linguistics, gender and identity. The Network offers an open space within which people can share their ideas of 'the digital', and hope to forge links with similar institutions worldwide. Aiming to be attentive to the specificity of digital technologies within the precise cultural and historical context of their inception and use. The DCRN creatively explores how digital practices are embedded, enacted and embodied across diverse spheres of human being, and attempt to elucidate the means through which society can understand the technical relations that colour contemporary life. Broadly, the DCRN asks: DCRN Academic Retreat 6-12 July 2019 Conference: Digital Culture 2019: Access 10 May 2019, University of Nottingham A Dark Strangelove, or: How I learned to stop worrying and love the 'dark' side of digital A critique of linguistic capitalism (and an artistic intervention), with Pip Thornton (Royal Holloway), 24 July 2018 Power, Knowledge, Algorithm: A workshop presented by the Centre for Critical Theory in association with the Digital Cultures Research Network, 29 May 2018 Digital Culture 2018: A one-day conference, (University of Nottingham), 20 April 2018 Social media memorialising and the public death event, forum with Sasha Scott, 5 March 2018 Boys’ Love, Byte-sized: Queer-themed Microfiction in China’s Online Spaces, forum with Gareth Shaw (University of Nottingham), 12 December 2017 DCRN Forum with Dr Sally Xiaojin Chen (University of Sussex), Connective action and resistance in digital China, 26 May 2017 DCRN Forum with Dr Rob Gallagher (King’s College London), Avatars, sockpuppets and ventriloquists’ dummies: Selves and others online, 3 April 2017 Niki Cheong David Young Robert Stenson Judit Varga Louis Cotgrove Emma Humphries Matthew Voights Niall Docherty Betti Bodi Siqi Wang digitalculture@nottingham.ac.uk Digital Culture Research Network The University of Nottingham University Park Nottingham, NG7 2RD email: digitalculture@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}