{
    "url": "https://www.nottingham.ac.uk/research/groups/criminal-justice-research-centre/publications.aspx",
    "content": [
        {
            "p": "Explore the latest publications from members of the Criminal Justice Research Centre. Buck, G, Harriott, P, Ryan,K, Ryan, N and Tomczak, Philippa, (forthcoming 2020) ‘All our justice: People with convictions and ‘participatory’ criminal justice’ in Duffy, J. and Beresford, P. (Eds.) Handbook of Service User Involvement in Human Services Research and Education. Oxon: Routledge. Celiksoy, Ergul, 'Ibrahim and Others v. UK: Watering down the Salduz principles?' (2018) 9(2) New Journal of European Criminal Law 229. Celiksoy, Ergul, 'Ongoing Problem of Irreducible Life Sentences in Turkey' European Journal of Crime, Criminal Law and Criminal Justice (forthcoming). Celiksoy, Ergul, 'Overruling ‘the Salduz Doctrine’ in Beuze v Belgium: The ECtHR’s Further Retreat from the Salduz Principles on the Right to Access to Lawyer' New Journal of European Criminal Law (under-review). Clarke, N., Munro, N. and Hocking, C. (2019) Going to Pot: Nick’s journey through the criminal justice system in Flynn, E., Arstein-Kerslake, A., de Bhailís, C. & Serra, M.L. (2019) Global Perspectives on Legal Capacity Reform: Our Voices, Our Stories (Oxford: Routledge) Hocking, C. (2019). Facilitating Access to Justice: The Experiences of Autistic Individuals Detained in Police Custody, Doctoral, University of Nottingham Holá, Barbara, Mulgrew, Róisín and van Wijk, Joris (eds), Special Issue of International Criminal Law Review (2019) 19 (1) ‘National Prosecutions of International Crimes: Sentencing Practices and (Negotiated) Punishments’: https://brill.com/view/journals/icla/19/1/icla.19.issue-1.xml Holloway, C., Munro, N., Jackson, J. and Ropar, D. (under review). Exploring the autistic and police perspectives of the custody process through a participative walkthrough, Research in Developmental Disabilities (Special Issue: Neurodevelopmental Disorders and Criminal Justice) Holloway, C., Munro, N., Jackson, J. and Ropar, D. (pending). Coping with the demands of detention: Evaluating the impact of police custody on autistic individuals in England and Wales, Autism Hoskins, Zachary, Beyond Punishment? A Normative Account of the Collateral Legal Consequences of Conviction (New York: Oxford University Press, 2019). Hoskins, Zachary, 'Against Incapacitative Punishment', in Jan de Keijser, Julian Roberts, and Jesper Ryberg (eds.), Predictive Sentencing: Normative and Empirical Perspectives (Oxford: Hart Publishing, 2019),pp. 89-105. Hoskins, Zachary, 'May, Larry', in M.N.S. Sellers and Stephan Kirste (eds.), Encyclopedia of the Philosophy of Law and Social Philosophy (Dordrecht: Springer, 2019). Hoskins, Zachary, Review of Mark Dsouza, Rationale-Based Defences in Criminal Law, in Criminal Law and Philosophy (2019): 1-6. DOI: 10.1007/s11572-019-09500-0. Hoskins, Zachary, 'Criminalization and the Collateral Consequences of Conviction', Criminal Law and Philosophy 12 (2018): 625-39. Hoskins, Zachary, 'Offenders’ Rights and Public Safety', in John Child and Antony Duff (eds.), Criminal Law Reform Now (Oxford: Hart Publishing, 2018), pp. 67-74. Hoskins, Zachary, 'Multiple-Offense Sentencing Discounts: Score One for Hybrid Accounts of Punishment', in Jesper Ryberg, Julian V. Roberts, and Jan W. de Keijser (eds.), Sentencing Multiple Crimes (New York: Oxford University Press, 2018), pp. 75-93. Hoskins, Zachary, 'Collateral Consequences of Conviction', in Hugh LaFollette (ed.), International Encyclopedia of Ethics (Wiley-Blackwell, 2018). Hoskins, Zachary, 'The Danger of Making Exceptions for the Death Penalty', IAI News (Oct. 8, 2018), online at https://iainews.iai.tv/articles/the-isis-beatles-thinking-about-the-death-penalty-again-auid-1154. Jackson, John, Special Advocates in the Adversarial System (Routledge, 2019) 292. Jackson, John, “The Use of Special Advocates in Countering Terrorism: Human Rights, Best Practice and Procedural Tradition” in G Lennon, C King and C McCartney (eds), Counter-terrorism, Constitutionalism and Miscarriages of Justice: A Festschrift for Clive Walker (Hart, 2019) 99-115. Jackson, John, “Common Law Evidence and the Common Law of Human Rights: Towards a Harmonic Convergence?” (2019) 27 William & Mary Bill of Rights Journal 689-715. Jackson, John and Roberts, P, “Beyond Common Law Evidence - Reimagining, and Reinvigorating, Evidence Law as Forensic Science” in D Brown and J Turner (eds), Oxford Handbook of Criminal Process (OUP, 2019) 787-820. Kemp, Vicky (2020) ‘Digital Legal Rights: Exploring Detainees’ Understanding of the Right to a Lawyer and Potential Barriers to Accessing Legal Advice’, Criminal Law Review . Kemp, Vicky (2020) ‘Authorising and Reviewing Detention: PACE Safeguards in a Digital Age’, Criminal Law Review. Kemp, Vicky (2018) Digital Legal Rights for Suspects: Users’ Perspectives and PACE Safeguards: http://eprints.nottingham.ac.uk/52777/ Kemp, Vicky (2018) Effective Police Station Legal Advice: Country Report for England and Wales: http://eprints.nottingham.ac.uk/51145/ Kemp, Vicky (2018) Effective Police Station Legal Advice: Country Report for Ireland: http://eprints.nottingham.ac.uk/52153/ Kemp, Vicky (2018) Effective Police Station Legal Advice: Country Report for Northern Ireland: http://eprints.nottingham.ac.uk/52271/ Kemp, Vicky (2018) Effective Police Station Legal Advice: Country Report for Scotland: http://eprints.nottingham.ac.uk/51251/ Quinn, K. and Tomczak, Philippa, (forthcoming 2020) ‘Emotional labour in the penal voluntary sector’ in Phillips, J. et al. (Ed.), Emotional Labour in Criminal Justice. Routledge. Roberts, Paul and Stockdale, Michael (eds), Forensic Science Evidence and Expert Witness Testimony: Reliability Through Reform? (Edward Elgar, 2018), xxi + 431pp (including “Introduction: Forensic Science, Evidential Reliability and Institutional Reform” (with Michael Stockdale), 1-26; and “Making Sense of Forensic Science Evidence”, 27-70). Roberts, Paul, “Five Foundational Fallacies of Common Law Evidence” (in Chinese, translated by Ping Yang and Baosheng Zhang) (2018) 26 Evidence Science 93-108. Roberts, Paul, “The Forensic Challenge” (2018) 13 Frontiers of Law in China 1-24. Roberts, Paul, “The Right of Silence, Socio-legal Research and Law Reform Politics (and Brexit)’ (2019) 23 E & P 330-38. Thomason, Matt, ‘The Criminal Bar Association Study and Section 41: Dousing or Stoking the Flames?’ (2019) 2 Archbold Review 4-6. Thomason, Matt ‘Previous Sexual History Evidence: A Gloss on Relevance and Relationship Evidence’ (2018) 22(4) International Journal of Evidence and Proof 342-362. Thomason, Matt, Case Comment in R v Moody [2019] EWCA Crim 1222, [2019] Criminal Law Review (Forthcoming, October 2019). Tomczak, Philippa, (2018) Prison Suicide: What Happens Afterwards? Bristol: University of Bristol Press. Tomczak, Philippa and Buck, G (2019) 'The Penal Voluntary Sector: A Hybrid Sociology’. British Journal of Criminology, 59(4), 898-918. Tomczak, Philippa, (Special Issue Editor; Introduction) (forthcoming 2019) ‘The Criminal Justice Voluntary Sector: In Comparative Perspective’. Howard Journal of Crime and Justice. Tomczak, Philippa and Buck, G (forthcoming 2019) 'The Criminal Justice Voluntary Sector: Concepts and an Agenda for an Emerging Field’. The Howard Journal of Crime and Justice. Tomczak, Philippa, (2019, invited) ‘Associations socio-judiciaires et sorties de délinquance’, in Gaïa A. et al (dir.) Comment sortir de la délinquance? Genève: Médecine et Hygiène. Van Zyl Smit, Dirk and Appleton, Catherine, Life Imprisonment: a Global Human Rights Analysis was formally accepted for publication by Harvard University. Van Zyl Smit, Dirk and Appleton, Catherine, ‘The Ultimate Penalty’ (2018) 19 New Philosopher 88-93. (5) School of Law Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD +44 (0)115 846 6239 cjrc@nottingham.ac.uk"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/Country%20Report%20Scotland%20Final.pdf"
    ]
}