{
    "url": "https://www.nottingham.ac.uk/research/groups/rehabilitation/index.aspx",
    "content": [
        {
            "p": "Drawing on expertise from nursing, psychology, allied health professions and other related areas, our dynamic group focuses on a wide range of rehabilitation research. Through randomised controlled trials, qualitative interviews, observational studies, mixed methods and service evaluations, our high-quality research has a powerful impact on improving patient care and treatment, while shaping policy and ensuring health professionals have the latest skills and knowledge. Alongside leading on major projects, we collaborate widely with other universities and research centres, both nationally and internationally. We have secured funding from a wide range of charities and from the National Institute for Health Research (NIHR). We care passionately about reducing the effects of illness and disability, helping patients lead lives that are as fulfilling as possible. To discover how our research makes an impact, explore our rehabilitation research themes. Our researchers are investigating the use of new technologies and developing more effective methods of treating patients. Our research supports people who are experiencing illness, injury and disability by helping them stay at work, or return to work as soon as possible. Through a range of projects, our researchers are helping patients access better therapy, get back to work faster and live more independent lives. Often cutting across research themes, our community intervention research is concerned with how we can improve care for patients once they leave hospital. We investigate the ways in which cognitive abilities may be improved for people with neurological conditions, to help them enjoy an improved quality of life. Avril is head of the research group and the School’s Director of Research. She is a renowned researcher in the area of stroke rehabilitation and is national Chair of the UK Stroke Forum. Read more Discover the latest opportunities for PhD research in the field of rehabilitation. The University of Nottingham School of Health Sciences Queen's Medical Centre Nottingham, NG7 2HA telephone: +44 (0)115 823 0843 email: avril.drummond@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}