{
    "url": "https://www.nottingham.ac.uk/research/groups/physiology-pharmacology-and-neuroscience/index.aspx",
    "content": [
        {
            "p": "We are currently recruiting for a number of teaching and research positions. See the University of Nottingham's job site for details. Search for Life Sciences to bring up positions relevent to the school. By breaking new ground in physiology, pharmacology, neuroscience and molecular mechanisms, our research is deepening understanding of human health. We also investigate how healthy function breaks down in everything from cancer and cardiovascular disease to arthritis, neurodegeneration and schizophrenia. We study these, and a whole range of other life-changing conditions, from the molecular level right through to the whole body. Our aim, in every study, project and collaboration is to lay down the foundations of knowledge needed for the development of crucial new drugs and treatment pathways. To understand human health, and why disease can sometimes develop, we need detailed knowledge of the molecular basis of physiology. Here in the Division of Physiology, Pharmacology and Neuroscience, at The University of Nottingham’s School of Life Sciences, we take an integrative, collaborative approach to this major research challenge. Together, we work at multiple levels, from fundamental biochemistry and molecular mechanisms to organismal and human physiology. We’re home to cutting-edge facilities for the in vivo study of human metabolic physiology, as well as biomedical imaging and pre-clinical in vivo neuroscience. Using the power of these innovative technologies, we’re advancing understanding of cancer, arthritis, cardiovascular disease, respiratory conditions, dementia, stroke, addiction, schizophrenia, neurodegeneration, Paget’s disease, skeletal muscle atrophy and the ageing process. We also contribute to several centres of excellence, including the Arthritis Research UK Pain Centre; Centre for Sport, Exercise and Osteoarthritis; Centre for Musculoskeletal Ageing Research; Nottingham NIHR Biomedical Research Centre; the National Centre for Sport and Exercise Medicine and The University of Nottingham and University of Birmingham Centre of Membrane Proteins and Receptors (COMPARE). We also host the Fund for the Replacement of Animals in Medical Experiments (FRAME) laboratories. Beyond the immediate scientific impacts of our research, our academics are shaping pharmacology and drug discovery for common diseases such as cancer, heart, lung and eye diseases as well as creating spin out companies. They have also worked closely with industry to create sports nutritional supplements for athletes. The academics in this division have served on government and industrial scientific advisory committees, held major roles within learned societies, acted as expert consultants for a range of industrial partners, research charities and UK Sport, and coordinated award-winning outreach activities, each broadening the societal impact of their discoveries. The future of biomedical science is likely to lie in the formation of integrative teams, working together to tackle difficult problems at multiple levels of analysis. Our ambition is to lead the way in this new era of team science, with a collaborative approach to the understanding of organismal physiology. We hope to understand both how the molecular basis of life leads to health and disease, and how we can use this knowledge to devise new treatments for the major healthcare challenges of the future. Read more news School of Life Sciences University of Nottingham Medical School Queen's Medical Centre Nottingham NG7 2UH"
        }
    ],
    "pdf_files": []
}