{
    "url": "https://www.nottingham.ac.uk/research/cop/cop27.aspx",
    "content": [
        {
            "p": "COP27, the 27th UN conference on climate change, takes place in Sharm El-Sheikh, Egypt, between 6 and 18 November 2022. The urgency for collective action to cut carbon emissions has never been greater. In 2022, the 30th anniversary of the adoption of the United Nations Framework Convention on Climate Change, we are witnessing record temperatures and devastation from extreme weather events and our dependence on fossil fuels has been highlighted by a cost of living crisis. And as delegates from almost 200 nations gather for COP27, the UN warned that collective failure to act on greenhouse gas emissions is rapidly dashing any hope of limiting the rise in global temperatures below the critical threshold of 1.5C. \"The climate crisis is deepening but here’s how we can still make a real difference\" We help policymakers to better understand and act on climate change. We work with partners in industry to accelerate delivery of innovative solutions and net zero technologies. We empower the communities we serve to bring about change. As a global university, we are committed to sustainability in everything we do. How our research is driving change – from clean energy to building resilience in the developing world. Discover how our researchers will deliver a new generation of aircraft – clean, sustainable, safe and silent – and help the world achieve its zero carbon targets. We unite across a range of disciplines, drawing on multidisciplinary expertise across our faculties of engineering, science and social science to shape the future of energy. At the heart of a revolution in greener transport; electrified propulsion. Securing the sustainable bio-economy of the future. \"Only an urgent, system-wide transformation can avoid climate disaster.\" As a global organisation, we are committed to sustainability in everything we do at our campuses in the UK, China and Malaysia."
        }
    ],
    "pdf_files": []
}