{
    "url": "https://www.nottingham.edu.my/Research/Clusters/Healthier-Lives.aspx",
    "content": [
        {
            "p": "Asia, the world's largest and most populous continent, is experiencing a significant transformation in its health landscape. For decades, the region has grappled with communicable diseases such as malaria, tuberculosis, and various respiratory and gastrointestinal infections. However, recent years have witnessed a swift transition as Asia faces a growing burden of non-communicable diseases (NCDs) such as diabetes and mental health disorders. Rapid economic growth, urbanisation, and changes in lifestyle and dietary patterns have all contributed to the rise in NCDs. This research cluster explores this shift, highlighting research-based evidence that facilitates the development of systematic disease control strategies. The development of effective disease control strategies requires a comprehensive understanding of various factors contributing to disease risk, including biological, environmental, and behavioural aspects. The undertaking requires knowledge of treatment options, preventive measures, and effective implementation strategies to ensure widespread understanding and acceptance among the population. To address the most pressing issues in Asia, our research cluster has identified six key themes, which characterise our cluster structure (explained in the next section). These diverse themes converge on three specific goals: Overall, the Healthier Lives research cluster enables all researchers to come together, combine resources and reach a common goal of improving the prevention, diagnosis, and treatment of NCDs in Asian populations. The Healthier Lives cluster consists of six subgroups: Nutrition and Clinical Health (led by the School of Pharmacy), Precision Medicine and Drug Discovery (also led by the School of Pharmacy), Disease Epidemiology and Prediction (led by the School of Mathematical Sciences), Health Education, Prevention and Outreach (led by the School of Media, Languages, and Cultures), Mental Wellbeing (led by the School of Psychology), and Emerging Health Technology (led by the Department of Electrical and Electronic Engineering). One of our key projects focuses on developing biomarkers to monitor the effect of treatment to breast cancer patients, funded by National Cancer Council Malaysia. Separately, we are using the ex-vivo-in-vitro approach to investigate the cellular uptake, metabolism, and bioavailability of fat-soluble vitamins, in overweight and obese individuals. Ultimately, we aim to develop a personalized BMI-based dosing regimen for effective fat-soluble vitamin supplementation in individuals with overweight or obesity. This project focuses on two main themes: precision medicine and drug discovery of local natural products. Precision medicine aims to provide personalised treatment for patients based on their individual genetic makeup and other factors. For example, the discovery and development of cancer biomarkers, drug-herb interactions, and the role of cytochrome P450 (CYP) alleles and human leukocyte antigen (HLA) alleles in drug metabolism. Drug discovery of local natural products focuses on identifying and developing new drugs from plants, particularly underutilised plants that are found in the region. Our researchers are using advanced technologies such as nanotechnology, artificial intelligence (AI), 3D printing technology and Internet of Things (IoT) to revolutionise the healthcare landscape. The goal is to enhance precision and accuracy in diagnosis and treatment, improve patient outcomes, and personalise medicine towards increased efficiency and reduced healthcare costs. Our research aims to identify and characterise factors that contribute to disease occurrence, progression, and transmission. We investigate the interplay between biological, environmental, and social determinants, and their influence on disease epidemiology. Through our work, we strive to improve disease prevention, control, and management strategies, ultimately enhancing population health and well-being. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}