{
    "url": "https://www.nottingham.ac.uk/research/beacons-of-excellence/green-chemicals/collaborate/index.aspx",
    "content": [
        {
            "p": "A message for all of our industry partners in relation to COVID-19 As a valued member of our local business network, we wanted to let you know our position in response to COVID-19. In line with the University’s response to Government guidance, we are making the necessary steps to support our partners in business and industry. We appreciate that this is a worrying and difficult time and recognise the unprecedented circumstances that your business and the world faces. The University of Nottingham continues to follow the advice from the UK authorities. We are transitioning to online teaching from Monday 23 March and our business engagement teams are working remotely. We are taking actions to adapt the way we work together and to ensure where possible we can continue to support and react to your business needs. Whilst face to face activities, site visits, conferences etc. will cease for the time being, we will continue to remain in contact using digital platforms such as MS Teams, Skype etc. Across the wider university, our students are still actively looking for internship, placement and graduate opportunities so please do stay in touch with us. If you have projects that could be delivered remotely, our students could be a fantastic resource throughout this time, as we all get to grips with new ways of working. Equally, our academic teams will also be available for any research & development opportunities that arise. We will keep you fully informed, however I suggest that you visit our dedicated COVID-19 web pages for the latest information from the University. You can contact us via email or online meetings. We will also share the latest updates via our Twitter account. We can help you solve challenging industrial problems and realise the sustainability vision for your business. We work with you to provide forensic analysis of your entire commercial development process (outlined below) to help your business become more sustainable. Contact our Business Development Manager, Simon Gerrard, to discuss how we can support your sustainability goals."
        }
    ],
    "pdf_files": []
}