{
    "url": "https://www.nottingham.ac.uk/research/groups/flavour-research-group/index.aspx",
    "content": [
        {
            "p": "The International Flavour Research Centre conducts world leading research in food and flavour chemistry, from specialist laboratories in Nottingham and Australia.Find out how you can research, innovate and learn with us. The International Flavour Research Centre carries out world leading flavour research to address both the sustainability needs of our global food chain, whilst developing novel flavour insights and applicable solutions and technologies for the food industry. Flavour is a combination of the aroma and taste of a food, and when you interchange food ingredients, reduce fat, sugar or salt, increase fibre or replace meat proteins with plant proteins, there are a series of highly complex flavour questions that need to be answered. For example, how do you develop foods that have reduced salt/fat/sugar and increased fibre without compromising the consumer experience? How do you ensure that nutritious plant based meat alternatives generate an equally appealing flavour during cooking and how do you ensure that when part of a complete meal they are a viable alternative for those who regularly consume meat? These are some of the challenges we explore: We are a dynamic research group with a range of post doctoral and PhD students. Our research vacancies are always listed on the University's recruitment pages. You may register an interest in a self-funded PhD/MRes by emailing your CV and evidence of funding to Jenny Drury. Given the cross-disciplinary nature of food science, we also work closely with the University's Sensory Science Centre, Food Structure and Biomaterials Group and other research groups in the Biosciences field. Read about the work we are carrying out with some of the most innovative food companies in the area of plant-based foods. Read about the impact the Flavour group's research has had on real food products in our recent Pipers Crisps case study. The International Flavour Research Centre also publishes extensively in some of the most prestigious scientific research journals including Food Chemistry, Food Hydrocolloids, Food and Function and Scientific Reports. View our most recent papers here You can keep up to date and get in touch with us via our social media links or by emailing jennifer.drury@nottingham.ac.uk Twitter @FoodFlavour LinkedIn UoNFoodFlavour Professor Ian Fisk leads the International Flavour Research Centre and he is director of the consultancy and analysis service FACTS. His research interests focus on designing effective and commercially viable flavour science solutions. This includes fundamental food chemistry to develop new ingredients or processes, flavour management during food production (plant biology, agricultural techniques, food processing, shelf life) and explaining the highly complex interaction of flavour with the oral-nasal environment during oral processing, whilst pioneering new approaches to increase sustainability across the food and flavour industries. Dr Ni Yang is Assistant Professor in Flavour Science. Dr Yang's research aims to shape a sustainable flavour system by embedding flavour science from soil and plant, processing and production, to consumption and health. Her current research includes flavour chemistry applied to the fields of tea and Traditional Chinese Medicine (TCM) and chilli/spicy sensations, whilst developing novel multimodal training approaches for parosmia post COVID-19 and anosmia in elderly. We work extensively with industry through FACTS - our analytical, consultancy and training service for food and bioscience industries. FACTS offers high quality food chemistry and flavour science support for confidential and time sensitive enquiries - find out more on our dedicated website. We run a highly popular one week Food Flavour training course - ideal for scientists in the food, drink or flavour industry and for students wishing to broaden their experience before entering the food industry. The course can be attended face to face or entirely online and features a mix of live interactive classes and electures with leading academics, laboratory tours, equipment introductions and quizzes to check your understanding throughout the course. Find out more about the 2024 course and sign up here. The University of Nottingham Division of Food, Nutrition and Dietetics Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6132 email: jennifer.drury@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}