{
    "url": "https://www.nottingham.edu.my/Research/Clusters/Sustainable-Environments.aspx",
    "content": [
        {
            "p": "The pressing challenges of ecological decline continue to jeopardise the health of our planet and its inhabitants. Recognising the gravity of what’s at stake, the Sustainable Environments cluster is dedicated to conducting impactful interdisciplinary research to further understand and resolve such problems. Guided by the Sustainable Development Goals (SDGs), our cluster subgroups are anchored on areas that most urgently require innovation and transformation. Our studies ultimately aim to contribute to a more sustainable, equitable, and resilient future. Our work converges around six focal areas that align with the United Nations SDGs. The first subgroup is aligned with SDG6 (Clean Water and Sanitation), and aims to promote sustainable solutions that provide for ecological and humanity’s water needs. Our work includes finding new approaches to pollution remediation, river restoration, sustainable hydropower production and water security. Our Clean Energy subgroup addresses SDG7, where we conduct research on green and alternative energy solutions, as well as energy management systems. Our next subgroup, Sustainable Cities and Communities subgroup, addresses SDG11. Here, we work to reimagine and redesign urban landscapes by promoting blue-green infrastructure, resilient city planning, and inclusive community development. A particular focus of this work is the use of Ecosystem Services models and concepts to promote sustainability in urban and rural areas. Our work on Climate and Climate Change supports SDG13, via scientific research to better understand its implications in Southeast Asia, especially in large cities such as Kuala Lumpur. We also develop innovative technologies and policy recommendations designed to improve our resilience to future climate conditions. Our work on biodiversity assessment and conservation supports SDG14 and SDG15 and is titled Life on Land and in Water. The Cluster’s work in this area recognises the interconnectedness of terrestrial and aquatic ecosystems and the imperative to preserve biodiversity. We work at biological scales extending from genes to elephants, as well as undertaking projects focused on habitat and management restoration. We have six research subgroups, anchored on a total of seven SDGs, as explained above. Additionally, a key element of our work is engaging with the various stakeholders involved in environmental management and conservation, from government and grassroot NGOs to local communities. This engagement helps us additionally contribute to SDG17, Partnerships for the Goals and SDG4, Quality Education. Communities in the Trusan catchment in Sarawak are facing increased flooding and riverbank erosion due to climate and land cover change. The flooding and erosion are major issues for the communities because they damage crops and destroy land. In partnership with WWF Malaysia, a project has been underway for four years to find sustainable ways of resolving the flooding and erosion problems. The project involves installing green riverbank protection measures, and developing proposals for managed flooding and protection of natural forest. Climate change is expected to lead to increasingly negative impacts on air quality, including more hot and dry conditions that lead to pollutants accumulating in urban air. Our research involves detailed analysis of several datasets, considering multiple regions, seasons and pollutants. The research indicates mainly negative impacts of climate change on Malaysian air quality, which can be counteracted by even stronger efforts to reduce pollutant emissions. Humans are the primary cause of climate change and environmental degradation, and this is a social problem that requires a social solution. We have been working for several years to empower local communities with the end goal of improving their socio-economic well-being, building community awareness of unsustainable practices and environmental preservation, and developing individual and community competences to address issues associated with the challenges of unsustainable development and climate change. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}