{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Raising-awareness-on-how-governments-can-help-make-the-Belt-and-Road-Initiative-into-a-global-public-good.aspx",
    "content": [
        {
            "p": "The Belt and Road Initiative is an ambitious infrastructure and development project that spans almost 70 countries across the globe. President Xi Jinping’s signature foreign policy programme is inspired by the historic Silk Road. This infrastructure financing programme will see China and its global partners embarking on projects in transport, energy, mining, technology and tourism. Rail networks, highways and energy pipelines across Asia, Africa and Europe will connect China to the world in an extensive network of trade, cultural and economic exchange. While supporting major infrastructure growth, a number of legitimate concerns have arisen with regards to the political vulnerability, debt sustainability, environmental safety and societal added-value comprising of certain Belt and Road Initiative projects. To counter this, some countries — such as United States, Canada, Japan, India and Australia — have devised clear policy responses. But the United Kingdom has remained ambivalent despite the high stakes, both domestically and internationally. Dr Ben Barton, Assistant Professor in the School of Politics, History and International Relations, is encouraging the UK to adopt a clear stance. To this end, he’s developed a policy brief that is the first of its kind. It urges the UK to leverage its expertise and strong global networks as a means of addressing both the opportunities and drawbacks of the Belt and Road Initiative. His policy brief explains the ways in which the government can help make the Belt and Road Initiative into a global public good, by: Dr Barton’s policy brief has been the focus of numerous outreach and engagement activities. In February 2020, the University of Nottingham’s Asia Research Institute and Institute for Policy and Public Engagement put the policy brief at the centre of an Asia House panel discussion in London UK. The event drew a distinguished audience comprising ambassadors and diplomats from over 40 different countries, peers from the House of Lords, British civil servants, senior members of the University of Nottingham and even the UK’s envoy to the Belt and Road Initiative, Sir Douglas Flint, who gave the event’s keynote speech. The event was further broadcast on Asia House TV and fuelled further social media interest. The brief has gone on to become Dr Barton’s most-read work so far in his career, and has brought greater attention to some of his research work on other themes. As China’s international influence continues to grow, it’s clear that this infrastructure financing programme is here to stay. Dr Barton’s work lays the foundation for the UK to assert itself by offering a constructive approach by using all available policy instruments to help improve the Belt and Road Initiative and to chart a path towards a more prosperous, sustainable future. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}