{
    "url": "https://www.nottingham.ac.uk/research/groups/translationalneuroimaging/index.aspx",
    "content": [
        {
            "p": "The Centre for Translational Neuroimaging in Mental Health is a clinically-focussed partnership between the University and Nottinghamshire Healthcare NHS Trust. Our goal is to translate the wealth of information about the function of the human mind and brain derived from neuroscience and neuroimaging into clinically relevant applications. -- Peter Liddle Professor of Psychiatry Visit the Centre's Insititute of Mental Health webpages Despite major advances in the understanding of brain abnormalities associated with mental disorders in the past two decades, the long term outcome of the major disorders remains only marginally better than a century ago. One problem is that most abnormalities can only be demonstrated convincingly in groups rather than individuals. However a growing body of evidence from our own studies and from others demonstrates that combining information from several sources does provide clinically useful information in individual cases. The time is ripe for demonstrating application of neuroscientific advances in routine clinical practice. Predicting outcome in early psychosis In several of our research studies employing multiple brain imaging procedures, we are refining the measurements with the greatest potential to reveal clinically useful information about outcome in psychotic disorders, with the goal of developing a clinically applicable protocol for prediction of 3 year outcome and guiding treatment in early psychosis. Improving treatment of schizophrenia, ADHD and mood disorders Our major goal is to optimize the combined use of psychological, pharmacological and/or physical strategies for more effective treatment of major mental disorders. In a study funded under the MRC experimental medicine in mental health program, we are examining the effects of combined cognitive and pharmacological modulation of the brain networks that support attention and problem solving, in ADHD and schizophrenia. We are also developing a procedure employing transcranial magnetic stimulation (TMS) guided by brain imaging to target specific networks involved in auditory hallucinations and resistant depression. Understanding the mechanism underlying the symptoms of psychosis We are investigating how the failure of coordinated function of brain networks leads to core symptoms of psychosis such as hallucinations and thought disturbances. In addition to employing state-of-the-art imaging techniques such as 7T MRI and magnetoencephalography (MEG) to assess brain structure and function, we continue to refine tools for the clinical assessment of subtle but persistently disabling clinical symptoms such as thought disorder across psychotic disorders such as bipolar disorder and schizophrenia. Current projects include... Recent publications include... For a full list of publications, please see our member profiles. We have links with the Universities of Manchester, Cardiff, Oxford, Cambridge, Glasgow and Warwick, Institute of Psychiatry, University College London, Shanghai Mental Health Centre, University of British Columbia and Stanford University. More news from the Division of Psychiatry and Applied Psychology There are no results that match your criteria. More events at the Division of Psychiatry and Applied Psychology We welcome PhD applications from students with a background in psychology, psychiatry, or neuroimaging. PhD opportunities Group members telephone: +44 (0)115 823 0421 email:peter.liddle@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}