{
    "url": "https://www.nottingham.ac.uk/research/groups/dhlawrence/about-us.aspx",
    "content": [
        {
            "p": "The University of Nottingham has close historical ties with Lawrence and with Lawrence Studies. The School of English at the University of Nottingham has led the way in Lawrence research; it has been home to several celebrated Lawrence scholars, including Vivian de Sola Pinto, James T. Boulton, Peter Preston and John Worthen (who remains Emeritus Professor of D. H. Lawrence Studies). The DH Lawrence Research Centre is part of the University of Nottingham's Centre for Regional Literature and Culture. The Centre is fortunate in being able to draw on the expertise of John Worthen, Emeritus Professor of D. H. Lawrence Studies at the University. Neil Roberts and the late Keith Sagar have both been Honorary Professors in the School of English attached to the Centre, and Stephen Lowe (a renowned playwright and former Honorary Lecturer in the School) has worked with the Centre on Lawrence-related projects. Dr. Hilary Hillier has specific expertise on Lawrence, and is a valued adviser to the Centre. We hope that will site will enrich your enjoyment of the author and the places from which he drew so much inspiration. The University’s Department of Manuscripts and Special Collections on the King's Meadow Campus houses an outstanding collection of Lawrence manuscripts, first editions, letters and research materials; it has been awarded Designated Status by The Museums, Libraries and Archives Council as being of outstanding national and international importance. Through the annual Journal of D.H. Lawrence Studies, which is edited in-house, the Centre also has firm links to the D.H. Lawrence Society in Eastwood and to the worldwide community of Lawrence scholars and enthusiasts. The young author was a student at the former Nottingham University College between 1906 and 1908; he studied in the imposing gothic building on Shakespeare Street in Nottingham city centre, which now belongs to Nottingham Trent University. When the University moved to its current University Park campus in the 1920s, Lawrence wrote a somewhat sardonic poem entitled 'Nottingham's New University' to commemorate the occasion. Trent Building University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 846 6456 fax: +44 (0) 115 951 5924 email: andrew.harrison@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}