{
    "url": "https://www.nottingham.ac.uk/research/groups/tobaccoandalcohol/index.aspx",
    "content": [
        {
            "p": "The University of Nottingham is part of the multi-university, multi-agency SPECTRUM collaboration on the commercial determinants of health and health inequalities.” To reduce the harm arising from tobacco, alcohol and other commercial determinants of health. We do this by assessing risks, examining and improving exposure strategies, developing harm reduction strategies, and engaging the scientific community and the public to promote findings to users and policymakers Although there have been recent declines in regular smoking among young people, smoking rates are still unacceptably high. The health risks of cigarettes are largely documented, and, together with the addictive properties of smoking, there is clearly a need to assist current smokers to stop. An important area of research is assessing how many people use tobacco, and to investigate factors that determine the uptake and continuation of smoking. These include environmental, sociodemographic, media and genetic influences. Some smokers find it very difficult to quit, despite a lot of effort. For these people, who may have tried several times to stop, alternative forms of nicotine without the major health risks of smoked tobacco, may be a more positive option than continuing to use smoked tobacco. Similarly, excessive use of alcohol has become increasingly common, especially in younger people and we undertake research not only into the effects of sustained alcohol use, but ways of treating alcohol addiction. Tobacco/alcohol behaviours and associated risks We work to understand the key drivers of key drivers of smoking and use of alcohol, by examining ways to reduce uptake of these substances, as well as longer-term effects on the individual and families. Individual measures to assist smokers and drinkers Our group undertakes research into the most effective ways to assist smokers to quit. This includes pregnant women for whom smoking can harm not only themselves but their baby. Population measures to challenge smoking behaviour and alcohol consumption Although the UK have introduced several population-wide measures to curb consumption of tobacco, research is underway to assess the effectiveness of existing legislation (e.g. smoke-free laws) and provide evidence for other measures. Reducing harm from tobacco and alcohol Utilise datasets to examine the long-term effects of alcohol on users of these products and their families. Evidence for the harmful effects of tobacco is well known, but less evidence exists for alcohol use. The group’s work on secondary care cessation services strongly influenced the content of 2013 NICE guidelines. PhD opportunities in the School of Medicine More news We hold bimonthly research meetings which provide an informal opportunity to share and discuss research going on in the area of tobacco research. Group members The University of Nottingham email:Chris Hill"
        }
    ],
    "pdf_files": []
}