{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Identifying-desirable-traits-in-locally-grown-oyster-mushrooms.aspx",
    "content": [
        {
            "p": "The demand and consumption of mushrooms is on the rise, both at home and abroad. This nutritious, versatile crop has become an increasingly popular food source, prized for its abundance in antioxidants and potassium. As such, the Malaysian government has identified mushrooms as a high-value commodity, embarking on an expansion that has ramped up productivity and quadrupled the areas of mushroom production in the country since 2010. Thanks to this rapid and ambitious growth, the mushroom industry now faces the challenge of meeting rising demand while also ensuring quality spawn that yields commercially viable products. Such compelling new challenges demand more focused research and development, which we are pleased to deliver as a means to map out the future of mushroom cultivation in Malaysia. In line with the government’s agricultural goals, Malaysian Agricultural Research & Development Institute (MARDI), Malaysia’s key governmental agriculture research institute, aimed to understand the molecular basis of high quality mushrooms that would be most suitable for commercial purposes. Local small-scale farmers currently grow most of the mushrooms here in Malaysia, and by uncovering the best strains MARDI would help them boost their output to meet consumer demands more efficiently. With background in transcriptomic study and genetic expression in cancer research, Dr Ho Wan Yong, an Associate Professor in our School of Biomedical Sciences was approached by MARDI to replicate her experience in an agricultural setting. She was tasked with pinpointing the most desirable traits from locally grown oyster mushrooms, which are the most cultivated breed of mushroom in Malaysia. The project also enlisted numerous experts who each brought their unique credentials to the table, making for a multidisciplinary approach. Dr Ganisan Krishnen, MARDI, whose expertise lies in mushroom cultivation, granted the team access to the specimens housed in the mushroom bank in MARDI. Aiding Dr. Ho was her colleague at our School of Biosciences, Dr Chin Chiew Foan, whose primary focus is in plant molecular genetics. Dr Yeap Swee Keong, an Associate Professor at Xiamen University, was recruited for his bioinformatics background and experience with next generation sequencing technology that would facilitate the genomic-focused work. Leong Chia Choong, our PhD student under Dr Ho’s supervision, was an instrumental part of the project to grow and analyse the previously unidentified mushroom strains housed in MARDI. The team also made an exciting finding: most of the strains in the MARDI bank are that of Pleurotus Pulmonarius (lung oyster) instead of the pearl oyster mushroom species, Pleurotus Ostreatus, as previously thought. While the pearl oyster mushroom is the strain that is predominantly grown worldwide, the Pulmonarius variety, which is a little paler in colour and frequently smaller, makes up the majority of Malaysian oyster mushroom crops. Existing research on the Ostreatus variety is plentiful, but there is considerably less on the Pulmonarius variety, and its genome has never been sequenced before. Over the course of their research, the team was able to use next generation sequencing technology to unveil the genomic sequence of the oyster mushroom species for the very first time. This genetic profile enabled them to identify the most favourable traits pertaining to the species’ biological activities, nutritional content, yield, growth rate, and resistance to bacteria. It painted a clearer picture of what makes a productive and valuable crop, yielding a template for more marketable mushrooms that are suited to consumer needs. The genetic codes that define these quality features can also be used as a benchmark for evaluating other strains of oyster mushroom. The team’s discovery is an exciting one that adds to the database of available information on the oyster mushroom species, and also paves the way for further research. Armed with these new findings, MARDI is now better positioned to empower and equip local mushroom farmers with the right insights into more successful cropping. We hope our work has laid the groundwork for MARDI to help these farmers meet the demands of consumers and contribute to the advancement of the industry. Given that mushrooms are a popular and beneficial source of food, it will be rewarding to see them becoming more accessible to consumers on a greater scale. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}