{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Building-resilient-and-sustainable-food-systems-in-a-changing-world.aspx",
    "content": [
        {
            "p": "The United Nations recently estimated that almost 690 million people around the world went hungry in 2019. Meeting the dietary and nutritional needs of an increasing population is one of the world’s greatest contemporary challenges, especially in the face of climate change. Our future food must consider sustainable production, processing and availability of a diverse range of plant and animal species to help meet these global requirements. University of Nottingham researchers across our three campuses in Malaysia, UK and China are committed to reimagine ways to deliver sustainable food sources and nutritional security in a rapidly changing world. Through the Future Food open research platform, inter-disciplinary collaborations are bringing together the power of genome-enabled plant and animal sciences with cutting-edge nutrition science, food processing, manufacturing and digital technologies. Professor Festo Massawe, Professor of Crop Science in the School of Biosciences, is struck by the fact that there are more than 50,000 known edible plants in the world, yet two-thirds of global plant-derived food is provided by only three major cereals – maize, wheat and rice. To address this, he’s leading a major international programme that examines the potential of several under-utilised crops to introduce diversification and thereby reduce reliance on staple crops. Bambara groundnut is a major focus of his efforts. Indigenous to West Africa, it’s a nutritionally complete food thanks to an excellent balance of carbohydrate, protein and fats and can survive drought conditions. Although Bambara groundnut is already being cultivated across sub-Saharan Africa by small scale farmers, there are barriers to its commercial production. For example, the plant needs a lot of sunlight, it’s generally low in yield and the nuts can take a long time to cook. Prof Festo is currently working with breeders, seed companies and farmers in South Africa, Ghana, Tanzania and Malaysia to develop new and improved varieties that overcome these problems. Their answer lies in identifying optimal genetic traits that produce the most beneficial features in the plant. To find a solution requires the collective efforts of a large team with expertise in crop and molecular genetics, agronomy, field experimentation and breeding, food technology, and nutrition to name but a few. Together they are building a vital database of genotyping and phenotyping information, and exploring ways to improve agricultural practices. So far, the team has identified traits that confer improved drought tolerance making it possible to develop climate resilient crops. Next steps are to develop, register and release these improved varieties of Bambara groundnut and so the team is actively working with partners across South East Asia, Africa and the UK including seed companies and volunteers from Plant Breeders Without Borders. The longer term aim is to work closely with farmers and other stakeholders in larger scale breeding programmes to select those varieties that are commercially viable. Another side to this story is to explore ways to improve productivity of the Bambara groundnut. Prof Festo’s colleague Dr Ajit Singh is Associate Professor in Crop Production and Physiology, and an agronomist with a background in plant nutrition. He’s been experimenting with two additives that have shown promising results in boosting crop productivity. One is biochar, a product obtained from food waste or agricultural residues. It’s rich in organic materials and has the potential to increase nitrogen fixation of legume crops grown on marginal soils, which leads to higher yields. The other is rock phosphate which is a promising affordable alternative to phosphate fertilisers. Dr Singh’s research will help provide solutions for Bambara groundnut farmers, allowing them to achieve more productive harvests at a lower cost. Our staff’s strong research leadership has established a successful and world leading programme that is developing climate resilient and nutritious crop varieties and sustainable crop production practices. We’re proud to support this flagship research on sustainable and resilient food systems. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}