{
    "url": "https://www.nottingham.ac.uk/research/groups/micronutrients/index.aspx",
    "content": [
        {
            "p": "One reason for this is that, even where the supply of dietary energy and protein is adequate or better, the supply of key micronutrients – minerals such as Zinc (Zn), Iron (Fe) and Selenium (Se), and vitamins, lags behind. This has implications for, among other things, child health, growth and cognitive development, and is estimated to affect billions of people globally. Within the Division we collaborate globally with nutritionists, soil scientists, agronomists and geochemists to understand the supply of mineral micronutrients from soil to crop to the human population varies in response to environmental conditions and crop management. We examine strategies such as agrofortification of crops with minerals added to the fertilizer, and collaborate in feeding studies to assess the efficacy of these approaches to improving indicators of nutritional status in the human population. Our work, in the UK, Africa and south Asia, brings together multiple disciplines to address how the whole food system affects people’s micronutrient status. Our objectives are: BBSRC GCRF Biofortification with Zinc and Iron for Eliminating Deficiency in Pakistan (BiZIFED2) Bill & Melinda Gates Foundation GeoNutrition - tackling hidden hunger in Sub-Saharan Africa. http://www.geonutrition.com/ Bill & Melinda Gates Foundation Micronutrient Action Policy Support (MAPS) tool. https://micronutrient.support/ EPSRC GCRF Research Translation Award: Translating GeoNutrition (TGN): Reducing mineral micronutrient deficiencies (MMNDs) in Zimbabwe. Foreign, Commonwealth and Development Office/Royal Society Strengthening African capacity in soil geochemistry to inform agriculture and health policies. Dr Louise Ander Dr Liz Bailey Prof Martin Broadley Plant-soil Interactions Biogeochemistry and Biogeochemical Modelling The University of Nottingham Gateway Building, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6257 email:sacha.mooney@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}