{
    "url": "https://www.nottingham.ac.uk/research/groups/reproduction-stem-cells/index.aspx",
    "content": [
        {
            "p": "This programme of work studies the mechanisms that regulate the development of early embryos (including vertebrates such as pigs and chickens and invertebrates, including Drosophila and bees). The research in this area includes investigations into the genetic and epigenetic regulation of cellular differentiation into progenitors of skeletal muscle and gametes (sperm and eggs), both in vivo and from cultured stem cells. This encompasses both basic developmental biology where we aim to understand the signals and genomic changes that regulate differentiation in vivo and the use of embryonic stem cells to recapitulate these processes in culture. This knowledge is used to develop novel strategies for the derivation of stem cells from germ cells and to reprogram cells towards muscle and germ cell progenitors. Ultimately this will enhance our understanding of the mechanisms that regulate cellular differentiation with a view to (1) improving muscle production efficiency (in the context of livestock and global-food security), (2) develop efficient cellular reprogramming and transgenic technologies in farm animals, and (3) develop new assisted reproductive technologies, such as artificial gametes. In-house expertise in molecular embryology, myogenesis, stem cell biology, epigenetics, gametogenesis, cellular reprogramming. BBSRC (RA35DG): Pig Feed Efficiency: Applications of systems. Studentship - Generation of germline competent pig stem cells; application for muscle biology and transgenic pigs. AAM Ref: 107289 (Pfizer Animal Health). Studentship: IGF signalling in limb muscle differentiation and development. Funded by the Higher Committee for Education Development, Office of the Prime Minister Iraq. Gamete biology Endocrinology, ovarian function and reproductive health Cancer Pathogenesis Comparative Medicine Cardiovascular Disease Age Related Disease Musculoskeletal Disease The University of Nottingham 223 South Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6304 email:ramiro.alberio@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}