{
    "url": "https://www.nottingham.ac.uk/research/groups/osteoarthritisandcrystalarthritis/index.aspx",
    "content": [
        {
            "p": "We seek to understand the epidemiological and genetic aspects of osteoarthritis and crystal deposition in order to develop better management and treatment. --Professor Michael Doherty, Head of Academic Rheumatology We are studying the epidemiological and genetic aspects of osteoarthritis, run community-based clinical trials and conduct evidence-based medicine. See our current studies. Gout is the most common inflammatory arthritis in men and in older women, and is increasing in prevalence worldwide. Although we have effective treatments to eliminate the urate crystals that cause gout, several audits, including a community study in Nottingham, have shown that management is often suboptimal, with only a minority of patients receiving appropriate information and effective treatment. We have now completed the Nottingham Gout Treatment Trial (funded by Arthritis Research UK) to examine the efficacy of the nurse-led intervention versus ongoing usual (GP-led) care in the community. The trial has shown that after two years nurse led-care results in much better patient-centred outcomes (reduced acute attack frequency, reduction in subcutaneous tophi and improvements in Quality of life) than usual care. Furthermore the nurse intervention appears very cost-effective in terms of improvements in patient quality of life. We hope to publish these results in the near future. This is the second most common crystal associated arthritis and we are examining genetic, epidemiological and clinical aspects of calcium crystal deposition. Within the group the principal types of study undertaken are: Further information The outcomes of our research have been directly used to guide clinical practice and develop treatment guidelines. Landmark papers include efficacy of topical NSAIDs, paracetamol and placebo in osteoarthritis. The team has been involved in the development of British (NICE and BMJ), European and global evidence based recommendations for the treatment of osteoarthritis. Arthritis Research UK Pain Centre We work closely with researchers across the University of Nottingham as part of the Arthritis Research UK Pain Centre. The Pain Centre is pursuing a programme of research to better understand the mechanisms of pain in arthritis in order to develop improved treatment. Arthritis Research UK Centre of Centre for Sport, Exercise & Osteoarthritis We is also a collaborating department within the Arthritis Research UK Centre for Sport, Exercise & Osteoarthritis which is based primarily in Nottingham and Oxford and began activities in 2013. Our researchers publish in leading peer-reviewed journals including the Annals of the Rheumatic Diseases and Arthritis and Rheumatism. (See more publications under our academics' profiles.) The award of the Osteoarthritis Research Society International (OARSI) Clinical Research Award to Professor Michael Doherty in 2012 in recognition of his excellence in clinical research related to osteoarthritis. PhD opportunities Research team The University of Nottingham School of Medicine Clinical Sciences Building Nottingham, NG5 1PB email:Group Administrator"
        }
    ],
    "pdf_files": []
}