{
    "url": "https://www.nottingham.ac.uk/research/groups/environment-and-society/index.aspx",
    "content": [
        {
            "p": "Residents of a refugee camp in Bosnia wait in line for food distributed from Bihać Red Cross, while men wash themselves at the back of a water truck. This camp was situated directly on the location of a former landfill site and surrounded by landmines from the Yugoslav War. Photograph by Dr Thom Davies. This theme encompasses research that broadly considers environment-society relationships. Much of our work is framed by concepts of the Anthropocene and sustainable development including the social, cultural and political contexts within which environmental issues and governance strategies are embedded. Reflecting the School of Geography's emphasis on interdisciplinary and collaborative research, our theme members are drawn from across the discipline and bring together a diverse combination of subject-specific and methodological expertise. Research within the theme is undertaken in a range of geographical contexts and at a variety of scales and can be divided into four broad sub-themes: (2016-2020) £1.5 million, NERC, BBSRC, MRC, AHRC (Carol Morris Co-I; PI is Dov Stekel, School of Biosciences, University of Nottingham). £20 million UKRI CGRF funded hub aimed at reducing disaster risk for the poor in tomorrow’s cities. Arabella Fraser is Co-I; PI is John McCloskey, School of Geosciences, University of Edinburgh. 2018-19. ESRC Impact Accelerator led by the University of Warwick. Arabella Fraser is Co-I. £50,000 British Academy funded project linked to the ‘Humanities and Social Sciences Tackling the UK’s International Challenges’ program. Simon Gosling is the PI. £10,000 Antipode Foundation Scholar Activist funded Project that involves working closely with activist-group No Name Kitchen. Thom Davies is Co-PI. School of Geography Sir Clive Granger Building University of Nottingham University Park Nottingham, NG7 2RD +44 (0)115 951 5559"
        }
    ],
    "pdf_files": []
}