{
    "url": "https://www.nottingham.ac.uk/research/groups/bmi/index.aspx",
    "content": [
        {
            "p": "The prevalence of chronic diseases requiring the use of medical devices and implants is rising fast. Failure and rejection of implants due to infection or adverse immune responses, causing chronic inflammation, are major barriers to clinical success and affect millions of patients. 1) Cell Polymer Microarray (Asha Patel, 2015) 2) Time-of-flight secondary ion mass spectrometer 3)Differentially polarised macrophage seeded on polymer array, an array of cells on an array of surfaces 4) Cells on polymer spots Biomedical devices are now an integral part of modern medicine with devices and implants routinely used in a wide range of applications from tissue engineered constructs and drug delivery platforms to biosensors and implants that replace failing organs (hip, knee and dental implants). Research activities within the Bio-Instructive Materials Institute (BMI) are focused on providing innovative solutions to overcome the major clinical challenge posed by infection and adverse immune responses which are orchestrated by immune cells such as macrophages. These complications not only limit the efficacy of currently available treatments, but also pose an important bottleneck in biomedical engineering. Personalised and generalised integrated biomaterial risk assessment (H2020) In Vivo proof of concept studies to assess the efficacy of immuno-modulatory biomaterials (Leanne Fisher) (MRC, CiC) Bio-instructive polymers for bone regeneration (Mitchel Day)(MRC-EPSRC) Pro-vascularisation materials to promote wound healing (Christopher May) (EPSRC) Hybrid bioelectronic and immune-instructive scaffolds for modulating macrophage polarity and their potential applications in chronic wound healing (Charlie Whitehead) (Co-Is Frankie Rawson and Lisa White) (EPSRC) Academics: Collaborators: The University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 846 6246 email: Elizabet.Hudson@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}