{
    "url": "https://www.nottingham.edu.my/Research/Clusters/Mind-and-Neurodevelopment.aspx",
    "content": [
        {
            "p": "MiND is aimed at understanding how conditions that arise from neurodiversity or brain dysfunctions, such as Autism, Attention-Deficit/Hyperactivity Disorder, Tic disorder, Mild Cognitive Impairment, Alzheimer’s disease, and learning disorders affect children, adolescents, and adults. We seek to understand how these conditions impact the quality of life, educational achievement, and mental well-being of people across all stages of life. To ensure our studies incorporate a holistic approach, we also involve non-academic stakeholders in generating research ideas and participating in the design of our research. At MiND, we strive to carry out interdisciplinary research that contributes to the improvement of support that people with these conditions need. Our research, in particular, considers the multicultural and multilingual characteristics of Malaysia and those of the international sphere. We also work towards informing parents, teachers, clinicians, policymakers, and the general public on what can be done to improve public and private healthcare services in the country. Our research is situated within a wide range of settings, such as educational institutions and the workplace or society. Examples of our research include investigating what employers can do to promote psychological well-being amongst workers at different levels. Another example is understanding how society and the media perceive and talk about mental health and well-being, for example, in relation to suicide prevention or the stigma surrounding accessing psychological support services. To maximise our impact and enhance the dissemination of our findings more effectively, we also promote participatory research & patient and public involvement (PPI) initiatives, which includes efforts like engaging the public and taking steps towards effectively translating our work. Our goal is to provide the largest benefit possible for Malaysian society and this translates into our research design and outcomes. This cluster consists of three subgroups, namely: Learning and Development, Global and Society Issues, and Well-Being. Under the first subgroup, themes such as Development and Learning, Instrument/ Test Development, and Language, Literacy, and Communication are studied. Under the second subgroup, Global and Society Issues, themes such as Sustainability and Economic Development, Culture, Diversity, and Inclusion, the Scholarship of Teaching and Learning; Augmented Reality & Gaming Learning Activities are tackled. Finally, the last subgroup, Well-Being, researches themes related to Mental Health, Employees’ Well-Being, Brain, Body and Mind, and Executive Functions. Decades of research has shed light on the nexus between neurodevelopment, mental health and well-being, helping those affected to better by improving what we know about new or existing conditions. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}