{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Sze-Pheng-Ong.aspx",
    "content": [
        {
            "p": "We are looking at a tree in Malaysia called Moringa oleifera. Its leaves are referred to as a superfood because of the high levels of protein and nutrients like iron, potassium and calcium along with vitamins A, C, B6 and B2. The moringa leaves are also believed to help to kill bacteria such as E. coli and Staphylococcus as well as to ward off diabetes. Our investigations aim to identify which compounds are responsible for these antimicrobial and antidiabetic properties. We need to confirm the component that we should extract and then isolate this compound from the leaf. Once extracted, the compound can be processed into a powder form and added to any kind of consumer product. With the antimicrobial ingredient, for example, it could be included in detergent soap. While the antidiabetic compound could be made into pharmaceutical products specifically designed for diabetes patients. We are investigating the best drying technique to process the leaves while extracting the bioactive ingredients. Currently we are using hot air- and freeze-drying methods, but a tailor-made technology is really required. If you use high temperatures, it dries very fast, but the drawback is you damage the sensitive ingredient in the process. Conversely, you cannot dry this fresh material too slowly. Fail to process them within hours of being picked, the leaves start to oxidise and degrade. You also need to find the optimum temperature and processing time. The freeze-drying process works at a very low pressure. Basically, it’s vacuum. First, we freeze the water in the sample until it turns to ice, which we subject to vacuum conditions then it goes from ice to vapour (sublimation), skipping the evaporation part of the process. While this technique maintains the bioingredient to a higher level it is extremely costly and takes a long time – it is up to 10 times slower than hot air drying. You also need a large storage space for the freezer. For these reasons we are working on a heat pump with microwave-assisted dryer. It uses the rejected heat from an air conditioning unit, to get hot, dry air for the leaf processing and in a much shorter time than conventional methods. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}