{
    "url": "https://www.nottingham.ac.uk/research/groups/diagther/index.aspx",
    "content": [
        {
            "p": "Welcome to The University of Nottingham’s Diagnostics and Therapeutics Research Group. Based within the School of Veterinary Medicine and Science. We are a specialist research community focused on the discovery and development of novel diagnostics and therapeutics for life-changing and life-threatening diseases in animals and humans. We use a comparative medicine approach, employing animal models of disease to advance human medicine – and innovative human medicine to advance veterinary practice. This involves a unique combination of evidence-based medicine and cutting-edge tools, including next-generation pathology and pharmacology, bioinformatics and novel in vitro and in vivo models. Together, they enable us to develop advanced diagnostics for early disease detection and inform treatment decisions in modern medical practice. Cancer is a leading cause of death and disease. Our cutting-edge research is making a significant impact on early detection and targeted, effective treatment of primary and metastatic tumours. Whether they occur acutely or chronically, kidney conditions can be hugely debilitating. Together we’re conducting research into therapeutic preventative solutions. With a growing aged population, neurodegenerative disease is becoming increasingly common. Our research is identifying much needed new diagnostics and therapeutics to tackle it. Cardiovascular disease is a major cause of death. Our work aims to understand how and why it occurs, as well as how we can better diagnose and prevent it. Reproductive disease can affect the ability of both people and animals to give rise to future generations. At Nottingham, our research is improving diagnosis and treatment across species. Find out more about our researchers and their work Find out about study opportunities aligning to our research School of Veterinary Medicine and Science University of Nottingham Sutton Bonington Campus Leicestershire, LE12 5RD"
        }
    ],
    "pdf_files": []
}