{
    "url": "https://www.nottingham.ac.uk/research/beacons-of-excellence/future-food/capabilities/uon-capabilities-across-the-food-system.aspx",
    "content": [
        {
            "p": "Thank you for your interest. Future Food Beacon closed in July 2023 and these pages will not be further updated. We thank all those involved in making the Beacon a success. The University of Nottingham Food Systems Institute launched in Aug 2023 please visit their webpages for more information. A Transdisciplinary Approach to Food Systems Transformation The need to transform food systems is pressing and immediate. Globally, the food system is a major source of greenhouse gas (GHG) emissions, and driver of biodiversity loss, conversion of land, depletion of freshwater resources, pollution of aquatic and terrestrial ecosystems, and inequality. The agriculture, forestry, and land-use sectors account for nearly a quarter (24%) of total global GHG emissions. By addressing land-use change, agricultural GHG emissions, food loss and waste, and shifting to sustainable and healthy diets, we can reduce GHG emissions enough to contribute 20% of global mitigation needed by 2050 to deliver on the target 1.5oC target. To meet the global challenge of delivering healthy food for all with an economically viable, environmentally regenerative, NetZero food system, requires a multi-stakeholder transdisciplinary approach with alignment across the three central drivers for change across food systems. As suggested by the National Food Strategy such remodelling of the food system could be driven by a coordinating What Works Centre (WWC): Find out about our research in arable, livestock and alternative production systems. We have research expertise across a range of areas related to processing and packaging. We are reforming supply chains to make them more sustainable and equitable. Explore ways we are working to improve public health through better consumption behaviours. Our researchers are working to improve waste valorisation, circular economy and recycling. Explore our projects that span disciplinary boundaries, working on challenges across the food system."
        }
    ],
    "pdf_files": []
}