{
    "url": "https://www.nottingham.ac.uk/research/groups/radiologicalsciences/index.aspx",
    "content": [
        {
            "p": "Radiological Sciences aim to develop quantitative imaging biomarkers for improved understanding, diagnosis and treatment guidance. We facilitate and support collaborative research involving advanced imaging, training students and research fellows to build future world-class talent in academic radiology and medical physics. Our team includes clinicians, physicists, technicians and computer experts. Our research includes work in stroke, pain and neurodegeneration, as well as healthy brain function, using a variety of neuroimaging techniques. Diffusion, perfusion, functional and structural imaging are available in our state of the art Medical Imaging Unit. Imaging physics and analysis supports these projects and we are currently undertaking a long term project to create a repository of imaging data which will be available to researchers all over the world. The debilitating effects of stroke, chronic pain and dementia are felt by millions of people the world over and their prevalence is increasing. Our objective is to translate our on-going pre-clinical research in neuroimaging to the clinic, improving diagnosis and treatment of these diseases. 1. Stroke Stroke is a leading cause of adult disability and over 150,000 people in the UK fall victim to strokes of varying severity every year. More than half of all survivors are left dependent on others for everyday activities. Age-related disease of the arteries can cause strokes in two ways: embolism (blocked arteries in the brain) or haemodynamic compromise (narrowing of the arteries). To prevent this, diseased vessels can be operated on using a procedure called carotid endarterectomy or CEA. However, the procedure itself carries a risk of causing stroke. In some patients the overall absolute number of strokes will be reduced, but for others the outcome is less clear and the possibility of future stroke prevention may not outweigh the surgical risk. This group is likely to be composed of two subgroups one with higher natural stroke risk likely to benefit from surgery and another with natural low risk that do not require the intervention. In previous work, we and others have shown that noninvasive imaging tests may allow to separate these two groups. In our current work we are testing whether our imaging technique can truly identify patients at low or high risk and therefore enable a better informed, targeted and safer recommendation for surgery. 2. Pain It is estimated that over 10 million people in the UK suffer from some kind of chronic pain that affects their daily life. In 2013, over 8 million people sought treatment for the painful effects of osteoarthritis. Our research focuses on the pain caused by this group of diseases we know as arthritis, specifically the interaction between pain felt in the knee joint and its effect on the brain. The perception of pain is a complex multidimensional experience. Understanding the neural basis for how we experience pain provides an important biological and mechanistic framework from which we can develop a better understanding of these multidimensional origins. 3. Neurodegeneration The cost of Parkinson’s and Alzheimer’s disease and the many other forms of neurodegeneration is thought to cost the world over $600 billion and the cost to those affected and their families is incalculable. The growing problem of neurodegeneration has been recognized by the UK Government as a major challenge, both to individuals and the economy. We aim to identify biological markers in the brain which can identify a range of neurodegenerative diseases and improve early diagnosis and treatment of these diseases. Different technologies are currently being researched for identification of such biomarkers. And we have recently shown that MRI imaging could hold unique promise for direct visualization of parts of the brain affected by neurodegeneration and identify the stage, severity and particular type of disease by the use of this non-invasive technique. Since MRI biomarker research is an emerging field with limited and often controversial findings, we are also working on the creation of a dedicated MRI imaging repository which will help researchers assess the diagnostic accuracy and predictive power of novel MRI biomarkers. Our research impact is reflected in the following: Publications in leading journals Schwarz ST, Afzal M, Morgan PS, Bajaj N, Gowland PA, Auer DP. The 'Swallow Tail' Appearance of the Healthy Nigrosome - A New Accurate Test of Parkinson's Disease: A Case-Control and Retrospective Cross-Sectional MRI Study at 3T. PLoS One. 2014 Hosseini AA, Simpson RJ, Auer DP, Altaf N. Carotid plaque hemorrhage on magnetic resonance imaging and recurrent cerebrovascular events. J Am Coll Cardiol. 2014 Rodriguez Gutierrez D, Awwad A, Meijer L, Manita M, Jaspan T, Dineen RA, Grundy RG, Auer DP. Metrics and Textural Features of MRI Diffusion to Improve Classification of Pediatric Posterior Fossa Tumors. AJNR Am J Neuroradiol. 2013 View more publications on our individual profiles Research awards ARUK –Pain Centre Nottingham, Arthritis Research UK £2,449,951. D Walsh (PI), V Chapman, DP Auer, M Doherty, S Kelly, N Lincoln, B Scammell, W Zhang Realising the benefits of structural and functional MRI at ultra-high-field, MRC/EPSRC £2,056,000. P Morris (PI), A Palmer, R Bowtell, Su Francis, P Glover, P Gowland, K Krumbholz, DP Auer, W Kockenberger, P Liddle, S Jackson PaMIR – A Parkinson’s Imaging Repository, Parkinsons UK £657,107.84. DP Auer (PI), N Bajaj, S Schwarz, D Grossett, D Burn, P Piccini WIRMS (Worms for Immune Regulation in MS) Trial. A randomized, placebo controlled, phase II study of hookworm in relapsing remitting multiple sclerosis, MS Society £396,392. C Constantinescu (PI), D I Pritchard, P Silcocks, DP Auer, C Hawkey Medical Imaging Unit Sir Peter Mansfield Imaging Centre Clinical Research Facility More Division of Clinical Neuroscience news There are no results that match your criteria. More Division of Clinical Neuroscience events PhD opportunities Neuroscience at Nottingham (N@N) Group members The University of Nottingham Room W/B 1441, B Floor West Block Queens Medical Centre Nottingham, NG7 2UH telephone: +44 (0) 115 823 1179 email:Group Administrator"
        }
    ],
    "pdf_files": []
}