{
    "url": "https://www.nottingham.ac.uk/research/groups/conferencing-the-international/index.aspx",
    "content": [
        {
            "p": "Between November 1930 and December 1932 a Round Table Conference took place, over three sittings, in London. It was charged with making proposals regarding the next stage of India’s constitutional development, which would inform an Act of Parliament. The Round Table Conference brought over 100 delegates together, from India and Britain, to freely debate the future of the British Empire’s most prized colony. The result was a detailed set of proposals to unite British India and the Indian States, ruled by hereditary ‘Princes’, within an all-India federation, subject to reservations (for British control) and safeguards (for minority communities). The federation, however, did not materialise before independence in 1947 and the conference failed to produce a compromise agreement on communal representation. Whilst widely regarded as a failure, the Round Table Conference laid the bedrock of the Government of India Act (1935) and pioneered the fusion of international conference methods with late-colonial negotiations of state sovereignty that would become regular staging posts in the British Empire’s reluctant path to decolonisation. This website has been designed and constructed by Dr Benjamin Thorpe, based on the archival research of Prof Stephen Legg, as part of the AHRC-funded \"Conferencing the International\" project. It brings together sources that give some insights into what happened at the three conference sessions: a timeline of conference chronology; maps of where delegates slept, socialised and travelled from; selected profiles of delegates and staff; and representations of the conference in art, photography, film and text. The contested origins and workings of the conference The multi-scalar cartographies of the conference How the conference was represented via text, image and film Our database featuring a selection of key figures Special thanks to Antonia Moon (British Library), Jocelyn Daniels, Mukesh Randev and David Aldred (University of Nottingham), Christa Cleeton (Princeton), Corye L. Bradbury (Proquest) and David Burns (Orphan Works Licensing Team). telephone: +44 (0)115 84 68402"
        }
    ],
    "pdf_files": []
}