{
    "url": "https://www.nottingham.ac.uk/research/groups/vax-trust/index.aspx",
    "content": [
        {
            "p": "VAX-TRUST (\"Addressing Vaccine Hesitancy in Europe\") was an international and interdisciplinary project that utilised social science methods and approaches to explore the broad societal phenomenon of vaccine hesitancy. The aim of VAX-TRUST was to improve our understanding of vaccine hesitancy and to develop evidence-based educational interventions for healthcare professionals and healthcare students. The project was funded by the EU Horizon 2020 programme. VAX-TRUST was a multi-stage project that aimed to deepen our understanding of parental vaccine hesitancy. The stages of the project included an analysis of media discourse around vaccines, qualitative interviews with parents and healthcare professionals, ethnographic observation of childhood immunisation appointments, and the development of evidence-based tools to help healthcare professionals maintain positive communication with parents who may be cautious about their children receiving routine vaccinations. The stages of VAX-TRUST are outlined below. Stage one was completed in late 2022, stage two was completed in July 2023 and stage three was completed in February 2024. Our online intervention was created in stage two of VAX-TRUST. Situation analysis of vaccine hesitancy in the East Midlands Analysis of media coverage related to vaccination Qualitative research into vaccine hesitancy in the East Midlands Design and implement tailored and evidence-based interventions Evaluation of interventions Provide recommendations East Midlands regional focus People This project has received funding from the European Union’s Horizon 2020 research and innovation programme under Grant Agreement No 965280. To get in touch with the Nottingham team, please contact Dr Anderson at alistair.anderson@nottingham.ac.uk or Dr Tristan Emerson at tristan.emerson2@nottingham.ac.uk email: alistair.anderson@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}