{
    "url": "https://www.nottingham.ac.uk/research/groups/hearingsciences/index.aspx",
    "content": [
        {
            "p": "For many people hearing is their most relied-upon sense to connect with other people. Yet hearing disorders (including hearing loss, tinnitus, hyperacusis, ototoxicity) affect 20% of the population, and cause direct difficulties in every aspect of hearing, listening, conversing and being aware of the environment through sound. Hearing disorders are also associated with increased risks of social isolation, depression, dementia, and reduced quality of life. Our mission is to deliver research-led innovations that can change these effects and lead to improvements in daily living for people who have hearing-related problems. Nottingham has been at the centre of hearing and tinnitus research in the UK for over 45 years. We use insights generated from the lived experience of people and the clinic to guide the basic science that we do. We study how the auditory system works, how and why it can go wrong, and what we can do to help those with problems by technology or treatment strategies. We are based in Nottingham and Glasgow – including a university campus, a large research-active NHS audiology centre and auditory implant programme, and two teaching hospitals. We are a core theme of the Nottingham NIHR Biomedical Research Centre and also hold major grants or fellowships from NIHR, UKRI (MRC, EPSRC), and industry. We also teach on undergraduate degrees and offer CPD masterclasses. People, locations, groups and structure Find details about our learning opportunities Explore our research Be part of research through studies and PPI NIHR Biomedical Research Centre (BRC) Scottish Section (Glasgow) Mental Health & Clinical Neuroscience School of Medicine University of Nottingham Medical School, QMC Nottingham, NG7 2UH telephone: University Park +44 (0) 115 74 86900 Ropewalk House +44 (0) 115 82 32600 Glasgow +44 (0) 141 242 9665 email: hearing-research@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}