{
    "url": "https://www.nottingham.ac.uk/researcher-academy/news/latest-news/news1.aspx",
    "content": [
        {
            "p": "Cookies help us to give you the best experience on our website. You can change your cookie settings if you wish. Otherwise we'll assume you're OK to continue. OK See our policy March 3, 2022, by Postgraduate Placements Nottingham ~ Zaid Janjua, Lead Engineer – Ice Protection System at Lilium. When I received the offer letter for my current role, the recruiter mentioned something interesting to me. Prior to our first call, she had already decided that I was the perfect candidate after viewing my three-minute thesis speech! It was different, bold, and zany according to her. I was taken back to 2015, the third year of my PhD, and attending an introductory session to the Three Minute Thesis competition (3MT) organized by the Researcher Academy (formerly Graduate School). It is a competition where PhD students summarize their research in three minutes for a non-specialist audience without singing, dancing, or rapping! I was largely clueless at that point, and unsure about wanting to participate. Us PhD students often have a million other priorities on hand! The session was refreshing and informative. Better sense prevailed in the end, and I participated. It was a game-changer for me. The Researcher Academy supported me with individual coaching, feedback, and logistics throughout the process. From winning the internal university competition to becoming the first student to win both the judges’ and peoples’ choice award at the national level, the experience was fantastic. My supervisors were thrilled with the added dimension to my research degree. I received an opportunity to provide a few online interviews and used the prize money to travel to a conference in the USA and work with a primary school in Nottingham on an aerospace design competition. A few universities in the UK invited me to conduct training courses on the three-minute thesis competition and attend their internal competitions as a judge. The icing on the cake was receiving the Vice-Chancellor’s Medal in 2017, two days after successfully passing my thesis defense. Looking back now, I am glad that I overcame my initial hesitation and took the leap. But isn’t taking risk what a PhD is all about? For most of us, a PhD is about a thesis, published papers and a degree to cap off a few years of intense hard work. But there is more to it, because it cannot be said enough that employers value candidates with a difference and those that are unafraid to stand out. Being confident, and focusing on developing the soft, transferable skills during your PhD is priceless. This helps to widen your horizon when it comes to job prospects and avoids shoehorning your career into a specific field. A strong and dynamic Researcher Academy / Graduate School such as ours is crucial, especially when catering to an intensely diverse array of research students. It is also thereby incumbent upon us to stay in touch, even after completing our degrees. Recently, the Researcher Academy invited me during their Careers Writing Retreat to engage with current students on life after PhD. It was a wonderful experience with some interesting questions. An hour-long Three Minute Thesis training course narrated by me is also available through the Researcher Academy portal. In this way, I feel fully integrated within the alumni network and look forward to being involved in more events in the near future. I will end here by sharing the greatest learning from my time at the university, “Never miss out on a free lunch…or competition” And I mean it! Zaid is an incredible and talented person. I had the privilege to share some of my time in Nortigham with him, and his technical, social and speeching skills are remarkable. His success comes naturally due the person he is. All the best o you Zaid, you deserve. Great article, very inspiring! Well written and inspiring piece of article, Zaid. Feeling proud to working with you at Lilium. All the best for more achievements to come! Zaid you are a true inspiration and a great achiever in your field,your writing is commendable how you impart valuable knowledge through your understanding and experiences. Your achievements are par excellent and all I can summarise this by saying we are so proud of you and can learn so much from you and always be the true you and may you win and shine always. You bring a smile on our faces and we are so so proud of you ?? for all you have achieved and yet to achieve.??? Hi zaid congratulations for ur great achievement in ur field and so proud of u to have u as a nieghbour n u made ur family proud keep going forward in life may Allah bless you with many more Great achievements. Proud of you! Wishing you all the best for the future! It’s nice to know some one this dedicated. May this young men find more challenges to succeed. I live the last bit “Never miss out on the free lunch or competition” Very well articulated article. Great tips for the young researchers. Keep it up and super proud of you Zaid! Superb ? Congratulations Zaid. Amazing article. You summarised your entire stay in few lines but those are truly impactful lines. When you say an hour long training course for a 3 minute thesis it says it all. Even a 3 MT thesis needs hours of hard work only then can it be outstanding. You are outstanding as well as humble a very powerful combination. You won academics as well as hearts. Stay true to yourself. Best wishes always. Well done Zaid, you are a top man. Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Our site makes use of cookies. See Privacy and Cookies for details."
        }
    ],
    "pdf_files": []
}