{
    "url": "https://www.nottingham.ac.uk/research/groups/academicophthalmology/index.aspx",
    "content": [
        {
            "p": "Academic Ophthalmology is an integrated academic research group and NHS department based in the School of Medicine. It carries out both research and teaching in the University and provides a clinical ophthalmology service. The aim of the group is to undertake high quality clinical and translational research in order to improve the treatment of preventable blindness. --Professor Harminder Dua, Head of Academic Ophthalmology Trauma, inflammation and infection at the ocular surface causes damage, which without effective treatment, accounts for up to 2 million new cases of monocular blindness every year, adding to the existing 39 million cases worldwide. In addition, age-related macular degeneration and diabetic retinopathy are the most common causes of preventable blindness in the western world, AMD in the ageing population and diabetic retinopathy in the working population. This has significant physical and psychological impact on the patient as well as having profound consequences for their families and socio-economic impact on the community. The high financial cost of avoidable visual loss makes it an important public health concern. Unfortunately, current treatment strategies for these patients are subject to many limitations, therefore creating a great need for research in this area. The Ocular Surface group aims to prevent ocular surface-blindness, which is can be avoidable but has devastating consequences to the patient and healthcare system, by combating the visually debilitating conditions affecting the ocular surface. To this end they undertake clinical and basic science research into ocular surface healing and regeneration through stem cells and regenerative constructs and ocular immunity. (Read more) The Ocular Neovascularisation group aims to study ocular neovascular eye disease, such as age-related macular degeneration and diabetic retinopathy and their clinical treatments to improve understanding and future treatments. They undertake clinical and basic science research into genes and angiogenic factors involved in these diseases, the diseases mechanisms and current treatments to inform clinical practice. (Read more) Our research has been published in leading peer-reviewed journals e.g. Ophthalmology and Eye. (See more publications under our individual academics' profiles.) NuVision was incorporated on 10 July 2014. The company aims to develop, validate and commercialise innovative and cost effective ophthalmic regenerative therapies to save sight. Professor Harminder Dua is current President of the Royal College of Ophthalmologists. Mr Winfried Amoaku is a Consultant Ophthalmologist and Reader experienced in clinical trials and clinical and translational research. Dr Andrew Hopkinson is the lead scientist and the founder of the Nottingham Centre for Eye Research (NCER) More news PhD opportunities Group members email: Kevan Jackson"
        }
    ],
    "pdf_files": []
}