{
    "url": "https://www.nottingham.ac.uk/research/groups/age-related-disease/index.aspx",
    "content": [
        {
            "p": "Understanding the genetic, dietary and lifestyle influences of healthy aging. At SVMS we have a critical mass of researchers investigating the potential for stem cell based regenerative medicine (Allegrucci, Mongan, Loughna), manipulation of the microenvironment to stimulate chondrogenic and osteogenic differentiation of mesenchymal stem cells and biomarkers of arthritis (Mobasheri), angiogenesis (Rutland) and geriatric disease in canines and their influence on age-related rise in blood pressure (Davies, White). Dr. Alison Mostyn has a general interest in adipose tissue and have examined lipid regulators and adipokines in adipose tissue from a wide range of species and integrating the results with physiological and ontological data (in collaboration with Dr Nigel Mongan (SVMS), Dr Lisa Yon (SVMS), Dr Alex Lyon (Imperial College), Rob Foale (Dick White referrals). She is continuing to develop the pig as an alternative animal model for investigating the influence of nutrition and size at birth on subsequent disease, in particular investigating the expression of the receptors and enzymes that regulate lipid metabolism (in collaboration with Professor Michael Symonds (School of Clinical Sciences), Professor Michael Lomax (Biosciences) and Dr Paul Bikker (Wageningen UR Livestock Research, The Netherlands). I also use the pig to investigate the influence of genotype, delivery method and nutrition upon neonatal physiology (in collaboration with Dr Matthew Hyde (Imperial College)). Through a long term study Dr. Catrin Rutland’s group are investigating how diet during pregnancy can influence life-long health (Gardner, Rutland). The group uses genetic, proteomic, epigenetic, anatomical and functional effects of a low protein diet during development in a number of species. The angiogenesis work also includes blood vessel corrosion casting projects and research into ocular diseases, especially those presenting with abnormal vasculature. The overall aim of the work is to elucidate the molecular mechanisms behind both normal and diseased states. Collaborators include those from SVMS but also from University of Ulster, NHS clinicians, Feinberg Medical School Chicago, Memorial Sloan-Kettering Cancer Center New York. Stem Cell Biology at SVMS: The University of Nottingham School of Veterinary Medicine and Science Sutton Bonington Campus, Leicestershire, LE12 5RD telephone: +44 (0) 115 951 6116 email: Email our Research Theme Leader"
        }
    ],
    "pdf_files": []
}