{
    "url": "https://www.nottingham.ac.uk/research/groups/raw-feeding-project/index.aspx",
    "content": [
        {
            "p": "At present, very little is known about owners’ decisions to feed their dogs raw meat-based diets beyond nutrition and health perspectives. This project aims to capture an in-depth understanding of the social aspects around raw feeding. We would like to invite you to take part in an international research project. See below for more information about the project and how to participate. What to feed your dogs is an important decision for many owners. In recent years, raw meat-based diets have become an increasingly popular alternative diet for dogs. This project is exploring dietary shifts in human and non-human animal companions. The primary aim is to better understand the values, practices and ethics of dog owners who feed raw meat-based diets, while themselves eating a plant-based diet. To conduct this research, we are asking participants who themselves eat a plant-based diet to complete food diaries and attend an online research interview. You have been invited to take part because you are a self-identifying vegetarian or vegan who feeds your dog a raw meat-based diet and are over 18 years of age. We are inviting 20 to 30 participants like you to take part. It is up to you to decide whether or not to take part. If you do decide to take part you will be given an information sheet to keep and be asked to sign a consent form. If you decide to take part you are still free to withdraw at any time and without giving a reason. This would not affect your legal rights. We would like you to complete a food diary for three consecutive days followed by an online research interview lasting one hour. Time: Three days, one photo/video per day Location: Your home Time: One hour Location: Online Participants will not be paid but your participation will help to improve understandings of decisions around raw feeding for dogs and the relationship with your own diet. Researcher: Natalia Ciecierska-Holmes, PhD Candidate, University of Adelaide and University of Nottingham, email: natalia.ciecierska-homes@nottingham.ac.uk Supervisor/PI: Professor Rachel Ankeny, Department of History, email: rachel.ankeny@adelaide.edu.au Dr Melanie Jordan, Research Ethics and Integrity Officer, REC Chair and Associate Professor in Criminology, email: melanie.jordan@nottingham.ac.uk, +44 (0)115 74 87284/95 15410 email: natalia.ciecierska-homes@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}