{
    "url": "https://www.nottingham.ac.uk/research/groups/cardiovascular-disease/index.aspx",
    "content": [
        {
            "p": "Genetics of cardiovascular disease and mechanisms of pathogenesis. The cardiovascular research groups are centred around cardiovascular system and includes researching cardiac disorders, angiogenesis and metabolism. Current projects include investigations into cardiac valve disease, particularly the molecular mechanisms underpinning valvular regurgitation and dynamic function in equines and companion animals (Bowen, Hallowell, Cobb), the role of embryonic myosin heavy chain and ANF in early heart development (Rutland), HIV-related pulmonary hypertension in a nonhuman primates (White), the impact of chronic heart failure on adipose tissue structure and physiology and functional plasticity following rescue by cardiac-specific gene therapy (Mostyn), and blood pressure control and inflammatory markers in dogs with cardiac disease (White). Collaborations within the cardiovascular research group include researchers from SVMS, veterinary clinics across the UK, University of Nottingham Medical School and external researchers including those from University of Missouri, University College London, Imperial and King’s College London. 1. Genetics of cardiovascular disease 2. Mechanisms of cardiac development 3. Genetics of canine cardiovascular disease 4. Blood pressure control and inflammatory markers in dogs with cardiac disease 5. HIV-related pulmonary hypertension in a nonhuman primate model 6. Histology of captive macaque pulmonary vasculature 7. Impact of chronic heart failure on adipose tissue structure and physiology, and functional plasticity following rescue by cardiac-specific gene therapy 8. Blood pressure control and inflammatory markers in dogs with cardiac disease There are no results that match your criteria. The University of Nottingham School of Veterinary Medicine and Science Sutton Bonington Campus, Leicestershire, LE12 5RD telephone: +44 (0) 115 951 6116 email: Email our Research Theme Leader"
        }
    ],
    "pdf_files": []
}