{
    "url": "https://www.nottingham.ac.uk/research/cop/our-research/our-research-and-climate-change.aspx",
    "content": [
        {
            "p": "How our research is driving change – from clean energy to building resilience in the developing world. Meet the innovators driving a revolution in clean transport and delivering new sources of green energy. Find out how we are working to secure nutritious food supplies for a growing global population. Discover how our researchers will help the UK lead the world in achieving net zero aviation, and find out how we work with international partners to ensure marginalised societies have the resilience and resources to overcome flood, drought and rising temperatures. Professor Phil Garnsworthy’s research is helping the UK dairy industry adopt alternative, sustainable sources of protein in animal feed. Dr Eldar Naghiyev outlines how a community energy bubble at a Nottingham housing development could have a global impact. Energy used by buildings is costly to the environment and to our bills – but technological research is changing this, says Ke Qu. A successful transition to renewable energy sources means factoring in all the costs of shifting away from fossil fuels, says Dr Hafez Abdo. Dr Emily O'Donnell explains how the risk of flooding is becoming ever more serious, both in the UK and across the globe, and the challenge of protecting our homes and cities is becoming increasingly important. To understand how agriculture can adapt to a warming world, we need to look to the past and plan for the future, say Professors Matt Jones and Malcolm Bennett. Now is the time to fast track new technologies for low energy CO2 capture, says Professor Ed Lester. The lives of those most at risk from climate change are already precarious. Dr Arabella Fraser says we must make marginalised communities safer as well as sustainable. Explore our sustainable futures research Discover how our researchers will deliver a new generation of aircraft – clean, sustainable, safe and silent – and help the world achieve its zero carbon targets. Explore more of the work our researchers are doing and how it makes a difference to the world around us Access our sustainability policy briefings, which translate our research into insights for policy makers looking to achieve a sustainable future, and engage public audiences with key issues on the sustainability agenda."
        }
    ],
    "pdf_files": []
}