{
    "url": "https://www.nottingham.ac.uk/research/groups/cyphr/index.aspx",
    "content": [
        {
            "p": "Babies, children, and young people comprise over 25% of the population in the United Kingdom. From 2001 to 2020, this population in England with serious, life-limiting conditions rose from 33,000 to around 87,000 many surviving longer and living at home. The Centre for Children and Young People’s Health Research (CYPHR) is led by Professor Jane Coad. Staff undertake novel research in babies, children, and young people and family/carers health needs in community settings. The Centre has several regional partnerships including Nottingham Children’s Hospital, Nottingham City Care Partnership, and Nottinghamshire Healthcare NHS Trust together with national partnership with industry and sector charities. The CYPHR Groups’ philosophy is to integrate a programme of applied and quality research, education and leadership using a range of innovative methods and approaches to impact on national and international children and young people’s health. In turn, we aim to influence policy development in this field. This enables us to develop a clearer understanding of children, young people and family health and wellbeing and will improve their lives, having national and international impact. We have developed an inclusive, strategic, and supportive research environment where clinical and non-clinical academics contribute to clinically impactful research. Our collaborative vision for clinically applied research includes: Our mission is to improve the health outcomes, well-being and lives of children and young people and their families across their life course through a multi-disciplinary and integrated programme of translational health research and innovation which has national and global reach and impact. Children and young people are defined herein as any infant, child, and young person up to 25 years in line with the WHO standards (2012). Our aim is to develop our reputation in research for babies, children, and young people (BCYP) and their families working with our local, regional, national, and international health and care partners in the development and evaluation of research and innovation that is theoretically rooted, evidence-based and impactful in research. Research is our core business. Babies, children, and young people (BCYP) health and care needs are complex, and healthcare therefore needs to be integrated into wider systems of family, schools and the community. Our dedicated CYPHR group conduct high quality, world-leading research, innovation, and education which is needed to improve outcomes, care, and lives. The University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}