{
    "url": "https://www.nottingham.ac.uk/research/groups/infections-immunity-and-microbes/index.aspx",
    "content": [
        {
            "p": "We are currently recruiting for a number of teaching and research positions. See the School of Life Sciences recruitment site for details. The Division for Infections, Immunity and Microbes currently comprises 29 academics with expertise in cell biology and immunology, biochemistry and microbiology. We are dedicated to advancing knowledge and improving human health through internationally recognized microbiology and immunology research. From fundamental science to translational projects, the breadth of our research across the fields of infection and microbiology is underpinned by our expertise and research in immunology. New ways to tackle antimicrobial resistance are a priority area. We lead the Wellcome Trust Doctoral Training Programme in Antimicrobials and Antimicrobial Resistance in collaboration with the University of Birmingham and the Nottingham hub of the National Biofilms Innovation Centre (NBIC). We are funded by the BBSRC, MRC, EPSRC, InnovateUK, Wellcome Trust, Cancer Research UK, the US Defence Advanced Research Projects Agency (DARPA) and the European Commission. Fundamental insights from our research will advance knowledge and deliver impacts in the clinic. Examples of work that is having an impact includes: Our researchers are passionate about what they do and about the wider impact of their work. We collaborate widely with industry and other world leading scientific institutions, support the government in policy development, are active science communicators (see our contribution to the Science Museum’s Superbugs exhibition). As university researchers we are proud to contribute to the teaching and development of the next generation of scientists. Our research is conducted in a spirit of inquisitiveness, and is propelled by intellectual rigor in a collegial and supportive environment. The division’s immunity-centred research addresses fundamental principles of immunobiology. The division’s infection-centred researchers contribute to the fight against infectious diseases and antimicrobial resistance. The members of our molecular microbiology group use microorganisms to better understand basic aspects of biology. Read more news School of Life Sciences University of Nottingham Medical School Queen's Medical Centre Nottingham NG7 2UH"
        }
    ],
    "pdf_files": []
}