{
    "url": "https://www.nottingham.ac.uk/researcher-academy/news/latest-news/academic-and-community-partners-needed-to-co-create-research-projects.aspx",
    "content": [
        {
            "p": "Co(l)laboratory Monday 29 April 2024 The next round of research project co-creation will begin in May 2024 and run through to September 2024. This is a core part of our programme where we bring together Nottingham academics and a wide range of partners from local community-focused organisations to work together to co-create new PhD research projects which address challenges relevant to Nottingham and Nottinghamshire communities. Through this collaborative approach to research, Co(l)laboratory aims to support what we call community-engaged research – research which is grounded in the needs of local communities. and which is more readily able to make a direct, relevant and meaningful impact for Notts communities. Each year, Co(l)laboratory funds x10, 3-year long PhD research projects, and x5, 10-week Research Placement projects. Join an Information Webinar To support new academic researchers and community partners in collaborating on new research projects, we will be running a series of 4 information webinars, starting on 15th May. These will introduce you to the Co(l)laboratory programme, provide an overview of the research project co-creation process, outline how our research projects work, and what the expectations are of different project partners. You will also have the opportunity to ask us your questions. This year we are running separate webinars tailored to the needs of our researchers and community partners. We are offering two instances of each webinar, but please be advised that the content will be the same at each session. Click here to register for one of our webinars. See full list of dates at the bottom of this page. Attend the Research Project Co-Creation Workshop Our co-creation workshop is an interactive event that is designed to help you connect with potential collaborators, explore potential ideas based on priorities identified by our community advisory initiative, and get advice on what makes a strong Co(l)laboratory research project. Click her to register for the Co-Creation Workshop on Wednesday 19th June. We’re looking to support Nottingham academics and community professionals to work together to develop new proposals for projects which would start in April 2025. We need academics who want to help us drive forward an agenda of community-engaged research, and community partners who can provide a strong link to the real life practice and experience that can help ensure our research is relevant and responsive to the needs of local communities. Who can be a community partner? Anyone from a Nottingham(shire) organisation who’s work has a focus on the local community, whether that be large organisations such as NHS bodies and City or County Council departments, or smaller organisations such as local charities, schools, community interest groups, etc. If you’re a community partner who’s eager to connect with researchers whose work aligns with your organisation’s to spark up potential new collaborations, we’re here to help! Submit your details to our expression of interest form below and we’ll do our best to introduce you to Nottingham researchers, based on your interests and area of work. Community-based partners who are part of project proposals which go on to be funded will be able to benefit from a range of unique opportunities, as well as the benefits of the research. Support payments are also available to compensate our Community partners for their time and contributions. COMMUNITY PARTNER INFORMATION WEBINARS RESEARCHER INFORMATION WEBINARS RESEARCH PROJECT CO-CREATION WORKSHOP DEADLINE FOR SUBMISSION OF PROJECT PROPOSALS CANDIDATE APPLICATIONS OPEN RESEARCH PROJECTS BEGIN Co(l)laboratory, Nottingham Trent University Research Culture and Environment 50 Shakespeare Street, Nottingham, NG1 4FQ Email: collaboratory@universitiesfornottingham.ac.uk Phone: +44 115 84 86877 © Copyright 2023 | All Rights Reserved | Developed by Vyas Systems Neve | Powered by WordPress"
        }
    ],
    "pdf_files": []
}