{
    "url": "https://www.nottingham.ac.uk/research/groups/abiotic-and-biotic-stress/index.aspx",
    "content": [
        {
            "p": "The research in this strand addresses the challenge of Global Food Security and is focused on understanding the central molecular mechanisms controlling plant responses to abiotic and biotic stresses. The abiotic stresses of waterlogging and drought are key targets, while research on biotic stress involves work on crop disease control using a number of approaches including chemical intervention, analysis of the molecular basis of disease resistance and development of novel molecular techniques for the detection of plant pathogens. Crop targets include wheat, barley, tomato, groundnut and ornamental species. Michael Holdsworth's research aims to uncover and understand molecular pathways that control plant response to environmental stresses, particularly in relation to environmentally-determined stability of regulator proteins. Steve Rossall is investigating control of Aspergillus infection in groundnut using natural antifungal plant extracts and antagonistic micoorganisms. Rumiana Ray is working on the epidemiology and control of root, stem-base and ear diseases traits in cereals, while work by Matt Dickinson focuses on detection of plant pathogens using arrays and in-field isothermal amplification techniques. Much of the research in this theme receives industrial sponsorship along with funding from RCUK. Current and future research aims to continue to understand how this pathway controls plant abiotic responses, to understand how perception of multiple abiotic stresses is coordinated, and to provide resources for plant breeders and growers (Mike Holdsworth). Work on the epidemiology and control of crop diseases includes strategies against Fusarium head blight effective in malting barley (SAFEMalt), identification of physiological traits in wheat conferring passive resistance to Fusarium head blight and elucidating crop losses and control of Rhizoctonia solani and R. cerealis in wheat (Rumiana Ray). Work on detection of plant pathogens includes development and in-field testing of improved phytoplasma molecular diagnostic techniques in Ghana, application of next generation diagnostics for improved detection and understanding of root diseases in tomato and characterising populations of yellow rust using molecular markers (Matthew Dickinson). Fundamental Research Using Model Plants Models to Crops Cereal Crops Fruit and Vegetable Crops Centre for Plant Integrative Biology - CPIB Nottingham Arabidopsis Stock Centre Crops for the Future Research Centre - CFFRC Bhosale Lab The University of Nottingham 301B South Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6046 email:michael.holdsworth@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}