{
    "url": "https://www.nottingham.ac.uk/research/beacons-of-excellence/green-chemicals/research-themes/index.aspx",
    "content": [
        {
            "p": "To address core global challenges and meet our sustainable development goals, we will create a groundbreaking biotechnology platform by integrating expertise across eight pioneering areas of research. The successful economic exploitation of molecules produced in a sustainable way requires a clear understanding of the techno-economic factors that impact the production processes. This includes having price models for the carbon feedstocks as well as the products. A key objective is to augment techno-economic analysis with life cycle analysis to inform price setting mechanisms via a rapid analysis software tool. In collaboration with the University of Nottingham Rights Lab, our Beacon will further incorporate supply chain vetting into its modelling framework. Industry collaborators will find this software tool invaluable in directing their goal-orientated R&D activity. Jon McKechnie and Ioanne Dimitiou will create the software tool in collaboration with international industry consortia. Lead: Jon McKechnie In metabolic engineering, systems biology in silico models play a vital role in assessing the feasibility of alterations in host organisms. The Beacon will establish an automated pipeline capability for the generation of genome scale models ranging from bacteria, cyanobacteria to yeast host systems. We will augment existing systems' biology methodologies with advanced computational tools to expand the capability to redistribute carbon flux to desired products. Tania is an expert in bioinformatics and machine learning in highly combinatorial problem domains. She will be supported by computational chemists including Richard Emes and Jonathan Hirst and other University of Nottingham colleagues across its UK and international campuses including Elena Besley, Nicholas Besley, Hainam Do, Richard Wheatley, John King and Jamie Twycross. Anna Croft and Christof Jaeger will further integrate computational chemistry applications and developments (e.g. in molecular modelling and quantum chemical calculations) into the Enzyme Engineering capabilities of the Beacon. Lead: Tania Dottorini Enzymes have evolved to catalyse the transformation of carbon substrates with high selectivity. Industrial utilisation of enzymes often requires enzyme engineering to optimise catalysis efficiency. We will establish a robust directed evolution capability which can be used across multiple areas including enzyme reactors, high value chemical biotransformation, and microbial cell factory development. The key to success will be enzyme screening methodologies through the establishment of growth screens in continuous culture and using medium throughput liquid handling systems. Rational enzyme design will be facilitated through computing power provided by High-Performance Computing (HPC). Anca Pordea will work to deliver directed evolution methodology. Anna Croft and Christof Jaeger will provide expertise in the rational design of enzymes supported by the University’s HPC power. Lead: Anna Croft The development of stable episomal vectors and novel attenuation methods in non-model host organisms are core to progressing host platforms with unique product attributes. There is a need to focus beyond commodity chemicals towards markets demanding product quality attributes. Samantha Bryan leads the White Biotech activity to develop chasses for aromatic, aldehyde and terpenoid platform production; focusing on the implementation of attenuation strategies and novel synthetic biology tools to improve carbon flux in cyanobacteria, E. coli and Cupriavidus sp. Samantha has strong collaborative links with both national and international research labs and industrial partners, which will help us accelerate the research programmes. The Beacon will propel early Technology Readiness Levels (TRL) activity along a developmental conveyor to deliver greater intensification with economic feasibility relevant to industrial stakeholders. Lead: Samantha Bryan Omics capabilities are essential to providing performance feedback during microbial cell factory development. The Beacon will enhance existing expertise in liquid and gas chromatography mass spectroscopy by creating knowledge generation pipelines for (1)13C fluxomics, (2) metabolomics and (3) quantitative metabolite profiling. The equipment investment from the Beacon will create a unique facility within the UK, open for collaboration across the University ecosystem and the wider UK research community. The analytics and omics capability will integrate and inform the computational chemistry capability, validating genome scale models and mechanisms associated with new catalysts and separations media. Dong-Hyun Kim leads this facility. This capability will benefit from synergies and expertise including state of the art NMR methods (Mark Searle, Huw Williams) and the study or protein/small molecule interactions (Neil Oldham). Lead: Dong-Hyun Kim The Beacon will exploit a wide range of diverse renewable carbon feedstocks, including monosaccarides, lignocellulose, lignin and C1 gas. Integrating the pre-treatment of such diverse carbon feedstocks with cultivation strategy development will speed up the innovation cycle towards favourable techno-economic outcomes, supported by the deep knowledge of Ed Lester and Sir Martyn Poliakoff in subcritical and supercritical water applications. Large scale microwave technology also offers pre-treatment opportunities, supported by Eleanor Binner and John Robinson. Alex Conradie leads this process intensification and primary recovery capability. He brings expertise in the industrial application of both organoheterotrophic and chemolithotrophic fermentation at scale, both in fed-batch and continuous cultivation. Efficient process control is pivotal to this effort, underpinned by the world-class expertise of Mike George within Chemistry in NIR and Raman spectroscopy. The Beacon will establish core capabilities in subcritical and supercritical water, novel large laboratory scale bioreactors and continuous adsorption unit operations. Lead: Alex Conradie A state-of-the-art processing facility with flexible integration of various unit operations is fundamental for a continuous sustainable manufacturing technology platform. Heat integration and energy recovery across unit operations such as fermentation, adsorption, evaporators, distillation columns and crystallisers will give us the ability to continuously produce, at gram or kilogram per hour scale, products from renewable carbon feedstocks. This integrated continuous process development facilitates technology demonstration which de-risks processes for our industry collaborators. Alex Conradie leads the activity bringing industrial experience in the R&D, scale-up and technology transfer of these unit operations. In the context of this Beacon, one of our key competence areas is the development of sustainable chemistry based solutions that can add-value to the products of primary biological processing. Sustainable chemistry at the University is a multidisciplinary area of strength the involves academic colleagues that span the School of Chemistry, the Faculty of Engineering and the Schools of Biological and Life Sciences. The critical mass of researchers active in this field is in excess of 200 FTEs including academics, post-doctoral fellows and PhD candidates. The University hosts significant national investments including the Research England supported Centre for Sustainable Chemistry and the EPSRC-SFI Centre for Doctoral Training (CDT) in sustainable chemistry which seeks to provide integrated solutions that traverse the life science interface with chemistry and chemical engineering. World-class laboratories, including the GSK Carbon Neutral Laboratory (CNL) for sustainable chemistry, and state-of-the-art instrumentation support the development of sustainable chemical processes that satisfy the growing demands of contemporary society. Our Beacon will support the development of atom-efficient catalysis and energy resilient separations that employ environmentally sustainable solvents. Exemplar projects include the valorisation of terpenoid based biosynthetic platform molecules for application in the development of sustainable polymers and pharmaceuticals. Lead: Pete Licence We are seeking companies that need expertise in our research areas to collaborate with. We are also looking for talented researchers to grow our team."
        }
    ],
    "pdf_files": []
}