{
    "url": "https://www.nottingham.ac.uk/research/groups/neonataltranslationalmedicineandtechnologies/index.aspx",
    "content": [
        {
            "p": "The translation of fundamental science and engineering into newborn care is crucial if we are to reduce the significant global morbidity and mortality in this population. Led by Dr Don Sharkey, the group aims to undertake translational research studies to deliver innovative advances specifically developed for this vulnerable age group. The 2015 under-5 mortality rate was approximately 5.9 million children of which 2.7 million (45%) were in the neonatal period (first 28 days of life) with prematurity the leading cause accounting for 1.1 million. In developed countries, newborn survival is improving but subsequent morbidity such as brain injury and chronic lung disease (CLD) remain significant problems. If we can translate innovative technologies, specifically developed for newborn babies, and undertake neonatal clinical trials addressing major morbidities, such as CLD and brain injury, then children will stand a better chance of growing up and achieving their potential. There are a number of neonatal research domains that are particularly challenging to study, such as medical device development, and so can end up being neglected yet offer significant potential. We aim to tackle these difficult areas and so address important gaps in clinical care of newborns. Many technologies used in neonatal and paediatric care perform sub-optimally as they are adapted from adult clinical care rather than specifically developed for children. We seek to address this and develop technologies for children and babies where the greatest need is. Recent examples of this include the PaedCEW project which has explored the measurement of capillary refill time (CRT) and development of a novel device to automate this. The Gestation study aimed to use advanced image analysis and machine learning to estimate postnatal gestational age. It is hoped the smartphone App gestational age estimator could be used in low-middle income countries where good antenatal care is lacking to identify babies born prematurely and allow accurate epidemiological mapping of these births. Centralisation of neonatal intensive care necessitates the inter-hospital transfer of high-risk infants between centres. Inter-hospital transfer is not without risks and is associated with a worse neurological outcome. Many factors can contribute to this including the transport pathway itself. We are exploring new ways to improve the safety, comfort and outcomes of high-risk infants who require such transfers. Using a combination of approaches including big data analysis, better engineered neonatal transport incubators and appropriate virtual and animal models, we aim to reduce the gap between inborn and outborn outcomes. Our research is funded from a combination of UK Research funding bodies and industry allowing quick translation into clinical practice. The TRiP study is the latest clinical trial we are undertaking to reduce noise and vibration, improve comfort and safety in the ambulance environment. Newborn resuscitation, especially of the preterm infant, is challenging and uses medical devices developed for older children and adults. These devices may not perform as expected in this setting and often don’t address the very different environment of the delivery room or extremely preterm infant anatomy and physiology. We are developing medical devices to better monitor and manage high-risk infants at birth allowing better stabilisation and resuscitation. The most developed of these projects has resulted in a new heart rate monitor for newborn resuscitation with the University spin-out company SurePulse Medical Ltd. Highlighted as one of the top research priority areas relating to preterm birth, lung injury in preterm infants is a cause of significant morbidity and mortality. Our focus has been to look at the impact hospital acquired respiratory viruses can have in this population. Along with others, we have identified the previously under-recognised morbidity and additional resources associated with these infections. There are a number of strategies which have the potential to minimise the risks of exposure to viral pathogens on the neonatal intensive care unit which could improve respiratory outcomes for these infants. We are exploring this in more detail to define the size of the problem and design studies which could address these. PhD opportunities in the School of Medicine Centre for Healthcare Technologies Early Life Research Group The University of Nottingham Academic Child Health East Block, E Floor, QMC Nottingham, NG7 2UH telephone: +44 (0) 115 823 0611 email: childhealth@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}