{
    "url": "https://www.nottingham.ac.uk/researcher-academy/news/latest-news/taking-the-plunge.aspx",
    "content": [
        {
            "p": "As I validated and verified my shiny new analyser in my lab, I thought more about this renewed interest to pursue a PhD. My youngest, would be starting full time nursery and this seemed like the perfect opportunity to dip my toes into further education after quite a break. I was settled in my career as a registered professional and it seemed crazy to contemplate this. I enjoy challenges, not all though I must admit. I also enjoy adding to existing knowledge and interacting with open-minded people. My career in the Biomedical Sciences has taught me so much and I have more to give so Why not join the people contributing to the field? Finding a PhD suited to my needs as a mature student was not an easy task as there were many things to consider but I did persevere and on one late night, I came across the Amplify Mentor Scheme. This was offered by the University of Nottingham and it gave the chance for individuals especially minorities the chance to have a current PhD student mentor them. It sounded like a brilliant idea as I had no idea what to expect but then it was an opportunity to see what world exists on the other side. I went through my application several times with the finest of tooth combs and had friends and family give me tips and advice on the application. I was assigned a mentor after securing an interview and this is where I think it was brilliant to have someone who had been through the process. My mentor talked to me about the PhD process and life as PhD student We had several conversations and it was a great opportunity for me to find out if this was a journey, I was happy to embark on. I cannot say enough times how such a scheme proved useful to me as it gave me the will to push on. Sometimes you need a champion or cheerleader and this was it for me. After a successful interview, chaired by some wonderful academics, I was in! At this point, the enormity of my decision hit me and I wondered about the reality of it all. So far, I must say that the experience has been positive and with many highs! What has even been more thrilling to see, is the assistance available if needed. A few challenges such as time management and getting used to the many apps and networks has been a minefield but one, I have gotten used to. The field of academia is an intriguing one with so much talent and knowledge one can tap into. I have met people from all over the world working together brilliantly. Socially, this diverse environment is fertile ground to establish relationships and partnerships. Of course, more can be done to engage researchers from historically marginalized groups and it was pleasing to see the university’s efforts and that of some members of my cohort as well. Diversity from individuals does not stifle creation or should not be seen as a threat but rather, a means to an end where challenges can be approached from a different perspective which is certainly needed in research sometimes. A few months into my program, it was my turn to be a mentor and assist a potential applicant. It was a truly rewarding experience to inject confidence and assuredness into my mentee. In fact, my mentee had all it took and even more, so I was very thrilled when they got accepted into the program. Sometimes all that is needed for some individuals is a little nudge and for someone to show you that your glass is also half full. Taking on a new challenge can sometimes be daunting but there is no better place to try than in an environment where you actually MATTER! UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": []
}