{
    "url": "https://www.nottingham.ac.uk/research/groups/obstetricsgynaecology/index.aspx",
    "content": [
        {
            "p": "Obstetrics & Gynaecology at the University of Nottingham is working to address uncertainties in fertility, reproductive medicine, during pregnancy, ultimately to improve the health of mothers and their infants. --Professor Jim Thornton, Head of Academic Obstetrics & Gynaecology The importance of the health of mothers and their infants begins before conception, is critical throughout pregnancy and beyond. Our research is improving understanding of the mechanisms which underlie sub-optimal maternal and fetal health, detection of difficulties and evidence-based treatments to improve health. 1. Developmental programming 2. Reproductive Imaging 3. Perinatal trials Using the very latest wide-bore MRI scanning equipment at the University of Nottingham experts in the School of Physics and Astronomy together with Nottingham University Hospitals NHS Trust are leading a study to understand how the placenta ensures the right amount of oxygen and nutrients reach the baby in the womb. We have supported the creation of University spinout companies in gynaecology - N.G.D. Limited, Nottingham Gynaecological Devices and Nurture Fertility. Nurture Fertility provides a high quality clinical service in assisted reproduction techniques and a teaching and research base in this area, under the direction of Mr. James Hopkisson (NHS) and Associate Professor Dr Nick Raine-Fenning (UoN). Our research is published in leading peer-reviewed journals. See the individual publication records of our members for details. Assisted Reproduction Technology MMedSci More news There are no results that match your criteria. Events at the Division of Child Health, Obstetrics & Gynaecology Group members Our group is sited at the Queen's Medical Centre and the Maternity Unit at the City Hospital. The QMC site includes the reproductive physiology and biochemistry research facilities. The City campus is the focus for clinical trials and the research laboratories for late pregnancy studies. School of Medicine The University of Nottingham Queen's Medical Centre, D Floor, East Block Nottingham, NG7 2UH telephone: +44 (0) 115 823 1000 email:anne.whitchurch@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}