{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Wen-Li-Chan.aspx",
    "content": [
        {
            "p": "Media reports on suicide can sometimes increase the risk of imitative (copycat) suicidal behaviour, depending on how the story is reported. For instance, media coverage that is sensationalised, repetitive and contains explicit references to how and where the incident happened has been shown to increase the likelihood of subsequent suicides by vulnerable individuals. What is not commonly known is that stories which demonstrate positive coping and help-seeking can help to prevent suicide. Malaysia has guidelines for media reporting on suicide that are in line with the World Health Organisation recommendations. But, there is little awareness about these guidelines and the importance of responsible media reporting. A lot of work still needs to be done to bring about a significant change – not just within the media community but also amongst other stakeholders. To address this challenge, we are actively engaged in outreach activities such as seminars and events. I’m currently leading a multidisciplinary research project funded by the Ministry of Education Malaysia. We’re looking at how safe media reporting of suicide news can be implemented. Our team comprises researchers from various private and public higher education institutions and healthcare organisations from various parts of Malaysia, and has ties with experts involved with media engagement on suicide prevention in Hong Kong, Taiwan and Australia. My students will be conducting and analysing focus group discussions with media and mental health practitioners, media consumers as well as people with lived experience of suicidal behaviour in recovery. At the end of this project, we’ll be organising outreach and training workshops to further inform the relevant stakeholders on the impact of safe reporting of suicide news. My students will be an integral part of this effort. The rise in web-based platforms means that the boundaries between conventional journalism and citizen journalism are increasingly blurring. In fact, citizens are often able to report ‘breaking news’ more quickly than traditional reporters. This means that safe media reporting of suicide-related news needs to extend beyond the traditional sphere of media practitioners. When I first met those colleagues who would later become my research collaborators, I was at a conference for mental health practitioners as a layperson, speaking to clinicians about how my artistic hobbies helped my personal recovery. Just a year later, this brief interaction with the medical fraternity led to an interdisciplinary research collaboration opportunity. I’m grateful to have had the opportunity to develop my personal interests in mental health awareness advocacy into a research initiative that has the potential to effect a real-life positive change. While the ‘greatest moments’ that come to mind are in no way exceptional, I’m honoured to have had opportunities to share my work with influential people. Examples include a press conference on the importance of safe media reporting with the Deputy Minister of Women, Family and Community Development, YB Hannah Yeoh, and secondly being interviewed on national television during the C0VID-19 pandemic on a slot entitled ‘Mental Health – Prepared for the New Normal?’ Suicide is a complex issue, and suicide prevention goes beyond conventional medical treatment of mental disorders, with a need to involve other stakeholders including policymakers, and, in the area of safe media reporting, media practitioners. A research ‘career’ is a daunting word indeed, and I won’t pretend to have any answers to this question as I am still on an evolving path down this area myself! I would say, though, that your first steps don’t need to be huge, and you don’t have to have to be sure about ‘exactly what area you want to do research in’. Take a stab at opportunities that come your way, celebrate each milestone, reach out to and surround yourself with people who add value to your (research) cause, take things one step at a time; and with a reasonable dose of diligence, the big picture will (hopefully) fall into place eventually. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}