{
    "url": "https://www.nottingham.ac.uk/research/groups/dice/index.aspx",
    "content": [
        {
            "p": "Welcome to the Digital Innovations in Healthcare and Education (DICE) Research Group. Digital innovations such as exercise-based video games (exergames), gamified applications, e-learning resources, multimedia and other technologies are having a powerful impact on improving contemporary healthcare practice and education. Our work spans a number of intertwining themes as we engage with a range of multidisciplinary experts, including healthcare professionals, psychologists, computer scientists and the Health E-Learning and Media team. We also work closely with service users and patients to ensure our research always remains relevant to those who ultimately benefit from it. To discover how our research makes a real impact, explore our research themes. The DICE group carries out world-leading research to explore the skills and competences of the healthcare workforce in order to enhance training and learning. We are working with stakeholders and using co-creation principles to lead the online pedagogy and design of high-quality educational resources like RLOs, VPs and MOOCs. Our international research explores how new technology can improve the quality of health and social care. We live in a world of ‘big data’. Our research looks at how we can use that data to improve healthcare and education. Key research in this field contributes to the healthy ageing debate by exploring the role of exergames and the role the Internet of Things can play in education and healthcare. Heather is head of the DICE Research Group and Chair in e-Learning and Health Informatics. She’s also the academic lead for the Health E-Learning and Media group and has been principal investigator on many externally funded national and international projects on e-learning pedagogy, evaluation and research in health. Read more Discover the latest opportunities for PhD research in the field of digital innovations in healthcare and education. Follow us on Twitter The University of Nottingham School of Health Sciences Queen's Medical Centre Nottingham, NG7 2HA telephone: +44 (0)115 823 0909 email: heather.wharrad@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}