{
    "url": "https://www.nottingham.ac.uk/research/groups/breastsurgery/index.aspx",
    "content": [
        {
            "p": "Led by Professor John Robertson, the Breast Surgery research group’s aims are to improve the outcome of individuals with cancer. The group carries out a multipronged attack focusing on: The most common forms of cancer worldwide are lung, breast, colon, stomach, prostate and liver. For the first three early detection and treatment has now been shown in randomised clinical trials (RCT-Level 1 evidence) to significantly reduce mortality. This has confirmed the importance of earlier detection as a goal for all solid cancer types. Despite the fact that the clinical value of the three screening methodologies (i.e. CT scans, mammography and colonoscopy) have been confirmed; they also have their inherent limitations in terms of patient acceptance (e.g. mammography), potential side-effects (e.g. radiation or colonic perforation), expert staff requirements and cost. The reduction in deaths from these cancers due to screening has been calculated to be between 16% and 24%. There is therefore significant room for earlier detection and improved tests, which would save even more lives. In almost all individuals who develop cancer (of whatever type – e.g. breast, lung,) the process of carcinogenesis may take from many months to years (even 20+ years). As such the immune system has been shown to recognise different proteins at different times in the process and make autoantibodies to them. The sequence of autoantibodies to different protein in cancer cells, or the pattern of autoantibodies provides information, which is clinically important for early diagnosis and for patient stratification for therapy and prognosis. Current projects a) Following the success of the early CDT lung test, research is being further carried out in lung and other cancers eg hepatocellular, colorectal, breast etc. b) Research if being carried out in conjunction with the Immunology Division at QMC into new assay formats for detection of cancer c) Psychosocial aspect of early cancer detection tests is being investigated in collaboration with Professor Denise Kendrick and Associate Professor Kavita Vedara. The academic department of Breast Surgery has had a long-standing research interest in breast cancer in the elderly. We performed and reported two of the first randomised clinical trials on primary endocrine therapy versus surgery +/- adjuvant endocrine therapy. We reported the first of these in the BMJ in 1988 and recently reported long term follow-up on both these studies. Expertise Our research interests include breast cancer, surgery and non-operative therapies, endocrine and targeted therapies, lymphoedema and clinical trials. Mr K L Cheung is a member of the Surgical Task Force of the International Society of Geriatric Oncology. Specific research interests Results This research is already having a significant and positive impact on the outcome for individuals with breast cancer. Our early work on primary endocrine therapy, along with results from other trials, has led to many elderly patients with hormone receptor positive breast cancer having another therapeutic option. Current research on characterising the biology of breast cancer in elderly patients has also lead to more personalised medicine where individuals can be treated based on the biology of their tumour. Biology and clinical outcome, psychosocial aspects (including comprehensive geriatric assessment and quality of life), clinical and cost effectiveness of therapeutic strategies. The group has had a long standing interest in endocrine and growth factor therapies. We have been researching and publishing on markers which would predict sensitivity and resistance to hormone therapies since the late 1970s. Over the years resistance has been identified as de-novo (ie resistant from the start of treatment) and acquired (initially sensitive but subsequently develop resistance) and our group has published extensive on both areas. Our contribution in the later in terms of human breast cancer studies has been significant - this has been facilitated by many patients who have participated in studies where biopsies of their breast cancer have been taken on treatment and then examined for biological markers. This work has carried out particularly in collaboration with the Department of Academic Pathology at The University of Nottingham and with the Tenovus Institute in Cardiff. Based on the results of these studies which have shown various growth factor pathways altered and the new drugs being developed to target these same pathways our current research focuses on both endocrine and growth factor pathways. The group has ongoing work in prognostic and predictive factors in breast cancer. A spin-off company called FaHRAS has been established, which has developed a software programme for assessing a woman’s risk of developing breast cancer. The group has also had a long standing interest in blood tumour markers in breast cancer. In addition to our work on early detection we have also published extensively over 30 years on the use of blood markers in advanced breast cancer - help diagnosis and monitor treatments, particularly endocrine and growth factor therapies. Research in this area has led to a number of clinically significant outcomes. Initially with endocrine therapies clinicians looked to see the tumour decreasing in volume (ie ‘responding’) and if it didn’t they regarded this as ‘non-responsive’ and changed treatment. Our group showed that there were over half the ‘non-responsive’ tumours where the treatment stopped the cancer growing (ie ‘stable disease’) and that these patients did as well as those where the tumour resonded by decreasing in volume. This lead to approximately 40% of patients being continued on endocrine treatments (until the tumour actually started to increase in volume) and thereby the patients continued to benefit from the long term treatment with these endocrine agents. Our work has also led to improved selection of patients for endocrine and growth factor therapies based on clinical and biological characteristics. Research is continuing into the following areas: The Breast Surgery group has been involved in clinical trials of breast cancer over the last 30 years - including, surgery, endocrine and growth factor therapies, radiotherapy, immune-based therapies. Read more Current project Tumour-infiltrating lymphocytes (TILs) are involved in controlling tumour growth and metastasis in various cancers and whilst this is predominantly attributed to cytotoxic T-cells, recent findings suggest a potentially central role for TIL-B cells. TIL-Bs have been reported to be associated with favourable prognosis and improved patient survival in invasive ductal carcinoma (IDC) by ourselves and others, but have not been fully investigated in early disease. Our aims are to: This research at the University of Nottingham and international collaborations is already having a significant and positive impact on the outcome for individuals with lung cancer and the technology is translatable to all solid tumour types. Oncimmune, a university spinout company, has already launched the world’s first autoantibody test for the early detection of cancer. We have successfully developed a non-invasive blood test platform for the early detection of solid cancers. This bench to bedside research has been pursued in here for 17yrs and has delivered a world first diagnostic test - initially for lung cancer1-6 Our test (EarlyCDT-Lung) has been in clinical use in the USA since 2009 (following FDA oversight and CLIA lab approval). An audit of the results from over 1600 individuals in the commercial setting has confirmed that the test performs as predicted1. EarlyCDT-Lung is now in a major Randomised controlled Trail in the UK (10,000 individuals) to provide support for its introduction into a national screening programme. We are progressing similar tests for Breast Cancer7,8, Liver Cancer9 and Colorectal Cancer moving along the translational pathway to clinical utility. Two large prospective clinical trials are underway which the Centre of Excellence for Autoimmunity in Cancer (CEAC) has either initiated (US study, National Jewish) or is a partner in (Scottish study – 10,000 individual RCT) will also be impactful by providing level 1 evidence to include the test as an integral part of the national lung cancer screening programme. It will re-focus the screening strategy for other tumour types towards the autoantibody technology. The group’s research has led to a number of patents in this area. In addition to researching on tests for other types of cancer (eg breast, colon, liver) we are also working with colleagues in the Department of Immunology to develop a second generation of the autoantibody test using a different technology platform which we predict will be more sensitive and specific. Media coverage The clinical impact of this research has also been reported by various media: Breakthrough cancer bloodtest to be made available in the UK - Channel 4 We have established FaHRAS, which has developed a software programme for assessing a woman’s risk of developing breast cancer. Find out more about FaHRAS. Our research is published in leading peer-reviewed journals including PLoS One, Annals of Oncology, Thorax and Clinical Cancer Research. Details are available under members' profiles. More news Symposium on Primary Breast Cancer in Older Women PhD opportunities PhD opportunities are available to self/ government funded students with a particular passion for research in the above areas. Please get in touch if you require further information. Centre of Excellence for Autoimmunity in Cancer Group members The group is based on two sites--the Clinical Sciences Building at Nottingham City Hospital and within the Royal Derby Hospital. The University of Nottingham Royal Derby Hospital Uttoxeter Road, Derby, DE22 3DT telephone: +44 (0) 1332 724622 email:gem@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}