{
    "url": "https://www.nottingham.ac.uk/research/groups/animal-production/index.aspx",
    "content": [
        {
            "p": "Global consumer demand for animal products is predicted to increase significantly in the coming years with greater competition between animals and humans for feed resources, and growing concerns over the environmental impact of livestock systems. Our research accordingly covers all aspects of the efficiency with which animals utilise genetic and dietary resources. It also addresses issues of sustainable intensification with potential consequences for fertility, health and welfare of animals. Product quality now assumes great importance and the influence of diet on meat, milk and egg quality forms an integral part of this research theme. To promote efficiency (i.e. feed conversion efficiency, growth, milk yield and fertility) and product quality (i.e. meat, milk and eggs) of livestock production systems whilst minimising environmental impact through reducing nitrogen and methane output. In-house expertise in ruminant and non-ruminant nutrition, fertility and reproductive management, meat and milk compositional manipulation and product quality, animal behaviour and welfare, and environmental monitoring and modelling. Development of nutritional strategies to enhance fertility in high-yielding dairy cows. Low-cost repeatable technique for measuring methane emissions by individual dairy cows on commercial farms. Standardised apparent ileal amino acid digestibilities of co-products are now being used in diet formulations for large-scale broiler trials. Nutrition in Early Life Microbiology and food safety Biomaterials: Processing, properties, perception Nutrient gene interactions Nutrition and global food security Sensory Science Centre The University of Nottingham 203 South Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6054 email:julian.wiseman@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}