{
    "url": "https://www.nottingham.ac.uk/research/nrc/people.aspx",
    "content": [
        {
            "p": "Professor Praminda Caleb-Solly Academic Lead Professor Praminda Caleb-Solly is a Professor of Embodied Intelligence and the University of Nottingham academic lead for the NRC and joint lead for the NRC research theme Technology and Innovation. She holds a BEng in Electronic Systems Engineering, MSc in Biomedical Instrumentation Engineering and a PhD in Interactive Evolutionary Computation. Vicky Booth Assistant Professor, Faculty of Medicine and Health Sciences Dr Vicky Booth is the lead for University of Nottingham NRC research workstream. Vicky is a Clinical-Academic Neurological Physiotherapist, a NIHR/HEE ICA Clinical Lecturer (2020/23), Associate Chief Allied Health Professional for Research and Innovation at Nottingham University Hospitals NHS Trust, and Assistant Professor with the School of Medicine. Vicky qualified as a physiotherapist in 2005 and specialises in Neurology. Dr Emad Al Yahya School of Health Sciences Emad is the lead for the University of Nottingham NRC Education workstream. He is an Assistant Professor in Physiotherapy and Rehabilitation Sciences in the School of Health Sciences. Emad brings a wealth of experience to the role from developing the new MSc in Neurological Rehabilitation to developing and delivering rehabilitation teaching programmes across diverse regions, including Canada, Jordan, the UK, and the UAE. His exposure to different healthcare systems, cultural contexts, and educational practices has quipped him with insights into best practices and emerging trends in rehabilitation education worldwide. Paul Greenhaff Professor of Muscle Metabolism, Faculty of Medicine and Health Sciences Professor Paul Greenhaff is the University of Nottingham lead for the NRC research theme Prevention and Prehabilitation. He is a member of the Faculty of Medicine and Health Sciences and the Nottingham NIHR BRC at the University of Nottingham. His research interests centre around changes in body composition and the dysregulation of muscle fuel and protein metabolism in ageing, immobilisation, acute trauma and chronic disease. This research also has a focus on strategies (including exercise, nutritional and pharmacological interventions) to offset these negative and pathophysiological effects. Paul's research is primarily focused on the field of human integrative physiology/experimental medicine. Beth Phillips Professor of Translational Physiology Bethan Phillips is a Professor of Translational Physiology within the School of Medicine at the University of Nottingham and is based in the Medical School at the Royal Derby Hospital. As a management board member of the MRC-Versus Arthritis Centre for Musculoskeletal Ageing Research (CMAR) Beth is responsible for researchers training and development and patient and public involvement and engagement (PPI-E). Beth's own research focuses on the pathophysiology of musculoskeletal morbidities (sarcopenia, cachexia, arthritis, disuse, metabolic syndrome etc.) and interventions (primarily contractile strategies and/or nutrition) to mitigate their progression and consequences. Beth has also been involved in the application of OMIC technologies to discover predictors of, and the basis for, musculoskeletal and vascular decline in ageing and disease. Beth's future focus is aimed at investigating the mechanisms of, and developing predictors for, the heterogeneous metabolic and physiological improvements in responses to exercise-for-health interventions, including pre- and rehabilitation, and conversely, disuse or inactivity. Ruth Goodridge Professor in Additive Manufacturing (3D Printing), Faculty of Engineering Professor Ruth Goodridge is the University of Nottingham joint lead for the NRC research theme Technology and Innovation. She holds a BMedSc(Hons) degree in Biomaterials and PhD in laser sintering of bioceramics. Ruth is currently on secondment to the Nottingham University Hospitals NHS Trust, exploring clinical need for Additive Manufacturing (inc.3D-Printing) and looking at ways to bridge the gap between current technical capabilities and use in clinical practice. Michelle Hall Assistant Professor, Faculty of Medicine & Health Sciences Dr Michelle Hall is the University of Nottingham lead for the NRC research theme Acute Rehabilitation. She is a Physiotherapist by background and leads on a number of undergraduate courses. Her research focuses on the rehabilitation of musculoskeletal conditions including Osteoarthritis and following orthopaedic surgery. She is currently leading an NIHR funded study looking at arthrofibrosis following total knee replacement. Michelle collaborates closely with the Division Rheumatology, Orthopaedics and Dermatology and the Versus Arthritis Pain Centre on a number of research projects and supervises PhD students. Catherine Sackley Professor of Physiotherapy Research for the Faculty of Medicine and Health Sciences Professor Catherine Sackley is the University of Nottingham lead for the NRC research theme Rehabilitation for Long Term Conditions. She is a qualified physiotherapist and NIHR senior investigator. Her methodological expertise is in the evaluation of complex rehabilitation interventions using mixed methods. She has worked with people with acquired brain injury, long term neurological disease and musculoskeletal problems living in their own homes and care homes. Joanna Fletcher-Smith School of Health Sciences Dr Joanna Fletcher-Smith is an Honorary Associate Professor at the School of Health Sciences and is the University of Nottingham NRC co-lead for Rehabilitation of Long-Term Conditions. Joanna is an HCPC registered occupational therapist by professional background and currently Leads the Rehabilitation Case Management Service of a nationwide private company specialising in rehabilitation for traumatic brain injury and complex poly trauma. She is a Director of the Institute for Registered Case Managers and a Director of the Board of Case Management Society UK where she is Head of Research. She is an Associate Fellow of the Higher Education Academy and has contributed to post graduate teaching and supervision at the University of Nottingham. Michael Craven Engineering Dr Michael Craven is Principal Research Fellow in the NIHR MindTech MedTech Co-operative, based in the Institute of Mental Health on Jubilee Campus, specialising in technology research, design and evaluation in healthcare, currently focussed on mental health and dementia and more generally with medical devices and digital healthcare. He has over 30 years of research experience spanning healthcare, electronic engineering, computer science, health economics and is involved with several aspects of teaching & learning (lecturing, postgraduate supervision, course development). Donal McNally Head of Human Factors Research Group Professor Donal McNally specialises in injury and disease, the biomechanics of soft tissues including the spine and musculoskeletal soft tissues, the brain and cardiovascular system. His work spans in vivo and in vitro assessment of mechanical performance as well as computational and analytical modelling. He has applied the knowledge gained to the development and clinical delivery of medical devices including a total intervertebral disc replacement. Emily Crowe School of Psychology Dr Emily Crowe is a Research Fellow in the School of Psychology. Her research investigates how visual information is used to guide actions, using perturbation paradigms and motion capture to examine the mechanisms underlying these online corrections. With further interest in how the brain represents spatial visual information, assessments are made using the mappings between participant's own movements and that of a tool they are controlling to examine what spatial reference frames (i.e., egocentric or allocentric) are used to organise the incoming visual information. Bindi Brook Associate Professor, School of Mathematical Sciences, Faculty of Science Dr Bindi Brook's research focuses on the application of mathematics to medicine in close collaboration with clinicians and experimental biologist, in particular, to provide insight into inflammation and asthma, using multi-scale mathematical and computational models. Rachel Fyson Sociology and Social Policy, Head of School and Professor of Social Work, Faculty of Social Science Professor Rachel Fyson is currently Head of the School for Sociology and Social Policy, having joined as a lecturer in 2005. Her research interests lie primarily in matters relating to adult social care services, including: the tension between promoting individual choice and seeking to safeguard against avoidable abuse. Sarah Goldberg Professor of Older People's Care, Director of Research, Faculty of Medicine and Health Sciences Sarah Goldberg is Professor of Older Persons Care and Director of Research at the School of Health Sciences, University of Nottingham. Her research aims to improve the healthcare of people living with dementia and to provide healthcare professionals with the high level of knowledge and skills they need to effectively deliver this complex healthcare provision. Roger Knaggs Associate Professor, Faculty of Science Dr Roger Knapps is a clinical academic pharmacist with a long-standing special interest in pain management. Prior to his appointment at the University of Nottingham, Roger was an anaesthesia and pain management directorate pharmacist at Nottingham University Hospitals NHS Trust. His research focuses on analgesic use and clinical outcomes. He was the inaugural Chair of the United Kingdom Clinical Pharmacy Association pain management group and is President of the British Pain Society. Fiona Moffatt Associate Professor, Medicine and Health Sciences Dr Fiona Moffatt is a physiotherapist with clinical and research interests in rehabilitation. Her PhD focused on implementation science and service delivery. Fiona is currently the Director of Postgraduate Research for the School of Health Sciences. Steve Morgan Professor of Biomedical Engineering, Faculty of Engineering Stephen Morgan is Professor of Biomedical Engineering at the University of Nottingham. His research involves the development of smart medical devices incorporating optical fibre sensors, such as smart endotracheal tubes and wound dressings. Steve is a Royal Society Industry Fellow, and Director of the Centre for Healthcare Technologies, which brings together key stakeholders, capabilities and expertise to support the rapid translation of scientific discoveries into healthcare adoption. Kate Radford Professor of Rehabilitation Research, Faculty of Medicine & Health Sciences Professor Kate Radford is an occupational therapist with an interest in vocational rehabilitation (VR). Her current research involves trials to determine the clinical and cost effectiveness of VR interventions for people surviving stroke, major trauma and with inflammatory arthritis, studies to develop and evaluate VR interventions for MS, and post Covid and interventions to promote self-management and participation following brain injury. Kate leads the NIHR/Health Education England Pre-Doctoral Bridging Programme and is current lead for the Centre for Rehabilitation and Ageing Research and the Centre for Doctoral Training in Rehabilitation and Healthcare Research in the School of Medicine. Gary Winship Associate Professor in the School of Education Dr Gary Winship is the academic lead for the University of Nottingham NRC Patient and Public Involvement and Engagement Group. Course Leader for the MA Trauma Informed Practice, Gary has over 30 years' experience in clinical roles for the NHS. These include; consultant psychotherapist at Broadmoor and as a clinical governance reviewer for the Commission for Health Audit & Improvement (CHAIA). Gary has a long-standing interest in psychological trauma and trauma education and is currently convening the University Psychotherapy & Counselling Association (UPCA) research group. He is also a local representative for the NHS England Midlands Network of Access to Psychological Therapies. Jade Kettlewell School of Medicine Dr Jade Kettlewell is a Senior Research Fellow and NIHR Postdoctoral fellow within the Centre for Academic Primary Care. She has a broad range of expertise including major trauma rehabilitation, implementation of complex interventions, acquired brain injury, smart technologies and telerehabilitation. She is an Associate Fellow of the Higher Education Academy (AFHEA) and involved in several aspects of teaching within the Centre for Rehabilitation & Ageing Research, including postgraduate supervision and teaching. Her current research focuses on exploring communication across the major trauma rehabilitation pathway and has collaborated on different rehabilitation and service improvement projects in Australia and Brazil. Dr Matthew Attwood School of Medicine Dr Attwood is an Assistant Professor in Sports and Exercise Medicine at the Department of Orthopaedics, Trauma and Sports Medicine within the School of Medicine. His research specialises in sports injury surveillance, injury risk factor identification and injury prevention. A specialist in strength and conditioning and Physiotherapy, Dr Attwood developed the Activate warm-up programme for adult rugby players which has been adopted by World Rugby and rolled out globally. His current research focuses on sports related concussion and preventative strategies. Dominic O'Connor School of Health Sciences Dr Dominic O'Connor is Assistant Professor within the Division of Physiotherapy and Rehabilitation Sciences, School of Health Sciences. His areas of expertise are Clinical exercise physiology, cancer rehabilitation, and neuromuscular electrical stimulation (NMES). He is an American College of Sports Medicine (ACSM) certified exercise physiologist and cancer and exercise rehabilitation specialist (CanRehab). His current research interests include designing and evaluating prehabilitation and rehabilitation interventions for individuals with chronic disease. Richard Moss School of Health Sciences Dr Richard Moss is Assistant Professor within the Division of Physiotherapy and Rehabilitation Sciences, School of Health Sciences. His subject specialism is injury rehabilitation. Richard has been a member of the Executive Committee of the British Association of Sport Rehabilitators (BASRaT) since 2007, Accreditation Officer since 2010 and previously led the development of the BASRaT Certification Examination. Richard has also acted as the Subject Matter Expert (SME) as part of the International Arrangement (IA) for Athletic Training, Therapy and Sport Rehabilitation. Professor Pip Logan Professor of Rehabilitation Research Professor Pip Logan is a Professor of Rehabilitation Research, an Occupational Therapist and the National Institute for Health Research (NIHR) Senior Investigator. Pip's research is mainly concerned with rehabilitation within health services, with particular emphasis on the community."
        }
    ],
    "pdf_files": []
}