{
    "url": "https://www.nottingham.ac.uk/research/groups/create/index.aspx",
    "content": [
        {
            "p": "Comparing a Reusable Learning Object with face-to-face training for occupational therapists in advising on fitness for work. Contact: Project Lead: Dr Carol Coole Email: carolyn.coole@nottingham.ac.uk Tel: +44 (0)115 823 0590 The purpose of this study is to develop and compare methods of training for occupational therapists in advising on patients' fitness for work. We will develop a face-to-face group training programme (in Fit Note and Allied Health Professions Report completion) with a newly designed purpose-built on-line training. Online training will be created as a Reusable Learning Object (RLO). RLOs are small, discrete, self-contained web-based resources consisting of a mixture of multimedia elements such as audio, text, images and video. These aim to engage the user in interactive learning through the use of activities and assessments. We want to explore the acceptability and delivery of this intervention. This study is funded by a UK Occupational Therapy Research Foundation (UKOTRF) Research Priority Grant. This multicentre mixed-methods study is recruiting occupational therapists working in the NHS. It involves two distinct phases: A series of participatory design workshops approach will draw together the theoretical principles of the Fit Note and Allied Health Professions (AHP) Advisory Fitness for Work Report with a practical framework for online training development. A face-to-face group based training session will be developed in line with the online training. A multi-centre feasibility study (part 2a) will be conducted in which occupational therapists will attend either a face-to-face group training session or access the RLO to explore the acceptability and delivery of the intervention. During the second part of phase 2 (part 2b), all participants will complete the online training and complete a feedback form. Phase 1 You may be eligible to take part if you: Phase 2a Phase 2b Overall, the study will last 12 months. Phase 1 recruitment to start in December 2018 and Phase 2 is due to start in March 2019. @CREATE_study1 University Park Nottingham NG7 2RD +44 (0) 115 951 5151 research@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}