{
    "url": "https://www.nottingham.ac.uk/research/groups/microbiology-and-food-safety/index.aspx",
    "content": [
        {
            "p": "The microbiology of food systems: from pathogen survival to food ecosystems and enzyme biotechnology. Our work considers all aspects of food quality and safety, including the adaptation and survival of microorganisms to stresses imposed by the food chain, studies of the microflora within food products, and the study of microbial enzymes. Research encompasses molecular mechanisms of pathogen resistance, including environmental persistence and biofilms, and the microbial interactions controlling development of flora in food fermentations. Molecular approaches are used to study new approaches for decontamination, novel methods for evaluating disinfection and biocontrol methods, such as bacteriophage and bacteriocins. Our expertise lies in the application of molecular biology approaches to fundamental research on micro-organisms of importance to the food industry, and thereby to understand at a phenotypic and a genomic level, how microorganisms behave in complex environments. We use techniques such as phenomics, genomics and transcriptomics to relate microbial physiology to gene regulation and expression and to understand their environmental control. Metagenomics are used to examine the complex interactions in microbial populations and apply this to improve control of fermented food production. Synthetic biology expertise is directed at engineering microorganisms to make novel metabolites such as high value chemicals. The ‘blue’ aroma of mould-ripened cheeses like Stilton is influenced by the presence of yeast communities which enter the cheese fortuitously. Using a model system to investigate microbial interactions which occur during cheese ripening, yeast species were shown to affect the aromas produced significantly and thus impact on product quality. The University of Nottingham Food Sciences, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6163 email:christine.dodd@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}