{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Weang-Kee-Ho.aspx",
    "content": [
        {
            "p": "When people think about breast cancer research, they often think of someone in a white coat in a lab – but that's not the kind of work that I do. I am a statistician. My research uses statistics to answer biologically important questions. At the moment, my main focus is working out a better approach for breast cancer screening in Malaysia. My current research project brings together experts from the UK, Malaysia and Singapore to study whether combination of common breast cancer genetic susceptibility variants could be used to identify Malaysian women who are at higher risk of getting breast cancer. Unlike rare genetic mutations such as BRCA1 and BRCA2, which affect only a small proportion of the population, there are over a hundred of these common but tiny genetic variations that we inherit from our parents. Having one of these common genetic variations won’t really do any harm but inheriting a combination could cause a problem. Our research aims to find out which combination of these tiny variations could pose the most risk for some women. Asia is going to experience a drastic surge in breast cancer cases in the next decade, with a predicted increase of up to 50 per cent in Malaysia alone. The breast cancer survival rate in Malaysia is poor, particularly the number of five-year remission survivors, due to late-stage diagnosis. The current screening strategy in Malaysia is to encourage women to attend a mammographic screening every one to two years. However, we need to move away from the one-size-fits-all approach; to create a more personalised, patient-centred screening programme. After all, we know some women are at a higher risk of getting the disease and need to be screened at a younger age. Conversely other women may only need to be screened at a later age. Our work could contribute to an understanding of whether it is possible to target expensive mammography at women who are at highest risk of getting the disease. Targeting in this way would ensure more resources can be allocated to those women in the higher risk group. Our work is possible because it builds on research led by Professor Teo Soo-Hwang OBE of Cancer Research Malaysia, who has established the largest breast cancer study in Malaysia to determine the genetic and lifestyle determinants of breast cancer risk in Southeast Asian women. In collaboration with University of Cambridge, University of Malaya, National University of Singapore and University of Nottingham Malaysia, Professor Teo and her team are currently working on rare genetic mutations and lifestyle determinants that may be associated with elevated risk. Taken together, the collaborative research could produce a comprehensive model that can provide a score of breast cancer risk. We hope that since this score will give women a more accurate idea of their risk of getting the disease, it would raise their awareness of the disease and encourage them to be breast aware and motivate them to continue attending mammography screening. I am very fortunate to have met many mentors at different stages of my career and one of them is my collaborator and friend, Professor Teo Soo-Hwang, who has given me the opportunity to spread my wings in my current research. Then there is this sense of responsibility; if I am given the opportunity to contribute to society – to help Malaysian women fight breast cancer – then why not? Being able to contribute, be it big or small, to model development that can make a real difference to people's lives means the world to me. All of our research work is possible because of the contribution of a large team of donors, funders, doctors, scientists and participants of breast cancer studies. I believe that every little role we play add up to a greater sum. Together, to leave our children, our children’s children a future free of the fear of breast cancer, is an achievable ambition. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}