{
    "url": "https://www.nottingham.ac.uk/research/groups/criminal-justice-research-centre/members/index.aspx",
    "content": [
        {
            "p": "The centre is co-directed by Dr Vicky Kemp, Dr Jason Warr and Dr Javier Eskauriatza. Javier completed his LLB and LLM degrees at the University of Bristol (2008). He obtained his PhD from the University of Birmingham (2018) and he joined the University of Nottingham School of Law as an Assistant Professor in Criminal Law (2022). He is the Co-Director of the Criminal Justice Research Centre, and the Convener of the Criminal Law and Criminal Justice stream for the Society of Legal Scholars. Javier is engaged in the research of (i) the cultural criminology of organized crime (ii) the International Criminal Court (iii) post-conflict trials. Katy Brookfield is an ESRC funded doctoral researcher in the School of Sociology and Social Policy. Katy's research interests lie in gendered violence, in particular violence against women and girls. Her PhD looks at how modern developments in smart and digital technology are impacting on risk and safeguarding in cases of domestic abuse, using a mixed methods research design. Dr Clamp’s research focuses on the application of restorative justice within transitional settings, policing and the community. She is the author of Restorative Justice in Transition (2013), Restorative Justice in Transitional Settings (2016) and Restorative Policing: Concepts, Theory and Practice (2017, co-authored with Craig Paterson). She sits on the International Advisory Board for the International Journal of Restorative Justice, is Chair of the Board of Trustees for the Restorative Justice Council (since July 2018), academic advisor to the Derbyshire Criminal Justice Board and a member of the Restorative Justice Steering Group. Her new monograph series with Routledge entitled Contemporary Issues in Restorative Practices commissions monographs on topics at the forefront of the field. Sarah Doxat-Pratt is a Research Associate at the Institute of Criminology, University of Cambridge, working on the Inspiring Futures research project: a large-scale evaluation of the impact of arts projects in criminal justice settings. Her research interests include community arts, the experience of imprisonment, and desistance and reintegration. Sarah’s PhD, completed at University of Nottingham Music Department, explored the work of music projects in prisons. Subsequently, she worked on the Comparative Penology project at the Institute of Criminology, investigating the experience of imprisonment for male and female prisoners in England and Wales and in Norway. Amy’s PhD explores the environmental and ecological injustices as a result of localized ammonia air pollution from animal agriculture in rural Lincolnshire. By also exploring epistemological (in)justice, she intends to utilise knowledge and theories from the ‘global south’ in order to seek-out alternative ‘solutions’ and issues with current regulation at local levels. Amy’s general interests include green criminology, crimes/harms of the powerful, victimisation of non-human animals and decolonisation. Current involvements include organising the ENQUIRE annual conference, editor for the ENQUIRE blog and also a member of the Institute for Science and Society research centre. My research interests are in legal, political, and moral philosophy. In particular, I write about philosophical questions underlying the state's responses to crime. My book Beyond Punishment? A Normative Account of the Collateral Legal consequences of Conviction (OUP, 2019) examines whether burdensome legal measures imposed on people with criminal records can be justified. Other topics that interest me include how to assign accountability for mass crimes such as genocide, how to determine what forms of treatment are appropriate as punishment, and also the relationship between criminal law theory and political theory. I am interested in forensic psychiatry/psychology, secure settings, prisons, police welfare, health, sex crime, survivors, mental healthcare, offenders, and criminology theory. In addition to a PhD looking at the relationship between health, security and rehabilitation in contemporary imprisonment, I am currently working on projects including Wastewater-based epidemiology in custody, contact matrices and social mixing in custody and internal transmission dynamics in closed settings. Dr Matt Thomason is Assistant Professor in Law. His research utilises a mix of empirical, doctrinal, and theoretical methods, and focuses on how the rules of criminal evidence and procedure (particularly those concerning bad character) are navigated by barristers in real trials. He also has a keen interest in principles of criminalisation, and will be teaching an LLM course on the subject (starting 21/22). On the Undergraduate programme he teaches on Criminal Law, Criminal Evidence, and Criminal Justice and The Penal System. Dr Catherine Appleton is Senior Research Fellow at the School of Law, University of Nottingham. Her research and teaching focus on 'ultimate penalties' and the question of how societies respond to their most serious crimes. As part of her research fellowship, she is updating her global study on Life Imprisonment Worldwide. She joined the Board of Penal Reform International in 2020, works as an advisor to the United Nations Office on Drugs and Crime, is Senior Research Associate at the Centre for Research and Education in Forensic Psychiatry at Brøset in Trondheim, and is Co-Director of prisonHEALTH. Luc Chignell is a barrister at 1 High Pavement Chambers. He maintains a busy practice on the Midland Circuit and specialises in prosecuting and defending criminal cases before the Crown Court - including allegations of serious violence, firearms offences, fraud, money laundering and supplying Class A drugs. As a member of the Crown Prosecution Service Advocates Panel at Grade 3, he conducts jury trials in complex cases involving vulnerable witnesses and multiple defendants. He has similar experience representing defendants accused of offences such as modern slavery and rape. He has particular experience of prosecuting multi-handed cases listed for trial, as well as those involving vulnerable witnesses, disclosure queries and related confiscation proceedings. He has defended in complex cases of modern slavery and fraud as a led junior. Luc is happy to provide timely advice on legal and evidential issues and is keen to engage with clients on early preparation and case planning, where desired Membership is open to all academic staff and postgraduate students with relevant research interests within the school. Researchers in other schools and departments within and outside the University of Nottingham are also encouraged to become associated members of the centre. Those interested in finding out more about the centre's plans and activities or becoming a member should email cjrc@nottingham.ac.uk School of Law Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD +44 (0)115 846 6239 cjrc@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}