{
    "url": "https://www.nottingham.ac.uk/research/groups/giandliverdiseases/index.aspx",
    "content": [
        {
            "p": "The group of researchers at the Nottingham Digestive Diseases Centre (NDDC) aims to conduct international quality research relating to gastrointestinal and liver disease including clinical trials and population studies and to translate laboratory medicine and surgery into clinical interventions which improve the care and lives of our patients. We also aim to provide a focus and facilitate collaboration for GI and liver research throughout the University and local NHS institutions. Gastrointestinal and liver diseases are among the most important causes of death and suffering worldwide: Liver disease We are developing tests to detect liver disease at early stages and monitor the progression of disease using biomarkers and novel MRI techniques ( studies include the Nottingham Liver community study, MrKER study and 3CN) . We are translating advances in basic research into therapy for chronic hepatitis C and other chronic liver diseases. Gastric disorders Unexplained digestive symptoms after a meal are common and can be disabling with a major impact on a person’s quality of life. We are carrying out studies (e.g. GI Imaging) to help us to understand the cause of these “digestive” symptoms, provide a positive diagnosis of these conditions and, potentially, lead to new treatments. Perioperative sepsis Perioperative sepsis is a common cause of morbidity and mortality, especially in jaundiced patients. We are studying the adverse metabolic changes accompanying surgery and ways to ameliorate them. Find out more about our ongoing and completed studies. General Methodological Subjects >> More news PhD opportunities The Gastroenterology Journal Club meeting take place in the Refectory of the Post Graduate Centre at 08:00 every Friday morning. The NDDC and BRU Friday Lunchtime research seminars take place from 13:00. More events Group members The University of Nottingham E Floor, West Block, Queen's Medical Centre Nottingham, NG7 2UH telephone: +44 (0) 115 82 31090 email:nddcbru@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}