{
    "url": "https://www.nottingham.edu.my/Research/Research-groups/Smart-Manufacturing-group.aspx",
    "content": [
        {
            "p": "Malaysia seeks to boost its manufacturing sector through technology and digitisation, hoping to attract investment in high-tech industries. In particular, the national Industry 4.0 policy embraces a greater use of computer-integrated manufacturing and less reliance on capital and labour, to increase productivity. The Smart Manufacturing group is dedicated to supporting Malaysian manufacturing to revitalise the economy and support growth across the sector. We encompass a multidisciplinary team of established academics in mechanical, materials and manufacturing engineering, electrical and electronic engineering, civil engineering and computer science. Our major research strengths contribute to a number of United Nations Sustainable Development Goal, but especially Industry, Innovation and Infrastructure (goal 9). Over the years, we have proved our ability to solve technical problems for industry, developing new technologies and systems to give manufacturers a competitive edge. Our ambition and drive makes the Smart Manufacturing group a partner of choice for addressing system integration through smart materials, advanced manufacturing, autonomous systems, artificial intelligence, sensor technology, simulations. Our academic staff have recognised expertise in the following topic areas: We are working closely with the Dongguan University of Technology in China through our joint Doctoral Training Programme. We are also uniquely placed to benefit from our global expertise, including the Institute of Manufacturing [https://www.nottingham.ac.uk/ifam/index.aspx] at the University of Nottingham UK which has supported over 200 regional companies across the supply chain We’re always pleased to hear from commercial organisations and other universities with ideas for collaboration and requests for consultancy and contract research. For general enquiries: Director, Dr Lim Chin Seong, email: ChinSeong.Lim@nottingham.edu.my For research collaboration and business engagement enquiries: email: RKE.Hub@nottingham.edu.my telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}