{
    "url": "https://www.nottingham.ac.uk/research/groups/endocrinology/index.aspx",
    "content": [
        {
            "p": "Endocrine studies investigate mechanisms regulating oestrous behaviour and ovulation as well as progesterone production during early pregnancy. More detailed molecular studies elucidate cellular mechanisms associated with the control of reproductive processes such as the development of the corpus luteum from the ovulated follicle or the role that the embryo plays in controlling trophoblast elongation, a key stage in the maternal recognition of pregnancy in farm species. Further work focuses on the therapeutic role of supplementary progesterone in enhancing pregnancy rate (eg after embryo transfer) and the way in which factors such as the environment and disease can influence reproductive performance. The aim of this work is to develop a better understanding of the regulation of ovarian function and early embryo development and to quantify the adverse effects of external influences such as disease on these processes. This work aims to deliver the mechanistic insight that underpins the establishment of therapeutic approaches to improving reproductive efficiency in farm animals (in the context of the contribution of efficient livestock production to global-food security) and promote reproductive well-being in farm species. In-house expertise in reproductive endocrinology, non-invasive in vivo monitoring of reproductive function, in vitro culture and molecular analysis of reproductive tissues DairyCo Research Partnership (embedded reproductive theme underlying specific projects on nutrition and health of dairy cows). International collaboration with Jiangsu Academy of Agricultural Science (funding a two year post doc position) to study mechanisms involved in the regulation of bovine luteal function. Iraqi government funded PhD posts (two) looking at the influence of season and uterine disease on reproductive function in dairy cows. Stem cells Gamete biology Developmental Programming of Health and Disease Reproductive Biology The University of Nottingham 208 South Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6326 email:george.mann@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}