{
    "url": "https://www.nottingham.ac.uk/research/groups/plant-soil-interactions/index.aspx",
    "content": [
        {
            "p": "Plants in natural and agricultural systems are not only exposed to above-ground environments but are also at the mercy of fluctuations in belowground conditions. While soil is one of the Earth’s most precious resources underpinning the success of natural and agricultural systems, it is also one of the least understood due its considerable heterogeneity and complexity. The plant-soil system includes physical, chemical, and (micro and macro) biological components which interact and modify the composition and structure of localised-environments, in turn impacting on how they function such as soil’s ability for flood mitigation, carbon sequestration, and nutrient cycling. Climate change adds further pressure on these processes increasing the need for sustainable management practices. These challenges are currently being addressed by a multi-faceted research programme on ‘Soil and Plant Interactions’. Our research spans across several scales, from the root hair to the whole catchment and general research themes include: Key aims relate to closing research gaps in sustainable agri-environmental management supporting global food security priorities. Example projects include attempts to identify novel root architectural traits that underpin crop development and yield, optimising nitrate and water uptake efficiency, using our micro X-ray CT facility to link 3D soil structure to soil function and behaviour as well as rhizosphere biodynamics. Our interdisciplinary team comprises soil biologists, chemists and physicists who readily link with environmental modellers, climate change scientists and plant biologists. In addition to the global food security aims, our research is exploring the role of soil properties in urban gardens for carbon sequestration and nutrient cycling. We have recently shown that a move to zero tillage (no plough) agriculture can lead to a 30% reduction in greenhouse gas emissions (GHG) and global warming potential in addition to significant benefits for soil health. The reduced GHGs emissions are a direct result of the soil structure that forms over time under zero tillage which we visualised using X-ray imaging whereby carbon gets locked within the soil micropores (Cooper et al. 2021). The University of Nottingham Gateway Building, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6257 email:sacha.mooney@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}