{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Ching-Lik-Hii.aspx",
    "content": [
        {
            "p": "Dengue is a life-threatening viral infection, carried by the Aedes mosquito. With no specific cure, the disease could cause haemorrhagic fever that can prove fatal. The global incidence of dengue has grown dramatically in the last few decades particularly in tropical countries like Malaysia where weather patterns and urbanization are factors leading to increase in mosquito population. In some countries, papaya leaf juice is a traditional remedy used to treat dengue. It contains a bioactive ingredient called carpaine, which helps to stop internal haemorrhaging. My work aims to find the best way to preserve carpaine in the dried leaf and to also find the best method to extract carpaine from the leaf. This would keep the bioactive properties stable for a longer period of storage time. Conventionally, the leaf if used in dried form is usually dried under the sun or using a hot air oven, but this has limitations. We are investigating a combined pre-treatment and freeze-drying technique to process the leaf at low temperatures in a bid to prevent degradation during processing. We are also investigating how storage over prolonged periods affects the potency and stability of carpaine. We are still improving the method of extraction and testing different parts of the leaf including the stalks and also investigating how much carpaine is extractable from different aged leaves. If the combined pre-treatment and freeze drying technique can successfully preserve high amount of extractable carpaine, it will mark a big milestone in the treatment of dengue. We can then collaborate with pharmaceutical companies to develop a targeted medication. Time is of the essence to save a dengue sufferer's life, so we hope that the carpaine extracted from the leaf can be manufactured as either a fast-acting pill or a medicated syrup. It has the potential to reduce fatality globally, so it’s an exciting time to be involved in this research. If pharmaceutical industry wants to go for large scale carpaine production, I foresee a challenge in sourcing enough raw material, the leaf. Commercial papaya farms in Malaysia would want to keep the leaves for purpose of fruit production. You need to be curious about things happening around you and this should fire the imagination to push to find a solution. Keep asking questions along the way. I have two postgraduate students that are working in processing aspects of food and plant materials. One student is working on drying of kedondongfruit, which is an underutilised fruit in this country. And my other student is working on the extraction and preservation of carpaine from papaya leaf that can be used as a cure for dengue fever. I am interested to look at the processing of edible insects as an alternative food protein source. One of the areas that I’m starting to investigate is drying of mealworms that can be processed into dried powder and can be used as an ingredient in cookies, biscuits and meat products. It is a direction we should be looking if we want to ensure sufficient protein source to feed the ever-growing global population. The research I’m doing now is interdisciplinary; I need to gather expertise not only from engineering but also from bioscience and pharmacy. At the University I can share ideas and work alongside researchers from many fields that I find inspirational. It's great to be part of such a close-knit academic community. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}