{
    "url": "https://www.nottingham.ac.uk/research/groups/hlrg/index.aspx",
    "content": [
        {
            "p": "The Health Language Research Group (HLRG) is one of the UK’s largest initiatives in multi-modal research in the field of health care communication and language. Its members attract substantial and prestigious Research Council funding. In partnership with national and international research groups, the HLRG works across a variety of health care contexts, universities and college sectors. As such it brings together a unique combination of leading researchers from medicine, pharmacy, community health, nursing, psychology, sociology and linguistics, with the aim of advancing the quality of language and communication performance in the NHS. A distinctive aspect of this group is that several members have both clinical and linguistic expertise. As such the group is perfectly placed to conduct research that is clinically relevant and can be applied to real health care settings. This commitment is further advanced through a distance-learning MA in Health Communication that has been designed for busy clinical practitioners. Research in the HLRG synthesises both social and human sciences, with a strong focus on both qualitative and quantitative approaches such as discourse analysis, conversational analysis, and corpus linguistics. Corpus linguistics, which employs computational and statistical tools for the analysis of transcribed conversation can identify significant patterns of conversational behaviour or written language and extract these for further analysis by means of sophisticated concordance programmes. Our ethos is to develop new ways of investigating language and communication in health care, not least by using computational analysis as a diagnostic tool for further detailed qualitative study, and in formulating randomised controlled trials of language and communication performance. The latter is timely in light of the growing focus on robust evidence for practice in the UK’s NHS and elsewhere. Members of the HLRG have a prolific record of high-quality research publications. Visit the Publications page for full details of past and current work by HLRG members. The University of Nottingham Nottingham NG7 2RD telephone: +44 (0) 115 951 5899 fax: +44 (0) 115 951 5924 email: english-postgrad@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}