{
    "url": "https://www.nottingham.ac.uk/research/groups/agriculture-farm-systems-bioenergy/index.aspx",
    "content": [
        {
            "p": "Bioenergy research draws upon bio-economic modelling approaches to analyse the trade-offs between farm-level finances, net energy and greenhouse gas emisssions as a central theme of the BBSRC Sustainable Bioenergy Centre (BSBEC). Farm and farmer constraints and opportunities towards growing dedicated energy crops and using straw for bioenergy purposes and supply and contract preferences are being investigated. HGCA-funded work draws upon field crop experimentation, farmer survey, economic analysis and LCA approaches exploring the dual crop (food and fuel) potential of winter wheat varieties. Impacts on the environment and rural communities from Jatropha production and Anaerobic Digestion are further research areas. Bioenergy research integrates with the wider biofuel research within the School, the University and external universities and research organisations, to examine the farm-level issues and potential for biomass production from UK agriculture, and additionally the impacts of bioenergy production in developing countries. Bio-economic modelling approaches draw upon primary and secondary data sources, including those data derived from the Farm Business Survey (FBS) for England, associated FBS-survey approaches and farm-level surveys within Ghana. The group also draws upon expertise in field crop experimentation and associated analysis in addition to expertise in the design, implementation and analysis of farmer surveys. Farm Systems Assessment of Bioenergy – LACE, BSBEC (Wilson, P; Ramsden; Sparkes) Bioenergy from Wheat Straw – HGCA (Wilson, P; Sparkes) Environmental and Economic Analysis of Jatropha in Ghana (Ramsden; Wilson, P) Rural Efficiency, Economics and Risk Management Agricultural and environmental systems analysis Rural business research unit The University of Nottingham 332 South Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6075 email:paul.wilson@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}