{
    "url": "https://www.nottingham.ac.uk/research/groups/lccp/about-us.aspx",
    "content": [
        {
            "p": "The Centre for Literary Creativity, Community, and Place (LCCP) brings together researchers and creative writers in the School of English working on diverse aspects of literary history, criticism, and production, with a particular focus on the intersection of literature in all its forms with local, regional and national cultures. LCCP provides a hub for literary-critical and creative activities of staff and post-graduate researchers. Current research centres associated with LCCP include: We collaborate with researchers in allied fields within and beyond the University of Nottingham and foster connections with partners in the creative, cultural, heritage, and education sectors. In addition, we host a regular series of events throughout the year, including research seminars, public talks and performances, and master workshops with visiting creative writers. We work across a variety of research methodologies and practices to examine how all kinds of literary forms – be that a novel, a performance, a digital story, a manuscript – contributes to the formulation and formation of diverse cultures and communities. We investigate the compelling relationship between creative production and place: what role does a particular space, with its language, traditions, and history, play in the making and reception of a work of art? Conversely, in what ways does a work of art construct a sense of place and local and national identities? We research: creative writing; performance studies; text editing; book history; cultural geography; individual author studies; adaptations; collaborative digital humanities; and enhancing public understanding through citizen scholarship and cultural and heritage engagement. Many of our members are active participants in the literary culture of Nottingham, working with organisations such as UNESCO City of Literature, D. H. Lawrence Birthplace Museum, Writing East Midlands, Nottingham Contemporary, and many more. Some of our research interests include: Looking beyond the canonical and the metropolitan, our research recovers and re-interprets marginal and overlooked texts and authors, casting new light on familiar literary traditions. We explore the intersections of place, identity and literary culture at every level, enabling individuals and institutions to trace particular strands of local, regional and national literary histories. Our work with partner organisations translates our research into practice, providing intellectual and operational blueprints for the revival and preservation of regional heritages. The Centre for LCCP conducts outstanding and scholarly and practice-based research that has a positive and transformational impact on communities and the creative economy. We do this through: Trent Building University of Nottingham University Park telephone: +44 (0) 115 951 5910 fax: +44 (0) 115 951 5924"
        }
    ],
    "pdf_files": []
}