{
    "url": "https://www.nottingham.ac.uk/research/groups/nutrition-and-global-food-security/index.aspx",
    "content": [
        {
            "p": "Increases in the population and life expectancy over the next 40 years are predicted to result in a doubling in global food requirements. Furthermore, the economic development predicted in many highly populated countries, is likely to lead to increased demand for processed food, dairy produce, meat and fish. These changes in demand, set against a background of predicted climate change, present one of the biggest challenges ever faced by the world’s food production systems. The extensive expertise of researchers at the University of Nottingham, in both crop and livestock science, is being applied to the urgent need for novel and sustainable approaches to increased food production. Utilizing our expertise in biochemistry, physiology and molecular biology we are engaged in research associated with sustainable crop and livestock production, while maintaining the nutritional quality of such foods. Work includes: Study of underutilized plants as potential sources of nutrition for both direct human consumption and animal(including fish) feed. Optimising farm animal production while maintaining both nutritional and eating quality Reducing the impact of livestock farming on greenhouse gas emission and water usage Investigating barriers to reducing meat consumption and identifying alternative protein and micronutrient sources. Pig Feed Efficiency (BBSRC funded in collaboration with Zoetis). A Systems Biology –based project aimed at identify novel targets to increase efficiency in pig husbandry Control of Muscle Growth and Meat Quality in Sheep (BBSRC funded in collaboration with Pfizer Animal Health). Specifically looking at the impact of calcium on protein metabolism in sheep muscle FishPlus (In collaboration with Crops for the Future Research) – Investigating novel plant –based food for use in tropical aquaculture Early life nutrition Microbiology and food safety Animal production Biomaterials: Processing, properties, perception Nutrient gene interactions Sensory Science centre The University of Nottingham 31 North Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6120 email:andrew.salter@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}