{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Creating-new-horizons-for-cross-cultural-research-on-autism.aspx",
    "content": [
        {
            "p": "There is considerable social stigma about mental health and learning difficulties in Malaysia, and access to appropriate healthcare and special needs education have been limited. Although attitudes are changing, discrimination almost always stems from a lack of understanding. Our research is leading this contemporary issue in Malaysia and across Southeast Asia, with a focus on autism. Autism is recognised as a neurodevelopmental disorder. People with autism have difficulties in social interaction and communication, and they show repetitive behaviour and insistence on sameness. Most research on autism has been carried out in Western, developed societies. However, autistic traits might be interpreted differently in various cultures and societies. This means that diagnostic screening and interventions developed in Western societies might not be directly applicable in non-Western societies, such as Malaysia. Dr Marieke de Vries, Associate Professor in the School of Psychology, is exploring the way that people with autism think and behave, and how this interacts with culture. The work of Dr Wong Tze Peng, Assistant Professor in Special and Inclusive Education in the School of Education, has a strong therapeutic focus. She is creating practical solutions to address the recognised gap in education practices and interventions within Southeast Asia, since existing resources aren’t always directly transferable from Western countries. These are exciting new horizons for cross-cultural research. Dr Marieke’s work has shown that children with more autism traits and difficulties in executive functioning have a poorer quality of life and mental well-being. An additional challenge might be the stigma on autism, leading to less acceptance across society. Dr Marieke is passionate about raising public awareness to increase tolerance and acceptance. She’s well connected with leading centres across the country such as Oasis Place, Pertubuhan Perkhidmatan Intervensi Awal (PPIA), Ideas Autism centre, and Care2run. Moreover, her interdisciplinary collaboration on a smartphone App for children with autism with Dr Marina Ng (Associate Professor in the School of Computer Science) has led to an award winning paper at the International Visual Informatics conference 2020 (IEEE gold award). Despite Malaysia’s clear progress, Dr Marieke believes there’s still room for improvement. Here her work benefits from international collaborations with autism experts in the UK and the Netherlands. In fact, her future ambitions include extending the concept of the Netherlands Autism Register to enable large-scale data analysis and cross-national comparisons in Malaysia. Children with autism are often excluded from learning opportunities because families and teachers don’t adequately understand what their cognitive capabilities are and what they need to become effective learners. As a qualified speech-language therapist, Dr Tze Peng is driven by her twin passions for family-centred early language intervention and inclusive education. Her long-term goal is to restore children’s rights to learning and enhance their development. To achieve this, she’s working with families and teachers across ASEAN to develop and deliver culturally relevant education for children with autism. One of the highlights of her career so far has been to co-create an innovative series of short stories - The Story of Khamdy, a project with Dr Low Hui Min from Universiti Sains Malaysia. Initially these were developed as a free resource for teachers in Laos, but now they are accessible to everyone online via YouTube. This collaboration with Souphanouvong University and the HEAD Foundation (Singapore), as well as Universiti Sains Malaysia, was recognised with a Best Award in the Educational Technology and Pedagogy Category and Gold Medal in Invention and Innovation at the Malaysian Technology Expo 2020. These two early career researchers are marvellous ambassadors for the University of Nottingham Malaysia. They both bring a caring and compassionate approach to their research and actively engage with the wider community to bring impact to their work. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}