{
    "url": "https://www.nottingham.ac.uk/research/groups/cffp/index.aspx",
    "content": [
        {
            "p": "\"Our focus is research and training into the development of children, the influence of families on children and mental health, the causes of criminal behaviour and the prevention of crime.\" --Professor Kevin Browne, Director of CFFP We take a public health approach to investigating the causes and consequences of family violence, child maltreatment and serious crime. Our director of centre and programme directors are all HCPC-registered practitioner psychologists as well as experienced academic researchers. Our focus is on high quality research, which has a real impact on policy and practice. As practitioners and academic psychologists, we are dedicated to the development of evidence-based practice to prevent violence, abuse and neglect in individuals, families and communities. Our staff and students conduct research into the causes and consequences of offending behaviours, as well as evaluating risk assessments and interventions. We have a particular focus on early trauma and adverse experiences in childhood in order to understand the development of mental health problems, personality disorder traits and criminal behaviours. This informs health and social care for children, families and communities. We are also conscious that forensic psychology involves individuals who are often stigmatised. Through both quantitative and qualitative methods, we aim to understand and share the experiences of victims, offenders, service users and staff in forensic settings. We teach theory, practice and research to postgraduate students and trainees. Browne, K.D., Craig, L., Beech, A. & Chou, S. Eds. (2017). Assessments in Forensic Practice: A Handbook. Chichester: Wiley-Blackwell. Browne, K.D. and Jackson, V. (2013) Community intervention to prevent child maltreatment in England. Journal of Public Health, 35(3): 447-452. Chou, S. and Browne, K.D. (2016). The relationship between international adoption and institutional care in Romania and Lithuania. Child Abuse Review, 25(6), 444-453. Duff, S., Nampweya, M. and Tree, J. (2017). Why men undertake passion killings – The Namibian Context. Journal of Interpersonal Violence. doi.org/10.1177/0886260517718829 Duff, S., Wakefield, N., Croft, A., Perry, L. and Valavanis, S. (2017). A service for non-offending partners of male sexual offenders. Journal of Forensic Practice. 19(4), 1-8. Egan, V., Hughes, N., Palmer, E.J. (2015). Moral disengagement, the dark triad, and unethical consumer attitudes. Personality and Individual Differences, 76(1), 123-128. Egan, V., Cole, J., Cole, B., Alison, L., Alison, E., Waring, S., & Elntib, S. (2016). Can you identify violent extremists using a screening checklist and open-source intelligence alone? Journal of Threat Assessment and Management 3(1), 21-36. Green, K., Browne, K., & Chou, S. (2017). The relationship between childhood maltreatment and violence to others in individuals with psychosis: a systematic review and meta-analysis. Trauma, Violence, & Abuse, doi: 10.1177/1524838017708786. Henwood, K.S., Browne, K.D. and Chou, S., (2018). A randomized controlled trial exploring the effects of brief anger management on community based offenders in Malta. International Journal of Offender Therapy and Comparative Criminology. 62(3), 785-805. Turner, K., Bullock, L., Brown, K., Foulkes, K, and Thomson, L. (2016). Sleep Tight: An evaluation of a community based intervention on the sleep behaviours of young children. Journal of Health Visiting. 4(11), 572-578. Please see individual member's profiles for more publication details. At policy level, we are involved in multi-sector collaboration to prevent violence through prediction, assessment and treatment of victims and offenders. Nationally, we have links with: the Department of Health; Home Office; Ministry of Justice; NOMS; Police Services; Youth Justice Board; Health and Care Professions Council (HCPC); British Psychological Society (BPS); National Society for the Prevention of Cruelty to Children (NSPCC) and the National Offender Treatment Association (NOTA). At an international level, we advise the European Commission, UNICEF, World Health Organisation and the International Society for the Prevention of Child Abuse and Neglect (ISPCAN). In collaboration with the Institute of Mental Health (IMH) and Nottinghamshire Healthcare NHS Trust, the Centre developed the only nationwide professionally accredited Doctorate in Forensic Psychology (DForenPsy), with links to over 60 agencies around the British Isles. We also offer the opportunity to undertake research for the qualification of MPhil/PhD in forensic and family psychology and applied developmental psychology. Forensic Psychology DForenPsy Forensic Psychology Top-up DForenPsy Forensic and Criminological Psychology MSc What our students say CFFP blog There are no results that match your criteria. More news and events Email: forensic@nottingham.ac.uk Call +44 (0) 115 846 7898 Centre members telephone: +44 (0) 115 846 7898 email:forensic@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}