{
    "url": "https://www.nottingham.ac.uk/research/groups/tbdthc/index.aspx",
    "content": [
        {
            "p": "Digital technologies have started to greatly influence healthcare. Despite the range of areas in which new digital technologies could make a substantial contribution to enhancing health care access, quality, and service while reducing costs, the health system has been slow to invest in and embrace such technologies. But despite this slow investment trends, digital health is part of the future of health and the EU is observing that they will sooner or later require new and different skill sets within health professionals: but EU countries are still lagging. Project Period: 1/10/2018 - 21/7/2021 The project “Training Blueprint for the Digital Transformation of Health and Care” (TBDTHC) aims at increasing health professionals digital & soft skills in order to reduce the current existing gap between digital technology trends and their effective use in the health sector. The project targets health professionals (managers, doctors, nurses, pharmacists, etc.), Non-clinical and administrative staff of the health system, IT professionals working in and for the healthcare environment (including external technology solution providers). This means that it will positively affect regional and local health systems, clustering entities focused on digital technologies and – also – it will provide benefits (narrowing digital technologies and training) to educational and research stakeholders. The main results of the project will be: Available common method to understand digital technology trends and an available map of successful cases of digital health based working processes and related training methods, increased awareness level of healthcare system actors about digital technology trends at transnational level, increased knowledge of training providers about successful training methods adopted to introduce digital health solutions, identification of core skills needed to facilitate the adoption of digital solutions in the health sector, a flexible lifelong training Lab targeted to health professionals + online library, a consolidated team of training experts ready to follow up, an agreement on the Observatory structure and ownership. Intellectual Outputs will be mainstreamed through 5 interim Multiplier events disseminate project findings and 1 final multiplier event which will provide evidence of the training method and launch the permanent Observatory on Digital Health Soft Skills. The University of Nottingham Address line two Nottingham, postcode telephone: +44 (0) 115 XXX XXXX email: research-group-email@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}