{
    "url": "https://www.nottingham.ac.uk/research/groups/travel-cultures-network/index.aspx",
    "content": [
        {
            "p": "The network builds on an existing collaboration which began with the Travel Writing Reading Group, instigated by Jean-Xavier Ridon in 2009, which led in 2012 to an AHRC Networking grant for a project entitled “Re-enacting the Silk Road”. This project formalised involvement of four schools, which form the management group (Andrew Cobbing (History), Mike Heffernan (Geography), Scott McCabe (Business/Marketing) and Jean-Xavier Ridon (CLAS/French) The main purpose of the Network is to offer a space for exchange and reflection on questions concerning cultures and practices of Travel. To explore how controversies of Travel, including: At the same time, we aim to enable development in areas such as teaching and learning, local, regional and national engagement, including public, commercial and industrial engagement with a direct involvement of the touristic industry. It became evident to us that there is a widespread interest in travel cultures at the University of Nottingham. This interest comes from many different disciplines which involve diverse schools on the UK campus. From Politics to Business, Geography to History, Sociology to the Arts and Architecture, some really important research is underway which is exploring aspects of travel that have a direct impact on how we represent and understand our world. The network will organise regular seminars and workshops devoted to specific themes and allow us to invite prominent figures from international institutions working on various aspects of travel. In 2017, we started to address the question of hospitality and its connection with travel. What does it mean to be hospitable in a globalised world? From the broadest perspective this means social relations, new forms of sociality and how changes in international relations can modify our definition of hospitality in general. As such we investigated how new types of journey can produce different types of hospitality: from commuters to business travellers, from tourists to backpackers, from migrants to members of Diasporas, all those types of displacement are producing new forms of hospitalities. They force us to question conceptions of the ‘stranger’, how host-guest relationships are constituted and relational exchanges, including the transformations of space in which these exchanges occur. The COVID-19 pandemic immobilised most international travel, and severely restricted domestic travel. Yet, it also presented an opportunity to reconsider the scale of our travel practices, and consequently, our relationship with the world. With the increase in local forms of travel came revelations about our everyday spaces. What lessons can we learn from these ‘micro-travels’, including attitudes to sustainability, consumption practices, and leisure activities? How will these new forms of backyard adventures and staycations inform the cultures of travel as we enter the post-COVID era? Reenacting the Silk Road (Co-I’s Mike Heffernan and Jean-Xavier Ridon) The Travel Cultures Network joined forces with the Development Studies Association to present a series of seminars at the University of Nottingham. Inspired by this synergy, we were interested in fostering conversations on the theme of authenticity. Authenticity is a strongly debated concept in tourism and travel studies that is used to communicate a measure of originality, certification by experts, accurate representations, the quality of experiences, and even an existential state of Being. As such, it maintains a well-trodden path of academic inquiry related to topics of travel experience, cultural and historic representation and tourism marketing. However, the relations between authenticity and development are less frequently examined. For example, how does tourism development affect authenticity? In what ways is authenticity a factor in tourism development and in the way travel is being represented? Who has the power to authenticate place, culture and travel experiences? We are casting our net widely in regards to tourism development topics; they may include, but are certainly not limited to: We invited these speakers to consider the implications of authenticity for tourism development and travel discourses as they related to their own research interests. See our Events page for past activities. All colleagues from the University of Nottingham, or other universities interested in contributing, are welcome to join the Network. If you are interested in joining us, contact one of the co-organisers (below) or join us during one of our sessions. Jean-Xavier Ridon Scott McCabe Mike Heffernan Jillian Rickly Carol Zhang The University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 951 5871 email:jean-xavier.ridon@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}