{
    "url": "https://www.nottingham.edu.my/Research/Research-groups/Developing-Sustainable-Societies.aspx",
    "content": [
        {
            "p": "The world is changing and societies must be resilient to future climates, the pressures imposed by an ever increasing human population, and to dwindling natural resources. By bringing together academics from a wide range of disciplines – from the social sciences, engineering and the natural sciences – we address environmental problems in a truly multidisciplinary way, aiming to fully understand their root causes and use this knowledge to develop long term, sustainable solutions. We work on social, economic and environmental aspects of sustainability, with our research and policy development work aligned to specific United Nations Sustainable Development Goals (SDGs). Our work addresses SDGs related, for example, to improving health (goal 3), conserving terrestrial and aquatic ecosystems (goals 14 and 15), sustainable cities and communities (goal 11), responsible consumption (goal 2) and climate change (goal 13). Through our partnerships with major non-governmental organisations (NGOs), such as World Wildlife Fund and Department of Wildlife and National Parks of Peninsular Malaysia (PERHILITAN), along with companies such as Sime Darby Plantation, our work contributes to the conservation of tropical Asia’s rich and globally important biodiversity. We are particularly proud of the Management and Ecology of Malaysian Elephants (MEME) project which is developing an evidence-based approach to the conservation of elephants and the sustainable management of agricultural landscapes. We also work closely with experts in the Nottingham Geospatial Institute, a world-leading institute at the University of Nottingham’s UK campus specialising in spatial and location-based science and engineering, empowered by satellite positioning, remote sensing and integrated technologies. These links help us to provide insights into issues such as landcover change and the impacts of climate change on flooding in tropical Asia. Developing Sustainable Societies also looks inwardly to promote inter-disciplinary collaboration between disciplines in STEM and the arts and humanities. In particular, the Nottingham University Business School is a signatory to the United Nations Principles for Responsible Management Education (PRME) since 2008. The School’s Social and Environmental Responsibility Group brings together staff and students to drive sustainability-related developments and projects on the Malaysia campus and advises the University of Nottingham Malaysia on how to adopt sustainable practices across all of its educational and corporate activities. Via the Nottingham Malaysia ‘Water-Energy-Food Nexus’, we also work closely with colleagues from Future Food Malaysia and the Centre for Green Technology (CEGT) to addresses SDGs related to hunger (goal 2) and renewable energy (goal 7). Our experts are interested in working with commercial and non-commercial partners, policymakers and the media to make a real-world difference. We welcome all enquiries. For general enquiries: Prof Chris Gibbins (School of Environmental and Geographical Sciences), email: christopher.gibbins@nottingham.edu.my For enquiries about MEME: Ms Vivienne Loke (School of Environmental and Geographical Sciences), email: vivienne.loke@nottingham.edu.my For research collaboration and business engagement enquiries: email: RKE.Hub@nottingham.edu.my telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}