{
    "url": "https://www.nottingham.ac.uk/research/groups/environmental-pollution/index.aspx",
    "content": [
        {
            "p": "Environmental pollution is the introduction of contaminants into the natural environment that cause adverse effects. It is one of the most serious global challenges facing humanity and responsible for millions of premature deaths every year. Environmental pollution affects the current and future composition of our air, water and soil, and our research focuses on these mediums in different environments – from rural background sites to urban Megacities, across the globe. Our research uses different measurement techniques, laboratory experiments and modelling simulations to improve our scientific understanding of different environmental systems. We aim to improve the scientific understanding of the causes of poor air, water and soil quality. This allows us to develop mitigation strategies and effective policy measures for cleaner environments. We focus upon the sources, fate, impacts and remediation of important water and atmospheric pollutants through a combination of field measurements, citizen science, large chamber experiments, laboratory studies and numerical modelling. Our team focus on the effects of a wide range of environmental contaminants including plastics, pesticides, urban particulate matter, heavy metals, and volatile organic compounds (VOC). We use a range of specialist equipment (e.g., FTIR, stable isotope analysis, ICP-MS, GC-MS, PTR-MS) to investigate the connectivity between air, soil, and freshwater environments, with a focus to significantly enhance the knowledge and understanding of VOC and greenhouse gas emissions, and carbon loss pathways from soil and aquatic environments. An integrated Study of Air pollutant sources in the Delhi NCR (ASAP-Delhi, 2017-2022) (Dr Salim Alam) Provided an authoritative assessment of the sources, formation process and burden characteristics of air pollutants in Delhi. Dr Salim Alam Dr Liz Bailey Dr Sarah Cook Environmental change Figure 2. Dye trace experiments in a typical urban waterway to determine the dispersion of solute pollutants throughout the catchment, in Mumbai, India, 2019 The University of Nottingham Gateway Building, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6257 email:sacha.mooney@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}