{
    "url": "https://www.nottingham.edu.my/Research/Research-groups/Centres/CommunicationsCultures/Staff.aspx",
    "content": [
        {
            "p": "Zaharom Nain (2013). Rhetoric and Realities: Critical Reflections on Malaysian Politics, Culture and Education. Petaling Jaya, Malaysia: SIRD Publications. Pradip Thomas & Zaharom Nain (eds.) (2004). Who Owns The Media? Global Trends and Local Resistance. WACC/Zed: London/Penang. M. Richards, P. Thomas & Zaharom Nain (eds.) (2001). Communication and Development: The Freirean Connection. Hampton: New Jersey. Yut Moy, Leong (2013). 留学生文学賞 作品集 [Kindle版]: Red and White(赤と白) If・Wind(もしも・風) Shooting Star(流れ星) To N. S.(エヌ・エス へ) 株式会社デジハウンド (デジハウンド エルエルシー). Khoo, Gaik Cheng (2015). Syiok Sendiri? Independent Filmmaking in Malaysia. In: Doris Baltruschat and Mary P. Erickson, eds., Independent Filmmaking Around the Globe. Toronto: U of Toronto Press. 213-235. Khoo, GC and Julian C.H. Lee, eds. (2015). Malaysia’s New Ethnoscapes and Ways of Belonging. New York: Routledge. Duruz, Jean and Khoo, Gaik Cheng. Eating Together: Food, Space and Identity in Malaysia and Singapore. New York: Rowman and Littlefield, 2014. Ainslie, Mary and Blake, Linnie, 2015. Game Show horror and Ghost Game: Thai nationalism vs the Cambodian Undead. In: Blake, Linnie and Reyes, Xavier, ed., Digital Nightmares: Wired Ghosts, CCTV Horror and the Found Footage Phenomenon I. B. Tauris. 69-79. Ainslie, Mary J., 2015. Thai superhero Insee Daeng: the re-appropriation of a lower-class hero. In: Rayna Denison, Derek Johnston, Rachel Mizsei-Ward, ed., Not Just The American Way: Screen Superheroes in National, International and Transnational Contexts University Press of Mississippi. Ainslie, Mary J., 2015. The 2009 Malaysian Female Circumcision Fatwa: State ownership of Islam and the current impasse Women's Studies International Forum. 52, 1-9. Barker, Thomas, 2015. Sex on Indonesia's Screens. In: Sharyn Graham Davies and Linda Rae Bennett, eds., Sex and Sexualities in Contemporary Indonesia: Sexual Politics, Health, Diversity and Representations Routledge. 253-272. Barker, Thomas and Lee, Yuen Beng Adrian, 2015. Creative Industries Policy in Malaysia In: CAMDEN2: Trends in Culture, Arts and Media. Barker, Thomas, 2015. Questioning Film Nasional Available at: <http://cinemapoetica.com/en/questioning-film-nasional/> Tessa, J. Houghton, 2012. Land of the Long Black Cloud: Copyright Globalization and Viral Counterpublicity in Aotearoa New Zealand Journal of Broadcasting & Elelctronic Media. 56(4), 511-528. Tessa J. Houghton, 2012. A Thin Yellow Line: My experience as an observer at the Bersih 3.0 rally. Aliran. Available at: <http://aliran.com/9041.html> telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}