{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Sandy-Loh.aspx",
    "content": [
        {
            "p": "I work in plant-based vaccines and pharmaceuticals. I focus on innovative prevention strategies for dengue fever and avian influenza H5N1, which are diseases that are on the rise in tropical countries like Malaysia. My research aim is to develop a safe, and cost-effective vaccine for these illnesses using plant as a biofactory. A vaccine comprises proteins that stimulate an immune response to fight a disease. These proteins are produced in many different biological systems, such as yeasts, mammalian and insect cells. Plant system is an emerging platform for vaccines and therapeutics production. Certain advantages come with plant-based vaccines; cheaper production costs and the lack of animal or human pathogens make them safer. Our research team is also venturing ‘edible’ vaccines in plants which can be orally consumed by the patient. This is less invasive than an injection and you don't need trained medical staff to administer it. Professor Charles Arntzen from Arizona State University, USA coined the term edible vaccine. He’s the pioneer people working in this field and fired my interest many years ago. I started my research career by developing a vaccine against poultry viral disease. When I joined the University of Nottingham Malaysia, I taught in plant biotechnology programme. It changed the course of my research career, encouraging me to investigate plants and their potential as the next-generation vaccine platform. Upscaling of the bio production is the next step in our project, along with testing whether the antibodies raised by the vaccines in the animal models are protective or not against the intended viruses. We need to crack these problems before we can proceed to clinical trial. There is still a long way to go. Our project is interdisciplinary in nature. In addition, the plant biology methods we are using are well-established in the West but are just emerging in Asia. We are working closely with colleagues from Nottingham, together with molecular biologists, immunologists, virologists and biotechnologists from the John Innes Centre, UK and the Fraunhofer USA Center for Molecular Biotechnology. Locally, I have collaborations with a public university called Universiti Putra Malaysia and Monash University in Malaysia. For edible vaccines, we freeze-dry the leaf, grind it into a fine powder then transfer it into a capsule so it can be taken as a pill, orally. A good thing about freeze-drying is you can store the vaccine at room temperature and it maintains its protective efficacy. There is no need for refrigerated storage or cold chain transportation, which is particularly crucial in developing countries where electricity is scarce or unavailable. It eliminates injection hazards and hence is of utmost friendly for children vaccination. Alongside with the cost-effectiveness making the vaccine more affordable to developing nations, it definitely has the potential to save many lives. There are a few stand-out moments. I was the first female academic to be promoted to professor in the Faculty of Science, the University of Nottingham Malaysia Campus in 2015. I obtained a senior fellowship of the Higher Education Academy UK last year. And I’ve been selected as one of the Nottingham research leaders 2018. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}