{
    "url": "https://www.nottingham.ac.uk/research/groups/skin-integrity/index.aspx",
    "content": [
        {
            "p": "Welcome to the Skin Integrity Research Centre at The University of Nottingham’s School of Health Sciences. Our centre brings together researchers dedicated to preventing and treating illnesses that cause skin breakdown or damage. Through clinically focused research, we carry out studies locally, nationally and internationally in collaboration with clinical, academic and industry partners. The impact of our research in areas such as lymphedema, oedema, skin cancer and surgical site infections has led to improved patient care and changes in practice, as well as making a major contribution to international policies and guidelines. Our researchers care passionately about improving clinical practice and the lives of patients. To discover how our research makes a real impact, explore our skin integrity research themes. Leg and pressure ulcers are a huge drain on the NHS. Our research is developing novel treatments and informs commissioning services. Chronic oedema affects more than 140m people worldwide. We’re working internationally to get a clearer understanding of oedema and lymphoedema and how they can be better treated. SSIs take a long time to heal, cause considerable distress and are costly to treat. Our work informs guidelines that help prevent infections and ensure better care for patients. Skin cancer is the most common form of cancer. Our research has improved knowledge of the disease and changed international guidelines on appropriate treatments. Judith is head of the research centre and Professor of Adult Nursing. Her main research interest is surgical site infections and her work has shaped international health guidelines. Read more Discover the latest opportunities for PhD research in the field of skin integrity. The University of Nottingham Queen's Medical Centre Nottingham, NG7 2HA telephone: +44 (0) 115 823 0379 email: judith.tanner@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}