{
    "url": "https://www.nottingham.ac.uk/research/groups/ctccs/index.aspx",
    "content": [
        {
            "p": "Founded in 2011, the Centre for Translation and Comparative Cultural Studies brings together academic staff and postgraduate research students working in translation studies, comparative literature, and comparative cultural studies. The Centre’s research focuses on audio-visual and literary translation, cultural transfer, comparative intellectual and cultural studies, and comparative literature. Our approach is interdisciplinary. In addition to European comparisons, our focus is on Western-Chinese contexts. The Centre regularly runs or hosts conferences, workshops and external speakers. All our events are open to members of the public. Now available: Google Translate & Modern Languages conference videos Since the Centre’s launch in 2011, we hosted numerous conferences and events and welcomed many international scholars. Notable events have included: Dr Olivia Hellewell Dr Martyn Gray Klaus Mundt Comparative Critical Studies British Comparative Literature Association ARTIS (Advancing Research in Translation and Interpreting Studies) IATIS (International Association for Translation and Intercultural Studies) EST (European Society for Translation Studies) ITI (Institute of Translation and Interpreting) Providing a unique opportunity to listen to readings by the author and the translator and to witness the conversation between them, our ENCOUNTERS allow fascinating insights into the working relationship between the two and into practical as well as theoretical aspects of translation. See the Encounters webpage for more information about the series Staff at the Centre have been awarded external funding for a number of research projects. For details of other research projects currently underway, please see individual staff research pages. Information about book-length publications by the Centre’s research staff can be accessed through the links below. For details of other publications, please see individual staff research pages. Zeitgeist - How Ideas Travel: Politics, Cultures and the Public in the Age of Revolution, by Maike Oergel (De Gruyter, 2019) Subtitling African American English into French: Can we Do the Right Thing?, by Pierre-Alexis Mével (Peter Lang Oxford, 2017) Non-Professional Subtitling by David Orrego-Carmona, Yvonne Lee (Cambridge Scholars Publishing, 2017) Space and the Postmodern Fantastic in Contemporary Literature, by Patricia Garcia (Routledge, 2015) Translating Frantz Fanon Across Continents and Languages, by Kathryn Batchelor, Sue-Ann Harding (Routledge, 2017) Brecht On Theatre, by Marc Silberman, Steve Giles, Tom Kuhn (Bloomsbury, 2014) Email: Maike.Oergel-Dench@nottingham.ac.uk Twitter: @UoN_CTCCS"
        }
    ],
    "pdf_files": []
}