{
    "url": "https://www.nottingham.ac.uk/research/groups/diversity-and-inclusion-research-hub/diversity-and-inclusion-research-hub.aspx",
    "content": [
        {
            "p": "The Diversity and Inclusion Research Hub is an interdisciplinary platform focusing on groundbreaking diversity and inclusion research. It unites researchers by focusing on bringing about sustainable, long-term sociocultural change to our societies. The Hub aims to bring together researchers across the three campuses of the University, in Malaysia, China and the UK, who specialise in investigative research on issues of diversity and inclusion. By working together and building upon our existing strengths, we aim to make Nottingham an internationally recognised, interdisciplinary centre of research excellence, taking full advantage of the innovation that results from colleagues working at the interface of different disciplines. The Hub is currently led by Professor Louise Mullany, and it is governed by a steering committee of members from across all academic Faculties, along with members from supporting professional services. The D&I Hub is closely affiliated with the University’s Institute for Policy and Engagement. The Hub works in partnership with the Institute to identify key opportunities for D&I policy and practice, in order to create new research projects, work on research impact, and collaborating with governments and external stakeholders at international, national and local levels. Groundbreaking research investigating contemporary issues of equality and diversity is being conducted at our University on all campuses across all Faculties. The Hub operates around the following six key themes: Within these research themes, research expertise is clustered around the following D&I issues, which often intersect: Current Research Projects The Decolonisation of the curriculum project Disabling patterns of injustice in and through learning Naming resistance Professional Communication: Discrimination, Prejudice and Bias in Healthcare, Law and Businesses #getconsent: addressing sexual violence Female social entrepreneurship ‘Impostor Phenomenon’ in the workplace Trans-inclusive feminism LGBT youth identity and policy and transgender health Sexual health education Dr Hongwei Bao, Associate Professor in Media Studies, School of Cultures, Languages and Area Studies, Faculty of Arts Pain at Work Disability, Entrepreneurship, Innovation Menopause, a hidden health concern, and the workplace Dementia Disability in Education and at work in China Mental disability and law STEMM Change: Uncovering Barriers to Inclusion and Transforming Institutional Culture ReMEDI project: reverse mentoring and organisational change Religion, age and sexuality Gender and ethnicity in leadership in education EDI and the geographies of economic practice The inclusive strengths of a diverse cluster: EDI in Organisational Behaviour / Human Resources Management (OB/HRM). Building systemic EDI Citizen Science: an inclusive approach to science EDI and Education EDI and Education across income groups Africapitalism, Corporate Governance and gender Gender, a priority driver in the ODA Gender and Leadership Women and the Media Neurodiversity and education Neurodiversity and culture Disability and the workplace The Asia Research Institute policy briefs The future: collaboration and enhanced impact The University of Nottingham Address line two Nottingham, postcode telephone: +44 (0) 115 XXX XXXX email: research-group-email@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}