{
    "url": "https://www.nottingham.ac.uk/research/groups/cancerimmunotherapy/index.aspx",
    "content": [
        {
            "p": "The aim of this group is to study the alterations in cancer antigens and exploit these in the development of therapies. These antigens can be used to stimulate the immune system by generating vaccines against the target and also highly specific antibodies that can be home to tumours and stimulate multiple arms of the immune system to kill tumours. --Professor Lindy Durrant, Chair of Cancer Immunotherapy Cancer is the leading killer. As the population ages and lifespans increase the incidence of cancer will rise. Developing succesful therapies that can halt progression or cure cancer is a major goal of governments in the developed world. Nottingham has had over 30 years of immunotherapy experience, taking a number of these into clinical trials and establishing a SME University Startup (Scancell). We generate novel Monoclonal antibodies (Mabs) to tumour antigens and utilise these for characterisation of the antigen, identify the role of the antigens in cancer progression and develop novel vaccine strategies for pre-clinical and clinical development. Our close proximity to the clinic and pathology services provide excellent opportunities to bring novel therapeutics to the clinic. We have successfully delivered both vaccines and antibodies into clinical trials for cancer treatment and have recently established the Nottingham University Therapeutic Antibody Centre (NUTAC). Succesful targeting of cancer requires identification of novel antigens that are unique or restricted to cancer cells. We have identifed a number of these and developed a range of techniques that enables us to characterise their role in cancer development. We then evaluate these antigens as potential therapeutic targets. We have developed strategies for evaluating antibody and or vaccine development. This has succesfully led to the development of two therapeutic strategies that have been taken forward for clinical development. Current projects Antibodies generated in Nottingham targeting colorectal cancer have been licenced and are in clinical trial. (Reference: SC104/CEP-37250/KHK2804) The University startup, Scancell Ltd., run by Professor Lindy Durrant, has developed a DNA vaccine strategy which is in Phase I trials in Melanoma (Trial reference: SCIB1 http://clinicaltrials.gov) Our research has been published in leading peer-reviewed journals such as PLoS One and Clinical and Experimental Immunology. See more publication details under members' profiles. Cancer Immunology and Biotechnology MSc The group offers great oportunities for dedicated individuals wishing to develop a career in Cancer Immunotherapy. Research projects can be offered in Therapeutic antibody development, antigen characterisation, T reg costimulation and pathological characterisation of cancer. Find out more about postgraduate research at the School of Medicine Group members The University of Nottingham Nottingham City Hospital Nottingham, NG5 1PB telephone: +44 (0) 115 82 31863 email:lindy.durrant@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}