{
    "url": "https://www.nottingham.ac.uk/research/groups/early-life-nutrition/index.aspx",
    "content": [
        {
            "p": "A number of factors experienced in early life have a profound impact upon health and well-being in later life. Among these is maternal nutrition, and our work has shown that fetal exposure to maternal undernutrition or obesity can programme increased risk of high blood pressure, renal disease and impaired glucose homeostasis in adulthood. These effects can be transmitted to further generations. The window of opportunity for adverse or positive nutritional programming is wide, encompassing early childhood. Understanding how early nutrition can have lasting effects upon health and disease is of major importance for public health. Our aim is to characterise the relationships between nutritional exposures during fetal life and infancy, and the subsequent development of metabolic and cardiovascular health. A key target is the identification of mechanisms that underpin these relationships. The particular expertise of the group lies in the use of established animal models to examine the mechanistic basis of early life programming of health and disease. Other work takes a nutritional epidemiological approach to evaluate dietary and behavioural aspects of health in prospective cohorts, and uses systematic review methodology to frame key research questions that can be studied using an integrated human: animal approach. MAGIC: Understanding the factors which determine post-partum weight retention in pregnant women. (Judy Swift, Simon Langley-Evans) The epigenetic basis of intergenerational programming of cardiovascular and renal disease. (Simon Langley-Evans) Weaning and obesity: Understanding the relationships between timing and type of foods used in weaning and childhood obesity risk (Simon Langley-Evans) The individual response to nutrition and risk associated with nutritional-factors are a product of cumulative exposures across the lifespan. However, the impact of earlier events can be reversed by appropriate interventions targeting specific processes, for example optimising the epigenome through folic acid supplementation during fetal life. Microbiology and food safety Animal production Biomaterials: Processing, properties, perception Nutrient gene interactions Nutrition and global food security Developmental Programming of Health and Disease Reproductive Biology Sensory Science Centre The University of Nottingham 57 North Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6139 email:Simon.Langley-evans@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}