{
    "url": "https://www.nottingham.ac.uk/research/groups/healthofolderpeople/index.aspx",
    "content": [
        {
            "p": "The aims of this research group are to conduct internationally significant applied health research that leads to improvement in the health and well-being of older people with frailty, and to produce a sustainable critical mass of researchers in the field. --John Gladman, Professor of the Medicine of Older People Life expectancy has risen and continues to rise across the world but the last few years of life, whether people spend them in their sixties or nineties, are typified by complex health problems due to multiple physical and psychiatric pathology, disability, social disadvantage, and vulnerability to physical and social challenges. Rehabilitation approaches are typically used to optimise the health of these people, mixing elements that restore health and elements that help adapt to health problems. The health and social care costs in this phase of life represent the majority of such costs incurred in the entire lifetime. Making this phase of life one in which people can affordably live with dignity and meaning is, and will remain, a major global challenge. Tackling this issue requires skills drawn from a wide range of research disciplines ranging from those required to develop new interventions, to those required to put them into practice. Our research focuses upon hospital and community clinical interventions, and uses a wide range of research methods. Co-production and collaboration with clinicians and researchers in the NHS is encouraged. To find out more about our research, take a look at some of our studies past and present. Professor Rowan Harwood, Consultant Geriatrician and Professor in Geriatric Medicine, talks about the Promoting Activity, Independence and Stability in Early Dementia (PrAISED) research study. More news from the Division of Rehabilitation and Ageing PhD opportunities East Midlands Research into Ageing Network (EMRAN) Medical Crises in Older People (MCOP) Group members School of Medicine Medical School, QMC The University of Nottingham Nottingham, NG7 2UH telephone: +44 (0) 115 8230239 email:john.gladman@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}