{
    "url": "https://www.nottingham.ac.uk/research/groups/cct/index.aspx",
    "content": [
        {
            "p": "The Centre for Critical Theory and Cultural Studies offers a friendly environment in which researchers, cultural practitioners, activists and others interested in the exercise of critical thinking can work together to develop research, organise intellectual encounters, exchange ideas, and facilitate the generation of collaborative approaches to theory production. The Centre places an emphasis on the rigours of traditional scholarly research and on the importance of situating ideas, concepts, and theoretical frameworks within the intellectual and material framework – the histories and geographies - of culture. At the same time, the Centre seeks to facilitate the engagement of critical thinking with practices, histories, and traditions that fall outside of the sometimes narrow remit of scholarly expertise. The Centre’s work privileges critical approaches to thinking that move beyond academic interdisciplinarity. Its work in key areas of research interest - Sensory Studies, Ecologies and Aesthetics, Institutional Analysis, the Critical and the Clinical - exemplify an understanding of theory that emphasises the importance of its transversal links with the present. In addition to current areas of research interest, members of the Centre for Critical Theory and Cultural Studies and associated researchers have broader interests and expertise in the following areas (in no particular order): Neither Use Nor Ornament: A Cultural Biography of Clutter and Procrastination Tracey Potts Sensory Studies Our work in the area of sensory studies aims to advance sensory approaches to research with an especial focus on methodologies, practices, and histories. Sensory research starts from the premise that social, cultural and political events and situations register experientially: they communicate themselves as much through diffuse sensations as they do via codes, messages and rational processes. The sounds, colours, tastes, smells and feel of things thus play a vital role in shaping the way we interact with and attune ourselves to cultural and social environments. Following a series of talks, symposia and a two-day conference in 2013 (‘Sensing Change’), the Nottingham Sensory Studies Network was formed to provide a focused space for sensory researchers to meet and share ideas and methods. Nottingham Sensory Studies Network website Ecologies and Aesthetics A broad area for current investigation in the Centre concerns the relationship between ecologies and aesthetics, both understood in the broadest possible sense. A concern with ecologies was central to the summer school recently organized by the Centre in conjunction with Nottingham Contemporary, which explored thinking in the ecological register across the mental, the social, and the natural. How aesthetics – in the broad sense of sensory experience – can be worked with as a component in generating critical responses to environments whose toxicity is felt as much in the subjective domains of affect, ideation or feeling, as in nature in the ordinary sense of the word, is central to research being done in this area. Institutional Analysis and Anti-Psychiatry The much maligned and largely misunderstood fields of institutional analysis (in France) and anti-psychiatry (in the UK) are central to ongoing research that addresses the histories and legacies of a rich set of critical practices that challenged both psychiatric and psychoanalytic dogmas about mental health. Starting from a focus on the work of Félix Guattari and figures associated with institutional psychotherapy (Jean Oury and François Tosquelles in particular), the project aims to explore the contemporary theoretical and practical value of work the impact of which was as significant beyond the immediate sphere of the clinical as it was maligned and misread. 'Noise in a Tropical Underground: Global and Situated Aesthetics in Experimental Music on Java', Sanne Krogh Groth (7th November 2018): As part of the Centre for Critical Theory and Cultural Studies' research strand on Sensory Studies, we welcome Sanne Krogh Groth from Lund University in Sweden where she is an associate professor in musicology. Her research explores historiographic, aesthetic, political and institutional issues within the fields of contemporary music, electronic music, sound and performance art in the 20th and 21st Centuries. In this talk, which takes place in room B4 of the Trent Building at 5pm on the 7th of November, she will discuss global and situated aesthetics in experimental music on the Indonesian island of Java. 'Internet Celebrity: Understanding Fame Online', Crystal Abidin (24th October 2018): In support of the Digital Cultures Research Network, we welcomed Dr Crystal Abidin all the way from Deakin University in Australia where she is a Lecturer in Communication. Dr Abidin is a digital anthropologist and we invited her to give a talk about her most recent book, Internet Celebrity: Understanding Fame Online which takes a truly global perspective on viral stars, meme personalities and 'influencers' on social media. The Nottingham-Dublin Lacanian Studies Series, Geert Hoornaert (20th October 2018): The penultimate meeting in the Nottingham-Dublin Lacanian Studies Series saw Geert Hoornaert, a psychoanalyst who teaches at Ghent and works at Le Courtil, taking us through his reading of Lacan's fifth seminar based on the concept of the 'sense of life' during the workshop in the morning. In the afternoon, Geert offered constructions of three cases which showed how flexible and adaptable psychoanalysis needs to be in the diverse institutional spaces in which clinical work takes place today. The Nottingham-Dublin Lacanian Studies Series, Martine Coussot (22nd September 2018): For the fourth instalment of the Nottingham-Dublin Lacanian Studies series we invited Martine Coussot, who is a psychiatrist and psychoanalyst based in Poitiers in France, to offer her interpretation of chapters 15-19 of Lacan's Seminar V, entitled Formations of the Unconscious. Her reading took us from Lacan's revisions of the notion of the phallus to his clinical observations about the 'masks of the symptom'. In the afternoon, three clinical cases presented by practicing psychoanalysts were discussed. The Centre works in collaboration with an international advisory board and extensive wider membership. We welcome the participation of researchers, creative and cultural practitioners, activists and writers, and engaged, critical individuals both inside and outside academia in any of the Centre's activities. There are no results that match your criteria. @Critical Theory Critical Moment Blog The University of Nottingham University Park Nottingham, NG7 2RD email:critical-theory@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}