{
    "url": "https://www.nottingham.ac.uk/research/inspiring-people/df/benford-steve.aspx",
    "content": [
        {
            "p": "This GRT is potentially very broad, encompassing those who conduct research into digital technologies and also those who do research through them. I think that the biggest opportunity – but also challenge – for us at Nottingham is to be able to join these up. Can we better connect our talented computer scientists who are developing enabling technologies to the many other talented researchers in disciplines that might benefit from, while in turn shaping and driving them? I see the Horizon Digital Economy Research centre as being an important meeting place for all of these researchers and an enabler of inter-disciplinary collaborations through its Centre for Doctoral Training and substantial impact funds. My role in this? Agent provocateur – to bug people to the point that they desperately want to start talking to each other rather than listen to me! Somewhere on the fringe I hope. After all, that’s where the new interesting stuff is happening. Our team in the Mixed Reality Lab is developing computing techniques to mix the digital and physical worlds. Back in the day (the 1980s) many folks envisaged that humans would be living in a virtual reality cyberspace by the 21st century. However, rather than seeing the digital world of the internet as something separate from our physical experience, our lab is striving towards interfaces that more deeply connect the digital – media, data and computation – to the physical – materials, artefacts and even our own bodies. My personal interest lies in applying these kinds of interfaces to creativity, working with artists and performers to explore new expressive combinations of the physical and digital. This involves creating, touring and then studying public performances and installations that demonstrate future possibilities while also revealing profound challenges for human-computer interaction. It has potential importance to everyone. Digital interactions are increasingly interleaved with all aspects of our lives. One way or another, we spend a vast amount of time interacting with computers (even if we aren’t always aware it). Rather than using traditional personal computers – or even today’s mobile devices – we need to look forward radical new forms of more embodied and material interactions that are contextually appropriate, engaging and deeply fulfilling – especially ones that respond to the fundamental human need for – indeed, right to – self-expression. It will help deliver new kinds of interactive cultural experiences. As with conventional art, these will enrich our lives, deliver moments of profound – even sublime – emotional engagement and provoke us into seeing ourselves and the world anew. Other than being appointed GRT (Global Research Theme) lead, you mean? (I know a trick question when I see it). The most exciting times are moments of invention – the first time you conceive of a new concept or when a colleague shows you something new that they have just made. Never ever trust anything that you read on a blog. Why, in spite of being computer scientists, we are demonstrably unable to fix the internet at home? It’s a serious point. Digital technologies are so widespread and open that everyone is an expert to some degree. How can computer scientists keep up and communicate the deeper challenges to a highly computer literate audience? On the upside, there is perhaps no other field in which we can engage \"users\" (a horrible term for people but better than \"meatbags\" that I have heard used on occasion) in our research. Participatory design methods are a wonderful consequence of this openness. Anyone for participatory nuclear science? The reasons that I love working at Nottingham (I can genuinely say that – this is my 27th year here) is our openness to new ideas and approaches. I have always found Nottingham to be incredibly open to unusual approaches. This was especially true early on when I enjoyed great freedom to explore unusual agendas. Of course at that point the Computer Science department was just six of us in a Portakabin so there wasn’t really anyone else around to put a stop to our mischief anyway – but I hope that the pioneering spirit still persists. Surely we all agree that computers and the internet were the single most important inventions of the 20th century? They were certainly the most surprising – who at the start of the century had really anticipant the global hivemind that appears to be emerging? The ramifications are huge for everybody. Who won’t be intimately engaged with computers in nearly every aspect of their lives in the future? Global Research Theme Digital Futures Read Steve's full profile Steve Benford is the Director of the Beacon Smart Products and Professor of Collaborative Computing in the Mixed Reality Laboratory at the University of Nottingham. He holds an EPSRC Dream Fellowship and is the Director of the EPSRC-funded Horizon Doctoral Training Centre in Ubiquitous Computing. He is also a Visiting Researcher at Microsoft Research Cambridge and was the first Visiting Professor at the BBC in 2012. University Park Nottingham NG7 2RD +44 (0) 115 951 5151 research@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}