{
    "url": "https://www.nottingham.ac.uk/research/beacons-of-excellence/propulsion-futures/publications/index.aspx",
    "content": [
        {
            "p": "Beacon members Dr Begum Tokay and Prof Neil Champness feature on the front cover of CrystEngComm with paper entitled 'Synthesis of MIL-53 thin films by vapour-assisted conversion'. The thin-film synthesis technique developed will allow wider applications of MIL-53 and other metal-organic framework structures as coatings and sensors. Read full article >> Dr Graham Newton and co-authors have described the synthesis,structures and magnetic properties of a new family of iron complexes with redox-active organic ligands in Dalton Transactions. The complexes showed contrasting switchable magnetic properties, dependent on their ligands. The results show how we may be able to manipulate the spin of molecular switches using secondary stimuli such as electric field. This type of system may have applications in future high density data storage. Read full article>> Dr Darren Walsh co-authored a publication describing the opportunities offered by ionic liquids for the development of high-performance electrolysers that could be used to generate hydrogen fuel by splitting water. Such work could have implications for how we sustainably generate hydrogen for future transportation systems. Nature Chemistry: Imaging defects and their evolution in a metal– organic framework at sub-unit-cell resolution Lingmei Liu, Zhijie Chen, Jianjian Wang Daliang Zhang*, Yihan Zhu, Sanliang Ling, Kuo-Wei Huang, Youssef Belmabkhout, Karim Adil, Yuxin Zhang, Ben Slater, Mohamed Eddaoudiand, Yu Han https://www.nature.com/articles/s41557-019-0263-4 Nature Communications: Direct band-gap crossover in epitaxial monolayer boron nitride C. Elias, P. Valvin, T. Pelini, A. Summerfield, C. J. Mellor, T. S. Cheng, L. Eaves, C. T. Foxon, P. H. Beton, S. V. Novikov, B. Gil, G. Cassabois Nature Communications volume 10, Article number: 2639 (2019) doi.org/10.1038/s41467-019-10610-5 Materials: High-Temperature Molecular Beam Epitaxy of Hexagonal Boron Nitride with High Active Nitrogen Fluxes Cheng TS, Summerfield A, Mellor CJ, Khlobystov AN, Eaves L, Foxon CT, Beton PH, Novikov SV. Materials (Basel). 2018 Jun 30; 11(7) doi.org/10.3390/ma11071119"
        }
    ],
    "pdf_files": []
}