{
    "url": "https://www.nottingham.ac.uk/researcher-academy/news/latest-news/blog-'life-beyond-the-phd'.aspx",
    "content": [
        {
            "p": "When I arrived at Cumberland Lodge, I was apprehensive after having spent 18 months working from home because of COVID-19. However, my worries quickly dissipated. I was enthused by everyone chatting and sharing their experiences of carrying out doctoral research during the pandemic. After getting settled into our rooms, we met to start the opening sessions of the conference. I was so impressed by my room; it was such a peaceful setting. I immediately felt relaxed, I knew I could get my thoughts together and decompress at the end of each day. The opening talks were fantastic. Dr Rowena Bermingham discussed her work in the value of policy engagement. This generated a healthy debate amongst the group and the passion of the next generation of doctoral researchers stood out. Professor Lionel Trarassenko joined us virtually from Reuben College, University of Oxford. I was inspired by the excerpt he shared with us, “the world is not made of disciplines. Disciplines are only lenses which we use to examine the world”, it reminded me of the first publication I wrote about how we all have unique backgrounds and experiences. By the end of his presentation, Professor Trarassenko had neatly illustrated the importance of interdisciplinary working… and of course the Oxford-AstraZeneca vaccine was mentioned as his office is below the lab where it was developed. Our last speaker of the afternoon was Karen Walker, a careers advisor from the University of Oxford. Karen spoke about the pros and cons of staying in academia and the reality of academic work. Everyone wanted more of Karen’s expert advice, so it was great that she spent the whole week with us, providing 1:1 career sessions and tips on CV writing. In our skills sessions we talked about various communication skills and were introduced to a range of techniques for sharing our research using different styles to suit different audiences. Chances are, if you’re a postgrad student, you may have sat through similar content already. However, this is the first time I have come away with a clear plan to put what I have learnt into action, and I am very excited about that. I also picked up some valuable top tips from fellow delegates, such as freewriting and setting daily writing targets, which will be a big help as I embark on my final year of my PhD. I have never learnt about the science of cooking oils, innovations in drug administration, and cognitive developmental psychology, all in one day. In the morning, we were split into 5 groups and presented to one another. A top presenter was chosen from each of the 5 groups, and that person was required to present again to the whole of the conference delegation. There was so much talent in one room, and I was humbled when my presentation was chosen as the best of our group. In the afternoon, I presented again and came third overall. It was an affirming process, especially seeing so many hands up after my presentation, and people catching up with me afterwards to find out more about my research. Everyone commented on how I had made the topic relatable to them – I took the audience with me on a journey. It was a great feeling to know that I had been able to communicate my work to a non-specialist, international audience. How could we pitch a museum to engage with the history of British Colonialism? Our group proposed ‘The Restitution Museum’. The idea was for a digital museum whose mission was to return artefacts to their countries of origin and document their histories and journeys home. Each group had to pitch to their proposal to a panel of experts, the aim was to acquire funding for their museum idea. This was a very serious and controversial topic but also such fun too! The various perspectives, skills, and personal backgrounds each added something unique to the pitch. Working together, we accomplished so much in such a small amount of time. We were lucky to have a filmmaker on our team and our digital creation was astoundingly good. The audience were blown away by our promotional video - it was such a good feeling. After our museum pitches, we explored Windsor Great Park. Later, we got dressed up for our final evening… a grand dinner with drinks reception. On our final morning we listened to economist, writer and broadcaster Professor Linda Yueh talk about what life beyond the PhD has been like for her. Take home message, ‘anything is possible!’ If you are a PhD student in the UK, I would highly recommend this event. Attending Cumberland Lodge has opened my eyes to the value of doing a PhD and has put things into perspective for me in terms of my future prospects in the job market. I also now understand much more about how important collaboration is in bringing about positive changes to benefit society and culture. I came away with a renewed sense of where I am going and what I need to do to get there. I am so grateful to have met so many likeminded individuals, all doing unique (and totally amazing) things. After a week at Cumberland Lodge, and spending time with such a brilliant group of scholars (in person!!), I am feeling much more confident and hopeful about my life beyond the PhD. The setting was dreamy, my room was wonderful, and the food was to die for! I have felt very privileged to be a part of it all. I would like to thank the Researcher Academy at the University of Nottingham for funding my place at this fabulous event. Definitely a highlight of my PhD journey so far. UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": []
}