{
    "url": "https://www.nottingham.ac.uk/researcher-academy/people/victoria.sedman",
    "content": [
        {
            "p": "Research Repository All Output Person Project OUTPUTS 46851 PEOPLE 3835 FACULTIES, SCHOOLS & GROUPS 328 PROJECTS 0 The Repository@Nottingham is intended to be an Open Access showcase for the published research output of the university. Whenever possible, refereed documents accepted for publication, or finished artistic compositions presented in public, will be made available here in full digital format, and hyperlinks to standard published versions will be provided. See our Policies for further information. Research Outputs People Faculties, Schools & Groups Research Projects Remote Monitoring of the Impact of Oil Spills on Vegetation in the Niger Delta, Nigeria (2025) Journal Article Kuta, A. A., Grebby, S., & Boyd, D. S. (2025). Remote Monitoring of the Impact of Oil Spills on Vegetation in the Niger Delta, Nigeria. Applied Sciences, 15(1), 1-24. https://doi.org/10.3390/app15010338 The widespread oil extraction in the Niger Delta and the impacts on different types of vegetation are poorly understood due to lack of ground access. This study aims to determine the impact of oil spills on vegetation in the Niger Delta using a Lands... Read More about Remote Monitoring of the Impact of Oil Spills on Vegetation in the Niger Delta, Nigeria. Plasma and urine pharmacokinetics of long-acting injectable omeprazole following intramuscular administrations to healthy Thoroughbred horses Short running title: Pharmacokinetics of long-acting injectable omeprazole (2024) Journal Article Harding, C., Viljanto, M., Hincks, P., Habershon-Butcher, J., & Paine, S. W. (in press). Plasma and urine pharmacokinetics of long-acting injectable omeprazole following intramuscular administrations to healthy Thoroughbred horses Short running title: Pharmacokinetics of long-acting injectable omeprazole. Journal of Veterinary Pharmacology and Therapeutics, Omeprazole is a gastric acid secretion inhibitor used as an effective anti-ulcer drug. Based on oral administration studies, its International Screening Limit (ISL) was established in plasma and urine at 1 ng/mL with a Detection Time (DT) of 48 hours... Read More about Plasma and urine pharmacokinetics of long-acting injectable omeprazole following intramuscular administrations to healthy Thoroughbred horses Short running title: Pharmacokinetics of long-acting injectable omeprazole. Elective peri-operative management of adults taking glucagon-like peptide-1 receptor agonists, glucose-dependent insulinotropic peptide agonists and sodium-glucose cotransporter-2 inhibitors: a multidisciplinary consensus statement (2024) Journal Article El-Boghdadly, K., Dhesi, J., Fabb, P., Levy, N., Lobo, D. N., Mckechnie, A., Mustafa, O., Newland-Jones, P., Patel, A., Pournaras, D. J., Clare, K., & Dhatariya, K. (in press). Elective peri-operative management of adults taking glucagon-like peptide-1 receptor agonists, glucose-dependent insulinotropic peptide agonists and sodium-glucose cotransporter-2 inhibitors: a multidisciplinary consensus statement. Anaesthesia, Introduction Glucagon-like peptide-1 receptor agonists, dual glucose-dependent insulinotropic peptide receptor agonists and sodium-glucose cotransporter-2 inhibitors are used increasingly in people receiving peri-operative care. These agents may be... Read More about Elective peri-operative management of adults taking glucagon-like peptide-1 receptor agonists, glucose-dependent insulinotropic peptide agonists and sodium-glucose cotransporter-2 inhibitors: a multidisciplinary consensus statement. Can pathophysiological lung function markers guide the use of postnatal corticosteroids for bronchopulmonary dysplasia? (2024) Journal Article Kwok, T. C., Manley, B. J., Roehr, C. C., & Sett, A. (2024). Can pathophysiological lung function markers guide the use of postnatal corticosteroids for bronchopulmonary dysplasia?. Pediatric Research, https://doi.org/10.1038/s41390-024-03682-7 Stochastic simulation modeling of the economics of providing additional living space for housed dairy cows (2024) Journal Article Thompson, J. S., Hudson, C. D., Huxley, J. N., Kaler, J., & Green, M. J. (2024). Stochastic simulation modeling of the economics of providing additional living space for housed dairy cows. Frontiers in Veterinary Science, 11, https://doi.org/10.3389/fvets.2024.1473696 The housed environment for dairy cattle is of critical importance to their health, wellbeing, and productivity. Lack of space is an important factor for housing quality assessment due to links with increased likelihood of disease. A recently publishe... Read More about Stochastic simulation modeling of the economics of providing additional living space for housed dairy cows. Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}