{
    "url": "https://www.nottingham.ac.uk/research/groups/rural-efficiency-economics-and-risk-management/index.aspx",
    "content": [
        {
            "p": "The REERM research group focuses on national and international aspects of agricultural and agri-food chain business performance, effectiveness and risk management. The group hosts the Rural Business Research Unit (RBRU), the lead unit of Rural Business Research (RBR) academic consortium that undertakes the Farm Business Survey (FBS) research programme funded by Defra. The impact of managerial behaviour and actions on business performance is a central research focus. Efficiency and efficacy of agriculture, agri-food businesses and organisations is complemented by work on uncertainty and approaches to managing risk. Managing risk and achieving efficient production requires business planning. The Rural Efficiency, Economics and Risk (REERM) group provides policy-relevant data and analyses to enable increased understanding of the key performance drivers affecting efficiency, performance and stability of rural businesses and agri-food firms. The group draws upon data derived from the Farm Business Survey (FBS) and associated additional primary data relating to farm-level energy usage, environmental activities, water practices and business management activities; these large scale surveys are also supplemented by in-depth case-study or postal survey approaches. Applied econometric and farm-level mathematical modeling techniques and expertise are the key analytical approaches utilised within the group. Rural Business Research – the Farm Business Survey [FBS] (Wilson, P) Technical Efficiency and Credit Control Efficacy in Saudi Arabia (Wilson, P; Ramsden, S.J.) Productivity, efficiency and climate change impacts in Malaysia (Ramsden, S.J.; Crout N.) Farm Systems Assessment of Bioenergy Agricultural and environmental systems analysis Rural business research unit The University of Nottingham 332 South Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6075 email:paul.wilson@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}