{
    "url": "https://www.nottingham.ac.uk/research/groups/physical-mathematical-veterinary-medicine/index.aspx",
    "content": [
        {
            "p": "The scientific fields of Physics and Mathematics are inextricably linked to those of Biology and Medicine at all scales. From the long-standing use of electromagnetic radiation in diagnostics or the use of Maths and Physics to model processes in diseases such as cancer or healthy tissues such connections are evident. In spite of this, however, the exploration of whether Physics, together with Mathematics, can be fully employed to solve medical conditions is still in its in fancy. This exploration is central to the Philosophy of PhysMathsVetMed, and we strongly believe that the blending of Biology and Medicine with Physics and Mathematics will provide unified theories and technical innovations that will be reusable by our industrial partners and academic collaborators. The PhysMathsVetMed Group differs from other interdisciplinary groups for two main reasons: Papillae of the coronary corium. Cells from these structures proliferate to create the hoof capsule. The unique architecture of papillae allows the establishment of a growth stress. Emily Paul (MRes; Funding period: 2014/2015; Funder: Weston Award) \"As an Applied Biology graduate with a passion for horses, I had never considered the important role that Physics could play in bettering the understanding of equine laminitis – my long-standing desire. When I started my MRes I had very little knowledge of Physics, and it soon became apparent to me that this was a great shame and a substantial limiting factor for those with any involvement in biological research. Physics and Biology can, in fact, simply be regarded as different ways of looking at the same thing. As a novel viewing angle necessarily adds another dimension, it is the combination of Physics with Biology which is able to provide elucidation on matters which would remain obscure with one discipline alone. The lack of inter/trans-disciplinarity is, I feel, born from the fear of Physics which is typically instilled in one from a young age, as it is often described as difficult and abstract, or even incomprehensible. Very few people get the opportunity to learn about both Biology and Physics in any depth, and even fewer then have the chance to apply these in the veterinary field. I feel extremely privileged in this respect and, through my involvement in this project and with the invaluable support of the PhysMathsVetMed people, I am learning a great deal more than I ever thought possible about both these scientific disciplines, about the horse, and about myself and my own capabilities\" Mohammed Cherkaoui (PhD; Funding period: 2012/2015; Funder: Vertex Pharmaceuticals): “As an applied mathematician and physicist, I have always been attracted by true interdisciplinary studies. However, very few places allow you to do both Maths/Physics and Biology and push you to think and go the extra mile. The PhysMathsVetMed Group is doing exactly that: it provides support where you need it the most and pushes you to think holistically. It is a unique experience anyone ought to try to open horizons and career perspectives”. The PhysMathsVetMed Group Research spans across different fields including: Current Industrial Collaborators: Vertex Pharmaceuticals (http://www.vrtx.com/) and Waltham (http://www.waltham.com/). Funders: Vertex Pharmaceuticals, Waltham, BBSRC. There are no results that match your criteria. The University of Nottingham School of Veterinary Medicine and Science College Road, Sutton Bonington, LE12 5RD telephone: +44 (0) 115 951 6451 email:cyril.rauch@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}