{
    "url": "https://www.nottingham.ac.uk/researcher-academy/wellcome-biomedical-vacation-scholarships/index.aspx",
    "content": [
        {
            "p": "Offered in partnership with the University of Nottingham, the Wellcome Trust’s Biomedical Vacation Scholarships are designed to provide promising undergraduates from underrepresented groups, the opportunity of hands-on research experience during the summer vacation, with the aim of encouraging them to consider a career in research. Paid at the national living wage, the eight week projects provide undergraduate students with professional experience and support their future applications for postgraduate study and research jobs. With support from one of our Research Hosts, you will spend 6-8 weeks working as a researcher at the University of Nottingham. We will have a selection of exciting research projects to choose from which will offer a variety of learning situations to enhance your research skills, expand your network of contacts and get an introduction to life as a postgraduate researcher at the University of Nottingham. The University of Nottingham through its Wellcome Trust Vacation Bursary scheme aims to recruit candidates from groups currently underrepresented at postgraduate research level both at Nottingham and the wider Higher Education sector. As such we will take positive action during our recruitment process to prioritise applicants who meet the following criteria for interviews: Applicants will be able to opt in to have their application considered under these widening participation criteria as part of an application. If you have any difficulty accessing or using this website, or require assistance in completing this application form then please contact us for support. With many viral infections, a patient experiences a 'spike' of immune system activity that produces many physiological effects such as fever and fatigue. In acute viral infections, a single surge of immune activity resolves the viral infection and the immune system settles to its initial baseline state. However, certain patients with stronger responses to immune-disrupting activity (e.g. multiple sclerosis, Long Covid) experience a runaway 'hyperinflammation spiking' pattern of activity, potentially even elevating the immune system baseline to a chronic inflammatory state. In this project, we will examine a system of ODEs that describe various components of within-patient activity and characterise the arising patient phenomena based on different choices of parameters. Proficiency of ODE systems is essential for this project, as is a command of computational methods to numerical solve ODE systems. The student will receive guidance on the derivation, analysis, and numerical solutions of the mathematical models arising from this application. In particular, the student will examine the linear stability of the ODE system's equilibria, as is typical for nonlinear systems analysis. Bifurcation analysis, likely a new topic for the student, will be introduced and examined as various model parameters are altered. Biophysicality of parameters will be heavily emphasised, as will be the dissemination of key mathematical results to a non-technical audience. While the student will be allowed to use whatever programming language they feel most comfortable with, the supervisor can provide guidance on coding troubleshooting and report writing. Dr Nabil Fadai \"I strongly support initiatives that provide undergraduate students with more opportunities to explore new research areas in applied mathematics. The BVS scheme allows the student to gain valuable insight into the world of academic research, as well as augmenting the student's technical skillset. A typical student undertaking this project will likely be interested in taking a mathematical biology module the following academic year; as such, this project provides additional training as a \"head start\" to the future academic year. As I am currently teaching the main second-year applied mathematics module that is used as a prerequisite for this project, offering a research project to students who enjoyed this module gives them another opportunity to interact with me and the broader applied mathematics section within the School of Mathematics.\" This project can be offered on a part-time basis. Despite their acute adverse effects and abuse liability, opioids remain the mainstay treatment for severe acute pain. Opioid analgesics are mu-opioid receptor agonists, which activate this important GPCR in multiple sites of our body including sites that modulate pain transmission, but also sites that control breathing and gastrointestinal motility, hence their effectiveness as analgesics, and their problematic respiratory depressant and constipatory effects, respectively. In addition, chronic use of opioids can result in tolerance and dependence, which can lead to opioid-use disorders (or addiction), a major societal and economic challenge. The need for safer pain-management therapies with decreased abuse liability inspired our team (in collaboration with medicinal chemists at the University of Bath and at the NIH) to develop compounds that retain analgesia, while minimizing addictive liability. Together with the known effectiveness of opioid agonists as analgesics, the identification of the dopamine D3 receptor (D3R) as a target for the treatment of opioid use disorders (OUD) prompted the idea of generating a class of ligands presenting structures that allow them to bind both, the mu-opioid receptor (MOR) and D3Rs. This ongoing work has resulted in two publications (1,2), and we are working towards improved designs of these compounds. The hypothesis of the work is that compounds that simultaneously target mu-opioid and D3 dopamine receptors will offer a therapeutic profile that provides analgesia but does not result in addiction. The aim of this project will be to evaluate the pharmacology of a new series of compounds developed by our medicinal chemistry collaborators. These compounds will be characterised using cell-based signalling assays (BRET-based) and analytical pharmacology tools in model cell systems. 1 Bonifazi, A. et al. Novel Dual-Target mu-Opioid Receptor and Dopamine D(3) Receptor Ligands as Potential Nonaddictive Pharmacotherapeutics for Pain Management. J Med Chem 64, 7778-7808 (2021). https://doi.org:10.1021/acs.jmedchem.1c006112 Bonifazi, A. et al. Pharmacological and Physicochemical Properties Optimization for Dual-Target Dopamine D(3) (D(3)R) and mu-Opioid (MOR) Receptor Ligands as Potentially Safer Analgesics. J Med Chem 66, 10304-10341 (2023). https://doi.org:10.1021/acs.jmedchem.3c00417 The successful student will join a vibrant and multidisciplinary research group with a wide experience of G protein-coupled receptor (GPCR) signalling and BRET technologies. The student will learn cell culture, some molecular biology and a cell signalling assays using medium throughput assays and plate readers. Our team hosts a large cohort of undergraduate, postgraduate student and postdocs who will be able to support all aspects of the project. There is a very positive research environment locally. Members of the team have also been part of the Team Science committee of the Centre of Membrane Proteins and Receptors (COMPARE), driving positive changes in research culture, initiating mentoring programmes and supporting students at all stages of their development.The student would have a significant amount of support, both from within the immediate team and more broadly within the wider research environment where Team Science is embedded in all activities. Our team is also the funder of GPCR-UK, a network of researchers with a common interest in these important therapeutic targets. Professor Meritxell Canals \"I lead a multidisciplinary research team that focuses on the study of GPCRs, key membrane proteins that participate in virtually all (patho)physiological processes, and essential for human health. My main interests are GPCRs involved in pain transmission and modulation, and my work has provided insights in their mechanisms of action to improve their therapeutic targeting. My group fully embraces the team science approach to complex, multidisciplinary research challenges. Through this approach I support early career researchers and promote a healthy, diverse, and collegiate research culture. I lead my research group to produce the highest standard of research in our field. I train researchers in my group to build their careers on their integrity and excellence in the lab and outside it. I aim to provide a creative, safe, positive, and nurturing environment to pursue new ideas and shape the future of independent researchers that thrive in all their endeavours. I encourage openness and dialogue within my team and aim to provide a research environment where excellence is not celebrated as an individual achievement, but as a result of a team effort.\" Jackie Glenn. Despite the remarkable success of structure-based approaches in protein drug discovery pipelines, researchers still use RNA sequence, rather than its structure, as a major driver for nanomedicine design and therapeutic applications. However, even with the correct sequence, an improperly folded mRNA vaccine might not be efficiently translated by ribosomes, hindering antigen production in the cell, and reducing the body’s immune response. Furthermore, the vaccine formulation and its interaction with the mRNA's 3D structure can influence the stability and release of the mRNA, further impacting its efficacy. Thus, determining the structure of RNA has significant advantages for improving the overall potency of RNA-based therapeutics. In this project, we will aim to assess: (1) the structural changes in an mRNA vaccine candidate when it is in the pure (RNA-only) form and when it is formulated with lipids as a therapeutic. (2) whether the structure of the mRNA is preserved after freeze drying the sample. Through aim 1, we will understand whether significant changes happen in the mRNA when it is formulated with lipids, and whether these will hamper its ribosome binding capacity or translation in the cell. Through aim 2, we will understand if mRNA structure is preserved even if the vaccine sample is freeze-dried. If yes, this will have major implications for vaccine storage and distribution. Currently, RNA-based therapeutics require a cold-chain supply, which is expensive to maintain and may not be readily accessible in low-income countries and point-of-care situations. If the vaccine can instead be distributed and stored in a powder format, without losing efficiency, it will have a significant socio-economic impact on the applications of RNA therapeutics. For successful delivery of the project, the student will be trained in the pioneering OrbiSIMS-guided RNA modelling approach developed in my lab (1). OrbiSIMS is a breakthrough mass spectrometry technique and is a unique capability of Nottingham. I recently benchmarked this technology for RNA structure analysis and was able to determine, for the first time, the structural changes in a human RNA upon HIV infection. The pipeline is well established in my lab and at the Nanoscale and Microscale Research Center, which houses the OrbiSIMS instrument. This approach will train the student in a cutting-edge and multidisciplinary process that encompasses experimental and computational techniques, such as molecular biology, RNA handling, mass spectrometry, structure biology and data science. Dr Aditi Borkar \"I am excited to host an undergraduate biomedical vacation student this summer to share my passion for scientific discovery. My own interest in research began when I undertook my undergraduate summer internship developing early diagnosis avenues for people suffering from Japanese encephalitis virus. This experience showed me the powerful impact of basic science research for real-world benefit and I strive to maintain this inspiration to guide my research projects today and pass the passion on to the next generation of researchers. Hosting a student allows me to provide a hands-on learning experience in a real-world research setting and contribute to their development by exposing them to critical thinking, laboratory skills, and the challenges of biomedical research. I hope to inspire curiosity, spark new ideas, and provide insight into the rewarding world of scientific inquiry. My current research sits at the forefront of technology development in the field of RNA biology and therapeutics and I look forward to train students early in this niche area and build their skillset. Hopefully, they are excited by the stimulating atmosphere in my lab and would want to expand their training further by undertaking future research with me. Finally, by mentoring, I also aim to refine my own skills in communication and leadership, which are essential for both academic and professional growth.\" PGR student: Alex Childs; OrbiSIMS Specialist: Dr Anna Kotowska; Nottingham Research Fellow: Dr Karen Alvey At UoN (Advanced Materials Research Group), we have developed a cost-effective and rapid single-stage manufacturing process for transforming inorganic irregular-shaped particles into micro-spherical particles (microspheres). We have demonstrated our production process with several waste materials, including more recently waste-mine tailings. Our process does not use acids or solvents and simply requires gases to process materials via flame spheroidisation and can easily be scaled to industrial manufacturing levels. Processing mine-waste tailings into microspheres could lead to their subsequent use as supplementary cementitious materials (which are used in cement production) and potentially replace fly-ash. The global availability of fly-ash has declined significantly over previous years. Further, processing mine-waste tailings into microspherical particles would be significantly beneficial for developing biotechnology advanced cement by adding microbial species which would i) absorb and sequester CO2 from the environment and ii) secrete calcite to promote self-healing concrete mechanisms. Moreover, the round spherical shape of these particles would also enable excellent packing characteristics as well as permeable pathways for CO2 entry which the microorganisms could use to fix and utilize for metabolic purposes. Also, concrete containing spherical cement exhibits high fluidity, thereby improving the workability leading to requirements of less mixing water, facilitating the production of concrete with higher strength and. Currently, there are demands within the construction industry for the improvement of concrete fluidity, the enhancement of concrete strength and an increase in concrete durability. The aim of this project will be to investigate the influence of incorporating microbes with processed waste materials to produce bioconcrete. The hypothesis to be explored is that introducing microbes alongside processed inorganic materials could entrap CO2 and transform the waste into bioconcrete via a process known as microbiologically induced calcite precipitation (MICP). The research questions will focus on: i) What is the effect of introducing microbes on concrete formation? ii) What are mechanisms of action behind MICP? iii) Does introduction of microbes also enable entrapment of CO2 within the concrete formed? iv) What are the mechanical properties of the MICP produced concrete? 1) Inderpal Devgon, Rohan Samir Kumar Sachan, Jyotsna Devgon, Arun Karnwal; Bio-cement: A sustainable approach in the construction sector. AIP Conf. Proc. 20 February 2024; 2986 (1): 030046. https://doi.org/10.1063/5.0194118 2) https://projects.research-and-innovation.ec.europa.eu/en/horizon-magazine/building-future-self-healing-concrete-and-biocement#:~:text=Bacteria%2Dbuilt,cement%20the%20ground%20raises%20eyebrows.&text=The%20technique%20has%20been%20recognised,South%20Bank%20University%20(LSBU) 3) Nigar F, Johnston AL, Smith J, Oakley W, Islam MT, Felfel R, Grant D, Lester E, Ahmed I. Production of Nano Hydroxyapatite and Mg-Whitlockite from Biowaste-Derived products via Continuous Flow Hydrothermal Synthesis: A Step towards Circular Economy. Materials (Basel). 2023 Mar 7;16(6):2138. doi: 10.3390/ma16062138. The overall scientific training to be received by the student will be split between two groups (Advanced Materials Research Group [AMRG] and Sustainable Processing Technologies [SPT]) to include: 1) How to conduct efficient literature review surveys 2) Training on how to culture microbes 3) Understand the MICP formation mechanisms 4) Understand influencing of MICP mechanisms utilising alternate materials 5) Training on effective characterisation techniques to include, SEM, EDX, XRD, FEG-SEM, FTIR and Raman analyses. 6) How to write effective scientific reports 7) Deliver scientific presentation to AMRG and SPT research groups Professor Ifty Ahmed \"My motivations for hosting a summer vacation students are to assist them significantly by enhancing their work experience and CV and help them to progress onto the next stage of their careers. This could either include exploring further academic research (ie PhD level studies) or conducing R&D work for industry after they graduate. This scholarship is also an ideal route to identity potential future PhD students. I have regularly hosted summer students from the Bioengineering MSc courses at University of Nottingham and have also undertaken supervision of 16-17 year old school/college students through the Nuffield Summer Placement scheme. The aim of this scheme is to entice/encourage young students from underprivileged or disadvantaged backgrounds to go to study at University, by giving them a taster of being at University.\" Dr Samantha Bryan, Dr MD Towhid Islam, Dr Sean Craig. Epidemic models often can't predict future infection rates due to vast uncertainties in how we respond to knowledge of disease prevalence. Individuals may alter their behaviour due to local or global information on infections, social media, or health policy. The simplest epidemic models assume our social contacts are stable over time, and we don't change our behaviour in response to the real or perceived threat of infection. However, models in which contact rates change with the severity of the epidemic have been explored in the context of rapidly evolving respiratory pathogen outbreaks [e.g. 1]. In this project we will develop and numerically explore compartmental Susceptible-Exposed-Infected-Recovered models that capture behaviour change in epidemics. In particular, we will allow the contact rates, and therefore transmission, to depend on the reported case or death statistics, potentially extending this to examine the role of memory of past severity in shaping collective behaviour. We will consider the resulting relationships between contact rate and infection, and by comparing to the dynamics of real-word epidemiological and mobility data, comment on the plausibility of the hypothesised behavioural models. [1] Zachary LaJoie et al. “A COVID-19 model incorporating variants, vaccination,waning immunity, and population behavior”. In: Scientific Reports 12.1 (2022). During this project student will develop a number of skills relevant to a range of scientific pursuits. The student will gain training in the use of mathematical modelling, including designing and parameterising a mathematical model to address a research question, using and interpreting data to motivate the structure of a mathematical model, efficient and reproducible development of software in R/Matlab/python or similar coding language, planning and execution of numerical experiments, undertaking sensitivity analyses and synthesising and interpreting results to address the original question. The student will also receive broader training in the effective use of scientific literature across multiple relevant disciplines, scientific report writing, and communicating findings to an interdisciplinary audience. Dr Kirsty Bolton \"I was a summer research student following my second year of undergraduate study. It was my first experience of writing my own code, discussing new results with collaborators, and authoring a scientific paper. It was exciting; a refreshing change from sitting exams and left me with a strong sense of the rewards of doing research. My summer internship supervisors were also the first to encourage me to pursue a PhD, which set me on the track to my current role. Being amongst a gender minority throughout my career in physics and maths, I understand how crucial the encouragement and support of mentors can be in developing a sense of confidence and belonging. I am very pleased that my previous summer student is currently studying for an MSc in Population Health Science at the University of Cambridge. I hope that I can provide similarly positive experience for a student working on this project; insight into the joys of research, some training in the skills required to succeed, and a gateway to getting more information about the possibilities following undergraduate study.\" Digital twins (DTs) are mathematical or computer models tailored to specific instances of real world systems or processes. DTs are increasingly used in healthcare, engineering, manufacturing and industry to provide personalised recommendations, prognosis and future predictions. Due to the complexity of modelling real world systems at high resolution, DTs often comprise high dimensional or multi-scale mathematical modelling, making them computationally expensive and slow to run, meaning it can be hard to utilise them in fast-paced real world settings, such as clinical environments. In this project we will focus on the development of tools to aid the emulation and calibration of cardiac DTs. Cardiac DTs have the capacity to be a key tool for personalised medicine, which will allow us to make data driven clinical recommendations in real time. However, sufficiently detailed cardiac models are often computationally expensive to run and this limits their use in fast-paced clinical settings. This project will leverage machine learning techniques to emulate a cohort of cardiac patients. Then use these emulators as a surrogate to allow us to perform model calibration to learn unknown parameters using a Bayesian statistical approach. The cohort of calibrated models may then be used for patient forecasting and in-silico trials. Previous work of this kind has generally used Gaussian processes as surrogate models. Broadly speaking, Gaussian processes are probability distributions over functions (as opposed to probability distributions over numbers), and Gaussian process regression can be used in a Bayesian statistical framework to learn posterior distributions for unknown functions connecting a set of observations. The student will learn the basics of computer model emulation and test the predictive accuracy of Gaussian process emulators against other potential surrogate models, which could include non-linear regression techniques and neural networks. They will also investigate methods of cohort learning (learning multiple DTs at once) using these alternative surrogate models, and comparing them to existing cohort learning techniques for Gaussian processes, such as multi-task GPs. Computer model calibration is the task of learning the parameters of a mathematical model from a given observation of the output of that model. This is particularly useful for cardiac models, as they often contain parameters that cannot be measured in-vivo. In many cases, cardiac models have high dimensional input and output spaces, making parameter calibration a difficult task. In cases where the original simulator is unstable under certain parameter combinations, calibration is particularly difficult, as high emulator uncertainty can lead to local maxima in the likelihood space. Using their surrogate models, the student will investigate methods of calibrating cohorts of cardiac DTs to physiologically plausible outputs, with a key focus on the effect of surrogate model uncertainty on the calibration method. We will introduce the Metropolis Hastings MCMC method as a baseline for calibration and the student will have the opportunity to explore other methods, such as variational inference and Hamiltonian MCMC, depending on their interests. To summarise, the key research questions for this project are: The student will be asked to perform a short literature review, covering recent advances in cardiac modelling, digital twin emulation and model calibration. We will discuss how to find and access academic journals and how to summarise and cite sources. They will learn the basics of training Gaussian processes and other machine learning tools used for regression and prediction, coding in either Python or R (or another language if they prefer). They will also be introduced to calibration methods such as MCMC, taught to write a simple Metropolis Hastings algorithm and how to use more complicated algorithms. They will also work on presentation skills, designing either a powerpoint or poster presentation to explain their findings to members of my research group. Dr Christopher Lanyon \"As an early career researcher, I am excited to have the opportunity to work with a student to develop the mathematical, statistical and machine learning methods I use day to day. When I was a student I had a keen interest in mathematical applications “that could help people”. During my career I have worked on disease identification, antimicrobial resistance in agriculture, modelling air pollution and now modelling the human heart. I hope that by hosting a BVS student I can give an insight into what it means to research applied mathematics with a focus on human health.\" development of methodologies, conceptual frameworks, technologies, tools or techniques that could benefit health-related research Background Dementia and hearing loss are extremely common in older adults, and can substantially impair quality-of-life. Hearing loss is the largest potential modifiable contributor to dementia risk from midlife onwards. Each condition can individually impact communication, concentration, mental well-being, social engagement, employment, independence, and family life. These conditions often co-exist, which can increase their negative effects and impede the diagnosis and management of these conditions. People who are living with dementia and/or hearing conditions, as well as family caregivers, have been identified as underserved groups who are frequently under-represented in research. Furthermore, people affected by dementia and/or hearing conditions are often members of additional underserved groups, including people from Black, Asian and minority ethnic communities, people who identify as LGBTQ+, people with multiple health conditions, and people from socioeconomically deprived areas. To ensure that dementia and hearing loss research leads to tangible real-world benefits, it is crucial to address these disparities and involve diverse patient and caregiver populations in the research process. Inclusive approaches are essential to generate equitable, representative, and impactful findings. This project will lead to the development of a toolkit of strategies and resources that can improve the inclusion of under-served groups in research about dementia and hearing conditions. To design a toolkit to support the inclusion of under-served groups in future studies about dementia and hearing conditions. Dr Sian Calvert \"We are passionate about creating opportunities for the next generation of researchers to engage in impactful, inclusive, and meaningful work. Hosting a student over the summer provides a unique chance to share our expertise while fostering their development as independent, curious, and skilled researchers. Our research focuses on addressing the needs of underserved communities in dementia and hearing loss, emphasising inclusion and co-production with people directly affected by these conditions. We are motivated to support a student in contributing to this critical area, providing them with hands-on experience in research design, data collection, and analysis. By hosting a student, we aim to inspire their interest in tackling complex, real-world problems while equipping them with valuable skills for their academic and professional journeys. We are committed to creating a supportive and enriching environment that encourages creativity, collaboration, and personal growth, ensuring the student has a rewarding and transformative experience.\" Dr Eithne Heffernan (Senior Research Fellow), Nova Mathew (PGR student). fundamental processes that underpin biology, to understand more about how life works Adenosine receptors (ARs) represent four members of the g-protein coupled receptor (GPCR) family. When the metabolite adenosine is present in the extracellular environment it binds ARs on the cell surface and activates intracellular signalling cascades (Borea et al., 2018). The cellular responses to AR activation are dependent upon the cell type and the AR subtype that is activated (A1, A2A, A2B, or A3). There are drugs in trial and in clinic that target adenosine receptors in disease areas such as cardiovascular diseases, neurodegenerative diseases, and cancer (Borea et al., 2018). Much of our current understanding of the molecular mechanisms of AR function and molecular pharmacological characteristics comes from systems where the receptors have been overexpressed in simple cell models. Information is lost about how ARs function under endogenous expression levels, and in different differentiated cell types. An outstanding challenge for the field, therefore, is to further develop our understanding of the cell type and context specific AR function under endogenous expression levels, with the prospect that this could lead to improved therapies in several disease areas. This project aims to further our understanding of adenosine receptors under endogenous expression levels by utilising CRISPR Cas9 gene editing approaches. The successful student will utilise CRISPR Cas9 to add protein tags on the adenosine A2A and A2B receptors in human endothelial and immune cells to allow study at the endogenous expression level. We will add the 11 amino acid split Nanoluciferase tag HiBiT, to the N terminus of the receptors as we previously have done successfully with the other membrane proteins (Ogrodzinski et al., 2023). Addition of these tags will allow the study of endogenously expressed receptors, the characterisation of ligand affinities utilising fluorescent probe molecules and NanoBRET (Stoddart et al., 2015), and to study to receptor trafficking in response to diverse stimuli. Overall, this project will generate new model systems for the study of ARs and expand our knowledge of their function. Borea PA, Gessi S, Merighi S, Vincenzi F, Varani K. Pharmacology of Adenosine Receptors: The State of the Art. Physiol Rev. 2018 Jul 1;98(3):1591-1625. doi: 10.1152/physrev.00049.2017. PMID: 29848236. Ogrodzinski L, Platt S, Goulding J, Alexander C, Farr TD, Woolard J, Hill SJ, Kilpatrick LE. Probing expression of E-selectin using CRISPR-Cas9-mediated tagging with HiBiT in human endothelial cells. iScience. 2023 Jun 30;26(7):107232. doi: 10.1016/j.isci.2023.107232. PMID: 37496673; PMCID: PMC10366498. Stoddart LA, Johnstone EKM, Wheal AJ, Goulding J, Robers MB, Machleidt T, Wood KV, Hill SJ, Pfleger KDG. Application of BRET to monitor ligand binding to GPCRs. Nat Methods. 2015 Jul;12(7):661-663. doi: 10.1038/nmeth.3398. Epub 2015 Jun 1. PMID: 26030448; PMCID: PMC4488387. The successful student will join an inclusive and motivated team of scientists passionate about understanding more about membrane protein biology. The student will be hosted in laboratories of the Centre of Membrane Proteins and Receptors (COMPARE), which provide state of the art facilities. There is a vibrant group of postgraduate students and postdoctoral researchers ready to welcome new team members and support them in their work. The proposed project will provide training and experience in several cutting-edge scientific techniques. Specifically, the student will be given extensive training in the following areas: Dr Simon Platt \"I am a research fellow studying the biology and pharmacology of adenosine receptors. Despite my relatively early career stage I have extensive experience supervising undergraduate vacation students, MSc research projects, and PhD students. This is one of the most enjoyable aspects of my work, and it has given me great satisfaction seeing students develop as scientists and to use the experiences they gained under my supervision to further their careers. I am very fortunate to be based in an environment where Team Science is as at the forefront of everything we do, and support always available for all members of the research team. The BVS framework aligns well with my ethos of giving anyone with the motivation and curiosity to get involved in research my full support to do so, regardless of their level of previous experience and extend of prior opportunities they have had. I am happy to discuss the project with potential applicants, please email me: simon.platt2@nottingham.ac.uk \" Professor Steve Hill (Professor of molecular pharmacology, School of Life Sciences) and Dr Laura Kilpatrick (Assistant professor, School of Pharmacy) Scientific areas: Transient Receptor Potential (TRP) channels comprise a superfamily of non-selective cation channels, that respond to various stimuli, including heat, mechanical pressure, light and chemicals, and play a crucial role in sensory physiology. Dysregulation of TRP channels has been implicated in numerous conditions, including pain, central nervous system (CNS) dysfunction and inflammatory disorders, which makes them recognised drug targets. The importance of TRP channels is further highlighted by the award of the 2021 Nobel Prize in Physiology or Medicine for their discovery. In addition to being drug targets themselves, TRP channels have been proposed as modulators of G protein-coupled receptor (GPCR) signalling. GPCRs which are the most widely expressed family of cell surface receptors, convert extracellular stimuli into intracellular signals by interacting with a range of effectors such as G proteins, G protein-coupled receptor kinases (GRKs) and β-arrestins. This is especially impactful, as GPCRs are involved in virtually every physiological response in the human body, while being targeted by approximately one third of currently available medicines. Therefore, processes affecting GPCR function, such as TRP channel-mediated modulation, are likely to have a profound impact in health and disease. Exciting preliminary data in our lab has shown that Transient Receptor Potential Vanilloid 1 (TRPV1) activation by capsaicin, the pungent component of chilli peppers, modulates the function of many GPCRs. However, while there is accumulating evidence for TRP channel modulation of the function of therapeutically relevant GPCRs, the molecular and cellular mechanisms of such modulation remain poorly described. In particular: how does TRP channel activation inhibit GPCR function? What are the molecular mechanisms that underlie this regulation? And does TRP activation modulate GPCR responses to specific drugs? This project will study the TRP-GPCR axis and its functional consequences. The overarching aim of this project is to characterise the modulation of GPCR signalling by TRP channels that results in altered GPCR function. Through this work, we will obtain key insight into health and disease processes where both TRP channels and GPCRs are activated, such as inflammatory or neuropathic pain, providing a rationale to design novel and more effective treatments for such disorders. The student will investigate the modulation of GPCRs by TRP channels, using high throughput signalling assays and a range of bioluminescent resonance energy transfer (BRET) biosensors. The modulatory effects of TRP channel activation (TRPV1, TRPV4, TRPA1, TRPM3, TRPM8) will be assessed in model cell systems like Human Embryonic Kidney (HEK293) cells. This study will include GPCRs with different G protein coupling preferences, receptors co-expressed with TRP channels in sensory neurons (such as MOR, neurokinin NK1R and adenosine A1R receptors), and receptors co-expressed with TRP channels in immune cells (such as chemokine receptors). This project is a great opportunity for the student to become proficient in sterile cell culture techniques and luminescence-based screening assays. The student will join the Molecular Neuropharmacology group, which is a highly collaborative and supportive lab within the Centre of Membrane Proteins and Receptors (COMPARE), that brings together researchers to develop methods to study and visualise membrane proteins. This unique research environment provides privileged access to experts in their fields and cutting-edge facilities, including high-end fluorescent plate-readers and microscopes, ensuring the successful outcomes of the project. The student will be exposed to other multidisciplinary research projects and will work alongside a diverse team of students, at different stages of their studies, which will facilitate networking and career discussions. In addition to being trained on how to perform cell culture and high throughput signalling assays, the student will develop soft skills, including communication, teamwork, organisation and leadership skills, which will be beneficial for any future career plans. Dr Julie Sanchez \"I am an Anne McLaren Research Fellow at the University of Nottingham, who focuses on fundamental drug discovery with a particular interest in membrane receptors such as GPCRs and TRP channels. Our main goal is to understand how to design better drugs by studying the mechanisms involved in health and disease conditions such as pain and inflammation. I always enjoy supervising new and upcoming scientists as they bring a fresh perspective and dynamic to the group and it is satisfying for everyone to see them thrive as they develop new skills, both technical and interpersonal. Based on my personal experience and the experience of several summer students I have trained, this scholarship is the perfect opportunity for prospective students to discover how a ‘real’ lab functions, which career options are available to them and whether they like the lab as much as I do, all while contributing to our group’s research effort.\" Although Dr Julie Sanchez will be the main point of contact for this project, the student will get to interact with and learn from many members of the Molecular Neuropharmacology group including academics (Prof Meritxell Canals, Dr J Robert Lane, Dr Raphael S Haider), our senior technician (Jackie Glenn) and many PGR students (George Farmer, Lauren Brown, Lucy Adam, Claire Kelly, Maryah Kotbi). If you have problems viewing this page, please contact us to request the information in another format."
        }
    ],
    "pdf_files": []
}