{
    "url": "http://www.nottingham.ac.uk/research/groups/clinicalneurology/",
    "content": [
        {
            "p": "Our research focuses on how common diseases affect the brain. We aim to develop new diagnostic tools, identify new targets for treatment, and improve the outcomes for people with brain diseases. For example, we are working to replace invasive lumbar punctures with MRI scans for diagnosing multiple sclerosis (MS). We are also exploring ways to screen for cognitive decline at NHS clinics so that treatments can be tailored to individuals. We collaborate with teams in the UK and internationally. If you are interested in studying brain diseases or support our research, please contact us. Professor Nikos Evangelou Our research topics in the field of multiple sclerosis include immunopathogenesis (the immune mechanisms that lead to myelin and axonal damage), the study of the role of infections in the aetiology of the disease and its activation; the role of advanced imaging techniques in the study of tissue damage, in vivo detection of pathology, correlation with neuropathology, and differential diagnosis in the clinic; epidemiology, including the role and mechanisms of smoking in susceptibility and clinical progression of MS; the identification of new therapeutic approaches, including immunomodulation, neuroprotection, and remyelination by pharmacological, biological, and cell-based treatments. Associate of British Neurologists Annual Meeting https://www.theabn.org/page/annualmeeting2024 Dr Allen, Consultant Neurologist, will present part of his PhD looking at patients' views of the current diagnostic pathway for multiple sclerosis and how it can be improved. Ms Aimee Hibbert, Senior Clinical Research Officer will present her work exploring Annualised Relapse Rates (ARR) in Multiple Sclerosis. ARR is a marker of disease activity and is frequently used as an outcome measure in clinical trials, but despite decreasing in trials since the 1990’s, contemporary clinical UK ARR data is lacking. ‘Real world annualized relapse rates from UK multiple sclerosis clinics: A retrospective multicentre cohort study’ will be displayed at the ABN in Belfast during the Poster Tour Group 7: MS1 on Wednesday 10th May. American Academy of Neurology Annual Meeting https://www.aan.com/events/annual-meeting Dr Allen, Consultant Neurologist, will present the results of the MEGAbIT study, investigating the effects of mild traumatic brain injury using magnetoencephalography. His presentation will be on 25th April. Rehabilitation in Multiple Sclerosis (RIMS) conference https://www.eurims.org/ Lauren A Taylor, PhD Candidate, will present part of her PhD project which aims to understand which people with multiple sclerosis (MS) benefit most from cognitive rehabilitation. This study explores the characteristics that make an individual with MS more likely to benefit from cognitive rehabilitation so that this intervention can be targeted to those most likely to benefit. This presentation will take place at the Rehabilitation in Multiple Sclerosis (RIMS) conference in Genoa, Italy between the 4th and 6th of May. MS Trust conference https://mstrust.org.uk/health-professionals/courses-and-training/ms-trust-conference Lauren A Taylor, PhD Candidate, will present a sub study of the NEuRoMS project conducted in collaboration with the University of Nottingham. This study aims to compare the socio-demographics and clinical characteristics of MS patients who completed their online cognitive screening prior to their clinic appointment with MS patients who did not complete the online cognitive screening with the aim understanding who is more or less likely to take part, with the subsequent aim of improving uptake. This presentation will be at the MS Trust conference at the Leonardo Hotel in Hinckley on Sunday the 26th of March at 4pm. Polly Swain, Research Assistant Psychologist, will present a sub study of the NEuRoMS project conducted in collaboration with the University of Nottingham. This study aims to access the usability of an online cognitive screening tool in routine MS clinical care and gain insight into patient experiences with the aim of improving our clinical services and ensuring that support offered is patient-centred. This presentation will be at the MS Trust conference at the Leonardo Hotel in Hinckley on Sunday the 26th of March at 4pm. Suzanne Britt, a PhD candidate, will present her poster on tackling domestic violence and abuse called: What is the role of the healthcare professional working with people with multiple sclerosis? A qualitative study. It will be presented at the MS-Trust conference March 26th-28th 2023. The poster describes the background to a project which is underway, exploring the issue of domestic violence and abuse in people with multiple sclerosis. A PhD study is being conducted to focus on the experiences and views of MS-healthcare professionals about their role in responding to domestic violence and abuse. Findings from this study and the wider project will be used to inform further practice support developments. Group members have participated in pivotal trials that led to the introduction of most drugs currently used in MS, helped establish the principle of some treatments and the basis for combination therapy in multiple sclerosis. MS Clinical Trials Unit We have an active, internationally recognised clinical trials unit. We conduct a number of commercial and non-commercial trials, many of which are investigator-led, and collaborate closely with the Comprehensive Clinical Research Network (CLRN) for the National Institute for Health Research (NIHR) portfolio studies. Worms For Immune Regulation in Multiple Sclerosis (WiRMS) trial Our senior academics have clinical honorary contracts within the NHS, and there is fertile ground for bench-to-bedside and bedside-to-bench translational work. We deliver neurological care to a population of more than 3 million people. The MS clinic is possibly the largest in England. Visit the NHS Neurology Services in Nottingham. We have developed the NeuRoi image analysis software for processing MRI images. Its application can be found in leading peer-reviewed publications such as Brain and Journal of Magnetic Resonance Imaging. Our research has been published in leading journals. See other publications under the individual profiles of our group members. PhD opportunities Neuroscience @ Nottingham Nottingham Clinical Trials Unit Group members School of Medicine The University of Nottingham C Floor, South Block, Queen's Medical Centre Nottingham, NG7 2UH telephone: +44 (0) 115 823 1441 email:Group Administrator"
        }
    ],
    "pdf_files": []
}