{
    "url": "https://www.nottingham.ac.uk/research/groups/mangrove-to-milpa/index.aspx",
    "content": [
        {
            "p": "From Mangrove to Milpa is funded by Natural Environment Research Council (NERC) through a GCRF Resilience Foundation Award. It is based in the Yucatan Peninsula, Mexico, bringing together UK and Mexican researchers to develop novel approaches to building resilience to the impacts of extreme weather (specifically hurricanes and droughts) and to provide capacity building opportunities. The project is led by Professor Sarah Metcalfe at The University of Nottingham, in collaboration with colleagues within The University of Nottingham, and at UNAM, ECOSUR, and UADY in Mexico. “Del manglar a la Milpa” es un proyecto financiado por el Natural Environment Research Council (NERC) a través de un premio otorgado por el Global Challenge Research Fund (GCRF). El proyecto se enfoca a la Península de Yucatán, en México. El proyecto reúne a investigadores del Reino Unido y de México para desarrollar enfoques innovadores que ayuden a construir un marco teórico sobre la resiliencia ante los impactos de fenómenos meteorológicos extremos (específicamente huracanes y sequías), para proporcionar oportunidades de fortalecimiento y desarrollo de capacidades. El proyecto está dirigido por la Profesora Sarah Metcalfe, de la Universidad de Nottingham, en colaboración con colegas de la Universidad de Nottingham, de la Universidad Nacional Autónoma de México (UNAM), El Colegio de la Frontera Sur (ECOSUR) y de la Universidad Autónoma de Yucatán (UADY), en México. The project aims to develop more effective methodologies for assessing resilience to extreme weather events by building an interdisciplinary team to explore and understand: El proyecto tiene como objetivo desarrollar metodologías más efectivas para evaluar la resiliencia a eventos climáticos extremos, mediante la creación de un equipo interdisciplinario para explorar y entender: sarah.metcalfe@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}