{
    "url": "https://www.nottingham.edu.my/Research/Research-groups/Centre-for-Green-Technologies-CEGT.aspx",
    "content": [
        {
            "p": "Malaysia is a country of abundant natural resources, from which our present day economy and industry have grown. In order to maintain and develop the nation’s wealth, heritage and well-being, Malaysia is focussing on sustainable green technologies that will stimulate economic activity whilst reducing the environmental impact. At the Centre for Green Technologies (CEGT), we aspire to play a major role in Malaysia’s transition to a renewable energy economy, and to position Malaysia as a leader of clean energy and renewable industries in South East Asia. Our interdisciplinary collaborative approach attracts companies from across Malaysia to work towards achieving a cleaner and greener future. Together we are increasing resource efficiencies and promoting sustainable lifestyles through our development of environmentally-friendly products and processes. We are ambitious to play a major role in Malaysia’s transition to a renewable energy economy Malaysia and one of South East Asia’s clean energy and renewable industries leader. Our three key research objectives are closely aligned to the United Nations Sustainable Development Goals: Affordable and Clean Energy (goal 7), Responsible Consumption and Production (goal 12), and Climate Action (goal 13). Green technologies Identifying how industry can do more and better with less Clean energy Recognising that energy is central to nearly every major global challenge and opportunity Better environment Reducing environmental degradation through enhanced industrial processes Our academic staff have expertise in the following topic areas: The Centre for Green Technologies is co-led by a Fellow of the Academy of Sciences Malaysia (ASM). The production and development of green technologies reduces Malaysia’s carbon footprint whilst promoting sustainable industrial and economic growth - creating jobs, attracting investment and honouring our responsibility to the environment. Our researchers are passionate about future industrial innovation, and so we’re always pleased to hear from commercial organisations and other universities with ideas for collaboration. If you share our ambition for cleaner, greener industrial processes and products, please get in touch. For general enquiries: Co-Director, Prof Dominic Foo email: Dominic.Foo@nottingham.edu.my Co-Director, Prof Hon Loong Lam email: HonLoong.Lam@nottingham.edu.my For research collaboration and business engagement enquiries: email: RKE.Hub@nottingham.edu.my Also referred to as ‘clean technology’ or ‘environmental technology,’ green technology encompasses a wide range of innovations and practices designed to minimise negative environmental impact and promote sustainability. Green technology includes technologies and solutions that aim to reduce resource consumption, decrease pollution and address environmental challenges while fostering economic growth and well-being. Some areas covered in green technology include renewable energy, energy efficiency, waste reduction and eco-friendly manufacturing processes. Green technology reduces the negative impact of human activities, and some key benefits include: Reduced carbon emissions Conservation of natural resources Waste reduction and recycling Improved air and water quality Biodiversity conservation Examples of green technology include: Solar panels Wind turbines LED lighting Electric vehicles Waste-to-energy technology Green building materials Smart grids Hydroponics and vertical farming The Centre for Green Technologies is a research and innovation hub at the University of Nottingham Malaysia that is dedicated to advancing sustainable and environmentally friendly technologies. We focus on research, development, and education in green technology. Yes, students can apply for various scholarships, financial aid and grants from UNM to support their endeavours. Yes, we welcome students from all around the world to study and work with us. Visit our international students webpage for more information on studying in Malaysia. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}