{
    "url": "https://www.nottingham.ac.uk/research/beacons-of-excellence/rights-lab/about/index.aspx",
    "content": [
        {
            "p": "The world’s first large-scale research platform for ending slavery by 2030 There are 50 million people enslaved around the world today. The global modern antislavery effort is nearly 20 years old and a commitment to end slavery by 2030 is part of the United Nations Sustainable Development Goals (target 8.7). But to achieve this goal, we need evidence-based strategies for abolition. We tackle a key challenge of global development and one of the great human rights issues of our time. The largest group of modern slavery scholars in the world, and home to the world’s leading academic experts on modern slavery, the Rights Lab is underpinning antislavery with an advanced research agenda. Our team is answering five big questions: 1. How many people are enslaved in the world and where are they? 2. How can individuals and communities best support survivor health and wellbeing? 3. How can we close the implementation gap, between principle and practice? 4. What are the impacts of slavery on our economies and how can businesses tackle slavery? 5. What works to end slavery and what is the Freedom Dividend for our world when slavery ends? Each question forms a central Rights Lab programme, led by our four Associate Directors and staffed by senior and early-career scholars who work closely with our NGO, business, and policy partners around the world. Find out more about our four programmes: Our team leads for stakeholder impact and engagement work across all four programmes and bring together the Rights Lab’s research to answer the fifth big question: what works to end slavery and what difference does freedom make? These team members—our heads of policy, business and strategic projects—work closely with key stakeholders on filling evidence gaps across the sector. Our INSPIRE project (Involving Survivors of Slavery in Policy & Intervention Research) elevates survivor-informed research as a key part of knowledge production to help end slavery and support survivors to achieve a full freedom. It works across our four research programmes to ensure all our research is survivor-informed, and works globally with survivor-scholars to develop and deliver survivor-informed and survivor-led research. As a Lab, we are an experimental space. We bring diverse methods to bear on a critical problem, without adherence to disciplinary boundaries. We leverage the theories and methods from political science, law, sociology, history, geospatial science, computer science, corpus linguistics, and mental health, among numerous other disciplines, and mix methods, data, tools, and techniques into the best combination for solving a real-world problem. As a Lab, we also take practical application as our main purpose. We have built our transdisciplinary approach upon a fusion of rigorous empirical research and advocacy. As our programmes unfold, we use their results to update what we call a Freedom Blueprint: a plan for achieving Sustainable Development Goal 8.7 – the end of slavery. We update this roadmap as we make discoveries, test intervention techniques, and complete our evaluation processes. We hope it will offer a global plan for what everyone must do – individuals, communities, businesses, national governments, corporations, and intergovernmental organisations – to achieve a slavery-free world by 2030."
        }
    ],
    "pdf_files": []
}