{
    "url": "https://www.nottingham.ac.uk/researcher-academy/news/latest-news/diret-bitrus-tang'an-wins-the-universitas-21-three-minute-thesis-people's-choice-award.aspx",
    "content": [
        {
            "p": "Diret Bitrus Tang’an Congratulations to Diret Bitrus Tang’an from the Faculty of Engineering for being awarded the 2023 People’s Choice prize in the global online Universitas 21 (U21) Three Minute Thesis competition. Diret’s presentation, Hope For The Environment: Microwave Heating, explains how microwave heating can be used to help clean petroleum contamination from the Niger delta. Three Minute Thesis 3MT® is an academic research communication competition developed by The University of Queensland (UQ), Australia. The challenge is for doctoral researchers to explain the complexity and relevance of their research to a non-specialist audience in a concise and engaging way in only three minutes. Diret earned his spot in the Universitas 21 3MT ® competition by winning both the Researcher Academy and the University of Nottingham Tri-Campus Competitions this year. The U21 competition provided Diret with a unique opportunity to showcase his research on a global platform, amplifying the impact of his work and contributing to the university's reputation as a hub for cutting-edge research. The Niger Delta, facing severe environmental challenges due to petroleum contamination, now has a glimmer of hope thanks to Diret's pioneering work. His dedication to finding sustainable solutions reflects not only the spirit of innovation but also a deep sense of responsibility towards the global community and the environment. \"I am highly honoured to be the global People’s Choice winner of the 2023 U21 3MT® competition. Many thanks to U21 for the challenging opportunity to further develop my art of pitching complex research concisely and engagingly. Special thanks to the teams at the University of Nottingham, my sponsor (PTDF), my family, and my friends for their support throughout this journey. Above all, thanks to God for His wisdom. I hope that my research will contribute immensely to the greater cause of saving our environment.\" Diret Bitrus Tang'an, University of Nottingham You can watch the winning presentation on the U21 website. UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": []
}