{
    "url": "https://www.nottingham.ac.uk/research/groups/cse/index.aspx",
    "content": [
        {
            "p": "The Coatings and Surface Engineering (CSE) research group at the University of Nottingham is the largest thermal and cold spray research group in the UK. We host the UK's Centre of Excellence in Advanced Ceramic Coatings. The centre currently hosts a 5 Year EPSRC Fellowship on Ceramic Coatings (2021-26). Find out more about the EPSRC Fellowship here. How our work is transforming the Aerospace industry can be found here. We carry out fundamental and applied research into various coatings and surface engineering technologies, including Suspension Plasma Spray, Solution Precursor Plasma Spray, High Velocity Oxy-Fuel Spray, High and Low Pressure Cold Spray, Aerosol Deposition, Spray based additive manufacturing, Chemical Vapour Deposition and Physical Vapour Deposition. Processing-microstructure-properties relationships of metallic, ceramic and cermet coatings are at the core of our research. Our research is aimed at achieving Netzero, materials circularity and sustainable materials processing for a better world. EBSD of cold sprayed Al6000 series deposit For University of Nottingham Coatings related update follow @UoNCoatings at twitter. You can follow Prof Hussain's personal twitter handle @ProfessorTanvir Our research broadly addresses the following sectors: The Coatings and Surface Engineering research team is multi-disciplinary in nature and cuts across several research themes in physics, chemistry, advanced materials and manufacturing engineering. We work closely with Advanced Materials Research Group. Our research can be broadly classified into distinctive themes: We work across all Technology Readiness Levels (TRLs) to deliver bespoke solutions for advanced manufacturing tasks. Research team Advanced Materials Suspension high velocity oxy-fuel spraying of 200 nm alumina in water suspension. UTP Topgun is producing coatings for extreme wear. This website is maintained and updated by CSE Team. In case of incorrect information or any other issues, please report it here. Room C55, Coates Building The University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 951 3795 email:tanvir.hussain@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}