{
    "url": "https://www.nottingham.ac.uk/research/research-areas/energy-institute/index.aspx",
    "content": [
        {
            "p": "Shaping the future of energy The University of Nottingham Energy Institute unites energy research across a range of disciplines, drawing on multidisciplinary expertise across our Faculties of Engineering, Science and Social Science. An impressive portfolio of research, development and demonstration has been built up over 25 years, attracting significant funding from government and industry to deliver high profile impact. Energy activities are focused on the key societal challenges of 'Transport and Mobility', 'Energy Generation and Management' and 'Communities and the Built Environment'. We are proud to be part of the Energy Research Accelerator (ERA), a cross-disciplinary and multi-partner energy research hub in the Midlands. We work alongside Aston University, the University of Birmingham, the British Geological Survey, Leicester University, Loughborough University and the University of Warwick. If you're looking for research facilities with a difference, then the University of Nottingham Energy Institute is right for you. We have an abundance of specialist, multi-million pound facilities which are helping us to find solutions to global challenges. From advancing new energy technologies, to new materials and methods of manufacturing, to the latest developments in aeronautics and power electronics - we're always upgrading our facilities to deliver world-changing research that we share through collaboration, alongside outreach and knowledge exchange. Explore facilities At the University of Nottingham, we address the complex challenges facing our planet and are committed to making an outstanding contribution to the United Nations Sustainable Development Goals (SDGs) Educational resources that target children’s sense of agency are key in supporting behavioural change. To combat climate change, we need to understand how to design and implement these into the curriculum most effectively argues Jonathan Halls. The University of Nottingham Energy Institute is set to be part of £5m collaboration to scale UK climate start-ups. We're excited to be part of this new initiative that will support a network of climate innovators."
        }
    ],
    "pdf_files": []
}