{
    "url": "https://www.nottingham.ac.uk/research/groups/environmental-change/index.aspx",
    "content": [
        {
            "p": "Impacts of human activities alter how the natural world works. Two major impacts which are the focus of work in our group are climate change and land use change. Climate change is heating the planet, causing impacts such as floods, heat waves, thawing of permafrost, droughts, and forest fires, with serious consequences for ecosystems and people. Land use change as a result of human activities such as agriculture and industry is driving rapid decreases in biodiversity and causing water and air pollution. It is our ambition to identify, quantify and understand the drivers of such changes, in order to help devise effective solutions. To inform our understanding of human-caused activities, our work also considers the causes of environmental change and drivers of mass extinction in the past to help assess the vulnerability of different aspects of the Earth’s system and long term adaptation of ecosystems to environmental change. Environmental change is one of the most pressing problems facing humanity at present. Research into this diverse theme within the division is equally broad and spans a variety of topics, different geographical locations, and seeks to reconstruct changes in key environmental parameters through geological time. We use a diverse range of techniques including landscape-scale experiment and field-based data collection, lab analyses, and modelling approaches. In relation to climate change, the group’s expertise include assessing ecosystem responses to climate change, using nature based solutions to mitigate climate change, assessing methane emissions from livestock, and assessing interactions between climate and diversity over geological time. In relation to land use change and pollution, the group considers the impacts of rainforest logging, sustainable management of tropical agriculture, and the impacts of pollution on air quality in both rural and urban environments. Testing strategies for ecological management to benefit ecosystem services and sustainable production in smallholder oil palm systems in Malaysia and Indonesia. February 2021-November 2022. With Dr Ed Turner, University of Cambridge (PI), and others. £249K. Agro-ecological approaches to the fall armyworm management in Nigeria: testing strategies, building capacity, and developing collaborations. May 2021-April 2022. With Dr Mobolade Akinbuluma, University of Ibadan (Co-PI), and others. £19K. Chemical analysis of fossil spores and pollen grains to track variation in the amount and quality of sunlight reaching the Earth’s surface. This work is supported by the Natural Environment Research Council and the Human Frontier Science Program. CongoPeat: Past, Present and Future of the Peatlands of the Central Congo Basin. 2018-2023. NERC large-grant £3.7 million. Example papers Luke, S. H., Advento, A. D., Aryawan, A. A. K., Adhy, D. N., Ashton-Butt, A., Barclay, H., Dewi, J. P., Drewer, J., Dumbrell, A. J., Edi, Eycott, A. E., Harianja, M. F., Hinsch, J. K., Hood, A. S. C., Kurniawan, C., Kurz, D. J., Mann, D. J., Matthews Nicholass, K. J., Naim, M., … Turner, E. C. (2020). Managing Oil Palm Plantations More Sustainably: Large-Scale Experiments Within the Biodiversity and Ecosystem Function in Tropical Agriculture (BEFTA) Programme. Frontiers in Forests and Global Change, 2. https://doi.org/10.3389/ffgc.2019.00075 Luke, S. H., Barclay, H., Bidin, K., Chey, V. K., Ewers, R. M., Foster, W. A., Nainar, A., Pfeifer, M., Reynolds, G., Turner, E. C., Walsh, R. P. D., & Aldridge, D. C. (2017). The effects of catchment and riparian forest quality on stream environmental conditions across a tropical rainforest and oil palm landscape in Malaysian Borneo. Ecohydrology, 10(4), e1827. https://doi.org/10.1002/eco.1827 Luke, S. H., Dow, R. A., Butler, S., Vun Khen, C., Aldridge, D. C., Foster, W. A., & Turner, E. C. (2017). The impacts of habitat disturbance on adult and larval dragonflies (Odonata) in rainforest streams in Sabah, Malaysian Borneo. Freshwater Biology, 62(3), 491–506. https://doi.org/10.1111/fwb.12880 Luke, S. H., Slade, E. M., Gray, C. L., Annammala, K. v., Drewer, J., Williamson, J., Agama, A. L., Ationg, M., Mitchell, S. L., Vairappan, C. S., & Struebig, M. J. (2019). Riparian buffers in tropical agriculture: Scientific support, effectiveness and directions for policy. Journal of Applied Ecology, 56(1), 85–92. https://doi.org/10.1111/1365-2664.13280 Sjögersten S, Barreda-Bautista B, Brown C, et al 2021. Coastal wetland ecosystems deliver large carbon stocks in tropical Mexico. Geoderma, 403,115-173 Cooper H, Evers S, Aplin P et al 2020. Greenhouse gas emissions resulting from conversion of peat swamp forest to oil palm plantation. Nat Commun 11, 407 Sjögersten S, Siegenthaler A, Lopez OR, Aplin P, Turner B, Gauci V. 2019. Methane emissions from tree stems in neotropical peatlands. New Phytologist, online first. https://doi.org/10.1111/nph.16178. Väisänen M., Ylänne H., Kaarlejärvi E., Sjögersten S., Olofsson J., Crout N., Stark S. 2014. Consequences of warming on tundra carbon balance determined by reindeer grazing history. Nature Climate Change, DOI: 10.1038/NCLIMATE2147. Results from this research group are leading to a mechanistic understanding of past climate change and understanding of ecosystem feedbacks, the development of the UK Agricultural Greenhouse Gas Research Platform and the delivery of information to the carbon capture and storage industry. Applied and Behavioural Ecology Plant-soil Interactions Biogeochemistry and Biogeochemical Modelling The University of Nottingham C27 Gateway Building, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6239 email:sofie.sjogersten@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}