{
    "url": "https://www.nottingham.ac.uk/research/groups/spmic/aboutus/history.aspx",
    "content": [
        {
            "p": "The University of Nottingham has been at the centre of developments in Magnetic Resonance since its inception, and carried out much early, pioneering work in the mid-1970s. Before then, Nuclear Magnetic Resonance (NMR) could only provide information from a whole sample, rather than about the internal structure of a sample. In the mid 1970s there were three groups in the then Department of Physics at the University of Nottingham, all working on NMR and subsequently MRI. The competition between them was fierce, but highly productive. Famous names from the early 1970s include Raymond Andrew, Sir Peter Mansfield, Peter Alan and Bill Derbyshire. Early MRI was slow and produced coarse images, whereas nowadays MRI images can be exquisite in their detail. This change has been brought about by a combination of massive improvements in scanner hardware and the development of increasingly imaginative imaging methods. Nottingham has played its part in both of these. Sir Peter Mansfield grew up in London during the war, a fact that made him interested in science. Early on he was told he didn’t have the qualifications to become a scientist, but his dogged determination drove him to get a physics degree from Queen Mary College, London (now QMUL) at the age of 26. His life story is described in his autobiography. Sir Peter Mansfield's vision allowed him to understand how to transform NMR into a medical imaging technique, and also enabled him to foresee what would be required to make the technique clinically useful, and to identify early on, many of the potential areas of application for MRI in clinical medicine. His work was years ahead of its time. He was awarded the Nobel Prize for Physiology and Medicine in 2003 with Paul Lauterbur. Click here for more information. Sir Peter was responsible for the introduction of new understanding of important aspects of the physics of NMR and image formation, as well as the invention of many of the techniques and features of the scanner equipment that were needed to make clinical MRI a reality. One of Sir Peter Mansfield’s earliest important contributions was the invention of a method for selecting a slice through a person. However, he is probably best known for his invention of EPI in the late 1970s, which has been used in medical research since the early 1990s and is now used widely to look at brain function. In 1991, with funding from the British Technology Group and the University of Nottingham, a Magnetic Resonance Centre was established to house the expanding Magnetic Resonance Group. Initial work focused on dynamic imaging using echo-planar imaging (EPI), NMR microscopy and neurospectroscopy. The delivery of the world’s first 3T magnet led to applications in functional MRI (fMRI), including some of the first ever event related studies. Sir Peter formally retired in 1994 (though he continued with research into quiet gradient technology) and Professor Peter Morris took over as Director. In 2002 a generous donation from Sir Peter enabled the Centre to be expanded, and it was re-named the Sir Peter Mansfield MR Centre (SPMMRC) in his honour. Shortly afterwards, Sir Peter was awarded the 2003 Nobel Prize for Physiology or Medicine. The expansion enabled the delivery of the UK’s first 7T scanner (funded by the Wellcome Trust and HEFCE) in 2005, and ultra-high field MR became a major research priority during the next decade (funded, primarily, by the Medical Research Council (MRC)). This was the first human MRI scanner in the University of Nottingham which was not home built. A 3T system and, in 2007, a 275-channel magnetoencephalography (MEG) scanner were soon added. Further funding from the Wolfson Foundation and the Engineering and Physical Sciences Research Council (EPSRC) supported a major expansion of work in hyperpolarised technologies. In 2015, a £7.7M grant from the MRC enabled the imaging activities at the Queens Medical Centre (QMC) to be brought together with those of SPMMRC and the combined multidisciplinary facility was re-named the Sir Peter Mansfield Imaging Centre (SPMIC). In 2016 Professor Peter Morris, CBE retired as Director and was succeeded by Professor Richard Bowtell. The Centre has grown dramatically over its first 25 years, benefitting from its many excellent postdoctoral fellows and training in excess of 200 PhD students. Sir Peter Mansfield Imaging Centre Celebration: 13 January 2017 The story of Sir Peter Mansfield and MRI Sir Peter Mansfield - Book of Condolence"
        }
    ],
    "pdf_files": []
}