{
    "url": "https://www.nottingham.ac.uk/researcher-academy/people/alan.chamberlain",
    "content": [
        {
            "p": "Research Repository All Output Person Project TYPE YEAR Augmenting musical instruments with digital identities (2024) Journal Article Benford, S., McGarry, G., Hazzard, A., Chamberlain, A., Gibson, R., & Avila, J. P. M. (2024). Augmenting musical instruments with digital identities. Journal of New Music Research, https://doi.org/10.1080/09298215.2024.2423613 We explore how augmenting musical instruments with digital identities can enhance their provenance, utility during creative practice, and personal meaning. A literature review reveals the importance of object identities in general and instrument iden... Read More about Augmenting musical instruments with digital identities. What you hear is what you see? Perspectives on modalities in sound and music interaction (2024) Journal Article Iber, M., Enge, K., Rönnberg, N., Neidhardt, A., Schnell, N., Pollack, K., kallionpää, M., & Chamberlain, A. (2024). What you hear is what you see? Perspectives on modalities in sound and music interaction. Personal and Ubiquitous Computing, 28, 655-656. https://doi.org/10.1007/s00779-024-01835-3 Special issue: Perspectives on Modalities in Sound and Music Interaction Issue Editors: Michael Iber, Kajetan Enge, Niklas Rönnberg, Annika Neidhardt, Norbert Schnell, Katharina Pollack, Maria Kallionpää, Alan Chamberlain Full Contents https:... Read More about What you hear is what you see? Perspectives on modalities in sound and music interaction. How Artists Improvise and Provoke Robotics (2024) Presentation / Conference Contribution Benford, S., Garrett, R., Schneiders, E., Tennent, P., Chamberlain, A., Avila, J., Brundell, P., & Castle-Green, S. (2024, October). How Artists Improvise and Provoke Robotics. Poster presented at 16th International Conference on Social Robotics + AI (ICSR + AI) 2024, Odense, Denmark We explore transdisciplinary collaborations between artists and roboticists across a portfolio of artworks. Brendan Walker's Bronco-matic was a breath controlled mechanical rodeo bull ride. Blast Theory's Cat Royale deployed a robot arm to play with... Read More about How Artists Improvise and Provoke Robotics. Designing Prosocial More-Than-Human Rhetoric within Experiential Futures (2024) Presentation / Conference Contribution Coulton, P., Stead, M., Pilling, M., Crabtree, A., Chamberlain, A., & Sailaja, N. (2024, October). Designing Prosocial More-Than-Human Rhetoric within Experiential Futures. Presented at Mindtrek 2024, Tampere, Finland While prosocial behaviour is often described as behaviour intended to help and benefit others, it is primarily considered through an anthropocentric lens in that the others in question are principally humans. In this research, we consider designed sy... Read More about Designing Prosocial More-Than-Human Rhetoric within Experiential Futures. Responsibility and Regulation: Exploring Social Measures of Trust in Medical AI (2024) Presentation / Conference Contribution McGarry, G., Crabtree, A., Chamberlain, A., & Urquhart, L. D. (2024, September). Responsibility and Regulation: Exploring Social Measures of Trust in Medical AI. Presented at Second International Symposium on Trustworthy Autonomous Systems (TAS ’24), Austin, Texas, USA This paper explores expert accounts of autonomous systems (AS) development in the medical device domain (MD) involving applications of artificial intelligence (AI), machine learning (ML), and other algorithmic and mathematical modelling techniques. W... Read More about Responsibility and Regulation: Exploring Social Measures of Trust in Medical AI. Making of an Adaptive Podcast that Engenders Trust through Data Negotiability (2024) Presentation / Conference Contribution Sailaja, N., Crabtree, A., Lodge, T., Chamberlain, A., Coulton, P., Pilling, M., & Forrester, I. (2024, June). Making of an Adaptive Podcast that Engenders Trust through Data Negotiability. Presented at IMX 2024 - Proceedings of the 2024 ACM International Conference on Interactive Media Experiences, Stockholm, Sweden As novel media experiences turn towards audience personal data for enhancement, a range of socio-technical challenges that confront their adoption into the everyday lives of audiences are simultaneously surfaced. Podcasts, being the latest member of... Read More about Making of an Adaptive Podcast that Engenders Trust through Data Negotiability. What's in it for Me: Exploring the Real-World Value Proposition of Pervasive Displays (2024) Presentation / Conference Contribution Hosio, S., Goncalves, J., Kukka, H., Chamberlain, A., & Malizia, A. (2014, June). What's in it for Me: Exploring the Real-World Value Proposition of Pervasive Displays. Presented at PerDis '14: Proceedings of The International Symposium on Pervasive Displays, Copenhagen, Denmark The future of pervasive public display networks is loaded with high expectations. Non-commercial displays are commonly envisaged as proliferating in numerous contexts and domains, where they offer various uses for a variety of everyday users. In this... Read More about What's in it for Me: Exploring the Real-World Value Proposition of Pervasive Displays. Communication, Collaboration, and Coordination in a Co-located Shared Augmented Reality Game: Perspectives From Deaf and Hard of Hearing People (2024) Presentation / Conference Contribution Luna, S. M., Xu, J., Papangelis, K., Tigwell, G. W., Lalone, N., Saker, M., Chamberlain, A., Laato, S., Dunham, J., & Wang, Y. (2024, May). Communication, Collaboration, and Coordination in a Co-located Shared Augmented Reality Game: Perspectives From Deaf and Hard of Hearing People. Presented at CHI Conference on Human Factors in Computing Systems (CHI ’24), Honolulu, HI, USA Co-located collaborative shared augmented reality (CS-AR) environments have gained considerable research attention, mainly focusing on design, implementation, accuracy, and usability. Yet, a gap persists in our understanding regarding the accessibili... Read More about Communication, Collaboration, and Coordination in a Co-located Shared Augmented Reality Game: Perspectives From Deaf and Hard of Hearing People. Designing Multispecies Worlds for Robots, Cats, and Humans (2024) Presentation / Conference Contribution Schneiders, E., Benford, S., Chamberlain, A., Mancini, C., Castle-Green, S., Ngo, V., Row Farr, J., Adams, M., Tandavanitj, N., & Fischer, J. (2024, May). Designing Multispecies Worlds for Robots, Cats, and Humans. Presented at CHI Conference on Human Factors in Computing Systems (CHI ’24), Honolulu, HI, USA We reflect on the design of a multispecies world centred around a bespoke enclosure in which three cats and a robot arm coexist for six hours a day during a twelve-day installation as part of an artist-led project. In this paper, we present the proje... Read More about Designing Multispecies Worlds for Robots, Cats, and Humans. Charting Ethical Tensions in Multispecies Technology Research through Beneficiary-Epistemology Space (2024) Presentation / Conference Contribution Benford, S. D., Mancini, C., Chamberlain, A., Schneiders, E., Castle-Green, S. D., Fischer, J. E., Kucukyilmaz, A., Salimbeni, G., Ngo, V. Z. H., Barnard, P., Adams, M., Tandavanitj, N., & Row Farr, J. (2024, May). Charting Ethical Tensions in Multispecies Technology Research through Beneficiary-Epistemology Space. Presented at CHI '24 CHI Conference on Human Factors in Computing Systems, Hawaii, USA While ethical challenges are widely discussed in HCI, far less is reported about the ethical processes that researchers routinely navigate. We reflect on a multispecies project that negotiated an especially complex ethical approval process. Cat Royal... Read More about Charting Ethical Tensions in Multispecies Technology Research through Beneficiary-Epistemology Space. Adaptive XAI: Towards Intelligent Interfaces for Tailored AI Explanations (2024) Presentation / Conference Contribution Turchi, T., Malizia, A., Paternò, F., Borsci, S., & Chamberlain, A. (2024, March). Adaptive XAI: Towards Intelligent Interfaces for Tailored AI Explanations. Presented at 29th International Conference on Intelligent User Interfaces, Greenville, South Carolina, USA As the integration of Artificial Intelligence into daily decision-making processes intensifies, the need for clear communication between humans and AI systems becomes crucial. The Adaptive XAI (AXAI) workshop focuses on the design and development of... Read More about Adaptive XAI: Towards Intelligent Interfaces for Tailored AI Explanations. FUTURE MACHINE: Making Myths & Designing Technology for a Responsible Future: Making Myths and Entanglement: Community engagement at the edge of participatory design and user experience (2023) Presentation / Conference Contribution Jacobs, R., Spence, J., Abbott, F., Chamberlain, A., Heim, W., Yemaoua Dayo, A., Kemp, D., Benford, S., Price, D., Shackford, R., Robson, J., Locke, C., & King, J. (2023, October). FUTURE MACHINE: Making Myths & Designing Technology for a Responsible Future: Making Myths and Entanglement: Community engagement at the edge of participatory design and user experience. Presented at Mindtrek '23: 26th International Academic Mindtrek Conference, Tampere, Finland This paper explores the unique methods and strategies employed by a team of artists, in collaboration with engineers, programmers, a climate scientist, researchers and members of the public, who have come together to create the Future Machine, with t... Read More about FUTURE MACHINE: Making Myths & Designing Technology for a Responsible Future: Making Myths and Entanglement: Community engagement at the edge of participatory design and user experience. Personal and ubiquitous computing, special issue: “Sonic experiences: interaction, connectivity, and multi-sensory technologies” (2023) Journal Article Turchet, L., Chamberlain, A., & Kallionpää, M. (in press). Personal and ubiquitous computing, special issue: “Sonic experiences: interaction, connectivity, and multi-sensory technologies”. Personal and Ubiquitous Computing, 27(5), 1779–1781. https://doi.org/10.1007/s00779-023-01777-2 This special issue is a collection of papers from the Audio Mostly conference held in Trento, Italy, in 2021. The theme of the conference was, “Sonic Experiences in the Era of the Internet of Sounds”. Unfortunately, the conference was held during the... Read More about Personal and ubiquitous computing, special issue: “Sonic experiences: interaction, connectivity, and multi-sensory technologies”. Five Provocations for a More Creative TAS (2023) Presentation / Conference Contribution Benford, S., Hazzard, A., Vear, C., Webb, H., Chamberlain, A., Greenhalgh, C., Ramchurn, R., & Marshall, J. (2023, July). Five Provocations for a More Creative TAS. Presented at First International Symposium on Trustworthy Autonomous Systems (TAS 23), Edinburgh, UK Conventional wisdom has it that trustworthy autonomous systems (AS) should be explainable, dependable, controllable and safe tools for humans to use. Reflecting on a portfolio of artistic applications of TAS leads us adopt an alternative stance and t... Read More about Five Provocations for a More Creative TAS. Responsible AI and the Arts: The Ethical and Legal Implications of AI in the Arts and Creative Industries (2023) Presentation / Conference Contribution Piskopani, A.-M., Chamberlain, A., & Ten Holter, C. (2023, July). Responsible AI and the Arts: The Ethical and Legal Implications of AI in the Arts and Creative Industries. Poster presented at First International Symposium on Trustworthy Autonomous Systems (TAS '23), Heriot-Watt University, Edinburgh This position piece starts to examine the ways in which AI-based autonomous technologies have begun to influence a range of human activities in the arts and creative industries.The rise of AI-generated art could potentially transform the act of creat... Read More about Responsible AI and the Arts: The Ethical and Legal Implications of AI in the Arts and Creative Industries. TAS for Cats: An Artist-led Exploration of Trustworthy Autonomous Systems for Companion Animals (2023) Presentation / Conference Contribution Schneiders, E., Chamberlain, A., Fischer, J. E., Benford, S., Castle-Green, S., Ngo, V., Kucukyilmaz, A., Barnard, P., Row Farr, J., Adams, M., Tandavanitj, N., Devlin, K., Mancini, C., & Mills, D. (2023, July). TAS for Cats: An Artist-led Exploration of Trustworthy Autonomous Systems for Companion Animals. Presented at First International Symposium on Trustworthy Autonomous Systems (TAS 23), Edinburgh, UK Cat Royale is an artist-led exploration of trustworthy autonomous systems (TAS) created by the TAS Hub's creative ambassadors Blast Theory. A small community of cats inhabits a purpose built 'cat utopia' at the centre of which a robot arm tries to en... Read More about TAS for Cats: An Artist-led Exploration of Trustworthy Autonomous Systems for Companion Animals. Responsible AI and the Arts: The Ethical and Legal Implications of AI in the Arts and Creative Industries (2023) Presentation / Conference Contribution Piskopani, A. M., Chamberlain, A., & Ten Holter, C. (2023, July). Responsible AI and the Arts: The Ethical and Legal Implications of AI in the Arts and Creative Industries. Presented at First International Symposium on Trustworthy Autonomous Systems (TAS 23), Edinburgh, UK A Practical Taxonomy of TAS-related Usecase Scenarios (2023) Presentation / Conference Contribution Masters, P., Young, V., Chamberlain, A., Weerawardhana, S., McKenna, P. E., Lu, Y., Dowthwaite, L., Luff, P., & Moreau, L. (2023, July). A Practical Taxonomy of TAS-related Usecase Scenarios. Presented at Proceedings of the First International Symposium on Trustworthy Autonomous Systems, Edinburgh, UK This paper proposes a taxonomy of experimental usecase scenarios to facilitate research into trustworthy autonomous systems (TAS). Unable to identify an open-access repository of usecases to support our research, the project team embarked on developm... Read More about A Practical Taxonomy of TAS-related Usecase Scenarios. Explainable AI for the Arts: XAIxArts (2023) Presentation / Conference Contribution Bryan-Kinns, N., Ford, C., Chamberlain, A., Benford, S. D., Kennedy, H., Li, Z., Qiong, W., Xia, G. G., & Rezwana, J. (2023, June). Explainable AI for the Arts: XAIxArts. Presented at 15th Conference on Creativity and Cognition (C&C 23), New York, NY This first workshop on explainable AI for the Arts (XAIxArts) brings together a community of researchers and creative practitioners in Human-Computer Interaction (HCI), Interaction Design, AI, explainable AI (XAI), and Digital Arts to explore the rol... Read More about Explainable AI for the Arts: XAIxArts. Socio-Technical Trust For Multi-Modal Hearing Assistive Technology (2023) Presentation / Conference Contribution Williams, J., Azim, T., Piskopani, A. M., Chamberlain, A., & Zhang, S. (2023, June). Socio-Technical Trust For Multi-Modal Hearing Assistive Technology. Presented at ICASSPW 2023 - 2023 IEEE International Conference on Acoustics, Speech and Signal Processing Workshops, Proceedings, Rhodes Island, Greece The landscape of opportunity is rapidly changing for audio-visual (AV) hearing assistive technology. While hearing assistive devices, such as hearing aids, have traditionally been developed for populations of deaf and hard of hearing (DHH) communitie... Read More about Socio-Technical Trust For Multi-Modal Hearing Assistive Technology. Showing 1 - 20 of 114 results Repository@Nottingham Powered by Worktribe | Accessibility"
        }
    ],
    "pdf_files": []
}