{
    "url": "https://www.nottingham.ac.uk/research/groups/reproduction-gamete-biology/index.aspx",
    "content": [
        {
            "p": "This programme of work concerns mechanisms that regulate the earliest stages of development (vertebrate and invertebrate), including processes involved in egg and sperm maturation, fertilisation and embryogenesis. Disciplines span the production and use of sex-sorted semen for in vitro fertilisation in cattle, effects of parental diet on epigenetic modifications to sperm and pre-implantation embryos leading to altered offspring health (mouse, rat and sheep), cellular differentiation and limb-muscle development (chick embryo), effects of exposure to environmental chemicals on the development of reproductive tissues and fertility (bees, mice and sheep), prenatal and neonatal stress and neurological development in offspring (rat and sheep). To enhance our understanding of the mechanisms that regulate early development with a view to improving fertility, long-term development, production efficiency (in the context of livestock and global-food security), and offspring health and wellbeing. In-house expertise in sperm and oocyte biology, molecular embryology and myogenesis, epigenetics, and behaviour. BBSRC-IPA (BB/K017810/1). Genetics of one-carbon metabolism in sheep in relation to productivity, fertility and health. Levy Board (EBLEX, HCC, AgriSearch) supported in collaboration with Roslin Institute. TSB (101069). Advanced breeding technologies to amplify and distribute bovine genetics to increase production efficiency and sustainability. Partners: Paragonvet Ltd, XLVets UK, Ltd, Cogent Breeding Ltd TSB (TS/L004259/1): Optimising the delivery of superior genetics through advanced genomic selection of bovine embryos. Partners: Paragonvet Ltd, XLVets UK, Ltd, Cogent Breeding Ltd, University of Kent SRUC/Nottingham University PhD studentship: Impact of prenatal and postnatal stress on offspring behaviour and epigenetic regulation of stress axis function in sheep Stem cells Endocrinology, ovarian function and reproductive health Developmental Programming of Health and Disease Reproductive Biology The University of Nottingham 216 South Laboratory, Sutton Bonington Campus Loughborough, LE12 5RD telephone: +44 (0) 115 951 6053 email:kevin.sinclair@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}