{
    "url": "https://www.nottingham.ac.uk/research/groups/cells-organisms-and-molecular-genetics/index.aspx",
    "content": [
        {
            "p": "By studying cells, organisms and molecular genetics, our team is developing powerful new knowledge about how genes create organisms – and how those organisms adapt in their environments. We’re using and sharing our research to make a diverse range of products, from biofuels and synthetic polymers to the cheese in your fridge. At the same time, we’re informing vital decisions around food security and species conservation in developing countries. Exploring the building blocks that make up every species on earth opens up fascinating, far-reaching opportunities. From medicine to conservation, green energy to food security, our inclusive, imaginative work brings researchers from diverse disciplines together to achieve groundbreaking results. We’re making a positive impact across a whole range of sectors, driving the development of new products like biofuels, synthetic polymers and even everyday cheese. We’re also making a powerful contribution to conservation and food security in some of the world’s most vulnerable communities. As an outward-looking team, we’re always looking to share knowledge and inspire others through initiatives like Pint of Science and Open Air Laboratories, as well as spotlight projects like Jeremy the snail, Camels of the desert and the 25 Genome Project. We collaborate widely both outside the division and the University and make a significant contribution to biology, genetics, zoology and natural sciences teaching. We’re here to conduct powerful research that makes a difference in the real world – deepening our understanding of fundamental biology so we can harness its potential to improve lives. For us, that means contributing to the development of new medicines, preventing the spread of disease, providing the clean fuels of the future, empowering vulnerable communities to feed themselves, and so much more. Along the way, we want to share our knowledge, inspire new generations of scientists and promote equality, diversity and inclusion in everything we do. Explore how Dr Helen Miranda Knight's lab have gained understanding of how methylation of RNA plays a key role at synapses and potentially underpins neurological conditions Learn how Mary O'Connell has explored how the TRIF protein contributes to the immune system and how optimal TRIF function is achieved See more about Fiona Whelan's research that investigates human microbes, their ecological patterns and the associations of genetic elements during dysbiosis Learn how Professor Levi Yant's expertise in genomic evolution contributes to the University's Future Food Beacon Read more news See how we’re searching for the causes of life-threatening congenital conditions. Find out how we’re unlocking the secrets of an increasingly important species. Discover how we’re creating sustainable, economical speciality chemicals. School of Life Sciences University of Nottingham Medical School Queen's Medical Centre Nottingham NG7 2UH"
        }
    ],
    "pdf_files": []
}