{
    "url": "https://www.nottingham.ac.uk/research/research-areas/energy-institute/projects/biochar/index.aspx",
    "content": [
        {
            "p": "Storing carbon to combat climate change Nottingham researchers are leading a £4.5m study on sustainable technology to remove CO2 from the air. The University of Nottingham is leading the UK’s largest trial to evaluate the viability of a material called biochar to store carbon from the atmosphere to counter the impact of climate change. The £4.5m project is one of five UK Research and Innovation-funded demonstrators investigating the adoption of Greenhouse Gas Removal (GGR) technologies to cut CO2 emissions at a scale that may help the UK reach its net-zero target by 2050. The project has recently been cited in a UK Parliament Research Briefing 'Restoring agricultural soils'. Field trials are being conducted at arable and grassland sites in the Midlands and Wales, as well as former mines, and woodlands across England and Wales. Biochar is a charcoal-like substance, produced by heating organic biomass from agriculture and forestry waste in the absence of oxygen (pyrolysis) to make it carbon-rich and chemically-stable. In the UK, it has been produced on an extremely small-scale in kilns and it is mainly sold as a mulch for horticulture. Compared to commercial-grade charcoal we use on BBQs, biochar is similar but, ideally, should be produced at higher temperatures to produce carbon that will be stable over hundreds of years. However, its effectiveness, cost, social acceptability and limitations need to be better understood and proven at scale. Phase 2 of the GGR programme includes £5m funding awarded to Coal Products Limited (now Invica Industries) for a demonstration plant to establish the viability of large-scale conversion of biowaste from anaerobic digestion to biochar. Production needs to be increased to over a million of tonnes per annum to make a significant contribution to support the Government net zero emission targets by 2050. Britain would need to invest in many facilities which would not only produce the biochar, but the gases generated in the charring process can be used to provide renewable heat and power. The research team will take a “technology-neutral” stance and evaluate both the carbon storage and economic performance of biochar as a greenhouse gas removal technology to inform policy-makers with their findings. As Nottingham’s project lead, Professor Colin Snape, Director of the university’s EPSRC Centre of Doctoral Training in Carbon Capture and Storage and Cleaner Fossil Energy explains, Half of the carbon goes into the biochar and much of the other half is converted into heat and power which is recovered in a large-scale plant. It’s a very energy-efficient, carbon neutral system. The aim is to take carbon from atmospheric emissions and trap it in the biochar. That carbon will then be locked in the soil for centuries, if not millennia, so its sustainable production could be a powerful tool in the fight against climate change. However, we need to get a detailed and accurate picture of the longevity and stability of biochar carbon in soils to ensure it has no detrimental impact.\" To assess how much biochar can be deployed in the UK without adversely affecting the soil ecosystem, the project will be established at commercial scale in the largest integrated trial of its kind. To facilitate the research, over 200 tonnes of biochar will be prepared from virgin and recycled wood. Biochars will be tested prior to field application at the University of Nottingham, where Dr Will Meredith, Assistant Professor in Fuel Science and Technology, will analyse its characteristics, the stability of the carbon it holds and the rate it degrades over time. Chemical analysis will tell us how much of the carbon applied as biochar is actually locked away in the soil long-term, and how much goes back into the atmosphere as CO2. This will show how effective large-scale biochar deployment could be as a method of greenhouse gas removal.\" Small field-plot trials will then investigate the interplay between biochars (applied at different rates); fertiliser, soil health and plant and microbial responses. The application combinations and rates that elicit the most positive results will be selected and used at the demonstrator sites to ascertain if responses are replicable at scale. The researchers will be adding the safe maximum of a few tonnes per hectare in a number of settings – arable, grassland and forestry – to understand the impact this soil amendment may have on plant-life and the soil ecosystem. One-hectare permanent plots will be established on 10 working farms across the Midlands which are engaged in the project’s field work. On each plot, biochar will be applied on half the field with the other half left untouched to study any notable variations in the soil. Biochar will also be incorporated in soil prior to tree planting at several nursery woodlands and spread on the surface in other mature forest locations. Additionally, biochar will be used on sites where the land is contaminated with heavy metals from prior industrial use. Biochar acts as an adsorbent, binding metal pollutants to its surface, which immobilises them and, over time, reduces their toxicity. Researchers will even add biochar on railway embankments that have lost vegetation to examine if this encourages regrowth and prevents soil erosion. Former open cast mines will also be investigated as potential vast carbon stores, in-filled with biochar. Dr Helen West is an environmental biologist at the University of Nottingham who will be monitoring land composition for the duration of the project. Her team will test soil and microbial health and crop yields as well as tree growth at the field sites. They will also investigate how biochar performs as a soil improver, particularly as a way to enhance organic carbon levels in soil that may been depleted due to past farming practices. The last thing we want to do is have a lasting, detrimental effect on crop yield or soil quality, so we will thoroughly investigate the impact of adding carbon-rich biochar to the soil on such a vast scale.\" In addition to testing on their land, farmers are key stakeholders on the project. Their views are being captured on what uses and benefits they want from the biomass that would provide economic as well as environmental returns on investment. To maximise biochar use in agriculture, the project aims to evaluate innovative ‘non-carbon’ uses that would elicit agronomic benefits over and above direct soil application. These include preventing agricultural run-off of nutrients and pesticides that can degrade water quality, reducing nitrogen losses during composting, preventing ammonia release from poultry farm buildings and increasing methane yields during anaerobic digestion (AD). \"If the project findings are positive, the government may consider giving farmers financial incentives to add biochar to their land. This would be pertinent, particularly given the introduction of the new Environmental Land Management scheme, which pays farmers public money to make their business more sustainable,\" explains Paul Wilson, Professor of Agricultural Economics and co-investigator. Support from the National Farmers Union’s - a project partner – which has a vision to drive a green revolution on British farms, making agriculture net zero by 2040, will raise awareness of the potential of biochar to help drive more sustainable farming practices. Professor Wilson added: “In addition to government incentives, industries that want to achieve carbon neutrality, such as airlines, may consider paying farmers to apply biochar on their fields; in a similar way to existing tree-planting initiatives to offset carbon emissions from air travel.” A wide range of other stakeholders will also be consulted within the project including agronomists and other significant advisors to land managers, farming and horticultural organisations both national and local, biochar producers, environmental organisations within civil society, and public health, agricultural and environmental policy makers. Dr Carol Morris, Associate Professor of Rural Environmental Geography and co-investigator will lead the investigation, through interviews, workshops and document analysis, of how these stakeholders know and understand the environmental risks and opportunities of biochar, and how this informs their perspectives on appropriate policy interventions in relation to biochar’s ability to capture and store (also known as sequestration) carbon. To contribute to meeting the UK’s net zero greenhouse gas emissions targets, biochar must be demonstrated to sequester carbon on long timescales (centuries or longer) and for its production to result in minimal greenhouse gas emissions. The project will quantify the financial and life cycle environmental impacts of biochar production, considering a range of feedstocks of relevance to the UK, and accounting for all stages of biochar production, its use, and the permanence of carbon sequestration. Dr Jon McKechnie, Associate Professor in the Faculty of Engineering, said “Waste feedstocks offer a particularly promising opportunity, where biochar production may avoid current costs and environmental impacts of waste treatment processes. We need to develop a comprehensive understanding of the costs of biochar production and its life cycle environmental impacts to identify near-term routes to deployment.” The research team for the multi-disciplinary project, entitled 'Biochar Demonstrator Addressing Key Deployment Barriers for Carbon Sequestration', comprises: Nottingham, Leeds and Bangor universities, UK Centre for Ecology and Hydrology, Forest Research, and the Scottish Universities Environment Research Centre. They will be supported by project partners from the agricultural sector, biochar producers and the international biochar community. Professor Sir Duncan Wingham, Executive Chair of the Natural Environment Research Council, part of UKRI, said: “Reducing greenhouse gas emissions is a priority for the UK, but it’s clear that alone that will not be enough to reduce CO2 and meet the UK’s net zero climate target by 2050. “These projects will investigate how we can actively remove greenhouse gases from the atmosphere using innovative technologies at the scale required to protect our planet. This investment is especially significant as the UK prepares to host COP26 in Glasgow later this year.” The £31.5m programme is part of the second wave of the Government’s Strategic Priorities Fund (SPF), which invests in high quality multi and interdisciplinary research. Contact Colin Snape to find out more. Restoring agricultural soils UK Parliament Research Briefing (2022)"
        }
    ],
    "pdf_files": []
}