{
    "url": "https://www.nottingham.edu.my/Research/Research-groups/Inclusion-in-the-workplace.aspx",
    "content": [
        {
            "p": "People with mental health issues or learning difficulties face multiple barriers to economic and social participation. However, given the right support, training and opportunities, disadvantaged groups are able to become valuable contributors to the country’s wealth and well-being. Promoting equality and ensuring the inclusion of marginalised and disadvantaged people is essential if Malaysia is to progress as a sustainable society and operate in a global setting. To this end, our talented researchers in organisational and applied psychology, finance, business and education have joined forces with government agencies, non-governmental organisations (NGOs) and employers. Collectively consider employment opportunities and accessibility as a fundamental human right, and together, we are building more sustainable livelihoods for people with mental health and learning difficulties. We particularly recognise that COVID-19 puts at risk the limited progress that has been made through the Person with Disability Act 2008, and these vulnerable groups are at risk of being left behind. The Inclusion in the Workplace group share Malaysia’s determination to strengthen economic growth by: reducing employer discrimination; improving workplace amenities; and increasing the country’s percentage of workers with mental health and learning difficulties. Our three major research objectives are directly aligned to the United Nations Sustainable Development Goals: Decent Work and Economic Growth (goal 8) and Reduced Inequality (goal 10). Mental health Understanding how mental health difficulties impacts on work and identifying practical solutions for employers Learning difficulties Raising awareness about access and employability Best practice in supported employment Advocating for standards of practice Our academic staff bring a range of internationally recognised expertise: The Inclusion in the Workplace group is dedicated to equality in the workplace for vulnerable people, and recognises the value this will contribute to industry and the country as a whole. We welcome approaches from commercial organisations, universities and other stakeholder groups who might have ideas for collaboration. If you share our commitment to empowerment and inclusion, please get in touch. For general enquiries: Director, Dr Shi Wei Chu email: ShiWei.Chu@nottingham.edu.my For research collaboration and business engagement enquiries: email: RKE.Hub@nottingham.edu.my telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}