{
    "url": "https://www.nottingham.ac.uk/researcher-academy/news/latest-news/postgraduate-researchers-from-diverse-backgrounds-a-framework-for-defining-measuring-and-supporting-success.aspx",
    "content": [
        {
            "p": "Postgraduate Researchers from Diverse Backgrounds: A Framework for Defining, Measuring and Supporting Success is the latest addition to the Researcher Academy’s portfolio of best practice guides aimed at supporting colleagues to recruit, retain and support students with the highest potential and desire to succeed in a diverse PGR community. Efforts to increase the diversity of the PGRs we recruit must be accompanied by work to ensure that ongoing support is effective, rooted in inclusivity, and tied to the needs of our postgraduate researchers. Measures for success in postgraduate research are not well-established beyond narrow measures such as thesis submission and completion rates, career destinations and publication metrics. By including broader and more inclusive parameters, we benefit not only researchers from diverse backgrounds but our whole researcher community. This framework offers practical actions and approaches that are flexible by design and can be easily adapted to the structures and needs of different schools, faculties and higher education institutions. It is based on PGR-led research and highlights case studies of existing and emerging practice and specific experiences of PGRs from different backgrounds. This framework is an output from a Collaborative Enhancement Project funded by QAA Membership. This project is led by the Researcher Academy at the University of Nottingham in partnership with the Scottish Graduate School of Social Sciences, the University of Leeds, The University of Warwick and the UK Council for Graduate Education. UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/uon-researcheracademy-pgr-successproject.pdf"
    ]
}