{
    "url": "https://www.nottingham.ac.uk/research/groups/clinicalmetabolicandmolecularphysiology/index.aspx",
    "content": [
        {
            "p": "The Centre of Metabolism, Ageing, and Physiology (COMAP) research group aims to determine the mechanisms regulating mass and function of the musculoskeletal system, with a particular focus on age and age-associated conditions. Specifically, the group endeavours to uncover the mechanisms regulating alterations in protein and energy metabolism with ageing and disease by combining: The group also studies the efficacy of environmental interventions (primarily exercise and nutrition, but also some pharmacological strategies) in alleviating the deleterious effects of ageing and disease. Within this group there is also an interest in the transfer of physiology monitoring and assessment techniques to clinical settings. Skeletal muscle is the body’s largest organ, accounting for approximately 40% of body mass. Maintaining heathy muscles is essential for movement and also metabolic health (e.g. blood sugar levels). It is striking how many of the UK’s most prevalent diseases are associated with muscle wasting and/or compromised metabolic and mechanical funtion. Moreover, many of these diseases such as cancer (cachexia) and type II diabetes, are on the rise and muscle wasting in old age (sarcopenia) is a major problem given the demographic shift >70 y. Thus, determining the basis of musculoskeletal health, its decline in disease and ageing and interventions with which to treat it, is a major health priority. We have characterized the metabolic, molecular, and gene expression changes that occur in ageing muscle. Read more ... We are now examining if the observed molecular and metabolic alterations underlie the observed structural changes and also the potential relative importance of the observed gene expression changes as a cause of muscle decline with age. We are also investigating how ageing disrupts the cross-talk between the muscle and the nervous system as a key characteristic of sarcopenia. In parallel we are testing nutritional and exercise based interventions for efficacy in restoring muscle function in the aged. We have examined the metabolic changes that occur in muscle in a variety of clinical populations and have also identified a large number of genes and proteins that appear to influence muscle metabolism. We have established that a blunted anabolic response to feeding is a common feature in a variety of clinical populations. We are now attempting to understand the molecular basis for this anabolic blunting and are testing potential interventions for the ability to counter this metabolic problem. In parallel we are attempting to understand how the genes we have identified as regulating muscle metabolism do so in a coordinated function and which gene products represent promising targets for theraputic intervention. Current recent projects include: Through our research we have identified: The group has a close interaction with the Metabolic and Molecular Physiology Research Group in the School of Life Sciences and with a number of clinical departments. We form a central part of the MRC-ARUK Centre for Musculo-Skeletal Ageing and are members of the ARUK Centre for Sport, Exercise and Osteoarthritis. More news PhD opportunities Group members Division of Medical Sciences and Graduate Entry Medicine The University of Nottingham Royal Derby Hospital Uttoxeter Road, Derby, DE22 3DT telephone: +44 (0)1332 724622 email:gem@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}