{
    "url": "https://www.nottingham.ac.uk/research/nrc/patient-and-public-involvement-and-engagement.aspx",
    "content": [
        {
            "p": "The National Rehabilitation Centre (NRC) Patient and Public Involvement and Engagement (PPIE) Network has been established to ensure patients and the public with lived experience of rehabilitation can contribute all aspects research, innovation, education training within NRC. \"To be actively involved in strategic decision-making, and provide consistent and meaningful representation within clinical, research and innovation, and education and training, delivered through the NRC.\" The National Rehabilitation Centre values PPIE in its activities and will ensure the public and communities are empowered and supported to be actively and meaningfully involved all aspects of its work. Patient and public involvement and engagement (PPIE) is generally defined as research being carried out 'with' and 'by' members of the public rather than 'to' or 'for' them. When the public gets involved, they partner with researchers, clinicians etc. to help shape things such as: PPIE is not the same thing as taking part in a research study (which is known as participation). PPIE is about being a member of the research team working together to design and run the research, supporting relationships between patients, the public and researchers. Patients and members of the public with lived experience of rehabilitation bring unique perspectives. Learning from, and incorporating these experiences increases the quality of the research, leading to better outcomes. There are many ways in which PPIE can have an impact. PPIE members help us consider perspectives that the project team may not otherwise see. This can lead to improvements in health and rehabilitation services. PPIE team members may include (but are not limited to): We aim for diversity where possible when assembling are PPIE groups. The NRC PPIE Network has a wide range of members with different lived experiences, ages, and backgrounds. The PPIE team will typically have several meetings over the course of a year but other exchanges with the NRC team can take place occasionally. We are extremely grateful for the time and contribution that members bring to thePPIE Network. Members are offered reimbursement for their time, and expenses, inline with National Institute for Health and Care Research (NIHR) guidance. If you are not already a member of the PPIE Network and would like to join, use the following registration form: PPIE Network registration form"
        }
    ],
    "pdf_files": []
}