{
    "url": "https://www.nottingham.ac.uk/research/groups/strokerehabilitation/index.aspx",
    "content": [
        {
            "p": "Stroke rehabilitation aims to restore functional recovery and to facilitate patients and their carers to lead the lives they wish. Stroke is the third largest cause of death in the UK and the main cause of disability in a community setting. It frequently devastates the lives of stroke survivors and their families often leaving them depressed and unable to regain a meaningful life. The University of Nottingham strives to lead world class stroke rehabilitation research. Our focus is the development, and implementation of evidence that will enhance the quality of life of stroke survivors and their carers. Our research vision Our research ambitions and activities are rooted in more than 25 years experience of stroke rehabilitation research. We embrace interdisciplinary research and have the largest critical mass of health service research occupational therapists anywhere in the world. Our research activities utilise multiple methodologies; our particular expertise lies in the conduct of randomised controlled trials and implementation research. The core principles behind our research We want to conduct research that: We will proactively collaborate with partners in the NHS and social care colleagues, and other research institutions, both nationally and internationally, on all aspects of research activity with stroke survivors. We want to attract: We will ensure that all research endeavours produce high quality research publications, and will disseminate research findings through oral presentations to the local, national and international academic community and throughout the public domain. See projects The route to meaningful research activity can only be achieved by truly understanding the actual impact caused by stroke. In recognition of this we established a Stroke Research Partnership Group in 2004. This group has involvement in all our research activities from inception of the idea through to steering group membership of successfully funded studies. Find out more. The late Mr Ossie Newell MBE was founder member of the Nottingham Stroke Research Partnership Group, is honoured as a special appointment with our group as Ambassador for Stroke Rehabilitation Research. The Ossie Newell Foundation has funded two PhD studentships. ARC East Midlands Outcome measure for stroke survivors - Dynamic Visual Analogue Mood Scales (D-VAMS) The Nottingham University Life Cycle initiative which raised over £2 million, showcased the fantastic work being undertaken by our leading stroke rehabilitation specialists. Life Cycle 3 funds (£250,000) have supported multiple rehabilitation PhDs into topics such as young carers of stroke survivors, returning to work and stroke services in rural committees. However, the flagship project these philanthropic funds supported was the development of stroke services across Malaysia. Led by Nottingham University we have researched the unmet stroke needs of the Malaysian population. This is the first national rehabilitation project to be conducted across Malaysia and is already having a significant impact on the development of stroke services. Centre for Doctoral Training in Rehabilitation and Healthcare Research PhD studentships Watch our videos The Rehabilitation Research Group in the School of Health Sciences also carries out related research. Group members The University of Nottingham School of Medicine telephone: +44 (0) 115 823 0246 email:H.Taylor@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}