{
    "url": "https://www.nottingham.edu.my/Research/Inspiring-people/Chung-Lim-Law.aspx",
    "content": [
        {
            "p": "My research involves the processing and preservation of agricultural food products by drying and extracting their bioactive ingredients. I am currently studying how to maximise bioactive ingredients in a herbal product known as lemon myrtle. Once picked, the leaves have high moisture content and perish easily. Shelf life for this bio-origin product is typically only seven days to two weeks. We are exploring new ways to retain citral compounds – a bioactive ingredient in lemon myrtle with antibacterial and antifungal properties. Retaining the citral compounds after processing, could help to preserve the quality of the product and, in turn, cut waste. For the past 10 years, I have been working on developing a low-temperature drying technique that processes the product properly and safely preserves its quality and colour. This dehydration method, can preserve more of the antioxidants and vitamins that keep us well. It also removes water to prevent microorganism proliferation and toxins generation which could be harmful to human health. This technology is especially important to process industry that extracts active ingredients or nutrients from bio-origin products. Conventional processing techniques use hot air (typically above 60 °C) to process food, herbs, fruits and vegetables, but these high temperatures tend to damage the bioactive ingredients and nutrients in the product and therefore retain less amount of nutrients. Other active ingredients such as antioxidants, vitamin C can also be very sensitive to high temperature processing. This is where cool air processing technology can make its mark and benefit industry. With more of the bioactive ingredients intact, the product is better for our health. And if we can help to preserve more fruits and vegetables to bring them to market out-of-season, it benefits farmers and consumers alike. Another side to our research is looking at ways to make this arm of food processing more efficient and cost-effective, as well as energy efficient. Unlike thermal drying which is very energy intensive, our low temperature technique is more energy efficient and therefore gives less environmental impact. In fact, the operating and capital costs involved are minimal compared to hot air or freeze-drying alternatives. This is advantageous for the food industry as their profit margins are not high. Since 2006, my research team has applied this technique to process various bio-origin products, which include cocoa beans, fruits (ciku, chempedak, salak - these are tropical underutilised fruits; apple, pear, mango, papaya), herbs (misai kuching, belalai gajah - these are local herbs and Roselle, ganoderma lucidium), and edible bird nest. They found that low temperature drying is an effective way to retain bioactive ingredients in the processed products. We found that the low temperature drying technology is efficient in retaining bioactive ingredients, preserving the original colour of bio-origin products and therefore produce better product quality. It would be good to communicate directly with companies to understand the problem they face. It is imperative if we want to contribute to the development of technology that benefits the industry. The University encourages staff to solve problems faced by industry. In addition, we also receive good support in terms of hiring students. View full profile telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}