{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Developing-theoretical-perspectives-on-political-regimes-in-Southeast-Asia.aspx",
    "content": [
        {
            "p": "Southeast Asia has long been home to a mix of regime types and varying societal pressures beyond the state. With a long track record of living and working in the South East Asia region, first in Hong Kong and now in Malaysia, Professor William Case in the School of Politics, History and International Relations, has spent years observing domestic politics across the region. His work has tracked the emergence of varying political systems and analysed the obstacles that stand in the way of achieving democratic reform. He’s also written extensively on electoral authoritarianism and semi- and pseudo-democracies in Southeast Asia. Although his research has taken him across many countries, his current focus is fixed firmly on Malaysia. While the outward view of democracy in Malaysia might be of a series of dramatic pendulum swings – from dashed hopes of reform during the Reformasi protests (1998-) to the kleptocracy under the Najib Razak’s government (2009-2018), the shock election victory of Pakatan Harapan coalition (2018) and its dramatic collapse (2020) – closer scrutiny reveals a more complex reality. Malaysia has a hybrid political system that poses enduring structural challenges to democratisation. This system has remained in place through all the apparent ups and downs. A hybrid political system is a regime that appears on the surface to be democratic, but is in fact quite politically repressive. These regimes are widespread and often found in developing nations. Prof Case describes them as being a “soft version of authoritarian rule”. They permit democratic practices and processes, but at the same time allow little room for dissent. Prof Case has studied the longevity of such a regime in Malaysia. One of the most fundamental questions that his research addresses concerns political and structural impediments to democratic change. As such, his work closely monitors elite and mass-level attitudes toward electoral procedures, governance norms, corrupt practices and civil liberties. His research has identified executive abuses, patronage distributions, and societal tensions, especially ethno-religious conflict, that undermine democratic processes or diminish prospects for democratic change. Most recently, his work has provided an in-depth examination of the historic 14th General Election. Collaborating with researchers from the University of Malaya and Nanyang Technological University, and funded by the Star Media Group, Prof William was able to follow the election trail throughout Peninsular Malaysia, attending campaign events and meeting many of the electoral candidates and voters. In his commitment to careful data gathering, he’s even undertaken intensive instruction in the Malay language study so that he can access journalistic accounts and interview non-English speaking Malaysians. This information has been crucial to complement and enrich the more theoretical aspects of his work. His experience and unique insights into the nation’s political dynamics enabled him to be perhaps one of the first to argue that despite the electoral turnover in 2018, Malaysia’s hybrid politics would substantially persist. Although much of Prof Case’s research centres on Malaysia, his scholarly interests extend beyond the nation’s borders. He’s currently working on a major international collaboration sponsored by the Taiwan Institute of Democracy. This project investigates the relationship between the type of political regime and government responses to manage the COVID-19 pandemic. Project partners will be conducting regional analyses and comparisons across China and Northeast Asia, South Asia, Africa, and North and Latin America. Prof Case’s role is to identify the key characteristics that shaped Malaysia’s swift and effective response. What’s most interesting about this project is that it examines the ongoing pandemic through a political lens, not the more conventional scientific or public health perspectives. Research that focuses on the meaning and valuation of civil liberties and political rights holds great value at a juncture in which democracy has fallen into severe recession at the hands of populist pressures and autocratic leaders. Prof Case’s research not only puts Malaysia under a microscope, but contextualises what is happening in a broader picture. This does much to amplify the impact of his work. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}