{
    "url": "https://www.nottingham.ac.uk/research/groups/longtermconditions/index.aspx",
    "content": [
        {
            "p": "Led by Dr Kate Radford, the Rehabilitation in Long Term Conditions research group aims to promote wellbeing and enable people with long term conditions to maximise participation in meaningful social lives. About 15 million people in England have a long-term condition (LTC) or chronic disease for which there is currently no cure. Although more prevalent among older people, LTCs also affect younger people and the numbers are rising. LTCs are not just a health issue they can have a significant impact on a person’s ability to work and live a full life. Our research aims to enhance the quality of life of people with long term conditions and their families and optimise their ability to engage in meaningful lives. Our research spans the rehabilitation spectrum from prevention to participation. It includes behaviour modifying interventions to prevent disease, supporting patients at the health care interface, strategies to enable people to cope with long term conditions and those that facilitate participation through social networks and engage in everyday activities that promote financial wellbeing, such as driving and work. We work collaboratively with the Rehabilitation Research group in the School of Health Sciences We work closely with service users, health and social care professionals, and employers to address challenges to participation. Find out more about the way we involve service users in research. Our research is published in leading peer reviewed journals. Please see the individual staff profiles for publication details. We are funded by major agencies including the European Union, The NIHR Health Technology Assessment programme, The Stroke Association, the Multiple Sclerosis Society and the ESRC amongst others. The East London NHS Foundation Trust are trialling Dynamic Visual Analogue Mood Scales (D-VAMS), which Paul Barrows developed to help assess mood in stroke patients with aphasia. More info about D-VAMS can be found at the project portal: http://xvams.com/dvams/About.aspx The D-VAMS scales can be accessed online at: http://dvams.com More Rehabilitation and Ageing news Rehabilitation Psychology MSc Health Psychology MSc Postgraduate research in the School of Medicine Arthritis Research UK Pain Centre Group members School of Medicine Division of Rehabilitation and Ageing telephone: +44 (0)115 823 0226 email:kate.radford@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}