{
    "url": "https://www.nottingham.ac.uk/researcher-academy/advocacy/research-staff-group-rsg.aspx",
    "content": [
        {
            "p": "The Research Staff Group RSG is chaired by Dr Alan Chamberlain and reports through the activities of the Associate-PVC for the Researcher Academy and Researcher Career Development to Research Committee. Dr Chamberlain is committed to enhancing the research environment for Research Staff at the University of Nottingham and engaging with other organisations across the HE sector. He established the STAHR Collective in order to start to engage with researcher-related issues and create opportunities for interdisciplinary, and international individuals/organisations to engage in innovative ways. He has published numerous papers on many aspects of Human Computer Interaction and has successfully obtained funding for a wide range of research projects, working with international companies (BBC, BT & Microsoft), artists or world renown and leading experts across a variety of academic fields. He has been a Visiting Academic at the University of Oxford and Visiting Researcher at Swansea University. He is currently a Visiting Professor at the world leading Copenhagen Business School. He is the Chair of Future Research for EUSSET, an Editor for the Springer Nature Journal - Personal and Ubiquitous Computing. He has been part of the scientific program committee for many world-leading international conferences, including ACM CHI and CSCW. He is a member of the Audio Mostly Conference Series Steering Committee and Chaired the conference in 2019, bringing it to the University of Nottingham. From 2015 to 2018 he co-directed the Personal Data and Trust Network (Social and Cultural Innovation strand) - inc. EPSRC, Digital Catapult & Innovate UK. Dr Chamberlain is a based in the School of Computer Science, in the Faculty of Science. He is also a Visiting Fellow in the Music Department at the University of Nottingham. He is a Visiting Professor at the world-leading Copenhagen Business School. Profile page - https://www.nottingham.ac.uk/computerscience/people/alan.chamberlain STAHR Collective - https://www.nottingham.ac.uk/researcher-academy/partnership/the-stahr-collective.aspx UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": []
}