{
    "url": "https://www.nottingham.ac.uk/research/groups/education-division/index.aspx",
    "content": [
        {
            "p": "We are a globally leading university, so our students expect the highest quality of teaching and learning. Within the School of Life Sciences, our Education Division is dedicated to ensuring we achieve this by shaping the school’s longer term teaching and learning strategy. Working across the entire school, we’re committed to promoting educational excellence and scholarship by sharing best practice, introducing innovative teaching methods and supporting the development of teaching practice for all academic staff. Through a wide range of research projects, we’re exploring the latest technologies, evaluating novel approaches and helping our students thrive in a caring and stimulating environment. Teaching Resources for Applying Numeracy and Statistics for Objective Research Methods (TRANSFORM) is a major cross-disciplinary project. Its aims are to develop and disseminate resources that support the teaching and learning of applied statistics and research methods across courses in the sciences, social sciences, medicine and veterinary medicine. An initiative funded by the Faculty of Medicine and Health Sciences is taking one of the school’s key teaching innovations to new student groups within Health Sciences. It’s a cross-disciplinary project that will introduce peer assessment to nursing and midwifery undergraduates. The idea is that by assessing the coursework of their peers, these students will develop strong critical assessment skills, enabling them to improve their own work and better understand the feedback they’re given. With careful planning, this can be run in a high-stakes environment, where marks awarded by peers are counted towards students’ final grades. We’re currently running a pilot exploring the impact and ramifications of peer assessment on a naïve group of students. This funded initiative taps into the skills of our MSc Biological Photography and Imaging students. They’re producing high quality short films on common techniques in the life sciences, such as how to use a pipette properly. Students are sometimes hazy on the finer points of using a pipette, and mistakes can cause problems in their practical work. So, a film demonstrating the technique, accessible on our Moodle online learning platform, would be incredibly helpful. A series of films is planned, covering techniques that will help our students excel in any life sciences laboratory. The Peer Observation Scheme is a school-wide initiative designed to maintain our high standards of teaching and learning. Part of our quality control strategy, it engages every teaching-active academic with the developmental process of observing another academic’s teaching. This gives support, advice and food for thought to all of our academics, whether they’re acting as teacher or observer. School of Life Sciences University of Nottingham Medical School Queen's Medical Centre Nottingham NG7 2UH"
        }
    ],
    "pdf_files": []
}