{
    "url": "https://www.nottingham.ac.uk/research/groups/barriers/index.aspx",
    "content": [
        {
            "p": "It is estimated that 2.7 billion people worldwide rely on biomass fuels (fuelwood, charcoal, animal dung, grass, shrubs, agricultural residue) to meet basic cooking and heating needs. Many people cook on open fires inside their homes. As well as being fuel inefficient, women and children are exposed to harmful levels of wood smoke - a major cause of respiratory disease and premature death. Traditional cook stoves are also estimated to contribute around a third of global carbon monoxide emissions, while biomass smoke is thought to add to global warming. Improved cook stoves - designed to burn biomass fuels more cleanly and efficiently - have been promoted by charities and governments in developing countries since the late 1940s. A range of approaches have been tried, including ‘build-your-own stove’ projects, community-focused schemes, manufacturing stoves in remote villages and more recently, market-based activities. In some countries, these new stoves have been well-received. In Kenya, 80% of urban families use a metal ‘jiko’ charcoal stove for cooking, which uses 50% less fuel and also decreases cooking time. The cost of the stove can be recovered in fuel savings in just a few months and it is estimated that the widespread uptake of the jiko stove saves 206,000 tonnes of wood per year. In other countries, progress has been less spectacular. Schemes have failed for a whole range of reasons which are only partially understood. Reasons for failure include: This £685k EPSRC, DfID and DEC funded project aims to understand the barriers preventing the uptake of improved cook stoves in Southern Africa. By learning from successful projects in East Africa, a plan to overcome these obstacles will be produced. The proposed multi-disciplinary research will use participatory methods to better understand the uptake of improved cook stoves, with a particular focus on South-South learning and knowledge transfer. Countries to be studied include: The University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0) 115 846 6134 email:Charlotte.Ray@nottingham.ac.uk email:Mike.Clifford@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}