{
    "url": "https://www.nottingham.ac.uk/Researcher-academy/Advocacy/concordat.aspx",
    "content": [
        {
            "p": "The University of Nottingham is proud to have been awarded the European Commission’s HR Excellence in Research badge, in recognition of our commitment to the implementation of the Concordat to Support the Career Development of Researchers (also known as the ‘Researcher Development Concordat’). The Concordat is an agreement between stakeholders involved in supporting research staff, aiming to improve employment and support for researchers and research careers in UK higher education. The ambitions of the Concordat are and always have been to facilitate a research culture and environment which offers greater transparency, stability and support for the researcher community. The university’s journey in the implementation of the Concordat started in 2008, when the original 2008 Concordat was published. In 2019, following a sector-wide consultation, a new Researcher Development Concordat was launched to update and refresh the 2008 version. In 2021, in a letter signed by the Vice-Chancellor, the university re-confirmed its continuing commitment to the Concordat and its principles by becoming a signatory to the updated 2019 version. The university was first awarded the HR Excellence in Research badge in 2010-2011. Since that original award, the university has successfully renewed its badging following a biennial review process. Following a 12-year anniversary review in 2024, the university successfully retained and renewed the award for a further three years. To support the implementation of the Concordat, we have published progress reports (2020, 2022, 2023, 2024), implementation strategies (2022-2026, 2024-2027) and implementation action plans (2022-2024, 2024-2027). We will continue to report on the implementation of the Concordat on behalf of the Concordat Steering Committee (CSC) and the Research Staff Group (RSG); reports will be presented to Council annually. Researchers at the university can read more about the Concordat implementation and evaluation processes on the Researcher Academy’s Research Staff SharePoint site. As part of our commitment to the implementation of the Concordat, the university produces annual progress reports and regularly refreshes our implementation action plan. These review documents can be viewed below: Read the report | 1 document - contents: UON researchers and staff contact form Follow us on social media: YouTube | LinkedIn"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/Nottingham_letter-of-commitment_Concordat_Jan2021-1.pdf",
        "uk_pdf_files/uon-concordat-summary-and-progress-report-2024.pdf",
        "uk_pdf_files/concordat-action-plan-2024-27-v2.pdf",
        "uk_pdf_files/uon-2023-annual-report-rdconcordat.pdf",
        "uk_pdf_files/concordat-uon-ap2022-24-update-dec2022.pdf",
        "uk_pdf_files/uon-concordat-10yr-report-january22.pdf",
        "uk_pdf_files/concordat-uon-ap2019-22-dec21.pdf",
        "uk_pdf_files/concordat-uon-ap2022-24-r.pdf",
        "uk_pdf_files/uonottingham-concordat-8yr-report-wap-jan20.pdf",
        "uk_pdf_files/uon-concordat-6yr-report-vjuly18.pdf",
        "uk_pdf_files/uon-concordat-4yr-external-review.pdf",
        "uk_pdf_files/uonconcordat-action-plan-2013-2015-progress.pdf",
        "uk_pdf_files/uonconcordat-action-plan-2015-2019.pdf",
        "uk_pdf_files/uon-concordat-2-yr-internal-review.pdf",
        "uk_pdf_files/uonconcordat-action-plan-2011-2015-newactions2013.pdf",
        "uk_pdf_files/uonconcordat-action-plan-2011-2015-updated2013.pdf",
        "uk_pdf_files/uon-concordat-action-plan-2011-2014.pdf"
    ]
}