{
    "url": "https://www.nottingham.ac.uk/research/groups/allergy-and-infectiousdiseases/index.aspx",
    "content": [
        {
            "p": "In a nutshell, our group’s activities are centred on understanding the roles of Immunoglobulin E (IgE) in human resistance to infection with metazoan parasites (e.g. Schistosoma spp., Echinococcus spp.) and how this knowledge can be exploited for vaccination and diagnostic purposes. More recently, we have been working on Schistosoma mansoni kinases as a target for chemotherapy in collaboration woth our partners from FioCruz in Belo Horizonte, Brazil. We are equally interested in understanding the roles of human basophilic granulocytes in health and disease, and the interplay between pathogen-derived chitin and mammalian chitinases in innate immunity. Another line of work is focussed on Helicobacter pylori adhesins. All of our work is performed in collaboration with in-house groups with complementary expertise or with international collaborating laboratories and industry. We do not work on animal models of disease and all of our work is carried out with human samples or animal cell lines. Eggs of the blood fluke Schistosoma mansoni under the EVOS fl microscope, showing their natural autofluorescence Our more applied research projects are aimed at developing new technologies for the diagnosis of allergy and infection, and for treatment of bacterial or parasitic infections. Another applied line of work aims to exploit nanomedical approaches for the development of biomimetic drug carriers with improved gastric retention, for intracellular drug or nucleic acid delivery, or as a therapeutic option for the treatment for allergic lung disease. CGI movie illustrating the live basophil array principle developed by the Alcocer and Falcone groups Current projects are studying the basis of resistance to parasitic infection in the human population with a focus on Schistosoma mansoni. We have developed humanised reporter systems which can be used for sensitive and robust detection of allergen-specific IgE in human blood samples using protein allergen arrays. These are now being optimised and put to the test using well characterised clinical samples. A more recent research strand involves the development of a generic ant-tick vaccine and detection of pathogens in the tick using low cost methods. Furthermore, we are interested in elucidating the functions of H. pylori adhesins in attachment to the gastric epithelium and how these mechanisms could be exploited for drug delivery purposes and in combating antimicrobial resistance. In collaboration with other in-house groups we also develop new vectors for nucleic acid delivery (DNA and siRNA), nanomedical applications for the treatment of allergic lung disease, bacterial infection and high-throughput diagnostic techniques for allergy and parasite infection. We currently have Five main project areas: Last updated: 19 September 2018 Follow this link to see related global research links The University of Nottingham The Boots Science Building, University Park Nottingham, NG7 2RD telephone:+44(0) 115 84 66073 email:franco.falcone@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}