{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Enhancing-practical-competencies-in-pharmacy-with-virtual-reality-technology.aspx",
    "content": [
        {
            "p": "As the world adapts to manage the COVID-19 pandemic, the value of virtual reality in higher education has never been more apparent. Restrictions on the ability of academic staff and students to work and study on campus has put a significant strain on universities. In response, the teaching curriculum has moved onto web-based platforms with fully online and blended learning methods. However, for many, this is an impoverished experience. The current crisis is therefore revitalizing the appetite for applications of virtual reality. Virtual reality is a cutting-edge digital advancement that’s made a huge impact on technology. It creates a computer-simulated world that immerses users in a complete sensory experience. Just by putting on a headset, users step into an incredibly realistic digital realm. While already commonplace in fields such as gaming, aviation and healthcare, it’s gaining popularity as an action-based learning tool. Dr Jim Chai, Assistant Professor of Pharmacy in the School of Pharmacy, is spearheading the use of virtual reality in our teaching curriculum. Gaining hands-on experience is crucial for any pharmacy student. Dr Chai has created a virtual reality tour of a community pharmacy in the UK that allows students to get up close and personal with a real-world pharmacy setting. Providing assistance on this project was Dr Wong Ying Jing, Assistant Professor in the Faculty of Science and Engineering while colleagues in the UK facilitated access to a pharmacy owned by Boots UK Ltd. This pharmacy was used to gather the 360 degree views that eventually formed the basis of the simulated pharmacy. Within this simulated environment, students visit the dispensary and interact within the setting. These interactions reinforce the classroom learning and enable the acquisition of practical skills and experience. The intention is that this experience will deepen students’ understanding, boost their professional knowledge and sharpen their professional competencies. Though virtual reality is becoming more commonplace in medical education, it is somewhat uncommon in pharmacy teaching. This makes Dr Chai’s work truly pioneering. Moving forward, we can look forward to an even more comprehensive virtual pharmacy, as Dr Chai also wants to expand the scope of the project to simulate a virtual customer. Several postgraduate students in the School of Computer Science are also currently creating a standalone app to be used with the virtual reality headset. The long-term impact of the current pandemic on education is likely to be considerable and so this opens up opportunities to integrate virtual simulation technologies to enhance clinical competencies. We are pleased that Dr Chai is transforming teaching and learning in exciting and innovative ways. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}