{
    "url": "https://www.nottingham.ac.uk/research/groups/health-geography/index.aspx",
    "content": [
        {
            "p": "Image credit: Simon Gosling The Health Geography Collaborative Research Hub works to foster and deepen intersections among our members in relation to the geographical study of health, broadly defined. Our work considers diverse social, historical, biomedical, and physical environmental aspects of health, from critical qualitative research on health-related experiences, to archival analyses of the social construction of health conditions, to disease mapping and climate change modelling. Our goal is to cultivate synergies around the theme of health across geographical sub-disciplines within the school, while at the same time widening our inter-disciplinary and inter-sectoral scope as we engage with new collaborators and partners. Our Hub includes researchers working across human and physical geography, often as part of inter-disciplinary and international projects. Our research reflects interest in a range of environments and scales shaping health. At a global-scale, we explore how climate change will affect human health and what opportunities there are for society to adapt to future risks, and to mitigate them. For example, Simon Gosling's work with the European Commission's Joint Research Centre and other international collaborators, seeks to understand how heat-related mortality and labour productivity will be impacted by future climate change across the globe. At micro-scales, we unpack the ways in which legal, economic, and social relations shape health inequalities in everyday settings. Working with colleagues in India, for example, Sarah Jewitt has documented factors limiting the achievement of the UN Sustainable Development Goal target to achieve adequate and equitable sanitation and hygiene for all. In 2020, the Hub welcomed Dr Christina Ergler (University of Otago) as an Honorary Associate Professor in the School. Dr. Ergler is a health geographer whose research traces social, health, and environmental injustices as they relate to young people’s wellbeing in the minority and majority worlds. She employs creative and participatory qualitative methods, along with mixed methods and ‘SoftGIS.’ Dr Ergler’s expertise and unique methodological approaches cross-cut Hub members’ interests and add to the Hub’s research activities around arts-based methodologies and children’s health geographies (Coen, Jewitt, Beckingham, Davies). School of Geography Sir Clive Granger Building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}