{
    "url": "https://www.nottingham.edu.my/Research/Research-impact-stories/Establishing-sustainable-policies-for-local-landowners.aspx",
    "content": [
        {
            "p": "The global economy puts pressure on the use of the natural environment and resources in a way that continues to have destructive impacts on the planet. Land grabs, the decimation of forests and industrialisation-led displacement of vulnerable rural communities are real concerns affecting many low to middle income developing countries, including Malaysia and Southeast Asia. Our researchers are finding solutions to sustainable development and community well-being. Prudent policy making is one of the keys to a greater harmony between the land and those who live off it. Our research aims to generate equitable solutions for all stakeholders—solutions that we hope will shape sustainable government policies. The work of Dr Vengadeshvaran Sarma, Assistant Professor of Business Economics in the Nottingham University Business School, is advocating a sustainable policy framework that benefits landowners without hurting their future growth prospects. Dr Tapan Kumar Nath, Associate Professor in the School of Environmental and Geographical Sciences, is setting out the evidence to assist governments to formulate policies that support sustainable forest conservation through partnerships between local communities and forest management agencies. Current policies tend to focus on financial compensation for land acquisition. When land is bought for development, its resident communities are often displaced, with a single monetary payout. Dr Sarma has been studying the long-term social and economic effects on rural communities who have been forcibly evicted from their land. In Malaysia, this means working with the indigenous Orang Asli community, but his work has taken him overseas to India and Nepal too. His team’s innovative research approach combines quantitative economic analysis with sociology and anthropology. It’s also pioneering because it examines the long-term impacts on such communities - most studies so far have been limited to the short-term effects. One of the most intriguing findings is that in the long term, displaced households don’t appear to be economically disadvantaged, compared to non-displaced households, but their well-being is clearly much worse. His qualitative data reveals that displacement can often lead to loss of sense of community networks of support resulting in a deep sense of insecurity and unhappiness. To advocate for change, he’s formed strategic partnerships with researchers in think tanks and research institutes. Key partners include the Asian Development Bank Institute (ADBI), the International Initiative for Impact Evaluation (3ie), and the International Centre for Integrated Mountain Development (ICIMOD). The right of sovereignty on land has long been a contested subject, but Dr Sarma believes that research-led policy changes can ensure that land acquisitions meet the needs of industrialisation without infringing the long-term rights of the landowners. Dr Nath’s background in forest conservation and environmental policy gives him a broad perspective for studying community-based sustainable management of natural resources. The key is to come up with a win-win approach for both state forest management agencies as well as communities that rely on the forest for their survival. Participatory Forest Management is a practical model of a mutually beneficial partnership that puts communities at the heart of managing state-owned or formerly state- owned forest resources. Although Participatory Forest Management has become an established approach in many countries, it has yet to be institutionalised in Malaysian policy—something Dr Nath aims to change. The global nature of this challenge is reflected in Dr Nath’s international partnerships across Malaysia, Japan, Sri Lanka and Bangladesh. Also recognising the crucial link between research and policy making, he is also committed to workforce capacity building. Two of his current postgraduate students are active government civil servants. Speaking to Dr Nath gives a sense of his passion for putting Participatory Forest Management into practice. For example, in 2019 he organised a tree planting event in North Selangor to reforest degraded peatland swamp forests, with 300 participants coming together to plant over a thousand seedlings. Outreach activities like this are important to raise awareness about the importance of changing national policies and legislation to institutionalise Participatory Forest Management. These two stories give some great examples of how successful management of natural resources is a key pillar in sustainable development. The University of Nottingham Malaysia is proud to support researchers who are committed to a stable ecological future. telephone: +6 (03) 8924 8034 email: rke.hub@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}