{
    "url": "https://www.nottingham.ac.uk/research/groups/nottingham-immunology-network/index.aspx",
    "content": [
        {
            "p": "The Immunology Guidance Group (IgG) has been formed with sponsorship from the School of Life Sciences to facilitate and guide the development of immunology at The University of Nottingham. Our mission is to promote the identity, vitality, cohesion and profile of the immunology community at The University of Nottingham by guiding strategic developments in immunology research, teaching and academic interactions. For further information please contact: Dr Bruno Gran or Dr Luisa Martinez-Pomares, joint academic leads for the Nottingham Immunology Network. Cancer Immunology Research within this theme focuses on immunological mechanisms involved in: It includes molecular and cellular immune mechanisms, pre-clinical studies, and clinical trials in a variety of different cancers, such as: We also work on the characterisation of the phenotype and function of T and B cell responses in cancer, dendritic cell biology, immune biomarkers, co-stimulatory pathways relevant to immune tolerance and cancer surveillance, and engineering of antibodies for cancer therapy. Host Pathogen and Mucosal Immunology Members of this research theme study the interplay between human and animal pathogens with the host immune system with particular emphasis on the respiratory and gastrointestinal mucosal surfaces. Research approaches comprise epidemiological and clinical studies on patients and wild animals alongside mechanistic work using in vivo and vitro infection models in epithelial and antigen presenting cells. Pathogens of interest include parasites such as schitosoma manson as well as various parasitic nematodes, bacterial pathogens such as: Inflammation and Allergy & Respiratory Work within the Inflammation Group focuses on: Specific diseases investigated include: Projects include studies on: State-of-the-art technologies are employed. There is a strong emphasis on mechanistic studies, but also on translational studies to advance the early and differential diagnosis, management and treatment of patients with inflammatory diseases. Molecular Immunology and Immuno Bioengineering The Molecular Immunology and Immuno Bioengineering theme comprises studies of the molecular basis of immune responses and the use of novel biomaterials as immunomodulators. Pathways of interest include type I and II interferon-mediated signalling, lectin receptors and their role in the recognition of allergens and self-molecules, the cross-talk between the aryl hydrocarbon receptor and mannose receptor pathways and how mutations in the TNF-Receptor 1 contribute to the development of TRAPS. Research approaches comprise clinical studies on patients alongside mechanistic work using in vivo models as well as human and mouse antigen presenting cells and lymphocytes cultures. Neuroimmunology Work within the Neuroimmunology theme focuses on different aspects of the role of the immune system in the central and peripheral nervous system. Areas of research include the: Immunology at The University of Nottingham focuses on infectious diseases in humans and animals, and the associated immune response. We aim to identify better treatments and vaccines, as well as developing innovative analytical methods and models to better understand autoimmune diseases. School of Life Sciences The University of Nottingham, Medical School Queen's Medical Centre, Nottingham, NG7 2UH telephone: +44 (0) 115 823 0141 email:life-sciences@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}