{
    "url": "https://www.nottingham.ac.uk/research/groups/commercial-law-centre/events/seminar-series/2024/historical-and-critical-analysis-of-the-evolution-of-islam-partnerships-to-modern-corporations.aspx",
    "content": [
        {
            "p": "Here is the joining link: Join the meeting now Meeting ID: 399 051 428 794 Passcode: hgTRqy Speaker: Dr Samira Soleymanzadeh Chair: Simge Aslan, School of Law The Iran legal system has faced different legal evolutions in the field of corporate law. In this system, which is significantly affected by the Islamic legal institutions, the classic form of cooperative commercial activities is partnership. Without a separate legal personality, the partnership was simply a common asset that was managed by an agent appointed from the proprietors. Due to the expansion of trade activities, the need for a more-developed legal institution emerged in order to cope with the requirements of the new era of commercial deals. Modern corporations with the two important qualification of separate legal personality and the limited liability, commenced to replace the classic partnerships. The scope of functioning the classic partnerships remained for small and family businesses and the new Commercial Code enacted for recognizing the different types of commercial companies (4.3.1933). The limited liability, the separate legal personality, the system of management, the specified process of decision making and supervising organ of company, covered the defects of the previous institution and provided an acceptable legal base for new commercial activities. In the second phase of evolution, the public and private joint-stock companies regulated in a newer Act (15.3.1969) mostly based on a French perspective. This lecture will investigate this historical and legal conversion, the challenges of the movement form an Islamic partnership to a non-Islamic corporation and the current legal views on updating the 1933 and 1969 Act which is in progress. Dr Samira Soleymanzadeh is a graduate of the University of Tehran, where she obtained her Bachelor of Law in 2011 and in 2014 her Masters in Private Law, with a focus on international business and securities law. She authored her PhD dissertation on CGs and PIL. In addition, she has a LLM degree from Luiss Gudio Carli University school of law. Her book, \"Commercial Corporate Groups, the Jurisdiction and the Applicable Law\", was recently published. She was awarded scholarships from the MPI (2016), the DAAD (2018), ICC full scholarship, and the Hague Academy of International Law (2020), and she has published widely on commercial law, corporate law, private international law, contract law, WTO law, and Islamic law. She has been a lecturer in public and private universities in Iran since 2014 and has also been an attorney at law since 2011. As a lawyer and legal consultant, she is focused on international corporate and commercial cases. Presently, she is an assistant professor at the University of Tehran and teaches commercial law for bachelor and master students and advising different master thesis as a supervisor. email: unclc@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}