{
    "url": "https://www.nottingham.ac.uk/research/beacons-of-excellence/future-food/our-research/cop-26/cop-26.aspx",
    "content": [
        {
            "p": "Climate change and food security are interconnected challenges we face as a society. The FutureFood Beacon is working on multiple projects exploring how we can feed the world in a changing climate. Here we have collected them altogether so you can peruse them. Read in-depth stories about these projects on our blog Listen to Festo Massawe and Anne Touboulic talking about sustainable food supplies Read other stories from the University of Nottingham Building climate resilience in Africa How can we best influence the nutritional value of crops? We are working with partners in Africa to better understand agricultural impacts on soil health Can we develop tools to visualise the scale and distribution of micronutrient deficiencies? Our researchers are working to improve population health in Zimbabwe Can biofortified flour improve health outcomes? Preparing for the future, and understanding the past Mastering the complexity of growing crops Disentangling the interdependencies that shape the evolution of plant microbiomes. We are creating new opportunities for farmers to sell their crops Developing a better understanding of root architecture Improving Mexican wheat varieties' heat tolerance. We're honing in on an underused food source Removing a deadly twist from a key insurance crop for the poorest of the poor Making African leafy vegetables more nutritious and tolerant to drought Investigating whether WGD increases resistance to salt stress Our researchers are using genetic techniques to reduce cadmium in chocolate Empowering smallholder farmers with science How can we boost high protein diets around the world? A collaborative project investigating Giant Swamp Taro How can we meet population demands for food, coupled with a changing climate? How we are connecting with Colombian cocoa"
        }
    ],
    "pdf_files": []
}