{
    "url": "https://www.nottingham.ac.uk/safety/emergency-info/emergency-info.aspx",
    "content": [
        {
            "p": "Information is also included in university induction and fire safety eLearning. Your business unit will provide you with any specific emergency procedures that are relevant to your work/studies. This will be delivered during your induction and/or during training related to the tasks you undertake. Examples of local procedures For further information or if in doubt: contact your Health and Safety Coordinator. These guidelines relate to a violent and/or threatening, or potentially violent and/or threatening, behaviour or situations on University property. The situations to which these guidelines relate include verbal abuse, threats, and physical attacks. With over 30,000 students and 5000 staff and numerous daily visitors to the University it is not always easy to either predict or guard against violent or threatening behaviour. It is incumbent on all staff and students to be vigilant and aware of their surroundings and the potential for any situation to become threatening or violent. Incidents of work-related violence should be reported to the Health and Safety Team via the Incident Reporting system. Very serious incidents are monitored by the Health and Safety Team and reported to the University Health and Safety Committee. Where the nature of the work activities or environment is such that there is a particular risk of encountering a threatening or violent situation then this should be included in the risk assessment for the activity or area. The Security Office should be consulted for advice on physical and procedural measures, including training, to minimise the risk. The Health and Safety Team can also offer advice. Please also reference the guidance on Lone Working. If you have been affected by a threatening or violent situation you might find it helpful to contact the University Counselling service. Fire Emergency Medical Emergency (Accident/Illness) Personal Safety - Threatening Situations Serious Incident Management - Operations Resilience and Business Continuity Pharmacy Building (Building 63) University Park University of Nottingham Nottingham, NG7 2RD Telephone: Telephone: +44 (0)115 9513401 Email: h&s@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}