{
    "url": "https://www.nottingham.ac.uk/schoolsliaison/services/care-leavers.aspx",
    "content": [
        {
            "p": "At the University of Nottingham we are committed to empowering care experienced learners. We offer a variety of additional support from application through to the completion of your studies. All support offered is completely optional and you can decide to opt in at any stage. We have been awarded the NNECL quality mark. Watch our care experienced and thinking about university video. While we recognise that you may wish to leave the ‘care’ label behind, please be assured that any information you disclose will always be treated with complete confidentiality and sensitivity. If you have been in care for three months or more and indicate this by ticking the 'in care' box on your UCAS application, we will confirm your eligibility, but do not need full details of your circumstances. Pre-entry support Support once enrolled Support at university This event will be run in collaboration with Nottingham Trent University and will be held on Thursday 27 February at Nottingham Trent University. More information, including the booking link, will be added here soon. For enquiries, please email care@nottingham.ac.uk. If you can’t attend a visit day, but would still like the opportunity to visit the campus and talk to someone from our care experienced support team about coming to the university, please get in touch with us and we can offer one-to-one support. A key factor in making your decision about higher education is finance – this should not be a barrier. There are such a wide range of financial support options available, making it more possible for you than ever before to continue your education. The Care Experienced and Estranged Bursary provides £2,000 per year to students with a household income below £35,000 (as assessed by Student Finance) and who are currently or have been in public care for a minimum period of three months, since their 14th birthday. Students under special guardianship or kinship care during this period may also qualify OR students who have been granted independent status by Student Finance England due to estrangement. Some exclusions apply if you are in receipt of other funding. Please visit the bursaries webpage for more details of eligibility criteria. Information is always subject to change for future years of entry, so we would recommend checking regularly for further updates. We also suggest looking at the Scholarships page, we have a range of scholarships available for those with different skills, abilities and backgrounds. To help you access all of the funding available to you: Answering ‘yes’ to the ‘have you been in care?’ question on your UCAS form means that we can send you relevant information about funding and an invitation to our coffee and cake sessions, where we can support you to apply for university financial support. Our Funding and Financial Support team provide information and advice on most aspects of student finance to both current and prospective students. The financial support team also provide information and useful advice about managing your money and budgeting. The funding mentioned on this page is for undergraduates. Our funding for postgraduates page explains the finance available for masters or doctorate programmes. We make contextual offers to students whose personal circumstances may have restricted achievement at school or college. These offers are usually one A Level grade lower than the entry requirements on our course pages. If our standard offer includes a specific subject grade, this will generally remain. For example, if the standard offer is AAB with an A in maths, the contextual offer would be ABB with an A in maths. Please visit this page to check your eligibility and find the requirements for the course you are interested in. Our care experienced support team will be available on results day, if you need help exploring your options, when you get your grades. The UCAS.com website has lots of useful information that can help you when applying to university. Before making your application, do plenty of research to ensure you are making an informed choice for your future. Familiarise yourself with the application process and make sure you are ready to apply before applying. All students who are care experienced or estranged can get access to 365-day University accommodation. The University of Nottingham has a wide variety of accommodation available. Factors such as room type and length of contract will affect the overall cost – see the accommodation pages for details. The need for a deposit or guarantor can be waived upon request by the care team. Information about the University of Nottingham accommodation bursary can be found on our accommodation webpages. Whether you live in catered or self-catered accommodation, there is always someone you can contact, if you are experiencing any difficulties. The contact information can be found on the accommodation contacts page. The Students’ Union Advice Centre can help you with a range of accommodation issues, throughout your studies. If you choose to live in private accommodation from your second year, the University of Nottingham has partnered with Your Guarantor who can act as your UK guarantor if you need one. Details of the scheme can be found on our Your Guarantor webpage. The University of Nottingham has a range of outreach programmes for Year 12 and Year 13 students. These will help you explore your options, make informed choices and offer support through the application process. Find out more by clicking the links below: Once you have been offered a place with us, we will get in touch to offer a pre-entry meeting. This is to introduce you to the network of support and services available while you are studying with us. You will have the opportunity to meet with people from relevant areas of the university - including our Financial Support Team, who can explain the different types of funding you can access; a member of our care experienced support team and someone from the department in which you will be studying. The university will reimburse you for the cost of travelling to the meeting. Before term starts, you will be invited to KickStart, a two-day induction event for mature, care experienced and estranged students. This is not to single you out, but to help you settle in. A chance to meet other students from similar backgrounds, as well as workshops to give you some key information on finance, academic support and wellbeing ahead of starting your studies. Moving into any new home can be a stressful situation. Therefore, should you require any assistance or advice about your accommodation ahead of arrival, a member of our Residential Experience team is more than happy to help. The ResX team can help with the practical side of moving into your first-year accommodation, if you are arriving in the city independently. They are also here to ensure that you have a great experience in halls and as well as offering wellbeing support, enrich your first year with a range of activities and events which will help you to settle in and meet new people. We realise that having someone to contact who has been through similar experiences can be an important avenue of support and guidance throughout your time with us. That is why, upon arrival, you will be offered the chance to be mentored by a current second or third-year student who also has experience of being in the care system. It is up to you how often you keep in touch with your mentor, who can help you to get to know the university and provide you with tips on how to make the most of your time with us. If you would like to request a mentor, please email us. Our coffee and cake drop-ins are a perfect chance to meet a small group of students with similar experiences and get some face-to-face support from a care-leavers mentor. These are relaxed sessions, themed around the questions we usually have at university, for example maintaining a healthy work/life balance, or dealing with exams. You will be introduced to staff who can help with the theme of the session. We usually offer at least three of these per year. There is a collection of external organisations* that support care experienced students in their journey to higher education: *The University of Nottingham is not responsible for the content on external websites. From considering university, through to the end of your course, our care experienced support team are available for ongoing assistance. We hope the above information gives you an idea of the extra help available to you. If you have any further questions, please do not hesitate to contact us."
        }
    ],
    "pdf_files": []
}