{
    "url": "https://www.nottingham.ac.uk/schoolsliaison/services/student-support-packages/young-carers.aspx",
    "content": [
        {
            "p": "We appreciate that some students have a responsibility to care for parents, siblings or other relatives who are unwell, disabled or in need of support or supervision. Caring for a loved one can take a considerable amount of time, effort and commitment. We have put together a package of support to ensure you don’t have to worry that your domestic circumstances will hold you back from getting into and thriving at university. This support is designed for: young people who provide care for a friend or family member who could not cope without their support Are you a young carer looking to apply for university but feeling unsure about the process? Come and chat with our friendly Widening Participation team at this year's undergraduate open days! We'll be stationed at an information stand and ready to answer any questions you may have. We know that university can be daunting, but with the right support, it can also be an incredible experience. Our team will be happy to talk to you about general support services available to students and give you the lowdown on applying to university. Our undergraduate open days for September 2026 entry will take place on: Bookings will open in Spring 2025. In the meantime, you can register your interest by visiting our open days page. View open days information and register your interest Information about future visit days will appear here. For enquiries, please email care@nottingham.ac.uk. A key factor in making your decision about higher education is finance – this should not be a barrier. There are such a wide range of financial support options available, making it more possible for you than ever before to continue your education. The Care Experienced and Estranged Bursary provides £2,000 per year to students with a household income below £35,000 (as assessed by Student Finance) and who are currently or have been in public care for a minimum period of three months, since their 14th birthday. Students under special guardianship or kinship care during this period may also qualify OR students who have been granted independent status by Student Finance England due to estrangement. Some exclusions apply if you are in receipt of other funding. Please visit the bursaries webpage for more details of eligibility criteria. Information is always subject to change for future years of entry, so we would recommend checking regularly for further updates. We also suggest looking at the Scholarships page, we have a range of scholarships available for those with different skills, abilities and backgrounds. Our Funding and Financial Support team provide information and advice on most aspects of student finance to both current and prospective students. The financial support team also provide information and useful advice about managing your money and budgeting. The funding mentioned on this page is for undergraduates. Our funding for postgraduates page explains the finance available for masters or doctorate programmes. Some students are eligible for contextual offers at the university. Although being a young carer is not one of the criteria for this, we would encourage you to visit this page to check your eligibility. A contextual offer is usually one A Level grade lower than the entry requirements on our course pages. If our standard offer includes a specific subject grade, this will generally remain. For example, if the standard offer is AAB with an A in maths, the contextual offer would be ABB with an A in maths. You could balance your study with family or professional commitments by studying part-time and spreading your degree over four to seven years. A large number of our courses are available part-time. Please note, we only offer part-time study to students from/who reside in the UK. The University of Nottingham has a range of outreach programmes for Year 12 and Year 13 students. These will help you to explore your options, make informed choices and offer support through the application process. Find out more by clicking the links below: Ambition Nottingham Realising Opportunities Pathways to Veterinary Medicine & Animal Science Pathways to Medicine Nottingham Potential and Sutton Trust Summer Schools Students who also have caring responsibilities may choose to live at home while studying. However, all full-time undergraduates are guaranteed a place in university accommodation during their first year of study, if you decide to live on campus. The University of Nottingham has a wide variety of university accommodation available. Factors such as room type and length of contract will affect the overall cost – this webpage shows the differences in fees. Moving into any new home can be a stressful situation. A member of our team will be more than happy to help with the practical side of moving into your first-year accommodation, if you are arriving in the city independently. We appreciate that there can be a considerable amount of time, effort and commitment involved in caring for a loved one, so we want to support you with your studies or work as much as possible during this time. Therefore, we strongly encourage you to advise and work with your lecturers/tutors, who can help manage your studies alongside your caring responsibilities (for example, if you need to join a lecture later or leave earlier due to your responsibilities). There is a collection of external organisations* that support young carers in their journey to higher education: *The University of Nottingham is not responsible for the content on external websites. We hope the above information is useful to you. If you have any further questions, please do not hesitate to contact us."
        }
    ],
    "pdf_files": []
}