{
    "url": "https://www.nottingham.ac.uk/schoolsliaison/services/student-support-packages/disabled-students.aspx",
    "content": [
        {
            "p": "The University of Nottingham is committed to supporting disabled students and we want to make your experience of university an enjoyable one. We are here to help you if you have a: When completing your UCAS application, we would encourage you to tick the appropriate box, if you have a disability. This enables the university's Disability Support Team to contact you to ask how they can support you and discuss concerns you may have. So that we can help you make the most of your studies, please tell us about your disability. You can contact the team before you begin your application, or when you have received an offer from the University of Nottingham. Applicants with a physical disability, long-term medical condition, specific learning differences (such as dyslexia, dyspraxia or ADHD), sensory impairment or mental health issues can find additional information on our Disability Support pages. Eligible full-time, part-time and postgraduate students can apply for Disabled Students' Allowances (DSA), which you need to apply for through your funding body (e.g. Student Finance England). DSA help disabled students from the UK to fund additional costs they may incur, as a direct result of a disability, long term medical condition, or specific learning difficulty, when taking part in a higher education level course. An important factor in your decision about higher education is finance. There is such a wide range of financial support options available, including bursaries and scholarships for undergraduates and funding for postgraduates, making it more possible for you than ever before to continue your education. Our Funding and Financial Support team provide information and advice on most aspects of student finance to both current and prospective students. The financial support team also provide information and useful advice about managing your money and budgeting. Some students are eligible for contextual offers at the university. Although being disabled is not one of the criteria for this, we would encourage you to visit this page to check your eligibility. A contextual offer is usually one A Level grade lower than the entry requirements on our course pages. If our standard offer includes a specific subject grade, this will generally remain. For example, if the standard offer is AAB with an A in maths, the contextual offer would be ABB with an A in maths. The UCAS.com website has lots of useful information that can help you when applying to university. Before making your application, do plenty of research to ensure you are making an informed choice for your future. Familiarise yourself with the application process and make sure you are ready before applying. The University of Nottingham has a range of outreach programmes for Year 12 and Year 13 students. These will help you explore your options, make informed choices and to offer support through the application process. Find out more by clicking the links below: Ambition Nottingham Realising Opportunities Pathways to Veterinary Medicine & Animal Science Pathways to Medicine Nottingham Potential and Sutton Trust Summer Schools The University of Nottingham has a wide variety of university accommodation available, to suit different budgets. Factors such as room type and length of contract will affect the overall cost – this webpage shows the differences in fees. We are able to offer adjustments to suit your individual requirements. It is best to inform the accommodation team as early as possible within your application, if you require any adjustments. Whether you live in catered or self-catered accommodation, there is always someone you can contact, if you are experiencing any difficulties. The contact information can be found here. The Students’ Union Advice Centre can help you with a range of accommodation issues, throughout your studies. Our disability support services team is here to support the university community in creating an inclusive and equitable teaching and learning environment to the benefit of all students. The disability support service provides student-led support to enable disabled students to flourish as independent learners. This includes support during your studies, supporting specific conditions, and information to help get around campus. Please follow the steps on this webpage to tell us of a disability and provide the appropriate evidence. We will work with you to create a support plan that details the adjustments we will put in place. Typically, this could contain the ability to request coursework extensions, receive your lecture notes before your lectures, access recordings of lectures and reasonable adjustments during exams. Our libraries have a team of specialist study support tutors who can help you develop strategies to manage your studies effectively and become an independent learner. If you require subject specific support or general study skills support not related to your disability you can also contact the student academic skills team. The department of sport works alongside the Students’ Union and disability support team to ensure that there are accessible and inclusive sporting and fitness opportunities for all students at the University. We also have our own dedicated Disability Sport Officer (DSO), who can support you. Here is a range of organisations* and resources that may help you to consider higher education: *The University of Nottingham is not responsible for the content on external websites. If you need any specific support, you can contact our dedicated Disability Support Services team."
        }
    ],
    "pdf_files": []
}