{
    "url": "https://www.nottingham.ac.uk/schoolsliaison/services/student-support-packages/estranged-students.aspx",
    "content": [
        {
            "p": "No two estranged students’ circumstances are the same, which is why we are committed to supporting anyone who is estranged from their family and who is studying without the support or approval of a family network. UniQuest: Your journey to higher education Join us for UniQuest - a day packed with fun activities, helpful resources, and personalised guidance for care experienced and estranged young people. This event will be run in collaboration with Nottingham Trent University and will be held on Wednesday 3 July at the University of Nottingham. More information will be added here nearer the time. For enquiries, please email care@nottingham.ac.uk. A key factor when making your decision about higher education is finance – for estranged students, we understand this can be a particular challenge. There are a wide range of financial support options available, including bursaries and scholarships, making it more possible for you than ever before to continue your education. For Student Finance applications, further information can be found on UCAS.com's dedicated page for additional funding for estranged students. The Care Experienced and Estranged Bursary provides £2,000 per year to students with a household income below £35,000 (as assessed by Student Finance) and who are currently or have been in public care for a minimum period of three months, since their 14th birthday. Students under special guardianship or kinship care during this period may also qualify OR students who have been granted independent status by Student Finance England due to estrangement. Some exclusions apply if you are in receipt of other funding. Please visit the bursaries webpage for more details of eligibility criteria. Information is always subject to change for future years of entry, so we would recommend checking regularly for further updates. We also suggest looking at the Scholarships page, we have a range of scholarships available for those with different skills, abilities and backgrounds. If you’ve supported yourself financially for at least 3 years or had no contact with your parents for over a year, you might be able to apply as an ‘independent student’. This means your finance is calculated solely on your own income rather than your parents’ income, allowing you access to full financial support from the Student Finance packages. The charity, Stand Alone, has created a detailed guide to financial support for estranged students. Please note: if you have been in local authority care, you will be considered a ‘care leaver’ rather than ‘estranged'. Support is still available for you, but the way you access it may be slightly different. Information can be found on our care leavers webpage. Our Funding and Financial Support team provide information and advice on most aspects of student finance to both current and prospective students. The financial support team also provide information and useful advice about managing your money and budgeting. The funding mentioned on this page is for undergraduates. Our funding for postgraduates page explains the finance available for masters or doctorate programmes. Some students are eligible for contextual offers at the university. Although being estranged is not one of the criteria for this, we would encourage you to visit this page to check your eligibility. A contextual offer is usually one A level grade lower than the entry requirements on our course pages. If our standard offer includes a specific subject grade, this will generally remain. For example, if the standard offer is AAB with an A in maths, the contextual offer would be ABB with an A in maths. Our care experienced and estranged support team will be available on results day, if you need help exploring your options, when you get your grades. The UCAS.com website has lots of useful information that can help you when applying to university. Before making your application, do plenty of research to ensure you are making an informed choice for your future. Familiarise yourself with the application process and make sure you are ready to apply before applying. The University of Nottingham has a range of outreach programmes for Year 12 and Year 13 students. These will help you to explore your options, make informed choices and offer support through the application process. Find out more by clicking the links below: Ambition Nottingham Realising Opportunities Pathways to Veterinary Medicine & Animal Science Pathways to Medicine Nottingham Potential and Sutton Trust Summer Schools All students who are care experienced or estranged can get access to 365-day University accommodation. The University of Nottingham has a wide variety of university accommodation available, to suit different budgets. Factors such as room type and length of contract will affect the overall cost – see the accommodation pages for details. The need for a deposit or guarantor can be waived upon request by the care experienced and estranged support team. Information about the University of Nottingham accommodation bursary can be found on our accommodation webpages. Whether you live in catered or self-catered accommodation, there is always someone you can contact, if you are experiencing any difficulties. The contact information can be found on the accommodation contacts page. The Students’ Union Advice Centre can help you with a range of accommodation issues, throughout your studies. If you choose to live in private accommodation from your second year, the University of Nottingham has partnered with Your Guarantor who can act as your UK guarantor if you need one. Details of the scheme can be found on our Your Guarantor webpage. Once you have been offered a place with us, we will get in touch to offer a pre-entry meeting. This is to introduce you to the network of support and services available while you are studying with us. You will have the opportunity to meet with people from relevant areas of the university - including our Financial Support Team, who can explain the different types of funding you can access; a member of our care experienced support team and someone from the department in which you will be studying. The university will reimburse you for the cost of travelling to the meeting. Before term starts, the Widening Participation team provides a two-day induction event for mature, care experienced and estranged students. This is not to single you out, but to help you settle in. It is a chance to meet other students from similar backgrounds, as well as workshops to give you some key information on finance, academic support, careers guidance and your wellbeing, ahead of starting your studies. Contact our team for more information about Kick Start. Our coffee and cake drop-ins are a perfect chance to meet a small group of students with similar experiences and get some face-to-face support from a care-leavers mentor. These are relaxed sessions, themed around the questions we usually have at university, for example maintaining a healthy work/life balance, or dealing with exams. You will be introduced to staff who can help with the theme of the session. We usually offer at least three of these per year. Here is a range of organisations* and resources that may help you to consider higher education: *The University of Nottingham is not responsible for the content on external websites. From considering university, through to the end of your course, our care experienced support team are available for ongoing assistance. We hope the above information gives you an idea of the extra help available to you. If you have any further questions, please do not hesitate to contact us."
        }
    ],
    "pdf_files": []
}