{
    "url": "https://www.nottingham.edu.my/Science/People/rajesh.nair",
    "content": [
        {
            "p": "Associate Professor, Dr. Rajesh obtained his B.Pharm and M.Pharm (2003) from Rajiv Gandhi University, India. Thereafter, he started his academic career in India. Later, he moved to Malaysia in 2007 and became associated with leading national and international universities. He completed his PhD in Pharmaceutics at the University of Nottingham. Before joining as an Associate Professor at the School of Pharmacy, University of Nottingham Malaysia, in November 2023, he served as an academic researcher at Monash University Malaysia. In recognition of his commitment in teaching, he has been honored with multiple teaching excellence awards. Dr.Rajesh's research interest is on the development of nanocarriers for drug delivery, particularly for topical and transdermal applications. He has a keen interest in the skin permeation and dermatokinetics of bioactive compounds using specific skin models such as full-thickness human skin, animal skin and synthetic membranes. Dr.Rajesh is open for research collaboration and willing to share his expertise for achieving remarkable research outcomes. Development of nanoformulations for chronic diseases Topical/Transdermal Drug Delivery Development of cosmetic/nutraceutical formulations Development of Oral Controlled Release Drug Delivery Systems Drug disposition and Pharmacokinetics HPLC/UHPLC method development and validation PHAR1027- Pharmaceutics 1: Physicochemical Science and Medicines Design PHAR2056- Pharmaceutics 2: Pharmaceutical Technology PHAR2013- Biopharmaceutics PHAR3032- Advanced Drug Delivery PHAR1037- Dyspepsia PHAR1038- Bacterial and Fungal Infections Evaluation of Permeation Enhancers on Palm Oil Skin Permeation. Microneedles for transdermal drug delivery. Development and evaluation of phytonutrients loaded nanoformulations (Liposomes/Transethosomes) for enhanced therapeutic efficacy. Development and evaluation of Nanostructured Lipid Carriers. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}