{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/People/pauloke.show",
    "content": [
        {
            "p": "Professor of Biochemical Engineering, Professor Ir. Ts. Dr. Pau-Loke SHOW is the President of International Bioprocess Association in Malaysia. He also the director of Sustainable Food Processing Research Centre and Co-director of Future Food Malaysia, Beacon of Excellence, in the University of Nottingham Malaysia. He is a Full Professor at the Department of Chemical and Environmental Engineering, Faculty of Science and Engineering, University of Nottingham Malaysia. He has successful obtained his PhD in two years' time after obtaining his bachelor's degree from Universiti Putra Malaysia. He is currently a Professional Engineer (PEng) registered with the Board of Engineers Malaysia, Chartered Engineer (CEng) of the Engineering Council UK (MIChemE) and Professional Technologies (PTech) registered with the Malaysia Board of Technologists. Prof Ir. Ts. Dr. Show obtained the Post Graduate Certificate of Higher Education (PGCHE) in 2014, and is now a Fellow of the Higher Education Academy (FHEA) UK. Since he started his career in 2012, he has received numerous prestigious academic awards, including the APEC Science Prize for Innovation, Research and Education (\"ASPIRE\") Malaysia Award 2020, Malaysia Young Scientist 2019 Award, ASEAN-India Research and Training Fellowship 2019, The DaSilva Award 2018, JSPS Fellowship 2018, Top 100 Asian Scientists 2017, Asia's Rising Scientists Award 2017 and Winner of Young Researcher in IChemE Award 2016. He has graduated more than 20 PhD and MSc students, and is leading a team of 20 members consisting of postdoctoral, PhD and MSc research students. Up to 2020, he has published more than 350 journal papers in less than 8 years of his career. His publications have been cited over 5000 times over the past 5 years. His current h-index is 36, placing him among the top leaders of his chosen field (Microalgae Technology). He is also the Primary Project leaders for more than 35 projects from International, National, and Industry Projects, with total amount more than MYR5.0 million. He is now serving as an Editor-in-chief in Current Nutrition & Food Science, Editor in Scientific Report, Biocatalysis and Agricultural Biotechnology , Associate Editor at Bioengineered ; Current Biochemical Engineering; The Open Microalgae Biotechnology, and Editorial board member in Bioresource Technology and, Biochemical Engineering Journal. He also managing lead guest editor for many well reputation journals, examples, Journal of Hazardous Materials, Elsevier; Biofuel Research Journal, Elsevier; Environmental Pollution, Elsevier ; Chemosphere, Elsevier ; Clean Technologies and Environmental Policy, Springer; Bioengineered, Taylor & Francis; Processes, MDPI; Energies, MDPI; Biocatalysis and Agricultural Biotechnology, Elsevier; Frontiers in Energy Research, Frontiers; BMC Energy, Springer Nature; Materials Science for Energy Technologies, KeAI; Current Nutrition & Food Science, Bentham Science. Prof Ir Ts Dr Show is an active reviewer for more than 100 esteemed international journals published by Elsevier, Wiley, Springer, ACS, RSC and Taylor & Francis publishers. He has been recently awarded as the Top Peer Reviewer 2019 powered by Publons (Top 1% of Reviewers in Global Top Peer Reviewer Awards in Engineering, Global Top Peer Reviewer Awards in Cross-Field, Global Top Peer Reviewer Awards Chemistry, Global Top Peer Reviewer Awards in Biology and Biochemistry, Global Top Peer Reviewer Awards in Agricultural Sciences). Also, he has acted as a handling editor for more than 1000 submitted manuscripts in numerous journals. Other professional web links of Prof Ir Ts Dr Show: Prof Ir Ts Dr Show involves in the following editorial activities: Editor in Chief (Aug 2019 - Present): Current Nutrition and Food Sciences, Bantam Science Associate Editor (Aug 2020 - Present): Bioengineered (Taylor & Francis) Associate Editor (Sep 2019 - Present): Current Biochemical Engineering, Bantam Science Associate Editor (Sep 2019 - 2021): The Open Microalgae Biotechnology, Open Bentam Associate Editor (Jan 2019- 2021): Journal of Advanced Biotechnology and Experimental, Therapeutics Editor (June 2019 - Present): Biocatalysis and Agricultural Biotechnology Editor (Aug 2019 - Present): Scientific Reports, Nature Managing Guest Editor: Editorial Board Member: Regular Reviewers: 221 ISI Journals - 1544 reviewer tasks completed Regular handling editors: 12 ISI Journls - 587 editor tasks completed Verified by Publon: https://publons.com/researcher/1344183/pau-loke-show/ Professional involvement of Prof Ir Ts Dr Show: Research Experience & Areas: More than 10 years' research experience in: Important awards of Professor Ir Ts Dr Show: Fundamentals of Engineering Design; Heat and Mass Transfer; Food Processing Technology; Advanced Biochemical Engineering Microbial Biotechnology Industrial… read more Principal Investigator & Project Leader i. Project: Extraction of Lipids from Microalgae Using Liquid Biphasic Flotation (LBF) Method Financial source: Ventura Agro Entreprise Duration: 01 September 2020 - 31 August 2023 Amount: MYR 231,600.00 ii. Project: Designing of Simultaneous Cultivation of Spirulina and Extraction of Pigment (phycocyanin) System Financial source: Biolina Sdn. Bhd. Duration: 01 Nov 2020 - 31 Oct 2023 Amount: MYR 319,786.00 iii. Project: Organic Rapid energy Composter (OREC) for conversion of food- and bio-waste into renewable energy source Financial source: MENTARI ALAM EKO (M) SDN. BHD. Duration: 1st October 2020 - 31st March 2023 Amount: MYR 240,440.00 iv. Project: An investigation on algal proteins partitioning mechanism in ionic liquid biphasic flotation system Financial source: MyPAIR-PHC-Hibiscus, Ministry of Education, Malaysia Duration: May 2020 - April 2022 Amount: MYR 45,000.00 v. Project: Study of the separation efficiency of three phase flotation system in protein recovery from Chlorella vulgaris microalgae Financial source: Fundamental Research Grant Scheme (FRGS), Ministry of Education, Malaysia Duration: September 2019 - September 2022 Amount: MYR181,300.00 vi. Project: Removal of microalgae protein from rubble golve Financial source: TwoLink Sdn Bhd Duration: July 2019 - July 2020 Amount: MYR73,000.00 vii. Project: Coconut virgin oil production based on two-phase system Financial source: Public-Private Research Network (PPRN) Duration: July 2019 - September 2020 Amount: MYR24,000.00 viii. Project: Converting wastewater to bioenergy and bio-products using microalgae technology Financial source: The Society for Biotechnology, Japan Duration: January 2019 - December 2020 Amount: JPY 300,000 ix. Project title: Efficient recovery and downstream process of valuable bioproducts using aqueous two-phase flotation at industrial scale Financial source: Prototype Research Grant Scheme (PRGS), Ministry of Education, Malaysia Duration: January 2016 - December 2018 Amount: RM 110,000 x. Project title: Study of Partitioning Behavior of Ionic Liquids Based Aqueous Two-Phase Systems to Improve Bio-Separation Process of Microbial Lipase from Fermentation Broth Duration: November 2015 - October 2018 Amount: RM 100,800 xi. Project title: Extraction of bio ingredients from indigenous fruits Financial source: Research Programme (FoodPLUS), Crops for the Future Research Centre (CFFRC) Duration: September 2015 - December 2018 Amount: RM 142,415 xii. Project title: Study of Lipase Partitioning Behavior in Ionic Liquids based Aqueous Two-phase Systems to Improve Bio-separation Process of Microbial Lipase from Fermentation Broth Financial source: MTSF, Malaysia Toray Science Foundation, Science & Technology Research Grant Duration: June 2015 - May 2017 Amount: RM 15,000 xiii. Project title: Development of an efficient and cost-effective enzyme recovery system using recyclable aqueous two-phase flotation Financial source: Ministry of Science, Technology and Innovation (MOSTI-02-02-12-SF0256) Duration: January 2014 - December 2016 Amount: RM 193,500 xiv. Project title: Improved downstream processing through phase formation and biomolecular partitioning in aqueous two-phase flotation Duration: June 2013 - November 2015 Amount: RM106, 000 xv. Project title: Up-scale microalgae culture system integrated with solar power Financial source: Capital Equipment below 50K (Dean's Budget) Amount: RM 33,500 xvi. Project title: Extraction and Purification of Green Polymers Using Aqueous Two-Phase System (ATPS) Financial source: Dean's Scholarship Faculty of Engineering, UNMC Duration: 1st September 2013 - September 2016 Amount: RM 114,000 xvii. Project Title: Bio-plastic production from microbial lipase using an aqueous two- phase green system Financial source: Collaboration with Public Universities and Government Agencies Project period: September 2013 - March 2014 Amount: RM10,000 xviii. Project Title: Product of critic acid from microbial using extractive fermentation aqueous two - phase system Duration: September 2013 - September 2014 Amount: RM4,000 xix. Project Title: Production of citric acid Financial source: Dean's Undergraduate Research Scheme 2013 (DURS 2013) Duration: September 2013 - June 2014 Amount: RM 6,000 xx. Project Title: Studies of aqueous two- phase system Financial source: Dean's Undergraduate Research Scheme 2014 (DURS 2014) Duration: June 2013 - September 2014 telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/209.pdf",
        "pdf_files/250.pdf"
    ]
}