{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Civeng/About/Index.aspx",
    "content": [
        {
            "p": "Everyday we rely on some aspect of Civil engineering to enable us to live our lives. Whether it is building the Petronas Towers or life-saving water treatment plants in developing countries, civil engineering is the core discipline that enables projects to happen. It touches just about every kind of structure you can think about: bridges, roads, tunnels, and skyscrapers. Civil engineering is a discipline that has real-life applications in countless aspects of modern living. The Department provides high quality professionally accredited or approved BEng, MEng and MSc programmes. We use a range of teaching methods, including: All students have a personal tutor who offers general guidance and support, and are also linked with practising civil engineers. Teaching focuses on the application of the subject with regard to economy, safety, quality and the environment. Analytical engineering techniques are applied in a range of subjects including: All BEng and MEng programmes are accredited by the Institution of Civil Engineers, the Institution of Structural Engineers, the Institute of Highway Engineers and the Chartered Institution of Highways and Transportation on behalf of the Engineering Council UK. Additionally, our MEng programme is accredited by the Board of Engineers Malaysia. MEng (Hons) in Civil Engineering Accredited CEng (Full) This degree is accredited as fully satisfying the educational base for a Chartered Engineer (CEng). See www.jbm.org.uk for further information. BEng (Hons) in Civil Engineering Accredited CEng (Partial) This degree is accredited as: The MSc in Civil Engineering is approved as Further Learning that can lead to professional qualifications by the approving bodies. Further Learning Programme MSc in Civil Engineering (technical) This degree is accredited as meeting the requirements for Further Learning for a Chartered Engineer (CEng) for candidates who have already acquired a Accredited CEng (Partial) BEng(Hons) or an Accredited IEng (Full) BEng/BSc (Hons) undergraduate first degree. See www.jbm.org.uk for further information. Link to our social media platforms UNM Civil Engineering Facebook UNM Civil Engineering Instagram telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/Civil-Engineering-2021-PO.pdf.pdf",
        "pdf_files/Civil-Engineering-2021-PEO.pdf.pdf",
        "pdf_files/Civil-Engineering-2021-PO.pdf.pdf",
        "pdf_files/Civil-Engineering-2021-PEO.pdf.pdf"
    ]
}