{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/kasturi.muthoosamy",
    "content": [
        {
            "p": "Professor, Kasturi Muthoosamy is an Associate Professor at Faculty of Engineering, the Foundation in Engineering program division. She joined the University of Nottingham Malaysia in the year 2011 as an Assistant Professor and was promoted in year 2016. She has supervised (or in leading process) 7 PhD students and has graduated 2 PhD students. Her research area includes designing drug delivery platforms using nano-graphene composites for targeted delivery of anti-cancers drugs. Her research interest is also on biosensing for cancer cell detection, specifically focusing on theranostics system which allows in situ detection, imaging, and therapy. Her projects are with collaboration from both local and international universities and research institutions.She has successfully obtained more than 13 national and international research grants and has won more than 10 research awards, either by her our contribution or by collaboration. She has published more than 26 peer-reviewed research articles (h-index: 11) and has contributed to many international conferences including as invited speaker. During her earlier education, she obtained her PhD from University of Nottingham, specializing in nanomaterial synthesis and drug delivery. Her MSc is from National University of Singapore (NUS) majoring in Medicinal Chemistry. Her research area in NUS includes protein modifications, purifications, development of activity assays and synthesis of bio-cleavable linkers for drug delivery purposes with collaborations from Institute of Bioengineering & Nanotechnology (IBN), Singapore and Max Plank Research Institute, Germany. Modules taught: Chemistry, Physical Chemistry, Study Skills Other expertise: Medicinal Chemistry, Supramolecular Chemistry, Organic & Analytical Chemistry, Materials Chemistry, Biochemical I take great pleasure in teaching engineering students Chemistry. I often incorporate various teaching techniques and technologies available to keep learning enjoyable, informative and readily-applicable. Current Projects /Objectives 1. C60 Fullerene - Folic acid Nanohybrid Electrochemical Biosensor as a Diagnostic tool for Simpler and Earlier detection of Cancer. 2. New colorimetric & fluorogenic nanobiosensors for telomerase activity detection. 3. Development of multimodule \"turn-on\" protein-gold nanoclusters for targeted theranostics and imaging of colon cancer and its metastases. 4. Graphene-gold (G-Au) nanocomposite for enzyme-less and selective electrochemical detection of nitric oxide, a critical cancer biomarker. 5. Highly sensitive enzyme-less biosensor using folic acid modified reduced graphene oxide for early cancer detection. 6. Reduced graphene oxide-silver (RGO-Ag) nanocomposite and its dual applications as an antibacterial agent and cancer biomarker sensor. 7. Designing drug delivery vehicles/platforms, targeted delivery of anti-cancer drugs, functionalization of graphene and graphene oxide for drug delivery, 8. Graphene-metal nanoparticles and nanoclusters synthesis. 9. Biosensing for disease and cancer detection using modified fullerene and graphene as mediators. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}