{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/People/senthilkumar.arumugasamy",
    "content": [
        {
            "p": "Assistant Professor, Dr. Senthil Kumar Arumugasamy is Assistant professor of Process Control at University of Nottingham Malaysia Campus. He joined University of Nottingham Malaysia Campus in year 2014. One student has completed PhD under his supervision. His major research interest includes Model Predictive control, Artificial neural networks. He is also focussing on Enzymatic polymerization for synthesizing polymers using enzymes as catalyst. He has published more than 50 peer reviewed journal articles (h-index-14) and has presented in more than 30 international conferences. Prior to joining University of Nottingham Malaysia, he received his phD from Universiti Sains Malaysia, specializing in Advanced Process Control. His M.Tech and B.Tech in Chemical Engineering are from India. Research interests include Bio-plastics, Artificial Neural Networks and Model Predictive Control Bio-plastics Plastics have a major role to play in our day to day life. The issue of disposal has become a major challenge for governments, hence countries are heading towards banning them. Researchers around the world have come up with eco-friendly bio-plastics to overcome this issue, one such bio-plastic/bio-polymer being Polycaprolactone (PCL). Application of PCL includes drug delivery and tissue bioengineering, and their demand has reached unprecedented numbers. Conventionally PCL has been synthesised using chemical polymerization. But usage of toxic chemicals, high temperature and high pressure conditions, are its major drawbacks. This has led the researchers to use enzyme-catalysed polymerization to synthesize PCL. Enzymatic polymerization has been receiving greater attention as a new environmentally friendly method of polymer synthesis as enzymes operate under mild operating conditions and are non-toxic, eco-friendly. Artificial Neural Networks(ANN) ANN is a empirical modeling technique which is intended to solve any problem by trying to mimic structure and function of our nervous system. ANNs are based on simulated neurons which are joined together in a variety of ways to form networks. An ANN gains knowledge through learning. Dr. Senthil is working on several types of ANN dynamic modeling and process control applications. Model Predictive Control (MPC) The name MPC stems from the idea of employing a model of the process to be controlled which is used to predict the future behavior. This prediction capability allows optimal control problems to be solved on-line, where tracking error, namely the difference between the predicted output and the desired reference, is minimized over a future horizon, possibly subject to constraints on the manipulated inputs and outputs. While linear model predictive control (LMPC) has been popular in past few decades, nonlinear model predictive control (NMPC) is currently in demand due to the need to operate processes under tighter performance specifications. Dr. Senthil is currently working on NMPC. Projects: • Enzymatic polymerization to synthesize bio-degradable polycaprolactone (bioplastics). • Nonlinear model predictive control (NMPC) of ε-caprolactone to polycaprolactone biopolymerization process. Process Dynamics and Control; Advanced Process Control; Fundamental Process Control, Fluid Mechanics, Engineering Ethics, Process Engineering Project. Model based control of biopolymerization (lactone to polyester) process using Neural networks telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}