{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/kim-yeow.tshai",
    "content": [
        {
            "p": "Associate Professor, Ts. Dr. Tshai (Albert) held position as Associate Professor at the University of Nottingham Malaysia (UNM). Within the Department of Mechanical, Materials and Manufacturing Engineering, Albert currently convene the BEng/MEng level 4 module Polymer Engineering and level 3 module Fibre Reinforced Composites Engineering. He also assist in the delivery of Materials and Manufacturing, Engineering Design and Design Project, Group Design and Make, and the BEng/MEng Individual Project. He has in the past convened modules inclusive of Design and Manufacture, Mechanics of Solids and Stress Analysis Techniques. Albert held administrative roles as examination officer and accreditation liaison responsible on assessment related matters among the three university campuses and professional institutions with the UK Engineering Council, respectively. Albert is affiliated with the Engineering Council UK as registered Chartered Engineer (CEng); Institution of Mechanical Engineers (IMechE) UK as corporate Member (MIMechE); Higher Education Academy (HEA) UK as Fellow (FHEA) of the academy and Malaysia Board of Technologists (MBOT) as Professional Technologist (Material Science Technology). Albert has previously held position as Young Member Chair (2014), Honorary Treasurer (2015) and Committee member (2016) of the IMechE Malaysia Branch. In higher education, Albert completed the qualification of the Postgraduate Certificate of Higher Education (PGCHE) from the University of Nottingham. In the engineering discipline, Albert obtained both his PhD in Engineering and MSc (with distinction) in Manufacturing Systems Engineering degrees from Queen's University Belfast, Northern Ireland, UK. Preceding to his higher degrees from UK, he has graduated with Diploma & Advanced Diploma in Mechanical and Manufacturing Engineering from University College Tunku Abdul Rahman, Kuala Lumpur, Malaysia. Prior to joining UNM, Albert has held position as Engineering Project Leader in Danone, Evian, France, served as Post-Doctoral Research Assistant (PDRA) in Queen's University Belfast, UK, and an Assistant Professor post in University Tunku Abdul Rahman (UTAR), Kuala Lumpur, Malaysia. Albert is currently leading the R&D in diverse research areas of polymer composites, ranging from fabrication, characterization and processing of polymers, fiber reinforced-, particulate filled-, nano- and functionalized- composites of natural and synthetic origin. He has published more than 100 refereed articles in book chapters, journals and conference proceedings. Albert has extensive knowledge in the field of polymer forming processes, plastic and composite materials. In collaboration with Malaysian Plastics Manufacturers Association (MPMA), A. Routsis Associates Inc. US and DreamCatcher Asia, he has delivered specialist professional training in plastic injection moulding and extrusion blow moulding to key manufacturers and industrial players in Malaysia. His research interests include injection moulding, thermoforming, blow moulding, extrusion, constitutive materials modelling, process optimisation of highly nonlinear polymeric systems, natural and synthetic polymer / biopolymer composites, nanocomposites, characterization of structure-property-process relationships in processed polymers, oil & gas pipelines rehabilitation and Six Sigma implementation in the IT industries. Convenor (current) Convenor (Past) Design tutor telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/KEM.897.39.pdf",
        "pdf_files/21-25(3).pdf",
        "pdf_files/13_11_01.pdf",
        "pdf_files/jeas_0815_2452.pdf",
        "pdf_files/2742-2747.pdf",
        "pdf_files/Secure-Enamul-Hoque_NANOMETAL-DOPED-GELATIN-NANOMATRIX-FOR-POTENTIAL-ANTIBACTERIAL-WOUND-DRESSING.pdf",
        "pdf_files/3-KY_Tshai_et_al.pdf"
    ]
}