{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/M3/Our-Alumni.aspx",
    "content": [
        {
            "p": "Vice President at GIC Singapore BEng (Hons) Mechanical Engineering, 2007 \"Be courageous to take on challenging learning opportunities that would stretch you in order to move up to the next level. It will lead you to an uncharted but rewarding path.\" \"My student experience in M3 at UNM was a positive and encouraging one. Despite the steep learning curve, it helped me to build a strong foundation in problem solving and logical thinking. The structured engineering training taught me to be a practical and critical problem solver, where the lifelong skillsets acquired then are relevant and applicable in my current as well as future careers. I was taught to be an independent and resourceful problem solver to plan with a variety of possible options and outcomes for an informed decision-making process. \" General Manager, Group Feed & Livestock at FFM Berhad Malaysia MEng (Hons) Mechanical Engineering, 2008 \"Dedicate yourselves to lifelong learning, and be open minded to accept challenges as opportunities to grow in your career and life.\" \"After SPM, I enrolled into the Foundation in Engineering programme in the earlier days of UNM, having studied in the MISC building at the centre of KL before the full-fledged campus was built in Semenyih. Although the class sizes were small with a handful of lecturers then, I had an engaging learning experience with good interactions with both lecturers and peers. Appropriate equipment was available to facilitate the hands-on learning of practical skills. After completing the MEng (Hons) programme from UNM, I worked as an M&E consultant for an established Malaysian firm for 2 years before accepting a scholarship to pursue my PhD in Engineering at both the China and UK campuses of the University of Nottingham. I am proud to have studied in all 3 of its global campuses, and have enjoyed every single moment of my student life there. With my PhD degree from the University of Nottingham UK, I joined FFM Berhad as the Project Engineer for the Group. FFM Berhad is the largest flour miller in Malaysia with strong presence in the animal feed milling, livestock, and consumer products footprint. While I continued to exercise my engineering knowledge by managing and executing projects for the Group (ranging from building constructions to process improvements), my engineering background and problem-solving acumen had helped me tremendously in my career. I was then given an opportunity to serve as the Deputy General Manager of Johor Bahru Flour Mill (a subsidiary mill of FFM in Pasir Gudang). I was involved in managing the day-to-day operations of the plant with over 300 employees, where I picked up essential skills and knowledge in plant management by engaging both internal and external stakeholders to achieve the company’s objectives. In 2021, I was promoted to assume the portfolio of the General Manager for the Group Feed and Livestock at the headquarter, overseeing the businesses sales, bottom line, and everything in between of these divisions. Being in the same Group, I am also overseeing the operations and projects of the various factories. Having undergone the Nottingham engineering programme from Foundation Studies to UG and then to PhD across all the campuses, I would describe my Nottingham learning experience as wholesome which had equipped me with strong foundation in both knowledge and attitude essential to my achievements and successes today. \" Senior Engineer at Pratt & Whitney Services Singapore BEng (Hons) Mechanical Engineering, 2010 \"Completing a degree does not make you a good engineer, being humble and continuous learning will. Always remember, failure is the stepping stone to success.\" \"During my days in M3 at UNM, having approachable and supportive lecturers was my most positive experience. Besides, the availability of modern hardware and infrastructure also boosted my overall learning experience. These helped me to achieve strong academic performance, which ultimately led to my success as one of the ten scholarship recipients to study for a MSc programme at the University of Nottingham UK. After my graduation, I started my first job in Singapore as a graduate engineer in an O&G company. With my knowledge and skillsets gained through the M3 programme, I picked up further necessary skills quickly, such as CAD modelling and manufacturing processes required to support my daily job. With the welding experience gained from my first job, I switched my career path from O&G to aviation/aerospace industry. I joined GE Aviation Singapore and worked as a welding engineer. I am grateful for the experience here where I had the opportunity to learn and was exposed to the state-of-the-art repair technologies for turbo fan engine components. Up to now, I am continuing my career in the aviation/aerospace industry by joining different related companies, such as Honeywell Aerospace and Pratt & Whitney.\" CTP - Strategic Powerplant Engineer at GE Aerospace Malaysia MEng (Hons) Mechanical Engineering, 2015 \"Find your passion, don't be afraid to take up new challenges, always be hungry for knowledge, stay humble and most importantly, always be positive.\" \"During the first week of my first semester, a lecturer asked, “What is the difference between a scientist and an engineer?” He then said, “Scientists create new things, but we as engineers solve problems”. This resonated with me deeply, and has been very helpful to me since then in my study and even at my work today. Engineers are problem solvers. All the knowledge I gained throughout the four-year course at UNM has set a solid foundation for me in everything I do at work. With these fundamentals, I continue learning and growing each day professionally. Being in the aviation industry today, it is important to know that every little thing we do contributes to bringing people home safely. No mistakes are tolerable in this industry because unlike ground transportation where when something goes wrong, you could simply switch on your hazard lights and stop by the roadside for repair. We always strive to deliver top-quality products in a timely manner.\" Assets Manager at Plenitude Berhad Malaysia MEng (Hons) Mechanical Engineering, 2016 \"Strive to be the best engineer as you’ll play a vital role in the betterment of the community and the nation. Also, enjoy your campus life while you can!\" \"M3 at UNM provided me with the platform during which I gained valuable knowledge, especially on mechanical systems which have been useful in my career. Apart from construction projects and facilities management (for theme parks, casinos, malls and hotels), I had also been heavily involved in several energy efficiency initiatives at my previous jobs (including pumps, chillers, lighting and air compressor systems). I am now a competent steam engineer (Jabatan Keselamatan dan Kesihatan Pekerjaan), a green building index facilitator (GBI) and a registered electrical energy manager (Suruhanjaya Tenaga).\" Portfolio Manager at Open Labs Indonesia BEng (Hons) Mechanical Engineering, 2017 \"Align what you do on campus with your goal; and drive your actions on campus towards that goal.\" \"Studying the Mechanical Engineering course in M3 at UNM has trained me to be analytical and data-driven when making decisions. With the skillsets acquired, I was accepted into multinational companies and growing start-up industries across Southeast Asia. Aside from the skillsets, I was also able to connect with exciting and promising individuals on campus. I have certainly benefitted from the lively UNM campus, helpful lecturers and informative careers advisory service centre which were all-important in kick-starting my career in the earlier years.\" Professional - Sales Innovation at Samsung Electronics Malaysia MEng (Hons) Mechanical Engineering, 2018 \"Utilise the rich resources made available by UNM which will help you reach greater heights.\" \"Throughout my journey of pursuing the Mechanical Engineering course in M3 at UNM, I gained great experience, including spending a year abroad at the UK Campus, participating in a myriad of fun student activities and gaining relevant industrial knowledge from lectures. I have always felt empowered by M3 and its staff. I received immense support from lecturers, both for studies and extra-curricular activities. This allowed me to organise multiple student activities that brought immeasurable values to students, such as the industrial visits to Proton and MAS, as well as Makerthon, just to name but a few. In addition, I felt that the knowledge and skills I acquired at UNM gave me an edge in the job market with industry-relevant knowledge and soft skills. Graduating from UNM gave me confidence in reaching greater heights in my career. Finally, the campus life at UNM will always be the highlight of my student journey. The abundance of student activities allowed me to forge valuable friendships, on top of all the unforgettable memories. My experience here has been nothing short of amazing, and I hope the same for you too! \" Senior Separation Systems Engineer at Dyson Manufacturing Sdn Bhd Malaysia \"Try to take part in more engineering competitions as these give you a real-life challenge in problem solving. Fundamentals are essential, they will eventually boost your engineering careers one day. \" \"The Mechanical Engineering course offered by M3 at UNM covers a wide range of necessary knowledge and skillsets essential for its graduates (including product design, manufacturing process and material properties) that allowed me to land a good job after graduation. Lecturers went in-depth with many industry-relevant topics and provided insights on how the technical knowledge could be applied to certain problem-solving processes in real life. The hands-on practical sessions were very useful in simulating actual scenarios that I might encounter at work as a practising engineer. I am particularly pleased with my student experience in M3 at UNM as the course developed my understanding in engineering fundamentals, enabling me to apply the basic theories and mathematics when designing and integrating a product in my day-to-day job. This has accelerated my career path as I gained more opportunities by working in cross-functional teams. A great example is that, while some individuals might need to run trials to determine the root causes for engineering problems, the fundamental engineering knowledge I possessed allows me to save time and do away with this through a basic fault-tree analysis.\" R&D Designer in the Medical Technology Industry, Malaysia MEng (Hons) Mechanical Engineering, 2019 \"My principle: Success = (Knowledge + Skillset) x (Attitude)\" \"Over the course of my study at the University of Nottingham, I had the opportunity to experience both the UK and Malaysia campuses as an UG student in M3. My student life and learning experience here have been nothing less than remarkable. Both the campuses offer excellent facilities to support my learning, with good teaching delivery by academic staff. More importantly, I had very supportive project supervisor (as well as personal tutor) who helped me stepped out of my comfort zone to explore my untapped capabilities and potentials. In an engineering discipline where women have been traditionally considered a minority, the learning environment provided by M3 has been very encouraging and inclusive to all. This empowerment allowed me to develop my confidence and self-esteem, leading me to excel in my academic study and indirectly in my career afterwards. After graduation, I chose to work as a Mechanical Engineer in an engineering solution company where I was able to be closely involved in the day-to-day ground level operation of the manufacturing and fabrication processes for the power industry. With the skillsets acquired during my study as the foundation, I continuously improve myself through focussed on-site learning with dedication, perseverance and hard work. I was then able to manage major projects for large power plants in Malaysia with the guidance and support from experienced consultants in the field. Due to my passion in mechanical design, I am now venturing into the medical engineering field with the hope that my design will contribute positively to the much-needed advances in medical technologies which are accessible to patients from all walks of life.\" Engineer, Engineering Support at Acson Malaysia Sales & Service \"Apart from putting your hard work in your studies, always be proactive when you are facing difficulties. Keep in mind that soft skills are equally important as hard skills. \" \"It was a very pleasant student experience throughout the course of my study in M3 at UNM. The lecturers delivered their classes in an interactive way where students were able to raise questions and carry out further discussion. The lecturers were generally helpful, and students were welcomed to reach out to them after class for further guidance. I learned how to work individually as well as in a team through the practical assignments and projects. The teaching facilities, resources and equipment are appropriate to enhance the learning process. Apart from classroom teaching, various activities were organised such as industrial visits, career talks and practical workshops which further prepared students for a smooth transition into the actual working environment. Graduates from M3 have good career prospects as the course is widely recognised and graduates are well-equipped with the necessary skillsets to be highly competitive in the job market. After graduation, I worked as an application engineer in the HVAC industry (heating, ventilation & air conditioning). I was able to apply my knowledge of thermodynamics at work and further my understanding of this field. In this position, I supported the sales team by providing solutions on HVAC products design customisation through understanding of the market requirements and advised commercially competitive proposals. After a year into the role, I started mentoring new recruits by providing the necessary job guidance and mentorship.\" System Development Engineer at Fortesvo Sdn Bhd Malaysia MEng (Hons) Mechanical Engineering, 2020 \"Our future is decided by what we do today, not what we are planning to do tomorrow. Take charge now, seize every opportunity and embrace your university experience!\" \"It was a great pleasure to be a part of the M3 family. Prior to choosing UNM to pursue my degree, I had already heard of its distinctive reputation as one of the premier engineering institutions in the world. Indeed, the academic syllabus and learning process have equipped me with the necessary technical and soft skills which are essential in the industry. I benefited tremendously from the compulsory 12-week internship programme, Group Design and Make module in Year 3, as well as the Year 4’s Individual Final Year Project module. The learning curve was steep from the practical aspect. However, with lecturers’ guidance and extensive resources, it was exceptionally gratifying to have learned additional skills outside of the lectures. I had sufficient independence to curate my own learning path by selecting optional modules that I was interested in. Lecturers were also supportive in terms of project scopes and execution methods as proposed by students. Having worked in the industry for more than two years now, I am now excited to lead an upcoming industrial research collaboration with M3 engineering students. I believe the research will greatly benefit both academia and industry.\" Process Data Simulation/Digital Twin Engineer at Micron Technology Singapore \"Life is like a marathon, so enjoy the pace while running towards the destination.\" \"Enrolling into the MEng (Hons) Mechanical Engineering programme in M3 at UNM was definitely a good decision. With amazing lecturers and peers paired with top-quality course content, my student experience was both enjoyable and worthwhile! Joining clubs (such as Enactus) and participating in international design competitions (such as the James Dyson Award) also helped in building my management skills for real-world applications. I would definitely recommend anyone to study here as it has all the necessary resources to help students to pave the path for a good career after graduation. After I graduated, I joined Micron Technology as a process data simulation/digital twin engineer. I am currently involved in the research and development project for the semiconductor assembly process, which requires knowledge in multi-physics simulation and machine learning models.\" PhD student at the University of Nottingham Malaysia \"Allow yourself to venture beyond your comfort zone intellectually and socially, because only then will you start learning something new.\" \"To me, M3 at UNM is a place that catalysed my academic growth and character maturity. Throughout the four years of my undergraduate study, my confidence in mechanical engineering knowledge was moulded by those around me, from fellow classmates to lecturers and technicians, with their valuable inputs of theoretical knowledge and practical skills. Moreover, as an ex-president of the IMechE Student Chapter at UNM, I could safely say that M3 had provided strong support to our club to fulfil the objective of transforming learning into a much more interactive activity. Activities like industrial visits were the most exciting to the students (especially me), since it reinforced practical knowledge and provided me the opportunity to network with those working in the industry. With that said, I am currently pursuing a PhD study at the very institution that I graduated from in the hopes of continuing my academic journey and fulfilling my ambition of becoming a prominent researcher in the field of fluid dynamics.\" Regional R&D Packaging Specialist, Henkel Research and Development Department Dubai UAE BEng (Hons) Mechanical Engineering, 2021 \"Be passionate and explore the various extracurricular activities, The library is your friend, the ducks aren’t! You will excel, graduate, and get a good job, so just enjoy yourself to the max!\" \"I always have the passion to learn how things work and how to create them. In M3 at UNM, I developed as a person first before training to become an engineer. The academic structure taught me time management, resilience, and teamwork. The professors encouraged me with my curiosity and all my questions (even the dumb ones). They also pushed me to learn and discover new things on my own. M3 provided a very rich learning experience. At my workplace now, I have a very strong background knowledge compared to most of the other graduates. In my senior year, I had the privilege of working on integrating A.I. in the field of biomedical engineering as it is my passion. So, the sky's the limit here! I cannot imagine how far I have reached in only three years! Afterwards, I started job hunting and it really tested my resilience. No need to worry or despair as you will get an opportunity eventually. I joined Henkel, as I saw an offer for a one-year internship in LinkedIn. When I reached the final interview stage, they were amazed with how much I had achieved in academics and extracurricular activities. At that moment, I realised what an enriching experience UNM has provided me with! After only nine months, they promoted me to a full-time specialist after assessing my performance. Specifically, the soft skills and team spirit I acquired from my course in M3 and the activities in UNM have helped my personal career development and performance.\" Product Design Engineer at Pentamaster MediQ Malaysia \"Seize every opportunity to learn and grow. Take on challenges and do not be afraid of making mistakes.\" \"My three years of experience as an undergraduate student in M3 at UNM was both worthwhile and rewarding despite the outbreak of the Covid-19 pandemic. The staff were always supportive and stayed committed to delivering effective lectures via the virtual classroom throughout the pandemic. The department prepared me well for employment and has equipped me with the important skills for career and life success. The key element that I have learned from M3 at UNM is the problem-solving skill, particularly on tackling challenging problems through innovative thinking, as well as to implement solutions in pragmatic ways. I worked as an R&D Mechanical Engineer at Hyirox Sdn Bhd, where I was responsible for the conceptualisation, component and system design, proof-of-concept through testing and producing working prototypes for new applications and innovations. Currently, I have a new role as a product design engineer at Pentamaster MediQ.\" telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}