{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/vimal.rau",
    "content": [
        {
            "p": "Assistant Professor, Ir. Ts. Dr. Vimal Rau Aparow received his BEng and MSc from the Department of Automotive, Faculty of Mechanical Engineering, Universiti Teknikal Malaysia Melaka (UTeM). He has completed his PhD in Mechanical Engineering (Automotive) Department in Universiti Pertahanan Nasional Malaysia (UPNM). Then, he joined in Energy Research Institute @ Nanyang Technological University, (NTU) Singapore as Postdoctoral Research for one of the NTU projects known as CETRAN. In CETRAN, his research works mainly focus on development of autonomous vehicle simulation and testing the behavior of the autonomous vehicle in various testing conditions. Currently, he is working as Assistant Professor at Department of Electrical and Electronics Engineering and Head of Automated Vehicle Engineering System (AVES) Research Group at University of Nottingham Malaysia (UNM). He is a certified Professional Engineer (PEng) and ASEAN Chartered Professional Engineer (ACPEng) under Board of Engineers Malaysia (BEM), Chartered Engineer approved by UK Engineering Council under Institution of Mechanical Engineers (IMechE) board and certified Professional Technologist under Malaysian Board of Technologist (MBOT). He is recognized as one of the member of Young Scientists Network under Academy of Science Malaysia (YSN-ASM) for his research contributions. He also has been awarded with SG Academies South-East Asia Fellowship (SASEAF) Programme by Singapore National Academy of Science (SNAS) for research project focusing on validation of virtual safety testing of autonomous vehicle at CETRAN, Energy Research Institute @ Nanyang Technological University, (NTU), Singapore. He is also been appointed as Technical Advisor for MRANTI Autonomous Vehicle (AV) Living Lab to support for virtual and physical safety assessment of autonomous vehicle using Malaysian road and traffic conditions. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}