{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Eee/People/kamyar.mehranzamir",
    "content": [
        {
            "p": "Assistant Professor, Ts. Dr. Kamyar Mehranzamir is an assistant professor at the Department of Electrical and Electronic Engineering. He is a Chartered Engineer (CEng) approved by the UK Engineering Council and a Professional Technologist under the Malaysian Board of Technologists (MBOT). PhD, MSc, BEng, CEng MIET, SMIEEE, Graduate Engineer BEM, Fellow of the Higher Education Academy (FHEA). His research interests include : Awards: Gold Medal in INDUSTRIAL ART & TECHNOLOGY EXHIBITION (INATEX 2013), for A Patent on \"Single Station Lightning Locating System\", 2013. Gold Medal in INVENTION & INNOVATION AWARDS 2105, Malaysia Technology Expo 2015 (MTE 2015), for A patent on \"Lightning Locating System\", 2015. Bronze Medal in INDUSTRIAL ART & TECHNOLOGY EXHIBITION (INATEX 2016), for A Patent on \" Auto- reclosed RCD\", 2016. Bronze Medal in INTEX19 EXPO (INNOVATION AND TECHNOLOGY Exposition 2019), Computer-Based Software for Optimal Sizing of Hybrid PV/Wind Systems in Malaysia, unimas.my, 2016. Silver Medal in INTERNATIONAL EXPO OF INNOVATION PRODUCT AND SYSTEM DESIGN (In-ViDE), Malaysia, 2021, GSM Based Smart Energy Meter, 2021. Gold Medal in INNOVATION TECHNOLOGY EXPOSITION (InTEX22), Malaysia, 2022, Smart Online/Offline Dual-axis Solar Tracking System, 2022. Bronze Medal in INNOVATION TECHNOLOGY EXPOSITION (InTEX22), Malaysia, 2022, IOT Based Cost-Effective Smart Energy Meter, 2022. Bronze Medal in INNOVATION TECHNOLOGY EXPOSITION (InTEX23), Malaysia, 2023, Smart Voltage Fluctuation Monitoring and Protection System, 2023. Silver Medal in INNOVATION TECHNOLOGY EXPOSITION (InTEX23), Malaysia, 2023, Improving Misalignment Tolerance for Wireless Power Transfer Systems using LCC-LCC Compensation Network Resonant Converter, 2023. ACADEMIC AWARDS: 2020 Research Publication Award 2021 FOSE Research Excellence Award 2021 Dean's Excellence Award 2021 Teaching Excellence Award 2022 Professional Outreach and External Engagement Award 2022 Research and Knowledge Exchange Excellence Award Power and Energy (Year 1) Renewable Generation Technologies (Year 3) Power Networks (Year 3) High Voltage Engineering (Year 4) Electrical And Electronic Engineering Fundamentals For Msc Physics of Lightning Discharges Lightning Locating Systems Renewable Energy Sources Power System Current Researches: Electric field distribution in HV insulation. Hybrid renewable energy systems. Hardware and software implementation of lightning location systems (LLSs) based on various methods Photovoltaic farm implementation/simulation in several case studies. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}