{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Message-from-the-Dean/Index.aspx",
    "content": [
        {
            "p": "Welcome to the Faculty of Science and Engineering (FOSE) at The University of Nottingham Malaysia (UNM). The Faculty of Science and Engineering (FOSE) was established in 2000. In 2018, the Faculties of Science and Engineering were merged that led to the formation of FOSE. This merger has fostered synergies in many aspects, particularly in multidisciplinary research and student interaction. The new faculty comprises 6 science schools, 4 engineering departments and 2 foundation schools supported by academic staff of approximately 175 members and a professional services team of around 50 staff members. FOSE aims to be the top choice for future students who wish to pursue a world-class education with an international learning experience. The faculty puts people first, including its students, staff, businesses and investors; at the heart of everything. The faculty embraces a student-centric approach where students are involved in the decision making process in many aspects relating to their learning and extracurricular activities. In 2020-2021, the university invested RM5 million on campus facilities, namely for the upgrading of the virtual desktop infrastructure, investing in high performance computing and classroom facilities, a 3G pitch sports playing turf and a food processing lab. The university is committed to continue investing in campus facilities with the aim of enhancing the student learning experience. This unique value proposition is well-suited to students who wish to be exposed to and engaged in an international learning environment and forward-looking education. At UNM, we foster a vibrant community where aspiring students embark on an exciting path to become adept problem solvers, responsible leaders, and perpetual learners facilitated through a rigorous educational curriculum, enriching learning activities and a spectrum of student events. Our students are guided by distinguished academic staff members, whose expertise is widely acknowledged within their respective industries and scholarly circles. Within the faculty, numerous student chapters collaborate closely with external professional bodies. Students are empowered to shape the student chapter agenda, organise their student events and engage with external experts through talks and workshops. This, in turn, equips our students with valuable competencies and skills in community building, professional development, extracurricular engagement, leadership, and the forging of lasting friendships. Our graduates stand out as exceptional problem-solvers, adept leaders, and skilled communicators. They exhibit remarkable adaptability in the face of new challenges within diverse, multicultural environments. Committed to continuous learning, they keep abreast of evolving and emerging technologies and stay responsive to the ever-changing demands of the workplace. Our researchers and scientists are at the forefront of cutting-edge research, actively bridging the gap between innovation and education. Their efforts empower our students, both at the undergraduate and postgraduate levels, as well as our academic staff, to engage in collaborative research. These partnerships span across our campus and extend to industry leaders within the region and worldwide. Our faculty and university share a steadfast commitment to serving as the solution provider to our nation, industry, and society as a whole. I extend a warm and enthusiastic welcome to our stunning Semenyih campus. I invite you to visit our campus, where you can immerse yourself in the future that awaits you here. Join us to experience our vibrant community of scholars and intellectuals, who are dedicated to academic excellence and innovative research. Professor Ir. Dr. Chung Lim Law P.Eng., C.Eng., C.Sci., FIChemE, MIEM, FHEA telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/UGEngineeringBrochure.pdf"
    ]
}