{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/khaiching.ng",
    "content": [
        {
            "p": "Associate Professor, Ir. Dr. Ng Khai Ching obtained his Bachelor degree in Mechanical Engineering (1st CH with Vice-Chancellor Award) from Universiti Tenaga Nasional (UNITEN), Malaysia in 2003. Soon after his graduation, he worked as an Application Engineer (Computer Aided Engineering) to support the end users of the Finite-Element software, i.e. Altair Hyperworks (i.e. HyperMesh, Optistruct, etc.). He was trained in Altair India (Bangalore) by a group of professional CAE engineers and software developers, before continuing his Ph.D. study in the same university collaborating with Nanyang Technological University (NTU). Due to his strong interests in programming and numerical schemes embedded in those commercial CAE software, his Ph.D. work is mainly on developing high-resolution finite-volume schemes (accelerated with multigrid technique) for solving fluid flow problems on solution-adaptive unstructured meshes. Soon after completing his Ph.D. in 2006, he was granted a 2-year contract as a Researcher in O.Y. L. R&D Centre (now Daikin Malaysia), helping the company to develop a 3D user-friendly & highly customized fluid dynamics simulation software for solving indoor (Indoor Air Quality) & outdoor airflow (tripping of condensing units) problems. He worked mainly on developing the 3D CFD pre-processor (mesh generator) & 3D CFD solver (RANS solver) using FORTRAN 95. In 2008, he joined National University of Singapore (NUS) as a post-doctoral researcher, working on Direct Numerical Simulation (DNS) for simulating turbulent flow over dimpled surface (drag reduction study sponsored by Airbus UK). He was trained on writing parallel CFD code using Message Passing Interface (MPI). In 2009, he re-joined DAIKIN Malaysia to extend his fluid dynamics simulation software for handling 3D arbitrarily complex geometry, to develop in-house cooling and heating loads calculation software, and to offer consultancy service on Computational Fluid Dynamics (CFD) to DAIKIN's distributors worldwide. He has led a team to develop the 3D CFD software (written in C++ & OPENGL) for DAIKIN, which is now called the Virtual Room Simulator (VRSIM). This software has been used by Daikin's distributors such as those in ACSON and Group Associated (GA) to study airflow problems. He joined UNITEN as Associate Professor in 2012 and managed to secure two national research grants funded by MOE and MOSTI to work on mesh-less Computational Fluid Dynamics. In 2016, he was funded by the National Center of Theoretical Science (NCTS) in National Taiwan University (NTU) as a visiting scholar, working on Dissipative Particle Dynamics (DPD) for mesoscale simulation. His work in NCTS has further inspired him to work on particle-based methods for solving challenging fluid flow problems (involving rapid dynamics) which are difficult to be simulated using conventional CFD software nowadays. He has been consistently publishing his work in reputable computational-based journals. During his tenure in academia, he has authored numerous ISI-indexed journal papers (as first author), mainly to disseminate his findings in computational methods. His current research interests are mainly on: (1) Fluid-Structural Interaction (e.g. physiological flow, ocean energy harvesting, 3D printing process of fiber-reinforced polymer etc.); (2) meshless numerical methods (e.g. Smoothed Particle Hydrodynamics (SPH), Discrete Element Method (DEM), Lattice Spring Method (LSM), hybrid mesh-meshless methods); (3) indoor airflow simulation; (4) Object-Oriented Programming (OOP) and (5) parallel programming (e.g. MPI, OPENMP, CUDA). My area of expertise is Computational Fluid Dynamics (CFD), Smoothed Particle Hydrodynamics (SPH), Object-Oriented Programming, Parallel Programming (OpenMP and CUDA). In the past I have taught many Mechanical Engineering subjects such as Engineering Graphics and CAE, Statics, Thermodynamics, and Computational Fluid Dynamics. Currently I am teaching Thermofluids 3 and Introduction to Aerospace Technology. Currently, I am mainly working on Smoothed Particle Hydrodynamics (SPH) method and couple it with other particle-based method such as Lattice Spring Method (LSM) and Discrete Element Method (DEM) to… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/ARFMTSV71_N1_P21_27.pdf",
        "pdf_files/ARFMTSV61_N1_P20_32.pdf",
        "pdf_files/ARFMTSV58_N1_P100_117.pdf",
        "pdf_files/b0e80e4f146b424d1f55e776a2656adaebc8.pdf?_ga=2.140598706.1231179610.1574756557-804792748.1574756557"
    ]
}