{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/People/yi-jing.chan",
    "content": [
        {
            "p": "Associate Professor, Ir. Dr. Chan Yi Jing is graduated with a Chemical Engineering degree from the University of Malaya (UM). She obtained her PhD degree from the University of Nottingham, Malaysia Campus. She is now an Associate Professor at the Department of Chemical and Environmental Engineering, The University of Nottingham, Malaysia Campus. Her research interests include wastewater treatment and bioreactor design. Her research interests include bioreactor design, kinetics modeling, enzyme cocktails development, biogas technology, co-digestion, and optimization of biological wastewater treatment system. She focuses primarily on palm oil mill effluent (POME) treatment by using a novel integrated anaerobic-aerobic bioreactor (IAAB), with dual goals of achieving a final discharge effluent with biochemical oxygen demand (BOD) of less than 20 mg/L and enhancement of biogas generation. She designed and developed the lab scale IAAB (60 L) in 2009, followed by the pilot scale IAAB (1800 L) in 2012 and until recently, the pre-commercialized scale IAAB (3,000 m3) in 2015 with Prof. Chong Mei Fong. The main advantages of using IAAB as compared to other conventional POME treatment system include higher organic removal efficiency, higher methane yield, reduced retention time from 60 days using current ponding system to only 5-7 days using IAAB and most importantly, reduced foot print by 80%. Besides, she also leads the industry research project of co-digestion of biomass waste from palm oil mill, Empty Fruit Bunch (EFB), Mesocarp Fibre (MF) and Decanter Cake (DC) with POME for the enhancement of biogas production. She also works with industry as consultant in evaluating and optimizing the performance of several biogas plants. Reactor Design (H83RED) Advanced Computational Methods (H84ACM) Fundamentals of Process Control (H82FPC) Process Simulation 1 (H83PS1) Palm Oil and Oleochemicals (POO) Research Interests: Wastewater treatment, renewable energy, high rate bioreactor design, optimization, kinetic modelling, enzymatic pretreatment telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}