{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/steve.janssen",
    "content": [
        {
            "p": "Professor of Psychology, MSc Developmental Disorders Course Director, After obtaining my PhD in Psychology in December 2007 from the University of Amsterdam (the Netherlands), I worked first for two years as a postdoctoral research fellow at Duke University (United States) on a project with Prof. David Rubin about the temporal distribution of autobiographical memory and then for another two years as a postdoctoral research fellow at Hokkaido University (Japan) on a project with Prof. Makiko Naka about cultural differences in autobiographical memory. I was subsequently a Vice-Chancellor's postdoctoral research fellow at Flinders University (Australia) working on a three-year project about the self-enhancement function of autobiographical memory. In May 2015, I started as an Associate Professor at the University of Nottingham Malaysia, where I became a Professor of Psychology in April 2020. My research so far has mainly focused on one of the most robust findings of autobiographical memory: the reminiscence bump, which is the effect that people tend to recall more personal events from the period in which they were between 10 and 30 years old than from adjacent time periods. I have shown that the reminiscence bump is impervious to effects of age, gender, education and culture (Janssen, Chessa, & Murre, 2005; Janssen, Gralak, & Murre, 2011; Kawasaki, Janssen, & Inoue, 2011) and not limited to personal events. People perform better on questions about news events from the period in which they were between 10 and 25 years old (Janssen, Murre, & Meeter, 2008), and people's favorite books, movies and records (Janssen, Chessa, & Murre, 2007) and favorite soccer players (Janssen, Rubin, & Conway, 2012) also come from the same period. I also have demonstrated that the reminiscence bump is not caused by a higher prevalence of important, emotional, positive events or first-time experiences (Janssen & Murre, 2008), like long-standing theories had always assumed, at least not when the memories are elicited with cue words (Janssen & Rubin, 2011; Janssen, Uemiya, & Naka, 2013) or when memories for public events are examined (Janssen, 2015a, 2015b). Furthermore, memories from adolescence and early adulthood are also not more vivid or relived more strongly (Janssen, Rubin, & St. Jacques, 2011). These results were gathered with a wide of array of techniques. Most studies were conducted through the internet, which gave me the opportunity to collect the results of large and varied samples. Repeatedly, I have shown that the results of these internet samples are valid. I also devised an algorithm to remove the increased recall of recent events from the temporal distribution of autobiographical memory. With the model, I have overturned the long-accepted idea that the reminiscence bump can only be found in the results of older adults by showing it can also be found in the results of young adults (Janssen, Gralak, & Murre, 2011). Because the converging evidence from my studies suggested that the reminiscence bump in the distribution of word-cued memories could not be explained by the existing theories (Janssen, 2019), I have proposed a cognitive abilities account, which hypothesizes that people store events more strongly during adolescence and young adulthood, because the memory system works at an optimum in those lifetime periods (Janssen et al., 2007; Janssen et al., 2008; Janssen & Murre, 2008; Janssen, Rubin, & St. Jacques, 2011; Maki, Janssen, Uemiya, & Naka, 2013). Additional support for this hypothesis comes from studies that have recently been published, which show that adolescents and young adults perform optimally on cognitive abilities tests (Murre, Janssen, Rouw, & Meeter, 2013) and people who perform better than their age peers on these cognitive abilities tests also perform better on autobiographical memory tests (Janssen, Kristo, Rouw, & Murre, 2015). I am currently module convenor and lecturer for Research Methods and Analyses 1 (PSGY1014) and Autobiographical Memory (PSGY3040). In addition, I am lecturer for Cognitive Psychology 1 (PSGY1010),… read more Please see the website of the Memory laboratory for details of my current research: http://www.nottingham.edu.my/Psychology/Research/Memory.aspx telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}