{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/M3/Programme-Educational-Objectives-PEO.aspx",
    "content": [
        {
            "p": "Program Educational Objective (PEO) is what the programme is preparing graduates for in their career and professional life. Our current PEOs are as follow: PEO1 - Graduates will demonstrate technical competency and leadership to become professional engineers leading to a successful career. PEO2 - Graduates will demonstrate commitment towards sustainable developement for the betterment of society. PEO3 - Graduates will pursue lifelong learning in generating innovative engineering solutions using research and complex problem-solving skills. Our Programme Educational Objectives highlight the knowledge, skills and attributes we aim to develop in our students throughout their time with us. By achieving these objectives, our graduates will be well-prepared for successful careers and make meaningful contributions to the engineering field. Programme Educational Objectives provide clear direction and focus for educational programmes. They ensure that courses align with industry needs as well as societal demands. PEOs guide the design of curriculums, teaching methodologies and assessment strategies, all of which prepare graduates for successful careers. PEOs are implemented through a combination of well-designed courses, lab work, hands-on projects, internships as well as co-curricular activities. All these components are important to provide students with opportunities to develop the desired knowledge and skills outlined in the objectives. Yes, student input and feedback are highly valued in shaping PEOs. Students are welcome to contribute their perspectives, and feedback helps in refining our programmes to better meet the needs of students. PEOs contribute to an institution’s reputation by providing a pathway to produce highly skilled and competent graduates who make significant contributions to their field of study. PEOs are needed as they reflect the quality and effectiveness of an educational programme. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}