{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/Undergraduate-experience/Programme-Outcomes.aspx",
    "content": [
        {
            "p": "The department maps its module learning outcomes to, and assesses the attainment of, two sets of Programme Outcomes: (A) The Engineering Accreditation Council Malaysia (EAC) set and the United Kingdom-Specification set (B). The two sets are compatible and can be interrelated. 1 Engineering Knowledge - Apply knowledge of mathematics, natural science, computing and chemical engineering fundamentals and chemical engineering specialisation as specified in WK1 to WK4 respectively to develop solution to complex engineering problems. 2 Problem Analysis - Identify, formulate, research literature and analyse complex engineering problems reaching substantiated conclusions using first principles of mathematics, natural sciences and chemical engineering sciences with hoslitic considerations for sustainable development (WK1 to WK4). 3 Design/Development of Solutions - Design creative solutions for complex engineering problems and design chemical engineering systems, components or processes to meet identified needs with appropriate consideration for public health and safety, whole-life cost, net zero carbon as well as resources, cultural, societal and environmental considerations as required (WK5). 4 Investigation - Conduct investigation of complex engineering problems using research methods including research-based knowledge, including design of experiments, analysis and interpretation of data, and synthesis of information to provide valid conclusions (WK8). 5 Tool Usage - Create, select and apply, and recognise limitation of appropriate techniques, resources, and modern engineering and IT tools, including prediction and modelling, to complex engineering problems (WK2 and WK6). 6 The Engineer and The Word - Analyse and evaluate sustainable development impacts to: society, the economy, sustainability, health and safety, legal frameworks, and the environment, in solving complex enginering problems (WK1, WK5, WK7). 7 Ethics - Apply ethical principles and commit to professional ethics and norms of engineering practice and adhere to relevant national and international laws. Demonstrate an understanding of the need for diversity and inclusion (WK9). 8 Individual and Collaborative Team Work - Function effectively as an individual, and as a member or leader in diverse and inclusive teams and in multidisciplinary, face-to-face, remote and distributed settings (WK9). 9 Communication - Communicate effectively and inclusively on complex engineering activities with the engineering community and with society at large, such as being able to comprehend and write effective reports and design documentation, make effective presentations, taking into account cultural, language, and learning differences. 10 Project Management and Finance - Apply knowledge and understanding of engineering management principles and economic decision-making and apply these to one’s own work, as a member and leader in a team, and to manage projects in multidisciplinary environments. 11 Life-long Learning - Recognise the need for, and have the preparation and ability for i) independent and life-long learning ii) adaptability to new and emerging technologies and iii) critical thinking in the broadest context of technological change (WK8). The program learning outcomes are grouped into 5 general areas to identify the nature of the skills and capability involved. These groups are: Technical (T) – essential capabilities related to traditional scientific and engineering knowledge Analysis (A) – creatively working with available data and engineering tools and fundamental knowledge to correctly solve basic problem Design (D) – being able to perceive the best solution for both small scale and large scale project by involving all required basic problems Ethics, Safety, Society and Environment (ESSE) - giving appropriate consideration to matters pertaining to professionalism and ethics, safety, local and global society and the environment Work skills (S) – being and effective communicator and effective member of a team and to appreciate the need to continuously acquired skills and abilities. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}