{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Civeng/People/anurita.selvarajoo",
    "content": [
        {
            "p": "Associate Professor, Dr Anurita Selvarajoo graduated with B.Eng. (Hons) in Civil Engineering (Environmental) from Universiti Teknologi Malaysia, in 2006. She received her Ph.D in Fuels and Sustainability from University of Nottingham Malaysia, in 2013. She currently works as an Assistant Professor at the Department of Civil Engineering, Faculty of Science and Engineering, University of Nottingham Malaysia. Her current research encompasses on biomass and biomass-derived biochar. Key area of the research is to characterize biomass and biochar through pyrolysis process for potential applications as energy, water and wastewater treatment, soil enhancement and remediation, climate change mitigation, building materials etc. Anurita also works in the field of natural coagulants and flocculants for agricultural wastewater and enhanced landfill mining. Anurita has authored over 50 papers in different journals, conference proceedings, online articles and also book chapter. She serves as a reviewer in a number of journals. Anurita is also an affiliate member with the Young Scientists Network of the Academy of Sciences Malaysia (YSN - ASM) and a graduate member in Board of Engineers Malaysia (BEM) and Malaysia Board of Technologies (MBOT). Dr Anurita Selvarajoo current research encompasses on biomass and biomass-derived biochar. Key area of the research is to characterize biomass and biochar through pyrolysis process for potential applications as energy, water and wastewater treatment, soil enhancement and remediation, climate change mitigation, building materials etc. Anurita also works in the field of natural coagulants and flocculants for agricultural wastewater and enhanced landfill mining. Anurita is currently teaching in the Department of Civil Engineering. She is the module convenor of Fundamentals of Materials and co-module convenor Group Design Project Year 1. She is the… read more Biomass, biochar, water and wastewater treatment telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/Civil-Engineering-2021-PO.pdf.pdf",
        "pdf_files/Civil-Engineering-2021-PEO.pdf.pdf",
        "pdf_files/Civil-Engineering-2021-PO.pdf.pdf",
        "pdf_files/Civil-Engineering-2021-PEO.pdf.pdf",
        "pdf_files/edsig-newsletter-nov-2020-i88.pdf",
        "pdf_files/281.pdf"
    ]
}