{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/jingying.wong",
    "content": [
        {
            "p": "Associate Professor, Ts Dr Wong Jing Ying is a Professional Technologist under Malaysian Board of Technologist (MBOT) and a fellow of the Higher Education Academy UK. She obtained her Degree of Bachelor of Engineering (Civil) with First Class Honours and Vice Chancellor's Award as well as Degree of Doctor of Philosophy (Civil Engineering) with Best Student Award from Universiti Teknologi Malaysia. She further received 2018 Lord Dearing Award 'Virtual Reality for Building Information Modelling (BIM) in Engineering Education' in recognition of outstanding contribution to enhancing the student learning experience at University of Nottingham. She has research interests in BIM Linked Data in Architecture and Construction, Virtual Reality and Sustainability, as well as the application of emerging technologies in different civil engineering disciplines and education. She has published in International Journal of Interactive Mobile Technologies, International Journal of Innovative Technology and Exploring Engineering, European Journal of Environmental and Civil Engineering, Jurnal Teknologi, and Procedia CIRP. Current Teaching Modules: CIVE 3062 Building Information Modelling (BIM) Group Design Project - Softwares (Autodesk Revit, Robot Structural Analysis, Naviswork, Sketchup, Lumion, Enscape, Dynamo), BIM Execution Plan (BEP), Construction Operations Building Information Exchange (COBie) CIVE 2047 Portfolio of Civil Engineering Studies II (Workshop I1 - Introduction to Building Information Modelling) CIVE 1022 Structural Analysis - Structure Mechanics and Strength of Materials Past Teaching Modules H23BIM Building Information Modelling H23MCP Construction Practice H23MPM Applied Construction Project Management H22NAS Non-Linear Analysis of Structures H22CM2 Civil Engineering Materials 2 H21SSM Structural Strength of Materials H21EC1 Engineering Communication H21V11 Surveying Engineering H21POR Portfolio of Civil Engineering Studies I (Workshop A3 AutoCAD 2D and A4 AutoCAD 3D) Building Information Modelling (BIM) Linked Data in Architecture and Construction Mixed, Augmented and Virtual Reality Sustainable Materials and Construction telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/iJIM_vol14_no06_2020_T.pdf",
        "pdf_files/F10780486S419.pdf",
        "pdf_files/iJIM_vol14_no06_2020_T.pdf",
        "pdf_files/F10780486S419.pdf",
        "pdf_files/F10740486S419.pdf"
    ]
}