{
    "url": "https://www.nottingham.edu.my/Science/People/marina.ng",
    "content": [
        {
            "p": "Associate Professor, Dr Marina Ng is an Associate Professor and research member of the Mixed Reality Lab (MRL) UK and Mixed Reality Hub, Malaysia. She is also the Associate Dean - Admissions, Recruitment and Marketing of the Faculty of Science & Engineering (FOSE). Dr Marina Ng began her research journey in 2000 through her final year project at Multimedia University, Malaysia, resulting in several journal and conference publications, a patent application and university grants. Awarded the prestigious British Chevening Scholarship, she pursued her postgraduate studies in the UK, where she joined the renowned Mixed Reality Lab at the University of Nottingham, obtaining a Master of Research (MRes) in 2002. She completed her PhD within a 3-year timeframe under the supervision of Prof Steve Benford and Prof. Boriana Koleva. It was awarded without conditions (one of the few in the school's history to have achieved this). She is now based in University of Nottingham Malaysia; advancing Human-Computer Interaction research and championing STEAM research and education in Malaysia. She is the recipient of the Lord Dearing Award 2022 in recognition of her outstanding performance and excellence in teaching. She was also conferred the Vice Chancellor's Medal 2022 for her exceptional contribution to students and the local community. Dr Marina Ng's research expertise is in the field of Human-Computer Interaction (HCI), specialising in mobile, mixed reality and Internet of Things (IoT). She has been developing novel interactive technologies - merging physical and digital interactions to explore new ways of living, playing and working. She has extensive experience in conducting interdisciplinary research, employing ethnography, user-centred design, iterative prototyping and participatory design approach, and also deploying and studying them 'in the wild'. Dr Marina Ng is the module convenor of the following modules: COMP2025 - Human-Computer Interaction (2nd year module). COMP3042 - Fundamentals of Information Visualisation and COMP3045 - Information… read more Digital Cultural Heritage Adaptive Learning System for Malaysian Schools Developing IoT Toolkit for making cultural serious games AI Storytelling Authoring Toolkit Using Serious Games for creating awareness in Epilepsy Personalised Nutrition App for Cancer patients telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}