{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/sandy.loh",
    "content": [
        {
            "p": "Professor and Head of School of Biosciences (UNM), Dr Sandy Loh, a virologist and molecular biologist, graduated her bachelor's and PhD's degrees from Universiti Putra Malaysia. She joined the University of Nottingham Malaysia (UNM) in July 2006 and has been working until present. She is a Professor of the university since April 2015, a Senior Fellow of the Higher Education Academy, UK since December 2017 and has been lecturing in the molecular biology and biotechnology areas for twelve years. She was appointed as the Chair of Gender Equality in Nottingham (GEN) since September 2016 to work together with other university members towards achieving gender equality and work-life balance at UNM. She had held the Associate Dean (Teaching and Learning) position from 1 January until 30 June 2021 in leading and coordinating teaching and learning activities within the Faculty of Science and Engineering and the wider University, which include strategic development, programme review and approval, student satisfaction and quality assurance. She had succeeded the implementations of digitally supported guided learning, online teaching and blended learning as well as virtual online laboratories during the Covid-19 pandemic periods. Currently, she is the Head of School of Biosciences since July 2021. She had overseen the UNM Biotechnology Research Centre as a Director for 8 years starting from 2010 which facilitated respectable developments at different areas of molecular biotechnology and plant tissue culture researches. She is the founding leader of Molecular Pharming and Bioproduction (MPharmBio) Research Group at UNM. MPharmBio links up researchers from multidisciplinary areas to work together towards the production of biopharmaceuticals, nutraceuticals, research and diagnostic reagents, industrial metabolites and biochemicals by integrating systematic manufacturing processes. Her current research interests include the application of molecular pharming approach in developing safer and more cost-effective plant-based vaccines and biopharmaceutical proteins for treating significant viral diseases and cancers, and for general health promotion; investigations on medicinal plant bioactives and in combination with vitamin E isomers as alternative cancer treatment strategies as well as development of applied nanomaterials for diagnostics and tissue engineering. She had received a few awards in recognition of her excellent research, teaching and academic achievements such as Pfizer's Prize; New Researcher Award from University of Nottingham; Malaysian and International Invention, Research and Innovation Medals, MAKNA Award from Malaysian National Cancer Council; Nottingham Research Leader; UNM Staff Oscar Awards, WinSET Career Achievement Award, Vice-Chancellor's Medal, International Outstanding Woman in Health and Medical Sciences Award, Lord Dearing Award and etc. I was awarded as a Senior Fellow of the Higher Education Academy, UK in December 2017. My teaching interests cover mainly in molecular biology and its related areas. I have been teaching \"Genes and… read more I am the founding leader of the \"Molecular Pharming and Bioproduction (MPharmBio) Research Group at UNM. My research interests cover (i) molecular pharming in the area of vaccine development for human and veterinary diseases as control strategies using plant systems; (ii) development of plant-made biopharmaceutical proteins in plants using emerging agroinfiltration platform (iii) natural product in the aspect of biological investigations particularly on antiviral, antibacterial and anticancer properties; (iv) development of nanosensors for pathogens and diseases detection and (v) development of nanomaterials for tissue engineering. These research activities have been funded by different ranges of grants especially in my capacity as a project leader/principle investigator from MOSTI, MOA, MoHE, MAKNA, NRF, AAR and Davos. Interdisciplinary research collaborations have been established in these areas with different schools in UNM; Sutton Bonington and University Park campuses; local and international research institutes and universities as well as private commercial companies. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/29012018_15.pdf",
        "pdf_files/low.pdf",
        "pdf_files/209.pdf",
        "pdf_files/250.pdf",
        "pdf_files/L0266472.pdf",
        "pdf_files/VC6_poster_programme.pdf",
        "pdf_files/661_-_667_Zeenathul_N_A.pdf"
    ]
}