{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/miflah.hussain",
    "content": [
        {
            "p": "Assistant Professor, I graduated from the University of Nottingham Malaysia Campus (UNMC) in 2014, with a BSc (Hons) in Psychology and Cognitive Neuroscience. Subsequently, I moved to Queen Mary University of London (QMUL) to do my PhD in Dr. Isabelle Mareschal's lab, on a project investigating natural scene perception. After obtaining my Doctorate from QMUL and having been an Associate Lecturer (2017-2018) at the same institution, I started at UNMC as an Assistant Professor in the School of Psychology in September 2018. I am currently involved in teaching for the following modules: PSGY2012 - Cognitive psychology 2 PSGY1015 - Practical methods in Psychology PSGY2016 - Practical methods in Psychology & Cognitive Neuroscience PSGY3047 - Scientific computing with Matlab Themes: Image classification, short-term and long-term visual adaptation, prior expectations, gaze behaviour and eye-hand coordination My work primarily focuses on examining neural mechanisms underlying people's ability to rapidly classify objects and scenes. I am particularly interested in finding out how classification is influenced by: 1) people's expectations about the characteristics of the physical environment and the sociocultural context in which they live, and 2) perceptual experiences in the recent past. I am also collaborating on projects of the Active vision lab that investigate gaze behaviour and eye-hand coordination. I conduct experimental research in laboratory, realistic and real-world settings, and I use a combination of psychophysics and eye-tracking techniques. Below is a list of current projects: Perceptual biases in object classification Contextual effects on facial emotion recognition Orientation and spatial frequency sensitivity in image classification Short term and long term adaptation to visual features Anticipatory gaze movements in badminton players telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}