{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/People/ching-lik.hii",
    "content": [
        {
            "p": "Professor and Co-Director of Future Food, Ir Dr. Hii Ching Lik is Professor of Chemical Engineering and Director of UG Studies in the Department of Chemical and Environmental Engineering (Academic staff since Aug 2010). In campus research, he is Co-Director of the Future Food Malaysia Research Centre. Professionally, he has more than 25 years of working experience both in the food industry and academia. His expertise areas include food & bioproduct processing, industrial drying, cocoa & chocolate processing and heat & mass transfer operations. Ir Dr Hii is a Professional Engineer (PEng) registered with Board of Engineers Malaysia, ASEAN Chartered Professional Engineer (ACPE), Corporate Member of the Institution of Engineers Malaysia (MIEM), Chartered Member of the Institution of Chemical Engineers (MIChemE), Chartered Engineer of the Engineering Council UK (CEng) and Fellow of the Higher Education Academy UK (FHEA). Externally, he also serves as Chair of the IChemE Food & Drink Special Interest Group (Malaysia Chapter), Committee Member of the Food & Drink Special Interest Group (UK), Committee Member of the IEM Agricultural and Food Engineering Technical Division, Member of the International Advisory Board for Asia-Pacific Drying Conference (ADC) and International Symposium on Processing of Foods, Vegetables and Fruits (ISPFVF). Ir Dr Hii is Co-Editor of two books published by CRC Press: \"Drying and Roasting of Cocoa and Coffee\" and \"Drying of Herbs, Spices, and Medicinal Plants\". Professional registrations: PEng, CEng, ACPE, MIEM, MICHEME, FHEA Academic qualifications: BEng (Hons) Degree (First Class) in Chemical Engineering (University of Manchester Institute of Science and Technology, 1996), MSc Degree in Food Processing and Engineering (Universiti Putra Malaysia, 2004), PhD Degree in Chemical Engineering (University of Nottingham Malaysia, 2010) and Postgraduate Certificate in Higher Education (University of Nottingham, 2014) Present: Food Processing Technology; Transport Phenomena; Mathematical Methods Past: Heat & Mass Transfer; Particle Mechanics; Industrial Dehydration; Chemical Products Design; Computer System; Introductory Chemistry; Waste Management; Fluid Mechanics Ir Dr Hii current research interests are in the areas of drying & dehydration technologies, preservation of food antioxidants/nutrients, bio-products processing and computer simulation on heat… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/edsig-newsletter-dec-2020-i89.pdf",
        "pdf_files/12_1_10.pdf",
        "pdf_files/(19).pdf",
        "pdf_files/Volume%20%289%29%20Issue%20%281%29%20123-135.pdf",
        "pdf_files/Polyphenols%20in%20cocoa%20%28theobroma%20cacao%20l.%29.pdf"
    ]
}