{
    "url": "https://www.nottingham.edu.my/Science/People/jessica.price",
    "content": [
        {
            "p": "Associate Professor, FOSE Associate Dean of Teaching & Learning, I graduated from the University of Glasgow with an MA(Hons) in Psychology, an MSc in Psycholinguistic Research methods and a PhD in written language comprehension in healthy Ageing. I gained post-doctoral experience at both University of Strathclyde and the University of Glasgow, investigating the neural and cognitive mechanisms that are affected in early stages of Alzheimer's disease, using dense array EEG/ERP techniques, before working at the University of Birmingham as a teaching fellow. I joined the University of Nottingham Malaysia in August 2011. My Orcid profile I.D is 0000-0001-7200-8691 I use a range of behavioural techniques as well as eye tracking and electroencephalogy in my research. I am interested in factors that influence how deeply we comprehend discourse. I have explored how these factors might change across the lifespan and more recently in bilinguals/multilinguals. More recently, i have become interested in exploring how language background can influence executive functioning. I also investigate ways in which you can measure language background and language proficiency. I also investigate more applied areas such as factors influencing food choice, the effects of music on anxiety and mental health. I am the Associate Dean of Teaching and Learning for the Faculty of Science and Engineering. I co-ordinate teaching related activities across the faculty. I have previously taught on these courses in the School of Psychology: I currently teach on the following modules: I also supervise final year project students and PhD students. I am currently working on a project which aims to create a database of translation norms of Bahasa Malaysia-English words. The aim is to develop a Bahasa Malaysia language proficiency test. By… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}