{
    "url": "https://www.nottingham.edu.my/Science/Message-from-the-Dean/Index.aspx",
    "content": [
        {
            "p": "Welcome to University of Nottingham Malaysia, Faculty of Science and Engineering (FOSE). The Faculty of Engineering and the Faculty of Science were founded in year 2000. In 2018, both faculties were merged, and the Faculty of Science and Engineering was established. The merging has created synergies in many aspects especially the cross disciplinary research and student interaction. The new faculty has 6 science schools, 4 engineering departments and 2 foundation schools supported by approximately 175 academic staffs and 50 professional services staffs. The faculty aims to be the first choice of education provider for future students who wish to pursue world-class education with international learning experience. The faculty puts people which includes students, staff, businesses and funders at the heart of everything we do within the faculty and the university. The faculty embraces student centred approach and students are involved in the decision making in many aspects related to their learning and extracurricular activities. In 2020-2021, the university has invested RM 5 Million on campus facilities, namely virtual desktop infrastructure, high performance computing, classroom facilities, 3G pitch sport playing turf, food processing lab. The university is committed to continue investing in campus facilities with the aim to enhance student learning experience. This unique value proposition is well-suited to students who wish to be exposed to and engaged in international learning environment and forward-looking education. Here in University of Nottingham Malaysia, we create a vibrant community where aspiring students walk on an exciting path to be problem solvers, responsible leaders and lifelong learners through a rigorous education learning activities and student events provided to them, organised for them. The students are couched by reputable academic staff whose contribution and capability are well recognised by the respective industries and learned communities. Within the faculty, there are numerous student chapters that work closely with external professional bodies. Students are empowered to drive the student chapter agenda, organise their student events and engage external experts for talks and workshops. This in turn allows our students to acquire competencies and skills in community building and networking, professional development, extracurricular experience, leaderships and friendships. Our graduates are excellent problem solvers, effective leaders and strong communicators with the adaptability to new challenges, multi-cultural and multi-racial environment. They are life-long learner and are driven to keep pace with evolving and emerging technologies and the demands of the workplace. Our researchers and scientists are engaged in cutting-edged research and we bring cutting-edge science and technology into classroom leading our students to a rewarding careers in industry and businesses. In addition, our students both undergraduate and postgraduate as well as academic staff are engaged in collaborative research across campus and with industry partners in this region and across the globe. The faculty and the university are committed to be the solution provider to the nation, the industry and the society. I enthusiastically welcome you to our beautiful campus in Jalan Broga, Semenyih, Selangor, located next to Broga Hill a popular destination for adventure seekers and fitness buffs. Visit the campus and explore your future here. Come and experience our community of scholars and intellectuals. You can learn more about our student activities, researchers’ news and faculty events by following us on Facebook. Professor Ir. Dr. Chung Lim Law P.Eng., C.Eng., C.Sci., FIChemE, MIEM, FHEA telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": [
        "pdf_files/UGEngineeringBrochure.pdf"
    ]
}