{
    "url": "https://www.nottingham.edu.my/Science/People/tahir.ansari",
    "content": [
        {
            "p": "Associate Professor, Dr Mohammed Tahir Ansari is presently working as an Associate Professor at School of Pharmacy, University of Nottingham Malaysia. He has worked with various reputed national and international institute like NIPER (India), Amity University Uttar Pradesh (India) and Universiti Kuala Lumpur Royal College of Medicine Perak (Malaysia). Dr. Tahir is a Pharmacist and his research area focuses on enhancing bioavailability of drugs. This specifically involves inclusion complexes, nanosization, liposomal drug delivery system. He is also involved in conducting public health survey studies on vaccination and immunization. He is also working in reducing the toxicity of cyclodextrin by enhancing the complexation efficiency of cyclodextrin to make the drug inclusion complexes more compatible. At present He is working on curcumin and resveratrol to improve its pharmacological effects for lung cancer treatments Advanced Drug Delivery (PHAR3032 UNMC) Bacterial and Fungal Infections (PHAR1012 UNMC) Biopharmaceutics (PHAR2013 UNMC) Cardiovascular (PHAR2018 UNMC) GI and Liver Disorders (PHAR2016 UNMC) Laboratory Studies in Pharmaceutical Sciences 1 (PHAR1022 UNMC) Laboratory Studies in Pharmaceutical Sciences 2 (PHAR2012 UNMC) Pain (PHAR2021 UNMC) Pharmaceutical Sciences Research Project (PHAR3015 UNMC) Pharmaceutics 1: Physicochemical Science and Medicines Design (PHAR1007 UNMC) Pharmaceutics 2 : Pharmaceutical Technology (PHAR2011 UNMC) Research Projects Sexual Health and Pregnancy (PHAR2020 UNMC) 1. Fundamental Research Grants Scheme, Ministry of Higher Education, Malaysia 2023 FRGS/1/2023/SKK16/UNIM/02/3 \"Investigating the potential improvement in solubility, bioavailability, absorption and permeation of embelin-2-Hydropxy propyl-β-cyclodextrin nanosponges for brain drug delivery in the management of neurological disorder\" 2. Fundamental Research Grants Scheme, Ministry of Higher Education, Malaysia 2023 FRGS/1/2023/SKK16/UNIM/02/1 \"Elucidating formulation requirements for temporal release of growth factors and antibiotics from a 3D printed wound dressing.\" 3. Fundamental Research Grants Scheme, Ministry of Higher Education, Malaysia 2021 FRGS/1/2021/SKK06/UNIKL/02/3 \"Understanding the opinion of Malaysian parents towards vaccination and predicting the opinion for early intervention for increased immunization\" 4. Fundamental Research Grants Scheme, Ministry of Higher Education, Malaysia 2020 FRGS/1/2020/SKK0/MUSM/02/6 \"Embelin-Poloxamer conjugate as a synergistic combination for neurodegenerative diseases\" 5. Pump Prime Grant, University of Nottingham Malaysia, 2020 Formulation and evaluation of nanoparticulate drug delivery system for resveratrol with an aim to increase its biovailability and therepeutic applications. 6. Network for Equity through Digital Health (NEED), Monash University Australia. Development of automated epileptic seizure detection & drug based prevention device telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}