{
    "url": "https://www.nottingham.edu.my/Science/People/thomas.guiney",
    "content": [
        {
            "p": "Assistant Professor, Faculty of Social Sciences Dr Thomas Guiney is an Assistant Professor of Criminology in the School of Sociology and Social Policy. Tom joined the University of Nottingham in September 2021 having previously held positions at Oxford Brookes and the London School of Economics where he was a Visiting Fellow in the Mannheim Centre for Criminology. Tom completed his PhD in Social Policy at the LSE in 2016 and read for an MSc (Distinction) in Criminology and Criminal Justice at the University of Oxford (2009). Prior to this, Tom spent a number of years working in public policy with the Prison Reform Trust, Bond and the National Lottery Community Fund. Tom's research interests include penal policymaking, parole, the politics of crime and historical criminology. Tom has published widely in international journals including the British Journal of Criminology, Theoretical Criminology and Punishment & Society. His first monograph 'Getting Out: Early Release in England and Wales, 1960-1995' was published by the Oxford University Press Clarendon Series in 2018. Tom is a member of the Editorial Board of the British Journal of Criminology and sits on the Advisory Board of the Prison Reform Trust Building Futures project. He has given oral evidence to several Parliamentary Select Committees, he has contributed guest articles to the Huffington Post, Daily Telegraph and he has appeared on the BBC and ITV on questions relating to penal policy. My primary research interests include penal policy-making, the politics of law and order and the history of criminal justice in England and Wales, with particular reference to parole and other 'early release' mechanisms. I am currently working on the following research projects: Tom welcomes inquiries from prospective doctoral applicants in his fields of interest. Tom currently convenes the following modules: telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}