{
    "url": "https://www.nottingham.edu.my/Science/People/kimmcconkey",
    "content": [
        {
            "p": "Frugivores with disparate foraging behavior are considered to vary in their seed dispersal effectiveness (SDE). Measured SDEs for gibbons and macaques for a ‘primate-fruit’ were comparable despite the different foraging and movement behavior of the primates. This could help facilitate fruit trait convergence in diverse fruit–frugivore networks. Within fruit–frugivore networks, the characteristics of fruits converge on a few general types (‘dispersal syndromes’) that are apparently related to the foraging capabilities of seed-dispersing animals (Lomáscolo et al. 2010, Donatti et al. 2011). However, these animals are often from broad taxonomic groups with different seed dispersal capabilities and they exhibit asymmetric dependence with fruit species (Bascompte et al. 2006), fueling doubt on the concept of dispersal syndromes (Herrera 1985). Evaluating the contributions of seed dispersers with diverse behavior is difficult, but the recent development of the Seed Dispersal Effectiveness (SDE) landscape (Schupp et al. 2010) provides a means to compare divergent contributions. ‘Primate-fruits’ are common within tropical forests (Janson 1983). However, primates are thought to exhibit weak selective pressures on fruit characteristics because of inherent variability in the traits that influence the dispersal process (Chapman & Russo 2006). In Southeast Asian rain forests, there is widespread overlap in the distributions of gibbon and macaque species. Both are generalist frugivores with overlapping fruit preferences (Marshall et al. 2009), but they differ markedly in their behavior. Gibbons show extensive knowledge of fruit resource location (Asensio et al. 2011), and swallow and defecate most seeds (McConkey 2009). Macaques are opportunistic feeders, inconsistent dispersers and frequently spit seeds (Albert et al. 2013). We compared the seed dispersal effectiveness of gibbons (Hylobates lar) and macaques (Macaca leonina) for a ‘primate-fruit’ using the SDE landscape. The study was conducted in the 30-ha Mo Singto Forest Dynamics Plot (101°22′E, 14°26′N) in Khao Yai National Park, Thailand. The plot (725–915 m altitude) lies in seasonal evergreen forest that receives 1200–3000 mm of rainfall per year, mostly during May–September, with a dry season from October to April. All woody trees and shrubs with diameter at breast height (dbh) ≥1 cm have been mapped, tagged and identified on the plot (Brockelman et al. 2011). Maximum fruit availability occurs from April to June (Brockelman 2011). The liana, Salacia chinensis (Celastraceae), occurs at a density of 4.4 ramets/ha (dbh >3 cm) on the Mo Singto plot. Fruiting occurs from March to June (Wongsriphuek 2008) with some fruiting stems available most years. Fruits fit the description of a ‘primate-fruit’ (Janson 1983): orange, medium-sized (length × width, 36.9 ×34.3 mm) with a husk (4.9 mm thick), sweet, juicy pulp and 2–7 seeds (19.1 × 13.8 × 10.4 mm). The seeds are swallowed by gibbons (Wongsriphuek 2008), but are too large to be swallowed by macaques (Albert et al. 2013) and are spat out. Giant squirrels (Ratufa bicolor) also consume the pulp and drop the seeds. For our study system, we defined seed dispersal effectiveness (SDE) as the likelihood of a seed being dispersed by a frugivore to a site adequate for seed and seedling survival. Seed dispersal effectiveness is the product of the quantitative and qualitative components of dispersal (Schupp et al. 2010). ‘Quantity’ is the probability of a seed being dispersed by that animal and was measured using fruit-fall transects. ‘Quality’ is the likelihood of a seed producing a 2-year-old seedling, and was calculated using three recruitment stages: (1) distance probability of seed dispersal by each frugivore; (2) survival (1-year seedlings) of dispersed seeds at each distance; (3) seedling survival between 1 and 2 years. We collected ‘quantity’ data over poor (2005) and rich (2011) fruiting seasons—fruiting stems were three times more abundant in 2011 than in 2005. We placed fruit-fall transects (1 m wide under crown, 2 m wide away from crown to allow for different seed density) in the four cardinal directions and extended them from the approximate middle of the crown to 30 m beyond the crown edge. We used only stems with ripening fruit. We counted all fruit, seeds and husks falling on transects daily (2005, 14 days in each of 4 stems; 2011, 16 days in each of 12 stems). Distinctive feeding signs were still clearly visible on the seeds and husks after 1 day, allowing identification of the animal species processing the fruit (McConkey & Brockelman 2011) (identifications confirmed by 70 h of direct observations). Squirrels chew off the husk and pulp leaving chisel-like marks in the husk and dropped seed. Macaques and gibbons leave similar primate-teeth impressions in the husk. However, macaques store the pulp-covered seeds in their cheek pouches and spit out single and almost-cleaned seeds, while gibbons swallow and defecate seeds in small clumps (3–5 seeds plus fecal material; Wongsriphuek 2008). Primates fed at 3- to 5-day intervals in the small crops (K.R. McConkey & W.Y. Brockelman, unpubl. data). Hence, on a given day, only one feeding event occurred and we could determine whether it involved a macaque or gibbon by the presence or absence of spat seeds. Seed dispersal distances were measured daily using transects; seeds not accounted for along transects (based on daily counts of empty husks) were recorded as being dispersed farther than 30 m. Densities of dispersed seeds along transects were converted to total numbers for calculation of ‘quantity’; results presented are from all stems combined. We measured survival rates for seeds handled by different frugivores in 2011. We marked all dispersed seeds, fallen whole fruits and partly eaten fruits (by a small, flagged stick) and monitored them daily along the 30-m transects for up to 20 days (encompassing the 9.2 ± 2.2 days germination period; range 3–13 days, N = 137) and we rechecked them for established seedlings after 15 months. We combined results from 12 plants because of low crop sizes. In 2005, we placed 60 gibbon-defecated seeds (with feces) in groups of five (to simulate natural patterns), under the crown (two ‘scats’) and at ten random distances (10–30 m) from each fruiting crown. We monitored these daily for 7 days, and rechecked them for seedlings 12 months later. Fifteen months (in 2012) after fruiting, we counted seedlings along transects identical to those described earlier and rechecked them after 1 year. Macaques consumed at least half the Salacia chinensis crop in both years (weighted average across years, considering relative abundance of fruiting stems = 51%; Fig. 1A). Gibbons consumed few fruits in the poor fruiting year, but the weighted average of 35 percent indicates overall consumption is high. Squirrels ate the pulp only in the poor fruiting year (average = 8%). Few fruits went uneaten in both years. Macaques and gibbons were functional dispersers, depositing 85 percent and 94 percent of handled seeds away from parent crowns, respectively, while squirrels were low-quality dispersers (Fig. 1B). In 2011, most (93%) dispersed seeds and fruits remained untouched on the forest floor after 20 days (Table 1). There were no differences in the likelihood of survival during this period between the different dispersal types (Table 1). No whole or partly eaten fruits germinated, but 46–47 percent of dropped seeds germinated (Table 1). First year seedling survival was highest for seeds deposited away from the crown, with second-year seedling survival higher under the crown than away from the crown (Fig. 1C). Eaten by macaque (8%)b Disappeared (3%) Germinated (0%, N = 47) Rotten (2%) Germinated (0%, N = 46) Disappeared (6%) Rotten (0.4%) Germinated (46%, N = 208) Rotten (1%) Germinated (47%, N = 89) Macaques were the most effective seed dispersers in both years with a weighted average SDE of 0.052 (5.2% of available seeds were dispersed by macaques and survived to 2 years; Fig. 1D). Despite variable effectiveness across study years, the average SDE of gibbons was comparable to macaques (0.035). Squirrels were not effective dispersers (0.001). Overall, macaques dispersed 59 percent of potential recruits (i.e., second-year seedlings), gibbons 40 percent and squirrels 1 percent. Hence, primates dispersed 99 percent of potential recruits. There was a significant negative relationship between total percentage of the crop consumed by macaques and gibbons across stems (2011; Spearman rank, r = −0.96, P < 0.0001; Fig. S1A). None of the variables we measured (total daily fruit fall and number of fruiting days; as recorded on transects) could explain this relationship (Spearman rank; P-values >0.10). However, a spatial difference in the location of stems consumed by macaques and gibbons was apparent, with stems visited mostly by gibbons located on the western side of the plot, and those eaten by macaques on the east. Although macaques and gibbons dispersed seeds from different stems, this did not influence the SDE values of these stems (Mann–Whitney U test; U = 64, P = 0.793; Fig. S1B). Primates dispersed 99 percent of potential S. chinensis recruits. While macaques may consume more fruits than gibbons—particularly in poor fruiting years—qualitative recruitment patterns were comparable and SDE values from gibbon-dispersed and macaque-dispersed stems did not differ. The patterns of seed deposition produced by macaques (i.e., seeds spat singly) and gibbons (i.e., seeds defecated in small clumps) did differ, but seeds were not targeted by seed predators and these differences did not affect the dispersal effectiveness of the primates. The primary constraints on early recruitment were seed cleaning (Levi & Peres 2013), a service both primates provided, and distance-dependent seedling establishment. Short-range dispersal distances were similar between the primates, however; consequently, recruitment of this primate-fruit was facilitated by both primate species despite their disparate fruit-handling behavior. The most important differences in the seed dispersal roles of gibbons and macaques for S. chinensis were their food-finding behavior and deposition sites. Gibbons have a cohesive group structure and display extensive knowledge of fruit source locations (Asensio et al. 2011), which might allow them to select only the largest or most conveniently located Salacia chinensis crops. This may explain the low quantity value for gibbons in 2005, although our limited sample size in this year may not have adequately captured gibbon feeding. Seed deposition is confined to the canopy forest in which gibbons are restricted, with dispersal distances averaging 300–400 m (McConkey & Chivers 2007). In comparison, subgroups of macaques roam across large home ranges (Hanya 2009) that often encompass multiple habitat types. Thus, they may be less selective of fruit sources but have higher consumption capacity, and they can deposit seeds into gaps or across habitat breaks. Conversely, more seeds may be deposited in unsuitable environments (perhaps reducing differences in SDE quality between macaques and gibbons) and dispersal distances are constrained by short processing times (maximum recorded = 265 m; Albert et al. 2013). Finally, the primates utilized fruit sources that were not found or utilized by the other species. Hence, both primates may play complementary roles in dispersal (McConkey & Brockelman 2011). Salacia chinensis was dependent on primates for dispersal, but gibbons (and probably macaques) consumed alternative species when fruiting sources were scarce (Wongsriphuek 2008, Brockelman 2011). Such asymmetric dependence between species is important for network stability (Bascompte et al. 2006), but more symmetric dependences may exist between fruit types as a whole and the frugivores that consume them; this would reinforce fruit trait convergence in fruit–frugivore networks. Gibbons have clear preferences for certain fruit species (which are often ‘primate-fruit’) when in season (McConkey et al. 2002), and at the Mo Singto site most of these species do not fruit yearly (Brockelman 2011). This forces gibbons to be flexible and depend on an array of fruit species that offer the required nutritional rewards, rather than individual species. For this system to work, the primate-fruits must be among the most preferred fruits in the diet so that they are always selected during the short and often unpredictable periods and years when they are available. In summary, our study shows that disparate foraging behavior can have comparable impacts on plant recruitment and, consequently, could facilitate fruit trait convergence within diverse fruit–frugivore networks. These relationships may be characterized by dependence between frugivores and suites of ‘preferred’ fruit species that frequently display characteristics converging on certain traits. Further studies on other primate-fruit are required to assess how widespread the observed patterns are, and could generate insightful details on functional dispersal networks. We thank Saiwaroon Boonkongchart, Amnart Boonkongchart, Alison Perfect, Anuttara Nathalang for logistical help; Mr. Prawat Wohandee, Mr. Narong Mahunnop and the National Research Council of Thailand for permission and support. Eugene W. Schupp and a reviewer provided useful comments on the manuscript. Research support and funding was provided by Biotec/National Science and Technology Development Agency, Thailand Research Fund, A. V. Ramarao Research Foundation, British Ecological Society and Percy Sladen Memorial Trust. Volume46, Issue6 November 2014 Pages 647-651 Copyright © 1999-2024 John Wiley & Sons, Inc or related companies. All rights reserved, including rights for text and data mining and training of artificial intelligence technologies or similar technologies."
        }
    ],
    "pdf_files": []
}