{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/woo.ko-choong",
    "content": [
        {
            "p": "Associate Professor, Present appointment Associate Professor Awards and Distinctions Chairman of RANM 2009 conference, Kuala Lumpur, Malaysia External memberships Guest Editor Journal of Computational and Nonlinear Dynamics (One issue in 2017) Paper reviewer Proceedings of the Institution of Mechanical Engineers Part C, Journal of Mechanical Engineering Science; International Journal of Automotive and Mechanical Engineering; International Journal of Mechanical Engineering Education; International Journal of Non-Linear Mechanics; Journal of Sound and VIbration; Nonlinear Dynamics; Journal of Vibration and Control; Journal of Computational and Nonlinear Dynamics; International Journal of Mechanical Sciences; ASME Journal of Vibration and Acoustics; Mechanical Systems and Signal Processing; Journal of Risk and Reliability; Communications in Nonlinear Science and Numerical Simulation; Journal of Mechanical Science and Technology; Journal of Engineering Science and Technology; Journal of Science and Technology-TNU(Thai Nguyen University); The European Physical Journal Plus Conference Organiser Recent Advances in Nonlinear Mechanics (RANM), 24-27 August, 2009, Kuala Lumpur, Malaysia. Member of many Scientific and Technical Committees in international conferences. My research interests centre on the use of analytical methods of Nonlinear Dynamics to solve engineering problems. In particular, numerical methods to facilitate design, and the associated issues of control are main features of my work. Experimental investigations are often a key feature of my activities, and complement the theoretical analyses performed. The foci of my attention are nonlinear mechanical vibrations, vibro-impact dynamics, fracture and fatigue and condition monitoring. I collaborate actively and have been invited to be a conference speaker. Industrial collaboration is consistently being sought and consolidated, and I warmly welcome any interactions with anyone who has similar interests. Teaching interests include dynamics and analytical methods. Nonlinear dynamics; nonlinear oscillations; mechanical vibrations; approximate analytical methods; numerical techniques; experimental correlation; application to vibro-impact ma-chines;… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/Vol_6_5_551_557_MUSHTAK.pdf"
    ]
}