{
    "url": "https://www.nottingham.edu.my/Science/People/daniel.seal",
    "content": [
        {
            "p": "Honorary Assistant Professor & Chartered Clinical Psychologist, Dr. Daniel Seal is a Chartered Clinical Psychologist from the UK. He obtained his Doctorate from University College London (UCL) and he holds a Masters in Mental Health Services Research from the Institute of Psychiatry at King's College London. Prior to moving to Malaysia Dr. Seal worked with a number of specialist clinics and hospitals in London. He has helped adults, adolescents and children cope with difficulties such as anxiety, depression, autism, ADHD, schizophrenia, chronic pain, learning difficulties and brain injury. Working on behalf of the Dyslexia Association of Singapore, Dr. Seal has also used neuropsychological assessment tools to guide teachers and parents of children who were having difficulty within the Singaporean education system. One of Dr. Seal's specialist interests is in working with people who have Post Traumatic Stress Disorder (PTSD). He was part of a leading clinic in London which supported refugees who had complex PTSD following their escape from horrific events in their home countries. In Malaysia, Dr. Seal is combining his clinical work with research that aims to adapt interventions that are known to be effective in other countries to the Malaysian context. He is currently working with the University of Malaya's Hospital (PPUM) and the UN's refugee arm (UNHCR) to train others to deliver psychological interventions. If you would like to learn more about Dr. Seal and his work his website address is: www.resolve.my. I have now stopped teaching at the University of Nottingham, except for occasional careers talks for students. Between 2014 and 2017 I taught: Social Psychology (a first year undergraduate psychology course that is open to students from other courses) Statistics (2nd year undergraduate psychology) Qualitative Methods (as part of 1st & 2nd year practicals) Introduction to Clinical Psychology (a 3rd year undergraduate psychology course) I also supervised undergraduates' final year projects and ran careers talks. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}