{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/Undergraduate-experience/Testimonials.aspx",
    "content": [
        {
            "p": "Ramanath Tamelarasan Graduation: 2023 Job title: Manufacturing Process Engineer Company: ExxonMobil “UNM provided an abundance of resources and expertise to expand my horizon beyond the local landscape. The curriculum was meticulously structured to provide industry-relevant technical skills for students. On top of that, the campus experience integrated key soft skills that accelerated both personal and professional development. Undeniably, the valuable network, skills and technical knowledge gained at UNM ensured my readiness to meet the global workforce demands.” Boaz Chung Yi Heng Graduation: 2022 Job title: Project Engineer Company: Linde Malaysia \"The university provided a platform not just for academic growth but also personal development, equipping students with vital skills and knowledge necessary to face the professional working world. Opportunities such as research programs and extracurricular activities offered practical experience, fostering holistic development and preparing us for the challenges beyond graduation. Additionally, my university journey was supported by a dedicated team of lecturers who focused on providing students with the best learning experience.\" Haarivalagan John Samuel Arulraj Graduation: 2021 Job title: Assistant Process Engineer Company: Recron(Malaysia)Sdn Bhd “I am immensely grateful for my experience in the Department of Chemical and Environmental Engineering at UNM. The curriculum here provided me with valuable skills that I now use daily in the industry. The faculty and staffs were not only knowledgeable but also incredibly supportive throughout my undergraduate journey. Participating in club and society events was equally enriching as these activities honed my soft skills and expanded my network, complementing the technical aspects of the curriculum. Moreover, the university's facilities contributed to a conducive learning environment. One aspect that truly stood out was the serene natural environment away from the bustling city. It provided a tranquil setting for learning and personal growth. Overall, my time in UNM was truly amazing and I am proud to have been a part of it.” Esther Lim Hui Xian Graduation: 2019 Job title: Process Safety ConsultantEnvironmental Company: SynergenOG Sdn Bhd “The university served me a platform for developing and diversifying my skills through participation in various clubs and societies, enabling me to overcome challenges in presentation and communication. The course and assignments tested me on my analytical acumen, teamwork capabilities and individual performance through different case studies. These skills have played a part to prepare me for the transition to professional life, especially in a technical field that I am involved in. Additionally, the UK Exchange Program has enriched my understanding on cross-cultural experience that allowed me to be well-rounded on global perspectives.” Ainul Najwa Sazali Current company: PETRONAS Chemicals Group Year of graduation: 2012, MEng in Chemical with Environmental Engineering \"I joined PETRONAS as a process engineer for Ethylene Oxide-Ethylene plant, a subsidiary of Petronas Chemical Group,(PCG). I had equipped myself to be a versatile chemical engineer, by instilling a strong foundation, in both technical competencies and business acumen. These were strongly developed and inculcated during my time at The University of Nottingham. I have always deemed education to be a valuable virtue in life as I believe that I had to be a steadfast and exemplary young engineer with high perseverance as well as formidable intelligence, in order to excel in the technically complex, challenging, and fast-changing oil and gas industry. I had consistently provided plant support and was actively involved in the technical discussion with technology licensors, and displayed a strong commitment which led to safe start-ups and excellent plant performances. I had also led the technical and economic catalyst evaluation process which was the first of a similar plant technology but with a higher performance catalyst. I was assigned to lead new PCG strategic growth projects especially in developing extended value chains from excess feedstock available from PETRONAS plants. My leadership ensured that the first collaboration between multinational companies and PETRONAS as a trailblazer resulted in a significant breakthrough within the industry. I was also thrilled when my initiatives have won the honour of the Highly Commended Young Chemical Engineer of The Year Award in 2015, 2017 and 2019 by The Institute of Chemical Engineering (IChemE) Malaysia. This is because I truly believe that the barometer of our success also lies within the foundation which we have structured during our educational pursuit at the University.\" Alan Ko Shian Lyn Current company: Innovative Synergy Solutions (ISS) Year of graduation: 2008, Meng in Chemical Engineering \"I am the General Manager and founding member of ISS which is an Oil & Gas EPCC Process Skid Package company in Malaysia since 2009. I have been developing and managing its operation for over 12 years and has expanded its reach into various international markets. With my process engineering background acquired during my undergraduate years in Nottingham University, I was well equipped with the knowledge in integrating the know-how into successful business and product development. I have delivered over 50 process skid packages over the 12 years covering fuel gas conditioning, gas dehydration, Produced Water Treatment and Water Injection Systems for offshore application. The experience gained during my years in Nottingham University in Semenyih, Malaysia was an unforgettable ones.\" Ir Chong Chee Siong Current company: McDermott Asia Pacific Sdn Bhd (part of McDermott International) Year of graduation: 2008, MEng in Chemical Engineering \"I am currently a Senior Process Engineer in the Oil and Gas industry. My work experience is in detailed design engineering for EPCIC (Engineering, Procurement, Construction, Installation and Commissioning) projects covering offshore topside design of Wellhead Platform (WHP), Central Processing Platform (CPP), Mobile Production Unit (MOPU), and Floating Production Unit (FPU) for projects located in Malaysia, Vietnam, Denmark, and Australia. I am grateful that the university promotes a controlled environment and platform which allows me to develop my creativity, analytical, and critical thinking skills freely. Initially hated it but during my early career I found that the environment helped prepare me to be a successful engineer. Another key element that I loved about the programme’s DNA was the numerous opportunities to work in group projects where it helped me built my confidence in my social and communication skills. I felt the early exposure really helps to shape my career even until today. Another great experience that I have benefited while studying in both university campuses in Malaysia and UK (through the Inter-Campus Exchange Programme) was the diversity and cultural exposure. My university course mates and lecturers are from diverse background and nationalities. The cultural exposure, teaching methods, friendship, and life experiences, have broaden my mindset. This in turn has built my adaptability to work in an international company where many of my colleagues and clients are from diverse background and nationalities too.\" Dr Kah Peng Lee Current company: Evonik Industries Year of graduation: 2009, Meng (Hons) Chemical Engineering \"Evonik is one of the world-leading specialty chemical manufacturer. Based in Austria, I am honoured to lead a R&D department of about 20 people for product development (SEPURAN® Hollow Fibre Membranes). In the last 5 years, it has been exciting to expand our product portfolio and to accompany a newly established business that grew 5-fold! The opportunity to see a newly developed product successfully commercialized is very rare and precious. My study at UNMC has provided me a solid foundation for technical skills. What is even more important, is the soft skills and perspective I gained during this time, which paved a good path for me to pursue my career in the field of innovation in the industry.\" Malwynn Leong Current company: Emerson Automation Solutions Year of graduation: 2009, MEng in Chemical with Environmental Engineering \"I am a Business Development Manager, covering the South East Asia and India market. Over the past 10 years, I have had the opportunity to work for a number of multinational corporations (MNCs) requiring me to work not only across the upstream and downstream oil and gas industry but also across all engineering disciplines. The foundation and skills I have built and acquired during the course of my chemical engineering program has not only provided me a solid stepping stone to entering the industry but have also projected me far in the engineering career I am pursuing.\" Current company: Nexant Year of graduation: 2015, MEng in Chemical Engineering \"I am a Senior Research Analyst based in Kuala Lumpur. As a member of Nexant’s consulting team, I have gained experience from numerous technical, commercial and market advisory roles in oil and gas, as well as the renewable industry. I have completed various projects which include market and pricing analysis, cost curve analysis, independent due diligence review, feasibility study as well as supply chain analysis. Prior to joining Nexant, I worked as an Application Engineer with Honeywell Process Solution, where I was responsible for the development of dynamic simulation model and computer-based training (CBT) kit. All my work experience is built on my good fundamental on simulation that I acquired in my undergraduate study especially my final year project in process design and optimisation.\" Wau Cze Min Current company: Procter & Gamble (P&G) Year of graduation: 2015, MEng in Chemical Engineering \"I’m currently a Distribution Center Manager. I work closely with third party supply chain and logistics partners to manage the supply chain operations of the only distribution hub and warehouse of the company in Malaysia. I make sure that all the processes do not compromise safety, quality and legal requirements. Prior to this, I was a production plant manager who oversaw the production, supply chain and distribution operations as well as site facilities. I was very glad to accomplish my degree at University of Nottingham Malaysia. It is a very important key to unlock my entire career path which enables me to explore different career opportunities.\" Sylvia Simon is a fourth-year MEng Chemical and Environmental Engineering student. In this video, she shares her experience studying here at University of Nottingham Malaysia Campus and explain why she decided to pursue this course. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}