{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/christina.chin",
    "content": [
        {
            "p": "Associate Professor, Undergrads Course Director, Ts Dr Chin is an Associate Professor with the University of Nottingham Malaysia in the Department of Mechanical, Materials & Manufacturing Engineering. She is also the departmental Undergraduate Course Director overseeing, managing and providing strategic lead all the undergraduates programmes. Dr Chin has a wide range multi and interdisplinary knowledge in project engineering management for sustainability & environmental impact industries, methodologies and energy management related aspect including green technology, security, and storage. She has earned her Professional Technologist (PEng/Ts.) and Graduate Technologist from Malaysia Board of Technology recently accreditating her skills and experiences. Dr Chin has over 50 publications to date in internationally refereed journals, technical papers, congress/ conference proceedings, and book chapters. She is also an active reviewer for international journals, conferences, books and invited guest speakers for lectures and webinars based on well established academic-industrial collaboration partnership in various countries globally. Dr Chin is constantly supervising undergraduates and postgraduates students throughout her academic career. At present, she has PhDs students under her supervision working on areas such as emerging energy technologies, energy trading, security and storage capacity and efficiency. She also serves as internal and examiners for postgraduate theses. Dr Chin has a wide range multi and interdisplinary knowledge in project engineering management for sustainability & environmental impact industries, methodologies and energy management related aspect including green technology, security, and storage. Year 1 - MMME1037 Programming and Professional Laboratory Skills Year 3 - MMME3088 Engineering Management 2 (Convenor) , - MMME3092 BEng Individual Project (Convenor), - MMME4014 Group Design… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/06.pdf",
        "pdf_files/06.pdf"
    ]
}