{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/About/AboutTheDepartment.aspx",
    "content": [
        {
            "p": "Welcome to the Department of Chemical and Environmental Engineering. Chemical Engineering has been established at The University of Nottingham since 1961. We have a long history of collaboration with industry, and graduates gaining jobs with major companies. Our department was established at the University of Nottingham Malaysia in year 2003. We are renowned for excellence in teaching and research. Our academics comprised of international experts across various areas of chemical engineering, which include food and biochemical processing, renewable energy, environmental protection, and process system engineering. Our academics are recognized for their outstanding achievements, which include Top Research Scientist Malaysia, Fellow of Academy of Sciences Malaysia, Young Scientist Award, etc. Our academics work with many industrial and academic collaborators across Asia, Europe, America, and Africa. In the past decades, our students have won various national and international awards. They publish regularly in various international journals for their outstanding final year projects. This reflects our outstanding teaching and research quality. Our research-led teaching philosophy prepare the graduating students for a successful professional career in the chemical process industry, along with transferable skills needed for lifelong learning. In 2024 Guardian University Guide, we are rated as a UK top 5 chemical engineering department, while QS and THE World University Rankings put us as top 15 chemical engineering department in the UK. Our programmes are accredited by the Board of Engineers Malaysia and the Institution of Chemical Engineers. Prof. Ir. Dr. Dominic Foo Chwan Yee UNM Chemical and Environmental Engineering Facebook UNM Chemical and Environmental Engineering Instagram UNM Chemical and Environmental Engineering LinkedIn UNM Chemical and Environmental Engineering TikTok CEE Safety documents \"log-in is required\" telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}