{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Maths/People/yeejiun.yap",
    "content": [
        {
            "p": "Associate Professor, Dr. Yap Yee Jiun was born on 10 August 1978 in Malaysia. In 1992, he moved to Singapore and studied at New Town Secondary School, developing a keen interest in physics. During his studies at Catholic Junior College (Singapore) from 1996 to 1997, he was selected for the Nurturing Talented Undergraduates: Residential Technology Induction Programme on University's Courses at Nanyang Technological University (Singapore). He began his undergraduate studies in 1998 at the University of Manchester with financial aid from an award under the British Scholarship Scheme 1998, graduating in 2001 with a Bachelor of Science (Honours) in Physics with Astrophysics. He then moved to London and continued his studies in the Department of Mathematical Sciences at Brunel University, receiving his doctorate (Doctor of Philosophy) in 2006. He returned to Malaysia and joined the Malaysian Institute of Microelectronic Systems (MIMOS) in 2006 as a Senior Researcher. He was elected a Member of the Institute of Physics (UK) in 2007 before becoming a Senior Lecturer in the Institute of Mathematical Sciences at the University of Malaya (Malaysia) in 2009. In 2014, he joined the Department of Applied Mathematics at the University of Nottingham Malaysia Campus (UNMC) as an Assistant Professor, and was promoted to Associate Professor with effect from 1st January 2018. He received the Gold Research Award from the Faculty of Engineering (FOE) in December 2018 and assumed the position of Head of Department (HOD) for the Department of Applied Mathematics on 1st February 2019. He became Head of School (HOS) after the Department of Applied Mathematics evolved into the School of Mathematical Sciences in February 2019, following his initiation for a change. While serving as the HOS, he established the Industrial Advisory Board within the school and also developed a new Bachelor of Science (BSc) Mathematics and Data Science programme which was launched in 2021. During his tenure as the HOS, he developed a Master of Philosophy (Applied Mathematics) programme and a Doctor of Philosophy (Applied Mathematics) programme which were launched in 2023. He received the Research Excellence Award and the Teaching Excellence Award from the Faculty of Science and Engineering (FOSE) in 2021. He signed a Memorandum of Understanding (MOU) with Algae International Berhad on 21 December 2022, thereby establishing a university-industry research collaboration. He became the Co-Director of Smart Systems Research Cluster in 2023 and established two data science research units: Mathematical and Statistical Modeling Research Group as well as Machine Learning Research Group. He received the 34th International Invention, Innovation & Technology Exhibition (ITEX) 2023 Silver Medal under the Biotechnology classification as the sole inventor. In 2024, he took up the role of Associate Editor of Frontiers in Physics (indexed in Web of Science, SCIE (Physics, Multidisciplinary), ranked Q2 in 2024). List of Awards: FOE Research Award 2018 (Gold) FOSE Best Marketing Team 2019 (Bronze), serving as HOS FOSE Marketing Speakers of the Year 2020 (Gold) FOSE Most Enthusiastic Marketer 2021 (Bronze) FOSE Research Excellence Award 2021 FOSE Teaching Excellence Award 2021 ITEX 2023 Silver Medal Research Grants Received (External Research Grants): Fundamental Research Grant Scheme (FRGS) from the Malaysian Ministry of Higher Education Reference Code: FRGS/1/2020/STG01/UNIM/02/2 Title: Evaluation of solvent bubbling mechanism on the biomass production and cell disruption in a microalgae cultivation system Duration: 1 November 2020 to 31 October 2023 Approved Budget: RM 111500 Role: Leader PHC-Hibiscus Grant from the Malaysian Ministry of Higher Education, in collaboration with the Ministry of Europe and Foreign Affairs (MEAE) and the French Ministry of National Education, Higher Education and Research (MESRI). Reference Code: MyPAIR/1/2020/STG05/UNIM/1 Title: An investigation on algal proteins partitioning mechanism in ionic liquid biphasic flotation system Duration: 1 May 2020 to 30 April 2022 Approved Budget: RM 45000 Role: Member Current Research Students: Current PhD Student (as Main Supervisor): Lau Zhi Lin (supported by FRGS grant: FRGS/1/2020/STG01/UNIM/02/2) Current MPhil Student (as Co-Supervisor): Tham Pei En telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}