{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/suyin.gan",
    "content": [
        {
            "p": "Professor of Chemical Engineering, Suyin Gan is currently a Professor of Chemical Engineering at the Department of Chemical and Environmental Engineering, University of Nottingham Malaysia Campus. Prof. Gan works in a wide range of interdisciplinary experimental and computational activities within the central theme of energy and fuels. This includes biofuel cum biomass processing technologies, combustion and emissions as well as environmental remediation. She has over 100 publications to date in internationally refereed journals, technical papers, congress/conference proceedings and book chapters. She has led a number of projects which are funded by government organisations, industry and university and has established collaborations with various local and international partners. Prof. Gan's research encompasses a range of interdisciplinary experimental and computational activities within the central theme of energy and fuels. This includes biofuel cum biomass processing technologies, combustion and emissions as well as environmental remediation. The key experimental projects comprise sustainable biofuel production technologies using waste materials, evaluation of biofuel composition on physicochemical properties and its associated impacts on combustion and emissions, as well as environmental remediation for pollutants such as polycyclic aromatic hydrocarbons, petroleum hydrocarbons, heavy metals etc. Meanwhile, the computational research projects focus on integrated chemical kinetics modelling-computational fluid dynamics (CFD) simulation of combustion and emissions processes for alternative fuels. Prof. Gan is currently the module convenor of Power Generation and Carbon Capture, and Separation Processes Fundamentals. She also contributes to the supervision of design and advanced design… read more Biofuel/biomass processing technologies; combustion and emissions; environmental remediation telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/8_433_Lau_13.pdf",
        "pdf_files/13_3_6.pdf",
        "pdf_files/12%20-%20IFRJ171075.R2%20EDITED.pdf"
    ]
}