{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/grace.lim",
    "content": [
        {
            "p": "Associate Professor, Soo Yong (Grace) Lim received the BEng(Hons) degree in electronics majoring in telecommunications from Multimedia University, Malaysia, in 2003 and the Ph.D. degree in electrical engineering from the University of Hawaii at Manoa, USA, in 2010. She is presently an Associate Professor with the Department of Electrical and Electronic Engineering, University of Nottingham Malaysia. Her current research interest includes radio propagation modeling, channel measurements, ray tracing, and machine learning. Ir. Dr. Grace Lim is a fellow of the Higher Education Academy (HEA, UK), a senior member of the IEEE, and a registered professional engineer with the Boards of Engineers Malaysia (BEM) since 2016. From 2011 onwards, she started serving the IEEE Antennas and Propagation Society as a member of the Education Committee, and from 2015 forth, she commenced the role of an Associate Editor of the Computer Applications in Engineering Education, published by John Wiley and Sons. She remains in active service for both these roles hitherto. Dr. Grace Lim received the Lord Dearing Award in June 2022, which celebrates excellent teaching and learning at the University of Nottingham. In July 2018, she was honored globally as the recipient of the IEEE AP-S Donald G. Dudley Jr. Undergraduate Teaching Award, with this citation \"For modernizing the teaching of electromagnetics and for innovating its relevant curriculum design\". Earlier in May 2018, she was selected worldwide as the Reviewer of the Month by IEEE Access, \"for notable services and fine contributions towards the advancement of IEEE Access\". This recognition is to thank her \"for her valuable and thorough feedback on manuscript, and for her quick turnaround on reviews\". Nationally within Malaysia, she received the IEEE Best Paper Award in year 2023, 2022, 2021, and 2018; and the IEEE Excellent Award in year 2020 and 2019, all from the IEEE AP/MTT/EMC Awards Committee, Malaysia Chapter. In 2012, she won the Award for Achievement in Research for Early Career Researchers, Sunway University; and a bronze medal at the Malaysia Technology Expo, awarded by the Malaysian Association of Research Scientists. Research expertise: antennas and propagation, fields and waves, electromagnetics, ray tracing, channel measurement, propagation prediction, propagation modeling, and machine learning. Present: H63FWA Fields Waves and Antennas H62MMT Modelling: Methods and Tools H61ENA Engineering Mathematics (Fields and Waves) H61CET Contemporary Engineering Themes (Electromagnetic Engineering) Year 1 Skills Series: MATLAB Workshop Past (Selected): H61SCP Introduction to Circuits and Fields H62PEP Practical Engineering Design Solutions and Project Development (Electronic Project) Ir. Dr. Grace Lim's research interests for the past two decades have revolved primarily around radio propagation measurement and modeling in wireless communication environments. She adopts the… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}