{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/mumtaj.begam",
    "content": [
        {
            "p": "Associate Professor, Mumtaj Begam is an Associate Professor in the Department of Electrical and Electronic Engineering, The University of Nottingham, Malaysia. She obtained her B.Sc (Special) from University of Madras and M.Sc (Electronics) from Bharathidasan University, both from India. She also obtained a Bachelor degree in Education (B.Ed.) from Annamalai University, India. She worked in India for a reputed engineering college affiliated to Anna University, Chennai for 17 years in various academic capacities. She received her Ph.D from Multimedia University (Faculty of Engineering), Malaysia for her work on advanced power sources emphasizing Li-ion batteries. She joined the University Teknologi PETRONAS where she worked as an Associate Professor prior to joining The University of Nottingham. She has published over ninety papers in refereed journal, international and national conferences. She also serves as an international advisory board member and technical reviewer for journals and conferences. Power System for Aerospace, Automotive and Marine Applications (H64AN1/ANA Advanced Power Conversion (H64APC) Power Electronic Design (H63PED//H54PE2) Solid State Devices (H63SSD) Power Supply Electronics (H62PSE) Introduction to Electronic Engineering (H61IIC) Introduction to Electrical Engineering (H61IAL) Power Electronic Applications and Control (EEEE3112) Advanced Power Electronics (EEEE4135) Practical Engineering Design Solutions and Project Development (EEEE2052) Research includes Electric Vehicles, Wireless Power Transfer for EVs, State of Charge (SoC) estimation for EVs, Renewable Energy, Energy Harvesting and Power Electronics. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/818-1399308467.pdf",
        "pdf_files/1003.4081.pdf",
        "pdf_files/158-T284.pdf",
        "pdf_files/1003.4083.pdf",
        "pdf_files/10406.pdf",
        "pdf_files/EL_17_2_02.pdf",
        "pdf_files/EL_16_3_03.pdf",
        "pdf_files/A242.full.pdf",
        "pdf_files/A416.full.pdf"
    ]
}