{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/sim.shinzhu",
    "content": [
        {
            "p": "Assistant Professor, Dr. Sim Shin Zhu obtained her BSc degree with honors, MSc degree, and PhD degree in Statistics from the Institute of Mathematical Sciences at the University of Malaya. After completing her PhD, she pursued post-doctoral training at the University of Malaya as well. Currently, Dr. Sim holds the position of Assistant Professor at the School of Mathematical Sciences, University of Nottingham, Malaysia campus. Her research work revolves around flexible count distribution, which cover a wide range of dispersion levels. Google Scholar: https://scholar.google.com/citations?user=SfJgiq0AAAAJ&hl=en Scopus: https://www.scopus.com/authid/detail.uri?authorId=57200373800 Orcid ID: https://orcid.org/0009-0000-0387-5329 Current Teaching Focus: MATH1037 Analytical and Computation Foundation, MATH2050 Introduction to Scientific Computation, MATH2047 Statistical Models and Methods Past Teaching Focus: Sampling Techniques, Theory of interest, Mathematical techniques for Engineering, Fundamentals of Financial Mathematics and others. Area of expertise: Statistical modeling and inference, Simulation and Computation and statistical data analysis. Research Project: A new flexible bivariate distribution (Principal Investigator), 15 September 2023 - 14 September 2024. Proximal Spectral Gradient Method In Portfolio Optimization (Co-investigator), July 2021 - June 2022 Stochastic Count and Regression Models for Business, Actuarial and Financial Analytics (Co-investigator), December 2022 - November 2024. Supervision: Master Dennis Ng Wen Wei (2019) A study of Properties on Generalized Beta and Mixture of Two modified Log-normal distributions, Master dissertation/thesis. Tee, Yee Yang (2022) A study of covid-19 recession on the housing prices in Johor Bahru, Master dissertation/thesis Life Member: Malaysia Institute of Statistics telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/CPS183-P1-S.pdf"
    ]
}