{
    "url": "https://www.nottingham.edu.my/Science/People/chung-lim.law",
    "content": [
        {
            "p": "Dean of Faculty of Science and Engineering, Chung Lim completed his first degree in Chemical and Process Engineering; MSc and PhD in the field of fluidised bed technology and advanced drying technology. He obtained the Post Graduate Certificate of Higher Education (PGCHE) in 2010, a professional recognition in higher education and now a fellow of the Higher Education Academy UK. Within the faculty, Chung Lim held a number of responsibilities over the past years. 2011 - 2013: Deputy Head of Department (Chemical and Environmental Engineering) 2013 - 2016: Associate Dean (External Affairs), Faculty of Engineering 2016 - 2019: Head of Department (Chemical and Environmental Engineering) 2019 - 2020: Interim Dean, Faculty of Arts and Social Sciences 2020 - 2021: Head of Department (Chemical and Environmental Engineering) 2021 - present Interim Dean, Faculty of Science and Engineering Externally, Chung Lim serves in a number of roles in professional body. Currently, he serves as Chair, IChemE Malaysia Board Leader, Chemical Paper Examination Committee, Board of Engineers Malaysia Associate Director (Chemical Engineering), Engineering Accreditation Department, Board of Engineers Malaysia Chung Lim LAW, PhD., C.Eng., C.Sci., P.Eng., FIChemE, FHEA, MIEM Chung Lim is a chartered engineer and chartered scientist registered with the Engineering Council UK and Science Council UK respectively. He is also a professional engineer registered with the Board of Engineers Malaysia. He is a fellow of Institution of Chemical Engineers (IChemE, a professional engineering institution in UK) and a corporate member of Institution of Engineers Malaysia (IEM). He was a senior panel member of the Engineering Accreditation Council (EAC), assisting the Council to accredit the chemical engineering programmes in Malaysia. Now he serves as the Associate Director for Engineering Accreditation Department overseeing and moderating accreditation panel report of chemical engineering programmes offered in Malaysia. Over the past years, he has conducted and facilitated a number of workshops and training courses to academics who wish to learn more about Outcome Based Education, Complex Problem Solving, Engineering Programme accreditation. In addition, he also serves as the Leader of Chemical Paper Examination Committee, a committee under the Professional Competency Examination Committee of Board of Engineers Malaysia. The committee is responsible for setting professional examination for professional engineers who wish to obtain Practising Certificate in order to practice engineering and endorse engineering works. He also serves as the Chair for IChemE Malaysia Board. The board is responsible for the member activities in Malaysia. Chung Lim is instrumental in promoting UK chartered engineer membership to the Malaysian member. He has conducted numerous Get-Chartered workshop and assisted many chartered engineering applicants. Chung Lim started his research work since 1998, and thus far has completed 13 research projects which research outlay amounted to RM2.5M which includes 6 industrial research contracts. He focuses his research activities in solving industrial related problems therefore all his research projects are applied research. Thus far, he has worked on 1. processing of padi (rough rice) using fluidized bed technology, 2. preservation of local fruits such as ciku, chempedak salak etc. using advanced drying technology without addition of hazardous chemical preservatives, 3. improving cocoa flavor of Malaysian cocoa bean, 4. maximizing retention of bio-active ingredients such as crude ganoderic acids and polysaccharides in processed ganoderma lucidium, 6-gingerol in thermal processed ginger and generation of 6-shagoal in ginger, anthocyanins, polyphenols and flavoids in dehydrated Roselle, limonene myrcene and pinene in pomelo peel, sinensetin and rosmatic acids in Misai Kuching, orientin and vitexin in Belalai Gajah (Sabah snake grass), protocathecuic acids and catechin in Roselle, sialic acids in edible birdnests, cis-citral and trans-citral in Lemon Myrtle, 5. preserving colour attributes of processed products such as local fruits (ciku, chempedak salak), edible birdnest. He is currently working on the membrane based heat pump system in generating hot water for domestic use as welling as generating dehumidified air for drying purpose. Apart from projects related to product quality which are mentioned above, he also works on food safety. He has worked on the application of chlorine dioxide on preserving fresh strawberry. Chung Lim completed his first degree in Chemical and Process Engineering and MSc followed by PhD in the field of fluidised bed technology. He started his teaching since 2004. His teaching expertise… read more Chung Lim started his research since 1998. He has worked on a number of research projects including fluidised bed processing of large particles, fluidised bed drying, low temperature drying, heat… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}