{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Eee/About/Index.aspx",
    "content": [
        {
            "p": "At the turn of the millennium, we simply cannot separate electrical and electronic engineering from our daily lives. From microwave ovens to iPads, from power generators to hybrid cars, from broadband internet to satellite communication, we are surrounded and empowered by products based on electrical and electronic engineering. The department of Electrical and Electronic Engineering in Malaysia is built on a strong foundation and a wealth of experience from the department in the United Kingdom which was established in 1933. Backed by nearly a century of experience, we have established our reputation as one of the world's leading universities in this discipline. In Malaysia, the Department of Electrical and Electronic Engineering was established in 2000. Starting with a handful of students, we now admit over 100 new undergraduate students each year and around 30 students onto our MSc. We have close links with our sister campuses in the UK and China. We have joint-campus PhD programmes as well as undergraduate mobility programs where students may spend up to one year at one of our overseas campuses. A Nottingham degree has an excellent reputation within engineering and other related industries. Our graduates are highly sought by top companies such as Intel and Motorola, just to name a few. Careers events hosted by the university attract many companies to recruit our graduates. All of our BEng and MEng undergraduate courses are fully accredited by the Institution of Engineering and Technology (IET), allowing graduates a fast-track development to the status of Chartered Engineer. Here at the Malaysia Campus, our MEng degree courses are currently accredited by the Board of Engineers Malaysia (BEM) and thus, graduates from those courses hold the 'Accredited Engineering Degree.' Link to our social media platforms UNM Electrical and Electronic Engineering Facebook UNM Electrical and Electronic Engineering Instagram telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}