{
    "url": "https://www.nottingham.edu.my/Science/People/iman.liao",
    "content": [
        {
            "p": "Associate Professor, Dr. Iman Yi Liao obtained her BSc, MSc, PhD all from School of Computer Science and Engineering, Northwestern Polytechnical University, Xi'an, China, in 1996, 1999, and 2006 respectively. She was a visiting researcher in Chinese University of Hong Kong from July 2001 to Dec 2001, and in CVSSP, University of Surrey, UK from Dec 2003 to Sep 2004, respectively. She was a Post-Doctorate research fellow at the School of Computer Sciences, Universiti Sains Malaysia in 2008 and subsequently a Senior Lecturer from 2009 to 2012. She joined the School of Computer Science, University of Nottingham Malaysia Campus, as an Associate Professor in December 2012. I am interested in innovating and applying Machine Learning techniques to various Computer Vision problems, including 3D reconstruction from single 2D images, 3D point cloud registration and classification, landmark detection of objects in 2D/3D images, semantic segmentation of 2D/3D images, object detection and classification in 2D images. My recent research focuses on industrial applications where data are often collected with small sample size. Theoretical tools I have investigated include but not limited to variational methods, optimization theory and algorithms, regularization methods, relaxation algorithms, fractal analysis, multi-scale analysis (e.g., wavelets), Markov random fields, B-Splines, Differential Geometry, Principal Component Analysis, and some typical Machine Learning techniques as well as Deep Convolutional Neural Networks. The current modules she is teaching include - Mathematics for Computer Scientists - Computer Vision - Machine Learning - Advance Algorithms and Data Structure Other modules she has taught/ was involved in include - Computer Graphics - Database - Software Engineering My current research includes both theoretical and application works. In the theoretical aspect, currently I am focusing on Small Sample Size Problem in High Dimensional Data Modeling, a challenging problem that has recently drawn attention of researchers from various fields such as genomics, Image and Video Analysis, Chemometrics, Economics, and Humanities. As a common problem in the above mentioned areas, where the classic statistical theories have difficulty (as they work based on assumption of large number of examples as compared to data dimensionality), it requires exploring new theories and techniques in statistical and machine learning, which can be hopefully applied to solve related problems in all those aforementioned areas. As for the application of image processing and computer vision, I have worked with medical doctors and forensic experts at Hospital Kuala Lumpur on Post Mortem Computerised Tomography (PMCT) data, to analyse and identify the associated demographics such as gender, age, race, etc, using image processing and machine learning techniques apart from standard methodologies in Forensic Medicine and Sciences. I have also collaborations with Universiti Kebangsaan Malaysia, Monash University Malaysia, and several industrial partners, on various Image Processing and Computer Vision researches/projects. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": [
        "pdf_files/paper6.pdf",
        "pdf_files/Liao_09.pdf",
        "pdf_files/2012.15025.pdf"
    ]
}