{
    "url": "https://www.nottingham.edu.my/Science/People/zhixiang.ng",
    "content": [
        {
            "p": "Associate Professor, Dr Ng Zhi Xiang is currently an Associate Professor in the School of Biosciences, Faculty of Science and Engineering, University of Nottingham Malaysia. He obtained his PhD in Molecular Biochemistry from the University of Malaya and PGCHE from the University of Nottingham. He is a Medical Laboratory Scientist (MAHPC(MLS)01473) registered under the Malaysian Allied Health Professions Council, Ministry of Health Malaysia, a Fellow of UK Advanced Higher Education (UK), a member of Malaysian Scientific Association, Malaysian Society of Biochemistry and Molecular Biology, Society of Chemical Industry, UK and International Society of Global Health (Edinburgh, UK). Currently he is an Editor for Scientific Reports (Nature portfolio) and has involved in the peer review of more than 80 international science indexed journals.The significance of his works has been recognized in a number of research grant capture, scholarly publications, conferences and symposia. Research record: ORCID ID: https://orcid.org/0000-0002-9423-7206 SCOPUS AUTHOR ID: http://www.scopus.com/inward/authorDetails.url?authorID=39262232700&partnerID=MN8TOARS Researcher ID (N-8942-2017): https://www.webofscience.com/wos/author/record/1447317 SCHOLAR ID: https://scholar.google.com/citations?user=7zI2rg0AAAAJ&hl=en Antioxidant, metabolic diseases risk factors and biomarkers, food sciences, molecular nutrition A module convenor for: 1) Food Materials and Ingredients 2) Practical Techniques In Human Nutrition 3) Genetic and Nutrition A module contributor for: 1) Statistical Skills For Bioscientists 2) Professional Skills For Bioscientists 3) Changing Behaviour, Promoting Health 4) Undergraduate research project 5) Professional Training Placement in Nutrition My research interest relates to both human nutrition and health that fall into three broad areas: food sciences, molecular nutrition, metabolic diseases risk factors and biomarkers. Current research… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": [
        "pdf_files/Lack_of_association_between_Gly82Ser%2C_1704GT_and_2184AG_of_RAGE_gene_polymorphisms_and_the_retinopathy_susceptibility_in_Malaysian_diabetic_patients..pdf"
    ]
}