{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/People/yokekin.wan",
    "content": [
        {
            "p": "Assistant Professor, Ir. Dr. Wan Yoke Kin is a Chartered Engineer (CEng MIChemE) and also a Professional Engineer (PEng). She obtained her Bachelor Degree (Chemical Engineering) from Universiti Teknologi Malaysia (UTM), Skudai Johor, in 2007 and her degree of Doctor of Philosophy (Chemical Engineering) from the University of Nottingham Malaysia Campus in 2016. She has a total of 6 years working experience in water and wastewater industry and semiconductor industry. She was a process team leader in Darco-EnviDan Sdn. Bhd. She was responsible for synthesising and designing wastewater treatment plants for various industries. After the 6 years working experience, she went on to continue her PhD in chemical engineering in the University of Nottingham Malaysia Campus in 2013, and she completed her PhD study in 2016. She was also a technical consultant in Darco Water Sdn. Bhd. in 2018. Her expertise is in wastewater treatment design and her research interests are process synthesis, design, integration and optimisation, wastewater treatment & waste recovery, biomass processing and integrated biorefineries, sustainable value chain synthesis, and techno-economic analysis. Ir. Dr. Wan Yoke Kin's expertise is in wastewater treatment design and her research interests are process synthesis, design, integration and optimisation, wastewater treatment & waste recovery, biomass processing and integrated biorefineries, sustainable value chain synthesis, and techno-economic analysis. 1. Introductory Geology (Module Convenor) - Spring 2021 - Present 2. Material and Sustainable Processes (co-teach lecturer) - Spring 2021 - Present 3. Chemical Engineering Group Project 2 (Capstone 2) (Module Leader) - Mar 2017 - Dec 2020 4. Chemical Engineering Group Project 1 (Capstone 1) (Module Leader) - Aug 2016 - Dec 2020 5. Mass Transfer (Module Leader) - Aug 2018 - Dec 2018 & Mar 2020 - Dec 2020 6. Pollution Control (Module Leader) - Mar 2019 - Aug 2019 7. Process Plant Design (Module Leader) - Mar 2017 - Dec 2017 8. Advanced Heat and Momentum Transfer (Module Leader) - Aug 2016 - Dec 2016 Process Synthesis, Design, Integration and Optimisation; Wastewater Treatment & Waste Recovery; Sustainable Value Chain Synthesis; Techno-Economic Analysis; Biomass Processing and Integrated… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}