{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Civeng/People/teckleong.lau",
    "content": [
        {
            "p": "Associate Professor, Dr Lau graduated with 1st Class Honors BEng Degree in Civil Engineering from University of Birmingham (UK) in 2000. He further obtained his Doctor of Philosophy Degree (PhD) in Civil Engineering from the same university in 2004 . He joined the University of Nottingham in June 2006 to start up the Civil Engineering Department in Malaysia. Since then, he has setup & designed various infrastructures & facilities on the campus, such as, mixing labs, mixing & testing equipment, loading frames on strong floor. Dr Lau has been serving the Civil Engineering Industry for over 10 years. Prior to joining the university, Dr Lau worked as an Consulting Engineer in Consultancy Firms in the UK. Dr Lau joined Owen Williams Consultant (UK) as Project Engineer in 2001, since then has been involved in upgrading the Built Environment Projects (A55 Motorway and various Masonry Arches in Wales) and in Bridge Analysis of massive strengthening works for Biston Moss Composite Viaduct in Cheshire UK. He later joined Atkins Consultant (UK) as Project Manager in 2005, since then has been involved in managing various bridge strengthening works, such as, Tame Valley Composite Viaduct (Birmingham) consists of 21 continuous spans, Thelwall Composite Viaduct (Manchester) consists of 30 continuous spans, Lower Booth Composite Steel box girder in London, etc. In addition, Dr Lau also has been involved in various bridge construction/erection projects in other countries, such as, USA (cast in-situ segmental Cable Stay Bridge), Greece (Precast Beam Girders Bridge), Spain & Portugal & Angola (West Africa) for cast in-situ segmental Post-Tensioning Bridges. Dr Lau is a professional engineer registered with the Board of Engineers Malaysia (BEM) and a Fellow of Higher Education Academy (FHEA) UK. Design of Reinforced Concrete, Timber, and Masonry. Design of Steel Structures - Steel-Concrete Composite Structures, Portal Frame, Connections, Hollow Section Trusses. Sustainable building materials - Use of waste materials from Palm Oil production (oil palm kernel shell) in structural concrete for the construction industry to benefit both the environment and the… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/Civil-Engineering-2021-PO.pdf.pdf",
        "pdf_files/Civil-Engineering-2021-PEO.pdf.pdf",
        "pdf_files/Civil-Engineering-2021-PO.pdf.pdf",
        "pdf_files/Civil-Engineering-2021-PEO.pdf.pdf",
        "pdf_files/iJIM_vol14_no06_2020_T.pdf",
        "pdf_files/F10140486S319.pdf"
    ]
}