{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/M3/People/yousif.abakr",
    "content": [
        {
            "p": "Professor, in the past I have taught many Mechanical Engineering subjects including, Engineering Drawing, Statics, Dynamics, Strength of Materials, Theory of Machines, Mechanics of Materials and Numerical… read more Biomass for energy, Pyrolysis and Gasification, Solar thermal, Thermoacoustics. Selected Publications: IY Mohammed, YA Abakr, M Musa, S Yusup, A Singh, FK Kazi. Valorization of Bambara groundnut shell via intermediate pyrolysis: Products distribution and characterization. Journal of Cleaner Production 139, 717-728 (DOI: 10.1016/j.jclepro.2016.08.090) Mohammed, Isah Yakub; Abakr, Yousif Abdalla; Kazi, Feroz Kabir; Yusuf, Suzana; Effects of pretreatments of Napier grass with deionized water, sulfuric acid and sodium hydroxide on pyrolysis oil characteristics. Waste and Biomass Valorization (DOI: 10.1007/s12649-016-9594-1) Isah Yakub Mohammed, Hsion Lim, Feroz Kabir, KaziSuzana Yusup, Hon Loong Lam, Yousif Abdalla Abakr; Co-pyrolysis of Rice Husk with Underutilized Biomass Species: A Sustainable Route for Production of Precursors for Fuels and Valuable Chemicals; Waste and Biomass Valorization, (DOI: 10.1007/s12649-016-9599-9) L Yingjian, YA Abakr, Q Qi, Y Xinkui, Z Jiping; Energy efficiency assessment of fixed asset investment projects-A case study of a Shenzhen combined-cycle power plant, Renewable and Sustainable Energy Reviews 59, 1195-1208 (DOI: 10.1016/j.rser.2016.01.042) B Chen, K Ho, YA Abakr, A Chan; Fluid dynamics and heat transfer investigations of swirling decaying flow in an annular pipe Part 2: Fluid flow, International Journal of Heat and Mass Transfer 97, 1012-1028 (DOI:10.1016/j.ijheatmasstransfer.2016.01.069) KI Morris, A Chan, SA Salleh, MCG Ooi, MY Oozeer, YA Abakr, Numerical study on the urbanisation of Putrajaya and its interaction with the local climate, over a decade, Urban Climate 16, 1-24 (DOI: 10.1016/j.uclim.2016.02.00) B Chen, K Ho, YA Abakr, A Chan, Fluid dynamics and heat transfer investigations of swirling decaying flow in an annular pipe Part 1: Review, problem description, verification and validation, International Journal of Heat and Mass Transfer 97, 1029-1043 (http://dx.doi.org/10.1016/j.ijheatmasstransfer.2015.07.129) Chun Hsion Lim, Isah Yakub Mohammed, Yousif Abdalla Abakr, Feroz Kabir, Novel Input-Output Prediction Approach for Biomass Pyrolysis; Journal of cleaner Production, Volume 136, Part B, 10 November 2016, Pages 51-61 (http://dx.doi.org/10.1016/j.jclepro.2016.04.141) IY Mohammed, FK Kazi, S Yusup, PA Alaba, YM Sani, YA Abakr; Catalytic intermediate pyrolysis of napier grass in a fixed bed reactor with ZSM-5, HZSM-5 and zinc-exchanged zeolite-A as the catalyst. Energies 2016, 9(4), 246; ( doi:10.3390/en9040246 ) PA Alaba, YM Sani, IY Mohammed, YA Abakr, WMAW Daud; Synthesis and application of hierarchical mesoporous HZSM-5 for biodiesel production from shea butter, Journal of the Taiwan Institute of Chemical Engineers 59, 405-412 (http://dx.doi.org/10.1016/j.jtice.2015.09.006) KI Morris, A Chan, MC Ooi, MY Oozeer, YA Abakr, Effect of vegetation and waterbody on the garden city concept: An evaluation study using a newly developed city, Putrajaya, Malaysia, ,Computers, Environment and Urban Systems 58, 39-51 (DOI: 10.1016/j.compenvurbsys.2016.03.005) DWY KHOO, YA Abakr; EFFECT OF DIFFERENT HEAT EXCHANGERS ON THE WASTE-HEAT DRIVEN THERMOACOUSTIC ENGINE, Journal of Engineering Science and Technology 11 (1), 109-120 telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/EL_22_2_02.pdf",
        "pdf_files/Volume%20%288%29%20Issue%20%282%29%20253-263.pdf",
        "pdf_files/Volume%20%288%29%20Issue%20%283%29%20364-%20371.pdf"
    ]
}