{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/nishanth.c",
    "content": [
        {
            "p": "Professor, Dr. Nishanth Chemmangattuvalappil is a Professor of Chemical Engineering in the department of Chemical and Environmental Engineering at University of Nottingham Malaysia. He received his PhD in Chemical Engineering from Auburn University, AL, USA (2010). He worked as a Post-doctoral fellow at University of Pittsburgh, PA, USA and later at Auburn University. His main areas of expertise include product and molecular design, mixture design, machine learning and integrated biorefineries. His current work focuses on the application of molecular design concepts on reactive systems, integration of molecular design techniques into the design of biorefineries and application of machine learing tools in product design. Product and molecular design, mixture design, machine learning and integrated biorefineries. I teach various chemical engineering design modules/subjects for both undergraduate (BEng/MEng) and postgraduate taught courses (MSc). These include the following: Besides, I supervise the following projects: Design of Ionic liquids for CO2 capture Greenhouse gases emission is known as the main factor of climate change, and carbon dioxide (CO2) makes up vast majority of them. Carbon capture and storage (CCS) is a vital technology to mitigate industrial CO2 emissions, which is mainly generated in power plants. Currently, post-combustion capture based on aqueous amine scrubbing is considered as the most suitable technology for CO2 capture, especially in existing plants. However, the use of amine for CO2 capture has some disadvantages, such as high energy required for solvent regeneration, high vapour pressure which lead to subsequent solvent loss, degradation of solvent, and plant corrosion. In my work, ionic liquids (ILs) are considered as possible alternative to amine solvents. Ionic liquids are organic salts which are liquid at and around room temperature. Due to their negligible vapour pressure, high thermal stability, and flexibility to tune the properties by matching cations and anions, ILs are now studied for many applications like refrigerants, mass separating agents and solvents. I work on developing a Computer-Aided Molecular Design (CAMD) approach for selection of optimal ILs specifically for CO2 capture purpose. This approach utilises group contribution methods to estimate the physical and thermodynamic properties of ILs, by considering the structural constraints and allowed combination of cations and anions. The optimal IL obtained using this approach is shown to be able to perform desired absorption of CO2 from combustion flue gas. Novel product development techniques for palm oil-based biorefinery With the awareness of environmental issues throughout the world, the global trend of development is heading towards sustainable development and green processes. Resource conservation is one of the approaches in compliance with the sustainable consumption and production (SCP) in industries. Same efforts have been done in palm oil mill as well. In the mill, various oil palm biomasses which are normally treated as waste are converted into value added products. Integrated biorefinery has the ability to achieve this by providing sustainable and environmentally benign alternatives for the production of bulk and fine chemicals from oil palm biomass. However, at present there is no systematic and efficient method to identify the potential products that can be produced from the conversion of biomass that meet customer requirements. In my work, systematic methodologies to convert oil palm biomass into optimal products through the most efficient conversion pathways will be developed. Integration of chemical reaction pathway synthesis and product design is proposed to achieve this objective. Efficient product design techniques for the design of different chemicals that meet the customer requirements will be developed. To determine the optimal molecules of the product, systematic methodologies will be developed to represent product attributes in terms of properties of the product. In order to identify the optimum synthesis route to produce the chemicals from oil palm biomass, mathematical optimization based technique will be developed to determine the reaction pathways inside an integrated biorefinery. The developed methodologies will be applied in palm oil mill to convert oil palm biomass into the optimal products through the most efficient pathway. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/232.pdf",
        "pdf_files/262.pdf"
    ]
}