{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Eee/People/marwan.nafea",
    "content": [
        {
            "p": "Assistant Professor, Marwan Nafea, PhD, MEng, BEng (Hons), FHEA, GradEng, GradIEM, GradTech, MIET, SMIEEE, MIAENG, MICSES Dr. Marwan Nafea received his BEng (Hons) degree in Electronic Engineering from Sebha University, Brak, Libya, in 2010, and MEng and PhD degrees in Electrical Engineering from Universiti Teknologi Malaysia (UTM), Skudai, Malaysia, in 2013 and 2018, respectively. He served as a Researcher and Software Developer in the Faculty of Biosciences and Medical Engineering, UTM, Skudai, Malaysia from July 2017 to October 2018. He also served as a Researcher in the Faculty of Electrical Engineering, UTM, Skudai, Malaysia from May to December 2018. He is currently an Assistant Professor in the Department of Electrical and Electronic Engineering, Faculty of Science and Engineering, University of Nottingham Malaysia, Selangor, Malaysia. He held different administrative positions related to accreditation, educational quality assurance, workload performance, infrastructure, and others. He was recognized as an Associate Fellow of the Higher Education Academy (AFHEA), UK in June 2020. He was then recognized as an FHEA, UK in December 2021. He is currently a director of the 4D Printing Society. He also served on the editorial board of several journals and as an editor of a book on sensors. He is an invited reviewer for more than 70 journals and various conferences. His research interests are in the areas of 4D printing, MEMS, microfabrication technologies, wireless microfluidic devices, microactuators, modeling & control, optimization, and biosignals. Other links Editorial Memberships Latest Grants and Funds Patents and Copyrights Awards and Recognition News and Media Coverage New Drug Delivery Systems Findings from University of Technology Reported (A wirelessly-controlled piezoelectric microvalve for regulated drug delivery), Pharmacy Choice News, 5 October 2018. Administrative Tasks: Current Modules: Past Modules: 4D printing MEMS Wireless microfluidic devices Piezoelectric actuators Shape memory alloys Soft actuators Silicon wafers machining using µEDM EEG-controlled systems ECG… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}