{
    "url": "https://www.nottingham.edu.my/Science/People/siuyee.new",
    "content": [
        {
            "p": "BSc Pharmaceutical and Health Sciences Programme Director, Associate Professor, Dr New Siu Yee received her BSc from University of Technology Malaysia (UTM) and her PhD from National University of Singapore (NUS). During her PhD study, she was involved in multidisciplinary fields of study with three different research groups and spent a year attachment at University of Illinois at Urbana-Champaign (UIUC). After graduated, Dr New worked as Scientist I in Institute Materials Research and Engineering (IMRE), A*Star, Singapore, before joining the University of Nottingham Malaysia. Her current research interest focuses on nanotechnology based biosensors. Personal research webpage: https://newsy1019.wixsite.com/newgroup MPharm Year 1: MPharm Year 2 - Year Head: MPharm Year 3 Research Project - Module convenor PHS Year 3: PHS Year 2: PHS Year 1: Principal Investigator/ Main Applicant (UNM) 2019 - 2021: Facile and PCR-Free Detection of miRNA Using Magnetic Separation and Fluorescent Silver Nanoclusters (Fundamental Research Grant Scheme (FRGS), Ministry of Education (MOE)) 2018: SERS Analysis on Reverse Aggregation Control of Cysteamine Coated Gold Nanoparticles (Royal Society of Chemistry; Mobility Grant) 2015 - 2017: Novel Colorimetric & Fluorogenic Nanobiosensors for Telomerase Activity Detection (FRGS, MOE) 2014 - 2015: Systematic Preparation of New Fluorogenic Silver Nanoclusters for Sensing Application (UNMC pump-priming project) Collaborator 2021 - 2023: Synthesis of protein gold nanoclusters for delivery of silencing-RNA as synergistic colorectal cancer therapy and in situ bioimaging (FRGS, MOE) 2020 - 2021: Colourimetric Nanosensor for the Detection of Ovarian Cancer Biomarker miRNA-665 (MAKNA Cancer Research Award 2020) 2019 - 2020: Detection of Breast Cancer Biomarker miRNA-155 Using Hybridisation Chain Reaction and Silver Nanoclusters (Taylor's University Emerging Research Grant) 2017 - 2019: Elucidation graphene antimicrobial properties against intracellular Staphyloccoccus aureus from bovine mastitis (FRGS, MOE) 2016 - 2019: Development of Multimode \"Turn-On\" Protein-Gold Nanoclusters for Targeted Theranostics and Imaging of Colon Cancer and Its Metastases (FRGS, MOE) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}