{
    "url": "https://www.nottingham.edu.my/Science/People/eesoo.lee",
    "content": [
        {
            "p": "Assistant Professor, Ee-Soo Lee completed her Bachelor of Science (Hons) degree with a major in Biochemistry at the University of Malaya, Malaysia. During her undergraduate studies, she developed a diagnostic kit for detecting biomarkers in the serum of cancer patients. At the same university, she obtained a Master of Medical Science degree in Molecular Genetics through her research on the alteration of the p16 tumor suppressor gene in lymphoma. She pursued her PhD studies in Vascular Biology, focusing on biomechanical regulation of endothelial phenotype at the University of Groningen, the Netherlands. She joined the National University of Singapore as a Research Fellow and completed her postdoctoral training in Adipose Tissue Biology. She investigated the role of activin receptors, ALK4 and ALK7 in the regulation of fat metabolism and obesity. Thereafter, she was appointed as a Senior Research Fellow at Nanyang Technological University Singapore, where she examined the mechanism of ACKR1 in endothelial injury among COVID-19 survivors. In 2023, the American Heart Association recognized her work on ACKR1 with the Paul Dudley White International Scholar Award. She obtained a Higher Education Teaching Certificate from the Derek Bok Center for Teaching and Learning, Harvard University, United States. Since 2024, she has been a lecturer in biology and physiology, and an Assistant Professor at the School of Pharmacy, University of Nottingham Malaysia. Ee-Soo Lee's teaching philosophy is rooted in the belief that education is a transformative and lifelong experience that empowers individuals to grow intellectually, professionally and personally who… read more Ee-Soo Lee's research aims to elucidate and intervene in the mechanisms through which adipocytes and endothelial cells contribute to age-related vascular disorders. Currently, her studies focus on… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}