{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/M3/People/jeehou.ho",
    "content": [
        {
            "p": "Associate Professor, Jee-Hou Ho received his B.Eng (Hons) and M.Eng degree in mechanical and production engineering from Nanyang Technological University (NTU), Singapore and PhD degree from The University of Nottingham Malaysia Campus. He was a researcher at the Robotics Research Center in NTU, primarily involved in simulation platform development for underwater robotics vehicles and ground mobile robots. He is an Associate Professor at the University of Nottingham Malaysia in the Department of Mechanical, Materials and Manufacturing Engineering. He is currently the Director of Research for the department, leading the management of research activities within the department. Dr Ho is a Chartered Engineer of the Engineering Council UK. He is also a member of the Institution of Mechanical Engineers (IMechE), a member of Institute of Electrical and Electronics Engineers (IEEE), as well as a graduate engineer registered with the Board of Engineers Malaysia (BEM). Dr Ho works on various research projects in the areas of energy harvesting, robotics, sensors, biomedical signal processing for health condition monitoring, vibration signals analysis, failure and defect detections. To date, he has published over 90 papers in peer-reviewed journals, conferences and book chapters. He also co-authored a book titled \"Applied Engineering Failure Analysis: Theory and Practice\". He has led and collaborated a number of research projects funded by government organisation and industries, with total grant value over RM 1 million. My research interests are in the area of sensor signal processing and smart condition monitoring systems with applications in various fields such as biomedical signal (ECG/EMG/EEG) processing for health monitoring, vibrations monitoring, material defect and failure detection, as well as mechatronic and robotic systems. Statics and Dynamics; Advanced Dynamics and Vibration; Robotics and Automation Technology; Group Design Project; MSc/MEng/BEng Individual Project. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}