{
    "url": "https://www.nottingham.edu.my/Science/People/tissa.chandesa",
    "content": [
        {
            "p": "Assistant Professor, Dr Tissa Chandesa holds a BSc (Hons) and Ph.D. in Computer Science from the University of Nottingham. He is a Senior Fellow of the Higher Education Academy, UK, the first at University of Nottingham Malaysia to be bestowed such recognition, a Malaysian Human Resources Development Fund (HRDF) Certified Trainer as well as a Lord Dearing Award recipient. Upon completing his doctorate, Dr Chandesa spent 9 plus years (2012-2021) with the Graduate School, University of Nottingham Malaysia where he held the roles of Research Training Convenor, Research Training Development Manager, and Interim Dean of the Graduate School. During his time with the Graduate School, Dr Chandesa was responsible to provide co-ordination, support, supervision, management and/or mentoring to professional service members of staff, junior as well as senior academics and postgraduates in relation to research and teaching development. Dr Chandesa's true passion is in the field of Computer Science. This was the motivation behind his decision to pursue an academic career with the School of Computer Science at the University of Nottingham Malaysia, where he currently is Professor (Assistant) as well as Director of Marketing and Students Experience. Dr Chandesa research aims toward Computer Vision, Image Processing, Deep & Machine Learning, Generative Artificial Intelligence (GAI) and the use of Educational Technologies as well as GAI to augment the teaching and learning experience in Higher Education. Module convenor for the following modules: Previously, was module convenor for the Artificial Intelligence Methods module. Supervise Final Year (FYP), MSc as well as MPhil and PhD Projects. Developing novel and efficient Computer Vision and Image Processing techniques and applications to support/solve interdisciplinary as well as multidisciplinary research problems in active research… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": [
        "pdf_files/2012.15025.pdf"
    ]
}