{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Eee/People/freddy.tan",
    "content": [
        {
            "p": "Associate Professor, Ir. Dr. Freddy Tan Kheng Suan received his B.Eng degree in Electrical Engineering from the Multimedia University in 2010, and his PhD degree in Power Electronics from University of Malaya in 2015. He then served as a postdoctoral researcher in UMPEDAC, University of Malaya in 2015 and as a Senior Lecturer in Asia Pacific University of Technology & Innovation in 2016. He is currently an Associate Professor at Department of Electrical and Electronic Engineering, University of Nottingham Malaysia. Dr. Freddy is a Professional Engineer (Electrical) registered with the Board of Engineers Malaysia, a Member of the Institute of Engineers Malaysia and a certified Microsoft Innovative Educator Expert. Dr. Freddy is the recipient for Merdeka Awards for International Attachment 2021 and ASEAN-ROK Exchange Fellowship 2016. He was also awarded with FRGS grant in 2018, and APU internal grant in 2019 and 2021. He is the national advisory committee and the organising chair for several international conferences. He was the guest researcher with Aalborg University and Ajou University. Dr Freddy's research interests are photovoltaic converters, electric vehicle chargers and wide bandgap devices. He has served as consultant for photovoltaic converters and electric mobility projects from MIMOS, Malaysian Green Technology and Climate Change Corporation (MGTC) and The Chartered Institute of Logistics and Transport (CILT). Dr Freddy's research mainly focuses on analysis, modeling and design of grid-connected photovoltaic converters: His recently research interests include electric vehicle on-board chargers and wide-bandgap technology: Applied Electrical and Electronic Engineering Construction Project Applied Mechatronic Engineering Construction Project Electronic Processing And Communications (analogue and digital filters) Professional Studies Modelling: Methods and Tools Contemporary Engineering Themes telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}