{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/People/lai-yee.lee",
    "content": [
        {
            "p": "Associate Professor, Dr. Lee Lai Yee obtained her Bachelor degree and PhD degree in Chemical Engineering from the University of Bath, United Kingdom. Her PhD research work involved the removal of volatile organic compounds (VOCs) by low pressure drop silicalite monoliths. Dr Lee is a chartered member of the Institute of Chemical Engineers (IChemE) and fellow of the Higher Education Academy, UK (FHEA). She is also a member of the Institution of Engineers Malaysia and Board of Engineers Malaysia. She has established research in the field of nanotechnology, water and wastewater treatment and thermochemical conversion of biomass waste into value-added products at the University of Nottingham Malaysia. Dr Lee's research interests centre on nanotechnology and advanced adsorptive separation, specifically, she has expertise on the development and testing of novel carbon nanomaterials, agricultural- and biowaste-based composites for environmental pollution control and product recovery. Her research focuses on configuring the composites into practical engineering structures such as low pressure drop monolith and 3D macro-engineering structures for adsorptive removal and recovery of pharmaceuticals, heavy metals, dyes and VOCs. Her research also involves the application of carbon nanomaterials in bioenergy and bioplastic development. Dr Lee's research covers a range of important applications, such as wastewater treatment, recycling of biowastes into value-added products and recovery of valuable industrial commodities.She has expertise in the synthesis of various graphene, carbon nanotube and nanocrystalline cellulose composites, as well as biochar, biosorbent and activated carbon for pollution control and product recovery from industrial effluent. Her research also covers the synthesis of bio-fuel and biodegradable plastic from agricultural waste. Dr. Lee Lai Yee is currently teaching Nanotechnology, Separation Processes 1, Engineering Thermodynamics and Process Engineering Fundamentals. She has taught Wastewater Treatment, Fluid Mechanics,… read more Water and wastewater treatment Nanotechnology, encompassing carbon nanomaterials development for environmental pollution control Air pollution control, focussing on volatile organic compounds… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/232.pdf"
    ]
}