{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/chen.poling",
    "content": [
        {
            "p": "Assistant Professor, Director of Research and Knowledge Exchange, Internship Coordinator, I am trained in Cognitive Neuroscience and Neuropsychology with research focuses on cognition in ageing brains. I graduated with a BSc (Hons) in Cognitive Science from University Malaysia Sarawak, MSc in Cognitive Neuroscience from University of York, UK, MSc in Foundation in Clinical Neuropsychology in Bangor University, UK, and PhD in Psychology from University of Otago, and Brain Research New Zealand. During my PhD training, I was based in the Neuropsychology laboratory under the supervision of Dr. Liana Machado. My research involved neuromodulation technique, using transcranial direct current stimulation (tCDS) and examining its effect on saccadic eye movement performance in young and older adults. Before joining University of Nottingham Malaysia as an Assistant Professor in December 2021, I worked as a senior lecturer in International Medical University, Malaysia where I also successfully secured a Fundamental Research Grant Scheme to study the validation of using saccadic eye movement paradigm to detect mental fatigue. My area of research focuses on ageing and cognition (e.g., ways to promote cognitive health of the elderly, interventions that could serve as potential strategy to slow down or combat age-related cognitive declines, etc.). My research work so far have looked into potential ways with tDCS to ameliorate saccadic eye movement (through antisaccade paradigm) deficits in older adults. I am also working on using tDCS in managing psychotic behavioural and psychological symptoms of dementia. In another project, my research team and I are researching on transferring antisaccade paradigm to mobile phone application in which we could ultimately monitor the progress of dementia through their saccadic eye movement performance. Currently I am particularly interested to research the role of cognitive reserve in ageing and how it plays a role in healthy and pathological ageing. In my previous work place, I have also supervised students with research on physical activities (PA) and its association with cognition/mental health. For example, whether people who are physically active will be more resilient to stress, leading to better mental health, or better in coping with stress in general. We also looked into the stages of behavioural change and motivation associated with PA engagement. Current teaching in UNM: Introduction to Psychology Practical Methods Neuropsychology Focusing on the area of Brain and Cognition, specifically interested in the ageing brain and its associated neuropsychological conditions Developing methods to help with early detection of… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}