{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/tomas.maul",
    "content": [
        {
            "p": "Professor, Tomás Maul received a BSc (Hons.) degree in Psychology from the University of St. Andrews, St. Andrews, UK, two MSc degrees in Computer Science from Imperial College, London, UK, and a PhD degree in Computer Science (Computational Neuroscience) from the University of Malaya, Kuala Lumpur, Malaysia. For two years, he was a Senior Researcher with MIMOS Berhad, where he worked in the fields of pattern recognition and computer vision. He is currently Associate Professor at the School of Computer Science, University of Nottingham Malaysia, where he lectures and conducts research mainly in the area of neural computation. Autonomous Robotic Systems Languages and Computation Compilers Overview My main research interests revolve around Neural Computation. I'm particularly interested in Computational Neuroscience and how different biological neural systems solve different types of computational problems. In terms of problem domains, I have mostly been involved in the research of visual functions (e.g. pattern recognition, pose estimation, illumination normalization, and others) and therefore Computer Vision and Image Processing are central to my investigations. My two main goals are thus to reverse engineer biological neural systems and to re-engineer (e.g. optimize) the extracted solutions. This re-engineering effort addresses a variety of applied computational problems and contributes to the School's focus on Intelligent Decision Support. Other relevant areas of interest which fall within this theme are: Optimization, Machine Learning, Natural Computation and Artificial Intelligence Current/Recent Grants I was the principal investigator in a project funded by the Microsoft AI for Earth program, totaling 15,000 USD, in the topic of deep learning for biodiversity monitoring. This grant spanned the period from August 2021 to August 2022. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}