{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/zhiyuan.chen",
    "content": [
        {
            "p": "Head of School of Computer Science/Associate Professor, Dr. Chen ZhiYuan currently is an Associate Professor with the University of Nottingham, School of Computer Science in Malaysia. She is a Senior Fellow of the Higher Education Academy, UK since July 2022 and is a British Computer Society (BCS) Professional member. Dr Chen worked as Principal Consultant for many government agencies, research organizations and industries, such as with MIMOS at the Accelerative Technology Lab, TM R&D, Crops for the Future and Tentacle technologies. She received the MPhil and a PhD in Computer Science from the University of Nottingham in 2007 and 2011 respectively. Before joining UNM, she has been a research associate in the UK Horizon Digital Economy Research Institute. Her research interests are in the area of computer science, machine learning, data mining, user modelling and artificial intelligence. She has published many research papers in the above research area and served as keynote Speaker and Session Chair for many international conferences in computer science and engineering. Dr. Chen ZhiYuan has expertise in machine learning, data mining, user modelling, simulation and artificial intelligence. She has a particular interest in kernel methods, especially using support vector machines to solve real world problems, such as in anti-money laundering and medical diagnosis. Her research focuses on basic and applied problems in machine learning, understanding how machine learning can help with automated learning, reasoning and decision-making for diverse applications ranging from the knowledge management, economic modelling, agricultural maturity analysis, to pipeline flaw detection, Modules G54SIM - Simulation for Computer Scientists G52HCI - Human Computer Interaction G52GRP - Software Engineering Group Project G52GUI - Graphical User Interfaces G53ELC - Enterprise Level Computing G53MLE - Machine Learning G54IHC - Introduction to Human-Computer Interaction G54MET - Methods for Understanding Users in Computer Science Her major research interest is in how artificial intelligence techniques can facilitate the knowledge discovery and decision making process that is complete and efficient retrieval of relevant… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/vol.11.4.8.pdf",
        "pdf_files/APCAR_BRR793_ICT.pdf",
        "pdf_files/ffa4563d5fea03edbdcfd816b3371f59de0a.pdf",
        "pdf_files/WCE2008_pp76-79.pdf"
    ]
}