{
    "url": "https://www.nottingham.edu.my/Science/People/sahithya.rameshgowda",
    "content": [
        {
            "p": "Assistant Professor, Disability Liaison Officer, Chair of Extenuating Circumstances Committee., Dr. Sahithya BR is a clinical psychologist, registered with the Rehabilitation Council of India, with over a decade of clinical and research experience. Her work is driven by a passion for research, teaching, and clinical practice. She earned her MSc in Psychology in 2011, opting for Clinical and Counseling Psychology as her subjects in the second year, followed by two years of rigorous clinical training through the MPhil Clinical Psychology program at Manipal Academy of Higher Education, Manipal, which enabled her to obtain a clinical psychologist license in India. Subsequently she worked in Cadabams Deaddiction Center and in National Institue of Mental health and Neurosciences, Bangalore as Clinical Psychologist. In 2015, she enrolled for PhD in Allied Health Sciences (Clinical Psychology) at Rajiv Gandhi University of Health Sciences, India, focusing on parental personality, parenting styles, and child temperament in children with anxiety disorders. During her PhD, she worked with children at Child Guidance Clinic of St John's Medical College Hospital, Bangalore, providing assessments and various interventions for children with ADHD, Autism, Learning Disabilities, Intellectual Disabilities, Anxiety, Depression, OCD and other behavioral and clinical disorders. She was awarded PhD in 2021. Dr. Sahithya is well-versed in psychological assessments, diagnostic interviews and formulations, and evidence-based psychotherapy techniques. She is also a skilled researcher interested in child, adolescent and young adult mental health. Throughout her career, she has worked in both private and public mental health sectors, in both inpatient and outpatient settings focusing on diagnostic assessment, psychotherapy and rehabilitation for vulnerable children, adolescents, and adults presenting with various difficulties. Her professional journey includes roles as a clinician, academician, and researcher at esteemed institutions in India, such as the National Institute of Mental Health & Neurosciences, Dharwad Institute of Mental Health & Neurosciences, and Manipal Academy of Higher Education, where she was actively involved in clinical training and supervision of MPhil Clinical Psychology trainees. She has also been actively involved in community mental health initiatives and has led programs aimed at promoting a positive approach to mental health issues and mitigating stigma. she has also conducted workshops aimed at enhancing both academic knowledge and practical skills across various domains of psychology and education. Since February 2024, she has been a part of the School of Psychology, University of Nottingham Malaysia, where she remains dedicated to contribute to mental health through teaching modules related to mental health, and designing research projects that advance knowledge and awareness of mental health issues. Other Interests: Community Mental Health Dr. Sahithya is deeply interested in community mental health. By being actively involved in community programs, she aims to raise awareness, educate the public, and help identify mental health issues early, helping to prevent their escalation. She is committed to developing and implementing initiatives that address both individual and systemic factors, fostering resilience, and improving mental health in vulnerable communities. These efforts not only promote mental well-being but also contribute to reducing the stigma surrounding mental health, fostering a more open and supportive environment for addressing these issues. Professional Membership: Professional life member of the Clinical Psychology Society of India. Professional Life member of the Indian Association of Clinical Psychologists. Dr. Sahithya BR is a clinician, academician and a researcher whose interests are diverse and focus on a broad range of issues related to mental health and psychopathology in children, adolescents, and young adults, with an emphasis on socio-cultural influences, risk and protective factors, assessment, and psychotherapy. In her teaching, Dr. Sahithya strives to inspire and educate youth by fostering critical thinking, curiosity, and a deep understanding of mental health and clinical psychology. She prioritizes… read more Dr. Sahithya BR's research focuses on exploring the risk and protective factors that influence mental health, aiming to mitigate risks, enhance resilience, and address disparities in access to care.… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": []
}