{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/M3/People/chinseong.lim",
    "content": [
        {
            "p": "Associate Professor, Head of Department (UNM) Electrical and Electronic Engineering, Dr. Lim obtained his PhD degree in Mechanical Engineering from National University of Singapore (NU S), major in the area of micro/nano technology and development of semiconductor processes. He completed his Bachelor degree study in the field of Mechanical Engineering from Universiti Teknologi Malaysia Skudai, Johor Malaysia. Prior to joining University of Nottingham Malaysia (UNM), Dr. Lim has more than 8 years of working experience in R&D environment as well as high volume manufacturing industry. He was a Research Scientist in Data Storage Institute (DSI), an Agency of Science, Technology and Research (ASTAR) affliated research institute in Singapore, primarily working on numerous research projects such as the fabrication of nanostructures for optical nanoscopy and nanoimaging application. Dr. Lim also worked in hard disk drive industry (Seagate Industry) as manufacturing engineer, in semiconductor industry (Chartered Semiconductor) as senior engineer in technology development as well as in R&D (NUS) as research engineer. Throughout these years of work experiences, he had been exposed to various high end technologies in micro and nanoengineering. He has been involved in some of the process improvement projects in Seagate whereby through the execution of six sigma approach the yield had been significantly improved and 2 projects were awarded the best team awards. Currently Dr. Lim is the Associate Professor in the University of Nottingham Malaysia Campus (UNMC) at the Department of Mechanical, Materials and Manufacturing Engineering. He is the module convenor for Design and Manufacture 1, and Group Design and Make modules. His research interests include laser-based micro/nano fabrication technology, laser materials processing, development of semiconductor processing technologies, advanced manufacturing techniques, advanced materials synthesis and photonics-related research. Dr. Lim is the Malaysia campus director of the Institute of Aerospace Technology, University of Nottingham and leading the Smart Manufacturing and Intelligent Systems research group in UNM. Dr. Lim also served as the committee member in the Mechanical Engineering Technical Division (METD) in The Institution of Engineers Malaysia (IEM) for numerous years in which the division has won the prestige Annual IEM Presidential Award. - Laser Materials Proceesing - Advanced Manufacturing - Conventional and Non-conventional Machining eg. CNC maching, Electro-discharged Machining - Additive Manufacturing - Intelligent Systems in manufacturing and transportation. - Condition Monitoring and Optimization - Lithography - Optical & E-beam - Etching - reactive ion etching, isotropic chemical etching, ion milling - Thin Film Depositions - Optical Engineering and Photonics - Optical and Atomic Force Microscopy - Spectroscopy - Terahertz technology - Metamaterials and Plasmonics - Finite Difference Time Domain (FDTD) modeling and simulation - Six Sigma in Manufacturing Industry for process improvement & yield reduction Dr. Lim's teaching interests are in the area of design and manufacturing whereby he lectures in Year 1 Engineering Drawing and Manufacturing Technologies. He also conduct design office sessions on… read more Dr. Lim's main research interests are in the area of laser-based micro/nano fabrication technology and advanced manufacturing techniques. He had actively been working on the development surface… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}