{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/People/chienhwa.chong",
    "content": [
        {
            "p": "Associate Professor, Associate Professor Ir. Ts. Dr. Chien Hwa CHONG is Associate Professor at Department of Chemical and Environmental Engineering, Faculty of Science and Engineering, University of Nottingham. He also appointed as Guest Professor of National Engineering University, Batangas State University, College of Engineering, Architecture and Fine Arts, Alangilan, Phillipines in 2021. He also received 2 years secondment as Associate Director (Engineering Technician), Engineering Technology Accreditation Council (ETAC) of Engineering Accreditation Department, Board of Engineers Malaysia and Council member of Institution of Engineers Malaysia (IEM) from 2021- 2024.Dr. Chong also served as Director of CQI and Accreditation, Department of Chemical and Environmental Engineering at University of Nottingham Malaysia. Formally, he was the Associate Director of Learning and Teaching (ADLT) at Engineering and Physical Sciences, Heriot-Watt University Malaysia Campus in 2019. Prior to this, he was the Programme Director of Studies (PDoS) of Chemical Engineering Programme, Heriot-Watt University Malaysia campus from 2017 to 2019, Associate Dean (Learning and Quality), Taylors University from 2013 to 2017, Programme Director (Chemical Engineering), Taylor's University from 2011 to 2013. He currently is a Professional Engineer registered with the Board of Engineer, Professional Technologist (Chemical), International Professional Engineer (Int PE (MY)), APEC Engineer, ASEAN Engineer, Chartered Chemical Engineer, IChemE (UK) and Chartered Engineer of the Engineering Council, UK. Dr. Chong obtained the fellow of the Higher Education Academy UK in 2020. He was the former Chairman of Chemical Engineering Technical Division 2019-2021 and currently served as an advisor for Chemical Engineering Technical Division 2021-2023. He is also a TRIZ level 2 practitioner. Since he started his career in 2010, he has received academic awards including Vice Chancellor's Top Cited Academician Award in 2015 at Taylor's University, Presidential Awards of Excellence, Institution of Engineer Malaysia (IEM) from 2013 to 2016. He has published 43 indexed journal papers and book chapters. His publications have been cited over 871 times over the past 5 years (Google Scholar). His current h-index is 17 in Google Scholar and 15 in SCOPUS. He is also the Primary Project leader for 4 projects and Co-Investigator for 3 projects from International, National, and Industry Projects, with total amount more than MYR 500 thousand. He was the Guest Editor for Foods (IF: 4.350) in Special issue: Drying Technologies in Food Preservation and Guest Editor for Journal of Engineering Science and Technology (Emerging Source Citation Indexed). The main achievement in 2022 as Director of Accreditation and CQI was leading the University of Nottingham Malaysia Campus, Department of Chemical and Environmental Engineering for Tri-Campus accreditation visits from IChemE, UK and IOM3, UK My teaching approach is student-centered and I adopted case based learning to achieve this objective. My teaching pedagogy was developed from learning from training by education experts, peers,… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}