{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Eee/People/michelle.tan",
    "content": [
        {
            "p": "Associate Professor, Dr. Michelle Tan (MIET) joined the Department of Electrical and Electronic Engineering in year 2010. She completed her BEng (Hons.) in Electrical and Electronic Engineering (2005) at the Swansea University, Wales, UK, where, she also completed her PhD (2009) on using one dimensional ZnO nanowires for biosensing applications.Her present research focuses on nanoscience and nanotechnology advancement, with the vision to give contribution to the global health challenge by developing low cost and effective diagnostic tools for the early detection of various diseases. The research includes the development of simple, green and low cost method to synthesise graphene and graphene composite nanomaterials. This is one of the key areas of her research since the prospective use of any nanomaterials commercially is dependent on its potential to scale up for mass production in an environmentally friendly manner. Additionally, major part of her research also focuses on the development of ultrasensitive bio-sensing platform for the early detection of various diseases. This involves the development of simple but effective surface functionalisation of graphene and graphene/metal oxide method to ensure high selectivity of the bio-sensing platform. Current and past research effort includes the detection of glucose, influenza viruses and single stranded RNA virus with high sensitivity and selectivity. Other present research involves the development of high performance supercapacitor, with emphasis on the improvement of its electrode's efficiency through the use of graphene and graphene/metal oxide nanomaterial. In addition, current work also explores the development of low cost and portable potentiostat electronic read-out device as part of the effort towards the development of low cost diagnostic tools. Graphene and Graphene/metal oxide composite: synthesis, characterisation and applications in biosensing and energy storage device (supercapacitor) Present Power and Energy Engineering Mathematics Past Electronic Processing And Communications (analogue and digital filters) Introduction to Circuits and Fields Signal Processing and Control Engineering Electronic Design Project for E&E Engineers (H62EDP) Current Research and Research Interests: telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}