{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/M3/People/hoonkiat.ng",
    "content": [
        {
            "p": "Professor of Mechanical Engineering; Head of Department (UNM) Mechanical, Materials and Manufacturing Engineering, Hoon Kiat Ng is Professor of Mechanical Engineering in the Department of Mechanical, Materials and Manufacturing Engineering, University of Nottingham Malaysia Campus. He served as the head of the Energy, Fuel and Power Technology research division, academic champion of the aerospace priority area and the founding deputy director of the Asia Aerospace City Research and Technology Centre . He is currently the head of the department and the campus academic champion for the energy research priority area. Prof. Ng works in a wide range of interdisciplinary experimental and computational projects, including chemical kinetics modelling of diesel/biodiesel combustion, biofuels production and combustion, engine testing, parallel processing and neural network analysis of engine performance/emissions, as well soil remediation using extraction and advanced oxidation processes (AOP). He has well over 140 publications to date in internationally refereed journals, technical papers, congress/conference proceedings, book chapters and books. He also serves on the editorial board of international journals, and have been appointed to various advisory panels and expert committees. He has led a number of projects which are funded from a variety of sources including government organisations, industry and university. Additionally, he has also established long-term collaborations with both industrial and academic partners from a number of countries in Europe and Asia. Prof. Ng was the winner of the inaugural 2012 Chancellor's Award. I work on an array of energy and fuel research, especially in sustainable energy technologies for ground transportation. This includes biofuel production in the upstream sector to combustion/emissions characterisation for actual combustion systems to downstream sector of pollutant treatments/mitigation strategies. Currently, the research team I assembled here works on various topics under these themes with both experimental and computational elements. The group has a strong track record of research income, publication and collaboration. Expertise in experimental research includes performance/emissions mappings of biofuel in various combustion systems, evaluation of biodiesel properties on materials compatibility/engine durability, effects of additives on the efficiency of combustion systems, in-cylinder soot transport/morphology and novel biofuel production techniques from various feedstock. I am also involved in experimental projects to determine the effects of polycyclic aromatic hydrocarbons (PAH) emissions to the environment and the corresponding remediation strategies, especially on contaminated soils. In terms of computational research, the opportunities to improve in-cylinder modelling for diesel-biodiesel combustion have been the main research theme. I am engaged in fundamental chemical kinetics modelling of diesel-biodiesel combustion, computational fluids dynamics (CFD) simulation of in-cylinder engine conditions and parallel processing/neural network analysis of engine performance/emissions to shorten the development cycle of combustion systems. The computational work here forms part of a larger research framework, with parallel experimental programmes supported by industrial and academic partners. Internal Combustion Engines; Thermodynamics and Fluid Mechanics 1; Introduction to Automotive Technology; Group Design Project; MEng/BEng Individual Project Internal combustion engines; computational fluid dynamics and numerical modelling; thermo-fluid dynamics; remediation of contaminated soils; combustion and emissions control; alternative fuels; solid… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/ARFMTSV56_N1_P88_99.pdf",
        "pdf_files/ARFMTSV56_N1_P147_156.pdf",
        "pdf_files/CFDLV11_N12_P1_12.pdf",
        "pdf_files/8_433_Lau_13.pdf",
        "pdf_files/13_3_6.pdf",
        "pdf_files/12%20-%20IFRJ171075.R2%20EDITED.pdf"
    ]
}