{
    "url": "https://www.nottingham.ac.uk/science/student-content-creators.aspx",
    "content": [
        {
            "p": "Create inspiring content about your course to help future students decide if the University of Nottingham is the right place for them. Our students are the experts on what it's like to study a science course at the University of Nottingham, so we want to hear your voices! Use your creative skills to show future students what it's like to study your course and the skills you have gained from it. The university marketing team is looking for students who can create content such as vlogs, videos, written articles and more. If you have one or more of these skills, we would love to hear from you! A week in the life of a psychology student Physics student Jonah chats to Professor Alfonso Aragon-Salamanca If you are successful, you will need to register with Unitemps (the service we use to pay students). Please note, you will need to do some right to work checks as part of this process, so if you are an international student please check if you are eligible to work in the UK before applying. Each time we need a new piece of content we will share a brief with you, including the topic we want to cover and the deadlines. You then let us know if you want to take on the job and what type of content you want to make. You then send the content back to us by the deadline and we’ll let you know if any edits need to be made. Once it’s ready, your content will be used on our website and in emails to future students. You will be paid for each piece of work you create, after it has been completed. If you like the sound of this role, please fill in the application form. Application form As part of your application we would like to see examples of content you’ve previously created. If you haven’t got any previous examples you can share, please make a short sample piece of content in the format of your choice (such as a short 30-60 second video or a 150-200 word blog post) introducing who you are, what you study, and your 3 favourite things about your course."
        }
    ],
    "pdf_files": []
}