{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/M3/People/kokweng.ng",
    "content": [
        {
            "p": "Assistant Professor, Dr. Ng currently works at The University of Nottingham Malaysia Campus. He obtained his PhD in Engineering Design from Cardiff University, UK, M.Sc in Manufacturing Systems Engineering from University of Warwick, UK and B.Engineering (Hons.) in Mechanical/Systems Engineering from Putra University, Malaysia. He is also a certified TRIZ Level 3 User and TRIZ Level 2 Instructor and has been involved in industrial research projects related to CAD, product design, machine and system design, manufacturing automation and artificial intelligence for many years. He recently obtained his Postgraduate Certificate in Higher Education (PGCHE) from UNM and he is also a Fellow of Higher Education Academy (UK). Prior to joining UNM, Dr Ng has worked for many years in Sirim Berhad as a senior engineer. He has also worked briefly in Sony TV Malaysia as a mechanical engineer before he joined Sirim Berhad. He was a scholarship recipient of Sony TV during his undergraduate study and was a pre-service scholar of Sirim Berhad. Dr. Ng has co-authored articles that won awards such as Intelligent Human-centred Extended Reality & System Integration (INTERAKSI) 2023 Seminar Best Paper Award by Institute of Visual Informatics (IVI) at the National University Malaysia (UKM), Young Writers Merit Award (5th INTERNATIONAL VISUAL INFORMATICS CONFERENCE 2017 (IVIC17)), Best Paper Award (4th International Conference on Electrical Engineering and Informatics 2013 (ICEEI 2013)), and the Best Manuscript award (Annual Conference on Engineering and Information Technology (ACEAIT 2014)). He was invited as the Head/Member of the Evaluation Panel for the Ministry of Science, Technology and Innovation (MOSTI) in the technical working committee for research grants such as Technofund, Sciencefund and Innofund in 2014 and 2015 and was a member of the technical evaluation task committee for MOSTI on automated rubber tapping in 2017. He was also a member of the technical working group (additive manufacturing sub-group) for Focus Group Electrical & Electronics/Information and Communications Technology for 11th Malaysian Plan Manufacturing Initiatives 2014. He was the Head as well as a member of the Evaluation Panel for Ministry of Science, Technology and Innovation (MOSTI) 2014 for Industry Cluster for several Techno Fund, Science Fund and Inno Fund applications as well as a member in the Technical Evaluation Task Force Committee for Ministry of Science, Technology and Innovation (MOSTI) on Automated Rubber Tapping System 2017. He was a member in the Industry 4.0 Technical Working Committee for Centre of Excellence for Smart Manufacturing led by Sirim Berhad for Ministry of Science, Technology and Innovation (MOSTI) and Ministry of International Trade and Industry (MITI) in 2017 as well as a member of the Technical Working Group (Additive Manufacturing sub-group) for Focus Group Electrical & Electronics//Information and Communications technology (E&E/ICT) for 11th Malaysian Plan (RMK 11) Manufacturing Initiatives 2014 for Ministry of International Trade and Industry (MITI). He was also a member of a team that participated in many TRIZ design competitions and won 1st Runner Up for the International MyTRIZ Competition 2018 and 2015, 2nd Runner Up for International MyTRIZ Competition 2016 and Merit Prize for International MyTRIZ Competition 2013. Engineering Design, CAD, CAE, Additive Manufacturing, TRIZ. Teaching Module: 1. Additive Manufacturing and 3D printing 2. Computer-Aided Engineering 3. Advanced Engineering Design (CAE) 4. Engineering Design and Project (CAE) Co-Tutoring Module: 1. Engineering Design and Projects 2. Design, Manufacture and Projects (2019) 1. A framework for sustainable energy-efficient product innovation based on TRIZ (2022-2024) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/G5701059720.pdf",
        "pdf_files/6-11.pdf"
    ]
}