{
    "url": "https://www.nottingham.edu.my/Science-Engineering/Departments/Chemenv/News.aspx",
    "content": [
        {
            "p": "I am deeply honoured to receive the Lord Dearing Award for teaching excellence. This recognition is a testament to the hard work and dedication invested in creating an enriching learning environment. I am grateful to my colleagues, students, and the entire academic community for their unwavering support. This award inspires me to continue striving for excellence in education and to make a lasting impact on our students' lives. Thank you for this prestigious honour. I feel honoured to receive this prestigious Lord Dearing award for excellence in teaching and learning. This recognition is a significant achievement in my teaching career, and serves as a testimony of my passion and dedication in education. Thank you to all those who believed in me and considered me worthy of this award. This motivates me further to excel and contribute more towards the academic community. Biochemistry Best Scientist – Prof. Ir. Ts. Dr. Pau Loke Show Prof. Ir. Ts. Dr. Pau Loke Show has been recognized as the Best Scientist of Biochemistry within the University of Nottingham Malaysia and in the entire Malaysia! By ranking 7th in Asia and 108th in the global, Prof. Ir. Ts. Dr. Pau Loke Show also left an indelible mark on the world scientific community with his pioneering research. These achievements are based on i10 and H-index, which was referenced from AD Scientific Index 2023 as of 1st of August 2023. Some of Prof. Ir. Ts. Dr. Pau Loke Show most well-liked research articles are included below. He has made significant contributions to many different fields of research. These discoveries have not only expanded biochemistry's horizons but also received a lot of praise and acknowledgment. To learn more about Prof. Ir. Ts. Dr. Pau Loke Show remarkable achievements and explore his most popular research projects, click the link provided below. Prof. Ir. Ts. Dr. Pau Loke Show's MOST POPULAR ARTICLES #1 Microalgae biorefinery: High value products perspectives #2 Microalgae: A potential alternative to health supplementation for humans #3 A review on conventional and novel materials towards heavy metal adsorption in wastewater treatment application Below is the certificate of Prof. Ir. Ts. Dr. Pau Loke Show which printed on AD Scientific Index 2023 official website. Join us in celebrating Prof. Ir. Ts. Dr. Pau Loke Show accomplishment and let’s continue to support and be inspired by the remarkable work being done within our Chemical Engineering Department! Congratulation to academics in the Department of Chemical and Environmental Engineering making it to the world's top 2% scientists according to the “Stanford List” (see the latest database here: https://elsevier.digitalcommonsdata.com/datasets/btchxktzyw/4?fbclid=IwAR1rKofYGTekuH1cDDQ2VBa31j5OQuiYpmrkUo_jChDUTh1FbtT5D9BYLyo ). World's top 2% scientists based on scientific impact: Prof Ir Dr Dominic Foo, Prof Dr Hon Loong Lam, Prof Dr Suyin Gan, Prof Ir Ts Dr Pau Loke Show World's top 2% scientists based on 2021 statistics: Prof Ir Dr Dominic Foo, Prof Dr Hon Loong Lam, Prof Dr Suyin Gan, Prof Ir Ts Dr Pau Loke Show, Dr Suchithra Gopakumar, Prof Ir Dr Mei Fong Chong (ex-UNM) Professor Dominic C. Y. Foo has recently published the 2nd edition of his textbook - Chemical Engineering Process Simulation with Elsevier/IChemE. Following the publication of the book, Professor Foo did a book launch on 24 Oct 2022 at the international conference of Energy, Environment and Digital Transformation held at Milan, Italy. Professor Foo initiated the book launch by giving an overview of the new edition of the book. He explained that the book consisted of 5 sections, with section 1 outlining the basic steps in constructing a process simulation model (e.g. simulation algorithm, component addition, thermodynamic models), while sections 2 – 5 has the guides and various case studies built on simulation software in the market. He also explained that many universities do not have proper teaching of process simulation. In most cases, students are left to pick up the software by themselves, as if they are playing “computer games”. Hence, it is important to have some structured material to assist the teaching of process simulation, in order train the new generation of engineers in mastering this important skillset upon graduation. Professor Foo then invited the IChemE President Professor David Bogle to say a few words regarding the book. Professor Bogle said “I haven't seen such a comprehensive book in this area. It is based around popular software with a particularly broad and impressive set of examples to help guide good practice and understanding.” Professor Foo is the Chair for Education Special Interest Group (EdSIG) Malaysia Chapter. Prior to the book launch event, Professor Foo conducted a hands-on process simulation workshop at University of Surrey, Guildford UK on 19 Oct 2022. The workshop was organised by EdSIG and hosted by Dr Michael Short of University of Surrey. A total of 24 participants from various universities in the UK attended the workshop, which include academics, early career researchers and postgraduate students. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}