{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/fangyenn.teo",
    "content": [
        {
            "p": "Professor of Water Engineering and Associate Dean (Industry Liaison & Accreditation), Ir. Dr. Teo graduated with a Ph.D in Civil Engineering (Water Management) from Cardiff University, UK, as well as a B.Eng. (Hons) in Civil and Environmental Engineering from the Universiti Kebangsaan Malaysia (UKM), and a M.Sc. in Water Engineering from the Universiti Putra Malaysia (UPM). He was also studied Environmental Impact Assessment at the Danish and Malaysian University Consortium for Environment and Development (DU/MU-CED), Environment Protection at the Japan International Cooperation Agency (JICA), Certificate of Professional Development at the Cardiff University, Oxford Programme on Negotiation at the Saïd Business School, and Singapore-United States Third Country Training Programme on Water Efficiency and Wastewater Management. He has an established professional experience for over 20 years as an engineer, science researcher, senior manager, and academician in the field of civil engineering profession relating to the subject of water-related health and wellbeing management in a changing environment. Prior to his appointment as the Associate Professor of Water Engineering at the University of Nottingham Malaysia, he started his career as a civil engineer in an engineering consultancy company and later joined the Malaysian civil services, where he has held a few positions in the Department of Irrigation and Drainage (DID), National Hydraulic Research Institute Malaysia (NAHRIM) under the Ministry of Natural Resources and Environmental (NRE), and the National Water Services Commission (SPAN). He is a qualified Professional Engineer (P.Eng.) with Practising Certificate that registered with the Board of Engineers, Malaysia; a Professional Technologist (P.Tech.); an International Professional Engineer Register (Int.PE); an ASEAN Chartered Professional Engineer (ACPE); a Fellow of the Institution of Engineers, Malaysia (FIEM); a Fellow of Higher Education Academy (FHEA, UK); and a Member of the Institution of Engineering and Technology (MIET, UK). telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}