{
    "url": "https://www.nottingham.edu.my/Science/People/then.sue-mian",
    "content": [
        {
            "p": "Research Director for School of Pharmacy, Dr Sue-Mian Then obtained both of her bachelor's and PhD's degrees from Universiti Kebangsaan Malaysia (UKM). She worked as a research fellow at the UKM Medical Molecular Biology Institute (UMBI) from 2007-2012 and joined the University of Nottingham Malaysia (UNM) in July 2012 and has been working until present. She is now an Associate Professor of the university since 2015. She also obtained her Post Graduation Certificate in Higher Education (PGCHE) in July 2016. She is currently the lead for animal ethics for the campus, she is involved in the local review and facilitates researchers from the campus to obtain their animal ethics approval from Animal Welfare and Ethics Review Board (AWERB), UK. Her research interest is in elucidating mechanism of action of natural compounds, neuroscience, pharmacogenetics and Science, Technology, Engineering and Mathematics (STEM) education. Her research grants includes investigation of gamma-tocotrienol (gT3), a vitamin E isomer from palm oil as a potential anti-cancer treatment for neuroblastoma; development of mobile genetic detector to detect genes (HLA-B*15:02 and HLA-B*58:01) to prevent severe drug-induced adverse reaction. She serves as the Research Director for the School of Pharmacy from Sept 2021 onwards. She is also one of the nominated members to the UNM Research Integrity and Research Ethics Committee from Dec 2021 onwards. Module Convener for: BIOM1001 Scientific Basis of Medicine (Autumn) LIFE1052 Human Physiology LIFE2089 Neurobiology of Diseases I also contribute lectures to other modules such as LIFE1051 Fundamentals of Neuroscience, LIFE2088 Pharmacological Basis of Therapeutics, BIOM3003 Cancer Biology, LIFE3050 Molecular Pharmacology, LIFE3052 Concepts of Pharmacogenetics. As personal tutor, I guide my tutee with their BIOM1002 Core Skills in Biomedical Sciences assignments. I'm interested in utilising collaborative learning and peer learning to help improved students' understanding and appreciation of histology for the Autumn semester component HDT Human Development and Tissue Differentiation in the BIOM1001 Scientific Basis of Medicine by designing a cross-campus collaborative revision activity near the end of semester to aid in the students' revision. The outcome of this approach has been positive with our students demonstrated marked academic improvement.This work has been presented in HEA seminar and the manuscript is in progress. Area of research Research Interest 1. Basic Neuroscience: Oxidative stress and tocotrienol signaling in neurons 2. Pharmacogenomics: Development of a rapid protocol for detection of HLA-B*15:02 and HLA-B*58:01 alleles to prevent drug-induced adverse reaction. 3. Using online plateform/ tools to deliver Science, Technology, Engineering & Mathematics (STEM) education / Biotechnology education amongst Malaysian school children. 4. Gravitational and Space Biology of Eukaryotic Cells and C elegans Citation index Total Citation 1. Web of Knowledge: Total citation=269, H-index=7 2. Scopus: Total citation = 295, H-index=9 3. Google Scholar: Total citation=361, H-index=8 Research projects 1. Formatting potential treatment for drug resistance high-risk neuroblastoma: Enhancing apoptotic cell death by increased interaction of gamma-tocotrienol with p53 DNA-binding domain to displace FOXO3 transcription factor (Principle Investigator), MOHE FRGS, RM151,500.00, 2021-2024. 2. Introducing a STEM-based Educational Toolkit and Prototype called \"The Gene Detective\" as Biotechnology Enrichment Module to promote interest and love for biotechnology (Principle Investigator), MOHE PRGS, RM146,000.00, 2019-2022. 3. The Gene Detective: Understanding DNA and diseases. (Principle Investigator), Biochemistry Society Education Outreach Grant, £950.00 4. Re-innovating a Combined Treatment of Tocotrienol and Doxorubicin by Elucidating the Interaction between Apoptosis and Autophagy in Colorectal Cancer Cells (Co-Investigator), MOHE FRGS, RM183,000.00, 2020-2023. 5. Examining the heritability of autobiographical memory to understand the causes of overgeneral memory in depression (Co-Investigator), MOHE FRGS, RM94,000.00. 2020-2022. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8018"
        }
    ],
    "pdf_files": [
        "pdf_files/22.pdf"
    ]
}