{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/honloong.lam",
    "content": [
        {
            "p": "Professor, DDr. Lam Hon Loong, is a Professor with the University of Nottingham, Malaysia Campus. He has obtained a double PhD in Chemical Engineering (University of Maribor, Slovenia) and Information Technology (University of Pannonia, Hungary). His research topics are process quality control and supply chain synthesis. He has completed his Bachelor's Degree and Master's Degree in Chemical Engineering, both from University Technology Malaysia with a specialisation in process system engineering. DDr Lam is also active in several international scientific committees; for example, he is the Editor for the International Journal of ENERGY, Clean Technologies and Environmental Policy, guest editor for Journal of Cleaner Production, and Chemical Engineering Transaction. He is also the Vice President for the international conference, PRES. DDr Lam Hon Long is active in Green Biomass Process Synthesis At this moment, I am involve in 3 major modules teaching: (1) Process Design This is a 100% project based module with the objective:To develop the student's ability in group work directed to synthesising and designing sustainable chemical processes.There are few personal and group projects/assignments throughout the semester. Group projects involving teams of 4 students. Assignments & projects covering Process Description, Mass and Energy Balance, Safety Assessment, Process System Engineering and Economic Analysis (2) Statistical Process Control and Quality Improvement Statistics are tools used to make predictions on performance. There are a number of simple methods for analysing data and, if applied correctly, can lead to predictions with a high degree of accuracy. Statistical Process Control, SPC is a branch of applied statistics for quality control. It is statistical analysis of the predictability and capacity of a process to give a uniform product. SPC is a popular industry tool for the collection, analysis and interpretation of data for use in quality control activities. This module covers the basic concepts of statistical analysis and their application to practical problems in process control. This module aims to build fundamental knowledge and skills required in statistical process control and quality improvement. Participants will learn basic concepts of applied statistics in process and quality control as well as the hands-on knowledge of the application of statistical process control in the process industry. (3) Process Integration & Optimisation Energy efficiency can play a key role in a company's drive to reduce its production cost and cut down on its waste treatment bills. How can a company achieve worthwhile reductions in energy consumption as well as effluent emissions? Good housekeeping, frequent preventive maintenance, and improvement of the utility systems are standard measures that must be implemented by all energy consuming processes. However, such measures could not provide a company with a clear competitive edge since the energy savings involved can often be marginal. This course introduces Pinch Analysis, which is a systematic procedure for the design and retrofit (improvement) of process systems for optimum energy usage and minimum waste generation. Process Optimisation, Supply Chain, Biomass Utilisation, Multivariate Statistial Process Control telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}