{
    "url": "https://www.nottingham.edu.my/Science-Engineering/People/poisim.khiew",
    "content": [
        {
            "p": "Professor, Professor Khiew Poi Sim is a material physicist specializing in nanoscience technology and advanced materials. He currently serves as the co-Director of the Centre for Nanotechnology and Advanced Materials (CENTAM) and was the Head of Materials, Mechanics and Structures Research Division in Faculty Engineering. He has been involved intensively in many scientific and technology based research projects that are sponsored by a number of reputable funding agencies, such as MOSTI, MOHE, MOA and CRADLE. He has published more than 100 papers in international peer-reviewed journals and conference proceedings. His inventions have been recognized by a series of innovation awards for the outstanding accomplishments in the advanced materials research. His current research work focuses on nanoscience and nanotechnology advancement, especially on utilizing the nanostructures (semiconductor, ceramic and polymer composite) for photocatalysis, biosensing, organic photovoltaic and microelectronic applications. Nanomaterials, Nanocomposite, Nanophotocalysis, Nanoscience and Nanotechnology, Semiconductor for Optoelectronic, Magnetic Nanostructured Materials, Photovoltaic and Solar Cell, Conducting Polymer, Supercapacitor Fabrication and Processing, Biosensing, Graphene nanomaterial Main teaching activity focus on a variety of Physics for Engineering Modules, including modern physics, geometrical optics, wave optics, quantum physics and material science for engineering. Dr. KHIEW Poi Sim's research work focuses on nanoscience and nanotechnology advancement, especially on utilizing the nanostructures (semiconductor, ceramic and polymer composite) for photocatalysis,… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/F10760486S419.pdf",
        "pdf_files/F10790486S419.pdf",
        "pdf_files/low.pdf",
        "pdf_files/10%20M.Y.%20Ho.pdf",
        "pdf_files/19%20W.S.%20Chiu.pdf",
        "pdf_files/10%20M.Y.%20Ho.pdf",
        "pdf_files/IJESIT201211_21.pdf"
    ]
}