{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Krambit-Pictures.aspx",
    "content": [
        {
            "p": "Krambit Pictures Internship Programme Krambit Pictures is looking to hire interns as well as fresh graduates to work with us on our upcoming feature film projects. Introduction to Krambit Pictures Krambit Pictures is a Production Company affiliated that prioritises in the production of feature films in the Malay and Chinese languages. Krambit Pictures was founded by Joel Soh and Kyle Goonting - who are the producer and co-writers of Polis Evo, together with David Lin, its Finance Director. The company was launched after the success of Polis Evo, which is one of the highest grossing Malaysian films of all time, and it is built on the ambition to further push the envelope in the Malaysian film industry and to take Malaysian commercial cinema to greater heights. Krambit Pictures are passionate about the convergence between academia and industry and are determined to provide a space for new and emerging talents to hone their skillsets and to also gain first-hand experience of working in the Malaysian film industry. Both Joel and Kyle have worked in the film production company ASTRO SHAW as producer and content developer for 3 and 4 years respectively, and Krambit Pictures are now part of a new film division in ASTRO that is mandated to identify, hire and nurture permanent and temporary creative talent such as writers and producers. They have been tasked to do this through their work at the production company Krambit Pictures. Requirement: Krambit Pictures are currently looking for interns who are interested in joining our writers' room which will function to develop films for our upcoming feature film slate, and that which will also include participation from other senior writers from the industry as well as ourselves. Our projects include the sequel to Polis Evo as well as a spinoff of the Polis Evo franchise which will be made into a supertele. Brief explanation of job scope: Key Criteria: Duration of the project: To apply, contact: Kyle Goonting Mobile: 016 206 0402 Email: kyle@krambit.com OR kyle_goonting@astro.com.my Address: 13, Jalan LE 2/4, Lake Edge Puchong, 47100 Selangor telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}