{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Decision-Insider-(Malaysia).aspx",
    "content": [
        {
            "p": "Decision Insider Internship Programme Description Decision Insider is a Global next generation company built on disruptive technologies with intimate knowledge of the global economy and its main actors. We are re-engineering the way international trade and investments work. Our Network uses data Analytic's. international networking conferences, strategic industry focused trainings, corporate news from leaders of global businesses and specialised trainings to support the global decision-making Eco-system. Our Eco-system connects everything through the web. We are committed to re-engineering the global decision-making architecture through secure digital information transmission and front line decision maker media coverage. The digital economy will enable personalised correspondence and sustainable partnerships to be built at the executive leadership level. Decision Insider is not a conventional company, and we don't want to become one. We do work with the world's most successful organisations and have our eyes pinned on innovation and smart small business practices. At Decision Insider, we know that every employee has a brilliant idea and that every employee is integral to our success. Our team thrives as a small cohesive unit that operate's effeciently with a small engine that produces a very big output. We believe in the ability of technology to change the world. Passion and people are synonymous with our business. Decision Insider is looking for individuals who are passionate about global economics and business trends. We're looking for Research Editorial Interns to join us for 6-8 weeks with the option of joining us full-time. We're focused on producing research reports and articles that track the news as well as business developments across Southeast Asia's economic environment. Our reports and editorial pieces are developed for a C-Level executive audience that is based globally - America, Europe, Middle East, Asia Pacific. We are focussed on some specific sectors of business, namely - Supply Chain Management, Women and Leadership,logistics, technology and innovation, finance, islamic finance and lifestyle issues. We employ technology to enable work related collaboration remotely. Job description Desired Skills and Experience Added Advantages: What are YOUR Benefits? Fresh Graduates are STRONGLY encouraged to apply for this position. Please send us your resume and cover letter to team@decisioninsider.com and make sure to mention \"Research Editor\" in the subject line. Decision Insider is an Equal Opportunity Employer. Applicants are considered for all positions without regard to race, colour, religion, sex, national origin, age, disability, sexual orientation, ancestry, marital or veteran status. We want the work environment to be your experimental lab where your creativity is unleashed. Work Hard, Play Hard and Live above and Beyond. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}