{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Reuters-(International-locations).aspx",
    "content": [
        {
            "p": "Reuters Journalism Internships (Updated 9 February 2015) Description: Train with the world’s largest international multimedia news agency; work with seasoned reporters and editors; prove yourself in fast-paced newsrooms around the world. The Reuters Global Journalism Internships offer talented students and graduates an opportunity to learn and shine in our bureaus. The paid internships are a crash course in hands-on business, political and general news reporting. Every intern will report to a senior editor and be assigned a journalist mentor to provide advice and guidance during the summer. They’re expected to show initiative and write regularly during their assignment. Interns will training before they start work, focused on writing skills, journalism ethics and basic financial knowledge. They may also be able to take advantage of other, regularly scheduled training opportunities during the summer, depending on where they’re based. Interns who excel may be considered for other opportunities, including the Reuters Journalism Programme or junior reporting roles. Download a flyer regarding the programme in Asia. Download a flyer regarding the programme in Europe. Download a flyer regarding the programme in North America. Are you a GOOD Fit? Internships available: How do you apply: Apply online. Applicants must have the legal right to work in the location to which they apply. The programme does not cover relocation or visa costs. Americas - applications open in October and close on 1 December 2014 Asia - applications open in January and close on 31 March 2015 Europe - applications open in January and close on 31 March 2015 Internships start in summer 2015 telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/Intern%20flyer%20Asia.pdf",
        "pdf_files/Intern%20flyer%20UK.pdf",
        "pdf_files/Intern%20flyer%20Americas.pdf"
    ]
}