{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Message-from-the-Dean/index.aspx",
    "content": [
        {
            "p": "Welcome to the University of Nottingham Malaysia, Faculty of Arts and Social Sciences (FASS). The faculty is home to 6 schools, 2 departments and 1 center for language. The recent pandemic, and the major global economic shocks before it, show how interconnected and interdependent we are. But such events also invite us to ask pressing questions about the world we want to live in. How can societies and institutions best be managed to maximise their human, spiritual and productive potential? How can linguistic, cultural or political divisions be overcome? What challenges and opportunities do the present and coming technological advances mean for how we work? My colleagues, our students, graduates and our partners at FASS, put these questions at the heart of our teaching and research. This is what makes the Faculty of Arts and Social Sciences (FASS) one of the most dynamic and innovative centres in South East Asia. You’ll find a Faculty home to inspirational and skilled teachers, from across the globe and with access to high-profile, international research, policy and practice networks. They are passionate about their subjects and dedicated to developing our students to become critically-minded, articulate and global citizens. You’ll be part of a global community. Our campus works closely with our sister schools in the UK and China, offering our students a unique international educational experience. All of our courses are taught in English and the degrees we award are exactly the same as those in the UK. Students benefit from developing the skills, knowledge and experience required of today’s graduates in an increasingly competitive global job market. I’m very proud to be part of the Faculty and look forward to welcoming you in person at one of our many open days or campus events. Jason Pandya-Wood Dean of the Faculty of Arts and Social Sciences telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}