{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Shaw-Brothers-(Singapore).aspx",
    "content": [
        {
            "p": "Shaw Brothers Internship Scheme Description: Shaw Theatres, part of the Shaw Organisation, was founded by the Shaw Brothers and has been operating cinemas in Singapore since 1927. With Shaw Theatres JCube, it now owns six multiplexes across the island, and they feature the latest in cinema technologies like IMAX, Dolby 7.1 Surround and RealD 3D systems. Shaw Theatres also manages a seventh multiplex, Century Cineplex, which is privately owned. Shaw Brothers Online is currently looking for interns who is interested to join them with the following opportunities. 1. Graphic Design Intern The Graphic Design intern position will play an important role in the Arts and Marketing department and will be in charge of designing the marketing collateral and publications required by the company. He/She will also need some basic experiences in touching up photos and possess creative ideas on proposing new designs. Requirements: Interested candidates please e-mail your cover letter and detailed resume with recent passport size photograph, screenshots/link of your portfolio and date of availability to: The Recruitment Officer Re: Application for the post of Media Designer Intern Email: interns@sbmedia.sg (Only shortlisted candidates will be notified) 2. Media Intern (Online/Video) The media intern position will be in charge of designing and managing weekly movie and promotion/contest updates and knowledge of video editing and the different type of video formats, scheduling of content (trailers/advertisements) for our media screens (LED Board/Plasma Screens) required by the company. He/She will also need to be equipped with Adobe Flash. Requirements: Interested candidates please e-mail your cover letter and detailed resume with recent passport size photograph, screenshots/link of your portfolio and date of availability to: The Recruitment Officer Re: Application for the post of Media Intern (Online/Video) Email: interns@sbmedia.sg (Only shortlisted candidates will be notified) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}