{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-International-Society-of-Educational-and-Cultural-Exchange-Inc-Foundation-(ISECE)-(Japan).aspx",
    "content": [
        {
            "p": "International Society of Educational and Cultural Exchange Inc Foundation (ISECE) - Assistant Language Teacher (ALT) Internship Programme Description: ISECE endeavors to increase mutual understanding and cultural appreciation among the young people and educators of the world. ISECE does in close coordination with educational establishments such as education boards, universities, local governments and civil organisations for intercultural exchange. This concept is implemented through a variety of ISECE's human resources development programmes and cross-cultural training programmes. Our hope is that through those programmes, ISECE will contribute to world peace and the development of human resources. Do you have outstanding knowledge in English? Are you passionate about teaching? Interested to work in a foreign country? How would you like a chance to be an assistant teacher in Japan? Intake and Duration: Internships will be carried out in accordance to the Japanese academic calendar, in which school semesters begin in the months of April and September annually. The duration of the internship is 6 months. We are not able to shorten or alter the beginning and end dates of the internship. (E.g.: Duration of 6 months – April 2016 to September 2016 / September 2016 to February 2017) Currently, we have an opening for a Junior and Senior High School in Kanagawa, Japan. Number of interns: 2 (1 male, 1 female) Work hours: Mondays to Fridays, 2pm to 11pm (Break; 6pm to 7pm) Students’ age: 13 to 18 years old Accommodation: School dormitory (separate building from the student dormitories) Application deadline: 11 November 2015, 17:00 (Malaysian Time) Roles and responsibilities: Interns will be assigned to be under the guidance of mentor teachers in their respective Japanese host schools. Responsibilities of interns may include but are not limited to assisting mentor teachers in class, creating lesson plans/educational activities, interacting with students and school staff in English, helping out during school events/extra-curricular activities, and holding after school lessons for students living in the dormitories. Eligibility: Application procedures: Application materials: What will be provided for the interns during the length of the internship: Accommodation, meals, transportation fees between accommodation and school, full coverage of the Japanese National Health Insurance, ¥20,000 stipend per month, one-way airplane ticket from Malaysia to Japan. Please e-mail all application materials, or any inquiries to info@isece.jp telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}