{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Media-Prima-(Malaysia).aspx",
    "content": [
        {
            "p": "Media Prima Internship Description: In Media Prima, we place great importance on a fulfilling work environment in which people can grow, individuals can make a difference and teams can win. The Group has a complete range of media businesses which cover TV, radio, newspapers, entertainment productions, movie productions, magazines, event management, electronic media and other broadcasting services. We aspire to be one of the region's top media companies by delivering valued content to the world. Behind the scenes at Media Prima, you will discover a vibrant team driven by dynamism and passion. Our businesses thrives on talent and creativity. Looking to the future, shaping ambitions and achieving goals are all key parts of our business strategies. And developing talent, encouraging and supporting our people to realise their potential is central to that. Why join Media Prima? At Media Prima, we place great emphasis on our PEOPLE. We are cognisant of the contributions of our people that have driven the growth and success of Media Prima to date. We realise that in order to attract, retain and motivate the best, we would need to leverage on the potential of our employee's talents. Central to driving business performance, here in Media Prima, we have developed a clear agenda. Our strategy is thus not focused on monetary rewards alone but also on equally important non-financial factors such as knowledge and value enhancement. We work alongside employees to support career growth. This includes personal development planning, strengths identification, coaching and structured learning. Fields/Areas: How to apply: Students are to prepare the following for internship submission: The complete internship application package are to be submitted here. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}