{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/wenli.chan",
    "content": [
        {
            "p": "Assistant Professor of Business Law, Faculty of Social Sciences Wen Li is a Law and MBA graduate of the University of Nottingham. Her research takes an interdisciplinary look at the impacts of mental health and psychological well-being on business and society, with a focus on qualitative research methods. She has been interviewed on national press, radio and TV, on topics related to community mental health awareness and the decriminalisation of suicide in Malaysia. Her work together with media and mental health practitioners on safe media reporting for suicide prevention has included policy contributions to the Communications and Multimedia Content Code in Malaysia. Wen Li is a member of the research group SUPREMA (Suicide Prevention Research Malaysia) based at the Faculty of Medicine of the National University of Malaysia (UKM). As a parallel line of research, Wen Li also investigates legal issues in credit scoring and data mining, including issues related to AI ethics, anti-discrimination, data privacy and data protection. Prior to joining NUBS Malaysia, Wen Li was admitted to the Malaysian Bar, and was in legal practice in the areas of corporate, banking, finance, property and IT law. Wen Li is a recipient of the Lord Dearing Award from the University of Nottingham in 2023 for outstanding contribution to the development of teaching and student learning, recognising her work in contributing to student experience through supporting students' mental health in her teaching practice. Wen Li also received the Vice-Chancellor's Medal from the University of Nottingham in 2017 for outstanding contributions in advancing equality and diversity in her work with inter-university student awareness platform GEI (Gender Equality Initiative), a collaboration between the Bar Council of Malaysia, the Association of Women Lawyers and several private education institutions in Malaysia. Her involvement in women's rights outreach included the conceptualising and illustrating of the character 'TINA' for the Women's Aid Organisation's outreach book project 'Tina's Journey: A Collection of Words & Poetry by Survivors of Domestic Violence' co-authored with Bernice Chauly and Kelvin Ang, which sponsors included the University of Nottingham Malaysia. Outside the classroom, Wen Li has been a member of the University of Nottingham Malaysia's Performing Arts Council; she is a classically-trained mezzo-soprano and holds a Licentiate Diploma of the Trinity College London in Piano Performance. She also has a penchant for drawing, and has exhibited her work at mental health awareness forums as a lived-experience artist. Wen Li is a Certified Mental Health First Aider (MHFA Malaysia). Wen Li's teaching interests are in business law, strategic management, and business ethics. She is a recipient of the Lord Dearing Award from the University of Nottingham in 2023 for outstanding… read more Wen Li is involved in interdisciplinary research projects involving the social-science lens of mental health awareness and suicide prevention, with a focus on qualitative analysis methods. She… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}