{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/subarna.sivapalan",
    "content": [
        {
            "p": "Associate Professor, Faculty of Social Sciences Subarna Sivapalan FRSA joined the School of Education as Head and Associate Professor in May 2022, having had 20 years of experience within the Malaysian higher education sector. She started her career as a lecturer in TESOL, and prior to joining the University of Nottingham, she was attached to Malaysia's top STEM focused private university where she taught ESP, sustainability education and research methodology modules at both undergraduate and postgraduate levels. She also held key roles in academic and research divisions, with the most reason being the Director of the Centre for Excellence in Teaching and Learning. Subarna also founded the institution's first scholarship of teaching and learning research cluster, and its first education and social sustainability focused research centre. Apart from pioneering the advocacy of the SDGs amongst students and staff on campus, she also established and advised the institution's first student led eco campus workgroup that went on to achieve a bronze award under WWF Malaysia's Foundation for Environmental Education Eco Campus programme. At the national level, Subarna is actively involved in sustainability education advocacy. She is presently the Co- Chair of the National Education for Sustainable Development Association of Selangor. She also sits on the National Committee of WWF Malaysia's Eco Schools Programme, and is presently the Deputy Chair of the Eco Campus Programme. At the international level, Subarna is an Acumen Fellow, the world's school for social change, and co-leads the Climate Crisis Interest Based Group in Catalyst2030. She is a United Nations University Pro.SPER.Net Leadership \"Building Transformational Leadership Towards The SDGs\" fellow. Subarna is also the recipient of WWF Malaysia's National Eco-Lecturer Award for her efforts in advocating for greater awareness amongst youth to champion sustainability. She has also received awards for Effective Education Delivery and Academic Leadership. Subarna obtained her PhD in Education from the University of Nottingham. While working on her PhD at the University of Nottingham, Subarna was involved in Nottingham's first MOOC, Sustainability, Society and You which ran on FutureLearn. She looks forward to connecting and collaborating with stakeholders across all sectors to realize Nottingham's commitment to sustainability through the institution's research, teaching, campus activities and work with partners. Subarna leads the Sustainability and Transformational Education Research Cluster at the School of Education University of Nottingham Malaysia. She is also part of the leadership team of the University of Nottingham Malaysia Sustainability interdisciplinary research cluster and sits on the UNM Research and Knowledge Exchange Executive Committee. Subarna loves working and researching within an interdisciplinary space. Her research expertise, interests and postgraduate supervision include the areas below: Modules Taught: Undergraduate: Technology Enhanced Language Learning Post Graduate : Critical Perspectives on Curriculum and Pedagogy PGCHE : Educational Enquiry Project Selected Publications: Journal Articles: Daniel, E.G.S, Sivapalan, S, Lee, K.E. & Nadeson, T. (2022). The Missing Pedagogical Link for Malaysian Environmental Citizenship: An Emerging Model of Interconnectedness of Knowledge Domains and Values Mediation. 11 (1), https://doi.org/10.14425/jice.2022.11.1.0704. Chitsa, M., Sivapalan, S., Singh, B.S.M. & Lee, K.E. (2022). Citizen Participation and Climate Change within an Urban Community Context: Insights for Policy Development for Bottom-Up Climate Action Engagement, Sustainability 14(6), 3701; https://doi.org/10.3390/su14063701 Leal Filho, W., Salvia, A. L., Frankenberger, F., Akib, N. A. M., Sen, S. K., Sivapalan, S., Novo-Corti, I., Venkatesan, M., & Emblen-Perry, K. (2021). Governance and sustainable development at higher education institutions. Environment, Development and Sustainability, 23(4), 6002-6020. JCR Q3, https://doi.org/10.1007/s10668-020-00859-y Leal Filho, W., Voronova, V., Kloga, M., Paço, A., Minhas, A., Salvia, A. L., Ferreira, C. D., & Sivapalan, S. (2021). COVID-19 and waste production in households: A trend analysis. Science of the Total Environment, 777, 145997. JCR Q1, https://doi.org/10.1016/j.scitotenv.2021.145997 Ho, N. T. T., Sivapalan, S., Pham, H. H., Nguyen, L. T. M., Van Pham, A. T., & Dinh, H. V. (2020). Students' adoption of e-learning in emergency situation: the case of a Vietnamese university during COVID-19. Interactive Technology and Smart Education. Scopus Q2 https://doi.org/10.1108/ITSE-08-2020-0164 Kanapathy, S., Lee, K. E., Mokhtar, M., Zakaria, S. Z. S., Sivapalan, S., & Zahidi, A. M. (2019). Sustainable chemistry teaching at the pre-university level: Barriers and opportunities for university educators. International Journal of Sustainability in Higher Education. JCR Q2 DOI:10.1108/IJSHE-10-2018-0186 Roslan, N. S., Izhar, L. I., Faye, I., Amin, H. U., Mohamad Saad, M. N., Sivapalan, S., Abdul Karim, S. A., & Abdul Rahman, M. (2019). Neural correlates of eye contact in face-to-face verbal interaction: An EEG-based study of the extraversion personality trait. PloS one, 14(7), e0219839. JCR Q2 https://doi.org/10.1371/journal.pone.0219839 Roslan, N. S., Izhar, L. I., Faye, I., Saad, M. N. M., Sivapalan, S., & Rahman, M. A. (2017). Review of EEG and ERP studies of extraversion personality for baseline and cognitive tasks. Personality and Individual Differences, 119, 323-332. JCR Q2 https://doi.org/10.1016/j.paid.2017.07.040 Sivapalan, S. (2017). Sustainability, blended learning and the undergraduate communication skills classroom: Negotiating engineering undergraduates' expectations and perceptions. On the Horizon. Volume 25 Issue 1, 1074-8121. Sivapalan, S., Clifford, M. J., & Speight, S. (2016). Engineering education for sustainable development: using online learning to support the new paradigms. Australasian Journal of Engineering Education, 21(2), 61-73. Sivapalan, S., & Subramaniam, G. (2008). The Incorporation of Literature in the English Language Program for Engineering Students: Learner Interest and Perception. 3L: Language, Linguistics, Literature®, 14. Chapters: Sivapalan, S., & Subramaniam, G. (2021). Community Education and Partnerships for Sustainable Development: A way forward for Indigenous Asia. In Wright, D & Hill, S. (Eds.), Social Ecology and Education (pp. 67-79). Routledge. Kanapathy, S., Lee, K. E., Mokhtar, M., Sivapalan, S., Zakaria, S. Z. S., & Zahidi, A. M. (2020). Enculturing sustainable development concept through chemistry curriculum for education for sustainable development. In Lee, K.E. (Ed), Concepts and Approaches for Sustainability Management (pp. 71-92). Springer. Sivapalan, S., & Clifford, M. J. (2019). Engineering Education for Sustainable Development. In Filho, W.L. (Ed), Encyclopedia of Sustainability in Higher Education (pp. 541-546). Springer. Sivapalan, S., & Speight, S. (2019). Role of Education for Sustainable Development. In Filho, W.L. (Ed), Encyclopedia of Sustainability in Higher Education (pp. 1423-1428). Sivapalan, S. (2016). Engineering education for sustainable development in Malaysia: Student stakeholders perspectives on the integration of holistic sustainability competences within undergraduate engineering programmes. In Filho, W.L. & Brandli, L. (Eds), Engaging stakeholders in education for sustainable development at university level (pp. 263-285). Springer. Sivapalan, S., Subramaniam, G., & Clifford, M. J. (2015). Institutional practices versus student needs and its implications for the development of a holistic engineering education for sustainable development (EESD) framework. In Filho, W.L. (Ed), Transformative Approaches to Sustainable Development at Universities (pp. 413-433). Springer. Sivapalan, S., & Bhattacharyya , E. (2013). Technical Students Perceptions on the use of Thinking Tools in the Literature in English Classroom. In Kabilan, M.K. &Vethamani, M.E. (Ed). Pedagogies for Creative & Critical Thinking in ELT. MELTA ELT (pp. 47-66). August Publishing Malaysia. Bhattacharyya, E., Sivapalan, S., & Md Nordin, S. (2010). Students' Perceptions of the Importance of Presentation Skills to Succeed in the Workplace. In Nordin, N., Mahmud, R. & Abdul Samad, A. (Eds). Readings In English For Specific Purposes (ESP) And Technologies In Education (pp. 85-106): Universiti Putra Malaysia Press. Md Nordin, S,. Sivapalan, S and Bhattacharyya , E. (2010) Bridging the Gap between Teaching Styles and Students' Learning Styles in a Second Language Classroom. In Abdul Samad, A. & Abdul Rahman, S.Z. S. (Eds). Readings in Professional Development in Teaching English as a Second Language (pp. 30-48). Universiti Putra Malaysia Press. Nordin, M., Shahrina, & Sivapalan, S. (2007). Outcome-based Curriculum: Its Implementation in the Teaching of English Language Proficiency Courses. In Monograf 2: Strategi & Kaedah Pengajaran And Pembelajaran (Pp. 100-110). Pusat Pembangunan Akademik: Universiti Putra Malaysia Press. Sivapalan, S., & Sivapalan, M. (2007). Learner Perceptions on Online Approaches to Learning Literature in \"Internet & the English Language Classroom. SASBADI MALAYSIA. Bhattacharyya, E. & Sivapalan, S. & Idrus, H. (2007). Students' Perceptions Of Employer Expectation Of Professional Technical Oral Communication Skills. In Pandian, A. & Kell, M. Literacy: Diverse Perspectives & Pointers For Practice (pp.283-303). Universiti Putra Malaysia Press. Sivapalan, S. (2006). Multicultural perspectives through Young Adult Literature. In Too, W.K. & Vethamani, M.E. Engaging Young Adult Readers Through Young Adult Literature (pp. 86-105). SASBADI MELTA ELT Series. 18 Sivapalan, S. (2004). Transcultural Experiences and the Sense of Self in Lee Kok Liang's London Does Not Belong To Me. In Hashim, R.S., Azyze, I., Yusof, N.M. & Lazim, Z.M. Revisioning Realities through Literary Discourse (pp.125-138). Longman. Books: Shah, F., Alcoba, R., Johl, S.K. & Sivapalan, S. (2021). When Stories Teach: Teaching and Learning Cases. UTP Press. Bhattacharyya, E., Embong, A. M., Sivapalan, S., Kadhim, K. A., Yaacob, R. A. I. B. R., & Sabian, N. A. A. (2020). Practices and Reforms in Education and Humanities for the 21st Century. UTP Press. Sivapalan, S., Azizan, M.T. & Idrus, H. (2019). Envisioning Teaching and Learning in Higher Education. UTP Press. Lee, K.E., Sivapalan, S., & Thiagarajan, N. (2018). Nurturing The Seeds of Sustainable Development. UKM Press. Mokhtar, M. B., Lee, K.E. & Sivapalan, S. (2017). Rising to The Challenge: Malaysia's Contribution to the SDGs. UKM Press. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}