{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/keanwah.lee",
    "content": [
        {
            "p": "Professor, Faculty of Social Sciences KeanWah, LEE holds a PhD in Applied Linguistics from University of Lancaster , U.K. He also completed his B Ed TESL degree from Lancaster University, U.K. He obtained his M Ed TESL from Universiti Teknologi Malayia (UTM). His other academic qualifications included Cert. in Education (Primary English, MPSAH, Sg Petani), Dip ESL (UM), Cert in IT (St Martin's College, U.K.). He has more than 35 years of teaching experience teaching at all levels of of Education from Primary to Secondary and Higher Education in Malaysia. He is currently the Vice-President and Treasurer of PaCCALL (Pacific Association of Computer-Assisted Language Learning - https://paccall.org). AWARDS 1. Winner of Vice-Chancellor's Medal 2021; 2. The Tri-Campus Awards for UNM Outstanding Research Supervisor Awards 2022; 3. The Lord Dearing Award 2022 for Innovative Teaching. 4. Silver Medal IUCEL2022 - E-Learning Innovation - Gene Detector E-Capsule :ORCID ID: https://orcid.org/0000-0003-3644-0086 ; Google Scholar: https://scholar.google.com/citations?hl=en&user=NAl9wlQAAAAJ ResearchGate: https://www.researchgate.net/profile/Kean-Wah-Lee Publons : https://publons.com/wos-op/researcher/4517492/kean-wah-lee/ Areas of expertise include: 1. Teacher Development (CPD/TPD) 2. CALL 3. Language Program Evaluation 4. Educational Assessment & Evaluation 5. TESOL methodology Current Modules: Undergraduate Modules: TESOL Methodology, Teaching Language Across the Curriculum, Practical Teaching in TESOL, Planning for Continuous Professional Development, Assessment & Evaluation for TESOL/SIE Masters Material and Technology in Language Education, English for Specific Purposes; Understanding Language Learning and Language Learner, Practice-Based Research, English for Specific Purposes 1. Teacher professional development and COP, PLC, COI 2. TPACK and 21st Century teacher development 3. Materials development and TELL, CALL, MALL, 4. STEM/STEAM Education,/ Makers telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/9_APJCECT_2018_Edu_v4i2_86-93.pdf",
        "pdf_files/32f35062a7a583321e71bbfa7ea6f4624a00.pdf"
    ]
}