{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/cheemeng.tan",
    "content": [
        {
            "p": "Assistant Professor of Business Economics, Faculty of Social Sciences Chee Meng Tan is an expert in Chinese foreign policy and soft power. As an Assistant Professor at the University of Nottingham Malaysia, he has dedicated his scholarly pursuits to unraveling the intricate ways in which China wields tools like panda diplomacy, the Belt and Road Initiative, and Confucius Institutes to shape foreign public opinion and exert influence on the global stage. Holding a Ph.D. in Business Administration from the ESSEC Business School and a doctorate in economics from the University of Cergy-Pontoise, Chee Meng brings a multidisciplinary approach to his research, drawing upon his profound interest in Chinese history and culture. His expertise is well documented through the publications he has authored on panda diplomacy and Chinese soft power, as well as the comprehensive dataset he and his co-authors have meticulously compiled, chronicling the presence of pandas as diplomatic gifts or loans in foreign nations across the years. Chee Meng's insights on the highly interdisciplinary study of panda diplomacy, which interweaves politics, economics, international relations, and culture, are sought after by major international media outlets, including the Washington Post, NBC News, Australian Broadcasting Corporation, Scripps News, Channel News Asia, Science Friday, The South China Morning Post, the Business Insider, TRT World, CNN, and the Danish newspaper Weekendavisen. He has humorously earned the moniker as \"An expert on China's panda manipulations\" from Fox News and has been featured on numerous radio shows and documentaries, providing authoritative commentary on the purpose and significance of panda diplomacy as a strategic tool in China's international relations arsenal. His commentaries have also been translated and featured in non-English media outlets in China, Taiwan, Indonesia, France, Spain, Brazil, Portugal, etc., making him an authority and go-to figure for panda diplomacy and Chinese soft power world wide. Chee Meng was the sole social scientist invited to lend his expertise to the Science Friday radio documentary \"How 'Panda Diplomacy' Led To Conservation Success\" in December 2023, where he discussed the enduring significance of panda diplomacy alongside eminent zoologists, biologists, and conservation experts. He was also featured as an expert in a two-part TV documentary on panda diplomacy by Singapore's Channel News Asia, which was aired on March 26 and 27 2024. With his knowledge, extensive media appearances, and ongoing contributions to the study of Chinese foreign policy and panda diplomacy, Chee Meng was invited by the prominent media outlet, the Conversation, to write an analytical piece on why China has decided to send pandas to the San Diego Zoo instead of the Smithsonian's National Zoo in Washington DC. This piece, which was published on March 1 2024, was widely read, and was republished in various media outlets including Channel News Asia. In early April 2024, Chee Meng had also published a second article with the Conversation entitled \"Two upcoming elections are likely to tip the balance of power between China, India and the US\". This piece explores what a Trump win would entail for the Chinese and Indian economy, and how Taiwan may be the ultimate loser if the Washington pursues an overly aggressive economic decoupling strategy from Beijing. Within the same month, he published a third article with the Conversation on how China's aid in Russia's war effort against Ukraine may be linked to a high-level visit from Beijing to Pyongyang. Beyond his work on Chinese soft power, he has applied his expertise in political economics to diverse topics in sociology, social psychology, and organizational studies, publishing in highly esteemed academic journals. His multifaceted research interests and commitment to public engagement make him a well-rounded scholar in his field. Presently, Chee Meng is spearheading a public engagement project on Chinese-style management, which delves into the profound ways in which history, culture, and philosophies in China have molded and shaped the management practices of Chinese corporations and their approach to conducting business. Given the rising prominence and influence of China in the global geopolitical and economic landscape, cultivating a deep-seated understanding of how Chinese firms manage their resources proves invaluable to non-Chinese audiences seeking to engage with Chinese corporations. An avid reader of Chinese history and politics, Chee Meng is currently enjoying his free time reading several great reads including Steve Tsang and Olivia Cheung's \"the Political Thought of Xi Jinping\", Yasheng Huang's \"the Rise and Fall of the EAST\", and Kerry Brown's \"China Incorporated: The Politics of a World Where China is Number One\". I work on institutional and political economic topics. My main expertise includes topics related to China's soft power and infrastructure investment, and have extensive expertise on panda diplomacy, which I have been sought by media regularly to discuss on. I am also an expert in multilevel analysis (MLM), which is a method frequently used in both the sciences and social sciences to study data structures with a hierarchical or nested nature. I am regularly sought by outlets to review papers related to MLM, as experts on this important method is somewhat lacking. Alongside my MLM skills, I have also applied my political economics expertise on various topics in cultural and social psychology, and have published my work in good quality journals that are ranked highly on the Academic Journal Guide or AJG, and the Australian Business Dean's Council Journal Quality List (ABDC) I teach the following in 2021/2022 Autumn Semester 1. Quantitative methods 2a (BUSI2055) 2. Industrial Economics 3: Market Structure and Competition Policy (BUSI3164) Spring Semester 1. Industrial Economics 4: Games and Strategy (BUSI3165) 2. Industrial Economics 5: Economics of Regulation and Public Choice (BUSI3166) I am a political economist by training and have expertise in Chinese soft power, as well as social and cultural psychology. Much of my work looks at how the intersection between politics and culture… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}