{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Institute-of-Diplomacy-and-Foreign-Relations-(IDFR)-(Malaysia).aspx",
    "content": [
        {
            "p": "The Institute of Diplomacy and Foreign Relations (IDFR) Internship Programme Description: The Institute of Diplomacy and Foreign Relations, also known as IDFR, was established on 1 July 1991 under the Prime Minister’s Department following a Cabinet decision dated 6 March 1991. It was officially launched that same year on 12 August by the then Prime Minister Dato’ Seri Dr. Mahathir Mohamad. On 27 March 2001 IDFR officially became part of the Ministry of Foreign Affairs of Malaysia. Located in Kuala Lumpur, IDFR is housed in the former building of the Foreign Ministry. Its new campus was opened in 2006. As the Ministry’s training arm, IDFR conducts training programmes for Malaysian diplomatic officers as well as officers from other government ministries and agencies. Apart from the main diplomatic training courses, IDFR provides mid-career and follow up professional skills training to help enhance the professionalism of serving officers. The training programmes are practitioner-oriented and are aimed at equipping officers with the skills and knowledge to meet the challenges they face in the conduct of their professional duties. The Institute provides training in two broad areas-diplomacy and foreign relations, as well as foreign languages. Requirements: Activities: Students will be placed in a Centre relevant to their course (for Centres refer to www.idfr.gov.my). Student interns will be involved in organising training, writing reports, carrying out research, organising programmes such as round table talks and lecture series, and some office duties. To Apply: By mail to: Encik Nekmat Bin Ismail Pengarah Bahagian Khidmat Pengurusan Institut Diplomasi dan Hubungan Luar Negeri (IDFR) Kementerian Luar Negeri Jalan Wisma Putra 50460 Kuala Lumpur Or by email to info@idfr.gov.my telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}