{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/sergio.camacho",
    "content": [
        {
            "p": "UNM Director of Performing Arts, Associate Professor in Music, Faculty of Arts Dr Sergio Camacho is the Director of Performing Arts of the University of Nottingham Malaysia. He joined the UNM in 2013, collaborating with the School of Media, Languages and Cultures and the Faculty of Arts as a Research Fellow for the Knowledge without Borders Network. Within that framework, he proposed the establishment of a Performing Arts strategy for the Development of Performing Arts at the UNM, securing collaborative links with several educational, cultural, social and artistic institutions, with the aim of empowering students, staff, alumni and their wider community with Music and Performing Arts opportunities in a professional environment. As an initial result, he devised, produced, and directed The Mikado: a COMIC opera, the first inclusive pan-UNM musical theatre production, in collaboration with the Kuala Lumpur Performing Arts Centre, KLPAC. This production, and all that soon followed, contributed to develop an ongoing Music and Performing Arts scene and network on the University campus, which has been consolidated with the establishment and promotion of several artistic collectives at the UNM, including Uni Per Arts, the UNM Performing Arts Platform and the opening of the first purpose-built Performing Arts space at the UNM, the Drama Studio. His contribution was acknowledged with his appointment in 2016 as the UNM Director of Performing Arts. Some of the outcomes of this Performing Arts strategy at the UNM include the production of several inclusive shows (such as One Thousand and One Nights (2016), Don Quixote, A Man of La Mancha (2017), Victor Hugo's Les Misérables (2018), and Sweeney Todd's Barbershop (2019), with performances in Semenyih, Seremban, Kuala Lumpur and Ningbo, China), and the establishment, in conjunction with the University of Nottingham UK and China campuses, of the Tri Campus Arts Festival, the first intercampus collaborative creative venture. During the academic year 2020/2021, Performing Arts at the UNM is achieving two new milestones: the opening of the UNM Performing Arts T&L Centre, and the establishing of the first degree option in the field, the BA (Hons) degree in International Communication Studies with Performing Arts. In terms of research, Dr Camacho is one of the leading voices in the defense of Spanish quintessential operatic genre, zarzuela, as a valid platform for contemporary practitioners. As a composer and an academic, he has contributed to the genre with several works, which has been presented internationally in the UK, Spain, Sweden and Malaysia. He is also an advocate for the development of the study and practice of Chinese Orchestra works in Malaysia, and their integration with Western orchestral practices, area to which he has contributed with several compositions, arrangements and orchestrations, including the suite for Chinese Orchestra Discerning Spain (2017), or his work From the Island, presented at the contemporary music festival Crosscurrents and Nodes, in Örebro, Sweden, 2019. One of his latest works, [(Remember)]: A Confined Audiovisual Poem was published in 2021 by the international collective MusikSpektra T. Before joining UNM, he worked as the Associate Course Leader for the International College of Music, ICOM, in Kuala Lumpur, as a Lecturer at the Universities of Northumbria, Sunderland and Newcastle, in the UK, and as the Curriculum Support and Widening Opportunities Manager for Newcastle Music Service. He has recently been inducted as a member of the Spanish Academy of Performing Arts. He is currently leading the development of educational opportunities for FASS students in the field of Music and Performing Arts. One of the first tangible outcomes in this area was the design and… read more Research interests include Composition, contemporary music, performing arts and new audiences; stage, screen and music technology. Music Theatre, Zarzuela, opera, operetta; permeability to contemporary practices. Intercultural Performing Arts: establishing a community-based creative industry. World musics, musicology and musical anthropology; Spanish (including flamenco) and Latin-American folk, Chinese Orchestras, South East Asian, North Indian Classical. Nationalism and Post-colonialism: post-empire identity and transoceanic cultural commerce. New Technologies in Music Education. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}