{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/joanne.lim",
    "content": [
        {
            "p": "Professor, Faculty of Arts Professor Joanne Lim is a sociologist in Digital Media and Communications. Her research encompasses participatory governance, networked (rhizomatic) behaviors in societies and discourses pertaining to digital media interventions including generative AI, HCIs (Human-Computer Interaction) and mobile applications. She focuses on understanding the needs/impact of digital media on communities through public opinion/sentiment analysis, particularly from a decolonial perspective, to better inform the use of data science and AI to improve policies, implementation strategies and decision making in areas of health, media, politics, and education. She advocates for the potential of multidisciplinarity and creative digital methods (including walkthroughs, webscraping and the use of data visualisation tools) to understand human behavior and the development of regenerative societies in the region. Dr Joanne Lim is Professor in Communications, Media and Cultural Studies at the University of Nottingham in Malaysia. She is also Associate Dean of the Faculty of Arts & Social Sciences, and Faculty Global Engagement Lead. Dr Lim holds a PhD in Media and Cultural Studies and an MA in Global Media from the University of East London, UK. She had been appointed Visiting Research Fellow with the National University of Singapore in 2013, and Visiting Senior Research Fellow with the London School of Economics (Saw Swee Hock Southeast Asia Centre) in 2021. Dr Lim teaches on all levels of the UG and PGT/R programmes in the areas of (Digital) Media and Society, Cultural Policy and the Creative Industries. Her research focuses on participatory governance, participatory media (including social media and mobile media), New Communication Technologies, interculturality, youth identities; and civic/political engagement within the Malaysian-Southeast Asian context. She is involved in a number of (multi-disciplinary) research projects, both as primary and co-investigator in the areas of Ethics and AI Implementation in the Communications and Multimedia Industry; Sociocratic Network Interventions: Situating the Symbolic Disruptions in Malaysia's State-Society Relations; mHealth app for Cancer (pertaining to plant-based diet); Jiwa Ibu (mHealth app for women in rural communities); Mental Health and Suicide Reporting; and the Weaponising of Pop Culture on WhatsApp in Singapore & Malaysia. She is Associate Editor of Media Asia (Routledge) and Editorial Board Member of the Southeast Asian Social Science Review (IKMAS). Dr Lim is a former journalist with one of Malaysia's leading newspaper. She also worked as a Broadcast Journalist in Alberta, Canada and a Co-producer of a radio talk show (710KIRO) in Seattle, USA. At present, Dr Lim is working on a research monograph on 'Digital Media Interventions in Southeast Asia' (Palgrave Macmillan, UK). Dr Joanne Lim is a Fellow of the Higher Education Academy (FHEA), UK. She was awarded the University of Nottingham's Lord Dearing Award in 2022 and 2014 for excellence in Teaching & Learning, and… read more Dr Joanne Lim is currently leading a 3-year multidisciplinary research project entitled mHealth App: Prevention and Management of Cancer via an AI-Integrated Mobile Application to Recommend… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}