{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-National-Film-Department-of-Malaysia-(Malaysia).aspx",
    "content": [
        {
            "p": "National Film Department of Malaysia Internship Description: The Department of Filem Negara Malaysia (FNM) is a department under the Ministry of Information Communication And Culture Malaysia. The main function of FNM is to disseminate information on the government polices, programmes and achievements through the films it produced. Being the official production house of the government, FNM is responsible for the production of documentaries and trailers of a high quality apart from supplying and lending out its films to the public. Before the 22nd of November 1963, FNM was known as the Malayan Film Unit (MFU). MFU started its operation from a modest building in Jalan Bangsar, Kuala Lumpur in April 1946. The present FNM complex in Jalan Utara, Petaling Jaya, Selangor was officially opened by His Majesty the third Yang Di-Pertuan Agong, Al-Marhum Tuanku Syed Putra Ibni Al-Marhum Syed Hassan Jamalullail on the 24th of August 1965. Fully equipped with modern facilities, FNM had succeeded in producing hundreds of quality films that received many awards and recognitions at film festivals locally and internationally in the documentary, short film and animation categories. As a matter of fact, FNM also received recognition through the feature films it produced such as Dayang Suhana, Bila Hati Telah Retak, Embun and Paloh. After 65 years of establishment, today FNM stands still, stronger than ever to continue its efforts to become the government's official production house of international standards. FNM is always ready to cooperate with other government departments and agencies, in its efforts to produce fresh, dynamic films that corresponding to the current needs. How to apply: Students is encouraged to submit their application form and CV via their respective school and you can download the internship application form here. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}