{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-International-Federation-of-Red-Cross-and-Red-Crescent-Societies-(Malaysia).aspx",
    "content": [
        {
            "p": "International Federation of Red Cross and Red Crescent Societies - Resource Mobilisation and Relationship Management Internship Description: The International Federation of Red Cross and Red Crescent Societies (IFRC) is the world's largest humanitarian network, reaching 150 million people each year through its 187 member National Societies. The Organisation acts before, during and after disasters and health emergences in order to meet the needs and improve the lives of vulnerable people. Our work is guided by seven fundamental principles (humanity, impartiality, neutrality, independence, voluntary service, unity and universality) and by Strategy 2020, which voices our collective vision and determination to move forward in tackling the major challenges that confront humanity in the present decade. The Resource Mobilisation and Relationship Management Department supports the Director to advocate for heightened Red Cross Red Crescent influence and support for our work. The Asia Pacific zone supports 37 National Societies, many of which have significant capacities and resources as well as domestic and international programmes. Partner National Societies are active both bilaterally and multilaterally in the zone, with IFRC coordination and support, and significant programming is under way to support National Societies to carry out their Strategic Plans and to assist them in case of disaster responses as well as in longer term development programmes. The Resource Mobilisation and Relationship Management Department works to support the implementation of the Federation Wide Resource Mobilisation Strategy, maximising RM opportunities for all National Societies in Asia Pacific zone, and supporting National Societies' Resource Mobilisation efforts by leveraging the international status of the IFRC and supporting NS's capacity building needs in Resource Mobilisation. The department’s role covers the following key areas: Resource Mobilisation: realising coverage of appeals and funding plans for emergencies and longer term development operations; Relationship Management: building partnerships with Partner National Societies, Governments, Multilateral organisations like EU, World Bank and ADB, Foundations and Corporate partners; and National Society Capacity Building: building the capacity of National Societies through knowledge sharing and the Asia Pacific Fundraisers’ Network. Job purpose: To support the Resource Mobilisation Department in the execution and implementation of the plan for 2013. Job Duties: 1. Resource Mobilisation and Relationship Management 2. Support the Asia Pacific Fundraisers’ Network: How to apply: 1. Interested applicants should apply by email no later than 31 August 2013 and should enclose the following: 2. All Applications should be sent to Rohaiza.Zainon@ifrc.org 3. An allowance will be provided at a rate to be determined 4. The Federation is an equal opportunity employer. Requirements: 1. Experience: 2. Skills: telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}