{
    "url": "https://www.nottingham.ac.uk/social-sciences/research/impact/index.aspx",
    "content": [
        {
            "p": "Together with the Economic and Social Research Council (ESRC), the university is working to support influential social sciences research through our Impact Accelerator Account, an award which secures more than £600,000 in funding for world-leading projects. Nottingham is unique in that we have social sciences experts working across a broad range of faculties, schools and departments, from economics to psychology, and health to veterinary sciences. As well as making more than 40 research projects possible (just a selection of which are listed below), our ESRC Impact Accelerator Account has led to the development of the university's award-winning Impact Leaders Programme, which enables academic experts to partner with organisations around the world. Lead researcher: Professor Dirk Van Zyl Smit, School of Law This ESRC-funded project will help communicate the findings of the first comprehensive research ever conducted into life imprisonment worldwide. It will cover more than 200 jurisdictions and enable countries to judge whether the way in which they use this severe punishment meets fundamental human rights standards. Lead researcher: Dr Kay Fuller, School of Education Nationally, just 38% of English state secondary schools are led by women, compared to a teaching workforce where women dominate at 62%. Kay aims to increase the proportion of women aspiring to and achieving leadership roles. She leads the Women secondary headteachers: pass it on project, which brings together increasing numbers of women from Nottingham city and Nottinghamshire county schools to share research findings and further develop relationships. Lead researcher: Professor Paul Mizen, School of Economics A former Governor of the Bank of England noted that the age of innocence (when banks borrowed at small premiums over policy rates) ended with the financial crisis. In this project, Paul will explore the implications of this 'loss of innocence' for the six largest UK banks, considering whether they offered fewer loans as a result of higher and more variable funding costs, or whether some types of borrowers were disproportionately affected. Lead researcher: Dr Duncan Shaw, Nottingham University Business School As an island, the UK is dependent on its maritime infrastructure and most of the tonnage carried is handled by only ten ports. Together with Dr Andrew Grainger, the Department for Transport and other relevant stakeholders, Duncan will work to help ports recover from major disruptions by creating a data sharing platform called MARVIN which will play a key part in port resilience planning. lz-foss-core-ops@exmail.nottingham.ac.uk Current student enquiries"
        }
    ],
    "pdf_files": []
}