{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/sitikhadijah.zainal",
    "content": [
        {
            "p": "Associate Professor in Applied Psychology and Wellbeing, Director of Research; School Senior Tutor, Disability Liaison Officer, Faculty of Arts and Social Science Ethics Chair, Faculty of Medicine & Health Sciences Siti Khadijah or her author name 'Badri, S.K.Z' is an associate professor in the Institute of Work, Organisation and Wellbeing (IWOW) (formerly known as Division of Organisational and Applied Psychology) at University of Nottingham, Malaysia. She joined the team since September 2016. Siti obtained both of her Doctor Philosophy (PhD) and degree (Pyschology) from the Universiti Teknologi Malaysia, Johor. She is the Chair for Faculty of Arts and Social Science (FASS) Research Ethics and Integrity Committe as well as Director of Research Knowledge Exchange, Senior Tutor and Disability Liaison Officer of IWOW. Siti expertise in research is on the area of applied psychology particularly on health and wellbeing subject. Her broader research interests include issues surrounding mental health and well-being at work and in the general population in Malaysia. Her priorities in research is to focus on understanding the predictors, consequences, frameworks, and complex social mechanisms associated with mental health issues in both working and non-working populations. Siti also also particularly interested in examining different levels of practical problems and interactions related to human life (such as various aspects of work life, personal life, and family life) including surrounding socio-economic conditions (e.g. changing work demands/climate, technological revolution, digitalisation) in understanding mental health and well-being challenges or needs at a social/group level. Many of her work concentrated on examining mental health and wellbeing issues surrounding young people, workers (especially younger workforce) and general population. Siti has acted as module conveners for various modules across the different foundation, undergraduate, and postgraduate levels. The list of module she teaches are as below; telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/d4c2746cd1efbd66c399d10d7a5bc2bc028d.pdf"
    ]
}