{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Institute-for-Democracy-and-Economic-Affairs-(IDEAS)-Malaysia.aspx",
    "content": [
        {
            "p": "Institute for Democracy and Economic Affairs (IDEAS) Internship Programme Description: IDEAS seeks interns who are curious about public policy and interested to work in a think tank environment. Beyond qualifications, we are looking for interns who are willing to learn, have great organisational skills and able to work independently with minimal guidance. Your main tasks will include a combination of work including conducting research, organising logistics for events, assisting with the completion of policy papers as well as administrative duties. Interns will be attached to either the Political Governance, Education or Outreach and Southeast Asia Network of Development (SEANET) unit at the Bukit Tunku office. For those who are interested to work with children with autism, you can also apply for internship IDEAS Autism Centre in Rawang. “I like how interns are very much involved in the day-to-day occurrences at IDEAS. I also felt that my initial objective of gaining first-hand experience in understanding the way things worked in Malaysia was achieved as I definitely gained a significant amount of exposure, whether it was during the involvement of closed-door roundtable discussions or the informal discussions between staff in the office” Sarah Kamarul, former IDEAS intern, 2014 To Apply: Please answer the following questions and send your CV along with your availability to admin@ideas.org.my Current Internship Opportunities: We are currently accepting applications for internships. You must be a Malaysian citizen or have permission to work in Malaysia to apply for an internship with IDEAS. Click here to see the internship opportunities. About IDEAS: In January 2013, a global study by the University of Pennsylvania ranked IDEAS as the 5th best new think tank in the world, and the best new think tank in Asia. IDEAS is a not-for - profit, cross-partisan think-tank that promotes four principles: rule of law, limited government, free market, and individual liberty and responsibility. We are a classical liberal organisation. Our activities are geared towards encouraging people to subscribe to these principles, and demonstrating how these principles can be applied to public policy. IDEAS shares the vision of the first Prime Minister of Malaysia, Tunku Abdul Rahman Putra Al-Haj, as stated in the 1957 Proclamation of Independence, which is: To see Malaysia be forever a sovereign democratic and independent State founded upon the principles of liberty and justice and ever seeking the welfare and happiness of its people and the maintenance of a just peace among all nations. Our partnerships with a range of organisations nationally and globally, and across the government, corporate and political sectors, will provide you with abundant opportunities to expand your network and professional growth. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}