{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/ngeederk.tiong",
    "content": [
        {
            "p": "Assistant Professor for TESOL, Faculty of Social Sciences Dr Tiong Ngee Derk is Assistant Professor in TESOL at the School of Education, University of Nottingham Malaysia. A former school teacher and Head of Department for English, he holds an MPhil in Educational Leadership and School Improvement at the University of Cambridge, where he then completed a PhD in Education under Riikka Hofmann, Professor of the Learning Sciences. His thesis on teachers' collaborative discourse in Malaysian secondary school earned a Grade 1 Pass (no corrections) in 2021. Since his transition into academia, Tiong has held various full- and part-time roles at Universiti Malaya, University of Cambridge, and Sunway University. He has also contributed to consultative sessions with the Malaysian Ministry of Education, and consulted for EdTech firms. His research lies at the intersection of teachers' professional development, educational leadership and policy, and TESOL. He sometimes blogs at https://pedagogeekthinking.wordpress.com, which has had thought pieces reproduced by local news portals. In more than a decade in Education, he has won individual awards for teaching and research and secured grants to fund empirical research projects. Tiong enjoys working both within his immediate field of expertise and in adjacent fields, believing in the benefits of interdisciplinary work and the cross-fertilization of ideas and concepts. His areas of expertise include the following: He has also has interest/done work in the following fields: My teaching responsibilities are as follows: Networking for success? An exploratory multi-method study of the relationship between network centrality and academic and professional success among undergraduate pre-service teachers, and the… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}