{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/gayathry.venkiteswaran",
    "content": [
        {
            "p": "Assistant Professor, Faculty of Arts Gayathry Venkiteswaran is Assistant Professor at the School of Media, Languages and Cultures, Faculty of Arts and Social Sciences at the University of Nottingham Malaysia. Among the courses she teaches or has taught are Political Communication, Propaganda and Public Relations and Communication Technologies for undergraduates. She is the module convenor for the Foundations in Media, Communications and Politics offered as a pre-requisite for the ICS programme. She has an MA in International Relations from the Australian National University (ANU), and is currently pursuing her Phd in UNMC on the topic of media reforms in Southeast Asia. Gayathry has over 20 years of experience as a journalist, editor, media activist, researcher and media educator, working in Malaysia and Southeast Asia. She was previously the Executive Director of the Bangkok-based Southeast Asian Press Alliance, a not-for-profit network of media freedom and journalists' organisations in the region to promote press freedom and freedom of expression. Prior to that, she headed the Malaysian Centre for Independent Journalism, during which she and her team successfully campaigned for the enactment of the Freedom of Information laws in Selangor and Penang; ran an independent online radio station; conducted citizen journalism training and activities to promote media literacy among the public; and engagement with various stakeholders on mainstreaming rights to press freedom and freedom of expression. Gayathry has published several articles and book chapters, among them, the use of the ICTs by civil society in the case of the Sg. Selangor Dam campaign, gendering the study of the internet, media freedom and journalists safety in Southeast Asia, freedom of association and assembly online and freedom of expression and religion online in Bangladesh, India, Malaysia and Pakistan. Gayathry's area of expertise and research includes freedom of expression, media freedom and right to information, media in Southeast Asia, media and politics, media reforms, digital rights, media and feminism, media law and ethics, journalism as a profession, organising and mobilising for media rights, newsroom structures and practices, and civic space. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}