{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Tenaganita-(Malaysia).aspx",
    "content": [
        {
            "p": "Tenaganita Internship Programme Description: Tenaganita is a Malaysian NGO that protects and promotes the rights of women, migrants and refugees. Our vision is for a just, free and democratic society where all are equal human beings with dignity and rights. The organisation was founded in 1991, and born out of the struggles of women workers in the plantations and industrial sectors to gain their rights as workers; for decent wages, decent living and to stop discrimination and gender based violence. Since then, Tenaganita’s scope has grown in leaps and bounds and today we address issues of exploitation, discrimination, unequal treatment and violence not just against women, but also refugees and migrant workers. Currently, our programmes cover the following areas: Anti-Trafficking in Persons (ATIP), Migrant & Refugee Rights Protection (MRRP) and Business Accountability & Responsibility (BAR). We work with various migrant communities both documented and undocumented, we reach out to vulnerable groups like the sex workers, trafficked women and children, refugees and plantations workers. The activities conducted by Tenaganita are legal aid services, awareness building to various stakeholders, and advocacy. Tenaganita’s Head Office is located in the Malaysia capital of Kuala Lumpur with a branch office on Penang island. Job Description: There are a variety of ways interns can support Tenaganita's programs and each internship will be somewhat guided by each intern's interest. Currently, Tenaganita has support needs in the following areas: The intern will learn and be exposed to current issues that are being covered by our programmes. These include: As Tenaganita is the foremost organisation in Malaysia on these issues, the intern will get a firsthand insight into the issues and efforts being undertaken to address them. Read a report on an IE3 intern's 6 month internship: A.SpanglerTenaganitaWin-Spr11report.docx. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}