{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Blu-Inc-Media-Sdn-Bhd-(Malaysia).aspx",
    "content": [
        {
            "p": "Blu Inc Media Sdn Bhd Internship Programme Description: BluInc Media Sdn Bhd helms the publishing industry in Malaysia. With almost four decades of experience, over 20 titles and three languages, it is the premier magazine publisher. As specialists, our expertise and infrastructure encompasses the production of glossy, local and licensed international print titles integrated into digital platform setups, and custom publishing services. What started out in 1974 as the Jack Chia-MPH Group in Singapore eventually went through ownership changes to evolve into BluInc which came into the stable of SPH Magazines (a part of Singapore Press Holdings Limited). In Malaysia, BluInc Media Sdn Bhd was set up as a joint venture with SPH Magazines. Strategic business partnerships with Conde Nast, American Media Inc, Weider and Hearst and subsequent acquisitions of Magazine World and ACP titles, have further cemented its position as the industry leader today. These partnerships ensure international quality magazines with a strong Malaysian appeal in the local editions of world-renowned titles such as CLEO, Harper’s Bazaar, Marie Claire, Malaysian Women’s Weekly, Seventeen, Shape, Cosmopolitan, Men’sHealth and Golf Digest. These magazines, together with popular local titles, Female, Her World, Glam, Eh!, Nuyou and ICON offer a vast real estate for premium advertisers to reach their target audience, whether in English, Bahasa Malaysia or Chinese. BluInc Media’s expertise in the publishing field is further augmented via its corporate lifestyle title The Peak, and a custom publishing platform for corporate clients in titles like YTL Life, CIMB Preferred and Starhill. The longevity of the business is anchored in the dedication of its employees to editorial excellence. Editors, writers and designers endeavour to inspire readers and enhance the quality of their lives by delivering target-specific content. BluInc is committed to creating publishing solutions tailored to meet the needs of readers and clients. How to apply: Students is encouraged to submit their application form and CV via their respective school and you can download the internship application form here. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/Application-Form-2013.pdf"
    ]
}