{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/zaharom.nain",
    "content": [
        {
            "p": "Professor of Media and Communication Studies, Faculty of Arts Professor Zaharom (`Rom') Nain teaches in both the BA in International Communication and the MA in Cultural Studies programmes. He joined UNMC in 2010, having taught Communication Studies for more than two decades in a Malaysian public university. He received his undergraduate and postgraduate degrees in Communication Studies from Coventry University and the University of Leicester, England. Rom's most recent publication is the 2013 book, Rhetoric and Realities: Critical Reflections on Malaysian Politics, Culture and Education (SIRD). He is co-editor of two other books, Communication and Development: The Freirean Connection (Hampton: 2001) and Who Owns The Media: Global Trends and Local Resistances (Zed/Southbound: 2004), and has authored more than 100 book chapters, journal articles and conference papers. He is on the advisory board of the Centre for Independent Journalism (CIJ) Malaysia, and has been a consultant to the Geneva-based United Nations Research Institute for Social Development (UNRISD), the United Nations Development Programme (UNDP), and Malaysian agencies such as Galeri PETRONAS and the Malaysian Institute for Economic Research (MIER). Rom was awarded a Fulbright Professorship to lecture in the University of California, San Diego (1998-1999), a Japan Society for the Promotion of Science Fellowship to conduct research at Sophia University, Tokyo (1995), and was a Visiting Scholar in 2004 at Simon Fraser University (Canada), the University of Illinois at Urbana-Champagne (USA) and the University of Utah (USA). More recently (2009), he was a Senior Fulbright Scholar-in-Residence in Johnson, Vermont. His background and research interests are in the sociology of communications and the political economy of the media. Rom is presently putting together a single author book on the media and politics in Malaysia, to be published in 2014. Also slotted for publication in 2014 is an edited volume of a six-nation study he led on the relationship between civil society, the new media and the state in Southeast Asia. Rom is also Vice-President of the Malaysian Social Science Association (PSSM) and is on numerous panels of Malaysia's sole higher education accreditation agency, the Malaysian Qualifications Agency (MQA). Having at numerous points in his career written political and social commentaries and contributed columns for various Malaysian newspapers, including in the Kuching-based newspaper, the Borneo Post, and national newspapers, The Star, and the New Straits Times, Rom currently writes a weekly column for the Malaysian web-based news portal, Malaysiakini and a monthly column for The Heat. Rom teaches in both the BA in International Communications Studies programme and the MA in Cultural Studies. With a background primarily in Political Economy and Media Sociology, he currently teaches… read more Apart from being the present faculty research dean, Rom is also involved in three FRGS research projects. In 2012, he completed a 6-nation study titled Regimes, Civil Society and ICTs which he had… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}