{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-CFFRC--Tourism--Agro-Biodiversity-(Malaysia).aspx",
    "content": [
        {
            "p": "Crops for the Future Research Centre (CFFRC) Internship Programme Description: Crops for the Future is an international organisation dedicated to neglected and under-utilised crops. It is a joint venture hosted in Malaysia by The University of Nottingham, Malaysia Campus and Bioversity International. Tourism and agro-biodiversity: Maximising the benefits of tourism for small holders Recent research has pointed to the valuable role and potential of small holder farming in relation to both food and income security. Small holders are often found in areas which have a high ecological value, employ low input farming techniques and are involved in the cultivation of underutilised crops in multiple cropping systems. Because of these factors small holders also play an important role in the protection of genetic diversity and ecosystem services. However a range of factors such as climate change and food and income insecurity, as well as administrative and scientific support for conversion to monoculture production of major crops is having adverse impacts on the position of small holders in many countries. Development agents across the world have sought to identify and implement alternative strategies to counter these trends by affording small holders opportunities to generate additional income while maintaining existing on-farm activities, albeit in some cases in a modified form. In this context agri-tourism projects offer promise as a mechanism for generating alternatives to direct earnings from agriculture. By enabling rural dwellers to realise greater economic value from existing local resources and production systems, agri tourism offers the opportunity for rural dwellers to generate additional income whilst maintaining existing farming practices and agri-biodiversity. Evidence suggests that if agri-tourism is to succeed in achieving sustainable development and maintaining agro biodiversity then agri-tourism projects need to be embedded in local life and make use of the unique features of specific farming systems. One unique feature of many small holder communities is the farming system itself. These are often characterised by mixed cropping systems which include underutilised crops and related agriculture and food practices. Seen as a combination of activities, species and landscapes this agro-biodiversity potentially offers such areas a unique advantage in the tourism sector which is based on the resources of the local communities. In order to explore this potential CFFRC wishes to employ an intern to work alongside researchers from CFFRC and Sabaragamuwa University Sri Lanka (SUSL) on a project examining the relationship between tourism and agri-biodiversity. The intern will undertake preliminary research concerning the relationship between tourism and agro-biodiversity. The work will involve: The successful candidate will: An allowance will be paid reflecting the intern’s experience. Interested applicants should apply via CV and cover letter to applications@cffresearch.org telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}