{
    "url": "http://www.nottingham.edu.my/Social-Sciences/People/woonchin.yeong",
    "content": [
        {
            "p": "Assistant Manager - Admissions, Recruitment and Marketing and External Engagement, Faculty of Social Sciences Woon Chin joined the University of Nottingham Malaysia Campus in 2007 after completing her Master's degree in Marketing, with the Nottingham University Business School, at the University of Nottingham, UK. Prior to this, she obtained a BA (Hons) in Marketing from Inti College Malaysia, Nilai (now known as Inti International University). She worked in the Marketing Office (now known as Domestic Student Recruitment Department) for the Malaysia Campus until mid 2008 and returned in December 2010 to assume the role of Marketing Executive at the International Office (now known as International (Student) Recruitment Department). In 2012, she joined a five-year research fellowship as Research and Executive Administrator for the Knowledge WIthout Borders Network, She was both Administrator and Research Fellow for the project during the period. After the research project ended, she joined the Faculty of Arts and Social Sciences Administration Office as Acting Assistant Manager and Administrative Executive for the Faculty Office from 2017 - 2022. She is currently the Senior Executive in the Faculty of Arts and Social Sciences (November 2022). She has had numerous professional working experiences with organisations such as Federation of Malaysian Manufacturers and Genting Berhad. Academically, she has written periodically on the Knowledge Without Borders Network blog (and hoping to be able to write, tweet, and research more in the areas of international higher education in SEA and UK and transnational education and global engagement). Professional expertise Academic expertise Woon Chin has facilitated and conducted workshops for the following modules and courses over the years. 2017: 2016: telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}