{
    "url": "https://www.nottingham.ac.uk/social-sciences/study/index.aspx",
    "content": [
        {
            "p": "The University of Nottingham is a leading academic institution and a member of the prestigious Russell Group. Our aim is to provide the finest possible environment for teaching, learning, and research. Social Sciences is the largest and one of our most diverse faculties. We provide a wide range of exciting and inspiring taught programmes at undergraduate and postgraduate level, as well as research opportunities spanning the full breadth of our seven schools. There are over 30 undergraduate taught courses to choose from across the schools within the Faculty of Social Sciences. We have a range of postgraduate taught courses to choose from across our and there are many postgraduate research opportunities available. The Faculty of Social Sciences undergraduate scholarship awards funded by alumni are scholarships for degree students entering the university. Read the guidance notes and apply The faculty runs an exclusive placements programme of term-time opportunities for both undergraduates and postgraduates across all years of study. Find out more about placements If you are interested in finding out more about studying with us, the university holds two open days on a Friday and Saturday in June and September with the opportunity to talk to staff and students. We attend postgraduate study fairs across the country, where you can come and speak to a member of staff about the postgraduate study options we have available. We also host a number of events on our campuses for specific schools and faculties, which are a chance to see what Nottingham is like and talk to academic staff about specific courses. Discover campus life at the University of Nottingham with 360 degree images and videos on our virtual tour. Experience student life by exploring areas such as accommodation, student services, sport, libraries and more. lz-foss-core-ops@exmail.nottingham.ac.uk Current student enquiries"
        }
    ],
    "pdf_files": []
}