{
    "url": "https://www.nottingham.ac.uk/social-sciences/study/placements/index.aspx",
    "content": [
        {
            "p": "As aspiring graduates, you have the power to showcase your unique set of skills and behaviours that make you stand out in the workplace. We are here to help you every step of the way. We offer a range of placement and internship opportunities, alongside detailed careers guidance, to equip you with the tools to succeed in the graduate jobs market. This is the place where you can expand your horizons and unleash your full potential. Many schools in the faculty run academic modules with placements and career-related skills built in (see course catalogues for each school). Additionally, the Faculty of Social Sciences runs an exclusive placements programme of term-time opportunities for both undergraduates and postgraduates across all years of study. There are both paid and volunteer opportunities at local, national and even international level, across a wide range of organisations and businesses. Watch our Placements and Internships Programme introduction video. We have over 150 placements available each year. These opportunities run one day a week during term-time, for a total of 70 hours, and easily fit around your academic timetable. All placements completed give students credit towards the Nottingham Advantage Employability Skills Award. Current students can access these opportunities through Moodle. Many schools offer accredited placements programmes, including: If you would like to take a year out in industry, you can add an optional placement year onto most of our undergraduate courses. Our Nottingham University Business School already incorporates a placement year option into most of their degrees. This will be included on your degree certificate and comprehensive support is provided by your school and the Careers and Employability Service. You will be supervised throughout the year and your supervisor will arrange an in-person or virtual visit during your placement. The Faculty of Social Sciences offers a range of paid placements exclusively to students who are underrepresented in higher education. Our dedicated teams are committed to ensuring these students get exclusive support and career related opportunities once they are enrolled. Many students have been very interested in pursuing overseas roles, but have been put off by the costs. Therefore, the Faculty of Social Sciences offers a grant to students who wish to undertake international work experience. \"I am more confident in my abilities in the workplace...I also was able to demonstrate to myself that I can organise and carry out tasks that may seem challenging at first.\" — Megan Chance, BSc Economics, placement as a Fundraiser at Imara CIO Read our placement blog Watch our placement videos Read our frequently asked questions Information for employers Please be aware that study abroad, compulsory year abroad, optional placements/internships and integrated year in industry opportunities may change at any time for a number of reasons, including curriculum developments, changes to arrangements with partner universities or placement/industry hosts, travel restrictions or other circumstances outside of the university's control. Every effort will be made to update this information as quickly as possible should a change occur."
        }
    ],
    "pdf_files": []
}