{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/ahmad.rahmat",
    "content": [
        {
            "p": "Assistant Professor in Media and Digital Cultures, Faculty of Arts After years of traveling and studying, Fuad returned to Malaysia in 2011 for a foray into Malaysian media and civil society, focusing particularly on interfaith dialogue to work alongside Malaysia's many minority faith communities. He was also the founder and instructor of Sekolah Falsafah, a grassroots initiative aimed to promote Western Philosophy to a wider Bahasa-speaking audience which was held across 12 weeks in 2014 and 2015. He is currently a trainee at the Centre for Lacanian Analysis. Prior to academia, Fuad was a member of Projek Dialog where he was responsible for designing various media driven initiatives to encourage intercultural engagement among Malaysians. These included Pesta Filem Kita, which showcased the power of film to foster cross-cultural understanding and Leveraging Media for Advocacy Objectives, which explored the power of memes and Tik Tok to promote advocacy. He was also the producer for Fatah Dan Farah, in which he worked with Faisal Tehrani and Arif Rafhan Othman, to publish a web-graphic novel to promote diversity in Malaysia. His six years at BFM radio saw him host Night School, a weekly show on BFM radio that made academic and theoretical discourse accessible for the general public and Digital Desires, which explored the impact of social media on human relationships. He has been quoted in the Edge, Channel News Asia, Foreign Affairs and the Star. Lacanian psychoanalysis, post-colonial theory, Marxism. Fuad has taught the following courses: Undergraduate: Cultures of Everyday Life, Communications Technology, Transnational Media, Media and Communications Theory Digital Communications and Media, Writing for the Media. Postgraduate: Issues and Challenges in Contemporary Media Having published on political Islam and existentialism, and dissertated on Malay popular culture from a Lacanian-Marxist perspective, Fuad is currently researching the following topics: 1) The… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": [
        "pdf_files/KM41012023_9.pdf",
        "pdf_files/KM41012023_9.pdf",
        "pdf_files/km36022018_10.pdf"
    ]
}