{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Viddsee-(Singapore).aspx",
    "content": [
        {
            "p": "Viddsee Internship Programme Description: Viddsee is an online media company who believes in making the best Asian films accessible and great stories to be shared. Built and designed by engineers and filmmakers, Viddsee enables users to easily discover, watch and share stories from Asia on their desktop and mobile devices. Our vision is to continually grow the community of short film audiences to enable a wide and accessible market reach for short films and become the leading micro-cinema platform for Asia. Do you enjoy watching films? Does learning new things excite you? Are you curious about the world around you? Are you a communicator? We’re looking for a content/ marketing intern to join Viddsee, which has grown in over a year from just an idea to being one of Asia’s leading online short film platform. The applicant should also: Our team consists of folks of diverse experience and interests and we are keen to share our thoughts and learnings along the way as we chart new grounds. Our office is situated in sunny Geylang, Singapore in an award-winning heritage shophouse between Aljunied and Dakota MRT. If you are interested, please write to: jian@viddsee.com with your brief self introduction, name and contact number.Do you enjoy watching films? Does learning new things excite you? Are you curious about the world around you? Are you a communicator? We’re looking for a content/ marketing intern to join Viddsee, which has grown in over a year from just an idea to being one of Asia’s leading online short film platform. Our team consists of folks of diverse experience and interests and we are keen to share our thoughts and learnings along the way as we chart new grounds. Our office is situated in sunny Geylang, Singapore in an award-winning heritage shophouse between Aljunied and Dakota MRT. If you are interested, please write to: jian@viddsee.com with your brief self introduction, name and contact number. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}