{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-City-Internships-(International-locations).aspx",
    "content": [
        {
            "p": "City Internships - Summer Internship Programme Description: The Summer Internship Programme is structured around an eight week internship placement, with a company in your chosen field, which is complemented by a series of inclusive career seminars and workshops, guest speaker and networking events, social events and weekend excursions. The internship placement is designed to help you explore your chosen career path, develop industry specific skills and knowledge, and increase your professional network – simultaneously helping you to focus the direction of your career and increase your appeal to future employers. The inclusive career seminars, guest speaker and networking events are designed to bolster your on-the-job learning and to further equip you with the tools necessary to launch a thriving career in today's highly competitive graduate market. The inclusive social events and weekend excursions help to deliver a well-rounded experience, serving as a great opportunity for you to fully experience your chosen city with like-minded fellow interns from across the globe. You will benefit from an extensive support network before, during and after the programme. Upon enrolling on the programme you will be assigned an Internship Adviser who will work with you to ascertain your immediate and longer-term career aspirations and guide you through the internship selection and pre-arrival processes. During the programme, you will be assigned a formal Buddy and Mentor – a junior and senior delegate at your internship company – who will support you for the duration of your internship placement. You will also be assigned a Group Mentor – a successful local professional – who will help to steer you through the wider programme and offer support in a less formal capacity. Each element of the programme is carefully considered to ensure that you spend your summer effectively and gain experience that informs, elevates and inspires. The Summer Internship Programme operates in the four of the world’s most dynamic, influential and cosmopolitan cities. Choose from London, New York, Los Angeles or Hong Kong. Your internship placement will take place with a company in your chosen industry. Choose from Banking & Financial Services, Legal & Professional Services, IT & Technology, Art & Design, Marketing, Advertising & PR, Property & Construction, Media, Publishing & Entertainment or Science & Engineering. The Core Programme is fully inclusive and covers your internship placement, daily transportation, meal plan, career seminars, planned events and weekend excursions, and staffing and support for the duration of the programme. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}