{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-ScienceTech-Education-(Malaysia).aspx",
    "content": [
        {
            "p": "ScienceTech Education Internship Programme Description: ScienceTech Education is set up by a group of experienced technical personnel who dared to dream and explore. We continuously explore for new ideas, products and unique methods to make the learning of Science & Technology fun, interesting and easy to understand. The company believes that Training Prepares to Meet Tomorrow's Challenge. Hence the motto - Training for Future. Our main service is to share our practical knowledge and know-how through the conduct of hands-on Science & Robotics Technology (SRT) Enrichment Programmes for Primary and Secondary Schools. Our structured SRT programmes are unique and fun. They are based on our Hierarchy for Life-Time Learning concept: ScienceTech Education strongly believes that all form of skills can only be mastered and perfected through Continuous Practice. Everyone can think creatively but not everyone can be innovative, especially without the required knowledge and skills. Skills are required to compliment creative thinking. By going through the comprehensive and inter-curricular relevant SRT programmes, we believe that students/children can be an independent learner and be innovative and inventive eventually. ScienceTech Education team is looking for engineering, art or psychology interns who is interested to join them for a duration of 3-months and above. Job Duties: Requirements: Location - Klang Valley Working Hours: Monday to Friday - 08:30 to 16:30 Saturday - 08:30 to 12:30 (Optional) Interns will receive an allowance of RM500 per month and a certificate of completion will be awarded during the internship period. How to apply: Please send your CV along with a brief cover letter that describes your interest in the position to scitechsb@yahoo.co.uk. Please write Internship in the subject line of your e-mail. You can also learn more about SciTech Education Facebook page here. Contact Details: ScienceTech Education Sdn Bhd 36 2nd Floor Jalan 4/146 Bandar Tasik Selatan 57000 Kuala Lumpur Tel: 603 9057 1088/ 2088 Mobile: 012 289 7091 (Mr Tan) telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}