{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Centre-for-Independent-Journalism-(Malaysia).aspx",
    "content": [
        {
            "p": "Centre for Independent Journalism (CIJ) Internship Description: Our internship programmes are geared more towards people who want a longer-term, more structured involvement with CIJ. We attract a large number of local and international students, but interns by no means have to be enrolled in school somewhere to be considered. In fact, we have two distinct programmes set up for people who are willing to commit their time. The first, aimed at students, provides academic credit for people interested in the areas of media, journalism, political science, and public policy. They will conduct research, organise events, monitor the media, attend conferences, and work on specific projects geared toward making use of their individual skill sets and interests. The second type of internship involves a similar list of responsibilities, but does not count for academic credit and is not affiliated with a particular college or university. In exchange for a more structured time commitment, these interns have the opportunity to become even more deeply involved on the ground level in some of CIJ’s most vital projects. Interns are expected to make their own arrangements for travel, lodging and living expenses during the internship period as CIJ does not provide financial support for interns. What we look for in an intern: How to apply: Internship is available throughout the year. There is no specific duration for the programme, so we can be flexible enough to accommodate personal requirements. If you’re keen to join us as an intern, write to cijmalaysia@gmail.com with the subject heading “INTERNSHIP”, introducing yourself by providing us your personal details (name, contact information and general background) as well as the following: telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}