{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/karma.tashi",
    "content": [
        {
            "p": "Assistant Professor, Faculty of Social Sciences Before joining the University of Nottingham Malaysia in 2019, I worked as an environmental sociologist with almost two decade's experience in social audits, participatory rural appraisal and social-environmental impact assessments for sustainable forest and oil palm management; specialising in migrant workers and marginalized communities, gender, religion and development. A civil engineer by training, I graduated with a doctorate degree in Environment and Resource Studies from Mahidol University, Thailand in 2008. As a monastic academic and meditation teacher who holds a Master's Degree in Buddhist Studies from the International Buddhist College, I aspire to contribute to humanity by raising awareness, understanding the root causes of and seeking solutions to various developmental issues plaguing humankind today through my research and teaching activities. Further information about my research and copies of some of my publications may be obtained through the following portals: ORCID iD | Google Scholar | Scopus ID I am a registered HCV assessor with the Roundtable for Sustainable Palm Oil (RSPO) since 2010 and successfully completed the Lead Auditor's Training Course for RSPO (2012). I specialise is in labour and migrant issues in the context of oil palm in Malaysia, Indonesia and Ghana; having conducted social audits for the Roundatable for Sustainable Palm Oil (RSPO) and various Forestry Departments in compliance with the Forest Stewardship Council (FSC) and Malaysian Timber Certification Scheme (MTCS) and the Programme for the Endorsement of Forest Certification (PEFC) for sustainable forest management. I am also a qualified auditor for the Conflict-Free Smelter Programme (CFSP) certification scheme and peer-reviewer for the Malaysian Palm Oil Certification Council (MPOCC). I have designed and initiated sustainable livelihood projects for Orang Asli (indigenous peoples) in Pahang under the United Nations Development Programme (UNDP)/Global Environment Facility (GEF) and has worked with various rural communities in Malaysia and Indonesia on High Conservation Value Forest assessments (HCVF). In addition, I have worked on socio-economic planning projects such as the Sarawak Railway Social Screening Project, APEC Transboundary Marine Spatial Planning and Management Project and Participatory Needs Analysis for Local Community Oil Palm Mill in Sabah. I also specialise in gender and development issues, having conducted gender needs assessment and research with indigenous communities in Malaysia and Indonesia. I have developed and am currently teaching three Postgraduate by Taught courses for the MSc. In International Development Management (IDM) programme, i.e. the core modules Introduction to Global… read more I am currently doing research on modern-day slavery (Trafficking in Persons) in the context of oil palm companies and the manufacturing industry in Malaysia, under a British Council grant obtained in… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}