{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-United-Nations-Office-on-Drugs-and-Crime-(International-locations).aspx",
    "content": [
        {
            "p": "United Nations Office on Drugs and Crime (UNODC) Regional Centre for East Asia and the Pacific Internship Description: The UNODC Regional Centre for East Asia and the Pacific provides opportunities for young professionals to take internship in Partnership, Advocacy and Communications as well as in these specific fields of drugs and crime: The interns will be required to: Eligibility: Provided that the Eligibility criteria are met, candidates for the Internship Programme will be selected on a competitive basis. The following minimum qualifications are required: Terms of Appointment: Duration of the internship is from 2 to 6-months and internship participants are required to work full-time during the office hours. Time is allowed for outside research work and interviews. Duty Station: Participating interns will work at the UNODC Regional Centre for East Asia and the Pacific located in Bangkok, Thailand. How to Apply: To apply, students interested in the UNODC Regional Centre for East Asia and the Pacific Internship Programme should submit: To ensure that your application is promptly sent to the correct department, please follow this format in your SUBJECT line: \"Recruitment - Internship - [AREA of INTEREST] [Current field of study] [Internship period]. Send your application to: Ms. Manachat Suvannakul United Nations Office on Drugs and Crime Regional Centre for East Asia and the Pacific United Nations Building, 3rd Floor Rajdamnern Nok Avenue Bangkok 10200, Thailand Tel: +66 2 288 1074 Fax: +66 2 281 2129 E-mail: manachat.suvannakul@unodc.org Due to high volume of internship applications, we cannot respond to your application individually and only successful applicants will be contacted. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}