{
    "url": "https://www.nottingham.ac.uk/sociology/study/continuing-professional-development.aspx",
    "content": [
        {
            "p": "Our programme of CPD courses will develop your practical and professional knowledge and skills. For further information about our CPD training and learning events, or to discuss a bespoke event designed around your own service specific needs, please contact us. Prices are available on request. Discounts are available for block bookings. You will be able to interact with leading academics and practitioners/trainers and you will be brought up to date with latest developments. We have a reputation for innovative course design and delivery and this expertise underpins our CPD opportunities. We develop highly relevant, practical and reflective sessions, underpinned by cutting edge evidence. We deliver CPD at all levels to address lifelong learning needs. Our courses are delivered at the University of Nottingham either on University Park or Jubilee Campus. The courses are delivered by lecturers/trainers drawn from the university and practice, reflecting our globally-renowned expertise. Below is an outline of the courses we offer, but if you would prefer to commission a bespoke course, tailored to your specific requirements, please contact us at for more details. We offer short courses for newly qualified social workers in Child and Family Social Work which build knowledge of a variety of different elements of social work, especially developing skills and knowledge for practice, managing the pressures and responsibility of the profession, and developing an awareness of self as a qualified practitioner. These full day courses will be delivered through two themed inputs (one in the morning and one in the afternoon) which address core practice challenge and skills, and include communicating with children and parents; uses of authority, working with resistance and professional assertiveness; meeting the needs of children in care. We offer full day courses in specific areas of social work practice and legislation such as adoption, risk management, life story, and working with carers. Delivered as lectures and interactive seminars, these courses will ensure that you are up-to-date with the latest legislation, evidence and practice. Suitable for all levels and all experience (including family support and preventative services), the Open Programme series of full day courses are delivered by the university and experienced academics and practitioners/trainers on various aspects of children's social work practice and society. Topics include: meeting the needs of disabled children and their carers; forced marriage; child sexual exploitation; working effectively with highly vulnerable multi-service use families; and engaging fathers. We offer a range of full day courses in specific areas of Practice Education, focusing on observation, theory and providing reflective supervision. Delivered as lectures and interactive seminars, these courses will ensure that you are continuing to develop and practice skills post Practice Educator Stage 2. These are customised courses to meet local needs and priorities. We can offer 360 appraisals, one-to-one consultations and mentoring, work-based feedback and the opportunity to undertake a small piece of academic evidence research to underpin your service reviews. Law and Social Sciences building University of Nottingham University Park Nottingham, NG7 2RD"
        }
    ],
    "pdf_files": []
}