{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Kalu-Yala-(International-locations).aspx",
    "content": [
        {
            "p": "Kalu Yala Internship Description: Kalu Yala is a sustainable community that will be built in the mountains about 45-minutes outside Panama City, Panama. Kalu Yala is founded on the core tenants of culture, new urbanism architecture, organic food, wellness, recreation, education, preservation, and conservation of the natural environment. The internship programme allows students and young professionals to come to Panama and gain cultural exposure, work experience, and knowledge in order to create a project that will ultimately help shape this sustainable community. In this unique opportunity, you can set your own course of work and have the chance to make a dramatic impact over the three-month internship. Kalu Yala Internships, S.A. operates from three locations, each offering an individual environment and personal experience. The first is located in Bella Vista in the heart of Panama City, and serves as Kalu Yala’s headquarters and home to the Business and Digital Development Programmes. The second is in San Miguel, the rural town closest to Kalu Yala in the San Martin County of Panama and is home to the Community Outreach and Education Programs. The third is the actual Kalu Yala property, this remote and captivating environment home to the Living Systems and Outdoor Recreation Programmes. Internship Models: Kalu Yala’s interns get to experience a foreign country, interact with like-minded coworkers, and reinforce personal strengths. The internship concept is centered on independent project-studies, which are selected with the assistance of a Programme Director during the first two weeks of the programme. Every intern has the option to choose between two models: The Kalu Yala Summer Semester starts 20th May and runs through 2nd August 2013. The programme cost covers basic living expenses, and project related expenses. Due to residential capacity, a 30% deposit is required upon acceptance in order to reserve a spot in the programme. Programme Cost: Early admission - closes 4 February 2013: $3,495 Rolling admission - starts 5 February 2013: $3,795 The Kalu Yala Internship Programme cost covers: We accept payment in full but are willing to design payment plans for individuals with extenuating circumstances. Meal Plan Interns located in San Miguel and Panama City are provided 9 meals a week, but do not receive breakfast or dinner on Fridays. Due to the nature of their work, Valley interns receive 14 meals per week, with meal schedule varying around time spent in the field. Meals are not provided on weekends/off days. Our meal plan manager works to provide filling meals that are delicious and healthy, using what is locally available. Vegetarian options are always available. Kalu Yala Internship Enrollment Application: Summer 2013 Semester Applications are reviewed on a rolling admission basis based on the availability of space in each programme. We strongly encourage applicants to apply early. Participants are selected based on the quality of their application and short answer questions. All applicants will be contacted for a phone interview. Please fill out the application online at http://tinyurl.com/d6jum52 or email internships@kaluyala.com with any questions. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}