{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/mandy.sim",
    "content": [
        {
            "p": "Associate Professor, FASS Senior Admissions Tutor, CELFE (FBM) Admissions Tutor, Faculty of Medicine & Health Sciences Mandy is an academic from the University of Nottingham Malaysia (UNM). She has more than 14-year experience in higher education as well as corporate working experience in local and international organisations. She obtained her first degree in Human Resource Development with 1st class honours and master's degree in Technology Management. Recently, she obtained her PhD in Business and Management from the University of Nottingham. She advocates collaboration, external engagement and knowledge exchange between the world of academia and industry. She was awarded the Asia's Education Leadership Award in 2015 in Singapore. In 2016, she launched the Global Business Services Industry-academia Collaboration in UNM and positioned the University as the first private university to offer the GBS course in Malaysia, in collaboration with a network of HEIs and industry partners such as MDEC, Talent Corp, IBM, Sime Darby, Citibank, and BASF. She received the Lord Dearing Award in 2018 and the Vice-Chancellor's Medal in 2019. Mandy served as the GBS research committee member of OM, PIKOM for 2020/21 term and being one of the judges for the GBS Asia Awards from 2019 to 2021. Her research interests are but not limited in the areas of service performance, digital global business services, industry-academia-government collaboration, future of work, education and entrepreneurship. Mandy currently teaches several modules for Business Foundation Programme. The modules are listed below: Teaching (Foundation Level) Previously, Mandy has taught modules like Human Resource Management, Strategic Management, International Management, Self-awareness and Career Management, Entrepreneurial Business Planning and Organisational Structure and Design. Mandy's current research focus are in the areas of HR shared services and outsourcing (or rather being known as global business services now), and business strategy. She is presently looking at human… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}