{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/dag.yngvesson",
    "content": [
        {
            "p": "Assistant Professor, Faculty of Arts I am a graduate (PhD 2016) of the doctoral program in Cultural Studies at the University of Minnesota, with a minor in Moving Image Studies. In addition to my work as a scholar, I have over a fifteen years' experience as a filmmaker, with projects ranging from ethnographic documentaries to experimental and intergeneric work, as well as music videos, commercials and skateboard films. My research interests include media and film studies, Southeast Asian studies, postcolonial studies, gender studies, and visual anthropology. My upcoming book project, Non-Aligned Features: The Coincidence of Modernity and the Screen in Indonesia, views cinema as a tool for imagining, contesting, and continually revising the collective 'face' of modern Indonesia. I engage in the study of Indonesian and Southeast Asian cinemas as an intervention in the broader, Western-centered field of film and media studies. My work is aimed at advancing scholarly understandings of how national cinemas are conceived and distinguish themselves vis-à-vis the technological, political and formal attachments of cinema and modernity to America, Western Europe and the Soviet Union. An important focus of my study is thus how \"Non-Aligned\" regional networks in the early-to-mid twentieth century linked Java and Sumatra to Egypt, Pakistan, and other politically sympathetic nations, serving as filters for globalizing ideas and technologies coming from Europe and the Soviet Union. I argue that these regional and interlocal circuits of exchange contributed to the development of the most distinctive features of Indonesian cinema in the early post-independence period. My findings show that the resulting films were neither imitative nor determined by explicit opposition to Hollywood or the West, but shaped Indonesian cinema into a new and important platform where emergent transnational media, ideas and products could be engaged and translated into locally suitable forms. In addition to Southeast Asian cinemas, I study and teach American and European \"New Wave\" film movements, am well versed in classic Swedish cinema, and take a special interest in post apocalyptic narratives from Hollywood and elsewhere. My continuing work as a filmmaker contributes a crucial grounding to my perspective as a scholar, adding 'second angle' with which to view objects of study, and frequently pulling me into the field, where I take a hands-on, ethnographic approach to research on the production and reception of cinema. My films in turn are informed and shaped in important ways by my scholarship. Many of my recent film projects, while engaging with issues like the capitalization of Islamic discourse in Java, labor and health conditions in the Los Angeles pornographic film industry, or the politics of peacekeeping and international finance in post-Tsunami Aceh, compliment my attempt to \"show\" in writing the complex and often paradoxical roles that new and \"old\" media alike play in processes of social and political change throughout the world. My films thus in some sense function both independently, and as a \"practical laboratory\" that critically engages with my theory and research. Here at UNMC, I am also fortunate to be able to share and further develop my theoretical and production work within the vibrant local communities of scholars, practitioners and students. At UNMC I teach: MLAC 1025 Reading Film and Television, MLAC 1026 Producing Film and Television, MLAC 2019 Cultural Politics. I also co-teach for MLAC 3020 Southeast Asian Film, MLAC 1017 Introduction to Cultural Studies, and MLAC 2004 Researching Culture, Film and Media. Other teaching experience: From 2011-2014 I was a regular guest lecturer in critical theory and ethnography for the George Mason University Institute for Conflict Analysis and Resolution graduate workshop (students were from MA and PhD programs at George Mason) in Indonesia. From 2008-2014 I was a regular guest lecturer in visual anthropology and ethnographic practice for the Haverford College Center for Peace and Global Citizenship Summer Program in Indonesia. At the University of Minnesota (2008-2016) I taught Introduction to Film Study, and Intermediate Digital Cinema, and assisted in several other culture, film and literature-related courses. I have just completed 2 months of field and archival research in Yogyakarta and Jakarta under the title \"Islamic Conservatism and the Return of 'Non-Aligned' Cinema in Contemporary Indonesia.\" The… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}