{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-UCLG-ASPAC-(Indonesia).aspx",
    "content": [
        {
            "p": "United Cities and Local Governments Asia Pacific (UCLG ASPAC) Internship Scheme Description: The United Cities and Local Governments (UCLG) is the largest association of local governments in the world and the officially recognised voice of local government by the United Nations. UCLG ASPAC is one of the eight Regional Sections UCLG in which its Secretariat is located in Jakarta and hosted by the Provincial Government of Jakarta. As the Asia and Pacific region is the biggest of the eight sections in UCLG, it plays an important role within the whole network of UCLG. It links with more than 7,000 local governments. It represents well over 3.76 billion people - more than half of the world population and incorporates economically fast developing countries such as China, India and Indonesia. UCLG ASPAC is the key knowledge management hub of local government issues in the Asia-Pacific region. It promotes democratic local government, supports cooperation between cities and their associations,and facilitates programmes, networks and partnerships to develop the capacity of local governments and the associations. Moreover, UCLG ASPAC represents local governments politically within the international community, and with the United Nations and its agencies. It also promotes inclusive societies which safe guard equality, social and economic justice, and sustainable community development. UCLG ASPAC is engaged in all relevant thematic fields for nurturing sustainable development comprising of poverty alleviation, climate change,decentralisation, local finance and MDGs, natural disaster risk management, and so on. UCLG ASPAC is accepting the expression of interests for an internship opportunity from the university students of allover the world including Indonesia. The interns will be placed at the UCLG ASPAC regional office in Jakarta and to provide support to the on-going operations of UCLG ASPAC Secretariat. We strongly believe this internship programme will be good opportunity for students to raise their skills for their future development goals. Assignments and Expected Outputs: Under the direct supervision of the Secretary General and relevant Programme Manager, the interns are expected to perform the following tasks: At the end of the internship, the following outputs will be expected: Requirements: telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}