{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/ray.sandeep",
    "content": [
        {
            "p": "Head of School, Faculty of Arts Sandeep Ray is a visual artist, writer and historian. He is head of the School of Humanities. Prior to joining Nottingham Malaysia, Sandeep taught at the University of Wisconsin, Rice University, and the Singapore University of Technology and Design. His research emphasizes connections between media and history. Sandeep has related interests in non-fiction film; the novel; old media; global refugee crises; and transnational approaches to Asian Studies. His 2021 monograph Celluloid Colony (NUS Press) about ethnography in Dutch propagandistic film in colonial Indonesia was a finalist for the EuroSEAS 2022 Social Science Book Prize. His debut novel A Flutter in the Colony (Penguin Random House-SEA) is set in 1940s Bengal and 1950s Malaya and explores suppressed historical pasts through the experiences of an uprooted family. Sandeep has been a reviewer for several academic journals including the Journal of Southeast Asian Studies, American Historical Review, Historical Journal of Radio, Film and Television and History of Photography. In 2024, Sandeep received the David H. Culbert Routledge-IAMHIST Prize for Best Article by an Established Scholar. Sandeep's films (IMDB link) have been reviewed in The American Anthropologist and the Journal for Visual Anthropology and have been screened at several film festivals including at Busan (BIFF), Taiwan (TIDF), Sydney, Paris (Jean Rouch), Tehran (IIFF), Copenhagen (DOX), and have curated at the Flaherty Seminar, the Margaret Mead Festival, the Films Division of India and the Whitney and Getty Museums. His films are distributed internationally by Documentary Educational Resources in Massachusetts. He recently had a solo photo exhibit at Hikayat Gallery, Penang titled Afternoon Histories. Sandeep has guest-lectured widely and been invited to serve on several festival juries. Personal website: www.sandeepray.com For the 24-25 AY I am teaching: Documentary Film (Theory and Practice) Film and Television in Social and Cultural Context Introduction to Creative Writing Sandeep is currently co-editing a special volume titled, 'Encountering Violence: Media and Memory in Asia' with Han Sang Kim of Ajou University. The project originated as a collective endeavor with… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}