{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-The-Royale-Bintang-Resort--Spa-Seremban-(Malaysia).aspx",
    "content": [
        {
            "p": "The Royale Bintang Resort & Spa Seremban Internship Programme Description: The Royale Bintang Resort & Spa Seremban is a sub-urban 4-star hotel overlooking the city centre as well as the hilly landscapes of Seremban and providing our guests with all the comfort and amenities they required for business, rest and recreation. A sophisticated business and resort address within the state, The Royale Bintang Resort & Spa Seremban is focused in giving our guests a premium value of their patronage. Situated on the Lake Garden’s district of the state capital of Negeri Sembilan Darul Khusus, The Royale Bintang Resort & Spa Seremban welcomes you with our Negeri Sembilan’s cultural hospitality, renowned for its warmth and cultural heritage. The Royale Bintang Resort & Spa Seremban, The Royale Chulan Kuala Lumpur, The Royale Bintang Kuala Lumpur, The Royale Chulan Damansara, The Royale Bintang The Curve, The Royale Aryani Terengganu and The Royale Chulan Cherating Pahang, are owned and managed by the Boustead Hotels & Resorts Sdn Bhd, a subsidiary of Boustead Holdings Berhad. The company places marketing emphasis on business travel and also operates one leisure-oriented resort. The hotel group strives to become a stylish and forward thinking leader of hospitality. From balls and banquets to business events and romantic days to remember, the group strongly holds to its tagline – We Are Where You Want Us To Be. Requirements: Activities: Students are expected to work at the front desk as Guest Service Officer and interpreter, mainly deal with Korean customers who stay in the hotel (employees of Samsung). Students will be asked to work 6 days per week, 8 hours per day, as well as to work on shift. Meal during working hour and a monthly allowance of RM250 (negotiable) will also be provided. If students require for accommodation, the allowance will not be given. A mentor and on-the-job training will be arranged. Students are also expected to adapt to the busy schedule in the hotel. To Apply: By email to HR Manager - Ms Azizah bt Hj Aziz: Azizah@royalebintang-seremban.com Address: The Royale Bintang Resort & Spa Seremban, Jalan Dato’ A.S. Dawood, 70100 Seremban, Negeri Sembilan Darul Khusus. Tel: 06-766 6003 General line: 06-766 6666 Fax: 06-766 6009 www.royalebintang-seremban.com telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}