{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-CFFRC-SMLC---Food-(Malaysia).aspx",
    "content": [
        {
            "p": "CFFRC-SMLC Internship Programme Description: Crops for the Future is an international organisation dedicated to neglected and under-utilised crops. It is a joint venture hosted in Malaysia by The University of Nottingham, Malaysia Campus and Bioversity International. Food as an element of intangible culture CFFRC’s is committed to a research value chain approach to understanding the current use and future role of under-utilised crops. In this context CFFRC needs to address a range of issues including socio-cultural issues concerning the selection, preparation and consumption of food. The reasons why people choose to eat the things they do, and the factors influencing possible changes in these choices, extend beyond simple calculations of cost and benefit or nutritional value. Styles of food and eating are socio-cultural practices which are in turn in embedded in a wider social and cultural context. Understanding these practices and the context in which they are situated is an essential pre-requisite to enhancing or maintaining demand for specific food items and promoting the culture of which they are a part. In Malaysia hawker food enterprises represent an important configuration of practices which incorporate specific types of food and socio-cultural practice. Besides their cultural significance, hawker food enterprises currently constitute an important outlet for a range of locally sourced utilised and underutilised crops. In addition hawker food in all its many shapes is a very significant component of Malaysia’s small business sector which makes a major contribution to GDP. The unique variety of hawker foods is arguably one of the defining elements of intangible culture in Malaysia and features in drives to increase local and international sites with specific centres such as Penang benefitting from their reputation as “food centres”. However, a range of factors such as the so called “westernisation” of food preferences, the expansion of vertically integrated local and global supermarket and catering chains, changes in lifestyle and regulatory issues pose significant challenges for the hawker food sector. With this in mind researchers at UNMC School of Modern Languages and Culture and CFFRC have been developing a project exploring the role of hawker foods as an element of intangible culture. In order to develop this work CFFRC now wishes to recruit a research assistant to undertake preliminary desk research. Based at the university of Nottingham Malaysia campus the research assistant will; This project offers promising young researchers to undertake work on a major multi-country research programme. The projected start day for the assistantship is the beginning of June with an expected duration of 3 months. Interested Applicants should contact, Dr. Patrick O’Reilly at patrick.oreilly@cffresearch.org telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}