{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/malachi.vethamani",
    "content": [
        {
            "p": "Emeritus Professor, Faculty of Arts Malachi Edwin Vethamani (b. 8 July 1955) was born in Brickfields, Kuala Lumpur, Malaysia. He had his early education at Methodist Boys' Primary School, Kuala Lumpur and continued at Methodist Boys' Secondary School, Kuala Lumpur. He did his Higher School Certificate at Vanto Academy, Petaling Jaya. He obtained a Bachelor of Arts (Hons.) in English Literature, Diploma in Education (TESL), Master of Education in Teaching English as a Second Language (TESL) from University of Malaya and a doctorate in Literature in English from the University of Nottingham, UK. Upon his retirement on 4th January, 2021, he was appointed Emeritus Professor by the university. He was Professor of Modern English Literature at the School of English, University of Nottingham from 2015 till his retirement. Prior to joining University of Nottingham, he was Professor and Founding Dean, School of Education, Taylor's University, (2011-2014), Professor and Founding Dean, School of Education, Languages and Communication , Wawasan Open University (2009-2011), and Associate Professor, Faculty of Educational Studies, Universiti Putra Malaysia (1986-2009). He taught English Language at MARA Junior Science College, Pengkalan Chepa (1979-1982) and Jasin (1983-1986). A Malaysian-born Indian poet, writer, editor, bibliographer, academic and critic. His areas of research include Malaysian Literature in English, New Literatures in English, Modern and Contemporary Literature, New Englishes, Malaysian English. His most recent publication is an edited volume of Malaysian poems, Malaysian Millennial Voices published in March 2021. He edited a volume of Malaysian short stories, Ronggeng-Ronggeng: Malaysian Short Stories which was published in 2020. He edited a volume of Malaysian poems entitled 'Malchin Testament: Malaysian Poems' (Maya Press, Kuala Lumpur: 2017) which covers a period of 60 years. In 2003, he edited a volume of poems for young adults entitled 'In-Sights: Malaysian Poems' (Maya Press, Kuala Lumpur). He published A Bibliography of Malaysian Literature in English (Maya Press, Kuala Lumpur) in 2015. This is the first bibliography to trace literary publications in English by Malaysians, from the 1950s to 2014. As poet, he has published two volumes of poetry. His first collection Complicated Lives (Maya Press, Kuala Lumpur) was published in 2016 and his second volume of poems Life Happens was published in July 2017, (Maya Press). His first collection of short stories, Coitus Interruptus and Other Stories was published in January 2018. His stories have also been published in Queer Southeast Asia Literary Journal (2020), Creative Flight Literary Journal (2020), Business Mirror (2018), and Lakeview International Journal of Literature and Arts (2017). A theatrical adaptation of three of his stories from Coitus Interruptus and Other Stories were reworked as monologues and performed as 'Love Matters' by Playpen Performing Arts Trust in Mumbai in 2017 and 2018. His short story 'Best Man's Kiss was reworked into a short play for an event called 'Inqueerable' organized by Queer Ink in Mumbai on 8th September 2019 to celebrate the first anniversary of the Supreme Court of India overturning Article 377 of the Indian Penal Code which had made consensual homosexual sex illegal. He has been conferred several awards and honours. He was bestowed the Special Excellence Award, Alumni Laureate Award 2020, by his alma mater, University of Nottingham and the Vice-Chancellor's Achievement Medal, University of Nottingham in 2019. In 2013, he won the Asian Education Leadership Award conferred by World Education Congress, Mumbai India and the Malaysian English Language Teaching Association (MELTA) Special Award. He is a recipient of the Fulbright Scholarship (2000) and the Chevening Award, a three-year scholarship for doctoral studies at University of Nottingham (1993 to 1995). The Malaysian English Language Teaching Association (MELTA) has named an award, the MELTA-Malachi Edwin Creative Teacher Award in recognition of contributions made to English Language teaching. This Award is bestowed on three teachers during the annual MELTA International Conference. I no longer teach full-time as I am retired. I occasionally give guest lectures. My research interests are currently related to Malaysian Literature in English and Malaysian English. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}