{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/tim.gocher",
    "content": [
        {
            "p": "Hon. Prof. of Sustainable Business, Faculty of Social Sciences Tim Gocher is Hon. Professor of Sustainable Business in the Business School at the University of Nottingham Malaysia Campus. His focus areas include impact investment, corruption and IP commercialisation. He is also a guest lecturer at London Business School, and has been published in London Business School Review and The Journal of Financial Regulation and Compliance among other journals (see Publications tab). Tim is the founder and CEO of Dolma Fund Management - the first international private equity fund manager for Nepal. Its fund investments have generated over 10,000 jobs in Nepal across renewable energy, healthcare, and technology industries. In the 2022/23 fiscal year, Dolma's funds were the largest FDI investor in Nepal. Tim is also Chairman of Dolma Foundation, a British non-profit organisation he founded in 2003 that provides full scholarships for marginalised children in Nepal. Tim's background is in private equity, energy and technology. After nine years at Deloitte and J.P. Morgan, and an MBA from London Business School, Tim became Managing Director at listed investment bank Interregnum (ParkMead) plc. Tim was awarded the OBE in the 2022 Queen's Birthday Honours List for services to British investment and economic development in Nepal. Tim is married to Pooja Gurung and has three children: Daniel, Benjamin and Elizabeth. Tim lectures at Nottingham University Business School Malaysia Campus in the areas of sustainable/climate finance and impact investment. He also lectures at London Business School on infrastructure… read more His main research interests are in the effect of Foreign Direct Investment (FDI) on levels of corruption and poverty in Least Developed Countries. He also has an interest in university Intellectual… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}