{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-Poskodmy-(Malaysia).aspx",
    "content": [
        {
            "p": "Writers in Progress (WIP) Trainee Scheme (Deadline for Application: 1 September 2013) Description: Poskod.my has launched Writers In Progress (WIP), a dedicated trainee scheme for aspiring journalists. We are looking for bright, hard working young people who want to develop their interest in writing and journalism to come and train with us. Each “Writer in Progress” selected will join our team for three months. You will work for us part time, writing for the website, while also receiving one to one training sessions on journalism and multimedia skills. On top of that, you will also get a monthly stipend of RM1,000. Sound like your dream come true? Read on … Who can apply: You can apply to WIP if you are aged 18-25 and have not yet gained full time, paid employment in any print or online publishing company. We are looking for people who are passionate about journalism and have a love of storytelling, with excellent English communication skills. Ideally, you will also be interested in local issues that affect your city and community. Why apply: This is a rare opportunity for you to develop your talents with some of the most experienced and dynamic people in the industry. You will write for a respected independent publication and come away with a portfolio of articles to show future employers. And did we mention you get paid to do all this? Fuyoh … When to apply: Applications for the latest round of WIP are now open. The deadline for applying is midnight on 1 September. The successful applicant will start in October. Only one person will be selected for each three month rotation. If you are not successful in applying to this training rotation, then we may still consider you for the scheme later in the year. What if I applied to WIP before? If you applied to the first round of WIP and you were shortlisted for an interview, you do not need to re-apply. We will automatically consider your application again. If you applied before and were not shortlisted, then feel free to re-apply if you have an updated CV and writing samples. How to apply? E-mail Ling, the editor, at ideas@poskod.my with the subject line “Poskod WIP Application”. Include the following in your e-mail: Please also attach the following to your e-mail as a Word file or PDF: Poskod WIP is supported by the Embassy of Finland, Malaysia. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}