{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-EMPOWER-(Malaysia).aspx",
    "content": [
        {
            "p": "EMPOWER Internship Programme Description: Persatuan Kesedaran Komuniti Selangor (EMPOWER) is a non-governmental organisation that promotes and supports actions that advance justice and democracy, based on feminist and human rights principles. We work with women and youths to realise their potential in the areas of political participation, economic empowerment, and civil liberties. EMPOWER began as a group of activists working with women and youth who were affected by the 2004 Indian Ocean tsunami in Northern Peninsular Malaysia. As a group they observed that the women’s economic losses were neither recognised nor compensated. It was soon obvious that challenges faced by marginalised women were linked to broader issues of equality and non-discrimination. Many in the group were activists of many years’ standing, and they saw a need to challenge and address the situation. This set the stage for the formation of Pusat Janadaya Berhad in 2005 to advance women’s equality and non-discrimination. In 2008, the Registrar of Societies approved the organisation’s application to form a non-profit association. Pusat Janadaya was renamed Persatuan Kesedaran Komuniti Selangor (EMPOWER). Our current focus is on developing women leaders with a commitment to the principles of equality and non-discrimination, particularly among young women, indigenous women, and women in low-income communities. We also monitor women’s political participation and advocate women’s rights issues in the media, Parliament, and with the public. To apply: EMPOWER offers an internship opportunity for students who are keen to learn the ropes of the NGO world, apply their existing knowledge and gain new experiences to bring to the workforce. Internships are tailored for specific interns’ interests and relevant academic fields. Our internship programme will reward a committed and independent intern with an invaluable experience of the realities of day-to-day life in an organisation working to promote a society with equality for all. Many of our interns have joined us as members and have gone on with a strong sense of rights and justice. EMPOWER welcomes local and international applicants. Interns from Malaysia will receive a stipend of RM500 per month. Accepted applicants from countries of the Global South may also receive this stipend. Contact us at comm@empowermalaysia.org to know more about our internship programme. To apply, please fill out this form and e-mail it to us with your resume. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}