{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-BBC-Radio-(International-Locations).aspx",
    "content": [
        {
            "p": "BBC Radio Journalism Apprenticeship Scheme Description: Are you interested in people and their stories? Can you find guests that will challenge, amuse, surprise and inform the Radio 4 and World Service audience? The BBC Radio Journalism Apprenticeship Scheme is a fantastic opportunity to kick-start a career in speech radio. If you have a passion for speech radio and listen to Radio 4 and World Service programmes like Woman’s Hour and Outlook, if you have a genuine interest in how such programmes are put together and what makes them tick, then this is an opportunity for you. We have six positions available for a paid apprenticeship in BBC Radio Production. The BBC Radio Journalism Apprenticeship Scheme combines training and study at Lambeth College in London with work placements in our radio production teams and will train you in every aspect of radio journalism, from how to create accurate, clear, and balanced reports, to how to write for radio, the web, and social media. The apprenticeship and work placements will be for 2 years, starting this September (2013) and ending in September 2015.* This experience will give you all the skills and knowledge you need to gain an Advanced Apprenticeship in Journalism (Level 3) and an NCTJ diploma in BBC Radio Production. The salary will be c. £11,000 in the first year. It will increase in year 2 to reflect the experience you've gained. By the end of the 2 years you will be in a good position to compete for jobs at Assistant Producer level in BBC Radio Production. The application process opens on 6 May 2013 and will close on the 20 May 2013. Requirements: It is essential you have a passion for speech radio, a positive, outgoing attitude with good communication skills, good writing skills and good IT skills. You’ll also need a maths and English GCSE or equivalent, or be prepared to study for qualifications in these subjects at college. Please visit http://www.bbc.co.uk/careers/trainee-schemes/radio-journalism-apprenticeship before applying. How to apply: To apply click here telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}