{
    "url": "https://www.nottingham.edu.my/Social-Sciences/Internships/Listings/Internship-CNN-International-(International-locations).aspx",
    "content": [
        {
            "p": "Time Warner College Associate Programme (TWCAP) Description: At Time Warner, we’re committed to developing the next generation of talent in the media industry. The Time Warner College Associate Programme (TWCAP) offers diverse and highly selective college and university undergraduate students the opportunity to work on challenging and meaningful projects in the areas of Digital/Technology, Finance and Marketing, as well as participate in various leadership development seminars. The intensive 10-week summer programme is offered at all of Time Warner’s primary locations, including New York City, Los Angeles and Atlanta. Participating students will receive a competitive salary and finish the programme with a broad understanding of Time Warner, its businesses and the media and entertainment industry. The paid internships are a crash course in hands-on business, political and general news reporting. Every intern will report to a senior editor and be assigned a journalist mentor to provide advice and guidance during the summer. They are expected to write regularly and deliver in-depth stories during their assignment. Interns will receive several days of formal training before they start work, focused on writing skills, journalism ethics and basic financial knowledge. They may also be able to take advantage of other, regularly scheduled training opportunities during the summer, depending on where they’re based. Eligibility: Time Warner encourages applicants who have a strong interest in the media and entertainment industry to apply. Ideal qualities for prospective interns include: enrollment as an undergraduate student at a highly selective college or university; a minimum GPA of 3.0; previous experience or exposure in one of the internship tracks; demonstrated leadership abilities; a positive attitude; and the ability to work in a team environment. TWCAP internships are best suited for undergraduate rising juniors and seniors. Applicants must be able to work at one of the company’s primary U.S. locations (New York City, Los Angeles and Atlanta). Please note: At this time, no visa sponsorships are available for this programme. How to apply: If you are interested in an intern position within Time Warner, go to the Careers site at http://www.timewarner.com/careers/ and apply for one of the TWCAP internship opportunities. If your resume and experience meets our criteria, you will be contacted to participate in a comprehensive screening and selection process. Time Warner is an equal opportunity employer and seeks interns from a wide range of experiences that reflect diversity in gender, ethnic and geographic backgrounds. telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}