{
    "url": "https://www.nottingham.edu.my/Social-Sciences/People/wendy.gan",
    "content": [
        {
            "p": "Director, Research & Knowledge Exchange, CELFE, Faculty of Medicine & Health Sciences Wendy holds a law degree, an MSc in Management and Information Systems and a PhD in Business and Management. She practised law in the areas of banking and intellectual property before moving on to further her studies at the University of Manchester. Her experience at the Asian Disaster Preparedness Center from 2000 to 2001 has provided valuable insights into the issues surrounding international organisations and their work in developing countries. Her research focuses on development informatics, sustainable tourism entrepreneurship and training and development. Wendy led the Business & Management Foundation since she joined the University of Nottingham Malaysia Campus in 2005 and until 2016, was also the Head of the Faculty of Arts & Social Sciences Foundation, providing strategic leadership and working with various external partners to deliver high quality pre-university education to over 200 foundation students in the Faculty. She currently serves as the Director for RKE in the Centre for English Language and Foundation Education. As a certified facilitator of the LEGO® SERIOUS PLAY® (LSP) Method and Lead Researcher of a Teaching Innovation Grant, Wendy is currently investigating the use of LSP in various educational and training environments, introducing LSP to colleagues and students in the classroom as a novel approach for facilitating creative thinking, problem solving and idea development. Wendy is a certified facilitator of the LEGO® SERIOUS PLAY® Method. Wendy is currently involved in teaching the following courses: Introduction to Law Computer Networks and Operations Decisions Wendy's current research is in the area of development informatics. Her PhD work investigated the information needs for community based tourism destinations. She is interested to see how… read more telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}