{
    "url": "https://www.nottingham.ac.uk/sport/performance-sport/para-sport.aspx",
    "content": [
        {
            "p": "At the University we have an established tradition of supporting and working with elite athletes who choose to study at Nottingham. As well as maintaining good working relationships with national governing bodies, we also offer sports scholarships to support elite athletes and help them to balance their academic and sporting lives. You can find out more about the support that the University offers to its elite athletes below. Pictured: James Hazell, 2023-24 Para Sport Scholar. The University has a Disability Sport Scholarship scheme for elite sportsmen and women looking to study and train at Nottingham. We offer three different levels of sport scholarships: Each scholarship level offers disabled athletes a complete package of support, which includes not only training and sports physiotherapy, but also financial, study and lifestyle support. You can find out more about these scholarships here. To express your interest in a sport scholarship at the University of Nottingham, please fill in our online form. This year we have awarded scholarships to five talented disabled student athletes. James is the University's first ever Greenaway (Gold level) para-scholar at Nottingham. He is an established member of the GB under 22s wheelchair basketball squad and has his eyes firmly set on competing in the Paralympics. Studying a Management Masters, James is an integral member of the University squad - not only playing in BUCS, but also supporting with coaching and officiating at local club games. Owen is studying for a Masters in Environmental Leadership and Management. He has won titles in BUCS Para-Swimming and is progressing up the national rankings. Owen is one of the established members of University swimming squad and also trains regularly with Nova Centurion. Simran is a third year Chemistry student and a para athletics scholar. She has one numerous BUCS medals on the track - indoor and outdoor. Simran trains regularly with the University Athletics club and is looking to make her mark again this year. Rob is a second year Computer Science undergraduate at the University and a GB Para Badminton athlete. He has been based in Nottingham for two years, training with the University squad and captaining the BUCS 3rd team. Rob has high ambitions around progressing his para-badminton career and is also looking forward to competing in the BUCS Inclusive Badminton competition in 2024. Emma is a first year Liberal Arts and Para Badminton student at the University. She has firmly established herself within the BUCS 3rd team and trains regularly with the University and Para Badminton GB squads. Emma is looking forward to making a positive contribution to the University's BUCS results and hopes to compete at the highest level internationally. To find out more about our scholarship scheme, you can visit the Sports Scholarship pages or contact the Disability Sport Officer at: e: adam.lever@nottingham.ac.uk t: +44 (0) 7977664607 Thomas Green is an elite para-athlete who was a sports scholar at the University from 2009-2013. An F32 club thrower, he combined training, international competitions and his studies with sporting successful. In this video Thomas talks about his experiences at Nottingham, particularly around the support he received from his academic department, and the Sports Development, Disability and Academic Support teams. There is the opportunity for disabled students to compete in some of the British Universities and Colleges Sport (BUCS) competitions this year. If you are already at a good standard or show some potential in one of the following sports, you could compete for the University with some of the respective clubs: We will do our best to support you if you would like to compete in any of these sports for the University. Please contact the Disability Sport Officer for further information. You can also find out more about BUCS’ plans for developing disability sport within higher education HERE. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}