{
    "url": "https://www.nottingham.ac.uk/sport/sport-facilities/david-ross-sports-village/physiotherapy.aspx",
    "content": [
        {
            "p": "We deliver a full range of physiotherapy sessions which helps restore quality of life by increasing function and movement after someone is affected by injury, illness or disability. The purpose of physiotherapy is to improve an athlete’s or patient’s physical wellbeing relative to the demands of their sport or activity and return them to a level of physical function necessary to return to full activity. Physiotherapy would initially consist of an in depth subjective (interview) assessment followed by a physical assessment which looks to diagnose the pain or injury and determine the cause of pain by examining not just the injured area but also other areas of the body which may make a patient more vulnerable to injury. This is then followed by outlining a detailed recovery plan which may include treatment and a progression-based exercise program which is suited specifically to each patient. Sports Rehabilitation includes all stages of injury management which may begin from immediate injury care during sports first aid and post event injury management right through to designing a sports specific return to activity protocol which ensures a patient has had a complete recovery and is ready to return to their desired sport. For more information about physiotherapy and our sports rehabilitation, please contact sportsinjuries@nottingham.ac.uk. *Student under supervision Booking your appointment couldn't be easier with our NEW online booking system! Select which sports massage or physiotherapy session you would like to book and then browse our available appointments to select a time that best suits you. For all other services, please email us at sportsinjuries@nottingham.ac.uk or call us on +44 115 74 87070 to book your appointment. Extracorpeal shock wave therapy is a conservative treatment method aimed to facilitate the healing process among injured soft tissue and tendons by delivering energy pulses (shock waves). Can be added to your in physiotherapy treatment for £20.00 per session. Can be added to your physiotherapy treatment for £12.50 per session. Can be added to your physiotherapy treatment for £12.50 per sessions. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}