{
    "url": "https://www.nottingham.ac.uk/sport/performance-sport/sports-scholarships/",
    "content": [
        {
            "p": "Our range of sports scholarships are aimed at providing an unrivalled level of support to the brightest and best talents in the sporting world. Find out more about our excellent scholarship packages below or complete the expression of interest form so we can get in touch with more information. Express your interest in UoN Sport If you are interested in joining the performance sport programme at the University of Nottingham, please complete the expression of interest form linked above. Once completed, one of our team will be in touch. As well as a reputation for academic excellence, we have a history of sporting success and are passionate about supporting promising athletes during their time at Nottingham. We have three sports scholarship packages as well as a range of specialist options. Please see below for details of what each package includes - please note financial awards denote the maximum award at each level and may vary. All scholars receive University of Nottingham Kit including a branded scholarship jacket, training jersey and backpack from Official Technial Supplier, PlayerLayer. £13,500 Take a closer look at our world-class training facilities right on your doorstep on campus. Learn more about our athlete support services in our Performance Sport Guide. An introduction to your UoN Sport scholars for 2023-24 academic year. To be eligible for a sports scholarship you must: be of academy, national or international standard in your sport or show strong evidence of future outstanding potential successfully achieve a place on a course at The University of Nottingham or be already studying here (all courses are eligible, both undergraduate and postgraduate) be a home, EU or international student at The University of Nottingham studying at least 60 credits a year. Priority is given to Olympic, Paralympic and Commonwealth sports and/or sports within the BUCS programme. Other sports considered on a case-by-case basis. For students applying for Medicine courses, applicants who are identified as ‘Elite/High-Performance Athletes’ by the University of Nottingham will be fast tracked to interview providing they meet the standard minimum academic and UCAT requirements. Applicants must have completed the the expression of interest form prior to the 1st December 2024. Please note, meeting the criteria does not guarantee you will receive a scholarship. See our Scholarship Terms and Conditions for more information. We're offering a range of undergraduate and postgraduate scholarships for table tennis or badminton athletes from China. Dr Deng Yaping won 18 world championships and four Olympic gold medals during her career. She was named Chinese Athlete of the Century and is one of the greatest table tennis players of all time. She also completed a masters degree at the University of Nottingham, graduating in 2003. The University launched this scholarship in 2013, with Deng Yaping's support, to honour her achievements and to help Chinese athletes achieve their academic and sporting ambitions. Find out more about the Deng Yaping Scholarship We actively encourage prospective and current students competing at an elite level within disability sport to apply for a sports scholarship at The University of Nottingham. We have a dedicated Disability Sport Officer to offer comprehensive personalised support to our disabled student athletes. Please register your interest here We're offering scholarships of £5,000 towards full-time tuition fees for international students at any study level with outstanding sporting ability. These new International Sporting Excellence Awards are separate from our package of sports scholarships at foundation, bronze, silver and gold level. To apply for this scholarship, you must: Find out more about the International Sporting Excellence Award In partnership with elite swimming club Nova Centurion, University of Nottingham Sport are offering seven swimming and para-swimming scholarships to University of Nottingham students. Scholarships include free access to the Nova Centurion performance swim programme, regular training in a 50m pool and a Speedo training kit sponsorship package worth £1500. Founded in 1979 in memory of Sheila Armstrong by her husband, Dr George Brown, Reader in University Teaching Methods, her mother, Mrs. Edith Armstrong, family and friends, the Sheila Armstrong prize awards £200 annually to an undergraduate or postgraduate students who has contributed substantially to the sporting activities of the University of Nottingham and who has displayed strength of purpose and courage. Sheila Armstrong was a British international tennis player, a member of the Wightman Cup team and a winner of the 1955 Junior Wimbledon tournament (bt. Béatrice de Chambure, 6–2, 6–4). As a mature student she obtained a first class honours degree and died tragically whilst completing her PhD. Sheila is pictured above (left), weight training alongside fellow GB teamate and three-time grand slam winner Shirley Bloomer. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/scholar-terms-and-conditions-.pdf"
    ]
}