{
    "url": "https://www.nottingham.ac.uk/sport/news/university-of-nottingham-triumphs-at-2024-bucs-cycling-hill-climb-championships",
    "content": [
        {
            "p": "Sport / News / University of Nottingham triumphs at 2024 BUCS Cycling Hill Climb Championships On November 2nd, 2024, the University of Nottingham Cycling team participated in the 2024 BUCS Cycling Hill Climb Championships held at Terrace Hill, Leicestershire. Competing against top universities from around the country, the Nottingham team demonstrated remarkable strength and determination. In a standout performance at the 2024 BUCS Hill Climb Championships, the women’s team which was led by Hannah Clough and Tilly Gurney, clinched the top spot to take home first place and the BUCS gold. Clough delivered a stunning performance in the Women’s Individual event, securing third place with an impressive time of 03:10.13, missing second place by just 0.3 seconds and falling short of the top spot by only 0.8 seconds. Gurney placed sixth, achieving a personal best on the challenging course, while teammate El King rounded out the team’s top ten finishes with a commendable tenth place. The men’s team also performed admirably, with Matty Dennis securing ninth place in the Individual category, supported by a strong showing from Barney Pickford. The club’s results marked their best-ever performance in BUCS Hill Climb history and earned a significant haul of BUCS points, setting an exciting foundation for the upcoming season. Reflecting on the day, Tom Haines, Head Coach, shared his pride in the team’s performance: “This was a great day for us. We had a large number of entries from the University, and the performance was excellent – standout was Hannah Clough, who again has shown her talent on a bike and was our first-ever podium in the event, backed up by Tilly Gurney, who did a massive PB on the climb. The open category was led by Matty Dennis and backed up solidly by Barney Pickford. The whole day was great fun, and again, the University showed its inclusivity through its breadth of entries and high-performance capabilities, winning the Female team title for the first time.” Clough shared her excitement, highlighting the atmosphere and support: “The first bit of the climb, you are almost on your own, and then just as your legs are really starting to burn, you hear and then see this massive crowd on either side of the road. It was amazing - cowbells, cheering, music, there was so much support, it was incredible, it really made you feel part of a great event.” Everyone at University of Nottingham Sport congratulates everyone involved in the cycling teams achievements! With training for BUCS track events at their home velodrome in Derby and further competitions in 2025, the team has much to look forward to. Stay updated on their journey by following them on social media here. You can also find out more about the performance cycling programme at the University of Nottingham here. This was a great day for us. We had a large number of entries from the University, and the performance was excellent – standout was Hannah Clough, who again has shown her talent on a bike and was our first-ever podium in the event, backed up by Tilly Gurney, who did a massive PB on the climb. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}