{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/classes/index.aspx",
    "content": [
        {
            "p": "We have a wide choice of fitness classes that are a great complement to any training programme. Make sure you keep an eye on the booking system to keep up to date with the latest changes! We'd love to know your thoughts on our current group exercise timetable, classes and offering. This helps us to continually update and improve our classes and the weekly timetables that we provide. Over the Christmas period (Monday 16th December 2024 to Sunday 12th January 2025), our fitness class schedule will vary from week to week. You can find weekly timetables for the period that covers all of our centres through the links below: We will endeavour to ensure that all classes run to the timetable above, however there may be some minor changes that have to be made over Christmas. You can always see an accurate timetable and book any of the classes included in our winter timetable by logging into your account here. Our diverse range of exercise classes are experiences, created, and developed by some of the leaders in the fitness industry. Members can take advantage of our signature LES MILLS class programme or enjoy the variety of HIIT, Tone, Speciality or Mind and Body classes. Strengthen your core, sculpt lean muscle, and increase flexibility with our on-site classes held at across our 3 Sports Centres at David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington Sport Centre. The world’s best music, best moves, and best instructors. Les Mills bring it all together to create life-changing fitness shaped by science. In a world where we are bombarded by conflicting and confusing health and fitness advice, evidence-based exercise programmes stand out. It began in 1968 when Les Mills set up a small family gym in Auckland. Three generations on, there are now millions who work out with Les Mills every day, all over the world. Zumba Gold is a lower-intensity version of the typical Zumba class At UoN Sport, our fitness team, alongside our partners, have devised virtual workouts and wellbeing guidance to help you stay fit and healthy from the comfort of your own home. We have also devised workout playlists, fitness bundles and a series of blog posts about staying fit, active and healthy. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": [
        "uk_pdf_files/WC-16-12-Christmas-GEX-Time-Table.pdf",
        "uk_pdf_files/WC-23-12-Christmas-GEX-Time-Table.pdf",
        "uk_pdf_files/WC-30-22-Christmas-GEX-Time-Table.pdf",
        "uk_pdf_files/WC-06-01-Christmas-GEX-Time-Table.pdf"
    ]
}