{
    "url": "https://www.nottingham.ac.uk/sport/staff-sport/staff-sport.aspx",
    "content": [
        {
            "p": "We offer weekly sports sessions for all abilities in our most popular sports, one-off events and there are also several staff-only sports clubs run by fellow members of University staff. Our great-value membership packages for staff offer access to our extensive health and fitness facilities across all four campuses. Our Staff Active sessions are open to all University of Nottingham staff, postgraduate students and mature students and members on full alumni and associate memberships (paid monthly or annually). There are several different sports to choose from and all abilities are welcome. The sessions are a mix of casual play alongside coaching depending on the sport. For budding golfers, we offer blocks of lessons throughout the year at subsidised rates with Trent Lock Golf Centre. Please email Louise Smith to register your interest. Our Staff Golf Away Day will also be held on Friday 11th July 2025 - Please email Louise Smith to register your interest. You don't need any previous experience of sport to attend a Staff Active session. You can come on your own or bring your colleagues with you! Staff Active sessions are included in our UoN sport and fitness membership. Pre-booking is recommended - bookings open three days before each session. Bookings will be loaded directly onto your staff or membership card so you can just swipe in at our turnstiles. You will need to set up an online Just Play account (free-of-charge) with your University email address- please select from the links below. Once you have set up an account, sessions are £4 each and can be booked by logging in here. You can activate your Just Play account from Thursday 3 October. Our Staff Badminton sessions are run weekly at David Ross Sports Village and are open to all staff! Sessions are game-play focused and give you the opportunity to play against like-minded people from your institution. Racquets can be hired from reception and shuttlecocks will be provided. The sessions are led by Mick, one of our friendly staff volunteers. Sessions can be busy so please check the online booking system and ensure you book a spot! Sessions are £4 for non-members or free for UoN Sport membership holders. Our staff UoN sport and fitness membership package offer great value for money as well as a convenient location for your workplace! We have a great programme of activities for kids and fun for all of the family. From children's swimming and climbing lessons, we've got you covered. Whether you're walking through campus, swimming in the pool, going for a run or cycling to work you can earn points through the free UoN Moves app. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}