{
    "url": "https://www.nottingham.ac.uk/Sport/News/News/News/University-of-Nottingham-top-the-medal-table-at-University-Sports-Championships.aspx",
    "content": [
        {
            "p": "Hosted at Loughborough University, BUCS Big Wednesday welcomed over 2,000 of the UK’s top student athletes to compete for national titles across 16 sports. With 20 Nottingham teams competing, hundreds of athletes and supporters made the short trip down the M1 in the hunt for trophies and they certainly weren’t disappointed. The Green and Gold took home 6 Championship wins in Women’s Hockey, Women’s Tennis, Women’s Table Tennis, Women’s Water Polo, Men’s Table Tennis and Men’s Fencing. The first national title of the day went to defending champions Women’s Hockey in an emotional 2-0 victory over Midlands rivals Birmingham, making it three championships in a row for the programme led by Head Coach Matt Taylor. Results then began to flood in; Men’s and Women’s Table Tennis won their seventh consecutive titles in yet another dominant display that never looked in doubt. In the Men’s competition, opponents NTU Sport made it an edgy start for coach Kelly Sibley’s four players, with their lead sitting at just 1 rubber going into the third round of match ups. The squad kept their cool, however, and it was Shayan Siraj who confirmed their national champion status yet again with a measured singles win taking the overall score to 9-5. Next up, the Women’s pairing of Tin-Tin Ho and Annie Meng were however untroubled by their Durham opponents and quickly cruised to a 3-0 victory, with the final two match ups not needed. Also at Victory Hall, Men’s Fencing avenged their 2023 finals defeat against Durham, edging the gold away from their opponents in the dying moments of the match up much to the delight of the vociferous partisan crowd. With the score tied at 113-113 in points, it was Nottingham who were crowned champions thanks to their higher score across two of the three weapons contested. Across the other side of campus, Women’s Tennis survived a marathon 6-hour match up against home favourite’s Loughborough to take gold. Fittingly it was BUCS Doubles champion and captain Rebecca Stolmar who sealed the deal with a convincing victory over her singles opponent. Water Polo served up a big upset in the Swimming Pool by narrowly edging to a 12-10 victory against Durham. Nottingham had to come from behind in the fixture and the girls avenged their 2023 final defeat and took the gold medal in front of a sell-out crowd. Nottingham also had a further 4 teams who earnt themselves runners up medals in Championship events, with Men’s and Women’s Lacrosse taking the silver and Wheelchair Basketball earning themselves a runner’s up medal with a valiant performance against Worcester. Despite a mammoth effort in front of a huge Nottingham crowd, it wasn’t to be a second title for Men’s Volleyball who fell 1-3 to a physical Durham side. With a young squad, many of whom will return next season, they’ll be a top pick for another championship title run next season. In the trophy and vase competitions, for teams competing in the second tier of BUCS competitions, Nottingham also had a hugely successful day. Wins came from Men’s and Women’s Table Tennis 2s, Men’s Squash 2s in the Trophy and Men’s Hockey 2s in the Vase. Tin-Tin Ho, Player of the Match for our Championship winning Women’s Table Tennis squad commented: “We’re really happy with the win - we played well so it’s nice to put in a strong performance. We’ve been training hard in preparation, playing lots of competitions, and Annie’s just returned from abroad, so it’s been a busy but really successful time for us.” Dan Tilley, Director of Sport, added; ‘ “I’m incredibly proud of all our athletes, coaches and staff that have worked so hard to reach these finals and to have six national champions, as well as our Trophy and Vase winners and other finalists is incredible.” “To be the top university at BUCS Big Wednesday and for team sport overall in the UK is testament to the hours of hard work and endeavour across the whole season leading up to today. There’s been so many powerful moments today that those involved will remember for a long time to come.” The team season might be drawing to a close but there’s still plenty of action still to come for the University of Nottingham with Golf, Cricket and Beach Volleyball all looking to add to the domestic trophy cabinet. Nottingham will also be hoping to feature on the international stage at the European University Games in Hungary this July. For more information on Performance sport at the University of Nottingham, visit www.nottingham.ac.uk/sport/performance or contact us at sport@nottingham.ac.uk. For a full list of results and round-up from the Championships, visit our dedicated web page: BUCS Big Wednesday 2024 For media enquiries, please contact Mark Bullock, Sports Marketing and Communications Manager, at mark.bullock@nottingham.ac.uk David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}