{
    "url": "https://www.nottingham.ac.uk/Sport/Commercial/Corporate-Sports-Days/Coporate-Sports-Days.aspx",
    "content": [
        {
            "p": "Our Corporate Sports and Wellbeing Day package offers business and teams a unique opportunity to engage in a full programme of competitive sports as well as taster activities to support health, wellbeing, inclusivity and teambuilding. This package includes full event management and delivery of all sport and taster activities by UoN, sports facilities and equipment. Every aspect of your Corporate Sports and Events Day will be taken care of including sorting everyone taking part into mixed teams to further encourage networking and teamwork with colleagues from different departments within the organisation. We also have a range of catering options and bespoke menus available, for breakfast, lunch and dinner depending on your organisations size and preference. These include packed lunches, hot and cold buffet menus, barbecues and other refreshment options. All participants will also receive a team t-shirt with your organisations logo on to wear throughout the day and keep as event memento. We can also provide professional photography for the day. Archery Climbing (on our indoor 12m climbing wall) Rounders Football Ultimate Frisbee Table Tennis Snooker Transport logistics and parking support Event photography T-shirts On-site changing facilities Raffle and evening entertainment Dressing the venue for a bespoke experience Corporate Sports Day packages start from £100 + VAT per head for a 1-day event running from 8am - 7pm. To find out more about our bespoke Corporate Sports Day package, please enquire below. Since 2016, we have been delivering annual Sports Days to market leaders RSM and provided a unique opportunity to take part in competitive sport and tasters. Our state-of-the-art facilities can be transformed to host sporting competitions and external events and can help you stage an event like no other. Find out more about our exciting partnership and sponsorship opportunities at University of Nottingham Sport."
        }
    ],
    "pdf_files": []
}