{
    "url": "https://www.nottingham.ac.uk/sport/schools/schools.aspx",
    "content": [
        {
            "p": "We work closely with a number of schools to deliver sessions within your school setting or here at the University of Nottingham to enhance your physical education provision and inspire your students to find out more about university life. Schools can also hire our award-winning facilities, including our climbing wall and swimming pool. We offer a range of activities for schools here at University of Nottingham Sport, with options for primary and secondary age groups. Delivered by our professional staff alongside a team of trained student leaders, our programmes are ideal for enhancing your Physical Education offer, showcasing university life and raising aspirations to move onto Higher Education study for your pupils. We work closely with the University's Widening Participation team to deliver these activities, all of which are free-of-charge to your school. Bring your class to meet our fitness team and students to learn about healthy living and try new sports. Open to selected primary schools. Get ready for a University adventure! Open to selected primary schools, pupils will have a go on our climbing wall, before heading outside on campus for an orienteering challenge. Open to Year 12 students in Nottinghamshire, this programme raises awareness of student life and aspirations to attend university for your pupils. Sessions include sports tasters, workshops and campus tours. Open to Year 11-13 students in the East Midlands and North, this free programme offers your students the chance to experience life as a student-athlete. Sessions include athlete testing, recovery and sports tasters, plus an optional residential. Supported by our professional staff, our Leadership Academy students are trained to deliver fun and engaging sport sessions to pupils with additional accessibility requirements. These are free-of-charge and can be hosted at your school or at our venue. We have three campus sports centres including our flagship David Ross Sports Village venue. Schools can hire out our extensive range of facilities to enhance your physical education offer or to run one off events such as sports days. Options include our sports halls, 3G pitches, swimming pool and climbing wall. To find out more, please contact our Bookings team at uons-bookings@nottingham.ac.uk. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}