{
    "url": "https://www.nottingham.ac.uk/sport/get-active/student/leadership-academy/discovery-days.aspx",
    "content": [
        {
            "p": "Discovery Days offer local Nottinghamshire primary and secondary schoolchildren the chance to experience University life first hand through a varied range of fun sessions, including sporting activities. Run in partnership with the University of Nottingham's Widening Participation team, the events offer young people the inspirational opportunity to visit a University, increase awareness of higher education options, meet current students and to stay healthy and active. They take place throughout the year – October to July, with an outdoor version during the summer months. The programme offers University of Nottingham students an ideal opportunity to develop important leadership skills and gain real work experience in the education and sporting sector. Volunteers will deliver sport specific taster sessions, usually hosted at the David Ross Sports Village Alongside other members of your sports club, you will deliver the basics of your sport during an introductory session with the schoolchildren ranging from 9 to 17 years old. You'll use fun drills and games, which we can support you to design. To compliment the on campus Discovery Days, there is also adhoc in school delivery which you may be invited to support. Discovery Days generally run from 9am - 3pm on weekdays. Exact dates are set at the start of the academic year Volunteers will be required to deliver between 1 – 6 hours depending on the exact format of the day. And volunteers are asked to a minimum of one Discovery Day per year In school delivery is more varied and we can discuss this with you individually All volunteers receive training, support from a member of UoN Sport staff, lunch voucher, a Leadership Academy T-shirt and the opportunity to trade your volunteer hours for merchandise and kit via our Hours Trade incentive scheme Please follow the links below to register your interest in the Primary Schools or Secondary Schools programme. Being part of this program allowed me to work with a variety of different ages and year groups. It gave me the opportunity to work on my communication and teaching methods as the way you would teach a 18 year old is completely different to the way you would teach an 8 year old. I found the whole programme enriching and fulfilling. I felt that I made a difference in each young person’s life and gave them the opportunity to do a sport they may have never done before. This programme taught me how to be a better session leader and built my confidence in leadership but also more broadly within the university community. You will need to be confident delivering your chosen sport to the schoolchildren visiting campus. To get involved you can express an interest to your club committee, or if you're not a member of a club or your club is not yet involved, please contact Natalie Braisby at natalie.braisby@nottingham.ac.uk. You can find all of our volunteering opportunities here. Students delivering on campus will not be required to have a DBS check. Volunteers that visit schools will be required to complete a DBS check. Our team will help you with this process and it is at no cost to you. All volunteers are requested to complete online safeguarding training before delivery. We also offer various other workshops to help support your general leadership skills. We ask that you are suitably qualified or experienced in the delivery of your sport. Primary Discovery Days generally run 9am-3pm with up to 180 children experiencing a rotation of sports throughout the day – you may deliver up to 6 x 30 minute sessions during the day. Secondary Discovery Days have more bespoke schedules but generally require delivery of 1 or 2 x 60 minute sport taster sessions again sometime between 9am-3pm. Yes - the programme is suitable for anyone with accessibility needs. All our venues are accessible and we can adapt your role to suit. Please get in touch with us to discuss any requirements. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}