{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/personal-training.aspx",
    "content": [
        {
            "p": "Our motivated and dedicated trainers specialise in helping you to achieve your goals, utilising our state-of-the-art facilities. Personal Training is available to all our UoN sport and fitness members as an additional paid service. Personal Training sessions at University of Nottingham Sport have really helped me to achieve my goals. My programme has been specifically designed to enable me to get the most out of my time in the gym, whilst being very enjoyable too! Whether you are new to the gym or experienced and just looking to change things up, working with a Personal Trainer can be hugely rewarding. Our highly educated personal trainers will tailor your workouts to your specific needs and help you build confidence knowing you are performing the exercises safely and correctly. They will be there to push and motivate you, remind you of the goal in mind when things get tough. Consultation Expect to answer a series of questions based on your health and lifestyle. It is important to be honest so we can create the best personalised programme for you. Personalised programme Your Personal Trainer will create a fun and challenging programme tailored just for you. This programme can be adapted at any point if you or your trainer feels something is not working. Whilst it is important to choose exercises that are going to help you achieve your goal, it is equally important that you enjoy the workouts, so make sure you tell us about any exercises you really enjoy. Nutrition and lifestyle guidance Yes, that one hour in the gym with your trainer is important but we also look at the 23 hours outside of the session. Your Personal Trainer will be able to talk to you about your current lifestyle and nutritional habits and give you some pointers to help keep you on track. One-on-one session These sessions form the basis of our Personal Training programme where your Personal Trainer will take you through the programme they have designed for you. They will keep an eye on your form to make sure you are performing every exercise properly, maintain a log of your performance and push you to the best of your ability. Ongoing support Our team is there to help beyond your sessions - you can drop them an email if you have any questions or queries about your programme or need a little extra motivation! We have a variety of different Personal Trainers to choose from, which means you are sure to find someone right for you. We’re lucky to have a fantastic range of Personal Trainers who all have their own unique teaching style, personality and strengths. Our Personal Trainers have a variety of experience in different fitness areas and often hold additional qualifications, for example weightlifting, nutrition and exercise mechanics. Finding the right personality match is also important and we have both male and female Personal Trainers on hand to choose from. Our instructors have provided a small bio about their specialities below, and you can contact that instructor with one click too! To find the best fit for you, please chat to our fitness team at any of our three fitness suites and they’ll be happy to speak it through with you. Or, if you already know which Personal Trainer you’d like to work with, please contact them via the links below. Our trainers can be adaptable to suit your needs with sessions able to be booked at both David Ross Sports Village and Jubilee Sports Centre. These sessions will usually take place in the fitness suites of the respective facility. If sessions are required at Sutton Bonington Sports Centre then we kindly ask for sufficient notice in advance, and our team will confirm if the request can be accommodated. If you are looking to book in for a single or block booking of personal training sessions and know which trainer you would like to train with, then simply click on the relevant contact button below and email over as much information about the sessions that you require as possible - for example, the amount of sessions and which times suit you best. Our instructor will then be best placed to get you booked in for your session(s). Sessions can also be booked in person at one of our fitness centres with a member of the fitness team. If you are unsure on which trainer you would like to book in with, then please visit one of our fitness centres where you will be able to chat to our fitness team about your goals. The team can then best advise on who would be most suited to help you achieve your goals and get your session(s) booked in. You can purchase a range of Personal Training packages depending on how many sessions you would like. Purchasing more than one session allows you to build a more comprehensive plan, but also provides better value for money. Sessions for groups of two people are also available with pricing plans also outlined below. We are delighted to offer those looking to take advantage of our personal training sessions the option to book regular sessions via monthly direct debit. To book your sessions through this option, please speak to a member of the team when you are next at one of our centres, or through your trainer at your next session. Sessions Amount to be DD per month X4 sessions (one per week) £115 X8 Sessions (two per week) £220 X12 sessions (three per week) £325 Our team of highly qualified personal trainers can help you achieve your goals. To contact one of our personal trainers, select their contact details below. Working together, I am confident that we will be able to create a game plan and strategy to help you achieve your goals in a realistic, sustainable – and more importantly, enjoyable way. My main aim for all my clients is to be functional and fit - both physically and mentally. Helping you to develop a better relationship with health and fitness. Using my 10+ years of experience with nutrition, weights and conditioning. Passionate personal trainer creating a fun, enjoyable fitness atmosphere. My goal is to make you feel comfortable, ensuring a positive environment where achieving your fitness goals becomes an exciting journey. With a background in sports and fitness, I take a focus on functional strength, mobility and conditioning, putting emphasis on finding a sustainable training method that builds confidence within the gym and flexibility around a busy lifestyle. Sometimes you may have to do something you don’t like to get results, but mainly you should do something you enjoy to build sustainable and positive training habits. I believe that fitness shouldn’t be a chore, it should become part of your lifestyle. My mission is to help educate people to achieve results without dreading their workouts. \"Healthy\" comes in many varieties and so does training for different body types. I will work with you, your goals, abilities, utilising the things you enjoy to help you reach what \"healthy\" looks like for you in the most positive and enthusiastic way! Exercise not only changes your body, it changes your mind, your mood and your attitude. Exercise secures priceless memories. The most important part of any training programme is consistency. I will educate, motivate and help you build the confidence to make permanent lifestyle changes in and outside of the gym. At the University of Nottingham, we have tailored membership options available to support your health and fitness journey. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}