{
    "url": "https://www.nottingham.ac.uk/sport/membership/vetschoolsportsmembership.aspx",
    "content": [
        {
            "p": "Whether you want to gym, swim, climb or compete in one of our sports clubs - our student sport and fitness membership has got you covered. Students can use all three of our facilities at David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington and over 80+ University gyms around the country when they head home. We offer a bespoke package for dual-intake Veterinary School students that runs in line with your course dates. Access to all three of our campus locations; David Ross Sports Village, Jubilee sports centre and Sutton Bonington sports centre. Three fitness suites equipped with the latest equipment Fitness inductions and 1-2-1 programme reviews Over 150 group fitness classes every week Indoor climbing and bouldering wall Eight-lane 25m indoor swimming pool Indoor courts; squash, badminton, basketball, volleyball and pickleball Outdoor courts: Tennis, Netball and 3v3 basketball Beginner and social sport sessions with Just Play UNIversal Gym membership (free access to over 80 gyms nationwide) Option to add up to three direct relatives to your membership at the same great value rate #FindYourActive with us with our great value sport and fitness membership! Your membership will be valid from 1 March 2024 - 31 December 2024, ensuring you make the most of every second on campus this academic year. Please see you options below to purchase your membership. If you've never held a UoN Sport Membership before, this is the option for you. If you are a returning student who has purchased a membership with us previously, please visit a sports centre of your choice to join, call 0115 7487000 or e-mail membership@nottingham.ac.uk. This membership is for April intake for the School of Veterinary Medicine and Science. If you are in the September intake for the School of Veterinary Medicine and Science, you can purchase the UoN sport and fitness membership. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}