{
    "url": "https://www.nottingham.ac.uk/sport/news/news/news/university-of-nottingham-dominate-at-national-university-finals-on-home-soil.aspx",
    "content": [
        {
            "p": "The University of Nottingham’s sports teams took six national championship titles in a record-breaking day of action at the annual BUCS Big Wednesday finals, more than any other University. The University’s Women’s Table Tennis, Men’s Table Tennis, Women’s Hockey, Men’s Hockey, Women’s Lacrosse and Women’s Football all won their finals on 22 March to be crowned British Universities and Colleges Sport (BUCS) champions on home soil in Nottingham. Hosted at the University of Nottingham for a third consecutive year, the popular BUCS Big Wednesday event, the largest student sporting event in the UK, sees thousands top young athletes descend on the city for over 50 finals in 16 different sports. The Women’s Table Tennis pairing of Payet and Meng were the first off the mark with a comprehensive 5-0 win in their Championship match up against Imperial, followed swiftly by their Men’s squad who navigated a slightly trickier match up against neighbours Nottingham Trent to win 10-4. This now marks 8 years unbeaten for the University of Nottingham table tennis teams as they dominate top level table tennis in the UK. Attention then turned to the Nottingham Hockey Centre, where Nottingham once again had both their Women’s and Men’s teams competing. The Women’s side led Exeter for the majority of the game and looked in control throughout taking their second consecutive BUCS Big Wednesday final. Defending champions Loughborough were the opponents for our Men’s squad and the Green and Gold were out for revenge having fallen to a last minute winner to the same side in 2022. This time, their fortunes were reversed and after a thrilling encounter, Max Anderson found the back of the net with a minute to go to secure a dramatic gold for his Nottingham side. Back on the 3G at David Ross Sports Village, defending champions Women’s Lacrosse ran out in front of a sold-out crowd looking very confident. They continued in this vein, holding Exeter at bay and registering a confident 11-6 victory to pick up the Green and Golds 5th championship title of the day. Finally, Women’s Football took to the field at Basford FC under the lights against hot favourites Loughborough. Promoted to the Premier tier just last season, the Nottingham side have had a dream season and delivered a performance to top their year – cruising to an emphatic 6-0 victory against their shell-shocked rivals. A real highlight to end a perfect day of action in Nottingham. Denise Payet, BUCS table tennis champion and Commonwealth medallist, commented; \"This has topped off a perfect season and my last game for the University of Nottingham. This is my first Championship team title and I really enjoyed today and playing alongside Annie. We felt confident, we were playing well and we're delighted with the 5-0 score line.\" Nottingham were also well represented in the trophy finals – the finals of BUCS Tier 1 competitions – also taking place as part of the BUCS Big Wednesday event. The Green and Gold demonstrated huge depth in our female squads in particular, with confident victories from Women’s Basketball, Women’s Squash 2nd team, Women’s Table Tennis 2nd team, Women’s Lacrosse 2nd team and Women’s Tennis 2nd all on home soil. A further eight teams representing Nottingham across the finals took home very commendable silver medals; American Football (Championship), Women’s Badminton (Championship), Women’s Fencing (Championship), Women’s Water Polo (Championship), Women’s Volleyball (Championship), Men’s Lacrosse (Championship), Men’s Hockey 2nds (Vase), Men’s Rugby League (Trophy), and Men’s Squash (Trophy). Attention will now turn back to the final BUCS sports of the season in the race for the overall points trophy, as well as focus on European competitions for those national champions who now qualify. For full results and to watch back all our live streams, visit www.nottingham.ac.uk/sport/whats-on/bucs-big-wednesday. For more information on University of Nottingham's performance sport programme, visit www.nottingham.ac.uk/sport/performance. For all media enquiries, please contact Mark Bullock, Sports Marketing and Communications Manager, at mark.bullock@nottingham.ac.uk. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}