{
    "url": "https://www.nottingham.ac.uk/Sport/Performance-Sport/Focus-Sports/Performance-netball.aspx",
    "content": [
        {
            "p": "The University of Nottingham Netball Club is one of the most popular sports within the sports clubs at Nottingham and continues to grow in depth and talent each year throughout all 7 BUCS teams. Players studying at University of Nottingham join one of the university’s fastest developing programmes, with access to some of the best netball facilities in higher education sport as well as establishing strong links between the University and England Netball. As a result of this, the facility hosts annual events such as NPL competitions and England Roses training camps. All squads compete in high performing leagues including the 1st team who have secured their place in the BUCS Premier North league since their promotion in 2018/19, and have continued to uphold their place in the highest BUCS competition in the country. The performance programme entails various sessions including both on and off court training, a strength and conditioning programme, and classroom based sessions, as well as 1:1 coaching opportunities with the Head of Performance Netball, Paige Reed. We currently have an abundance of high performing student-athletes with the example of Kelechi Ambros who currently plays in our BUCS first team and has represented England Roses Academy, and has featured within Superleague clubs in recent years. Talented athletes including Leeds Rhinos Super League player, Emily Hollingworth, and England U19 International, Ally Housley, are amongst some of the clubs most recent alumni stars. High Performance Zone for Strength & Conditioning Paige Reed joined us in 2023 as our new Head of Netball. Paige currently plays in the Netball Super League for Manchester Thunder and is a part of the England Roses programme. We are delighted that Paige has decided to take her first full-time coaching role alongside her playing career with us at University of Nottingham Sport."
        }
    ],
    "pdf_files": []
}