{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/sports-injury-clinic",
    "content": [
        {
            "p": "The Sports Injury Clinic is a state-of-the-art rehabilitation facility located within David Ross Sports Village at the University of Nottingham. The Sports Injury Clinic provides an outstanding treatment environment for staff, students and the local community, whilst also delivering cutting-edge support for our elite athletes and scholars. We pride ourselves on delivering the highest quality diagnosis, assessment and treatments and offer a range of different services to support you through the next steps in your journey. Our services are available to all and if you are a sport and fitness member you can access special discounted rates. Get in touch to find out how we can help get you back to your best and introduce you to a whole new world of activity.” Physiotherapy can help to restore quality of life by increasing function and movement. We deliver a range of sports massage sessions which involve manipulation of soft tissue to alleviate pain. Gait Analysis is the analysis of strike and roll off technique to improve movement efficiency. Hydrotherapy is the use of exercise in a heated pool to treat a variety of conditions. Our Concussion Clinic can help support you during your concussion injury and help you to return to daily life activities as well as your sporting activities. We have a team of expert clinicians on hand ready to deal with your enquiries, bookings and to help shape your pathway to recovery. Arranging an appointment with the Sports Injury Clinic could not be simpler. To book: Sports massage sessions can now be booked through our online booking portal. Sports Injury Clinic David Ross Sports Village University of Nottingham University Park Nottingham NG7 2RD t: +44 (0)115 74 87000 e: sport@nottingham.ac.uk what3words: output.prove.unique Find out more about our opening hours here. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}