{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/climb/",
    "content": [
        {
            "p": "Our climbing and bouldering wall at David Ross Sports Village is perfect for all levels of climbers. You can book a session online or join a course to build your skills with our expert climbing team. Our programme offers options for complete beginners, intermediate and advanced climbers as well as bespoke sessions for children. Our climbing wall is 12m high with over 50 routes, permanent top ropes, space for lead climbing and 3 auto belays. The bouldering wall is 3.5m high with over 60 graded problems. There is also a 250 Moonboard which has over 12000 problems from V1 upwards. If you are a new user you first need to register with University of Nottingham Sport as either a full Sport and Fitness member or as a Pay As You Go member. Access to the wall for ‘competent’ climbers is via a two-stage registration process: The first stage is a competency test to ensure you have sufficient experience, skills and knowledge to use the wall safely. This will be through a practical assessment and questions. If you are planning on using the roped climbing area you will need to demonstrate proficiency in putting on a harness, tying on and belaying. If you plan to boulder we will ask you some bouldering safety questions. If you plan to use the auto belay we will check your proficiency in putting on a harness and checking the auto belay is safe to use. The competency test is available to book on the bookings area of the UoN Sport members portal. The timetable of available slots is shown once you click onto Competency Test. The second stage is through an online Acknowledgement of Risk form. This provides further information such as Rules and Conditions of Use and a short Safety Video. The climber must confirm understanding at various stages within the form. Once both parts have been completed correctly you will be given eligibility to use appropriate parts of the wall subject to your experience, skills and knowledge. If you are unable to complete this process, you will be advised on which sessions you need to attend to gain access to the wall. Do not complete the registration form until you have completed the competency test. Casual climbing bookings can be made on the membership area or at any Sport reception. Please note that from time to time parts of the wall may be out of use for maintenance, route setting or external groups. This information is detailed above, via the Climbing Wall Newsletter and Climbing Wall Facebook group. Climbing shoes must be worn for casual climbing sessions. There are various ways in which you can start your climbing journey. If you would like a taste of what climbing is all about why not book onto one of our Just Play Climbing or Just Play Bouldering sessions. Our experienced instructors will get you off the ground in no time and guide you as you gain confidence and skills on your journey to becoming an independent climber. These sessions are also a great way to meet new friends in a fun session. This session is also a good way to refresh your skills if it has been a while since you last climbed. If you are feeling confident in your abilities we have two induction sessions where we can get you on the wall with the minimum of instruction. The Bouldering Induction and Auto Belay Induction will give you the skills to use the bouldering wall and auto belay without further supervision. If you want the 'Full Monty' why not book the 'Learn to Climb' session. This will give you all the skills to use the whole wall unsupervised. Subject to reaching the required level of competency by the end of the 3 hour session. All these session are available to book on the UoN Sport Members Portal. If you have any questions about any of these sessions contact the Climbing Wall Team Member & Casual Climbing All our student, staff, alumni and associate members can access our climbing wall free-of-charge. To ensure you're ready to climb, all you need to do is to ensure that you complete a competency test and acknowledgement of risk form, check availability through our member login and book your space on the wall at your desired time. See also access information above. Pay-As-You-Go To check availability for climbing sessions and to pre-book, please log in to your member or pay as you go account or call the David Ross Sports Village reception team on +44 (0)115 74 87000. Climbing is a fantastic physical and mental challenge. Our expert climbing team can run you through the basics of climbing or for the more advanced, teach you the fundamental skills of climbing movement, suggest improvements to your technique and demonstrate more advanced skills. We offer a variety of sessions and programmes to introduce children to climbing and give them the confidence and support they'll need to get to the top! These sessions are specially designed to support disabled students and students with long term health conditions to use our climbing and bouldering wall. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}