{
    "url": "http://www.nottingham.ac.uk/sport/shwp",
    "content": [
        {
            "p": "In partnership with the University’s Accommodation and Residential Experience team, the Active Living package is for students living in University halls on University Park and Jubilee campus, plus Dagfa and Varsity. Included within your accommodation, your Active Living package offers the same benefits as our UoN sport and fitness membership, plus a programme of exclusive sessions and events just for you and your new hall mates! Our sport and fitness membership which includes our fitness suites, pool, climbing wall, indoor and outdoor courts and over 150 classes. Access to all three of our campus locations; David Ross Sports Village, Jubilee sports centre and Sutton Bonington sports centre. Free Just Play sessions - choose from over 30 different sports on our timetable Hall sport tournaments and leagues as part of our popular intramural sport (IMS) programme A range of sports, classes and taster sessions in your halls including gym challenges and dance classes. Fun campus activities from our popular Halls' Night In to a Santa Run! An exciting programme of off-campus trips to get to know Nottingham and our surrounding area. Membership of the BUCS UNIversal scheme so you can workout in over 80 University gyms UK-wide. Option to add up to three direct relatives to your package at our great value student rate Ancaster, Cavendish, Cripps, Dagfa House (self-catered), Derby, Florence Boot, Lenton and Wortley, Lincoln, Nightingale, Rutland, Sherwood, Varsity (self-catered) Melton, Newark, Southwell (self-catered) Our Active Living team offer a packed schedule of fun events for you and your hall friends including the hugely popular Halls' Night In, white water rafting and even a Santa Run! Events take place both on and off-campus. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": [
        "uk_pdf_files/Active-Living-Membership-Terms-and-Conditions-23-24-UoNSport.pdf"
    ]
}