{
    "url": "https://www.nottingham.ac.uk/sport/get-active/student/leadership-academy/",
    "content": [
        {
            "p": "Want to combine your degree with practical and transferable life skills that you can then take forward in the career of your choice? From volunteering in local schools, coaching in clubs, engaging the local community or working on both national and international events, there is a range of opportunities that you can get involved with through our Leadership Academy. Our Leadership Academy offers you the chance to develop your leadership skills through sport with real opportunities on campus and in the community. It's the ideal opportunity to build your CV particularly if you're considering a career in management, education or sport. Roles include working with local school children, coaching your fellow students and volunteering at major sporting events on campus. No previous experience with sport or volunteering is required and our Leadership Academy team offers extensive support along your leadership journey. Leaders can access our mentoring programme as well as funding for recognised coaching and leadership qualifications. We have a fantastic range of programmes that student sports leaders can get involved with. Click on the links below to find out more about each role or browse the full listings of our opportunities or by downloading our Leadership Academy App. Discovery Days offer local Nottinghamshire schoolchildren the chance to experience University life first hand through a varied range of fun sessions, including sporting activities. Sport for Good Nottingham uses the power of sport to drive real social change in the local community. Our leaders work with schoolchildren to develop life skills, design and undertake social action projects. Empower Leaders are women, trans and non-binary identifying student leaders work with girls in local schools to empower them to get active and inspire their peers. Join our network of leaders supporting our Inclusive sport team across a range of initiatives including on campus sessions, delivering to local schools and assisting para-sport major events. We host several major national and international events every year. These events offer students the opportunity to volunteer in a range of support roles including ticketing, team liaison, media and officiating. Our team is committed to providing education and training opportunities for our students to support their involvement in all areas of the Leadership Academy. We host a range of workshops as well as funding to help build knowledge and skills alongside practical experience. It's such a powerful moment when you see a young person's eyes light up when they master something new or difficult. I gained a lot personally from volunteering but seeing the impact I made on others made it so worthwhile. We run training sessions at the beginning of each semester for all volunteers and all volunteers working with young people also complete Safeguarding training. Students volunteering at major events may also be asked to complete additional training with the event organisers. We work closely with the University's Careers team to help you make the most of your volunteering experience to boost your career prospects. Our Leadership Academy Qualification Fund offers financial support towards a coaching qualification or other recognised award. The Fund is currently closed for the 2024/2025 academic year. If you have any questions, please contact Joanne Turner. We highly value the commitment of our Leadership Academy volunteers. Our volunteering portal allows you the opportunity to track your volunteering hours and earn rewards for your time! No, not at all. Students in any year of their studies, including final year, may join the Leadership Academy. Postgraduate students are also very welcome. The Leadership Academy Qualification Fund offers financial support to current University of Nottingham students to complete a recognised sports related qualification e.g. coaching, leadership, officiating, CPD and sport specific first aid. The fund offers a fantastic opportunity to gain a recognised sports qualification during your studies and the chance to work with your peers and/or the local community to develop your leadership skills. The fund opens at the start of the academic year and lasts until the funding has run out. Applications are invited from individual students and club groups. For the full application criteria and to apply, please click here. The Leadership Academy caters for all levels of experience and is designed to help you build your skills. It doesn't matter if you haven't led an activity or sports session before and no previous sporting experience is necessary. Our team is committed to providing education and training opportunities for our students to support their involvement in all areas of the Leadership Academy. We host a range of face to face and online workshops to help build knowledge and skills alongside practical experience. Upcoming workshops for 24/25 academic year include; For more information and to register, please contact joanne.turner@nottingham.ac.uk Each programme will require different levels of time commitment. While we try to fit around other commitments, there will be some specific requirements for training and delivery dates. We do advise that students will get out of the programme what they put in and we will be there throughout to support leaders. We work closely with a number of schools to deliver sessions within your school setting or here at the University of Nottingham to enhance your physical education provision and inspire your students to find out more about university life. Schools can also hire our award-winning facilities, including our climbing wall and swimming pool. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}