{
    "url": "https://www.nottingham.ac.uk/sport/schools/secondary-discovery-programme.aspx",
    "content": [
        {
            "p": "Open to Year 12 pupils, our popular Secondary Discovery Days aims to raise awareness of student life and increase aspirations to attend university for your pupils. Hosted in part at our flagship venue, the David Ross Sports Village, we deliver a combined sport and academic focus. This outreach programme is free-of-charge for all East Midlands schools and colleges where at least 30% of your group qualify for free school meals. Our Discovery programme covers 2 campus visits for your group, all free-of-charge. The series is delivered by our professional staff alongside University of Nottingham student ambassadors. Transport to and from University of Nottingham is covered for your group and all pupils will receive a University of Nottingham Sport goody bag. We do ask that you bring lunch, drinks and snacks with you. Pupils will complete 2 campus visits within 3 months (either between October and December or February and May) To find out more about our Discovery programme for secondary schools, please contact Natalie Braisby at natalie.braisby@nottingham.ac.uk. We've also included some answers to our most frequently asked questions below. All aspects of the Discovery Day were really valuable - seeing the students learning new skills and improving in confidence was wonderful. Return coach transport to and from your school/college is provided by the University of Nottingham - we will book this once your staff/pupil numbers are confirmed. Please make us aware of any parking and pick up/drop off requirements for your school/college. If you have your own transport, e.g. school minibus, you are welcome to park free of charge at the David Ross Sports Village. Yes, we ask that the same cohort of students attend both Discovery Days. This helps us to have a meaningful impact on their knowledge of student life and aspirations to attend University. The funding used to run our Discovery Day series free-of-charge is linked to encouraging pupils from a low socio-economic background, where progression to higher education is lower. We are therefore using the free school meal criteria as a key identifier. We ask that pupils please come ready to take part in sport or have a change of clothes. School uniform is at the individual school’s discretion. Please also bring lunch, snacks and a drink for the day. Yes - the programme is suitable for pupils with accessibility needs. All our venues are accessible (link to facilities page) and we can adapt all the sessions as needed. Please get in touch with us to discuss any requirements. Overall, you as the school / college are responsible for the students and ensuring sufficient staffing. Whilst on campus, there will be at least one member of UoN Sport staff facilitating the day, along with a small team of student ambassadors supporting. No, the day aims to offer an immersive experience for students with an interest for sport, regardless of their area of academic interest. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}