{
    "url": "https://www.nottingham.ac.uk/sport/news/nottingham-athletes-compete-at-the-2024-paris-olympic-games",
    "content": [
        {
            "p": "Sport / News / Nottingham athletes compete at the 2024 Paris Olympic Games A number of University of Nottingham alumni and former staff members competed at this summers showpiece Olympic Games in France, highlighted by Emily Campbell's fantastic efforts for Great Britain. The 2024 Olympic Games have now come to a close, with the final day of competition delivering another Olympic medal for Nottingham based weightlifter Emily Campbell. Having won silver in Tokyo, Emily has spent much of the last three years perfecting her craft at the University of Nottingham’s David Ross Sports Village through British Weightlifting’s partnership with University of Nottingham Sport. Campbell, a popular figure and role model for women’s sport, is also a familiar face around our flagship on campus sports centre due to her time as a member of our Sports Injury Clinic staff, having utilised the facilities for her own injury treatment and recovery during her career. After many preparatory training sessions within the High Performance Zone at David Ross Sports Village, Emily would go on to win Great Britain's final medal of the Paris Olympics with bronze in the women's +81kg weightlifting competition, rounding out seventeen days of Olympic competition which also included University of Nottingham representation in both the men’s and women’s hockey competitions. Captained by former University of Nottingham Men’s Hockey Club coach David Ames, Great Britain’s men’s hockey side advanced through the initial pool stage with Nottingham alumni Conor Williamson registering plenty of minutes in his first Olympic Games. Despite being the youngest member of the side, Psychology graduate Williamson asserted himself well and showed significant courage in taking the responsibility of being a penalty taker in Britain’s quarter final shootout defeat against India. Although initially named as a reserve, Nottingham alumni Tom Sorsby would also represent his nation alongside Williamson, stepping up into the side from the third match of the tournament onwards to mark his second consecutive Olympic Games after also competing in Tokyo. Our on-field men’s hockey athletes were also supported at the games by Danny Crowther, a University of Nottingham Law graduate who travelled as part of the squad and provided performance analysis across the team’s time in France. In the women’s hockey competition, attention focussed on the German side that would be captained by Nottingham alumna Nike Lorenz. Nike, an integral part of the University of Nottingham BUCS Championship winning side of 2022, made a huge impression on the tournament by scoring six goals in the pool stage – including an impressive hat-trick in a victory over host nation France. Despite qualifying for the knockout stages, it would be quarter-final penalty heartbreak yet again for a Nottingham alumni with the finest of margins making the difference as it so often does in elite sport to end Nike’s and Germany’s tournament. Reflecting on the achievements of #GreenandGold athletes at the highest level, Assistant Director of Sport (Performance) – Alex Perry commented that “everyone at the University of Nottingham is very proud of our Olympic athletes who all represented their countries so well this summer. From an Olympic debut for Conor Williamson to further medal success for Emily Campbell, all of our Nottingham alumni and associated athletes have displayed incredible aptitude and furthered our legacy at the games. We look forward to welcoming our Olympians back to the University of Nottingham in the future, and now eagerly anticipate the Paralympic Games that begin in Paris later this month.” The Paralympic Games start on the 28th August running through to the 8th September, and will also see University of Nottingham representation across a number of sports. This includes cyclist and alumni Sophie Unwin aiming to add to her two medals from Tokyo, as well as triathlon guide Charlie Harding and shooting athlete Tim Jeffery. All three Great Britain athletes have Paralympic experience having also competed in Tokyo, with Jeffery making Paris his third consecutive games. Everyone at the University of Nottingham is very proud of our Olympic athletes who all represented their countries so well this summer. From an Olympic debut for Conor Williamson to further medal success for Emily Campbell, all of our Nottingham alumni and associated athletes have displayed incredible aptitude and furthered our legacy at the games. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}