{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/swim/index.aspx",
    "content": [
        {
            "p": "Swimming is a great way to stay fit and healthy in a relaxed and comfortable environment and at our state-of-the-art David Ross Sports Village we offer a fantastic range of facilities, including a 25m eight-lane pool, a hydrotherapy pool and a luxury Health and Wellbeing Suite. Member & Casual Swimming All our student, staff, alumni and associate members can access our swimming pool free-of-charge. To ensure you're ready to swim, all you need to do is check availability through our member login and book your space in the pool at your desired time. Pay-As-You-Go To check availability for swimming sessions and to pre-book, please log in to your member or pay as you go account or call the David Ross Sports Village reception team on +44 (0)115 74 87000. We offer the following three different types of swimming sessions; Discover our extensive Swim School programme, which is available for all ages and abilities - from 6 weeks old to adults If you're 50 years-old or over, our Classic Club offers a great way to stay active, fit and healthy whilst meeting new people from your local community. Our wellness suite boasts a Finnish sauna, steam room, artic ice fountain and ice-cold bucket shower. Spacious 25m pool offering both lane and social swimming at various times across the week Extensive Swim School programme for all ages and abilities 1-2-1 private lessons and group sessions with expert coaches Home to University sports clubs, our pool also offers reserved swim times for members Weekly Aqua fit classes for all of our members Health and Wellbeing Suite providing the perfect place to relax and unwind Approved IQL UK training centre delivering the National Pool Lifeguard qualification Proud to partner with Speedo and Nova Centurion who support our elite swimming set up We offer a wide range of swimming lessons for all ages and abilities from 6 weeks old to adults. Our expert coaches aim to provide all swimmers and outstanding experience in our comfortable, safe and fun environment. There are a variety of options to choose from, including 1-2-1 private lessons and group sessions. For babies and toddlers, we have a special programme which is delivered in our heated hydrotherapy pool and focuses on building confidence in the water through activities with colourful toys and nursery rhymes. Working closely alongside Swim England, our programme is focused on Long Term Athlete Development (LTAD), providing high-quality tuition focussed on stroke technique. Our 1-2-1/private bubble lessons are a fantastic way to learn to swim or develop your technique. Our Early Years swimming lessons are the perfect introduction for younger children (aged from 6 weeks to 4.5 years) to the water. For swimmers of all levels aged from 4.5 years to 14 years, our fun, structured sessions focus on improving technique to develop happy, confident swimmers. Our new Teenager Learn to Swim programme sees expert instructors support swimmers learning to swim in a comfortable environment with those of a similar age. Our adult lessons are for swimmers aged 14 years and over from complete beginners to advanced swimmers looking to improve technique. During the school holidays, we offer a variety of swimming courses and lessons for children and adults to develop swimming skills in a fun environment. Whether you want to gym, swim, climb or compete in one of our 76 sports clubs - Student UoN sport and fitness membership has got you covered. Our Pay as You Go prices offer a flexible way to enjoy our fitness facilities and activities. We have a host of world-class sports facilities available for external venue hire and we welcome all types of events. Tell us about all about your upcoming event! +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}