{
    "url": "https://www.nottingham.ac.uk/sport/membership/studentsportsmembership.aspx",
    "content": [
        {
            "p": "Whether you want to gym, swim, climb or join one of our sports clubs - our student sport and fitness membership has got you covered. With so much on offer, we give you the power to shape your own fitness and lifestyle journey. Students can use all three of our facilities at David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington and over 80+ University gyms around the country when they head home. All yours, all on campus. Access to all three of our campus locations; David Ross Sports Village, Jubilee sports centre and Sutton Bonington sports centre. Three fitness suites equipped with the latest equipment Fitness inductions and 1-2-1 programme reviews Over 150 weekly group exercise classes Indoor climbing and bouldering wall Eight-lane 25m indoor swimming pool Indoor courts; squash, badminton, basketball, volleyball and pickleball Outdoor courts: Tennis, Netball and 3v3 basketball Beginner and social sport sessions with Just Play UNIversal Gym membership (free access to over 80 gyms nationwide) Discounted rates for our Sports Injury Clinic Option to add up to three direct relatives to your membership at the same great value rate View our range of membership options online Call our team on +44 (0)115 74 87000 Visit any of our three sports centre receptions Our Active Living package is for all students living in University-owned halls on University Park and Jubilee, plus Dagfa House and Varsity. Included within your accommodation, the package covers all the great benefits of our UoN sport and fitness membership and will be automatically activated when you move in. Student UoN sport and fitness membership for the 2024/25 academic year is now on sale. Memberships are valid from 1 September 2024 - 30 June 2025. Depending on whether you have previously purchased a membership or have an online account with University of Nottingham Sport and Fitness before, you will need to use the specific link listed below to ensure that you purchase the correct membership for you. When logging in/registering for an account, please use your University of Nottingham email address. Use the link below if you have purchased with us before and have an online account Use the link below if you have NOT purchased with us before +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}