{
    "url": "https://www.nottingham.ac.uk/sport/about-us/our-heritage/our-heritage.aspx",
    "content": [
        {
            "p": "We're incredibly proud of our sporting heritage and the inspirational achievements of our alumni and current students - our ambitious vision for the future promises even more exciting moments to come. Are you a sporting alumni of the University of Nottingham? We'd love to hear from you and find out more about your memories of sport at Nottingham. Email us at: alumni-enquiries@nottingham.ac.uk Proud of the lifelong friendships students built through sport at the University, the University of Nottingham Sport offers a discounted alumni rate for those teams who would like to organise #GreenandGold reunions. A great example of these lifelong friendships is the Northern Allstars team, they played together in the Nottingham Universities Sunday Football League in 1990/91. They now bring their families to David Ross Sports Village for an annual 11v11 football match and have been doing so every July since 1996! If you are interested in bringing your team back together, please contact our Alumni Relations team at: alumni-enquiries@nottingham.ac.uk. Officially opened in 2017 at the David Ross Sports Village, the University of Nottingham Sport Hall of Fame celebrates the inspirational achievements of Nottingham alumni in the sporting world. Read more about our inductees The University of Nottingham is very proud of our Olympic and Paralympic heritage, from our first Olympian John Dudderidge in 1936 to fellow canoe athlete David Florence, silver medallist at Rio 2016. Check out our Olympic and Paralympic history We believe everyone should have the chance to play sport at University and hope you will join us to support sport at Nottingham. Whether you are able to give a gift or offer your time, our team would love to hear from you. Get involved with sport at Nottingham Each year current students welcome alumni back onto campus for a jam-packed day of competition across more than twenty sports. Play as an individual or bring back your former team mates with you! Register for the next Challenge In 2019-20 we celebrated 100 years of Rugby Union at the University culminating with a centenary reunion weekend on 11 September 2021. This summer (28 July - 8 August), many of the #GreenandGold will head to Birmingham to represent their countries in Commonwealth competition. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}