{
    "url": "https://www.nottingham.ac.uk/sport/sport-facilities/jubilee.aspx",
    "content": [
        {
            "p": "Located within the expanding Jubilee Campus and within easy reach of the QMC, Jubilee sports centre is in an ideal central location, and is equipped with state-of-the-art sports and fitness facilities to cater for everyone. With a 100-station fitness suite, Jubilee Sports Centre houses top of the range training equipment as well as a bespoke spin studio and a newly refurbished functional training room. Hosting a variety of indoor and outdoor spaces, we can provide a versatile facility that can be tailored for both sporting and non-sporting events, catering to events of all sizes. Costa Coffee is also located directly outside the entrance to Jubilee Sports Centre, serving a variety of hot and cold refreshments. Jubilee Campus sports centre is accessible for our student, staff, alumni and associate members and external booking enquiries. Customers can access Jubilee Sports Centre via Triumph Road. Parking behind the centre is accessed via the side road next to the University of Nottingham Innovation Park. When using a Sat Nav to travel to Jubilee Sports Centre, please use the postcode NG7 2TU. ____ Bus Nottingham's bus network is extensive, with frequent services connecting Jubilee Campus Park to the city centre and to destinations to the west of Nottingham including Lenton and Wollaton. Nottingham City Transport's (NCT) 28 and 30 services run from Nottingham City Centre and stops on Wollaton Road close to the Jubilee Sports Centre. Alternatively, you can catch Trent Barton’s two which also stops on Wollaton Road. From 16 September, NCT will be launching the 29 which will run from the City Centre onto Jubilee Campus - stopping opposite the Sports Centre on Triumph Road. See the Trent Barton and NCT campus bus maps for more information. E-bikes Lime has launched an e-bike rental scheme in the Nottingham City area. Users can pick up and return Lime e-bikes from a network of designated e-bike-hire bays across the city – and there is pick up/drop off spot close to the Sports Centre entrance on Triumph Road. You can hire e-bikes through the Lime app which is available on the Apple app store or the Google Play store. Cycling If you want to cycle to Jubilee Sports Centre using your own bike then there are cycle hoops outside the entrance to the sports centre. If you are a UoN student or member of staff then you can use your unicard to access the cycle store located behind Costa Coffee. Don’t forget your D lock to secure your bike while you’re using the sports facilities. Taxis: Our front of house/reception teams can call local taxi companies to order a taxi for you. t: +44 (0)115 74 87000 e: sport@nottingham.ac.uk what3words: bucks.moment.clay Take a 360 tour of Jubilee Sports Centre We have a proud and successful track record of hosting elite teams and major events here at University of Nottingham Sport. Our world-class facilities can be transformed to host sporting competitions and external events and can help you stage an event like no other. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": [
        "uk_pdf_files/trent-barton-bus-map.pdf",
        "uk_pdf_files/university-of-nottingham-campus-map.pdf",
        "uk_pdf_files/trent-barton-bus-map.pdf",
        "uk_pdf_files/university-of-nottingham-campus-map.pdf"
    ]
}