{
    "url": "https://www.nottingham.ac.uk/sport/sport-facilities/david-ross-sports-village/high-performance-zone.aspx",
    "content": [
        {
            "p": "Set in the brand new £40 million David Ross Sports Village, the High Performance Zone offers a state-of-the-art training facility for performance athletes including a 60m sprint track and the latest fitness technology. As well as delivering programmes for our scholarship student athletes and performance squads, our experienced strength and conditioning team also work closely with professional clubs and athletes wishing to use the facility. Booking enquiries The High Performance Zone hosts strength and conditioning sessions for University of Nottingham scholarship athletes as well as our performance squads. We work closely with our Sports Injury Clinic team, also based in the David Ross Sports Village, to ensure a seamless service from injury diagnosis to return to play. Our S&C team also work directly with coaching staff to integrate training programmes with the demands of the sport. We currently work alongside a number of professional clubs and organisations, including Notts County Ladies Football Club, Sport981 and oneathlete, who provide performance support for elite disabled athletes such as Olympic gold medallists Richard Whitehead and Ollie Hynd. The University of Nottingham has been selected as an official Talented Athlete Scholarship Scheme (TASS) Delivery Site and support a number of TASS athletes studying at the university. The High Performance Zone delivers the strength and conditioning element of the TASS programme alongside coaching, physiotherapy, sports science, sports nutrition, psychology and lifestyle support provided by University of Nottingham Sport team. Our experienced strength and conditioning staff offer physical performance testing, movement screening and bespoke S&C services either on an individual or group basis. We use the latest technology and research to give athletes a detailed assessment of their current physical status and work with the athlete, coach and other support staff to produce an athlete-centred programme of support. The High Performance Zone is conveniently situated within the £40 million David Ross Sports Village within our University Park campus. As Lead Strength and Conditioning coach, Tim directs the programme of physical development for scholarship athletes and performance teams. Email Tim Lawrenson In his role as strength and conditioning coach, Andrew works closely with scholarship athletes and clubs to deliver physical development programmes. An accredited strength and conditioning coach with the UK Strength and Conditioning Association, Andrew currently works with the Great Britain Students Ice Hockey squad and has previously acted as regional strength coach for the FA women's football programme. Email Andrew Marshall David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}