{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/pitch-hire.aspx",
    "content": [
        {
            "p": "Looking to hire a pitch? We offer a range of floodlit artificial 3G pitches perfect to train or compete on whatever the weather. Our rates are very competitive and we also offer discounts during the University holidays. Our artificial pitches are a great option for a range of activities and are available for booking for students, staff and the local community. Our 3G artificial pitches at David Ross Sports Village and Jubilee Sports Centre are full-size pitches – they offer one 11-a-side football pitch or can be split into three 7-a-side football pitches. Our 3G at Sutton Bonington offers one 7-a-side pitch which can be split into 2 5-a-side pitches. All are ideal for football, but can be used for a range of activities including multi-sports, sports days, rugby, lacrosse (David Ross and Jubilee only) and American Football (David Ross only). Our Sand Dressed Pitch at David Ross is designed for hockey, but is also a fantastic all-purpose surface. All pitches are floodlit and can be booked any time during our opening hours, depending on availability. Don’t forget, if you are booking an official fixture, then a minimum of a 2-hour booking is required. If you’re looking to make a booking within the next 21 days, then you can; Looking for a date further in advance? Please contact our bookings team via email for availability. We’re delighted to offer our University of Nottingham students, staff, alumni and associates preferential booking rates of £35 per hour per 5-a-side pitch at Nottingham Powerleague. You can book up to 14-days in advance by emailing our bookings team. We also have an extensive number of grass pitches at our Highfields and Riverside sports complexes. Please contact our bookings team via email for availability. Looking to book outside of University term-time? You can take advantage of 20% off all our artificial pitch bookings on campus for bookings made up to 21 days in advance that fall within the University holidays. Discounts are automatically applied when you book. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}