{
    "url": "https://www.nottingham.ac.uk/sport/performance-sport/focus-sports/performance-badminton.aspx",
    "content": [
        {
            "p": "Talented badminton players studying at the University of Nottingham join a thriving programme based in one of the best badminton facilities in the country, the £40 million David Ross Sports Village, which includes a show court seating over 600. With one of the most formidable winning records in BUCS history, Nottingham Badminton has secured well over 30 national championship medals in individual events over the last 10 years with multiple titles for alumni Kirby Ngan, Johnnie Torjussen, and Li Lian Yang. We’ve matched this success on the wider stage as 2023 European Universities Team Champions, claiming a further 4 titles in individual disciplines including one for British number one Harry Huang who this year broke into the world’s top 100 for the first time. Here at Nottingham our #GreenandGold players are dedicated to maintaining this winning pedigree both at home and abroad through an ambition and desire for success supported at every turn by an internationally recognised performance environment, coaching team, and training programme designed specifically to cater for the aspiring student athlete. High Performance Zone for Strength & Conditioning Heading our programme is UKCC Level 2 and Badminton Wales National Development coach Martyn Lewis (pictured). Previously a professional badminton player, Martyn won nearly 100 caps for Wales and held the No. 1 Welsh Men's Doubles ranking for 5 years. His nine European and World title wins include victories at both the Spanish and Belgian Opens. Chris Adcock | Assistant Coach Among the most successful doubles players in British history, Chris achieved a career-high ranking of 4th in the world before joining the University of Nottingham as a UKCC Level 2 assistant coach. During his illustrious playing career, double European Champion and 2-time Olympian Chris added a pair of World Championship medals to his name, became a defending Commonwealth champion, and the first British player ever to win the World Superseries Finals in 2015. After a 14 year playing career, 3 years as coach to the England National team, and a further 2 years as elite singles head coach with Swiss Badminton, Raj is the newest addition to our coaching team. During a period dominated by some of the all-time greats of the sport, Raj earned his place in the conversation by breaking into the top 10 ranked players in the world while defending a National Championships title over 7 successive years, taking Silver at the 2010 Commonwealth Games, and becoming European Men's Singles Champion in 2017. As both a Sports Scholar at the University of Nottingham and UKCC Level 2 coach, Sam provides an invaluable perspective on the pressures faced by our student athletes. Across his 6 years here he has accrued a BUCS Team Championships title, 3 titles at European Universities Championships, 8 medals at BUCS Individual Championships, and a BSc Hons in Mathematics. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}