{
    "url": "https://www.nottingham.ac.uk/sport/news/scholar-in-focus-dylan-traves",
    "content": [
        {
            "p": "Sport / News / Scholar In Focus: Dylan Traves The University of Nottingham will be represented at the European University Games by our karate athletes, including club president and sport scholar Dylan Traves. We spoke to Dylan ahead of the competition which takes place in Miskolc, Hungary from the 16th to the 18th July. Thanks for your time Dylan – how did you get into your sport of karate initially? I started karate when I was five years old and I really got into it because of movies! Films such as the original Karate Kid and The Last Samurai inspired me, and my dad had also done karate before, so from there he took me to my first sessions. I’ve not really looked back since as I’ve always enjoyed it. It’d be great to find out more about your decision to study at the University of Nottingham? No problem. I’m 23 years old and this will be my sixth and final year of study at the University of Nottingham – a long course! I decided to study at the university because of my course – Architecture, and sport didn’t play a major factor initially. However, once I’d been to an Open Day at the David Ross Sports Village to see the facilities, and find out that there was a Dojo here (which is important for karate!) – that really swayed me as I could continue my sport alongside my academics. From there, I researched a bit more about scholarship options and decided it was the place for me. So, although sport wasn’t the initial factor as to why I thought about studying at Nottingham, it definitely helped me to make my final decision! What sort of level was the university karate club when you first joined and have you seen the sport grow at the university during your six years here? I think that when I first joined the karate club was sitting between 5th and 7th in the national rankings, and then in my first year we managed to jump up to 2nd which was a great achievement in a tight group. Since then, we’ve managed to pull away at the top of the rankings as the best university for karate in the UK. In terms of BUCS points as a measure, we’ve managed to double the amount of points earned in the last three years. It’s been quite a rapid progression as a club and ultimately that’s because of how we recruit and train, as well as the culture of the club. In terms of pure numbers, the club has grown hugely. From taking single numbers to competitions to over 40 members really shows the growth from the top down. You talk about taking large number to competitions – one of the highlights for the club over recent years has been the success at BUCS National Championships, with 2024 being the most successful. How do you reflect on that experience? It was probably my favourite BUCS competition that I’ve been a part of – mainly because we managed to complete a clean sweep of all the team events. There’s three team events – team kata, men’s team kumite, and women’s team kumite – and Nottingham took gold in all three which was really nice. In those events, the whole club can get behind the teams and they have more of a collective feel. Overall, we won 160 BUCS points at the event, which compared to other competing universities is by far and away the highest. It must have been extra special with it being one of your final events competing for the university with you graduating this summer? It was a really nice competition for me. If we win then our coach usually lifts the trophy with the whole team, but they allowed me to lift the trophy at Nationals which was a really nice touch. BUCS Nationals really couldn’t have gone much better in the way I wanted to go out. You’ve also studied and competed here with your brother Aron, including at Nationals. How has that experience been? There’s two years between us, and Aron joined the university in my fourth year here, and it has been really nice to have him here. He does Karate and Athletics, so I suppose we are quite a sporty family! It’s been really nice to compete and achieve at competitions like BUCS and EUSA with him, and to be able to share those moments. We get along really well so it’s been a great experience. Having been here for a few years before Aron arrived, I hope I’ve been able to pass on a few bits of knowledge from my experiences to him. Aron wasn’t actually meant to compete in Karate at Nationals as he’s a big part of the Athletics team here and was competing on the track, but he got a late Karate call-up for the Saturday and it was a great moment to be able to compete with him once again. BUCS Nationals won’t be the last time that you compete for the University of Nottingham though as you’re scheduled to compete in the European University Games this summer. Is that what you are now looking forward to? Absolutely. I’ve competed at three EUSA competitions, and in 2022 we took bronze in the Team Kata, before winning silver in the same event in 2023. So for 2024, there’s only one medal left to win! It’ll be a tough competition but hopefully we can bring home a medal in the team section. EUSA trips are a very good level of competition – akin to an under-25 European Championships because a lot of international competitors do attend universities – but the trips are also hugely fun. In some ways the pressure is off, and they are really enjoyable experiences to be a part of. What I really like about EUSA is that you get to mix and socialise with a lot of different people too, as well as my team mates. What is it that you’ve been studying at the university and how have you found your academics in Nottingham? I’ve been studying Architecture which has been a three year Bachelors degree, with a year out in placement too, and then I’ve also done a two year Masters degree. I’ve always loved design and during my GCSE’s I found that I could really take to it. When I was looking at different engineering and design courses for university – Architecture really spoke to me as something I wanted to do going forwards, and from a young age I’ve always found buildings really interesting. I don’t think that my academic experience has been what I expected before I initially came here, but I would say that it’s been different in a really good way. The creative freedom that you get is really good compared to coming in from A-Levels, and I think that the tutors within my course have been really supportive throughout my whole time at the university – especially with everything that I’ve had on with my sport too. How have you found balancing your sport and studies at the university? The actual academic work has got harder as the longer I’ve been here, but I think that’s natural. However, I’ve definitely found it easier the longer I’ve been here – purely because I’ve learnt from my experiences each year. For example, in my first year I really struggled because I wasn’t fully aware of the support I could receive from my tutors and I didn’t communicate with them enough about my schedule. Once I realised that the university and my tutors were really supportive of me achieving in both my sport and my academics I’ve had a really good experience. I also had a year in industry working in London which was another really interesting experience working in a sports architecture practice that allowed me to gain some really valuable insight on what I’d like to do in the future, however it was another learning curve for me in managing my sporting workload alongside that as I was still travelling to compete for the university. Having been here for six years, what would your advice be to prospective or current students thinking about or studying here at Nottingham? I think I would have two major bits of advice. The first would be to just get involved with as much as possible. The amount of opportunities that sport gives you whilst at university away from medals and achievements is huge. Whether that’s new friends, responsibility and learning from experiences can be so rewarding. I’ve been president of the Karate Club for four years, and the amount that experience has taught me is invaluable. Secondly, I would advise people to ensure that you are communicating with as many people as possible to get the support that’s available to you whilst at university. What are your ambitions for your Karate career once you finish at the university? I would like to continue as I am – being selected for the national team and pushing to compete for medals at major national and international competitions. I recently came second at the English National Championships which I was quite pleased with as I’ve also been balancing my time with my thesis. I think selection for senior European and World Championships and delivering high level performances at those are the ultimate aim for me. I’m just going to see where the sport continues to take me, and I’ll be involved in the sport as long as I continue to enjoy it. I think the sport of Karate has such a bright future, and who knows where that leads with possible participation at future Olympics. We thank Dylan for his time and wish him and his team mates the very best of luck at the European University Games. You can keep up to date with the University of Nottingham in EUSA competition here; Karate at the 2024 European University Games. You can also find out more about Performance Karate at the University of Nottingham here; Performance Karate at the University of Nottingham. I’ve competed at three EUSA competitions, and in 2022 we took bronze in the Team Kata, before winning silver in the same event in 2023. So for 2024, there’s only one medal left to win! +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}