{
    "url": "https://www.nottingham.ac.uk/sport/get-active/hall-sports-leagues-ims.aspx",
    "content": [
        {
            "p": "Our Hall sports leagues are an ideal way to get to know your new hall mates and stay active right here on campus. They are part of our hugely popular intramural sports leagues (IMS) programme and offer weekly netball and football leagues as well as one-off events just for students living in University-owned Halls of Residence. Part of our popular intramural sports programme, we offer weekly Halls IMS leagues for football and netball - with all matches played on campus. We run a series of one-off events throughout the year too, starting off with our Hall Netball and 7-a-side Football tournaments. Don't forget, you can also play with your course or a society team or with a group of friends in our central IMS leagues - we offer football, netball as well as 10 other sports. Our Halls teams are all led by students in halls - so if you would like to play football or netball, speak to your fellow hall mates to get your teams together! Once ready, please contact our Football or Netball reps. Please note, Hall Sport leagues and tournaments are for students currently living in a University Hall of Residence. If you are living in other accommodation / at home, or would like to play one of the ten other sports offered in the Intramural sport programme, please click here. Our Hall sports leagues offer weekly leagues in netball and football. For these leagues, your team will be allocated matches each week in the time slot by the league organiser. All our Sunday leagues start on Sunday 6 October, following our free Welcome Events on Friday 27 and Sunday 29 September. Our Wednesday leagues start from Wednesday 9 October. Once you've joined your team, you will need to register for the IMS app ahead of your first game. If you have played in previous years, you will still need to do this for the 2024/25 season. This will allow you to view your fixtures and results as well as ensure you have access to facilities for your games. Once you've downloaded the app, register your details and click to join the 2024/25 community for your sport. Badminton, Table Tennis and Squash only: If you are playing in our badminton, table tennis or squash leagues, then you will also need UoN sport and fitness membership, which you can purchase here or an Active Living package. This is not required for our other leagues. Please remember to bring your student card with you to all of your IMS fixtures. This will mean you can simply swipe through our entry gates. If you do not bring your card, you will be be refused entry. If you have lost your student card, please report to reception. Each of our sports are run by a member of our IMS Exec who are all student volunteers. If your query isn't answered on this web page, please contact the below. Badminton, Squash and Table Tennis UoN sport and fitness membership or an Active Living package is required to take part in these leagues. No further payment is required. Other sports The prices below cover the whole team for all fixtures during the season. Please check with your team captain to see how much your team will charge per player. Please note, no payment will be required until the start of the 2024/25 season. If you are playing in one of our badminton, squash or table tennis leagues then a UoN sport and fitness membership or an Active Living package is required. If you are playing in any of our other IMS leagues (team sports), you won't need a membership. We offer free buses to our Riverside sports complex for IMS Football and Rugby players. Buses leave campuses at 1.15pm on Wednesdays with 4 pick up points from the below locations: All buses return at 4pm to their original stops. Check the IMS app the morning of your fixtures - all cancellations will be notified in the app news feed. Yes - you can still play in our IMS leagues for your hall, society, course or with your friends if you are also competing for the University in the BUCS leagues. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}