{
    "url": "https://www.nottingham.ac.uk/Sport/Membership/Public/NHS-Blue-Light-Card-Membership.aspx",
    "content": [
        {
            "p": "If you are an NHS employee or a Blue Light card holder (now including teachers), you can enjoy using our fitness facilities across our three sports centres with our great value membership package. Your choice of 3 state-of-the-art fitness facilities The latest in fitness technology Over 150 weekly group exercise classes Eight-lane 25m indoor swimming pool Indoor climbing and bouldering wall Indoor court hire including badminton, basketball, volleyball, squash courts and snooker room Outdoor court hire for tennis and netball courts Free fitness induction and programme reviews Add a Health and Wellbeing Suite bolt-on to your membership Access to our new personal training service Kids go free during University holidays Discounted rates for our Sports Injury Clinic Add children to your membership for only £3 a session during term time Blue Light Card now welcomes teachers to its list of eligible services and therefore teachers are now able to purchase a NHS/Blue Light Card membership at University of Nottingham Sport. Please see the eligible membership packages below. A more flexible way to make the most of our fitness suite and group exercise timetable with a monthly payment plan. A fantastic value membership package allowing you to enjoy 12 months of health and fitness for the price of 10 months! There is a £20 joining fee required at the time of joining. You will be required to provide proof of your eligibility for this membership (such as a valid NHS ID or a Blue Light card) on your first visit. A UoN Sport Membership card will then be issued to you. Come along to any of our sport centres between 10am - 4pm on Saturday 18 and Sunday 19 January to give our fitness facilities go for free, and chat to us about our membership packages. No booking is required for the fitness suite, and other activities including swimming, group exercise classes and indoor courts will be subject to availability on the day. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}