{
    "url": "https://www.nottingham.ac.uk/sport/membership/public-memberships.aspx",
    "content": [
        {
            "p": "You don't need to be affiliated with the University to make the most of our excellent health and fitness facilities. We offer a range membership options for members of the local community to suit your fitness goals, at the £40 million David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington Sports Centre. Your choice of 3 state-of-the-art fitness facilities The latest in fitness technology Over 150 weekly group exercise classes Indoor court bookings including squash, badminton, volleyball and basketball (Jubilee Sports Centre and Sutton Bonington Sports Centre only) Free fitness induction and programme reviews No joining fee Access to our new personal training service Kids go free during University holidays Discounted rates at our Sports Injury Clinic Free car parking for up to 2 hours Add children to your membership for only £3 a session during term time Come along to any of our sport centres between 10am - 4pm on Saturday 18 and Sunday 19 January to give our fitness facilities go for free, and chat to us about our membership packages. No booking is required for the fitness suite, and other activities including swimming, group exercise classes and indoor courts will be subject to availability on the day. We offer a range of great value public memberships at each of our three of our superb sports centres so you can choose the location and facility which best suits you and your lifestyle. With peak and off peak packages available, and different payments options, we have a membership option to suit your preferences. With 200-station fitness suite, an indoor swimming pool and a range of group classes, there is a membership package to suit your fitness goals. Located in a central location, our great value public membership packages are ideal for the local community to enjoy our fitness facilities. Public members at Sutton Bonington Sports Centre can take advantage of our fitness suite, group exercise classes and our indoor and outdoor courts. If you are 50 years +, the Classic Club is a great way to stay active, fit and healthy whilst meeting new people from the local community. NHS and Blue Light card holders can enjoy our facilities at our three sports centres with out great value membership package. Our wellness suite boasts a Finnish sauna, steam room, artic ice fountain and ice-cold bucket shower. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}