{
    "url": "https://www.nottingham.ac.uk/sport/sport-facilities/david-ross-sports-village/health-and-wellbeing-suite.aspx",
    "content": [
        {
            "p": "Based within the swimming pool complex at David Ross Sports Village, our Health and Wellbeing Suite is the ideal stop off after a swim or workout. The Suite includes a Finnish sauna, steam room, arctic ice fountain and ice-cold bucket shower, as well as dedicated changing. Whether you've just been for a swim, class or workout - or just had a busy day - taking time to pause is really important and we have the perfect place for you to sink back and leave the stresses of the day behind at our Health and Wellbeing Suite at David Ross Sports Village. For UoN sport and fitness members, we offer a bolt on to your membership package with unlimited access to the Health and Wellbeing Suite - our best value for money option. You can purchase your Health and Wellbeing Suite pass at David Ross Sports Village reception or online. If you don't have a UoN sport and fitness membership or are a Pay As You Go member, you can access the Suite for a single visit. Enjoy unlimited visits to the Health and Wellbeing Suite until 30 June 2025. This is bolt-on is available to purchase from 1 September 2024. You can purchase your Health and Wellbeing Suite pass by either of below options: To purchase you pass online, please follow the simple steps below: Once you have purchased, the pass will be activated on your account and you can book your sessions. Use of our Health and Wellbeing Suite is now included within our David Ross Sports Village Fitness Suite and Pool (peak and off peak), David Ross Sports Village pool and David Ross corporate memberships. Once you've purchased your pass, you can book unlimited visits to our Health and Wellbeing Suite. Booking is essential to gain access and we recommend booking ahead of your arrival to avoid disappointment. Slots can be booked from 8am - 9:30pm, Monday - Sunday. Each slot is 90 minutes. You can also book a single visit to our Health and Wellbeing Suite at our Pay as You Go rates. Please note that the minimum age for using the health suite is 16 years old. Our range of membership packages offer the best value option for using our extensive health and fitness facilities. Our Pay as You Go prices offer a flexible way to enjoy our fitness facilities and activities. Our state-of-the-art swimming pool complex at David Ross Sports Village is the perfect place to hit the water - whether for casual swimming, a class or even lessons. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}