{
    "url": "https://www.nottingham.ac.uk/sport/membership/public/hotel-and-conference-guests.aspx",
    "content": [
        {
            "p": "We're pleased to offer Orchard Hotel and Jubilee Hotel and conference guests complimentary use of our fitness facilities during their stay. Guests may access our gym and pool at David Ross Sports Village and gym at Jubilee Sports Centre. No pre-booking is required to use our fitness suites. The hotel reception will be able to pre-book swim sessions for hotel guests (from 2 January 2025). UoN Sport will accommodate hotel guests on arrival without a pool booking subject to pool availability. Please make sure you bring your smartphone with you to register attendance at reception. Hotel cards will be taken during your workout in exchange for an access card. You can view our opening times here. Our fitness suites are located at David Ross Sports Village and Jubilee Sports Centre. If you would like to secure valuables during your workout, please bring a padlock to use our lockers. Padlocks can be purchased for £6 from our reception desks. If you require any assistance at all during your visit, please speak to our expert fitness team. Our swimming pool is located at David Ross Sports Village on University Park campus. It is a 25m competition pool (without slides) and due to the temperature (27.5 degrees) we do not recommend use for children under 4.5 years. Swimming is subject to availability during our opening hours. Our available sessions are: The pool complex offers private changing areas, including accessible facilities, hairdryers and lockers. Please make sure you bring a towel with you and a padlock to secure your belongings in our lockers. Padlocks can be purchased for £6 from our reception desks. Please note, use of our Health and Wellbeing Suite (sauna and steam room) incur an additional charge. Hotel and conference guests can also access our extensive range of additional health and fitness facilities for a small additional charge through our great value Pay as You Go options. This includes: To join as a Pay As You Go member, please visit reception at David Ross Sports Village or Jubilee Sports Centre and we can waiver the £10 joining fee. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}