{
    "url": "https://www.nottingham.ac.uk/sport/get-active/student/intramural-sports-leagues.aspx",
    "content": [
        {
            "p": "Join over 4,000 University of Nottingham students playing weekly in our Intramural Sport (IMS) leagues. One of the largest campus league programmes in the country, it's a great way to enjoy competitive sport on your doorstep and meet new friends. Join over 4,000 University of Nottingham students playing weekly in our intramural sports leagues (IMS). Compete for your University hall, course team (e.g. Geography), for a society (e.g. Tamil Society) or as a group of friends. Choose from 11 different sports including football, netball, basketball and hockey. All sports take place on campus in one of our sports centres or at our outdoor pitches. You don't need to have played the sport before - all abilities are welcome! We offer team and individual leagues on set days for 12 different sports. You or your team will be allocated matches within your weekly time slot by your league organiser. Our Netball leagues take place on Wednesdays (1- 8.30pm), Saturdays (1-6pm) and Sundays (10am-3pm) at David Ross Sports Village. Our Saturday and Sunday leagues are played indoors and we offer indoor and outdoor leagues on Wednesdays. All leagues are filled on a first-come-first-served basis. Find out more about IMS Netball by contacting IMSNetball@nottingham.ac.uk. Registration for our team sports for the 2024/25 season are now open. You can sign up via the link here. If you have any queries, please contact glynn.dignum@nottingham.ac.uk. Registration for our racket sports for the 2024/25 season are now open. You can sign up via the link here. To find out more about our IMS racket sports programme, please click on the sports tabs above. We have halls-only leagues for netball and football plus three Halls Welcome events to help you find your team for our other sports - find out more here. Lots of societies and courses run their own IMS teams - check out our Team Finder below for the best contact to find out more. If you can't find the right option for you, please get in touch with the contact for your chosen sport (see the sports tabs above) who will be able to help. Football & Volleyball Captain: Franklin Scott Contact email: efyfs4@nottingham.ac.uk Once you've joined your team, you will need to register for the IMS app ahead of your first game. If you have played in previous years, you will still need to do this for the 2024/25 season. This will allow you to view your fixtures and results as well as ensure you have access to facilities for your games. Once you've downloaded the app, register your details and click to join the 2024/25 community for your sport. Badminton, Table Tennis and Squash only: If you are playing in our badminton, table tennis or squash leagues, then you will also need UoN sport and fitness membership, which you can purchase here or an Active Living package. This is not required for our other leagues. Please remember to bring your student card with you to all of your IMS fixtures. This will mean you can simply swipe through our entry gates. If you do not bring your card, you will be be refused entry. If you have lost your student card, please report to reception. Each of our sports are run by a member of our IMS Exec who are all student volunteers. If your query isn't answered on this web page, please contact the below. Badminton, Squash and Table Tennis UoN sport and fitness membership or an Active Living package is required to take part in these leagues. No further payment is required. Other sports The prices below cover the whole team for all fixtures during the season. Please check with your team captain to see how much your team will charge per player. Please note, no payment will be required until the start of the 2024/25 season. If you are playing in one of our badminton, squash or table tennis leagues then a UoN sport and fitness membership or an Active Living package is required. If you are playing in any of our other IMS leagues (team sports), you won't need a membership. We offer free buses to our Riverside sports complex for IMS Football and Rugby players. Buses leave campuses at 1.15pm on Wednesdays with 4 pick up points from the below locations: All buses return at 4pm to their original stops. Check the IMS app the morning of your fixtures - all cancellations will be notified in the app news feed. Yes - you can still play in our IMS leagues for your hall, society, course or with your friends if you are also competing for the University in the BUCS leagues. Whether you’re a new referee or already active, here’s a chance to get involved. None of our fixtures can be played without referees or umpires. And the best bit is that we pay our officials! You don’t necessarily need to be qualified, all you need is a good knowledge of the sport and the confidence to lead fixtures. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}