{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/swim/early-years-swimming-lessons.aspx",
    "content": [
        {
            "p": "Our Early Years swimming lessons are the perfect introduction for younger children (aged from 6 weeks to 4.5 years) to the water. Hosted in our heated hydrotherapy pool with parents/ guardians accompanying the swimmers, they are a fantastic opportunity to bond with your child in a relaxing environment. Our specialist Early Years instructors offer interactive sessions designed to improve your child's confidence and independence in the water. Progressing at each child's individual pace, we use nursery rhymes, fun games and activities to teach the basics movements of swimming and water safety in a fun learning environment Our Junior swim school programme is now available for new customers to add their names to our waiting lists but we do have limited availability at all stages. This availability will be sold on a first come first served basis. Click here to join our Early Years waiting list. Friday mornings, Saturday mornings or Sunday mornings Friday Mornings, Saturday mornings or Sunday mornings Friday mornings, Saturdays or Sunday Mornings Tuesdays from 4pm, Saturdays or Sundays mornings The next course of Early years swimming lessons starts week commencing 18th November 2024 and finishes week commencing 10th February 2025. For those booking the same stage, day and time, you can book from week commencing 28th October 2024. For those moving up a stage or wanting to change day or time please book as per the table below. Please be aware that all the times listed below are subject to availability. If your current class is no longer there, please be advised that a letter will be given to you with an alternative time. The timetable for week commencing 18th November 2024- week commencing 10th February 2025 is below. Swim School Terms and Conditions | Contact us David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/university-of-nottingham-swim-school-terms-and-conditions-2021.pdf"
    ]
}