{
    "url": "http://www.nottingham.ac.uk/sport/schools/engagement-and-residential-programme.aspx",
    "content": [
        {
            "p": "Open to Year 11 - 13 pupils, our Engagement and Residential programme offers your students the chance to experience life as a student-athlete at the University of Nottingham with sessions including athlete testing, recovery and sports tasters. The inspiring programme, including the residential element, is free-of-charge for all schools and colleges in the East Midlands and North region where at least 30% of your group qualify for free school meals. Our Engagement and Residential programme covers three separate sessions for your group, all free-of-charge. Students will find out more about the student-athlete experience in our state-of-the-art facilities, immerse themselves in life on campus and explore the skills they might need to apply for university. The series is delivered by our professional staff alongside University of Nottingham student ambassadors. You can also combine these sessions into one visit and take up our free residential offer for a fully immersive overnight stay at the University of Nottingham. Transport to and from David Ross Sports Village is covered for your group and all pupils will receive a University of Nottingham Sport kit. Lunch vouchers are provided and can be redeemed at our Clubhouse Café, which caters for all dietary requirements. To find out more about our Engagement and Residential programme for secondary schools, please contact Samuel Hicklin at samuel.hicklin@nottingham.ac.uk. We've also included some answers to our most frequently asked questions below. Thank you for the experience at the University of Nottingham. We had a fantastic day and all the students were really impressed with the facilities and the university setup. Return coach transport to and from your school / college is provided by the University of Nottingham. We will book this for you once your staff and pupil numbers are confirmed. Please let us know about any parking, pick up or drop off requirements for your school / college venue. Linked to the funding we have secured for this project, we are targeting pupils from a low socio-economic background, where there are lower percentages for progression into higher education. We are using the free school meal criteria as a key identifier for this. Yes, if you would like to add more sport specific elements or change certain activities, please let us know and we can discuss the set-up of the day and /or residential for your group. The dress code is casual, pupils should come ready to take part in sport or have a change of clothes for sporting activities. School uniform is at the school’s discretion. Lunch is provided and caters for all dietary requirements. Please make us aware of any dietary requirements on the form provided prior to attending. Yes, the programme is completely accessible and can be adapted as needed, please inform us of any specific requests or requirements at the time of enquiry / booking. You as the school / college are responsible for the students and ensuring sufficient staffing. Whilst on campus, there will be at least one member of UoN Sport staff facilitating the day, along with a small team of student ambassadors and student volunteers supporting. No, the day aims to offer an immersive experience for students with a passion for sport, regardless of their area of academic interest. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}