{
    "url": "https://www.nottingham.ac.uk/sport/news/multiple-medals-for-nottingham-athletes-at-2024-paralympics",
    "content": [
        {
            "p": "Sport / News / Multiple medals for Nottingham athletes at 2024 Paralympics The 2024 Paralympics have recently concluded after twelve days of engrossing competition. The action from Paris has seen a number of fantastic achievements and everyone at University of Nottingham Sport is delighted that amongst these have been notable moments for university alumni and former students. Sophie Unwin and Tim Jeffery headed to these games with plenty of experience having represented Great Britain at the 2020 Tokyo Paralympics, with Jeffery making Paris his third straight appearance at the Paralympic Games. University of Nottingham Ningbo campus alumni Zhao Shuai also travelled to Paris to represent China in what would be his fourth games. Table tennis athlete Shuai and cyclist Sophie Unwin had experienced medal moments during previous games, with Shuai having previously won four gold medals, and Unwin a silver and bronze. Both athletes would look to repeat their past successes once competitive action began on the 29th August, and Zhao Shuai would be the first to add to his impressive medal haul. Competing in both the men’s and mixed doubles, Shuai and his partner Mao Jingdian made history as they were crowned the first-ever mixed doubles Paralympic champions in Paris after winning an all Chinese class 17 final. The legendary Chinese athlete would claim a bronze medal the same day alongside partner Lian Hao in the class 18 men’s doubles, before rounding out his incredible Paris campaign by completing the achievement of standing on every step of the podium by adding silver after facing Ukrainian Viktor Didukh in the class 8 men’s singles final. Not to be outdone, Sophie Unwin hit the track inside the velodrome looking to improve on her two medals from Tokyo. Alongside her pilot Jenny Holl, Unwin begun her Paris campaign with Women’s B Time Trial and finished with a well-earned bronze. However, this would be just the beginning of a hugely successful run of performances as Unwin followed this up with a new world record time and gold medal in the Women’s B 3000m! Unwin would also then complete the full set of medals by winning silver in the Women’s B Road Time Trial, before blowing away the competition to claim Paralympic gold in the Women’s B Road Race and round out a truly phenomenal week of racing on the biggest stage taking her final tally to four medals, with two golds. Alongside Unwin, another athlete to bring home a medal for Great Britain was former University of Nottingham student and shooting para-athlete Tim Jeffery. Jeffery entered the Mixed 50m Rifle Prone SH2 on the 4 September and shot a total of 227.8 to claim his first ever Paralympic medal at the third attempt having competed in Rio and Tokyo. Recently graduated University of Nottingham student Charlie Harding competed in the men’s triathlon as a guide runner for Oscar Kelly and the pair finished seventh in their Games debut, after also competing at the 2022 Commonwealth Games. Assistant Director of Sport – Performance, Alex Perry, reflected on the incredible success of #GreenandGold athletes this summer by saying \"the 2024 Paralympic Games in Paris have been a joy to watch, and the performances of our Nottingham alumni have made it one of the most inspirational to date. Both Sophie Unwin and Zhao Shuai have cemented their legacies by adding multiple medals to their already impressive collections and we could not be more proud that Sophie Unwin also broke a world record at these games. These games have provided huge moments for our athletes, and seeing former student Tim Jeffery claim his first Paralympic medal at the third attempt is one that will live long in the memory. Everyone at the University of Nottingham would like to congratulate all of our alumni, former students and associates on a truly fantastic set of accomplishments in Paris.\" For more information on the University of Nottingham competing at the Paralympic and Olympic Games, please visit; Nottingham in international competition Everyone at the University of Nottingham would like to congratulate all of our alumni, former students and associates on a truly fantastic set of accomplishments in Paris. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}