{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/swim/school-holiday-lessons.aspx",
    "content": [
        {
            "p": "Available for young people and adults, we offer 1-2-1 / Private bubble & group week intensive courses, 1-2-1 / Private bubble Pay as You Go lessons and group Pay as You Go lessons. These intensive courses are ideal for building water confidence and swimming technique at a quicker rate to weekly lessons. Options vary from Beginners to Stage 7, stroke clinics, learn to dive, starts and turns, distance practice swims - dependent on pool and instructor availability for each holiday period. Our School holiday programme is available to current and new customers on a first come, first served basis. To book please contact our Front of House team on +44 (0)115 74 87000. Please be advised when enquiring, availability is subject to change as we are continuously taking bookings. Spaces can only be guaranteed with payment. Our week intensive courses (Monday-Friday) are a great way to boost you or your child's swimming progress! Monday to Friday we offer a variety of options to develop new skills and improve your technique. Available to current and new customers on a first come first served basis. We will be offering the option to either pay for a week intensive course or pay as you go and choose the days you would like to attend. For the Adult courses, swimmers must be 14 years and above: For the Junior courses, children must be 4.5 years and above: Prices for the group crash course are as follows: Our week intensive courses (Monday-Friday) are a great way to boost you or your child's swimming progress! These lessons are tailored to your personal goals and our instructors will work with you to develop your swimming ability and skills. You have the option of a 121 course or a private bubble course. Available to new and current customers on a first come first served basis. These are 30 minute lessons per day and there will be a new time slot available every 30 minutes. The table below shows days and times available; the column 'For abilities...' lists the types of swimmers that the instructors are trained to teach. Any of the time slots below can be changed to a private bubble course. The following conditions apply for private bubble bookings: Junior Stage 4 - Stage 6 For Adults, the abilities must be the same, either all Adult Beginners or Improvers or Advanced. Pay as you go 1-2-1 / Private Bubble lessons offer you the flexible option to pick and choose the dates you would like to attend. These lessons are tailored to your personal goals and our instructors will work with you to develop your swimming ability and skills. Available to new and current customers on a first come first served basis. Please read the terms of booking under the 1-2-1 / Private Bubble crash courses before booking. There is a new time slot available every 30 minutes. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}