{
    "url": "https://www.nottingham.ac.uk/sport/news/success-on-the-international-stage-for-nottingham-students",
    "content": [
        {
            "p": "Sport / News / Success on the international stage for Nottingham students The University of Nottingham has seen numerous students compete in international university competitions this summer, representing the university and their countries in martial arts and powerlifting. The 2024 European University Games took place in Debrecen and Miskolc across twelve days of competition in July, with the University of Nottingham entering athletes and teams into the martial arts disciplines. This included the University of Nottingham competing in both the men's and women's karate tournaments, with Nottingham athletes aiming to end an incredible season in style, and continue a strong tradition of recent success. Across three days of intense competition, the University of Nottingham advanced to the latter stages of both the Men's and Women's Team Kata tournaments. In the Men's Team Kata, Nottingham's team consisted of Aron Traves, Dylan Traves, James Harrison, and Oliver Wycherley, who claimed a bronze medal to add to their BUCS championship this year. However, our Women's Team Kata squad of Jordanna Williams, Jess Maitland, and Amelia Clow would go one better by advancing all the way to the final where they would take on the University of Porto. Despite a fantastic effort from the Nottingham trio, their Portuguese counterparts would take the victory, resulting in Nottingham's medal count doubling with a very well deserved silver. Many of our karate medallists also competed in individual competitions, achieving top-ten finishes, whilst Nottingham also saw representation at the European University Games in the Taekwondo competition this summer. Following this success, University of Nottingham students would then compete at the inaugural FISU World University Powerlifting Championships. Taking place in Tartu, Estonia, the GB Students delegation for the championships included both James West and Hannah Matson from the University of Nottingham Powerlifting Club, demonstrating the incredible recent growth and success of the club. Current club president James West made his 3rd international appearance by competing at the championships, and his presidential predecessor Hannah Matson would also make her mark. Competing in the Women's -57kg category, Matson would register a total of 420.0 to finish on the podium and claim a superb silver medal. Everyone at the University of Nottingham would like to congratulate everyone involved in the thrilling achievements of our students at both the European University Games and the FISU World University Powerlifting Championships this summer. I am so happy with my performances in the team and individual competitions at the European University Championships, and I am looking forward to what is to come in the future! +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}