{
    "url": "https://www.nottingham.ac.uk/sport/news/news/news/the-headliner-birmingham-fall-to-nottingham-in-the-championship-semi-final.aspx",
    "content": [
        {
            "p": "On 11th March 2020, we welcomed the University of Edinburgh and the University of Birmingham to David Ross Sports Village to feature as The Headliner in Women’s and Men’s Championship semi-finals. Both teams were on the #RoadtoNottingham, competing to secure their place at BUCS Big Wednesday held at the University of Nottingham, 25th March 2020. The afternoon of squash finished with the Men’s team securing a place in the final here on BUCS Big Wednesday. The Women’s matches against the University of Edinburgh commenced at 1:30 with Megan Thomas representing the #GreenandGold against Catherine Holland from Edinburgh on the all-glass court, whilst Ally Martin went head-to-head with Jemma Gillan on Court 6. Both games saw very equally matched players with Thomas taking the win on the all-glass court, 3-1, and Edinburgh winning the title on Court 6, 3-2, after a very close 5 rounds. Speaking to Megan Thomas on how her game went: “I played Catherine Holland in the previous round and won quite comfortably, but I knew today would be a bit more challenging. I got nervous when she started winning points but managed to keep calm and win the match. I’m really proud of the rest of the team today.” Next up was Anna Hooper on the all-glass court, facing Katie Gregson Macleod from the University of Edinburgh. After another very intense 4 sets Gregson Macleod took the win. Over on Court 6 Josie played valiantly but lost to Edinburgh’s Katriona Allen, 3-1. This meant Birmingham took the win and secured a final space as the overall score was 3-1. Premier Squash League player, Grace Clark, the one to watch for the University of Nottingham was up against Georgia Adderley, BUCS Individual Champion and PSA’s 96th ranked player. Clark put up a good fight but unfortunately could not beat Adderley in the final Women’s game of the day. Adderly won 0-3 to leave the final score 1-4 to Edinburgh. Edinburgh will be back in Nottingham on the 25th March for the BUCS Big Wednesday Final. We caught up with Head Coach, Richard O’Conner to talk about his thoughts on the afternoon’s games for the girls: “It is a new team this year. I keep telling the girls not to compare themselves with previous teams we have had, some of which are now on the world circuit playing top 30 squash. They have performed really well the rest of the season and have surprised us in the league where they came 2nd. They have done their best in this competition; it was all nerves today and that is what upset the game. They have played a lot of games in front of big crowds, so I don’t think that phased them today. They are disappointed but I don’t want them to be, they have had a good year this year.” The afternoon did not go as hoped for our Women’s 1st team, but the girls tried their hardest and should be proud of what they have achieved. All was still to play for as we entered the second half of the afternoon with the Men’s 1st team competing against the University of Birmingham to make it to the all-important BUCS Big Wednesday. Matthew Broadberry kick-off the tie on the all-glass against Michael Mattimore. An initial heated back-to-back chase where Broadberry took the first game. This led to Mattimore firing up and taking the next two wins. In the fourth round, it was a vicious battle where Mattimore took the win. Reflecting on the match with Matt: “On the last game, I just kept pacing myself and fired up with all the support from the crowd which caught me a few points, but it was just too little too late.” On court 6, Michael Andrews won the first point for Nottingham with a tough initial game against Muqtadir Nimji. He soon got into Nimji’s game to keep the crowd entertained with an incredible 3-2 win. Andrews comments on the experience of playing in the Headliner and what it means to have the semi-finals and potential finals on home turf for BUCS Big Wednesday: “It was really nice to have so many people watching and shouting.It’s a complete different feel to last year where we had to gather friends to come down and support, but this year a lot of people have come down to support. We missed out on the finals last year, and I’m away on a year-abroad next year so it would be really good to leave Nottingham with a final before that.” Following on court 6, Kyle Finch played Mohammed El Shamy and bagged an incredible 3-0 win for Nottingham, bringing the Men one step closer to the final on the #RoadToNottingham, on the 25th March. The overall score at this point being 2-1. “It’s my first year here and I can see how much it means to everyone. We have so much respect for each other, and if we can pull through together, we have as good a chance as anybody to win the final.” Although it was a clean win, Finch commented on the challenge El Shamy brought: “He could have beaten me 3-0, I had to ensure I was as tough mentally as I could be. At times he was going through points at ease, I had to cope with that mentally. Skilfully I think he is better than me, but this was a big mental game. It just came down to the head today.” Meanwhile on the all-glass Nottingham scholar, Owain Taylor, Welsh Senior International, faced Birmingham’s Stuart McGregor in a grudge match as last year McGregor secured a final place against Owain. A breath taking 4 game match saw the two men battling for a chance in the final, for Birmingham a chance to catch up with Nottingham in this tie and for Nottingham a chance for a direct ticket to BUCS Big Wednesday. Owain rewrote history to win 3-1 and secure Nottingham’s place in the BUCS Big Wednesday Final. Owain comments on his game that secured a ticket to the final: “It was a tough match and I knew we were winning 2-1 already so winning this match would take us straight to the final. I stayed focused and delivered in the end.” For the final match of the tie and with Nottingham securing a place in the final, Adam Auckland from Nottingham played a showcase against Belgium champion, Jan Van Den Herrewegen in 3 games. We caught up with Adam on some thoughts of tonight’s tie: “Last year we lost the semi’s to Birmingham so it was nice to get the win this year. I think they were stronger this year so it feels even better! I am proud of the boys who deep and got the win.” Now with the final promised, Adam shared an insight on how the Team will prepare for a chance at the big win: “For the next couple of weeks we have to keep focused and believe we can actually win this. It will be exciting to see what happens. I believe the guys have what it takes to win it.” You can catch the boys in action back on the all-glass squash courts at David Ross Sports Village in BUCS Big Wednesday on 25th March. Tickets are available here. Follow all the teams on their #RoadtoNottingham for the BUCS Big Wednesday Final. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}