{
    "url": "https://www.nottingham.ac.uk/Sport/Bookings-and-Timetables/Climb/Climbing-Wall-Forms.aspx",
    "content": [
        {
            "p": "If you’re not already on our system, you’ll need to join UoN Sport as a full or Pay as You go member. Once you have completed this you will need to book onto one of our competency tests. These are run throughout the week. Once the test has been passed you will be invited to complete a Acknowledgement of Risk Form. The forms below should only be completed when a registered climber is agreeing to supervise a less experienced climber. Or for parents wishing to supervise their own children. As a registered climber you are able to supervise up to two novices. Before booking onto the climbing wall you should complete this form to notify us who you are taking responsibility for. Please note you should not attempt to teach climbing technique, belaying or lead climbing unless you have received appropriate instruction and qualifications. If you are unable to complete the Acknowledgement of Risk form but you are accompanied by a more experienced climber they may be able to supervise you. Only complete this form if you are prepared to be supervised by the experienced climber. You will not be allowed to belay or lead climb whilst under supervision. If you want to take your own children climbing we ask that you complete the U18's Parent/Guardian supervisior form. You must be a member of UoN Sport and be a competent climber, and have already completed your registration. Young people aged under 16 years old will need to be accompanied by a parent / guardian at all times when using the climbing wall. Member & Casual Climbing All our student, staff, alumni and associate members can access our climbing wall free-of-charge. To ensure you're ready to climb, all you need to do is to ensure that you complete a competency test and acknowledgement of risk form, check availability through our member login and book your space on the wall at your desired time. See also access information above. Pay-As-You-Go To check availability for climbing sessions and to pre-book, please log in to your member or pay as you go account or call the David Ross Sports Village reception team on +44 (0)115 74 87000."
        }
    ],
    "pdf_files": []
}