{
    "url": "https://www.nottingham.ac.uk/sport/performance-sport/sports-scholarships/current-scholars.aspx",
    "content": [
        {
            "p": "In 2021-22 University of Nottingham Sport supported a record number of student athletes to compete at the highest level during their studies. Our sports scholars compete across over 25 different sports for the University of Nottingham, with several representing their country at international junior and senior levels. Find out more about a selection of our recent cohorts below. Scholarships Home Sport: Fencing Studied: International Law LLM Top achievements: 3x Pan American Individual Champ, South American Champion (Ind + Team), Junior World Championship Finalist 2016, Multiple time World Cup Medalist, University of London Athlete of the Year 2018. Sport: Squash Studied: MSc Health Psychology Top achievements: Commonwealth Champion in 2022, current Top 10 in the World Rankings, Ivy League Rookie of the Year. Sport: Table Tennis Studying: Medicine BMedSci and BMBS Top achievements: Team GB (Toyko 2020), 2 x Commonwealth Games medallist, Ranked #1 in the UK and reigning European Doubles champion. Read more about Niall here Short Track Speed Skater and scholar Niall Treacy has started 2024 in magnificent fashion by claiming a medal at the European Short Track Championships, which resulted in him also receiving national recognition from TASS. Read more about Sarah here Sarah Davies is a Commonwealth gold medallist weightlifter and recently decided to take the step back into academics to ensure Sarah is ready for whatever is next once the time is right to stop competing in weightlifting. Read more about Owen here Owen Caputo joined the University of Nottingham fresh from an NCAA Division I National Championship final with Duke University. Owen finished his time at Division I level with 56 goals and 38 assists for 94 points. Read more about Rebeka here Tennis scholar Rebeka Stolmar has delivered a flawless year on the court here in Nottingham by winning every single BUCS trophy available as an integral part of the University of Nottingham's #GreenandGold! Read more about James here The University of Nottingham became the inaugural BUCS (British Universities and Colleges Sport) Wheelchair Basketball champions in 2022 with James Hazell playing a key part in that achievement, and he is now looking to future international successes. Read more about Daniel here Daniel Goriola has been making plenty of strides on the track this year having delivered superb performances at both the Under-20 National Championships, as well as the Senior British Championships, to go with two BUCS gold medals. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}