{
    "url": "http://www.nottingham.ac.uk/sport/membership",
    "content": [
        {
            "p": "At the University of Nottingham, we have a fantastic range of great value membership options available to support your health and fitness journey. And you don't need to be a student to take advantage of our state-of-the-art health and fitness facilties! Find out more about our packages below. Want to visit our fantastic gym facilities and try our fitness suite free-of-charge? Come along on Saturday 6 January between 10am - 4pm to give our our fitness suites a go and explore more of our health and fitness offer. You can choose to visit David Ross Sports Village, Jubilee Sports Centre or Sutton Bonington Sports Centre. Our student sport and fitness membership is the very best option to #FindYourActive with us here on campus. Our staff UoN sport and fitness membership package offer great value for money as well as a convenient location for your workplace! You don't have to be a student to take advantage of our facilities. We've got a range of options to help you meet your fitness goals. If you are a former student or associate at the University, then we offer exclusive discounted rates on our popular membership packages. If your company is looking to support your employees to look after their wellbeing, we can help with our popular corporate packages. If you are interested in exploring more of what our sport centres have to offer, you can arrange a tour of our facilities with one of our friendly team or book to try our fitness suite for free. To book your tour or arrange to try our fitness suite, please complete this form and one of our team will be in touch. Please allow at least 48 hours from your request of a free trial or visit. Want to try our facilities before committing to a membership package? We have promotional passes on offer throughout the year! Pay as you play is available to students, staff, alumni and associates year round and the local community during University holidays. Complete with a sauna, steam room and ice fountain, you can add a pass to our Health and Wellbeing Suite to your membership package. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}