{
    "url": "https://www.nottingham.ac.uk/sport/get-active/student/just-play.aspx",
    "content": [
        {
            "p": "Try something new or just come along to meet new friends with our popular Just Play programme. With lots of different sports to try and no weekly commitment needed - it's easy to fit a session into even the busiest of schedules. Delivered by our friendly student session leaders, our Just Play programme offers over 30 sports to try and is suitable all abilities and experience levels. Sessions are open to all University of Nottingham students, including postgraduate and mature students. There are no matches or league points to win - you just turn up and play for fun. The sessions are all drop in, meaning you don't need to commit every week and you can take part in as many sessions (and sports) as you can fit into your schedule! Sessions run across all three campuses. Our Sport For All Week is taking place Sunday 24th November to Sunday 1st December across University Park and Jubilee Campuses! A week that highlights the inclusive sport and activity opportunities available for students to access. Our friendly and welcoming clubs will be showcasing the adapted versions of their sport and how inclusive their sport can be. Sessions during Sport For All Week sessions are free for all students to attend. Take a look at our timetable and book a free session! Our Autumn Timetable runs from Monday 7th October to Sunday 15th December 2024 across all 3 campuses! Take a look before and book a session to guarantee your space! It was nice to be around other beginners with no expectations, it felt like a judgement free environment. I was more likely to come back to Just Play after attending Just Slay. I was nervous at first but coming with my friends helped. If you are part of Active Living or hold a UoN sport and fitness membership, Just Play sessions are included. Click here to book. You will need to set up an online Just Play account (free-of-charge) with your University email address- please select from the links below. Once you have set up an account, sessions are £3.50 each and can be booked by logging in here. You can activate your Just Play account from Thursday 3 October. We recommend that you pre-book your session where possible - you can login here. Bookings for each session will open three days before the session is due to take place. Please note, some sessions have to be booked in advance, and the timetable will advise of this (for example, Climbing must be booked in advance). Alternatively, just turn up 10-15 minutes before the session and sign up at the reception desk. Just Play sessions are included in our UoN sport and fitness membership or Active Living package. If you don't have a membership / package, most of our sessions are £3.50 although some are priced differently. You will still need to create a free Just Play account - please see above for how to do this. No, you don't need a membership. However, UoN sport and fitness members can attend all sessions on University Park Campus, Jubilee Campus or Sutton Bonington Campus for free so it may be worth considering purchasing a sports membership. This will give you access to use all of our facilities, including the pool and fitness suites. All sessions on University Park Campus, Jubilee Campus or Sutton Bonington Campus are also included in your Active Living package. If you don't have a membership / package, most of our sessions are £3.50 although some are priced differently. Not at all - people of all abilities are welcome to all of our Just Play sessions, whether you've never played before or want to pick up an old hobby again! Our student session leaders are on hand to teach and coach to all ability levels so just turn up and have fun! Not a problem - Just Play sessions are designed with busy students in mind and it doesn't matter if you miss a session. Don't forget though, the more you attend the bigger the health and wellbeing benefits! Yes, you can attend as many Just Play sessions as you can fit in! The programme is designed to help students try as many sports as possible to find the ones they enjoy the most. Wear comfortable sports clothing and suitable footwear. If the session is outdoors, warm/waterproof clothing is recommended. All equipment will be provided! Make sure you are suitably dressed, have water to keep yourself hydrated and have pre-registered for your chosen session. We recommend bringing sanitiser with you although this will be available at various locations on site at each of our facilities. Staff members are welcome to join Just Play sessions, but the University of Nottingham runs a programme of sport designed for staff which may be more suitable. Visit our staff sport webpage for more information. We're sorry - our Just Play sessions are for current University of Nottingham students and staff only. If you hold a full alumni and associate membership or NHS / Blue Light membership, you can access our Staff Sport sessions. For more information, please click here. From live spectator sport to one-day sport festivals, from our award-winning Girls' Night In to our hard-hitting 'Let's Talk #GreenandGold' events, we've got you covered! Make sure you don't miss out and get involved with the latest events from University of Nottingham Sport. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}