{
    "url": "https://www.nottingham.ac.uk/sport/performance-sport/performance-sport.aspx",
    "content": [
        {
            "p": "Elite athletes studying at the University of Nottingham benefit from a world-class sporting experience combined with an education from a global top 200 University. Our vision for sport is ambitious and student athletes join a proud history of sporting success. Our students and alumni have gone on to win Olympic, World and Commonwealth gold and we're committed to developing the talent of the future. Keep up-to-date with fixtures and results as our teams compete in the British Universities & Colleges Sport Leagues (BUCS). Explore our performance support programme and find our why University of Nottingham is one of the top student-athlete performance environments in the U.K. Our range of sports scholarships are aimed at providing an unrivalled level of support to the brightest and best talents in the sporting world. The University of Nottingham has a Para Sport Scholarship scheme for elite sportsmen and women looking to study and train at Nottingham. Our 70+ sports clubs are at the heart of sport at University of Nottingham, there is something for everyone to try. Watch our students compete as they represent the #GreenandGold of University of Nottingham LIVE on our Official YouTube channel. The University of Nottingham has a huge choice of sports clubs– you can choose from over 70 different disciplines. We welcome scholarship applications for all sports, with each case reviewed individually against our decision criteria. The selected sports below receive additional support through our performance sport programme. Click the relevant sport to find out more. Click here to discover more about the University of Nottingham Wheelchair Basketball programme and register your interest today. Never miss a moment of the #GreenandGold competing at the highest level of university sport with the launch of UoN Sport TV. University of Nottingham Sport has created a dedicated home for all live coverage of university sports teams - from American Football to Hockey. With over 15 streams per week covering a wide range of sports, there's never been as much opportunity to follow our sports teams and catch the action live or on catch-up, regardless of wherever you are in the world! +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}