{
    "url": "https://www.nottingham.ac.uk/sport/news/stage-set-for-british-transplant-games-as-baton-relay-sets-off",
    "content": [
        {
            "p": "Sport / News / Stage set for British Transplant Games as baton relay sets off The Westfield Health British Transplant Games is set to start after an emotional baton relay set off from University of Nottingham Sport's David Ross Sports Village this week. Excitement is building ahead of a major sporting event in Nottingham next week, as an emotional baton relay for the Westfield Health British Transplant Games kicked off from the University's flagship sporting venue this week. The British Transplant Games aims to raise awareness of the life changing benefits of organ donation and encourages transplant patients to stay active through sport. To celebrate a week until the competition officially starts, patrons from Anthony Nolan and Transplant Sport as well as representatives from the city and University of Nottingham came together to officially begin the 2024 baton relay from David Ross Sports Village. The 46th edition of the tournament will be hosted in Nottingham for the first time and the 2024 Sporting University of the Year* is one of several city locations acting as host venue. Running from 1 - 4 August, transplant survivors of all ages, from 22 months to 88 years old, compete in over 25 different sports, representing hospitals across the UK where they received their organ transplant. Being based in the city is especially poignant as Nottingham Hospitals have been supporting Transplant Sport, who run the event, for over a decade raising over £220,000. The link with the University is also long-standing - the first University Marrows Organisation (supporting Stem Cell Donation and Anthony Nolan) was created by a student from Nottingham University’s Medical School in 1998, James Kustow. University Marrows now exist across virtually all University Medical Schools, to promote stem cell transplants from young fit people, as those between the ages of 15-25 provide the best quality stem cell transplants. The current student group - Nottingham Marrow’s - who work closely with Anthony Nolan have won national awards for their campaigns. David Ross Sports Village will play host to the basketball, table tennis and squash events, whilst Nottingham Venues will be coordinating more events at the East Midlands Conference Centre based on campus, as well as offering accommodation to participants and their guests. * As awarded by The Times and Sunday Times Good University Guide and the Daily Mail. We can't wait to be part of the Westfield Health British Transplant Games and are honoured to have the David Ross Sports Village chosen as the start point for the baton relay. It's been fantastic to meet thoe invovled with the event and their journeys are truly inspirational. We hope everyone has a fantastic time competing and spectating and we wish all the teams the best of luck. The 2024 British Transplant Games will take place from 1 - 4 August 2024. For more information, visit: www.britishtransplantgames.co.uk. The University of Nottingham is a leading destination for major national and international sporting events. For more information on the facilities and services we can offer to event organisers, please contact Christine Bailey at christine.bailey@nottingham.a.uk or click here. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}