{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/index.aspx",
    "content": [
        {
            "p": "We have a wide choice of fitness classes, pool sessions and climbing wall tasters that are a great complement to any training programme. Make sure you keep an eye on our booking system to keep up to date with the latest changes! If you are experiencing difficulties booking swimming sessions, courts, classes or climbing activities, please call 0115 748 7000 or e-mail sport@nottingham.ac.uk. We have a wide choice of fitness classes that are a great complement to any training programme. Book your class today! Explore our fitness programmes in our fully equipped gym facilities at David Ross Sports Village, Jubilee Sport Centre and Sutton Bonington Sport Centre. Take a dip in our spacious 25m pool at the David Ross Sports Village with set hours reserved for our UoN sport and fitness members. The Climbing Wall is open for casual climbing. Bookings can be made via our online booking page in blocks of 60, 90 & 120 mins. Working closely with our students and staff we have developed a variety of sport sessions for students with disabilities, long term or mental health conditions. Our motivated and dedicated trainers specialise in helping you to achieve your goals. Personal Training is available to our members as an additional paid service. Our clinic provides an outstanding treatment environment for staff, students and the local community, whilst also delivering cutting-edge support for our student-athletes. We have a host of world-class sports facilities available for external venue hire and we welcome all types of events. Tell us about all about your upcoming event! Our artificial floodlit pitches are a great option for a number of activities and are perfect to play on in any weather. Check out the opening times for all of our facilities +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}