{
    "url": "https://www.nottingham.ac.uk/sport/sport.aspx",
    "content": [
        {
            "p": "As the Sports University of the Year for 2024 and top University in the UK for team sport, we offer an award-winning programme of sport, health and fitness opportunities for our students and community. We have a wide choice of fitness classes, pool sessions and climbing wall tasters that are a great complement to any training programme. From local school events, to national and international competitions we have an outstanding portfolio of sports facilities. Whether you want to gym, swim, climb or compete in one of our 76 sports clubs - Student UoN sport and fitness membership has got you covered. From beginner sport and halls sport leagues through to volunteering in our leadership academy, we have a wide variety of opportunities to help you get active. Our range of sports scholarships are aimed at providing an unrivalled level of support to the brightest and best talents in the sporting world. Sport is for everyone and we are here to ensure that there are accessile sporting and fitness opportunities for all students at the University. Discover all you need to know about getting active on-campus with University of Nottingham Sport. From key information about our facilities, programmes and membership, click below to #FindYourActive! Check out the latest dates on our calendar - join us to try something new, challenge yourself or support our teams! Want to combine your degree with practical and transferable life skills that you can then take forward in the career of your choice? We offer courses at undergraduate and postgraduate level across a variety of areas such as Sport and Exercise Medicine, Sport Rehabilitation and Sport Exercise Science The University of Nottingham has done the double – by being named Sports University of the Year by two influential national university league tables. Nottingham has been crowned the best university in the UK for sports by The Times and The Sunday Times Good University Guide 2024, published today (Friday 15 September) – the third time the university has been awarded the accolade by the publication since 2018. It comes just days after also being named Sports University of the Year by the Daily Mail University Guide – in the first year that the national newspaper has produced its own UK university rankings and awards. Read more about this recognition here. Never miss a moment of the #GreenandGold competing at the highest level of university sport with the launch of UoN Sport TV. University of Nottingham Sport has created a dedicated home for all live coverage of university sports teams - from American Football to Hockey. With over 15 streams per week covering a wide range of sports, there's never been as much opportunity to follow our sports teams and catch the action live or on catch-up, regardless of wherever you are in the world! +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}