{
    "url": "https://www.nottingham.ac.uk/sport/news/scholar-in-focus-dan-johnson",
    "content": [
        {
            "p": "Sport / News / Scholar In Focus: Dan Johnson Dan Johnson is a national record holder and a part of the Paddle UK Senior World Class Programme, as well as a master's student at the University of Nottingham. Combining his Nutritional Sciences studies with elite level sport as a sports scholar, Dan will be looking to make his mark and take home medals from his first competition of the year for the #GreenandGold - the 2024 BUCS Wild Water Racing Championships. We spoke to Dan ahead of the championships to find out more about his career so far, his decision to become a sports scholar at the University of Nottingham, and his aims for the challenges ahead. Pleased to speak with you Dan. Would you be able to tell us a little bit of background about yourself and how you got into your sport? Not a problem. I was always good at cross country running at school initially, but then my family moved from East London to Essex when I was a teenager and one hot summer I thought ‘why not try some water sports?’ From there I got into canoe because there were facilities local to me and I was hooked. From the age of 14 I just continued to get better, progress my skills and move through the age groups before I was picked up by a national coach at 17 to join the national programme. Around the same time, I decided I wanted to combine sport with studying and moved back to London for my undergraduate degree before completing that online around attempting to qualify for major international competitions such as the Olympics. Once I’d completed that degree, I had the opportunity to move to Nottingham because a lot of my training was become centralised into hubs, and I’ve lived in the city for around seven years now. I’ve enjoyed my time in Nottingham so far and I think it is a great city. It’s one which thrives culturally and there’s lots of things to do. To me, there’s nothing that’s lacking about the city and it’s great to be a part of the university community. What was it about the sport that kept you hooked and made you want to keep progressing? I obviously like a lot about the sport, both the team and individual elements. However, I really like the time trialling aspect where you are always trying to better your own times and performances. You are able to keep it quite simple in that way as it’s a combination of being fit enough, strong enough, and fast enough and because you’re always trying to better your own times you can see progress every year. For me, I went from Junior World Championships to then Under-23 World Championships, before moving to Senior World Championships and Olympic qualification events. The better you do, the more enjoyable it is – and the jump from Under-23 to seniors was quite difficult but once I got to grips with the level, I’ve managed to maintain a top 10 world ranking for the last 3 to 4 years. I’ve broken into a few European and World A-finals now and it’s all about the next step of firstly getting to the Olympic Games and challenging for a medal. I’ve been in and around the Olympic team for a number of years and I unfortunately just missed out on competing in Paris by a really small margin. I then decided to combine my preparations for LA 2028 cycle with a master’s degree here at the University of Nottingham. What did you decide to study here and why did you make that choice? I am studying MSc Nutritional Sciences, and I think that it’s a really good step on from my Sports Science undergraduate degree. It’s taken me outside of sport and expanded my studies outside of an area that I’ve been so focussed on over the last ten years. I think broadening that knowledge has been useful, and I’ve still been able to incorporate things I’ve learnt during my master’s into my training and preparations. On the whole though I am really enjoying being back in an academic setting and soaking up information about the body’s biochemistry and how it functions and fuels itself to complete certain goals. Have your studies helped you focus in on your career goals outside of sport? Yes, being in the first two years of an Olympic cycle allows for a good amount of space to progress in those career and life areas where being well-rounded is really important. I think that really helps when it comes to the final key year of an Olympic cycle because there are a lot of different stresses from a lot of different areas and also a lot of different individuals. However, as mentioned the first two years allow breathing space for me to grow and gives greater opportunities career wise later on. I don’t feel like I’m waiting to finish studying. I’m just looking to really enjoy this year, learn as much possible, do things the right way, and get involved with a wide variety of different things. Being within an elite canoeing bubble means that you are very much focussed on a small set of goals, but my experience here at the University of Nottingham has opened up a really wide range of other opportunities. With qualification for the 2028 Olympics your main aim, do you have any shorter-term goals? The first year of the Olympic cycle for me is based on improving my speed and power outputs, with my training geared around that. Alongside that I am keen to complete my master’s positively and understand all of the aspects that I’m covering. Those are my two main focuses, and I really just want to enjoy my time here at the university as much as possible. I will also be competing for the University of Nottingham in BUCS competition this year and I’m looking forward to the Wild Water Racing Championships. It’ll be quite interesting because there will be elements that I’m comfortable with, but some that I’m learning a little whilst competing because they aren’t necessarily the disciplines that I usually compete in. I’m entering into around 20 different races over the weekend of competition so that’s 20 different opportunities to earn maximum points for the university. I’m confident that I’ll be able to aim for the top spot in the sprint races, and in the river racing I’m aiming to be medalling in those whilst learning on the spot! How much do you enjoy those types of competitions being a part of the University of Nottingham squad? It’s been a long time since I’ve competed in a team set-up like this, and I have envied the way in which university sport is with the camaraderie and team community aspects. Targeting and accumulating as many points as possible to win the team championships is something that excites me and is a new sort of goal for me. I’m looking forward to it! We have a lot of younger world class talent on our roster here at the University of Nottingham and it’s really fun to have the goal to win the overall team title. There isn’t a secondary target, our expectations are to win. We’ve met up as a team and everyone knows that’s the aim so I’m really looking forward to going out and achieving that. We would like to thank Dan for his time and look forward to seeing what he and his team mates achieve at the BUCS Wild Water Racing Championships in Grandtully, Scotland on the weekend of the 9th to the 10th November. We also wish Dan the very best of luck in his studies and career aspirations to qualify for the 2028 Olympic Games, and look forward to being a part of that journey. You can also find out more about the performance canoe programme at the University of Nottingham here; Performance Canoe at the University of Nottingham. Targeting and accumulating as many points as possible to win the team championships is something that excites me and is a new sort of goal for me. I’m looking forward to it! +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}