{
    "url": "https://www.nottingham.ac.uk/Sport/Membership/Public/Sutton-Bonington-Membership.aspx",
    "content": [
        {
            "p": "Sutton Bonington Sports Centre is ideal for members of the community based near our rural Sutton Bonington campus. Members of the local community can make the most of our health and fitness facilities with our peak and off-peak membership packages. 30-station fitness suite The latest in fitness technology An extensive range of group exercise classes, including Les Mills' group exercise sessions Tennis court hire Indoor court bookings including squash, volleyball, badminton and basketball (Jubilee Sports Centre and Sutton Bonington Sports Centre only) Free fitness inductions and programme reviews Add a Health and Wellbeing Suite bolt-on to your membership Access to our new personal training service Discounted rates to our Sports Injury Clinic (located at David Ross Sports Village) Kids go free during University holidays Add children to your membership for only £3 a session during term time Members with a peak membership at Sutton Bonington Sports Centre will be able to enjoy our fitness facilities, including the fitness suite, our group exercise class timetable and squash courts during our opening hours. With 12 months for the price of 10, our annual membership is a great value package to enjoy our fitness facilities. Our monthly package is a flexible option for you to make the most of our fitness facilities at Sutton Bonington Sports Centre. There is a £20 joining fee required at the time of joining. Our monthly package is a rolling membership and you may cancel the membership at any time with one full calendar months’ notice. Annual memberships start from the date of joining and will not automatically renew. You will receive a renewal notice on the final month of your membership. Come along to any of our sport centres between 10am - 4pm on Saturday 18 and Sunday 19 January to give our fitness facilities go for free, and chat to us about our membership packages. No booking is required for the fitness suite, and other activities including swimming, group exercise classes and indoor courts will be subject to availability on the day."
        }
    ],
    "pdf_files": []
}