{
    "url": "https://www.nottingham.ac.uk/sport/news/nottingham-lacrosse-programme-continues-to-excel-in-bucs-competition",
    "content": [
        {
            "p": "Sport / News / University of Nottingham Lacrosse programme shines at BUCS 6s Championship The University of Nottingham have begun the competitive sporting season with a number of magnificent performances, both in the league and in championship action. Notably, both of our men’s and women’s Lacrosse teams have begun the league season undefeated and took this form into the BUCS (British Universities and Colleges Sport) 6’s Championships. Taking to the pitch for one of the first standalone BUCS championships for the university this season, our Nottingham squads entered the championships with the confidence of also being reigning national champions with both first teams having won the men’s and women’s 6’s titles in 2023. The 2024 edition held at Surrey Sports Park on the 20th October would see the University of Nottingham enter four teams into competition at the championships. This is because both of the university’s men’s and women’s second teams entered the Trophy, whilst both first teams entered the Championship competition. Demonstrating the incredible strength of the lacrosse programme at the university, all four teams produced convincing and consistent performances to reach the final of all respective competitions. All four teams would finish top of their initial group, providing a spot in the knockout stages. In the Trophy, the University of Nottingham women’s second team retained their title by beating Nottingham Trent and Loughborough to reach the final, before an 8-3 victory against Durham saw them win the competition for a second successive year. Meanwhile the men’s second team took to their first ever taste of the competition in style with wins over King’s College and Nottingham Trent in the quarter and semi-finals, to set-up a final against Warwick. A 4-2 win ensured a 100% win record for the side in their debut BUCS 6s tournament as Nottingham decisively claimed the silverware in both Trophy competitions. Both Nottingham first teams came into the day looking to retain their championship titles with the men’s side having won the past two editions, whilst the women’s squad were aiming for their fourth championship in a row. After progressing to the knockout rounds both teams eased through to the semi-finals with wins over Bristol and Cambridge, setting up matches against Nottingham Trent for the women’s team, and Loughborough for the men’s team. A comfortable 14-4 victory for the men guaranteed their spot in yet another final whilst the women booked their shot at the championship with a hard-fought 8-5 victory over local rivals Nottingham Trent. In the showpiece finals, it would a familiar fixture with Nottingham Trent again providing strong opposition for Nottingham’s men’s team. Both teams have now played each other in the past three finals, with the University of Nottingham taking the victory in the past two. However, this year would be one step too far for the green and gold as the side just came up short to settle for a silver medal. With both finals taking place concurrently, the women’s championship final saw Nottingham take on Exeter, and the University of Nottingham squad were not going to be denied a fourth title in a row. A brilliant display in the biggest moments saw Nottingham maintain their position as the best women’s university 6’s team in the country, and the title of BUCS National Champions! Head coach of both men’s and women’s Lacrosse programmes at the University of Nottingham - Michael Armstrong – reflected on the achievements of the green and gold by saying “the objective coming in was 4 finals, and we knew that, whilst tough – it was achievable. Then anything can happen in a final and we just so happened to edge out in 3 of 4. There were some big moments across the day too, but the highlight for me was the support each member of the green and gold gave one another.” Everyone at the University of Nottingham would like to congratulate everyone involved in the success of our whole lacrosse programme at the 2024/25 BUCS 6’s Championships. The achievements demonstrate the incredible consistency and standard that runs throughout the club. You can find out more about the Performance Lacrosse programmes at the University of Nottingham here: Men’s / Women’s. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}