{
    "url": "https://www.nottingham.ac.uk/sport/news/nottingham-at-the-2024-paris-olympics",
    "content": [
        {
            "p": "Sport / News / University of Nottingham represented in Paris Everyone at the University of Nottingham is immensely proud that amongst those attempting to climb the mountain top this summer will be a number of University of Nottingham connections, including current and former students. Everyone at the University of Nottingham is immensely proud that amongst those attempting to climb the mountain top in Paris this summer will be a number of University of Nottingham connections, including current and former students. Highlighting the level of talent that Nottingham student-athletes have reached over recent years are Great Britain athletes Conor Williamson and Olivia Bates. Conor Williamson (pictured) has been selected to represent Great Britain as a part of the Men’s Field Hockey squad, continuing his remarkable progress in recent years. Conor was an integral part of the University of Nottingham side that claimed a BUCS championship victory in 2023, and followed this up by winning Men's Junior Performance Player of the Year at the 2023 England Hockey Awards. Olivia Bates will also travel to Paris, after being selected as a reserve for Great Britain's rowing squad. As a current student and Greenaway sport scholar at the University of Nottingham, Olivia’s deserved selection is an outstanding feat and a deserved reward for her commitment to sport alongside her studies. Olivia is studying Veterinary Medicine within the School of Medicine and Health Sciences, and has also represented the #GreenandGold on the water becoming a double BUCS champion over her first few years as a student athletes. As well as representation for Great Britain, Nottingham will also see alumna Nike Lorenz captain her country – Germany. Nike, a former sport scholar who graduated MSc Entrepreneurship, Innovation and Management in 2022, has previous pedigree having claimed bronze in Brazil 8 years ago, and captaining the side in Tokyo. Reflecting on those experiences during her time in Nottingham, Nike said “winning the bronze medal at the 2016 games is my biggest accomplishment so far. No-one really expected us to achieve what we did as we were ranked ninth in the world at the time, so to be as successful as we were and get home with a medal was definitely one of the best experiences of my life! “ Alongside those who have studied at the university, Nottingham is proud to be connected to many high-performing athletes through our partnerships. One of these is with British Weight Lifting, which has strengthened our relationship with Great Britain star Emily Campbell. Nottingham born Emily has made our High Performance Zone at David Ross Sports Village her training base, whilst forging strong relationships with our Sports Injury Clinic which saw her become a part of the staff for a period of time. Reflecting on the selection of University of Nottingham representatives to these games, Assistant Director of Sport – Performance, Alex Perry said “The University of Nottingham Sport team is delighted that a number of University of Nottingham students, alumni, and connected athletes will represent their countries this summer. To see students who are still studying or who have only recently graduated such as Conor Williamson and Olivia Bates make the step onto the international stage at these games is a testament to the work that they have put in over recent years as student-athletes at the university. It is also hugely rewarding to see that alumna Nike Lorenz will captain her country, whilst Emily Campbell will continue to cement her legacy. As Sports University of the Year for 2024, these selections mark yet another cause for celebration for the University of Nottingham.” As Sports University of the Year for 2024, the selection of our students, alumni, and associates mark yet another cause for celebration for the University of Nottingham. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}