{
    "url": "https://www.nottingham.ac.uk/sport/membership/universal-gym-membership.aspx",
    "content": [
        {
            "p": "BUCS UNIversal opens the doors to multiple gyms around the country. Meaning you can work out wherever in the United Kingdom you are, helping University of Nottingham staff and students stay active all year round. This programme allows our student and staff UoN sports and fitness members to access fitness facilities at several different university venues across the UK, completely free-of-charge. Ideal for during the university holidays when you return home or even visiting a friend, it's the perfect way to keep up your routine even when you're out of town. We're also welcoming UNIversal Gym members from other institutions taking part in the scheme to our fitness venues. To get started with a UNIversal Gym membership, please follow the links below to download the app and watch the video tutorial to set up your account. Accessing a gym all year round has never been easier! All students and staff at the University of Nottingham who have a full UoN sports and fitness membership are eligible for a UNIversal Gym membership. This includes One Semester memberships. UNIversal Gym members may then visit any of the participating institutions to use their fitness facilities. Please check with each institution before you visit for any access restrictions. UNIversal Gym Card holders from other participating institutions may access the below at any time during our opening hours: Please ensure you have pre-booked your session via the BUCS Playwaze app and show your QR code and student ID to our reception team to gain entry. Please note, UNIversal Gym membership from Nottingham Trent University may not be used at the University of Nottingham and vice versa. This is due to the close proximity of the two institutions and potential capacity issues. Yes. The UNIversal Gym membership is only available to you if your membership is with your university of study or work. The 2022-23 membership is valid until 31 August 2023, regardless of which university you are at or when you activate your UNIversal Gym membership. The scheme runs on academic year and not 12 months from the date of collection. All students who have an active membership until 30 June will be able to access other UNIversal facilities until 31 August. You can use other universities' facilities during term-time and during the holiday periods. Please note, if you opt to cancel your UoN student or staff sport and fitness membership, your BUCS UNIversal gym membership will also be cancelled. All universities that are part of the UNIversal Gym Membership can be found here. At a minimum, all universities are offering access to their gym facilities, some may be offering more. It is your responsibility to check what is available before visiting another university and any pre-booking requirements. This will occur in situations when two universities are in close proximity or in the same city. This restriction is required in order to manage the number of users accessing facilities and potential capacity issues. At the University of Nottingham, UNIversal Gym Members may access the fitness suite at David Ross Sports Village, the fitness suite at Jubilee Sports Centre and the fitness suite at Sutton Bonington Sports Centre. Please click here for the opening times of each facility. Please pre-book your session via the BUCS Playwaze app - you will be then given a QR code to show to our reception teams to gain entry. You will also need to present your student card. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}