{
    "url": "https://www.nottingham.ac.uk/sport/news/vitasport-partnership-annoucement-2024",
    "content": [
        {
            "p": "Sport / News / VitaSports to fuel University of Nottingham Sport with exciting new partnership VitaSports, established in 2018, has been driving change across the sports nutrition landscape, aiming to deliver athletes with the best, most specific and highest standard of sports supplementation. With certified protein blends, along with a vast range of energy and hydration supplements, VitaSports provides products that athletes can trust, with a sport specific supplement ranges informed sport approved. VitaSports already has a history of successful partnerships with a number of professional sports clubs and athletes, including Queen Park Rangers Football Club, Watford FC, Birmingham City Football Club and Ireland Cricket. We at VitaSports are extremely excited to announce our partnership with University of Nottingham for the upcoming 2024/2025 season. We look forward to supporting all athletes at University of Nottingham with our informed sport approved range. University of Nottingham has an exceptional sporting reputation, and we feel very privileged to help support. This partnership will see VitaSports products made available across all three of our sport centres as well as new vending machines installed at David Ross Sports Village and at Highfields Sports Complex. We are very excited to partner with VitaSports for the upcoming 2024/25 season and to see their amazing range of high-quality products made available to our students, staff and broader sporting community. This partnership will support our vision for sport, to be the best UK university for sport, physical activity and wellbeing and will no doubt enhance our programmes and student experience. For more information about University of Nottingham Sport partnerships, please contact Christine Bailey, Assistant Director of Sport (Business Development) at christinebailey@nottingham.ac.uk. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}