{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/gym.aspx",
    "content": [
        {
            "p": "Our gyms, located across our three campuses feature the latest in fitness technology , including a SYNRGY360 training area, WLinear training rig, Watt bikes and the latest cardio equipment from Life Fitness - all connected by the LFconnect app to track your work outs. Each gym has dedicated areas for cardio, fixed weights, free weights, functional training, plate-loaded machines, lifting racks and cable motion. Our fitness team are on hand to deliver a range of fitness support services including lifting workshop, tailored 1-2-1 programmes and personal training. The University of Nottingham recently teamed up with Life Fitness™ to completely re-design our Gym at David Ross Sports Village. Improvements include brand new lifting and resistance technology, new lighting and improved flooring to re-imagine the gym space and increase capacity. Our new Functional Training Room (FTR) at Jubilee Sport Centre is now also available to members alongside our regular fitness provision across our other campuses facilities. These redevelopments combine best-in-class Life Fitness™ and Hammer Strength equipment to create a flawlessly integrated functional training experience. Additional gym upgrades at the University of Nottingham include: Alongside upgrades to the fitness equipment, the team have connected a brand-new music system, adding LED lighting and installing new mirrors to motivate and inspire. Our fitness instructors are on hand to take you through the basics of how to use the equipment correctly, safely and effectively. If you are new to the fitness suite, need some guidance on how to use the machines or would like a fitness instructor to check your technique then we are happy to help! Duration: 60 minutes You can also watch our online induction below to find out everything you need to know about training in our fitness suites. Watch this video to ensure you train safely, follow our fitness suite etiquette and learn about opportunities we have available to ensure you reach your sport and fitness goals. To book: Inductions are available free-of-charge to UoN Sport and Fitness members. Please speak to a member of our fitness team in any of our fitness suites to schedule your session. Do you need some extra guidance? Some more motivation? Someone to hold you accountable? Our personal trainers are here to take everything out of your hands and make sure you get the most out of every session to help you reach your goals faster. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}