{
    "url": "https://www.nottingham.ac.uk/sport/news/scholar-in-focus-ashlee-lewis",
    "content": [
        {
            "p": "Sport / News / Scholar In Focus: Ashlee Lewis Ashlee Lewis, an MSc Digital Marketing student and former NCAA Division 1 basketball player for Cal State University Fullerton, has brought her talent and experience to the University of Nottingham, where she now plays for both the university team and the Nottingham Wildcats. Originally from California, Ashlee’s journey into basketball began at a young age, inspired by her father’s love for the game. While she initially played the UK's version of football - soccer, Ashlee eventually switched to basketball in high school and hasn’t looked back since. “I grew up about 30 minutes outside of LA, and my dad played basketball, so I was always around the sport from when I was really young,” Ashlee shared. Though a late bloomer, she quickly made her mark on the court, eventually earning a place at Cal State Fullerton. Her college experience was unforgettable: “Playing in the States was a once-in-a-lifetime experience. I met lifelong friends, learned so much, and wouldn’t trade it for the world.” In Ashlee’s role as a power forward, sometimes centre, she’s had the opportunity to lead and inspire her teammates. “Coming from a higher level, I hope I can take on a leadership role here,” she said. “I just hope someone has learned something from me—I love to pass on wisdom.” Life in Nottingham and the Scholar Community Making the leap from California to the UK was a bold decision, but Ashlee felt ready for a change. “If you’d asked me a year ago, I would’ve never thought about moving away from California, and here we are! It was a quick decision, but I was ready for a new experience”. Studying Digital Marketing at the University of Nottingham felt like a natural fit, combining her undergraduate studies in Business Analytics with a deeper dive into marketing. “I was inspired by a teammate from Cal State who is working in marketing now - learning hands-on and using analytics simulations has made it so interesting.” Living with fellow UoN sport scholars, including water polo players and a tennis player from the US, Ashlee has found a strong support system. “It’s interesting to see how competitive the other sports are here. Back in the US, I didn’t think much about sports beyond basketball, but here, I see so many cool sports—like fencing, something I’d never thought about!” As a final thought, Ashlee laughed about the weather adjustment: “The weather is the biggest difference! The first week I had to go buy a jacket - definitely something I’ll be adjusting to until my time here is up!” Balancing Academics and Athletics Transitioning from NCAA athletics to the setup here at the University of Nottingham has come with some similarities and some changes. “It’s pretty similar - definitely requires strong time management, but I’m able to explore a bit more here, which is nice,” Ashlee noted. “In the US, it was school, sports, and not much else. Now I can take in more of the world around me, knowing this is one of the last times I’ll play competitively.” Ashlee trains with the Nottingham Wildcats on weekends, balancing the intense schedules of both the Wildcats and the UoN team. “It’s been nice that a lot of us from the university team play for the Wildcats, too—it keeps us close and lets us focus on the game rather than adjusting to different team dynamics.” Looking Forward While Ashlee is taking time to enjoy her Nottingham experience, she’s also considering her future. “I’m figuring out whether to go home or stay,” she admitted. “My mom bets I’ll stay, but for now, I’m just taking it all in.” Reflecting on her journey so far, she advises her younger self—and others—to stay open: “Don’t limit yourself by being too comfortable. There’s so much to experience, and whether it’s good or bad, it’ll be a lesson.” Basketball and Family Support Basketball has always been a family affair. Ashlee’s dad played, and her uncle even had a stint in the NBA. “I grew up watching my uncle’s games, and my younger brother just got taller than me after seeing me play—so we’ll see how that goes,” she chuckled. With her family visiting soon, Ashlee stays connected with daily calls, excited to share this journey with them. We would like to thank Ashlee for her time, and look forward to following her journey as a sports scholar at the University of Nottingham and as a part of Nottingham Wildcats over the rest of her time here in Nottingham. You can also find out more about the sports scholarship programme at the University of Nottingham here; Sports Scholarships at the University of Nottingham. It’s interesting to see how competitive the other sports are here. Back in the US, I didn’t think much about sports beyond basketball, but here, I see so many cool sports - like fencing, something I’d never thought about! +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}