{
    "url": "https://www.nottingham.ac.uk/Sport/Membership/Public/Jubilee-Sport-Centre-Membership.aspx",
    "content": [
        {
            "p": "Located within the expanding Jubilee Campus and in easy reach of the QMC, Jubilee Sports Centre is in an ideal central location. We have a great value public membership package available at Jubilee Sports Centre for the local community to enjoy our fantastic sports and fitness facilities. 100-station fitness suite Functional training room An extensive range of group exercise classes, including Les Mills' group exercise sessions Dedicated spin studio Indoor court bookings including badminton, basketball, volleyball and squash court Access to The Fit Box Free fitness inductions and programme reviews Add a Health and Wellbeing Suite bolt-on to your membership Access to our new personal training service Discounted rates to our Sports Injury Clinic (located at David Ross Sports Village) Kids go free during University holidays Add children to your membership for only £3 a session during term time Members with a peak membership at Jubilee Sports Centre will be able to enjoy our fitness facilities, including the fitness suite and group exercise timetable, during our opening hours. Our best value membership package for you to enjoy our fitness facilities, with 12 months for the price of 10! With monthly payments and a one month cancellation period, the monthly membership package is our most flexible package. There is a £20 joining fee required at the time of joining. Our monthly package is a rolling membership and you may cancel the membership at any time with one full calendar months’ notice. Annual memberships start from the date of joining and will not automatically renew. You will receive a renewal notice on the final month of your membership. Come along to any of our sport centres between 10am - 4pm on Saturday 18 and Sunday 19 January to give our fitness facilities go for free, and chat to us about our membership packages. No booking is required for the fitness suite, and other activities including swimming, group exercise classes and indoor courts will be subject to availability on the day."
        }
    ],
    "pdf_files": []
}