{
    "url": "https://www.nottingham.ac.uk/Sport/Performance-Sport/Focus-Sports/Performance-Mens-lacrosse.aspx",
    "content": [
        {
            "p": "Lacrosse players studying at the University of Nottingham join one of the UK's largest University lacrosse programmes, competing at the top level of British Universities and Colleges Sport (BUCS) leagues. With the overall aim to be the #1 destination for lacrosse playing student-athletes in the UK, the University of Nottingham has made strides to deliver against that objective. The lacrosse facilities at UoN are extensive; our teams train on a purpose-built 3G pitch opened in 2015 at the Jubilee Campus sports centre and utilise performance facilities at the £40 million David Ross Sports Village including the High Performance Zone and Sports Injury Clinic. Other athlete provision includes: game-day GPS, video analysis, athlete well-being & other online tools to support performance, whilst balancing a student-life. Fully supported by an international-level coaching team and professional support staff, the programme aims to provide the opportunity for teams to succeed, and enable each individual player to reach their full potential. 4 x Weekly Team Sessions Video and Data Performance Analysis 3G Pitches for Training and Competition High Performance Zone for Strength & Conditioning Built-in Performance Analysis Cameras Our Head of Lacrosse is Mike Armstrong, who has played (2008 – 2017) and coached (2015 – present) internationally for England, brings performance knowledge, culture and resources right into the University program. Mike is also the current England Lacrosse U20’s Head Coach (Men’s). Having coached within club, University, regional and national set-ups, Mike is well versed in the demands of running the UoN program and works to support student-athletes both on and off the field. Fun Fact: Mike actually won the BUCS Championship as a player in 2008, beating the University of Nottingham in the final. However, he is now firmly #GreenandGold!"
        }
    ],
    "pdf_files": []
}