{
    "url": "https://www.nottingham.ac.uk/sport/about-us/investing-in-sport.aspx",
    "content": [
        {
            "p": "We believe everyone should have the chance to play sport at University and be the best they can. Sport has such a positive impact; teaching valuable life skills and creating friendships for life. I will not forget the awe and delight of our students when we opened the new David Ross Sports Village. Thanks to a transformational gift from the David Ross Foundation we now offer game-changing facilities which fuel our students to believe in their potential. To everyone who has supported us on the way, I offer my deepest thanks. Your donations, input and expertise will shape the development of young people for many years to come. But we're just at the start of an incredible journey to take sport at Nottingham to the top. I'm proud to be leading sport at Nottingham into an exciting new era - and I hope you'll join me on the journey. Together we can provide a bright sporting future for generations of students to come. Dan Tilley, Director of Sport Make a donation Volunteer with us Sports scholarships offer life-changing opportunities, opening doors to competitions and training that might otherwise be closed. By attracting the best, we can also help accelerate the progress of others who benefit from playing alongside top-quality talent. Your support could help a future Olympian take their place on the podium. We believe quality coaching is the key to achievement. We've already recruited some of the UK's top coaches, which has allowed us to become the leading institution for several sports such as table tennis and squash. We'd like to be recognised as the best in even more sports and push all our teams to compete in the highest leagues. We offer one of the best inclusive sporting programmes in the sector with a dedicated Disability Sports Officer and a popular supported fitness programme. But we need more equipment for disability sport, additional coaches and additional activities to allow our disabled students the best opportunity to access physical activity. Our Sports Leadership Academy is training the next generation of sports leaders by running activities for the University and local community. You can help us to provide the training, equipment and resources for University of Nottingham students to deliver sport to more young people across our region. One of the most valuable ways you can support our students is by sharing your advice and expertise. It may be from your sporting performances, or how your time at Nottingham has shaped your career. Become a mentor or an event speaker and provide guidance in coaching and leadership to our current students. An inspirational leader can make a real difference to the sporting ambitions and experience of a young person at university. You can get involved with University of Nottingham Sport by coaching sessions for one of our sports clubs or by acting as a manager for one of our teams. To find out more about how you can support sport at Nottingham or discuss the exciting naming opportunities inside our new Sports Village, please get in touch with our philanthropy team. Email us at: alumni-enquries@nottingham.ac.uk. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}