{
    "url": "https://www.nottingham.ac.uk/sport/membership/pay-as-you-go.aspx",
    "content": [
        {
            "p": "We offer sport, health and fitness opportunities to suit every lifestyle. If it's flexibility you're looking for, our Pay as You Go offer allows you to use facilities at David Ross Sports Village, Jubilee Sports Centre and Sutton Bonington Sports Centre. Our membership packages offer the best value for money here at University of Nottingham Sport, but we also offer a range of our most popular activities on a Pay as You Go basis across all three of our campus sports facilities. You can book and pay for a single activity at a time - choose from working out in our fitness suite, taking a dip in the pool and much much more! Fitness Suites Group exercise class Swimming pool Health and Wellbeing Suite Climbing wall Squash / Racketball court Badminton / Pickleball court Table Tennis Snooker table Indoor sports hall (for basketball, volleyball, futsal or netball) Outdoor court (for 3 v 3 basketball, netball or tennis) Just Play session (UoN students and staff only) You can check availability and book in advance for all our Pay as You Go activities: Once booked, you can simply swipe in with your University student or staff card upon arrival. Other customers will be provided with an access card upon your first visit. Looking for a pitch? We have a range of floodlit artificial pitches available at very competitive rates, with discounts during the University holidays. Want to bring your children to try a fun range of activities including swimming and climbing? £2.50 during term-time, activities are free during University holidays. Our range of membership packages offer the best value option for using our extensive health and fitness facilities. Throughout the year we offer a range of promotional passes to try out our popular fitness activities across all three of our campus sports centres. These are a great chance to try out our offer before committing to a full membership. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}