{
    "url": "https://www.nottingham.ac.uk/sport/news/national-recognition-for-university-of-nottingham-staff-members-from-tass",
    "content": [
        {
            "p": "Sport / News / National recognition for University of Nottingham athlete support staff At the recent TASS Practitioner Awards for 2024, the University of Nottingham saw two staff members receive recognition by winning national awards. David Knapton claimed the accolade for Personal Development Practitioner, whilst Nabil Shah won Physiotherapist Practitioner. The Talented Athlete Scholarship Scheme (TASS) is an athlete support programme to help talented athletes with balancing the demands of their sport and studies to be the best in both areas. We are proud to be a Dual Career Accredited Delivery Site here at the University of Nottingham, and deliver a number of services to TASS athletes from the University of Nottingham and athletes from around the UK. These services include lifestyle and personal development support, as well as physiotherapy and strength and conditioning - all delivered by University of Nottingham Sport staff at our High Performance Zone and Sports Injury Clinic within David Ross Sports Village. The work of our staff within the TASS programme this year was recognised by the organisation as Nabil Shah and David Knapton both earned deserved nominations for their work within physiotherapy and personal development at the 2024 TASS Awards. The awards took place at the start of July and we were delighted to see both Nabil and David win both of their categories! Nabil was awarded the TASS Physiotherapist Practitioner of the Year, whilst David claimed TASS Personal Development Practitioner of the Year, meaning that the University of Nottingham won two of the five awards available. I was delighted to win the personal development practitioner of the year award from TASS. There is so much great work going on across institutions and TASS to support talented athletes develop skills outside of their sport. To receive nominations from the athletes and colleagues I work with was really humbling and unexpected. I would like to thank everyone who has helped me develop as a practitioner at the University of Nottingham and in the TASS network. We would like to congratulate both David and Nabil on their success and deserved recognition for their work with talented athletes this year. To find out more about TASS at the University of Nottingham, please visit; TASS - The University of Nottingham. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}