{
    "url": "https://www.nottingham.ac.uk/sport/sport-facilities/accessibility.aspx",
    "content": [
        {
            "p": "Ensuring that sport and fitness is accessible to everyone, including disabled users, is a key priority. On this page you can find detailed information about the accessible features of our sports and fitness facilities on each campus. You can also follow the journeys of disabled students to their activities. Please see below for comprehensive information and guides for all our campus sports facilities. There's also some really useful access videos where some of our disabled students have shared how they access and use our state-of-the-art facilities. If you have any questions about accessibility in any of our facilities, please visit our FAQs page or contact Adam Lever, our Disability Sport Officer, at adam.lever@nottingham.ac.uk. The University of Nottingham has worked with leading accessibility guide AccessAble who have produced comprehensive guides for our venues. To view all the accessible features at Pavilion A, please click here. To view all the accessible features at Pavilion B, please click here. This access video is of one our disabled students Agata- who has a visual impairment. It shows her journey in to the David Ross Sports Village. The video illustrates how Agata accesses the reception, change facilities, lockers, fitness facilities and supported fitness sessions at the centre. This access video is of one of our para-sport scholars - Sean O'Sullivan - following his journey in to David Ross Sports Village. It shows how he accesses the badminton club training sessions in the sports hall and then strength and conditioning in our High Performance Zone. Our Autumn Timetable runs from Monday 7th October to Sunday 15th December 2024 across all 3 campuses! Take a look before and book a session to guarantee your space! We work closely with our Students' Union and Disability Support team to ensure that sport and fitness is accessible for all students and staff at the University. We offer a range of support and activities including supported fitness sessions, sensory quiet times and discounted memberships. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}