{
    "url": "https://www.nottingham.ac.uk/sport/news/",
    "content": [
        {
            "p": "With lots happening here at University of Nottingham Sport, please check out our news articles for all the latest news on our sports teams, programmes and more! The British Judo domestic year reached an incredible conclusion at the University of Warwick with the 2024 British Championships, with University of Nottingham students claiming two medals and one national title. The University of Nottingham continued its remarkable dominance in table tennis on the last weekend of November, delivering a stellar performance at the BUCS Individual Championships 2024 which was held at the university's David Ross Sports Village. The University of Nottingham recently hosted the 2024 BUCS Squash Individuals Championships, with the #GreenandGold taking advantage of home comforts by winning medals in both women's and men's competitions. Silas Starr is an American graduate from Stanford University who is now studying a masters degree at the University of Nottingham as a sports scholar. To kick off their season, a large contingent from the University of Nottingham Snowsports club took to Edinburgh on Friday 15th November for a weekend at BUDS (British University Dryslope Snowsports Championships) 2024. Lucy Thornewell, a BSc Psychology student, has brought her handballing skills and international experience to the University of Nottingham, where she now represents the #GreenandGold. Ashlee Lewis, an MSc Digital Marketing student and former NCAA Division 1 basketball player for Cal State University Fullerton, has brought her talent and experience to the University of Nottingham. On November 2nd, 2024, the University of Nottingham Cycling team participated in the 2024 BUCS Cycling Hill Climb Championships held at Terrace Hill, Leicestershire. Ahead of the first major BUCS event for our performance canoe athletes - the 2024 BUCS Wild Water Racing Championships - we caught up with scholar Dan Johnson to find out more. Our University of Nottingham Lacrosse teams have consistently delivered title winning performances at the BUCS 6s Championships over the years, and entered the 2024 event with high hopes. The 2024 Paralympics have recently concluded after twelve days of engrossing competition with University of Nottingham connected athletes reaching the pinnacle of their sports. The 2024 Olympic Games have now drawn to a conclusion with Nottingham athletes representing their nations in Paris. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}