{
    "url": "https://www.nottingham.ac.uk/sport/membership/corporatemembership.aspx",
    "content": [
        {
            "p": "We offer special discounted membership packages for employees working in certain organisations and employers/workforces looking to join our corporate sport and fitness memberships. 200-station state-of-the-art fitness suite Over 150 weekly group exercise classes Eight-lane 25m indoor swimming pool Health and Wellbeing Suite Enjoy our fantastic fitness facilities at the £40 million David Ross Sports Village with our corporate membership package! With monthly or annual payment options available, our corporate package is a great way to achieve your personal goals or keep your workforce healthy and active. If you are an employee of one of the below organisations, you are eligible for a corporate sports and fitness membership: To purchase your corporate sports and fitness membership, please contact our Membership Team on 01157 486213 or email Membership@nottingham.ac.uk. There is a £20 joining fee required at the time of joining. If you are interested in tailored corporate membership packages for your organisation, contact our Membership Team on 0115 7486213 or e-mail Membership@nottingham.ac.uk. If you are interested in exploring more of what our sport centres have to offer, you can arrange a tour of our facilities with one of our friendly team or book to try our fitness suite for free. To book your tour or arrange to try our fitness suite, please complete this form and one of our team will be in touch. Please allow at least 48 hours from your request of a free trial or visit. You don't have to be a student to take advantage of our facilities. We've got a range of options to help you meet your fitness goals. Our Pay as You Go prices offer a flexible way to enjoy our fitness facilities and activities. Our corporate sports day package gives your business the opportunity to take part in sports and activities to encourage networking and teamwork. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}