{
    "url": "https://www.nottingham.ac.uk/sport/facilities/highfields-sports-complex.aspx",
    "content": [
        {
            "p": "Located adjacent to our University Park campus, Highfields Sport Complex offers top sporting and conference facilities, with provision for several sports including football, rugby, hockey and beach volleyball. Our Highfields Sports Complex offers a flexible outdoor venue for several sports including football, rugby, hockey and beach volleyball. Located adjacent to Highfields, the Nottingham Hockey Centre includes a international-standard water-based hockey pitch owned by the University. Alongside the sporting facilities, the complex has two pavilions offering a total of 19 changing rooms as well as conference and meeting spaces. Built in 1925, the original Highfields Pavilion is one of University of Nottingham's oldest buildings. 1925. The spacious Vaughan Parry Williams Pavilion was completed in 2010 and officially opened by England rugby legend and University of Nottingham alumnus Brian Moore. All areas are available for external bookings and we have a successful track record of hosting world-class events. This included the recent 2023 World Under-24 Ultimate Championships with the World Flying Disc Federation (WFDF). Highfields Sports Complex is situated just outside the University of Nottingham campus, and is closest to the West Entrance when leaving campus. The complex is accessed via the A6005 University Boulevard, with the entrance opposite the Serenity Garden and is entered by crossing the the tram tracks adjacent to University Boulevard. If you are approaching from Clifton Boulevard the entrance will be on your left, and if you are approaching from Beeston town centre the entrance will be on your right. When using a Sat Nav to travel to Highfields Sports Complex, please use the postcode NG7 2PS. _____ Bus Nottingham's bus network is extensive, with frequent services connecting University Park to the city centre and to destinations to the west of Nottingham including Lenton, Beeston and Chilwell. There are bus stops outside the entrance to Highfields on University Boulevard. These stops are served by Trent Barton’ indigo and Skylink Nottingham services. Indigo services run between the City Centre to Long Eaton via Beeston and Chilwell with some services continuing to Derby. Skylink services run between the City Centre and East Midlands Airport via Long Eaton. See the Trent Barton bus map for more information. Tram Nottingham’s tram lines provide direct links to Highfields from various points around the city - including Nottingham Train Station. The closest stop for Highfields is the University Boulevard stop. For more information including tickets, tram stops and timetables, please visit https://www.thetram.net/ E-bikes Lime has launched an e-bike rental scheme in the Nottingham City area. Users can pick up and return Lime e-bikes from a network of designated e-bike-hire bays across the city – and there is pick up/drop off spot opposite the entrance to Highfields on University Boulevard. You can hire e-bikes through the Lime app which is available on the Apple app store or the Google Play store. Cycling If you want to cycle to Highfields using your own bike then there are cycle hoops opposite the Pavilion. Don’t forget your D lock to secure your bike while you’re using the sports facilities. Highfields Sports Complex Beeston Nottingham NG7 2PS t: +44 (0)115 925 6819 what3words: basis.output.never Take a 360 tour of Highfields Sport Complex From local school events, to national and international competitions we have an outstanding portfolio of sports facilities and a wealth of experience supporting major sporting events. Get in touch and tell us about your event. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": [
        "uk_pdf_files/trent-barton-bus-map.pdf",
        "uk_pdf_files/trent-barton-bus-map.pdf"
    ]
}