{
    "url": "https://www.nottingham.ac.uk/Sport/Membership/Public/David-Ross-Sports-Village-Membership.aspx",
    "content": [
        {
            "p": "Members of the local community can take advantage of our fantastic health and fitness facilities at the £40 million David Ross Sports Village. We offer a number of different public membership packages at David Ross Sports Village, located at University Park campus, to best suit your fitness goals. 200-station state-of-the-art fitness suite The latest in fitness technology An extensive range of group exercise classes, including Les Mills' group exercise sessions Eight-lane 25m indoor swimming pool Access to our Health and Wellbeing Suite Indoor court hire badminton, basketball, volleyball, squash courts and snooker room (for an additional fee) Free fitness inductions and programme reviews Add a Health and Wellbeing Suite bolt-on to your membership Access to our new personal training service Discounted rates to our Sports Injury Clinic (located at David Ross Sports Village) Kids go free during University holidays Add children to your membership for only £3 a session during term time An extensive range of group exercise classes each week, including Les Mill's Indoor Cycling and BodyPump™ Our most popular and best value public membership package with 12 months for the price of 10! A more flexible option allowing you to make the most of our excellent fitness and pool facilities with monthly payments. There is a £20 joining fee required at the time of joining. Our monthly package is a rolling membership and you may cancel the membership at any time with one full calendar months’ notice. Annual memberships start from the date of joining and will not automatically renew. You will receive a renewal notice on the final month of your membership. Come along to any of our sport centres between 10am - 4pm on Saturday 18 and Sunday 19 January to give our fitness facilities go for free, and chat to us about our membership packages. No booking is required for the fitness suite, and other activities including swimming, group exercise classes and indoor courts will be subject to availability on the day."
        }
    ],
    "pdf_files": [
        "uk_pdf_files/route-to-pool.pdf"
    ]
}