{
    "url": "https://www.nottingham.ac.uk/Sport/Commercial/Digital-Engagement/Digital-Engagement.aspx",
    "content": [
        {
            "p": "Here at UoN Sport, we provide the opportunity to deliver a fully integrated digital sponsorship package, offering high value marketing and digital advertising opportunities, to help your business meet its goals. Our digital engagement campaigns are award-winning, and we are constantly striving to find new and innovative ways to increase digital engagement amongst our student and external audience. Most recently, we have installed two Jumbo scoreboards, one at Nottingham Hockey Centre and at the David Ross Sports Village 3G artificial pitch to provide cutting-edge opportunities to communicate with our audience and enhance the match days for players and spectators. With over 1.8 million website hits annually, over 33,700 social media followers and an email database made up over 25,000 people, we can provide measurable and trackable digital routes to advertise and increase you brand reach amongst students and external audience. There is also the opportunity to advertise throughout our three sports centres, including the £40 million David Ross Sports Village. With an annual footfall of more than 2 million people across our sports centres, our 12 digital screens are the perfect place to advertise to our growing membership base and sports centre visitors. We even have Life Fitness screens available on some of our cardio machines, including treadmills and cross trainers, for more specific and targeted advertising in our state-of-the-art fitness suites. We also offer plenty of opportunities to utilise our digital assets on match days, through our jumbo scoreboards and match day livestreams. With over 117,000 minutes of live stream footage watched across 2021/22, our match day live streams present a further opportunity to place eye-catching advertisements to engage our digital audience. Our award-winning marketing team can work with you to build bespoke partnership opportunities on high value and unique platforms to help you achieve your business goals. If you are interested in finding out more about our partnership opportunities and digital engagement campaigns, please enquire below. We are able to support you in increasing your brand profile and reach amongst our student audience and beyond. Find out more about our exciting partnership and sponsorship opportunities at University of Nottingham Sport."
        }
    ],
    "pdf_files": []
}