{
    "url": "https://www.nottingham.ac.uk/sport/inclusive-sport/our-campaigns/our-campaigns.aspx",
    "content": [
        {
            "p": "We hope that by encouraging an open and inclusive atmosphere through our fitness offer and sports clubs that more people will feel able to join us, make friends and keep active during their time in Nottingham. Being physically active can help us lead healthier lives - and it has an important role to play in improving wellbeing. So whether it's providing our students a platform to speak on topics important to them, or with our own campaigns targeted at helping certain groups to be active, we're working hard to ensure that sport can inclusive and accessible for all at the University of Nottingham. Our brand new Empower campaign is for women, trans and non-binary identifying students at the University of Nottingham. We aim to create a dynamic and welcoming community where you can try something different, meet new people and get active. Men’s Health Active is an initiative which has been designed to encourage male students (and those who identify as male) to use sport and physical activity to help them maintain good levels of mental health. Our Black Sport Collective helps bring together black students at the University that are interested in sport and fitness at all levels and provides a support system to inspire and motivate you to excel. Sport has an amazing power to bring people together. Following and taking part can give us community, energy and a sense of belonging. That’s why we all need to play our part to make sport everyone’s game. Rugby Minds is a campaign at the University of Nottingham aiming to better the player welfare and club culture within the men’s, women’s and IMS rugby clubs. From live spectator sport to one-day tournaments, from our award-winning Girls' Night In to our hard-hitting 'Let's Talk #GreenandGold' events, we've got you covered! Make sure you don't miss out and get involved with the latest events from University of Nottingham Sport. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}