{
    "url": "https://www.nottingham.ac.uk/sport/news/medals-for-nottingham-athletes-at-world-university-canoe-championships",
    "content": [
        {
            "p": "Sport / News / Medals for Nottingham athletes at World University Canoe Championships The FISU World University Championships of Canoe Sports took place from the 21st to the 24 August in Montemor-O-Velho, Portugal. A number of University of Nottingham athletes took to the water representing Great Britain, and delivered exceptional performances which resulted in a number of medals. Of the six medals won by Great Britain athletes at the the 2024 FISU (International University Sports Federation) World University Championships of Canoe Sports, we are delighted that five of those were earned by University of Nottingham athletes. The championships, taking place over three days, brought huge success for Thomas Lambert. Lambert, a C1 specialist, raced in the 500m, 1000m, and 5000m disciplines for C1 sprint and came away from the championships with a silver medal from all three events. There was also success in the men's K1 sprint over 5,000m for Finn Cadell who also won a superb silver, whilst Matt Collinge raced to second place in the K1 marathon event making it five silver medals from the championships for University of Nottingham athletes. Alongside Lambert, Cadell, and Collinge, the University of Nottingham also had representation across the championships with at least seven #GreenandGold athletes in competition. These included Amy Green, Katie Pocklington, Elise Montagna, and Lucy Guest who all took to the water in the women's kayak competitions for Great Britain. We would like to congratulate all of our canoe and kayak athletes on their efforts and achievements at the championships in Portugal this summer. You can find out more about the championships by visiting the official site here, and you can find out more about the leading performance canoe programme at the University of Nottingham by clicking here. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}