{
    "url": "https://www.nottingham.ac.uk/sport/news/englands-rising-star-tom-penniceard-all-set-for-senior-debut-at-touch-world-cup",
    "content": [
        {
            "p": "Sport / News / England’s rising star Tom Penniceard all set for senior debut at Touch World Cup Tom, 19, who studies Product Design and Manufacture, will be the youngest English player in the Men’s Open category at the Touch World Cup which kicks off at the University of Nottingham next week. The tenth edition of the tournament will be hosted in England for the first time by the 2024 Sporting University of the Year*. Running from 15 – 21 July, over 1,000 fixtures will take place across Highfields and Riverside sports complexes with a dedicated athlete village at University Park. It is also set to be the greenest ever World Touch event with sustainability a key driver in the competition set up. The teenager, who hails from a rugby-playing family in South London, has been playing rugby union as long as he could run and catch. When he was just eleven years old, his father set up a touch rugby club in their hometown where Tom and his twin brother Max (also a University of Nottingham student) quickly rose through the ranks. Often competing against adult teams, the pair were quickly spotted by the national team programme and made their England age group debut at just 14 years old. Fast forward 4 years, and with the Touch World Cup confirmed to be on home soil in Nottingham, Tom arrived to study in Nottingham with his goal set – represent his country. His Rugby Union commitments took a back seat as he focussed on touch – training hard with his brother and team mates at the University’s brand-new Touch club. “The sports set up at the University of Nottingham was a huge attraction when choosing where to study and coupled with the reputation and content of my course, Product design and manufacture, it was the perfect choice for me.” Despite his credentials, senior selection was far from sealed with a competitive training environment of 50 players all fighting for a spot in the England squad. Head Coach Tim Osborne, however, had faith in his young star naming Tom in his 16-man line up for the biggest ever Touch World Cup. “On the day of the squad announcement, I was waiting by my phone and when the list came through and my name was on it, I was so excited. To have the home support behind us will be pretty special, but as a University of Nottingham student it means so much more to be playing in this city. Being at home, feeling comfortable where I am – I cannot wait.” The tournament favourites may be Touch giants Australia and New Zealand but the England camp is quietly confident and no longer see themselves as underdogs. Tom and his teammates have their sights set on a medal and will be hoping the home support will help propel them to the top of the podium. Tickets to the Touch World Cup are free-of-charge and spectators can enjoy top-level action at both Highfields and Riverside sports complexes from the 15th of July, with the finals scheduled for Sunday 21st. Find out more about the schedule and how to get to the venue here. ** As awarded by The Times and Sunday Times Good University Guide and the Daily Mail. On the day of the squad announcement, I was waiting by my phone and when the list came through and my name was on it, I was so excited. The 2024 Touch World Cup will take place from 15 – 21 July. For more information, visit: www.englandtouch.org.uk/touch-world-cup-2024/. The University of Nottingham is a leading destination for major national and international sporting events. For more information on the facilities and services we can offer to event organisers, please contact Christine Bailey at christine.bailey@nottingham.a.uk or click here. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}