{
    "url": "https://www.nottingham.ac.uk/sport/facilities/campus-walking-routes.aspx",
    "content": [
        {
            "p": "The University of Nottingham Sport team have put together a selection of our favourite walking routes on University Park campus and Jubilee campus for you to try. Our routes range from quick 15 minute strolls to longer 3km plus routes and take in some of the most beautiful sights of our extensive campuses. Perfect to get some fresh air and exercise at the same time! Or why not take your meeting or work call outside along one of the routes? Have you got a different route you enjoy? We'd love to share them with our campus community - please get in touch with us at sport@nottingham.ac.uk or via social media at @uonsport. Wheelchair users and those with mobility impairments - we have tried to make sure routes avoid steps. However, the University Park site is hilly, therefore if you struggle with self-propelling up inclines then these routes may be challenging. Start at David Ross Sports Village main entrance, following the drive down to Beeston Lane and then across to the Orchard Hotel. Follow the footpath to the left side of the hotel, taking the right fork in the path heading towards the Millenium Gardens. Continue on the right side of the garden onto the path alongside the Law and Social Sciences building and then onto Cut through Lane. Pass the front of the Portland Building on your right and then take a left onto Library Road. At the end of Library Road, cross onto The Downs following the path down and then across to the left, walking inbetween Rutland Hall and Sherwood Hall. Cross Beeston Lane and follow the path across back to David Ross Sports Village. Download PDF map Start at the rear entrance of the Portland Building. Turn left and follow the path down towards the Lakeside Arts Centre. Pick up the lakeside path and continue around all the lake. To extend your walk you could double up and do two loops of the lake before returning to your start point. Our notes start the walk at David Ross Sports Village main reception, but you could start anywhere along the route. Turn right and walk through the Nightingale Hall car park and pick up the footpath on your right, which takes you behind the Humanities Buidling. Rejoin and then cross Beeston Lane continuing along the footpath until you join Cut Through Lane. Cross, and then take the part to the right by the giant chess set. Turn left close to the rear of the Trent Building and then take the steps down to, and across the front of the Portland Building. Turn left and walk up the hill to rejoin Cut Through Lane. Follow the road round and then turn left up Cripps Hill. At the top, turn left onto Lenton Hall Drive and walk along until you meet the path across The Downs. Follow this path down inbetween Rutland and Sherwood Hall then cross the road and walk back across the path to David Ross Sports Village. Begin at the University's West Entrance and follow the path alongside Cut Through Lane. Near the top of the hill, take a left onto the path running adjacent to the Law and Social Sciences Building and continue into the Millennium Gardens. Follow the path down towards the Orchard Hotel and then across to pick up the path on the other side of the garden to Lenton Hall Drive. Further along take the path on your right between Hugh Stewart Hall and Cripps Hall, then turn left and head down to meet Cripps Hill. Continue down Cripps Hill, taking a left towards the North Entrance barrier. Turn around and head back towards central campus, taking the left fork onto Cut Through Lane. Continue up the hill, taking the path onto the steps outside Portland Building. Follow the path across and down towards the Trent Building, walking through the building and out onto Jubilee Avenue. From Jubilee Avenue, cut across on the footpath to reach Cut Through Lane and head back to your start point. 1. Millennium Garden Start point. One of the only mapped gardens on campus. Meet on the island with the tree above the water. 2. Highfields Walled Garden Just next to the large chess set between Trent Building and Law and Social Sciences, this one is hidden in plain sight and is a nice quiet place to have a sit. 3. The Old Botanic Garden Another garden very central but often not seen, this one stands on the same surface as Portland Hill. 4. Hugh Stewart Rock Garden A diverse dip in the university grounds between Hallward Library and Hugh Stewart Hall, this garden is another quiet spot that offers a bit more to explore than the others. 5. Lenton Firs Rock Garden Just near the large ‘Nottingham’ sign as you enter the campus through the North Entrance, this finish point has some nice horticulture and a waterfall to enjoy, with a great view of the Architecture and Built Environment department. 2. Jeykll Garden Another hidden one just off the main road via a walk down The Downs. 3. Lenton Firs Rock Garden Just near the large ‘Nottingham’ sign as you enter the campus through the North Entrance, this point has some nice horticulture and a waterfall to enjoy, with a great view of the Architecture and Built Environment department. 4. Hugh Stewart Rock Garden A diverse dip in the university grounds between Hallward Library and Hugh Stewart Hall, this garden is another quiet spot that offers a bit more to explore than the others. 5. The Old Botanic Garden Another garden very central but often not seen, this one stands on the same surface as Portland Hill. 6. Highfields Walled Garden Just next to the large chess set between Trent Building and Law and Social Sciences, this one is hidden in plain sight and is a nice quiet place to have a sit. 1. Millennium Garden Back to start to complete walk. Begin at the Research Acceleration and Demonstration Building. Face the sports ground and take the path around the edge, continuing past the Conference Centre. Follow the path around to the right towards the Business School South. Continue along the path to the Business School North and then onto Melton Hall and the end of the path. Turn around and head back to the Business School South. Follow the path straight on, going past the Conference Centre again and heading back to your start point. Begin at the main entrance of the Jubilee Sports Centre and take a left, heading down towards the Sir Colin Campbell Building. Turn right and follow the path along the waterway. Turn right again and continue along the path to Business School South. Turn left and follow the path down to the Conference Centre and then around the sports ground. Continue on past the Conference Centre once again and head back up to the waterway path. Turn right back up to Triumph Road and then left back to your start point at Jubilee Sports Centre. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/upc-od-walk-1.pdf",
        "uk_pdf_files/upc-od-walk-2.pdf",
        "uk_pdf_files/upc-od-walk-3.pdf",
        "uk_pdf_files/upc-od-walk-4.pdf",
        "uk_pdf_files/upc-od-walk-5.pdf",
        "uk_pdf_files/upc-od-walk-6.pdf",
        "uk_pdf_files/jubileecampus-od-walk-1.pdf",
        "uk_pdf_files/jubileecampus-od-walk-2.pdf"
    ]
}