{
    "url": "https://www.nottingham.ac.uk/sport/membership/family-and-kids/kids-activities.aspx",
    "content": [
        {
            "p": "Keep your family entertained and bring your kids to enjoy some of their favourite activities at our fantastic sports facilities including swimming and climbing. £2.50 during term-time, all our children's activities are free-of-charge during the University holidays for our members and University community. Did you know - you can bring your children with you to enjoy some of our most popular activities at our three campus sports facilities? Children (aged 15 years and under) can access a great range of fun activities including swimming, climbing and squash - perfect for staying active together with the whole family. Just £3.00 per child during term-time - all activities are free-of-charge during the University holidays for UoN sport and fitness members and the wider University community. Ideal for keeping the kids occupied during the school break! Swim in our indoor pool Climb or boulder on our indoor climbing wall Have a game of squash Book a hall for badminton, basketball, volleyball or table tennis Book an outdoor court for 3 v 3 basketball, netball or tennis Book our snooker tables at David Ross Sports Village All activities are £3.00 per child during University term-time. All activities are free-of-charge during University holidays if you hold a UoN sport and fitness membership or are a University of Nottingham student, staff member, alumni or associate. Members of the public (without a UoN sport and fitness membership) can continue to bring their children for £3.00 per child. You can bring up to three children per visit. Please book your activity under your adult account, then register and pay for your children upon arrival at our sports centre reception. You can book: You can view the University holiday dates here. Please note our adult - child ratio when using our swimming pool is: 1 adult to 1 child aged 0 – 3 years; 1 adult to 2 children aged 4-7 years. For children aged 8 and over, the adult is not required to go in the water but must please remain in the swimming pool environment. If you can declare that you are a experienced climber, then you can start climbing with and supervise up to three novices or Under 16s - please complete our declaration form at reception upon arrival for your first visit. Children under 16 years of age may not belay other children or adults unless being supervised by a qualified instructor. We have a great programme of activities for kids and fun for all of the family. From children's swimming and climbing lessons, we've got you covered. We offer a variety of sessions and programmes to introduce children to climbing and give them the confidence and support they'll need to get to the top! Our range of membership packages offer the best value option for using our extensive health and fitness facilities. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}