{
    "url": "https://www.nottingham.ac.uk/Sport/Commercial/Activation/Activation.aspx",
    "content": [
        {
            "p": "Activation is a fun and engaging way to interact with your audience and increase your brand presence by creating memorable experiences. We are able to support you on providing activation opportunities amongst our student and external audiences, depending on your business objectives. At University of Nottingham Sport, we are committed to building strong and lasting partnerships with organisations, helping you achieve your business goals whilst supporting us in our mission to engage and inspire our community to get active. With our global profile and strong local community engagement, we are able to provide unique activation and brand interaction opportunities to support your organisation in raising the profile and connecting with your target audience. Event sponsorship and activation provide a fun and memorable opportunity to increase reach and profile throughout engagement with our student audience We offer rights to activation activities which can help your organisation raise its profile in line with your objectives, whether it be to raise brand awareness, increase product purchases or to connect with your target audience. With numerous brand activation opportunities for your organisation to increase brand awareness and presence, there has never been a better time to partner with University of Nottingham Sport. Event and match day sponsorship Spectator experiences Competitions and giveaways Product sampling Pop-up events and stands Our award-winning marketing team are able to work with your organisation to generate unique activation campaigns, designed to create excitement and build a strong affiliation with your brand amongst our student audience. If you are interested in finding out more about our partnership opportunities, please enquire below. Our award winning The Headliner series in partnership with Red Bull has become a flagship event amongst our student audience. We can support you in utilising our digital engagement platforms and maximising your brand reach. Find out more about our exciting partnership and sponsorship opportunities at University of Nottingham Sport."
        }
    ],
    "pdf_files": []
}