{
    "url": "https://www.nottingham.ac.uk/sport/whats-on/the-headliner.aspx",
    "content": [
        {
            "p": "Our final Headliner event of 2024 sees the University of Nottingham American Football team in action at David Ross Sports Village on Saturday 7 December in a BUCS National League fixture. Taking on Loughborough, the #GreenandGold will be looking to continue their 100% win record so far having already beaten current BUCS champions UWE away from home. The Headliner fixture will kick-off at 6pm, with tickets available to purchase now! Purchase your tickets here. The Headliner with Red Bull is a multi-award-winning event series, hosted on campus, showcasing our BUCS teams competing at the top level of university sport. The series is competitive as our teams compete against other Universities at the top of the BUCS table. Expect to see rising-star student athletes on campus, metres away from your halls of residence or university lectures. Support from Red Bull promises an extra special match day experience for spectators. Support, noise and anything #GreenandGold is encouraged. Past fixtures have been known to bring in crowds of over 600 supporters - this isn't an event to miss! Even if you can't be in attendance in person, Headliner matches are also usually streamed live on the UoN Sport YouTube channel - complete with commentators and pre and post-match broadcast. Men's Rugby Union vs Leeds Beckett Once again opening the BUCS season at the University of Nottingham, the #GreenandGold of UNRUC took to the field for the biggest event of Fresher's week 2024 as they took on Leeds Beckett. The two BUCS Super Rugby sides went toe-to-toe before a last minute try saw the University of Nottingham come out as victors by a score of 28-24. Watch the action back with our stream Women's Football vs Durham Our women's football Headliner event saw the University of Nottingham Women's Football in action at David Ross Sports Village on Wednesday 6 March in a BUCS Championship semi-final. The fixture was a very evenly matched and closely fought affair with Nottingham's oppenents Durham just edging the final score 1-0 after extra time. NBL Badminton vs Wycombe Performance Our latest Headliner event saw the return of the National Badminton League (NBL) as the competition returns to the courts. The #GreenandGold started their season in style with a victory over Wycombe Performance. With the return of former scholars alongside current badminton first teamers, and a fantastic festive crowd, Nottingham ran out 5-0 winners! Men's Rugby Union vs Loughborough Our first Headliner of the 2023/24 academic year saw Men's University of Nottingham Rugby Club take on rivals Loughborough at Highfields. Opening the BUCS Super Rugby season, as well as the overall BUCS season for the University of Nottingham, the #GreenandGold put in a fantastic effort but just came up short. The final score on the day was 20-27 to the visitors. Watch the recap reel Women's Netball vs Gloucestershire Our second Headliner of the academic year, and first of 2023 highlighted our Netball 1st team as they looked to progress on the #RoadToNottingham in the Championship Cup. With a place in the quarter finals on the line, the team delivered a commanding performance with a 73-31 victory over visitors Gloucestershire! Read the full match report Men's & Women's Hockey vs Bath Our Hockey Headliner certainly did not disappoint with both the men's and women's teams producing two huge wins against the University of Bath. The women’s 1s scored goals galore and came out victorious with a 6 – 2 score line and the men’s 1s followed in their footsteps to win 4 - 0 in front of a delighted #GreenandGold crowd. Men's & Women's Volleyball vs Northumbria On 2nd February 2022, our Volleyball club became the laters team to be our Headliners. Hosted at David Ross Sports Village, University of Nottingham’s flagship sporting venue, the Women’s volleyball match was the first of the 2022 Headliner line up and part of an exciting double header with the Men’s game against Northumbria following directly after. Men's Football vs Birmingham On 24th November 2021, our Men's Football first team will host University of Birmingham at David Ross Sports Village in the BUCS Trophy. Both teams are on the #RoadtoNottingham, competing to secure their place in the BUCS Trophy final - the titel won by Nottingham in 2019. Men's and Women's Squash Championship Semi-Final On 11th March 2020, we welcomed the University of Edinburgh and the University of Birmingham to David Ross Sports Village to feature as The Headliner in Women’s and Men’s Championship semi-finals. Both teams were on the #RoadtoNottingham, competing to secure their place in the final. The afternoon of squash finished with the Men’s team securing a place in the final here on BUCS Big Wednesday. Women's Water Polo vs Warwrick On 29th January 2020, Nottingham hosted the second Headliner event of the academic year. Our girl’s Water Polo team went up against Warwick for an intense 4 quarters and came out on top with the final score resting at 33-5 to Nottingham. American Football vs Stirling Playing in the BUCS Premier division, our American Football team started their BUCS season with a sell-out fixture at the David Ross Sports Village. The match was closely contested with strong defence on either side. With support from over 450 spectators, the clansmen got a last minute touchdown to claim the win. The final score was 6-13. Women's Lacrosse vs Oxford Playing in BUCS Premier North, the ladies lacrosse team were featured in February 2019 when they faced Oxford in the Championship Cup. After an intense match with support from crowds of over 400 #GreenandGold spectators, it unfortunately didn’t go Nottingham’s way as a strong Oxford side took the win. The final score was 6-10. Women's Netball vs Nottingham Trent Once a fixture is announced, tickets will be made available online. Be sure to do this quickly to avoid disapointment, as sell-outs are expected. Add the link to your group chat to make sure your friends don't miss out either. All Headliner fixtures will be livestreamed over on our UoN Sport YouTube and UoN Sport Facebook Page, so you don't miss out on the action. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}