{
    "url": "https://www.nottingham.ac.uk/sport/work-with-us.aspx",
    "content": [
        {
            "p": "We're looking for exceptional people to support our ambitious programme providing sport, health and wellbeing opportunities for our University and wider community. We value and celebrate equality in opportunities and we welcome applications from people who reflect the diversity of our communities. Please see below for ongoing opportunities within our team and links to view current University opportunities. To provide a high quality, friendly, well organised and professional service to the department’s customers within the University’s fitness facilities; to support the delivery of an inspiring and motivating environment; Responsibilities include, new member inductions; writing fitness programmes; delivering fitness classes; giving help and guidance to members; walking the gym floor engaging, interacting and looking after the well-being and motivation of our members. A current NVQ level 2 qualification (or equivalent) in gym/fitness instructing is essential to this role. Casual fitness instructors will work to cover annual leave and busy periods at our facilities. There are no set hours of work - hours are felxible and by mutual agreement. Full training is provided. Rate of pay: £13.88 To register your interest, please send your CV and supporting information to: james.nee@nottingham.ac.uk. We're currently recruiting group exercise instructors to deliver a range of classes, specifically Pilates, Aqua, Zumba and Les Mills programmes. Fitness qualifications and previous experience are essential as well as a commitment to deliver an excellent experience for our sport and fitness members. To register your interest please send your CV and supporting information to caroline.martin@nottingham.ac.uk. For further information or to arrange a visit our facilities please email caroline.martin@nottingham.ac.uk. Rate of pay: £25.00 David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}