{
    "url": "https://www.nottingham.ac.uk/sport/inclusive-sport/inclusive-sport-and-fitness/inclusive-sport-and-fitness.aspx",
    "content": [
        {
            "p": "Our dedicated inclusive sport team lead a range of initiatives to support you if you have a disability, long-term or mental health condition to access our huge range of sports clubs, sports sessions and health and fitness facilities. Our student sport and fitness membership, or Active Living package (if you're living in University-owned halls on University Park or Jubilee campus), covers a huge range of activities at all three of our campuses. You can work out in our fitness suites, take a dip in the pool, join a class, try climbing and much more. If you are a disabled student or a student with a long-term health condition you may be entitled to a 50% discount on your UoN sport and fitness membership. We call this our Disability Referral Sport Membership Scheme. To find out more about the process you will need to follow to access the discounted membership, please see the below. Speak to your Disability Support or Mental Health Advisor about whether you are eligible to access the discounted sport membership. If you are not already linked into an advisor, you can contact the teams on the following email addresses: Disability Support Services: SS-disab-support@exmail.nottingham.ac.uk Mental Health Advisory team: BR-MH-Support@exmail.nottingham.ac.uk If you are eligible for the discounted membership, you will be referred through to the Disability Sport Officer who will provide you with more information about the sports membership. There will be an opportunity to meet with the Disability Sport Officer to discuss the sports membership and the support available to you. The Disability Sport Officer will aim to contact you within 5 to 7 working days. Please note that if we receive a referral for you to access the discounted membership, this referral will be valid for the duration of your study. If you decide that you would like to purchase the discounted membership, our sports membership team will set your sports membership up for you. You will be able to pay for your membership via your online account or at any of our sport centre receptions. You are now ready to access the inclusive sport, activity and fitness offer we provide at the University of Nottingham. If you have any questions about the scheme, please contact our Disability Sport Officer. Our Accessible Climbing Sessions are for disabled students and students with long term health conditions who would like the opportunity to climb. If the accessible climbing session is not at a convenient time for you, it may be possible to arrange an alternative time for you to access the wall. At these sessions, we: To book or to find out more, please email Adam Lever, our Disability Sport Officer, at adam.lever@nottingham.ac.uk. From live spectator sport to one-day tournaments, from our award-winning Girls' Night In to our hard-hitting 'Let's Talk #GreenandGold' events, we've got you covered! Make sure you don't miss out and get involved with the latest events from University of Nottingham Sport. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}