{
    "url": "https://www.nottingham.ac.uk/sport/membership/family-and-kids/family-and-kids.aspx",
    "content": [
        {
            "p": "We have a great programme of activities for the whole family at University of Nottingham Sport, with lots on offer for the little ones. From children's swimming and climbing lessons to holiday camps and sports activities, there's plenty to choose from. There is plenty of activities for all the family to enjoy at University of Nottingham Sport in a fun, friendly and safe environment. Bring your children with you for a range of activities including swimming and climbing - we even have a fantastic Kids Go Free offer during the holidays. We also offer our popular Swim and Climbing Schools, as well as opportunities with our partners Tumble Tots and Kings Camps. For older ones, our Young Person's sport and fitness membership is the perfect introduction to our fitness facilities. Want to bring your children swimming, climbing or for a game of badminton? £3 during term-time, our activities are free for children during University holidays. Our highly trained qualified teachers offer baby, toddler and junior swimming lessons that will teach your little ones to love the water. We offer a variety of sessions and programmes to introduce children to climbing and give them the confidence and support they'll need to get to the top! 16 and 17 year olds can take advantage of our great value Young Person membership and access our fitness facilities across all three campuses. These popular sports holiday camps for 5-17 year olds are based at David Ross Sports Village. University students and staff can access a special discount code by emailing uons-bookings@nottingham.ac.uk. Hosted at David Ross Sports Village, each 45 minute Tumble Tots session has been carefully designed to enhance child's physical development skills alongside their social and cognitive development. Did you know - all University of Nottingham sport and fitness members and University of Nottingham students and staff can bring their children free-of-charge during the University holidays? Activities include swimming, climbing, badminton and more - so why not bring the family down for some active fun? +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}