{
    "url": "https://www.nottingham.ac.uk/sport/bookings-and-timetables/climb/childrens-climbing.aspx",
    "content": [
        {
            "p": "Fun, friendly indoor climbing lessons for children of all ages, led by experienced instructors and coaches We have a number of opportunities to introduce children to climbing and give them the confidence and support they'll need to get to the top! From introductory taster sessions to Birthday parties or external youth groups we can provide all the training and equipment your child needs to have a fun, safe and rewarding session on the wall. There is no minimum age for children, but parents are fully responsible for supervising their children and ensuring their safety while in the climbing wall. Please be aware we do not hire children's harnesses. If you want to take your own children climbing we ask that you complete a registration form at reception to demonstrate competence. Young people aged under 16 years old must be accompanied by a parent / guardian at all times when using the climbing wall. The parent / guardian will also need to complete a supervising form for their child before each visit. Our NICAS Academy runs during school terms. Sessions run on Saturdays and Sundays 8am, 9.10am, 10.30am & 11.50am and must be booked in advance through David Ross Sports Village reception or by calling 0115 7487000. Wild Climbers: 8am - This is for children aged 51/2 to 7 years of age. NICAS 7: 9.10am - This is for children aged between 7 and 11 NICAS 7: 10.30am - This is for children aged between 7 and 11 NICAS 12: 11.50am - This is for children between the age of 12 & 17. Children under 7 will be offered Wild Climbers (Logbook £15) and age 7 and above will be offered NICAS (Logbook £10). For more information about the NICAS & Wild Climbers scheme please visit the NICAS website. The cost of the sessions will depend on which level the child is on and must be booked for a block of sessions. This can be either 6 or 7 week block. Once booked sessions are not refundable: If you would like to book a taster for your child to see if they like climbing please contact a member of the climbing wall team - these are £13 per child. For further details please contact the climbing wall team. As a NICAS delivery centre, we are now offering this training. Parents will be required to purchase a scheme log book to allow the children to log their experience. All current children will be offered the option of starting with Level 1 (we may have the option to exempt some children from level 1 if we feel they have already met the required standard) and move straight to level 2). +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}