{
    "url": "https://www.nottingham.ac.uk/sport/news/news/news/headliner-victory-for-womens-water-polo.aspx",
    "content": [
        {
            "p": "On 29th January 2020, Nottingham hosted the second Headliner event of the academic year. Our girl’s Water Polo team went up against Warwick for an intense 4 quarters and came out on top with the final score resting at 33-5 to Nottingham. We had an excellent start to the game with Nottingham scoring 3 goals in the first few minutes. The 1st quarter finished 12-2 to Nottingham after some confident saves by our Nottingham goalie, Rhona Savin, and an excellent score by Rachael Lewin with less than 30 seconds left on the clock. Nottingham’s strong defence created 3 turnovers in the 2nd quarter after Warwick could not get past the #GreenandGold defensive line. Another goal was scored by Lewin with only 4 seconds on the clock to close the first half, 17-4 to Nottingham. Half time saw an excellent performance by UoN Sport’s Synchronised Swimming club, hyping up the crowd for the final half of the game. Nottingham took the ball with style into the 3rd quarter. They continued the quarter with top class saves from Nottingham goalie, Savin once again. Alex Bryant also had a smashing goal in the final quarter, raising Nottingham’s score to 28-4 going into the final quarter. Crowds were full off support after a high scoring game and were confident in the #GreenandGold to secure a victory. After some intense game play, the final quarter finished with Warwick smashing the ball into the back of the net just as the horn sounded. This left the final score at an amazing 33-5 to Nottingham! We caught up with our Water Polo captain, Abigail Turner, about how she felt the game went; “I think it went really well, the score board reflects how we played in the water. It shows the teams we are going to play against in the future that we are not here to mess around.” Speaking about performing at the Headliner; “It was such a great opportunity for Water Polo! It means so much to us, especially as a female team it is such an amazing opportunity.” Abbie also spoke to us about the goals she wants for the future of the water polo team; “I want to get us into the premier league. We were disappointed last year but I think we’ve got such a strong chance this year especially getting a goal difference at fixtures like this. There’s no reason for us not to be there.” Rachel Lewin, player No.2, was awarded player of the match after scoring so many amazing goals and continuous top-class game play. Speaking about how she felt the game went; “It went really well. I have to give my hat off to Warwick, being a new team coming here can be really intimidating and I think they held their heads the whole time and never gave up. As we’ve seen from this match our team is pretty well developed. I think we have some progress to make that will eventually get us into the premier league.” Looking forward to the rest of the season, Head Coach, Sam Joyce said; “We changed up the team a bit during the game, so everyone got good match time. I am really pleased with the whole team performance. This is all part of the pathway we will be building on towards March for BUCS Big Wednesday here in Nottingham and hopefully the premiership play-offs as well.” The Nottingham Women’s team will continue their season in BUCS Tier 1 and will be aiming to progress through the Trophy stages to play at home again in the BUCS Big Wednesday Final, on 25th March 2020. Find out more about BUCS Big Wednesday. Find out more about Performance Water Polo at the University of Nottingham. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}