{
    "url": "https://www.nottingham.ac.uk/Sport/Commercial/Facility-Hire/Facility-Hire.aspx",
    "content": [
        {
            "p": "Our world class sports facilities, including the £40 million David Ross Sports Village at University of Nottingham are available for external venue hire to host major events, competitions and media days. Here at University of Nottingham Sport, we have the expertise to help create a venue like no other to stage your event, by offering support in dressing our facilities for a bespoke event. With a large number of unique and functional spaces, including state-of-the-art facilities with spectator seating, we can provide a versatile facility that can be tailored for both sporting and non-sporting events, catering to events of all sizes. Major events we have previously hosted include Table Tennis England Mark Bates Senior Championships, BUCS Big Wednesday (2018 - 22) and The Hundred content and media days. We are conveniently situated in the heart of central England with excellent rail and road links, making Nottingham the perfect place to accommodate local and national events. Our central location is not only ideal for national events, but is also the perfect place to accommodate international events being well connected to a number of international airports. We also have a number of accommodation options on campus and within walking distance of our sporting facilities. 3 state-of-the-art sports centres (including the £40 million David Ross Sports Village) Indoor sporting facilities (including sports halls, squash courts, martial arts dojo, salle, climbing wall, swimming pool) Outdoor sporting facilities (including 3G artificial pitches, water-based hockey pitches, grass pitches and beach volleyball courts) Dressing of the venue with event branding Free wifi across campus with options for dedicated data point access for livestreaming or media On-site café and lounge area at David Ross Sports Village Conference room and meeting spaces Student event volunteers (in some circumstances) Bespoke catering solutions We welcomed The Hundred to David Ross Sports Village to host their media and content days and transformed our facilities to provide a professional environment to capture engaging content. We pride ourselves on being able to deliver a professional and friendly training and recovery environment to suit the needs of your team or organisation. Find out more about our exciting partnership and sponsorship opportunities at University of Nottingham Sport."
        }
    ],
    "pdf_files": []
}