{
    "url": "https://www.nottingham.ac.uk/sport/membership/alumni-and-associate-sports-membership.aspx",
    "content": [
        {
            "p": "Alumni and Associate Sport and Fitness Membership offers excellent value for money here at the University of Nottingham. As well as the £40 million David Ross Sports Village with gym, swim and climb facilities, Alumni and Associate Membership also includes access to our sports centres on Jubilee and Sutton Bonington campuses. Three fitness suites equipped with the latest equipment The latest in fitness technology Over 150 weekly group exercise classes Eight-lane 25m indoor swimming pool Indoor court hire including badminton, basketball, volleyball, squash courts and snooker room Indoor climbing and bouldering wall Outdoor court hire for tennis and netball courts Free fitness induction and programme reviews Add a Health and Wellbeing Suite bolt-on to your membership Access to our new personal training service Discounted rates for our Sports Injury Clinic Kids go free during University holidays Add children to your membership for only £3 a session during term time A more flexible way to make the most of our fitness suite and group exercise timetable with a monthly payment plan. A fantastic value membership package allowing you to enjoy 12 months of health and fitness for the price of 10 months! There is a £20 joining fee required at the time of joining. Alumni and associate sport and fitness memberships can be purchased by University of Nottingham graduates (including PGCE course), East Midlands Open University, St John's College staff, University of Nottingham Chaplains, employees of the Students' Union, employees of University tenants at Jubilee Campus and honorary appointments. On your first visit to the sports centre you shall need to provide proof of your alumni or associate status, for example your graduation certificate or University associate ID card. If you are interested in exploring more of what our sport centres have to offer, you can arrange a tour of our facilities with one of our friendly team or book to try our fitness suite for free. To book your tour or arrange to try our fitness suite, please complete this form and one of our team will be in touch. Please allow at least 48 hours from your request of a free trial or visit. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}