{
    "url": "https://www.nottingham.ac.uk/sport/membership/staffsportsmembership.aspx",
    "content": [
        {
            "p": "We offer excellent value membership packages to University of Nottingham staff to enjoy our fitness facilities at David Ross Sports Village, Jubilee Sports Centre and Sutton Bonington Sports Centre. Access to all three of our campus locations; David Ross Sports Village, Jubilee sports centre, Sutton Bonington sports centre and Kings Meadow fitness suite. Three fitness suites equipped with the latest equipment Over 150 group fitness classes every week Indoor climbing and bouldering wall Eight-lane 25m indoor swimming pool Indoor courts; squash, badminton, basketball, volleyball and pickleball Outdoor courts: Tennis, Netball and 3v3 basketball UNIversal Gym membership (free access to over 80 gyms nationwide) Add a Health and Wellbeing Suite bolt-on to your membership Access to our new personal training service Discounted rates for our Sports Injury Clinic Free fitness induction and programme reviews Kids go free during University holidays Add children to your membership for only £3 a session during term time If you are a new permanent employee at the University of Nottingham, you are entitled to a free 30-day trial of our UoN sport and fitness membership. This must be activated within 30 days of your employment start date. Salary deduction membership is available to; If you pay via salary deduction, the annual or monthly payment is taken from your salary after tax and national insurance. When you pay via monthly salary deduction you may cancel the membership at any time with one full calendar months’ notice. Staff deduction annual payments are valid for 12 months from the date of joining. Cancellations may be granted under the following circumstances - please click here for details. For our annual membership package, the membership starts from the date of joining and will not automatically renew. You will receive a renewal notice on the final month of your membership. Our best value membership staff package with 12 months for the price of 10, with the ease of payments taken through salary deduction. Our most flexible package with payments deducted monthly from your salary and one months notice cancellation period. Come along to any of our sport centres between 10am - 4pm on Saturday 18 and Sunday 19 January to give our fitness facilities go for free, and chat to us about our membership packages. No booking is required for the fitness suite, and other activities including swimming, group exercise classes and indoor courts will be subject to availability on the day. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}