{
    "url": "https://www.nottingham.ac.uk/sport/facilities/bookings/external-bookings.aspx",
    "content": [
        {
            "p": "Tell us about your event Read our brochure Learn more about our state-of-the-art venues Tell us all about your event and secure your date Give us a call and let us know how we can help At the University of Nottingham Sport, we have access to a host of world class sports facilities for external venue hire. We welcome all types of events ranging from student-led events, to facilitating the preparations of elite teams ahead of major international competitions. We have the expertise to create a venue like no other to stage your event. We are centrally located in the heart of England with excellent transport links, and on-site accommodation options. We can assist with both the sporting elements and accommodation to help create the perfect combined package for you. Our dedicated Events Team have extensive experience in all aspects of event organisation, from initial logistics through to final delivery. We welcome the opportunity to discuss your event requirements in further detail with us. Whether its venue selection, accommodation or catering, we can advise on all aspects of event management.If you are unsure if we’re able to host your type of event, please do not hesitate to contact us for a tour or consultation. Contact the events team to find out how we can support your event. British Universities & Colleges Sport Renan Lavigne, Team Manager - French National Squash Team West Bridgford Colts West Bridgford Colts book the grass football pitches at Riverside throughout the season. Teams will regularly comment on the quality of the pitches and behind the scenes the office are very accommodating of our fixture requirements and respond promptly to queries. The University and wider community are fortunate to have a wealth of good quality and well managed facilities that we can all benefit from. David Ross Sports Village University of Nottingham University Park Nottingham, NG7 2RD telephone: +44 (0)115 74 87000 email: sport@nottingham.ac.uk"
        }
    ],
    "pdf_files": [
        "uk_pdf_files/major-events-and-trainining-camp-brochure-uon-sport.pdf",
        "uk_pdf_files/major-events-and-trainining-camp-brochure-uon-sport.pdf",
        "uk_pdf_files/major-events-and-trainining-camp-brochure-uon-sport.pdf"
    ]
}