{
    "url": "https://www.nottingham.ac.uk/Staff-Networks/index.aspx",
    "content": [
        {
            "p": "The university champions equality, diversity and inclusion for all students and colleagues and our Staff Networks create safe spaces for support and discussion. By joining one of our Staff Networks, you will enter a community of like-minded individuals to build friendships, offer and recieve support and help to shape the future direction of EDI at Nottingham. The University of Nottingham is committed to proactively creating an inclusive environment and works collaboratively to recognise the following recognition months annually; Black History Month (October), Disability Recognition Month (18 November-18 December), LGBTQIA+ History Month (February) and International Women's Day (March). You can find out about each of our networks below. To join a network, most require you to contact the group via email or will specify an alternative process. The network is here to: You may want to join us at the disabled staff network. We unite staff who are experiencing disability, providing a safe meeting place and helping the university to consult directly with us as group. Our members include people with long term illnesses and medical conditions, neurodiverse people, those with temporary conditions, those without a diagnosis or who have an uncertain diagnosis, and many others. You don’t have to label yourself as disabled to be part of our community. However, if you want to join only because your work intersects with disability, please request to join the bcc email list and not the Team. Request access to join us at the DSN Team. Disabled Staff Network SharePoint site The Women’s staff network provides an informal forum for debate and raising awareness, ensuring that women are not unfairly disadvantaged in order to promote diversity and equal opportunities both within and outside the institution. Self-organised groups of interested women meet at regular intervals to provide a supportive forum for the discussion of equality and diversity issues, share experiences and also to act as a voice for staff from across all aspects of the university. The network provides a forum for carers to provide mutual support and exchange information and ideas. It also acts as a mechanism for communication with the university, in particular Human Resources, and raises issues of policy, practice and procedure. The network is supported by Professional Development and Human Resources. The Black, Asian and Minority Ethnic (BAME) network has been established by the university for all staff regardless of grade, job family, or contract length. The aims of the BAME staff network are to: The BAME staff network is delighted to welcome new members and contributions from existing members. Flexibility in our approach is key to ensure all staff who wish to be involved can be, this includes those colleagues who work shift patterns. Members can communicate with the group through the BAME staff network Microsoft Teams site, which is a members' only space. The Neurodivergent staff network was launched in March 2021 for members of university staff who identify as neurodiverse, whether formally diagnosed or not. The network aims to provide a dedicated peer support and information sharing resource to help understanding and meet individual needs for information and peer support. Neurodivergence refers to the infinite variation in human neurocognitive functioning and behaviour. Some estimates put the proportion of Neurodivergent individuals in the general population at 10% or more. These people experience atypical cognitive functioning and may be diagnosed with Autism, Attention Deficit Hyperactivity Disorder (ADHD or ADD), Dyslexia or Dyspraxia, Dyscalculia and Dysgraphia. The Neurodivergent staff network provides a forum to talk openly about strengths and weaknesses and how to access resources to help replace negative, deficit-based stereotypes of neuro-minorities with a more balanced valuation of their gifts and needs. Although we have a number of experienced researchers in the network, we are not offering diagnoses or professional advice, but we are able to offer a community. Staff members have a long history of informally sharing experiences related to parenting both in relation to home life and how these relate to work. Facilitated by a Microsoft Teams site, the Parenting staff network will The Haven is an EDI staff group for all members of staff who may have experienced barriers to or challenges in becoming parents (whether due to fertility issues, lack of opportunity or resources) or who may have lost a child or parenting role to miscarriage, terminating a pregnancy for medical reasons, infant or child death, or to family break up. Its purpose is to provide: thehaven@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}