{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/English/School-of-English.aspx",
    "content": [
        {
            "p": "The School of English provides a vibrant and engaging learning environment for those specialise in English Language and Literature from a global perspective. Our academics are engaged in research and training here in Malaysia and internationally, and we welcome students from around the world to join us here. We are part of one of the highest-ranked English programmes in the world via Nottingham UK, which is also one of the largest schools of its kind. We have recently celebrated 125 years of English at Nottingham, and are happy to be able to carry forward the postgraduate programme to Nottingham Malaysia. Across all of our campuses, we enjoy a rich and vibrant research culture, with some of the top international researchers in their respective fields. As a leading research-intensive institution, we believe that postgraduates are central to our research mission. At Nottingham we are committed to working with you to ensure you receive all the support and skills training you need to fulfil your full potential. Students will learn via lectures, seminars, supervision, workshops, tutorials and practical classes. Our postgraduate English courses aim to provide the best learning experience for students, and we strive to achieve module objectives with the most appropriate delivery and assessment methods. Students are assessed through coursework, group coursework, dissertations, presentations, research projects and essays, depending on the course and module of study. Our faculty members are passionate educators and scholars with expertise in various fields of the English language, including literature and creative writing. They bring knowledge and experience into the classroom, ensuring a stimulating learning environment. Our faculty members are dedicated to providing personalised guidance and mentorship to students, especially at the postgraduate level. We aim to foster both academic and professional growth. A postgraduate degree in English opens up a range of exciting career opportunities. Some potential fields graduates can work in include academia, publishing, writing and journalism, communications and public relations, content creation and digital media, education and training, cultural institutions, and non-profit or non-governmental organisations. The skills developed during your studies, such as critical thinking, research, writing and communication, are highly transferable and can be applied in numerous industries. Yes, UNM offers scholarships, financial aid and specific research funding for deserving students. Jalan Broga, Selangor Darul Ehsan, Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}