{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/art/A-day-in-the-life-of-a-Modern-Languages-student1.html",
    "content": [
        {
            "p": "Second-year student Isabelle shares a typical day... My name is Isabelle and I am a second-year student at the University of Nottingham, studying French and Mandarin. This is what my typical day at university looks like… To begin the day, I have an insightful two-hour lecture and workshop with Dr Marks on contemporary Francophone cinema and social issues where we look at the themes and techniques used by filmmakers. The French department has lots of different modules to choose from. This term, I’ve also signed up for French science fiction classes with Dr Ridon which are fascinating. Most of my lessons are held in the beautiful Trent Building that overlooks the lake. I have a two-hour mandarin language workshop with Dr Wang. I have three of these classes each week and they are incredibly useful. Immersion in my target language makes for rapid improvement which is great, as I am nearly ready to leave for my year abroad in China! I’ll be studying at the University of Nottingham China campus which will be a once in a lifetime experience – I’m very excited to explore the city of Ningbo. My Mandarin Chinese seminar My favourite place to study on campus is in Hallward Library, only a few minutes walk from the Students’ Union and the Trent Building. There are silent study spaces with booths and computers for when I really need to get my head down but I tend to sit in the café with friends while I work on any prep for my classes or assignments. Portland Building, the home of our Students' Union I usually meet a friend for lunch at the Students’ Union and try out one of the many food outlets they have here on campus. The place I choose today is Love Joes which makes delicious wraps and sides that you can enjoy in the food court. There is a balcony up here that is a great sun catch in the summer months. While I’m in the Union, I always go down to Blackwells – our university book and stationery shop – to find any good deals. After a full morning of studying, I walk over to David Ross – our on-campus sports village – to get some exercise. The options here are endless but I often opt for an indoor cycling session, which is great fun, or a trip to the gym. On Wednesdays, I take part in the IMS league (where you can compete in different sports for your course, hall, society or even a group of friends) and play some netball for a couple of hours. I have made some great friends through sports and we will usually go for a coffee afterwards to catch up. View from my exercise bike in David Ross I head home at this time most days so that I can catch up on work – such as translating texts, prepping for classes and learning characters – and have some time to myself. I also find that watching films in French and Mandarin really helps with my listening skills and vocab. Living in shared housing, it’s been great experimenting with cooking and making meals with my housemates. We’ll either go out into town in the evening or get cozy and watch a movie. Either works for me! Faculty of Arts 2017 graduate Dot is now working as a Freelance Translator. She explains why she puts enjoying what she does at the forefront of her career choices. 2004 graduate Jonathan is now working as United Nations editor & précis-writer."
        }
    ],
    "pdf_files": []
}