{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/checklists/distance-learners.aspx",
    "content": [
        {
            "p": "Welcome checklists As a distance learner there are some essential tasks to do before you start. Your time with us may look a little different to that of our campus-based students. But you can still make the most of your university experience, as we have plenty of online resources and support for you to access remotely. Make sure you complete all the tasks in the checklist below. This will ensure you have access to all the systems you will need to get started on your studies. Check your personal email inbox three weeks before you are due to start your course. You will receive an email containing your student ID – this is what you'll need to activate your IT account. Start your IT induction and check what equipment you need to get started on your course. Can't find an email from us? Visit our communications archive for everything you should have received. After you've activated your IT account, you will receive an email to your university account asking you to register online. You must log on to the NottinghamHub using your new university username and password to complete registration. We strongly encourage you to complete your registration as early as possible, as failure to do so will limit your access to programme materials, undertake assessments as well as progressing on your programme. Once you've activated your IT account you can also apply for your university card. You will need your university username and password, and a digital passport sized photo saved as a .jpg. As a distance learning student you should still complete this step, as this will give you access to our library system including online materials. You will not be sent a university card unless you specifically need one, for example if you plan to visit one of our campuses. If you think you may need a university card, please contact Student Services. Log in to Moodle with your university username and password to start exploring your school/department pages. First, make sure you've changed the default password that you were issued, otherwise you will not be able to log in to Moodle. You'll find lots of information and resources to help you prepare for your course, but please allow for up to three days after you have registered for your mandatory modules to appear. If you have a smart phone, make sure you download the MyNottingham app for quick access to emails, academic timetables, library account, key dates and guides. As a distance learner you can access a wide range of library services wherever you are. Visit the Libraries website for more information on how to request scans of items in our collections (within copyright limits) and postal loans, access thousands of e-resources, find upcoming study skills webinars and get help and support."
        }
    ],
    "pdf_files": []
}