{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/disability-support.aspx",
    "content": [
        {
            "p": "This is how we help you thrive. We’re building an inclusive and equitable teaching and learning environment for the benefit of all, where difference is celebrated, and alternative ways of learning are championed. If you have a disability, mental health difficulty, long-term medical condition, autistic spectrum condition, or a specific learning difference such as dyslexia, dyspraxia, dyscalculia or ADHD, there are plenty of services and resources available to support you throughout your time at Nottingham. We’re here to help with your academic journey, but also to reduce barriers to engaging with all aspects of university life. If any of the above applies to you, we strongly encourage you to make yourself known to our Disability Support Services at your earliest opportunity. Disability Support Services can create a support plan to help you get the most out of your studies. This might include coursework extensions, the receipt of lecture notes ahead of lectures, and reasonable adjustments during exams. We can help you get around campus, access sport, and we can also offer you a screening tool and advice on how to access a formal assessment. Disability Support Services The AcessAble app provides practical information about the accessibility of buildings, facilities and access routes on campus, allowing you to plan your journeys. It uses a rating system to indicate accessibility levels and signposts to step-free access, parking, accessible toilets, prayer rooms, parenting rooms, gender-neutral toilets and quiet spaces. Download the app for Apple Download the app for Android The Disabled Students' Network represents all students that self-define as disabled (including neurodiverse students). It provides information about available help, organises social events, and campaigns on a university, local and national level to try to raise awareness of the difficulties faced by those with a disability. You'll be able to join the network once you've completed registration. There are accessible sporting and fitness opportunities for all students - whether you want to join a sports club, work out in the gym or try something completely new, we can help you achieve your ambitions. Libraries provide a wide range of support and services for all students including calm spaces, a Click and Collect service for reserving books and study skills resources and webinars. As well as our wide range of library services, with a Disability Support plan you can also access additional enhanced services including: Library support"
        }
    ],
    "pdf_files": []
}