{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Civil-Engineering/Department-of-Civil-Engineering.aspx",
    "content": [
        {
            "p": "At the University of Nottingham Malaysia, you will follow the same high-quality degree curriculum that has helped civil engineering at the University of Nottingham to be consistently rated among the top civil engineering schools in the UK. We have strong links with industry professionals and at masters level, we deliver world-class teaching that reflects the research interests of our academic staff. This ensures course content represents state of-the-art research and up to date developments. It also enables MSc students to work on projects that contribute to the ongoing research in the faculty. We aim to empower our students with the knowledge and skills needed to excel in the ever-evolving field of civil engineering. Through academic programmes, hands-on experiences and research studies, we prepare our graduates to become leaders in their profession. Students who are enrolled in our civil engineering postgraduate programmes have access to UNM’s state-of-the-art laboratories, computer modelling tools, as well as simulation software to enhance their learning and research experiences. Our facili o provide real-world environments and prepare students for successful careers. Our course offers a comprehensive programme of study across a range of subject areas including geotechnical, structural and pavement engineering, management, transportation, and environment. Students can also engage in various extracurricular activities, including student clubs, internships and international exchanges. UNM offers a range of postgraduate courses in Civil Engineering, including Advanced Civil Engineering MSc and Engineering MPhil/PhD. While a background in Civil Engineering or a related field is preferred, applicants from diverse academic backgrounds may be considered on a case-to-case basis. Additional prerequisites or bridging courses may also be required. Yes, specialisations may include geotechnical engineering, environment engineering, transportation engineering, transportation engineering and structural engineering. Yes, our university offers a range of scholarships, grants and assistantships for eligible postgraduate students. Yes, part-time options are available to accommodate working professionals. Graduates can often pursue careers in design, construction, project management, research, academia, consulting, and government agencies, among many others. This will depend on your educational background. If you have an engineering degree or one in a related field, you can consider UNM’s Advanced Civil Engineering MSc. Contact us for information on the admission process and requirements for this course. Department of Civil Engineering The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih, Selangor Darul Ehsan, Malaysia Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}