{
    "url": "https://www.nottingham.edu.my/Study/Make-an-enquiry/enquire-now.aspx",
    "content": [
        {
            "p": "Seeking more information about University of Nottingham Malaysia? Get in touch and our team will be happy to help. Get your enquiries answered by contacting us via the channels below. Fill up our enquiry form to know more about our programmes. Submit now Drop a WhatsApp text for faster response. Chat with us For programme enquiry: +60 3 8924 8686 Monday - Sunday | 9am - 5:30pm (Except on public holidays) For general enquiry: +60 3 8924 8000 Monday – Friday | 9am - 5:30pm (Except on public holidays) Or please email us at study@nottingham.edu.my Meet our counsellors and academic staff to explore the right programme for you. Walk-ins are welcome too! We are open 6 days a week from 9am – 5pm (except on public holidays). Book now The University of Nottingham Malaysia sits on a 48-hectare site in Semenyih, 45 minutes from Kuala Lumpur City Centre. It offers a range of Foundation, Undergraduate, and selected Postgraduate programmes, facilities, and a diverse community of students and faculties. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan, Malaysia Directions via Waze Campus is open: Monday - Saturday | 9am - 5:30pm (Except on public holidays) Call us on: +60 3 8924 8686 Text us on WhatsApp: +60 19 280 8000 The Future Students Centre is an extension of the main campus that provides a convenient and informative way for future students to learn about the university and its programmes. Located centrally in Petaling Jaya, our Future Students Centre is easily accessible by public transportation and offers a variety of resources to help prospective students make informed decisions for their higher education. Mezzanine Floor, Menara Axis, 2, Jalan 51A/223, Seksyen 51A, 46100 Petaling Jaya, Selangor. Monday - Sunday | 9am – 5:30pm (Except on Public Holidays) The Kuala Lumpur Teaching Centre (KLTC) is our campus in the city located in Chulan Tower, Kuala Lumpur. The KLTC offers selected Postgraduate classes on a part-time basis with modern resources to support the flexibility required by busy professionals. Level 2, Chulan Tower, 3, Jalan Conlay, 50450 Kuala Lumpur Monday - Sunday | 9am - 5:30pm (Except on public holidays) Call us on: +60 3 8924 8388 General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}