{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Environmental-and-Geographical-Sciences/index.aspx",
    "content": [
        {
            "p": "The School of Environmental and Geographical Sciences provides a stimulating environment for students and staff based on high standards of innovative teaching and research, and individual guidance. We engage with environmental research organisations across Southeast Asia and maintain active links with colleagues at our campuses in the UK and China. In particular, we liaise closely with the Nottingham Geo spatial Institute, a world-leading institute at the University of Nottingham’s UK campus specialising in spatial and location-based science and engineering, empowered by satellite positioning, remote sensing and integrated technologies. These links help us to provide relevant insights into contemporary environmental issues. The challenges posed by climate change, biodiversity loss, and urbanisation require interdisciplinary solutions. At the University of Nottingham Malaysia: Interdisciplinary approach: Our courses blend theory with practice, ensuring you're equipped to tackle real-world environmental challenges. Global perspective: With links to our UK and China campuses, you'll gain a global perspective on environmental issues. State-of-the-art facilities: Benefit from advanced labs, research centres, and fieldwork opportunities in diverse ecosystems. Graduates from the School of Environmental and Geographical Sciences are well-prepared for a range of careers, including: Environmental Consultant Geospatial Analyst/GIS Specialist Conservation Biologist Climate Change Analyst Urban Planner Water Resource Specialist Environmental Educator Sustainability Officer Environmental Policy Analyst Land Use Planner Ecotourism Developer Renewable Energy Specialist Environmental Health and Safety Manager Agricultural Consultant Marine Biologist Waste Management Specialist Environmental Economist Forestry Manager Air Quality Analyst Yes, we organise field trips to various ecosystems, providing hands-on experience and real-world insights. Sustainability is a core aspect of our curriculum. We emphasise sustainable solutions to environmental challenges. Our faculty is actively involved in research, ensuring that our curriculum stays updated with the latest developments in the field. Yes, we have established partnerships with various environmental organisations and industries in Malaysia, providing students with internship opportunities and real-world insights. Yes. We have links with our campuses in the UK and China, and there are opportunities for international exchanges and field trips. Assessment methods for Environmental and Geographical Science Masters/PhD courses typically include a mix of coursework, projects, presentations, and exams to ensure a comprehensive evaluation. Yes. The University of Nottingham Malaysia offers various scholarships and financial assistance options to deserving students. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}