{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Science-with-Foundation-Year-BSc-Hons-U6USCNCEY.html",
    "content": [
        {
            "p": "Medical School Queen's Medical Centre, Nottingham, UK This course is now accepting applicants with the correct A-Level subjects. Do you want to study a science degree, but either didn’t take the right subjects at A-Level, or didn’t meet the grades for the science-based degree you wanted to study? Our 1 year foundation course prepares you for undergraduate study, giving you the subject-specific knowledge and skills you need to progress on to one of our science undergraduate courses. After successful completion of your foundation year guarantees you progression on to your chosen undergraduate degree. * Mandatory Year 0 Foundation Year Chemistry (40 credits) Mathematics for Foundation Science (20 credits) Foundations of Scientific Research (10 credits) Constructing Scientific Arguments (10 credits) Optional Foundation Biological Sciences (40 credits) Foundations of Human Biology (40 credits) The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Wednesday 27 November 2024. Due to timetabling availability, there may be restrictions on some module combinations. 17 to 21 hours per week of contact time with approximately one day a week of independent study. You'll study in relatively small class sizes, including one-to-one tutorials, allowing your tutors to get to know you quickly. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). Our Medical School is based in Queen’s Medical Centre, one of the UK’s largest hospitals. There are dedicated clinical skills facilities including a dissection suite and teaching laboratories for medicine and healthcare students. I owe my academic progression to all the science foundation staff as they equipped me with various skills which were proven to be more than valuable. Nasia Kafa Biology BSc Faculty of Medicine and Health Sciences Entry requirements BBB/ABC UCAS code CFG0 Duration 5 years full-time Start date Sep 2025 Faculty of Science Entry requirements A*AA UCAS code GFC0 Duration 4 years full-time Entry requirements BCC UCAS code A30A Duration 4 Years full-time 90% in work or doing further study 15 months after the course. Data for courses in General, applied and forensic sciences at University of Nottingham, the For more official course information visit Discover Uni See course data If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}