{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/medicine-and-health-sciences.html",
    "content": [
        {
            "p": "Discover what it's like to be a student in the Faculty of Medicine and Health Sciences at the University of Nottingham. We want our students to have a fulfilling and truly valuable time at the university. So we offer courses with exciting and unique opportunities, from placements and study abroad to being taught by leading researchers in your field. Our faculty includes the following schools: School of Medicine Faculty of Medicine and Health Sciences Get advice, support and guidance on an academic and personal level during your time at Nottingham Conducting research into the latest medical issues is at the forefront of the School of Medicine. With us, you’ll benefit from the expertise of our leading researchers and clinicians Experience a wide range of clinical settings filled with opportunities for hands-on learning to ensure you’re gaining those essential clinical skills from day one. Ever wonder what it's like to be a medical physiology and therapeutics student? Diveyaa takes us through a day in her life. Get advice, support, and guidance on an academic and personal level during your time at Nottingham. School of Health Sciences Hear more about our courses from our current nursing students. At Nottingham, hands-on practical learning is embedded throughout your course to ensure you’re gaining those essential skills as soon as day one. Where your passion meets purpose, and your journey to becoming a nurse begins. Camille talks us through her typical day as a midwifery student. midwifery Hear from our team about the types of support we offer and the course structure Discover what you'll be studying, how you'll learn, and what our current students love about their midwifery modules. At Nottingham, hands-on practical learning is a key part of your course to ensure you’re gaining those essential skills as soon as day one. Get advice, support and guidance on an academic and personal level during your time at Nottingham. The School of Health Sciences is conducting research into the most current healthcare issues. We spoke with Daniel, who explains what life is like as a health sciences foundation student. School of Veterinary Medicine and Science At Nottingham, we’ve included hands-on learning throughout our courses to ensure you’re gaining those essential skills as soon as day one. School of Life Sciences Amy and Alisha studied Biology BSc and Biology MSc. They spoke to us about how their degree's have helped shaped their career paths since graduating. A spotlight on the Tropical Medicine and Beyond module taught at the Malaysia campus Medicine and Health Sciences Watch James' experience of studying Zoology Alice and Ellie both graduated in 2019. Find out how their degree's have helped to shape their career paths Explore the world, create connections and develop skills in Biochemistry to excel in your career Biochemistry Jeremy, George, Alex and Zoe talk about how their degree's have helped to shape their career paths since graduating. Follow Luke as he takes you around our campus, including our state-of-the-art David Ross Sports Village, practical lab sessions and his favourite study spaces."
        }
    ],
    "pdf_files": []
}