{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Biosciences/Bisociences.aspx",
    "content": [
        {
            "p": "The School of Biosciences has strong teaching and research connections with the UK school. In addition to innovative teaching, we are internationally recognised leaders in several fields, including human nutrition, medical and pharmaceutical biotechnology, crop physiology and management, postharvest technology, genomics and proteomics, microbiology, and molecular pathology. Being in Malaysia allows us to carry out important research on tropical plants, focusing on addressing challenges related to food, nutrition, security, and human health in the tropics. Our research portfolio is rapidly expanding into the use of underutilised plants for food and nutritional security, food quality and safety, the link between nutrition and health, and anti-microbial resistance. Our diverse academic staff from around the world brings a wealth of expertise to inform our teaching, ensuring your learning is current, relevant, and practical. The School of Biosciences at UNM is a renowned centre for research and teaching in the field of biological sciences. It offers postgraduate programmes designed to provide students with advanced knowledge and skills in various areas of biosciences, including biotechnology and nutrition. No. The current programme available within the school (Biotechnology MSC) is a full-time one-year programme. The School of Biosciences covers many research areas in its postgraduate programmes. These include sustainable agriculture, food and nutrition security, modern therapeutic for health. The School has experienced staff members and well-equipped laboratories to support research endeavours. Yes, the Biosciences postgraduate programmes at the University of Nottingham Malaysia are open to both local and international students. A postgraduate degree in Biosciences opens up a wide range of career opportunities. Graduates can pursue careers in academic research, biotechnology companies, pharmaceutical industries, healthcare, government agencies, environmental agencies, and more. The skills and knowledge acquired during the postgraduate programme enhance employability prospects in various sectors. Upon completing the MSc Biotechnology programme, our graduates often find themselves in diverse roles and sectors. These include positions as research scientists within institutes and biotechnology firms, as lecturers and educators, and in technical and sales roles within the biotechnology industry. Some choose roles in sectors such as oil palm, plant and food. A significant number of our graduates also choose to further their studies at the doctorate level, often leading to roles as researchers and academics within public or private higher education institutions. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}