{
    "url": "https://www.nottingham.ac.uk/studywithus/why-study/academic-excellence.aspx",
    "content": [
        {
            "p": "Unlock your potential in a place of possibility and opportunity – where teaching excellence goes hand in hand with pioneering research. Teaching quality As a member of the UK's prestigious Russell Group and the Universitas 21 global network of research-intensive universities, we deliver a high standard of education. We consistently rank highly in UK and international league tables. Our rankings and achievements Students are at the heart of what we do. We are continuously developing our campuses to ensure that you have the learning spaces, facilities and resources that you need. View our recent developments. Our teaching is delivered by some of the brightest minds in their fields and shaped by the latest ground-breaking research. Student evaluations tell us that our teaching is excellent and hundreds of academic staff are nominated for our staff Oscars each year. View the profiles of some of our leading academics: Surface and coatings technology are central to the research of Tanvir, a University of Nottingham graduate. His group pioneered novel coating processes from nanomaterials and graphene for the next generation of aero-engines. Collaborating with large companies such as Rolls-Royce, his interest lies in finding new coatings to reduce carbon emissions. Tanvir teaches Aerospace Materials to undergraduate engineering students. Using advanced statistical methods, Dr Anja Neundorf analyses how individuals form and retain their political attitudes, identities and behaviour over time and in different political systems. She is currently exploring how past authoritarian regimes influence political attitudes today – a project which has received £200,000 of Economic and Social Research Council funding. Research at Nottingham makes an impact around the world by tackling some of the major challenges facing society, the economy and the environment. This is where the MRI scanner was invented; where you’ll find the world’s largest group of human rights scholars; and where the answers to global food security are being unearthed. Our research impact A large number of courses at the University of Nottingham include a placement or work experience element, ensuring that you receive first-hand experience in professional environments. Whether you undertake a year in industry, take up a summer internship or have a clinical placement as part of your course, you will be equipped with the skills employers are looking for. Our Careers and Employability Service How to apply Fees and funding"
        }
    ],
    "pdf_files": []
}