{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Accountancy-BSc-Hons-U6UACCNT.html",
    "content": [
        {
            "p": "Jubilee Campus, Nottingham, UK Our BSc Accountancy Flying Start degree is designed for those who aspire to become ICAEW Chartered Accountants and want to hit the ground running in their careers. Sponsored by PwC and developed with input from the ICAEW, this four-year course offers a unique blend of academic learning and real-world experience. Mandatory Year 1 Assurance Business Finance Business Law Computers in Business Economic Principles Fundamentals of Financial and Management Accounting Principles of Taxation Quantitative Methods 1B Optional Quantitative Methods 1A Work and Society The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Wednesday 11 December 2024. Due to timetabling availability, there may be restrictions on some module combinations. In your first year, you'll complete a mix of compulsory and optional modules, totalling 120 credits. As you move into years 2, 3, and 4, you'll take 80 credits of modules each year, along with your placement. For each 10-credit module, you can expect to dedicate around 100 hours of study time. This includes teaching sessions like lectures and small group classes. Typically, you'll have between 8 and 12 hours of teaching per week, along with student (office) hours where you can get additional support from your lecturers. Throughout your program, you will also be expected to carry out independent study, which is likely to increase as you progress. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain's leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2024, High Fliers Research). Jubilee Campus has eco-friendly buildings, alongside green spaces, wildlife and a lake. This campus is home to our business, education and computer science schools, as well as a sports centre and student accommodation. The best part of my course is the work placements at PwC. These are guaranteed as part of the programme. The placements allowed me to apply what I had been learning in lectures and develop my professional skills. During each of my placements, the teaching and support by the university was fantastic and helped me prepare for examinations upon my return to campus. Thomas Joshua Marriott BSc Accountancy 66% of students say teaching staff have supported their learning well. Data for Accountancy (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Social Sciences Entry requirements AAA UCAS code NN34 Duration 3 years full-time Start date Sep 2025 UCAS code N200 UCAS code N20A UCAS code L1N2 If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}