{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Pharmacy/School-of-Pharmacy-Research.aspx",
    "content": [
        {
            "p": "Established in 1925, Nottingham’s School of Pharmacy has a wealth of experience which keeps it at the forefront of academic development and progress. We are consistently ranked as the UK’s top pharmacy school and were rated as joint 1st in the UK for quality of research in the 2014 UK Research Excellence Framework, with 100% of our research considered to have ‘impact on society’. In 2007 we received the Queen’s Award for Industry in Innovation – one of the UK’s highest corporate honours for significantly enhancing the development of new medicines. Research is crucial to the pharmaceutical industry and our academic staff are at the leading edge of scientific and healthcare developments. The current research areas reflect the breadth of expertise of our staff, the acquisition of research funds and recent applications for grants. These are: Pharmacy Practice and Health Optimisation research are conducted by academics who are qualified to practice as pharmacists in a number of countries across the globe, including Europe, Malaysia and Singapore. Their areas of expertise include studies of adverse drug reactions and pharmacovigilance, risk management/communication, clinical governance and methods to improve pharmacy education. Our degree programmes provide you with an opportunity to embark on an area of research of your interest, allowing you to focus on this niche area of knowledge and make an important contribution to science. Becoming a PhD student at our school means joining a thriving research community and exploring world-changing issues at the forefront of science and healthcare. It also means developing skills prized by academia and the biotechnology, healthcare and pharmaceutical industries. Recent PhD graduates from the School of Pharmacy at the Malaysia Campus can be found working as lecturers in some of the leading pharmacy faculties in the country. The duration of the pharmacy postgraduate programmes at UNM varies as follows: Part-time students Pharmacy MPhil - 4 years + 2 years for thesis writing Pharmacy PhD - 6 years + 2 years for thesis writing Full-time students Pharmacy MPhil - 2 years + 1 year for thesis writing Pharmacy PhD - 3 years + 1 year for thesis writing School of Pharmacy Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}