{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Law-LLB-Hons-U6ULAWLB.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK Looking to study law and excel in your career? Our LLB Law programme is designed to provide a thorough foundation in English law with a focus on professional development. Our core modules give you a thorough foundation in English law, through the study of tort, trusts, contract law, public law, criminal law, EU law, and land law. In your second year and final year, while still studying some compulsory subjects, you can specialise in the areas of law that interest you with a rich and diverse range of optional modules. Our programme opens doors to a wide variety of professions and organisations, including law firms, barristers’ chambers, consultancies, business advisory services, marketing, civil service, public relations, accountancy, and campaigning. For example, recent graduates have secured positions at Clifford Chance, the Barristers’ Chambers 7 King’s Bench Walk, the London Stock Exchange, PwC and BAE Systems. At our School of Law, we pride ourselves on providing not just academic excellence, but also a supportive community of like-minded individuals. Our law societies cater to a wide range of interests, from pro bono volunteering to placements, offering you the chance to make an impact and build your network. If you're seeking a unique experience, you can apply in your second year to transfer to one of our four-year programmes, which include a year abroad at a partner law school. You could go and study in locations such as Australia, Canada, Singapore, Hong Kong, South Africa, New Zealand, Europe or the USA. This experience sets you apart in the job market and makes you highly attractive to employers. Mandatory Year 1 Foundations of Tort Introduction to Law and Legal Theory Law of Contract Public Law The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 25 July 2024. Due to timetabling availability, there may be restrictions on some module combinations. In year one, you will typically spend at least 12 hours per week in lectures taught by leading law academics. These will be supplemented by small group teaching. Beyond formal taught sessions, you'll be expected to engage in self-directed study, including reading case law and legislation and preparing answers to tutorial questions. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. There’s a wide range of modules on offer so you can choose to study things that relate to your interests. The careers support is fantastic and comes in a wide variety of forms from three main sources: the School of Law, the university Careers Service and the law-related societies. Benjamin Haynes LLB Law Faculty of Social Sciences Entry requirements AAA including French UCAS code M1R1 Duration 4 years full-time (year 3 abroad) Start date Sep 2025 Entry requirements AAA including Spanish UCAS code M1R4 Entry requirements AAB UCAS code L316 Duration 3 years full-time (available part-time) Entry requirements ABB UCAS code 1L22 76% of students say teaching staff have supported their learning well. Data for courses in Law at University of Nottingham, the For more official course information visit Discover Uni See course data If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}