{
    "url": "https://www.nottingham.edu.my/Study/Accommodation/Accommodation-faqs.aspx",
    "content": [
        {
            "p": "Many of your queries may be found in the Q & A section below. If you can't find the information you are looking for, please don't hesitate to contact us via email or call +603 8924 8604. All applications by new students or returning residents must be made through the On Line Accommodation Application (OLAA) portal. New students may apply for on-campus accommodation as soon as you have your Nottingham Student ID which is usually issued soon after you have submitted your course application. Current students who are progressing/continuing their studies (returning residents) are encouraged to apply in March for the new Academic Year starting in September. Kindly inform Accommodation Office of your arrival date at least 3 working days in advance via online check in form (apps.nottingham.edu.my > Campus Services > Accommodation > Accommodation Check – In) so that your room will be ready upon your arrival. Failure to do so may affect your check-in experience. Our normal check-in hours are: Monday to Friday: 9.00 am - 7.00 pm Saturday, Sunday, State & Public Holidays: Closed If your submitted check-in timing is outside of the normal check-in hours, kindly ensure that you have received a confirmation from Accommodation Office who will make the necessary arrangements for your Check-In. If you unable to access to apps.nottingham.edu my, please refer to Question 4. For new students, please ensure that you have activated your University username before accessing the apps.nottingham.edu.my portal. If you are still unable to access after activating your username, please allow 2 - 3 days before you could access the portal or try to reset your password by following the steps below. To change or update your password, 1. Go to https://itaccounts.nottingham.ac.uk/ 2. Go to Existing User. 3. Enter your university’s username and current password then click Login. 3. Click Change My Password from the left-hand side of the window and follow the instructions. 4. Click Logout in the top right-hand corner of the window. An example of recommended password: My@Nott247$ 1. Password is case sensitive. 2. Must be at least 8 characters long. 3. Must be no more than 32 characters long. 4. Must include at least 1 number. 5. Must have at least 1 symbol or special character. 6. Must have at least 1 lowercase letter. 7. Must have at least 1 uppercase letter. 8. Must not include part of your name or user name. 9. Must not include a common word or commonly used sequence of characters or form a word. 10. New password may not have been used previously. * Please note that every time you change the password, the old password is no longer usable. One password for all except OLAA. Alternatively, you may provide your details without login via apps.nottingham.edu.my > Accommodation Check-In (link). Features accessible via apps.nottingham.edu.my are: a) e-Housekeeping Service to apply for housekeeping service (apps.nottingham.edu.my > Campus Services > Accommodation > e-Housekeeping) b) Vehicle Parking Permit (apps.nottingham.edu.my > Security > Vehicle Parking Permit | Traffic Fines Payment) c) Check-In Form (apps.nottingham.edu.my > Campus Services > Accommodation > Check-In) d) Room Transfer Request (apps.nottingham.edu.my > Campus Services > Accommodation > Room Transfer Request) The accommodation is guaranteed for all new students starting their foundation, first-year undergraduate or postgraduate studies. However, we do not guarantee the availability of your preferred room type. Your chances are greater the earlier you apply, accept and pay for your preferred room as we allocate rooms on a “First Come First Served with Payment” basis. For returning students, room availability is not assured. Applications will be treated based on the priority below. Applications will be treated on a first-come, first-served basis with priority given to those meeting the specified criteria. The university has wheel chair friendly accommodations located on the ground floor and have previously housed visually challenged and physically challenged residents. If you have a physical disability or have special needs, kindly indicate when applying via OLAA and provide written supporting documentation or medical reports from a registered physician/doctor. These will be forwarded to our Student Wellbeing and Learning Support Office for further advise and assessment. In the event that you do not get your preferred room type, it is recommended that you accept what is been offered to prevent further delay. You will have the chance to change to your preferred room type by applying for room transfer after you have checked-in to the room offered to you. Your room transfer request will be processed according to room availability due to “No Show”. There are several payment methods available for students to make accommodation payments. Full details will be provided in the tax invoice when we issue your room offer. Accommodation rental fee is inclusive of: • WiFi connection • Utilities – water and electricity • First 200 kwH (400kwH for SDSEB A/C) air conditioning usage • Room Housekeeping & Maintenance Services A monthly electricity charge of RM0.509 per unit of electricity above 200 kwh will be imposed according to the usage measured by the air-conditioning electricity meter. The first 200 kwh (1-200 kwh) is not charged to encourage sensible usage. The electricity rate is granted and changed by Energy Commission. Billing Cycle for Air-Con Charges:Additional usage above 200 kwH per month will be billed on a quarterly basis based on metre reading as follows: Billing Month For Period March Dec, Jan, Feb June Mar, Apr, May September Jun, Jul, Aug December Sep, Oct, Nov Upon checking in, you will receive a Welcome Pack consisting of a soap bar, hair comb, shaving kit, dental kit - toothbrush and toothpaste, shower cap, cotton bud and sewing kit). Deluxe Single Ensuite Bathroom (DSEB) and Super Deluxe Single Ensuite Bathroom (SDSEB) rooms located at Student Village North only will also have a mini refrigerator inside the room. Refrigerators are also available in the common pantry/kitchen (equipped with microwave oven and infrared cooker). Hot and cold-water dispensers are available at every floor of each hall. You may consider bringing the following: drinking cup, plates, fork and spoon, thermos flask, crockery (if you wish to cook), pail and personal bedding items. You may consider purchasing our Bedding Pack consisting of the following: pillow, duvet single, bed sheet, pillow case, hand towel and bath towel at RM160.00. Effective from April 2015, room rentals will be billed on a quarterly basis as follows: February 1st Feb Jun Jun, Jul, 31st Aug April 1st Apr, May Mar, Apr, 31st May 1st Jun, Jul, Aug 1st Sep, Oct, Nov We do provide short stay accommodation for couples and small families. The following are provided for each room type: a) Deluxe Studio Room (Twin Occupancy). Each Deluxe Studio Room unit include bedroom with queen size bed; lounge with sofa and dining table, pantry with mini bar and microwave oven, television and ensuite bathroom with water heater. b) Single Studio Room (Single Occupancy). Each Single Studio Room unit include bedroom with single size bed, study table and chair, lounge with sofa and dining table, and ensuite bathroom with water heater. Since the accommodation halls are located within the campus, all academic and non-academic facilities are just a few minutes’ walk away. Our accommodation halls are located at Student Village North/ J Block (J1 - J6) and Student Village South/ I Block (I1 - I5). Please refer to the campus map for more information. Yes, you are allowed to check out before the semester ends. The resident must do the following to check out successfully. 1) Please fill out and submit the Check Out Form via email. Verbal notifications will not be accepted; 2) Book your room inspection slot. You may request for slot within 7 working days before check out. 3) Return your room key complete with the room number tag; 4) Vacate your room by removing all your belongings; and 5) Settle all outstanding fees for your accommodation If you have any overpayment, please submit the Refund Form. Alternatively, you may use this link. If you have your Student ID and Email Username, you may connect to SNSwifi using the following steps: For Android/iPhone/iPad devices, follow the instructions below: 1. Please select the 'PEAP' in EAP method. 2. Please select 'Do not verify/validate' or 'None' in the CA certificate field. 3. Please select 'MSCHAPv2' in Phase-2 authentication 4. Please select 'Phone/System MAC' for MAC address type (if available) 5. Use your university's email as Identity (leave Anonymous Identity blank) and university's password 6. Domain (if required): 'nottingham.edu.my' 7. *Note: Find 3 & 4 hidden under Advanced options if available For more information, please click here. You are advised to follow-up with the University's Sponsorship Office on payment arrangements for your accommodation. Generally, you are advised to pay the accommodation rental to secure your offered room. The amount paid will be refunded to you once your sponsor has confirmed the arrangements for your accommodation. The following cut-off dates are being practiced. Residents are still required to pay full rental as per the above Billing Cycle. Credits/Deductions will be calculated as follows for the 4 scenarios A to D: A. Full month rental is charged, do deduction. B. Half month rental will be credited/deducted against the next quarter billing. C. Half month rental will be refunded. D. Full month rental is charged, do deduction. Please use Maintain X to report any maintenance issues. You will be notified via email about the progress and action of each request as it happens. Super deluxe single ensuite bathroom with air-conditioning (SDSEB A/C) is the improved room type located at J3 (Lankayan Hall) and J6 (Perhentian Hall). The benefits of the room include: Features of the upgrade include: The price of SDSEB A/C per month is RM1000. All visitors (including friends, relatives, and/or family members) are allowed to visit the residents. Only same gender visitors are allowed into the resident's room but must leave before 12 midnight. No visitors, irrespective of gender are allowed in the resident's room between 12 midnight until 8am. All visitors are not allowed to stay overnight in the accommodation halls. If any of the above is violated, the incident will be reported by the hall warden and/or hall tutors to UNM, which may involve reports being made to parents/guardians and eviction from the accommodation halls. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/Campus-Map-new.pdf",
        "pdf_files/Accommodation-Check-Out-Form-Revised-Version-28.4.2022.pdf",
        "pdf_files/Digital-Accommodation-Handbook-2023.pdf"
    ]
}