{
    "url": "https://www.nottingham.ac.uk/studentservices/support/financialsupport/managingyourmoney/mature-student-information.aspx",
    "content": [
        {
            "p": "Money management is an important part of student life. You may have experience of living independently and managing your own budget, but managing a student budget may feel very different because you might have additional responsibilities outside of your studies. Our mature student page has information on student finance including tuition fee and maintenance loans. If you’re worried about money, it’s best to talk to somebody as soon as possible. Our funding team and the Students’ Union Advice team are here for you to offer non-judgmental support if you need it. Contact the funding and financial support team Contact the Students’ Union advice If you can, working part time alongside your studies can be a good way to create additional income. Our Unitemps service can help you find work alongside your studies, including options on campus. Working extra hours in holiday times can be a way to increase your money to support your term time finances. Are you eligible for any of the bursaries and scholarships we offer? Full details are available on our website, including an overview of the offers, eligibility criteria and guidance notes. Some students are eligible to claim universal credit. or other welfare benefits. Universal Credit may count student finance as income which could affect your claim and other government benefits. Please be aware that some funds such as student loans or university support funds may impact on your ability to claim Universal Credit, so weigh up your options carefully for your individual circumstances. Our Students’ Union Advice team can help you to understand if you are eligible for government benefits whilst studying, and which ones may be right for you. If your situation changes or you feel you are facing financial hardship, you may want to consider applying tfor one of our support funds, which include the Student Crisis Fund and the Student Hardship Fund. Support funds are not intended to be relied on as a source of income. Please note that if you have a partner, we will consider their income when applying for support funds in some circumstances (eg if you are married and/or live together). Postgraduate students can use the postgraduate search website for funding opportunities including loans, grants, scholarships and bursaries. Postgraduate students are expected to have made sufficient provision before starting their studies. Have you applied for the childcare support fund? This fund can contribute towards essential registered childcare for students and research students struggling to meet costs whilst they are studying. This is a discretionary support fund that can offer a contribution towards childcare costs in some circumstances. You may also want to explore support schemes for students with children such as the childcare grant or parents learning allowance. These schemes are both additional grants available through your student finance application. If you have dependent children you may be eligible for universal credit, although be mindful that claiming Universal Credit may mean that you are not able to access other benefits so you will need to calculate which one is the most beneficial for your individual circumstances. If you have adults that are financially dependent on you, you may be eligible for the adult dependents grant. Disabled students may be able to claim support using the disabled students allowance (DSA). Students can also apply for financial help from the university towards a diagnostic assessment in relation to their specific learning difference. If you’re an independent student, Student Finance England will not take your parents’ income into account. If you are married, in a civil partnership, or over 25 and living with a partner, Student Finance England will ask your partner for their national insurance and personal income details. Independent student criteria can be found on the UCAs website. Students aged 21-25 may still have their funding based on their parents’ income, unless they are classed as an independent student. NHS bursaries are available to some students on medical courses. Factsheets and FAQs on student funding for medical students are available on our website. Royal medical benevolent fund can offer support to some medical students in their final two years of study. The NHS training grant can offer financial support to students on some courses, via Student Finance. The NHS learning support fund can offer additional financial support to students on nursing courses. This is usually in addition to funding from Student Finance Regardless of age, students can access lots of offers, discounts and perks! You can get discounts signing up to platforms such as Totum, Unidays and student beans. We have a range of support available to help students through the cost of living challenge. This includes free kitchen access, free access to showers and free period products. Students of any age are eligible for student bank accounts, which can offer perks such as freebies or interest free overdrafts. Shop around and find the best deal for you personally. Some banks only allow first year students to open student accounts so it’s worth exploring early. You will need to apply for a permit if you plan to park on campus regularly. These incur a cost, and not all students will be eligible for a parking permit. Managing a vehicle whilst studying can be a big financial decision, but it may be necessary to maintain your commitments outside of studying, or for travel if you’re on a placement. Like most student money management, the key is to budget appropriately and be honest and realistic about what you can afford. Have a vehicle that is appropriate for your needs and within your affordability. Shop around on comparison websites for the best insurance and breakdown deals. Keep on top of vehicle maintenance to minimise risk of any later problems, such as tyre pressure and oil levels. Students over the age of 25 can access the 16-25 railcard by completing a mature student application for railway discounts. You can also access reduced travel on NCT buses and NET trams for both season tickets and single/daily fares. Although don’t forget that the hopper buses between campuses are free! gov.uk - funding for mature students UCAS - student finance for mature students UCAS - Coping with financial challenges as a mature student UCAS - Finance for Independent Students Save the Student - Student Finance for Mature Students turn2us - Studying (aged 16+) Please note: The University is not responsible for the content of external websites and a link to such a website does not necessarily imply an endorsement of its content."
        }
    ],
    "pdf_files": []
}