{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/scholarships-fees-and-finance/scholarships/scholarshipdetails/deng-yaping-sports-scholarship.aspx",
    "content": [
        {
            "p": "Sports scholarship for table tennis or badminton athletes from China Combine an international education with performance sports through our Deng Yaping Sports Scholarship, supporting students from China who compete in table tennis or badminton at a national or international level. These scholarships cover funding towards your tuition fees at Nottingham, as well as sports facilities, coaching and support while you study with us. This scholarship is currently open for applications. Please note once capacity has been reached on the scholarship, it will be closed. We also offer a range of other sports scholarships for athletes in all sports, including our International Sporting Excellence Award. The deadline for applications requiring the 30/20 weeks on campus pre-sessional English (starting in January) is Sunday, 20 October 2024. The deadline for applications requiring the 20/10 weeks online or on-campus pre-sessional English (starting in April) is Monday, 27 January 2025. Download the application form (PDF) Dr Deng Yaping won 18 world championships and four Olympic gold medals during her career. She was named Chinese Athlete of the Century and is one of the greatest table tennis players of all time. She also completed a masters degree at the University of Nottingham, graduating in 2003. The University launched this scholarship in 2013, with Deng Yaping's support, to honour her achievements and to help Chinese athletes achieve their academic and sporting ambitions. I am really keen to help young sporting talent with their challenges in life. The opportunity of studying in the UK will help recipients achieve a wealth of knowledge, become more familiar with international rules and understand different cultures."
        }
    ],
    "pdf_files": [
        "uk_pdf_files/deng-yaping-application-form-2022.pdf"
    ]
}