{
    "url": "https://www.nottingham.edu.my/Study/Fees-and-Scholarships/Scholarships/Postgraduate-scholarships.aspx",
    "content": [
        {
            "p": "Take the next step in your academic journey with our prestigious postgraduate scholarships, providing financial support and invaluable opportunities for your research and personal growth. The following requirements must be met by successful candidates: Programme and admission details are available our the website. The scholarship is offered to academically outstanding students pursuing the above MA courses only. Documents needed to apply for this scholarship: Closing date 20 June 2024 Email your application to Sponsorship Unit and use 'Tinggi MA Scholarships' as the email subject. Incomplete application shall not be processed. Shortlisted candidates will be invited for an interview in early July 2024. All decisions are final, and no appeals will be entertained. Tinggi-UNM MA Scholarship 2024 FAQs sponsorship@nottingham.edu.my or 03 8924 8609 We are dedicated to creating a supportive and inclusive research environment, attracting and retaining talented reseachers and students, and forming partnership with industry, government, and community organisations to drive innovation and create a positive societal impact. In line with its commitment to research excellence, UNM offers this Scholarship that provides students with opportunities to pursue their postgraduate academic and research interests and, in turn, contributes to UNM's research efforts and drives innovation. Complete the application form and email the documents below to the Graduate School at graduateschool@nottingham.edu.my by 12th May 2024. Write the email subject line as UNM PhD Scholarship Application - [Name] [Faculty you are applying for e.g. FOSE/FASS] Assessment criteria Eligible applicnats will advance to the next review and selection process wich includes an interview round. Successful applicants will be required to apply for immediate admission into the September 2024 intake. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/Tinggi-UNM-MA-scholarship-application-form-v1.pdf",
        "pdf_files/Tinggi-UNM-MA-Scholarship-FAQs.pdf",
        "pdf_files/UNM-PhD-High-Achievers-Scholarship-Application-Form-2024.pdf"
    ]
}