{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Engineering/Manufacturing-and-Industrial-Processes/research.aspx",
    "content": [
        {
            "p": "At the University of Nottingham Malaysia, our Manufacturing and Industrial Processes Division is a beacon of excellence in the field of engineering. We are committed to nurturing the next generation of engineers and leaders who will shape the future of manufacturing and industrial processes. You’re in the right place if you have a passion for engineering and aspire to be a front-runner in manufacturing processes and technology. Efficient product and process development and manufacturing are paramount for all the industrial activities and are the core theme of the Manufacturing and Industrial Process Research Division. Various novel technologies have emerged from the dedicated and coordinated activities of our members.We have established research projects and collaborations from various private and government agencies and much of our research has been funded by Shell, Petronas, Malaysian Palm Oil Board(MPOB), The Institute of Materials, The Project Management Institute and Ministry of Science, Technology and Innovation (MOSTI). The Manufacturing and Industrial Processes Research Division at UNM is at the forefront of technological advancements in the field. Here's why you should consider joining our research community: Innovative research environment: Benefit from our state-of-the-art labs, facilities, and collaborative research culture. Global collaborations: Engage in joint research projects with our UK and China campuses, as well as with renowned institutions worldwide. Industry-relevant research: Our strong ties with industry leaders ensure that our research addresses real-world challenges and has a tangible impact. Multidisciplinary approach: Collaborate with experts from various fields, fostering a holistic approach to problem-solving. The research groups within the Manufacturing and Industrial Processes Research Division are: The Food and Pharmaceutical Engineering Research Group works extensively to research and develop advanced technologies for processing of food and pharmaceutical products. We have a distinctive strength in developing advanced processing technology for producing excellent quality food and pharmaceutical products which contain high amount of medicinal bio-active ingredients beneficial to human health and developing value added products from bio-origin products which are marketable in health care industry. We are also working towards the development of unit operations such as dehydrators, fryers, extractor and scrubbers for processing foods and pharmaceutical products. Additionally, we provide professional services and consultancy to companies wishing to develop new food and pharmaceutical products, diversify product range, and processing products with new technologies that yield better product quality and minimise operating cost. Current partnerships an collaborations include the Ministry of Higher Education, Ministry of Science, Technology and Innovation, and Ministry of Agriculture. The Nanotechnology Research Group is actively engaged in broad, cutting-edge research activities in nano and advanced materials for a variety of novel technological applications. We are extremely successful in attracting external funding from government as well as from private sectors and are extensively involved in establishing substantial collaborations with renowned researchers nationally and internationally. We are also actively involved in providing collaborative technical services and consultations in the area of advanced materials and manufacturing to local/international research organisations, government-linked companies (GLC) and industries. A large number of international research publications have been made from our research activities. Mechatronics reflects a professional discipline that encompasses electrical, electronic and mechanical engineering with intelligent embedded control. It draws on large array of technologies from various disciplines into one very specialised field. Graduates will be able to pursue careers in various industries,such as: Manufacturing Engineer Production Manager Quality Assurance Specialist Process Improvement Analysts Supply Chain Manager Industrial Designer Operation Research Analyst Logistics Engineer Robotics Engineer The fundamentals of manufacturing processes encompass vital knowledge and principles that are related to the techniques, methods and systems used in industrial production - to transform raw materials into finished products. As such, you would need to understand materials, manufacturing processes, quality control automation and sustainable practices in order to create high-quality products efficiently. It is crucial to understand the fundamentals in order to design efficient production systems, ensure product quality, minimise waste, and optimise manufacturing operations. A manufacturing and industrial processes course covers various aspects of manufacturing such as materials, techniques, processes and the technology used in industrial production. Manufacturing process analysis involves the evaluation and optimisation of production processes to enhance efficiency, reduce costs, improve quality and ensure compliance with stipulated industry standards. Methods used in manufacturing process analysis include statistical process control (SPC), Lean manufacturing, Six Sigma, root cause analysis and simulation to analyse and improve manufacturing processes. Students who are part of our Manufacturing and Industrial Processes Division will have the opportunity to become well-versed in these methods. Once you graduate with experience from the Manufacturing and Industrial Processes Division, you will be able to help businesses identify bottlenecks, reduce waste, increase productivity, and enhance the overall competitiveness of their manufacturing operations. Yes, the University of Nottingham Malaysia offers a range of scholarships and financial assistance options for eligible students. Yes, UNM has established collaborations with leading industries and manufacturing units, allowing students to work on projects that address real-world challenges and offer valuable industry exposure. Yes. The division regularly organises workshops and training sessions on various research methodologies, tools, and software to support researchers. We invite you to explore our course pages for further information on admission requirements, application procedures and ongoing research projects. Whether your aspirations are to become a leader in the engineering industry, a researcher or a front-runner in the manufacturing industry, our postgraduate engineering programmes will empower you to make a lasting impact. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}