{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Mechanical-Engineering-including-an-Industrial-Year-MEng-Hons-U7UMCENGY1.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK Do you want to push the boundaries of engineering to solve complex problems to improve the sustainability and efficiency of the world we live in? This course will give you opportunity to combine your initiative, numeracy skills and detailed subject knowledge to make modern industry work better for us all. Mechanical engineering plays a vital role in many industries including aerospace, manufacturing, medicine, renewable energy and Formula 1. In fact, there is little in our daily lives that isn't touched by mechanical engineering innovations, from the cars we drive to the way our food is processed. Mandatory Year 1 Dynamics of Mechanical Systems Engineering Design Project Materials and Manufacturing Mathematics for Engineers Programming and Professional Skills Statics and Mechanics of Solids Thermodynamics and Fluid Mechanics 1 The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Saturday 12 October 2024. Due to timetabling availability, there may be restrictions on some module combinations. Engineers are among the busiest students on campus. On average, you will have around 20-22 contact hours a week in years one and two. Combined with coursework and self-study, you are likely to spend over 40 hours a week on your studies. Our courses provide the opportunity to specialise through a choice of subject modules and practical work. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2023, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. I spent a year working for one of the biggest construction companies in the world. I was working on a student accommodation project for The University of Essex where my main job was to manage the façade. The placement team helped me a lot in finding a placement, getting my CV right and getting through interviews Maryam Sebzali 88% of students say teaching staff have supported their learning well. Data for Mechanical Engineering including an Industrial Year (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Engineering Entry requirements AAA UCAS code H8HF Duration 3 years full-time Start date Sep 2025 UCAS code H200 Duration 4 years full-time Entry requirements AAB-ABB UCAS code K24B If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}