{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/graduation/winter-graduation/accessibility-and-support.aspx",
    "content": [
        {
            "p": "We are committed to ensuring that your big day is as accessible, inclusive and enjoyable as it can be for both you and your guests. Whether you require special adjustments for your ceremony or would like to read answers to our frequently asked support questions, this page has you covered. Special requirements | FAQs We want to ensure your day is as accessible, inclusive and enjoyable as it can be for both you and your guests. If there are any adjustments we could make to help achieve this, please let us know. Yes, the graduation ceremony is fully accessible. The stage has a ramp on either sides and we can reserve end row seats for any graduating students or their guests who are wheelchair users and will be attending. Please get in touch with us through the Student Enquiry Centre and we'll organise this for you. On the day, individuals with reserved seating will need to speak to a seating steward (identified by their blue gown) as they enter the hall, and they will be guided to their reserved seats. We can arrange front-row seating for any students or guests with vision or hearing impairments. Additionally, the venue has an induction loop system installed, which is a type of sound system for use by people with hearing aids. If you require one, we can also book a British Sign Language interpreter for the ceremony. Please let us know, and we will make the necessary arrangements. If you contact us, we can discuss details of your day and make any reasonable adjustments needed. If you feel the loud noises of the ceremony will bother you, students and guests are welcome to wear noise cancelling headphones if they wish. Please get in touch with us. We can discuss with you what the day will look like before, during and after your ceremony. We can also see if we can make any special adjustments to make the day easier for you. These videos may also help prepare you and make you feel less anxious about the day. There are accessible toilets available both outside David Ross Sports Village and inside, right next to the ceremony hall. Please ask one of the stewards wearing a blue gown and they will be able to show you where these are. Yes, Period Project have set up free sanitary product stations all over campus. This includes in all female and accessible toilets inside David Ross Sports Village. To view the locations, click here. If you or your guests have any questions or require additional support, please contact the Student Services team."
        }
    ],
    "pdf_files": []
}