{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/scholarships/termsconditions.aspx",
    "content": [
        {
            "p": "Please read this webpage carefully and ensure that you understand the conditions of the scholarship you have applied for. The University of Nottingham reserves the right to withdraw your scholarship if you are subsequently found to be ineligible or if these terms and conditions are not adhered to. The University also reserves the right to amend its scholarship provision without notice. As an International Student Recruitment scholarship holder, you must: Agree to the University of Nottingham contacting you during the period approximately two years after your graduation for an update on how the scholarship has influenced your career. Your data will also be passed to our Alumni Team who retain data in support of your lifelong relationship with the University (see Alumni Privacy information). For queries or to remove your data from the Alumni database please contact alumnienquiries@nottingham.ac.uk Undergraduate scholarships are only offered for the first year of study. Masters scholarships are awarded for one year only. Other scholarships vary so please check the individual pages for further details. Scholarships are not automatically extendable if you extend your studies. Scholarships are awarded based on the information provided in your online scholarship application and your academic application. We reserve the right to withdraw a scholarship, if we are of the reasonable opinion that information provided is not accurate. International scholarships are available to self-funded students only. If you are sponsored by an external funding body, e.g. government, business, employer, trust or charity, you are not eligible to apply (with the exception of our Developing Solutions Scholarship). International scholarships cannot be combined with other competitive University scholarships. Where you are awarded multiple scholarships, the single highest-value award will be applied. We reserve the right to withdraw an international scholarship, where students are in receipt of multiple awards. Tuition fee scholarships will be deducted from the tuition fees charged to you as a student at Nottingham, split across your payment instalments. We will not pay tuition fee scholarships to you directly. No cash alternatives are available if the total funding you have been awarded is in excess of the tuition fee. You may be required to repay the scholarship amount, in full or pro-rata, if you withdraw from your course before completion. Scholarships cannot be deferred to the following academic year, even if your academic offer is deferred. If you decide to defer your studies at Nottingham, you should apply again for our scholarships the following year once you have an offer for the new academic year. There is no guarantee that we will offer the same scholarships each year, or that you will be offered a scholarship again after reapplying. The University's decision relating to international scholarships is final. Where a scholarship is co-funded with an external organisation or donor, we will pass on details (name, title of award, course title, academic school) to the external organisation for the purpose of selection and reporting. Your contact details will not be given to an external organisation or donor without your prior consent. See our privacy policy for further information on how the University of Nottingham processes your personal data."
        }
    ],
    "pdf_files": []
}