{
    "url": "https://www.nottingham.ac.uk/studentservices/support/financialsupport/managingyourmoney/paying-household-bills.aspx",
    "content": [
        {
            "p": "Moving into a house for the first time? Excited about sharing with your friends? Looking forward to the freedom and independence of being totally in control of when you eat, come in and go out? That's great, but don't forget that you have to pay the bills as well as the rent! Gas and electricity bills tend to be the largest of all utility bills. When you move into your house you should ask the landlord for details of the current supplier. If they don't know you can find out yourself online or over the phone. Once you move in; If your bills are included in your rent, check with your landlord to see if there is a cap, and the cost if you exceed this. When you move out of the house call your energy supplier to let them know you are leaving, and more importantly, give them the final meter readings. It is very important that you do this so you don't end up paying part of the new tenants bills! Make sure you give them a forwarding address for the final bill. When you move into your new student house the water provider is already set up. Unlike other household bills it is not possible to change your water supplier. Some landlords will include the water bill in the rent if the house does not have a water meter, but is charged water rates. Make sure you check this before you move in. On the day you move into your house you should contact the water company and let them know the date that you will become responsible for water costs. If you have a water meter is is important that you report the meter reading to the supplier, or arrange for somebody to come and read the meter, on the day you move in or take over the contract for the property. This is to ensure that you are not charged for any previous water usage. On the day you leave, or the day the contract ends, make sure you take the meter reading and report as above. Also advise a forwarding address for the final bill. Any bill left unpaid could affect your credit rating. Most students consider access to the internet as vital, so you'll probably want internet access established in your house as soon as possible. The internet is normally offered as a fixed amount per month for an agreed number of months. Payments are usually paid by direct debit. To keep costs to a minimum when deciding on which internet provider to use, and the type of contract you want, it is important to think about the following points: It is also important to note that some internet providers require you to have a landline installed in your house, which can add costs to your bill such as line rental and installation costs. An internet contract is ususally set up for a minimum period and then continues until you cancel. Make sure you cancel your contract when you leave the house. Others bills you could have are: Student households, where everyone is on a full time course, do not have to pay council tax. To help you find the right contract to suit your needs try a comparison website; some are listed below: Simply Switch Note: The University is not responsible for the content of external websites and a link to such a website does not necessarily imply an endorsement of its content. Living in a shared house with other students can be a great experience, but can come with challenges. You will be responsible for making decisions with your housemates and you may be responsible for paying the bills. Remember that The Students' Union advice team can offer all kinds of help in relation to housing. This includes checking your tenancy agreement before you sign it, helping if you have problems with landlords, letting agents or housemates and/or advice and support with bills and deposit issues. Contact SUAdvice@nottingham.ac.uk or +44 (0)115 84 68730. Our free Moodle course, understanding your budget, living in a shared house, will prepare you for the realities of shared living and help you to plan for your individual situation. As a student household there are different ways in which you can sort out paying your utility bills. It could be useful to have a house meeting to analyse the different methods and make a joint decision. One way to pay the bills is through a joint 'house' bank account. Joint accounts are offered by all major banks and are quite easy to set up. Each member of the household agrees to pay a fixed amount into the account either termly, when they receive their student finance, or monthly. All the household utility bills will then be paid from this account using a variety of methods. The most common way to pay is by monthly direct debit. You can often get the best deals if you pay this way. Alternatively you can pay the bills when they arrive by online direct payment. Points to consider: An alternative way to organise paying household bills is by appointing each household member respnsibility for a specific bill. The assigned student has to collect money from each of their housemates and then pay the bill. You should bear in mind: As the cost of utility bills rises, you will need to try to keep the bills affordable. Here are some tips to save money on gas, elexctricty and water; When making arrangements to leave the house inform all utility suppliers of your leaving date and make sure you advise them a forwarding address for any final bill. If you have a joint bank account you will need to close this once all payments have been made. Any surplus balance can be distributed to the house members. Keep a copy of the final bills, showing payment in full. Your landlord may want to see evidence that all outstanding bills have been paid before your deposit is returned to you."
        }
    ],
    "pdf_files": []
}