{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Music-and-Music-Technology-BA-Hons-U6UMUTEC.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK The impact of digital is continually changing the way we compose, collaborate, share and showcase music. Come and explore these boundaries! Theory and practice All students get a solid grounding in key repertoire and historical contexts. You will also get practical experience in: Mandatory Year 1 Elements of Music 1 Elements of Music 2 Aesthetics of Electronic and Computer Music Applied Digital Musicianship Repertoire Studies 1: Music Before the 20th Century Repertoire Studies 2: 20th-Century Music Optional Global Music Studies Performance 1 Skills in Composition Ensemble Performance The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Monday 11 November 2024. Due to timetabling availability, there may be restrictions on some module combinations. The minimum scheduled contact time you will have is: Weekly tutorial support, ensemble rehearsals and the accredited Nottingham Advantage Award provide further optional learning activities, on top of these class contact hours. Your lecturers can be available outside your scheduled contact time to discuss issues and develop your understanding. This can be in person and online. As well as your timetabled sessions you’ll carry out extensive self-study. This will include course reading, seminar preparation and music practice. As a guide 20 credits (a typical module) is about 200 hours of work (combined teaching and self-study). Class sizes vary depending on topic and type. A popular lecture may have up to 50 students attending while a specialised seminar may only contain 10 students. Your lecturers will usually be from our academic staff many of whom are internationally recognised in their fields. Performance tuition All students taking solo performance modules will receive fully paid tuition with one of our experienced instrument and vocal tutors. The allocations are generous: Additionally, for each assessed recital performance, students will receive a bursary to support practice with an approved accompanist. Many of our performance tutors are happy to provide additional paid-for support. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. As soon as I stepped through these doors I felt a huge sense of community here in the department. My lecturers have supported me all the way and have pushed me to try out modules I was interested in but slightly scared of. I’m happy to have Nottingham as a home and the Department of Music as a family! Amber Frost Music and Music Technology BA Faculty of Arts Entry requirements ABB UCAS code W300 Duration 3 years full-time Start date Sep 2025 Entry requirements AAA UCAS code Y002 Duration 3 or 4 years full-time depending on language or placement choices Entry requirements BCC UCAS code Y14F Duration 4 years full-time UCAS code WV35 83% say staff value students views and opinions about the course Data for Music and Music Technology (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}