{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Chemical-and-Environmental-Engineering/Department-of-Chemical-and-Environmental-Engineering.aspx",
    "content": [
        {
            "p": "Chemical Engineers work in a wide range of companies manufacturing products as diverse as fuels and petrochemicals, inorganic bulk chemicals, food and drink, household products such as soaps and detergents, pharmaceuticals, polymers and fine chemicals. Their job is to transform efficiently and safely raw materials into useful products with minimum environmental impact. Chemical Engineering has been established at the University of Nottingham since 1961, and ranks as a UK top 10 chemical engineering department in The Guardian University Guide 2017. We have a long history of collaboration with industry, and graduates gain jobs with major companies. The same programmes are available in the UK and at the University of Nottingham Malaysia. Our MEng programme is accredited by the Board of Engineers Malaysia (BEM) and is recognised under the Washington Accord. The MEng degree is also accredited by the Institution of Chemical Engineers as fully satisfying the educational base for a Chartered Engineer (CEng). Additionally, it holds accreditation from the Institute of Materials, Minerals, and Mining in the UK. Chemical engineering can be defined as the processing of materials on a commercial scale, ranging from traditional commodities and utilities through to modern, high added-value products. This involves the integration of engineering principles and applications with chemistry and other sciences.There is a growing need to harmonise industrial and commercial activities with the protection and enhancement of the environment, and our Chemical Engineering with Environmental Engineering course is intended to equip you to specialise in environmental aspects of the discipline. View our undergraduate degree programmes. During the fourth year of the MEng, your studies will concentrate on more advanced topics and specialised topics. The advanced topics can be advanced reaction engineering, plant-wide control, whole-process synthesis and computational methods, environmental assessment, water treatment and air pollution. Specialised topics include nanotechnology, food technology, oleochemicals, and petroleum refining. You will also undertake a substantial and wide-ranging group project that allows you room to further develop your own specialised interests. You will start your degree by studying mechanisms and principles of operations involving flow of fluids, heating and cooling, chemical composition change and the interrelationship between heat and power. Fundamentals of material and energy balances, separation processes and environmental engineering are introduced and illustrated in small-scale laboratory work. During your second year you will learn about common process operations, equipment items and methods for their design. You will also undertake laboratory work of intermediate scope. If studying the environmental engineering course you will also cover materials, biotechnology, interfaces, chemical thermodynamics, engineering management, and environmental protection or environmental assessment. In your third year you will focus in more detail on safety, separation techniques, reactors, control, project management; and chemical product design or waste and waste water treatment if studying the environmental engineering course. The laboratory work you undertake will be wider in scope and you will complete an extensive group project. If you are studying for the MEng you will also undergo at least 12 weeks of industrial training in an external institution before starting your fourth year of study. During the fourth year of the MEng, your studies will concentrate on more advanced aspects of reactors, whole-process synthesis and computational methods with the environmental engineering course also covering air pollution. You will also undertake a substantial and wide-ranging group project that allows you room to further develop your own specialised interests. You will be equipped for a career in chemical engineering, working as a professional in areas such as process and product design or plant management, or for work in other disciplines benefitting from the technical and problem-solving skills you have acquired. Additionally, the chemical engineering with environmental engineering degrees equip you for a career in environmental engineering, perhaps working as a professional in environment related functions such as waste treatment, pollution control or materials recycling. As a Nottingham chemical engineering graduate, you will be highly sought-after by companies worldwide. With our unique combinations of chemical and environmental engineering, we are well placed to provide multi-skilled graduates to work in a diverse range of industries including energy, oil and gas, pharmaceutical, food and environmental services, as well as government agencies and departments around the world. You can find employment in a wide range of cutting-edge industries, including petrochemical, energy, pharmaceuticals, and environmental consulting. You can be an environmental engineer, process engineer, project manager, researcher, consultant, and more. You will explore topics such as Fluid Mechanics, Thermodynamics and Heat Transfer, Process Design and Control, Materials and Sustainable Processes, Biochemical Engineering and Industrial Process Analysis. You need a minimum of BBB in your A Levels or STPM to enrol in the Chemical Engineering MEng (Hons) or Chemical Engineering with Environmental Engineering MEng (Hons) courses. If you have completed your high school diploma and want to pursue these courses, or any engineering courses for that matter, you can enrol in our Foundation in Engineering course for a direct route. You will also need to be proficient in English as all classes are conducted in this language. You can join organisations such as The Institution of Engineers Malaysia (IEM) The Institution of Chemical Engineers Malaysia (IChemE Malaysia) The Malaysian Society of Environmental Engineers (MSEE) Of course, we offer postgraduate programmes in engineering. Our Engineering MPhil is a 1 to 2 years full-time/2 to 4 years part-time course, while the Engineering PhD is a 3 to 4 years full-time/6 to 8 years part-time course. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}