{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Archaeology-and-Geography-BA-Jt-Hons-U6UARCHG.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK How do human societies develop and continue? What impact does climate and the environment have on society? Geography and archaeology are natural partners for exploring questions like these. Mandatory Year 1 Careers Skills for Geographers Introduction to Geographic Information Systems Tutorial Understanding the Past I Understanding the Past II Optional Comparative World Prehistory Rome to Revolution: Historical Archaeology of Britain Exploring Human Geography Planet Earth: Exploring the Physical Environment Exploring Place Globalisation: Economy, Space and Power On Earth and Life The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Tuesday 10 September 2024. Due to timetabling availability, there may be restrictions on some module combinations. You’ll have at least the following hours of timetabled contact a week through lectures, seminars and workshops, tutorials and supervisions. Your tutors will also be available outside these times to discuss issues and develop your understanding. We reduce your contact hours as you work your way through the course. As you progress, we expect you to assume greater responsibility for your studies and work more independently. Your tutors will all be qualified academics. You will have a personal tutor from the Department of Classics and Archaeology and a joint honours adviser from the School of Geography. Sizes of lectures and seminars vary according to topic. A popular lecture may be up to 250 participants, with specialised seminars of 10. As well as scheduled teaching you’ll carry out extensive self-study such as: As a guide, 20 credits (a typical module) is approximately 200 hours of work (combined teaching and self-study). On this course you will also undertake 10 days of fieldwork. This usually takes place during the summer break and can involve up to five days in a museum or similar environment. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. Archaeology and Geography at University of Nottingham, the To see official information about this course and others visit Discover Uni. Make an informed choice. See course info Faculty of Arts Entry requirements BBB UCAS code V400 Duration 3 Years full-time Start date Sep 2025 Faculty of Social Sciences Entry requirements AAB UCAS code L700 Duration 3 years full-time Entry requirements AAA UCAS code Y002 Duration 3 or 4 years full-time depending on language or placement choices Department of Classics and Archaeology Entry requirements ABB UCAS code VVC4 If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}