{
    "url": "https://www.nottingham.ac.uk/studentservices/services/libraries.aspx",
    "content": [
        {
            "p": "Your University Card is your library card. Use it to access our eight libraries and borrow books from our self-service machines. Our eight libraries are home to subject-specific resources but you're welcome to use any location. At key times of the year, 3 of our libraries will open 24 hours. Visit individual library pages to check the opening times for your preferred location. Visit get library ready for your guide to making the most from our libraries. Libraries essentials Libraries website NUsearch - search for books and online resources NUsearch is the University's library collections discovery tool. Use NUsearch to manage your library account, search our physical library collections and access thousands of e-resources including ebooks and ejournals. Find the key resources for your subject area in our online subject guides. Need help with using NUsearch? Take a look at our frequently asked questions or attend one of our Ask Libraries webinars. Finding resources You can borrow up to 60 print books from our self-service machines in libraries. Pop in to our libraries to browse and borrow or place a request on NUsearch and we'll let you know when your book is available to collect. Books are usually issued for 7 days and will auto-renew every day unless someone else requests them. In demand items are issued for 3 days (7 days for part-time students and those eligible for Enhanced Library Support. We will email you to let you know if you need to return your books. Return any books on time to avoid fines. Borrowing and returning books Our friendly and knowledgeable Library staff are on hand to support you - just look out for the blue lanyards or get in touch via live chat, social media, email or phone. Find resources and support to help develop your information and academic skills on our support for your studies webpage. We run a range of regular webinars, Q&A's and online study sessions. Visit the Libraries events calendar to browse upcoming sessions. Join the library community:"
        }
    ],
    "pdf_files": []
}