{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/our-campus-and-facilities/how-to-get-to-the-city-centre-from-sutton-bonington-campus.html",
    "content": [
        {
            "p": "There are many transport links that will get you there. In fact, it’s so close that you might even take yourself there on a bike or on foot! Sutton Bonington Campus is situated 11 miles south of the central campuses, near the village of Sutton Bonington - so if you're studying on this campus, you're not going to be able to walk into Nottingham City Centre. That shouldn't stop you visiting though! Let's look at the different ways you can get to Nottingham’s city centre from the campus. Nottingham has an award-winning public transport system. It’s fast, friendly and incredibly efficient. Discounted student fares are available, and if you get a Robin Hood card you can use it on the tram too. Catch the 901 Hopper bus from Sutton Bonington and get off at University Park Campus – from here you can catch the NCT 34/34C to travel to the city centre, then get off at the Maid Marian Way stop for Market Square. Or walk to the South Entrance to catch Trent Barton’s indigo services from University Boulevard. indigo services stop on Friar Lane in the city centre, which is just off Market Square. You can also catch the 901 Hopper bus at Clifton Park & Ride, and from here you can: Please remember all tram travel is ‘buy before you board’, so make sure you buy a ticket from the machine at the stop or via the NET app, or validate your contactless card/travel pass before getting on a tram. For more information including tickets and timetables, please visit www.thetram.net. Some students based at Sutton Bonington choose to bring their car with them to University. Find out more about the car parks in Nottingham City Centre here. It can be expensive to park in the centre, so you may find it cheaper to use one of the City’s Park & Ride sites, where parking is free and you just pay for your bus or tram ticket. The University of Nottingham, University Park, Nottingham, NG7 2RD Campus and facilities Beyond a welcoming community, the facilities you’ll find at the University of Nottingham will provide you with the complete package for a great student experience. UON Hungry? Don’t worry, there are plenty of dining options at the University of Nottingham. We’ll talk about the best places to refuel: on campus and in the city. Sutton Bonington campus The University of Nottingham, Sutton Bonington, Leicestershire, LE12 5RD, UK If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}