{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Education/MPhilPhD-programmes-education.aspx",
    "content": [
        {
            "p": "School of Education This course is aimed at developing individuals into an independent researcher with expertise in a specific area of education in a high-quality doctoral training at the School of Education, University of Nottingham Malaysia (UNM). Our international team of scholars offers a dynamic, inclusive, and rich learning and research environment at master (MPhil) and doctoral (PhD) levels. The training is tailored to individual needs to develop candidates both professionally and personally in face-to-face, online, and extracurricular sessions (professional seminars, research groups, and conferences). Doctoral candidates are based at the Malaysian campus. International students are registered full time (due to immigration requirements), while local students can choose between part-time and full time. Applicants will have a strong background in research and their chosen discipline (see our areas of research below) and be outstanding, highly motivated, and enthusiastic students with an inquisitive mind-set. First year candidates will undertake a research methods module in order to gain a more in-depth background in designing and conducting quantitative, qualitative, and mixed-methods research. The first year (probationary year) is seen as a bridge between undergraduate, postgraduate, and professional experience and the required independent level of research. Candidates spend this year with broadening their knowledge in the area of interest, refining their proposal, developing the methodology, securing ethical clearance, and collecting some initial data. At the end of the first year, this well-developed research proposal and the research skills gained are assessed in a mini-viva with an internal assessor. In the second year, candidates collect and analyse data, while continuously engaging with the literature and refining their chapters. The progress made in this year is also assessed by an internal review, where the internal assessor determines whether requisite progress has been made in order to submit at the end of the third year. The third year is primarily focused on preparing and writing up the thesis, which is defended in an oral examination (viva voce) by an external examiner who is an expert in the field. MPhil students must present a thesis of up to 60,000 words, embodying the results of their advanced study and research. The thesis must satisfy the examiners regarding knowledge of the general field of scholarship to which the subject belongs. An oral examination occurs at the discretion of the examiners. PhD students must present a thesis, maximum 100,000 words, demonstrating originality and innovation on the subject of their advanced study and research. The thesis must satisfy examiners regarding knowledge of the general field of scholarship to which the subject belongs. They must also present themselves for an oral examination on the subject of their thesis and its general field of scholarship. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": [
        "pdf_files/SoE-PGRApplication-ProposalGuide.pdf"
    ]
}