{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/visa-help/how-to-extend-your-student-visa.aspx",
    "content": [
        {
            "p": "These questions are asked to determine whether you will be able to verify your identity using the UK Immigration: ID check app, instead of attending an in-person biometrics appointment at a UKVCAS centre. Are you intending to live in one of the Crown Dependencies of the United Kingdom? Answer ‘No’ to this question. Do you have a current EU, EEA or Swiss passport? EU/EEA/Swiss nationals over 18 will be directed to verify their identity using their passport and the UK Immigration: ID check app. Do you have a UK biometric residence permit (BRP)? You will be asked this if you selected ‘No’ to the previous question. Are you 17 years old or younger? If you 17 years or younger, you will need to attend a biometrics appointment. Do you have any children applying with you? If you are applying with dependant children, you will need to attend a biometrics appointment. Is your name on your biometric residence permit the same as on your current passport? You will be asked this if you answered, ‘Yes’ to do the “Do you have a BRP?” question. If the name on your BRP is different to the one in your passport, please contact us for further advice. If you’re able to use the UK Immigration: ID check app, you will then be directed to complete the electronic application form and will need to complete each section before moving onto the next. If you’re not able to use the app, don’t worry, the guidance below will still be useful to answer the questions which appear on the alternative version of the visa application form. We advise that you have your CAS information, your current BRP and passport with you when you complete the form. Section of application form Guidance notes Immigration Adviser details You are asked if you have an immigration adviser based in the UK. You would only select 'yes' if you are using an immigration solicitor / lawyer for your visa application. This does not include the University Immigration Adviser role. Contact preferences Ensure you enter a current email, postal address and telephone number for yourself. It is important to enter an email address which you can access as this will be the main official communication route which the Home Office uses to contact you regarding your application. Other names and nationalities If you have ever been known by any other names you should include these in this section. You do not need to mention unofficial nicknames. Your place of birth may not be stated with your passport, in which case; just give the information you know to be true. If unknown, state 'unknown'. People applying with you You will be asked to provide details of any dependants that will be applying with you in your visa application form, but please note that your dependants will also each need to complete a separate form. Your location You must be physically present in the UK when you complete this visa application. If you are overseas, please refer to our overseas visa application guidance. Personal Details Enter the details from your passport. You are also asked to provide your UK address history for the past 2 years here. Family and relationships Even if you are not applying for this visa with a current partner, you will need to give your current relationship status. Details of your father and mother must also be provided here. If you only have partial details about a parent, it may be possible to enter 'Unknown' in any relevant fields and then explain more in the 'Additional Information' section later in the application form. Travel history – time lived in UK You are asked how long you have lived in the UK. You should enter total period you have lived in the UK (including on previous visas you may have had before your current one). You are then asked if you have left the UK for more than 2 weeks during this time and should include each instance of this. Take care with this section to ensure accuracy. Travel history – Travel to Australia, Canada, New Zealand, USA, Switzerland, EEA Include details of any travel to these countries even if you have covered the same information in the previous question. Medical Treatment in the UK Complete this section as accurately as you can. We expect most applicants will not have been asked to pay for medical treatment in the UK, but if this applies to you please contact the Visa and Immigration team for further advice. UK National Insurance number You will only have a National Insurance number if you have worked in the UK previously. UK Driving License If you have a UK driving license, you should enter the details here. Receipt of public funds Student visa holders should not be claiming public funds (welfare/benefits), so most students should tick 'No'. Please speak to an Immigration Adviser if you think you have been claiming public funds. Please note that Council Tax exemption which students are entitled to is not a public fund. Immigration permission – current leave You are asked about your current visa or leave to remain. ‘Leave to remain' simply refers to a visa granted in the UK. We expect most people will have their most recent visa in the Student (formerly Tier 4) category. A small number of applicants may be switching from a dependant visa or Skilled Worker (formerly Tier 2) for example. You need to check if you can make the switch here in the UK by referring to the Student policy guidance. You will need your current visa or BRP with you to complete this section. Criminality and war crimes Please make sure that you are honest in this section as it can harm your visa application if you are later found to have withheld information. We expect the answer to be no to all of these questions in the vast majority of cases. If you are unsure about any of the questions in this section, please do contact us. Employment history If you have previously worked in any of the areas listed in the form, you should include the details here. Study details – CAS number Enter the CAS number issued to you by the University of Nottingham here. Study details – type of sponsor The University of Nottingham is a Higher Education Provider with a track record of compliance. Study details – postgraduate medical doctor or dentist You must answer 'No' to the question 'Are you going to be a postgraduate medical doctor or dentist on a recognised Foundation Programme.' If you answer ‘Yes’ to this question, UKVI will not process your application as a standard Student application, which will lead to complications. Study details – UCAS Only answer 'Yes' if you applied for your course through UCAS. If you applied to the University of Nottingham directly or through an agent, answer 'No'. Study details – sponsor licence number and address The sponsor license number is RFDX42DB2. The address is ‘The University of Nottingham, University Park, Nottingham, NG7 2RD’. Study details – main site of study If your main site of study (as confirmed on your CAS) is a site other than University Park, you will need to provide the address here. Study details – name of sponsor institution The name of your Student Visa sponsor is The University of Nottingham. Study details – course name and qualification Please use your CAS to complete this section as the information should match. For the qualification you will get, check your CAS and enter the Academic Level of study showing on your CAS. UG = RQF 6, Masters = RQF 7, PhD = RQF 8 Study details – course start and end dates Enter the course dates exactly as shown on your CAS. If you are a current student continuing your current studies, this might not be your actual true course start date, but the start date of your next visa period. In this case we will add an additional note to your CAS to indicate the original course start date. Financial sponsor You are asked if you have a current or past (within the last 12 months) official financial sponsor. This could be the government in your home country, the British Council, a University or an international organisation for example). If you are currently in receipt of funds from the University of Nottingham this information should be confirmed on your CAS. Please ensure this is the case. If you are currently in receipt of any other official financial sponsorship, you should have an original letter confirming this arrangement to present with your visa application. If you are receiving or have received sponsorship in the last 12 months from a government or an international scholarship agency for all of your tuition fees plus your living expenses, you must also provide a letter from your financial sponsor confirming that they give their consent for your immigration application. This is sometimes called a ‘no objection letter’. If you do not provide this letter, your application may be refused. Student loan If you have received any funds in the form of an official Student loan, you should include this here. For example, if you are receiving funds from US Federal Aid. Course fees Your CAS should show the amount that your tuition fees are for the first year (or, for current students, this will be the current or next academic year as stated on the CAS). The CAS should also show any money that you have paid or that has been allocated towards your fees from a University scholarship. We do not advise that you present receipts as evidence of payment because this is not listed as an acceptable method of demonstrating fees paid in the student immigration rules. Marshall, Chevening or Commonwealth scholarship If you receive one of these specific named scholarships, answer ‘Yes’ to this question. If you receive any other type of scholarship, or no scholarship, answer ‘No’ here. English language ability You are asked if you have provided previous evidence of English language. By 'previous application', this means a previous visa application for a UK visa, which is likely to apply to you if you are extending your visa in the UK. Select 'yes' if you are extending your current visa for your current programme."
        }
    ],
    "pdf_files": []
}