{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/getting-around.aspx",
    "content": [
        {
            "p": "Welcome information We have three campuses in Nottingham: University Park Campus, Jubilee Campus and Sutton Bonington Campus, as well as teaching locations at the Queen's Medical Centre (QMC), City Hospital and Derby Royal Hospital. Where you will be based depends on the subject you are studying. Campus maps and directions Get to our campuses | Travelling between campuses Arriving by public transport offers convenient options for reaching our campuses: For more details, visit our public transport page. Public transport options Cycle to our campuses and park in one of our 5,000 cycle parking spaces. You can also make use of our on-campus cycle facilities, including showers, lockers, drying cabinets and cycle repair stands. Use our interactive maps to find your nearest cycle parking, shower and repair facilities. Cycle facilities If driving to campus by car, entrance details and directions can be found on our campus maps page. A number of permits are available to students. You can apply for your permit once you have completed online registration. Students will be issued with 'orange zone' parking permits and are permitted to only park in the designated orange zone areas. To find out more, view the student parking page. Student parking The university offers a free inter-campus bus service called the hopper bus. No matter which campus you find yourself on, our hopper buses make getting between campuses quick and easy. Hopper bus timetables The Medilink bus provides free transport for students between Queen's Medical Centre (QMC) and City Hospital. Simply show your university card to travel for free. For routes and timetables, visit our Medilink bus page. Medilink bus Why not stay active and explore our campuses on foot or by bike? See approximate walking times between campuses for easy travel planning. Walking times Watch the video below to hear first-hand experiences of using public transport around the city."
        }
    ],
    "pdf_files": []
}