{
    "url": "https://www.nottingham.ac.uk/student-living/accommodation/care-experienced-and-estranged-students.aspx",
    "content": [
        {
            "p": "Find the campus that's right for you Our student community is an incredibly diverse one, comprising a vast range of identities, backgrounds and lived experiences. As a member of our diverse community we expect you to extend respect to others both on and off campus as a respectful member of your new campus and city. We are a positive and peaceful community. Pledge to be a part of this so that we can be truly stronger together. As a diverse and welcoming community, we pledge to support each other and be respectful of the challenges that each of us face in our everyday lives. We might be from different backgrounds and identities, but we are one community who is Stronger Together. This page is a place for you to learn about fellow students from different walks of life, understand a bit more about their University experiences, and find out how you can support each other. Find your Student Network Discover Accommodation Bursaries The University of Nottingham Accommodation Bursary provides first year care experienced and estranged students (who meet our eligibility criteria) with support towards the costs of their accommodation. Options will only be available at University Park, Jubilee Campus, Broadgate Park, Albion House, Dagfa, Deakins Place, Nottingham Two, St Peters Court, Riverside Point, Raleigh Park and Madison Gardens. We are also able to assist with Bonington Student Village for Sutton Bonington campus based students. Some of these halls will have limited spaces, and we will work with your preferences to provide the best available option. Applicatons for 2025/26 will open in April 2025. *If catered halls are selected you will be required to move for the summer element of your stay. Discover our rooms Start your application Eligibility To receive the Care Experienced and Estranged Accommodation Bursary in the 2025/26 academic year, you must: The University of Nottingham recognises that care experienced and estranged students may both struggle to find a UK based guarantor and have difficulty paying the fees to pay for a guarantor scheme. The University of Nottingham is fully committed to supporting care experienced students and has taken the Stand Alone Pledge to support estranged students. As such we have made arrangements to pay associated application charges for students who qualify*.We are only able to assist students with charges incurred through use of the Your Guarantor scheme. Visit the YourGuarantor Support Pages to apply *students who qualify for support further to submitting an approved application to Accommodation Service The Women*’s Network is here to represent anyone who considers womanhood to be part of their identity inclusive of trans, non-binary and intersex inclusive people, and anyone who experiences oppression as a woman. The aim of the Network is to create a safe and engaging space for students who identify as women* through: More information can be found here. The Black and Minority Ethnic Students’ Network exists to provide a safe space within the University of Nottingham’s Students’ Union where self-identifying BME students (including students of African, Asian, Arab and Afro-Caribbean descent, those from minority ethnic groups including Jewish and Romani students, and those who identify as having mixed or multiple ethnicities) can come together, discuss the issues affecting them, and campaign to improve their student experience. The aim of the Network is to create a safe and engaging space for Black and Minority Ethnic (BME) students through: The disabled community at Nottingham is incredibly diverse, strong and supportive. The Disabled Students’ Network are a collective of fellow students you can go to for advice, support or just a chat. The aim of the Network is to encourage cooperation, coordination and collaboration among Disabled Students’ Network members in order to create an engaged supportive community in the Students’ Union for students with disabilities, supporting their activities and interaction between different Students’ Union groups. The aim of the Network is to create a safe and engaging space for disabled students through: The Mature Students' Network is here to raise awareness of issues affecting mature students, and to promote and protect the welfare of mature students. Mature student refers to Undergraduate students who are aged over 21 on entry to the University, and Postgraduate students who are aged over 25 on entry to the University. The aim of the Network is to create a safe and engaging space for mature students through: The International Students' Network is supported by the SU part-time International Students' Officer who works alongside an elected committee. All international or EU students are automatically considered members of the Network. The aim of the Network is to create a safe and engaging space for international students through: The LGBT+ Network exists to represent all students studying at the University of Nottingham who do not conform to the heteronormative or cisnormative expectations of society (and therefore anyone who self-identifies as LGBTQIA+). This also includes questioning students and anyone who experiences any sort of queerphobia/bigotry. The aim of the Network is to create a safe and engaging space for LGBT+ students through: You don't have to do much! Just be aware of our differences and how things that may seem like everyday experiences for some can be challenging for others. And speak up when you see something that seems inappropriate! In the unfortunate event that you do experience harassment, or if you are worried about someone else, please contact the University confidentially via Report and Support."
        }
    ],
    "pdf_files": []
}