{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Computer-Science/School-of-Computer-Science-Research.aspx",
    "content": [
        {
            "p": "Our multidisciplinary research themes include Image Processing and Computer Vision, Artificial Intelligence and Applications, Human-Computer Interaction and Ubiquitous Computing, Software Engineering and E-Learning. The School of Computer Science at the University of Nottingham Malaysia (UNM) focuses on the development of various intelligent systems and computational techniques with applications to a wide range of real-world problems. The research conducted within the school is generally focused on developing advanced computer science and artificial intelligence technologies, which in turn is linked to several university-wide priority areas, such as Precision Imaging and Smart Products, which are Beacons of Excellence at the UK Campus. Our research also creates collaborative links to other local and international research organisations, universities, government agencies and industries that can benefit from intelligent computing. A postgraduate computer science degree is key to opening doors to various exciting job opportunities in this field. Pursue a career in research and academia, software development, data science and analytics, cybersecurity, artificial intelligence and machine learning, build your own startup or join innovative tech companies, offer your expertise as a computer science consultant, or contribute to government initiatives. Individuals with a Master’s or PhD in Computer Science are in demand globally as the world increasingly relies on computers and technology. We invite you to explore our postgraduate computer science programmes to learn more about admission requirements, application procedures, course content and funding. Whatever your aspirations are - whether you want to become a researcher, a leader in the tech industry or an AI expert, our computer science postgraduate degrees will equip you with all you need to succeed. Join us in shaping the future of computer science through research and innovation. Yes, you can apply for a master’s or PhD in computer science even if you have a non-computer science background. However, you may have to take some prerequisite courses and attend an interview. All applications are evaluated on a case-by-case basis. This will depend on the course you’re enrolled in. However, specialisations may include artificial intelligence, and software engineering. Contact us for further information on areas of specialisations. Yes, we offer fundings such as scholarships, financial aid and grants to support our postgraduate computer science students. Programming experience is always beneficial when it comes to computer science. As such, postgraduate computer science courses may require potential students to have programming experience. You may have to take courses to acquire the necessary skills. Yes, a master’s in computer science is worth it. It will deepen your knowledge, open up career opportunities, allow you to specialise in your area of interest, offer research opportunities, enhance networking chances and provide students with a global perspective. The difficulty varies from one person to another. However, with a strong foundation, good time management, support and collaboration, completing a postgraduate degree in computer science is possible. Benefits of obtaining a master’s or PhD in computer science include: Career advancement Specialisation opportunities Research opportunities Networking opportunities Skill development Global opportunities Personal growth Leadership potential School of Computer Science The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih, Selengor Darul Ehsan, Malaysia Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}