{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Biomedical-Sciences/Biomedical-Sciences-research.aspx",
    "content": [
        {
            "p": "The dynamic world of biomedical sciences underpins much of modern healthcare. As illnesses and treatments become more sophisticated, so does the need for more understanding of the human body and the effects of drugs and diseases. The diversity of this subject area is reflected in the key disciplines that comprise the Division of Biomedical Sciences: anatomy, biochemistry, neuroscience, pharmacology and physiology. The division employs international scientists who are experienced in their field of expertise, providing you with scientific knowledge and practical skills. Students completing a research degree can undertake molecular or non-molecular research. Molecular research involves using cutting-edge molecular biology techniques, while non-molecular research utilises techniques. Biomedical Sciences is at the forefront of understanding and combating diseases, ensuring the well-being of populations worldwide. Here's why you should consider studying Biomedical Sciences at the University of Nottingham Malaysia: Cutting-edge research: Engage in research that addresses pressing health challenges, from tropical diseases to genetic disorders. Global perspective: With links to our UK and China campuses, you'll gain a global understanding of biomedical challenges and solutions. Expert faculty: Learn from internationally recognised scientists who are passionate about sharing their expertise and mentoring the next generation. State-of-the-art facilities: Our advanced labs and research centres provide hands-on experience with the latest tools and techniques. Holistic curriculum: Our courses blend foundational knowledge with practical skills, ensuring you're prepared for both research and clinical settings. The Division of Biomedical Sciences is a fantastic place to build a scientific career. Our academics are passionate about research and actively lead research in the area of tropical medicine – communicable and non-communicable diseases. Our three research clusters highlight the specialist research expertise within the division and contribute to the better understanding and management of diseases that are highly prevalent in the tropics. The Division of Biomedical Sciences believes in the power of collaboration. We have: Interdisciplinary collaborations: Engage with experts from other fields, such as engineering, data science, and social sciences, to approach biomedical challenges from multiple angles. Industry partnerships: Work alongside pharmaceutical companies, healthcare providers, and biotech firms to translate research into real-world applications. Global research networks: Collaborate with researchers from our UK and China campuses, as well as other leading institutions worldwide. Our research goes beyond the lab. We aim to: Influence policy: Our findings contribute to healthcare policies, ensuring they are evidence-based and effective. Drive innovation: From novel drug discoveries to innovative diagnostic tools, our research paves the way for breakthroughs in healthcare. Educate and engage: We believe in sharing our knowledge. Through public lectures, workshops, and community programmes, we engage with the public on vital health issues. Graduates from the Biomedical Sciences programme are equipped with a deep understanding of the human body and diseases, making them highly sought after in various sectors. Potential career paths include: Clinical Researcher Biomedical Scientist Pharmaceutical Researcher Genetic Counsellor Public Health Officer Medical Science Liaison Regulatory Affairs Specialist Epidemiologist Medical Writer Biotech Entrepreneur Also: Taught Postgraduate courses in biomedical sciences The University of Nottingham Malaysia offers state-of-the-art labs equipped with the latest technology and tools essential for cutting-edge biomedical research. Yes, UNM encourages interdisciplinary research and has collaborations with other departments and faculties within the university. Yes, various research grants and scholarships are available. Students are encouraged to discuss these opportunities with their supervisors. Absolutely! UNM has established partnerships with various industries and hospitals, providing students with practical insights and collaborative research opportunities. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}