{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Psychology/Psychology-programmes-MPhilPhD.aspx",
    "content": [
        {
            "p": "UNM/JPT-R/310/7/0013(7/26)MQA/SWA0182 UNM/JPT-R/310/7/0015(7/26)A7510 UNM/JPT-R/310/8/0014(7/28)MQA/SWA0181 Over the past two decades, psychology has become one of the most popular degree topics in the world. It is a fascinating subject that helps us to understand the ways in which our mind, brain, relationships and societies work. Here at UNM, we offer high-quality doctoral training to postgraduate students who wish to pursue an MPhil or PhD. As a research student, you will work with two members of our academic staff and become a member of one of our seven research groups. Due to the diverse nature of research within the school, there are many different possibilities for MPhil and PhD projects. Postgraduate training at The School of Psychology is designed to provide you with essential research skills and equip you with communication, information technology, personal development and employment-related skills. This training can be tailored to meet your individual needs. The School of Psychology is consistently ranked amongst the top schools in the United Kingdom and is among the leading centres for research and teaching in the world. At our Malaysia Campus, we have first class facilities and talented scholars working on cutting-edge research. We also enjoy connections with other leading universities across the world and undertake collaborative research with a range of partners both locally and internationally. Due to the diverse nature of research within the school, there are many different possibilities for MPhil and PhD projects. Progression through both programmes involves satisfactory completion of annual research activity reports as well as some optional taught courses. This rigorous training is designed to provide you with necessary research skills and equip you with communication, information technology, personal development and employment-related skills. This training can be tailored to meet your individual needs. You will also be expected to attend the school’s research seminars. Research spans nine themes : All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A master’s degree or a master of philosophy degree, plus at least an upper second class honours degree (or international equivalent) in psychology or a related discipline. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Or A first class honours degree (or international equivalent) in psychology or a related discipline. Non-UK qualifications will be assessed against this standard. MRes and MPhil An upper second class honours degree (or international equivalent) either in psychology or a related discipline. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Psychology postgraduates can progress to a career in research and higher education both in the public and private sectors. Research psychologists employed by businesses may work on a wide variety of projects from creating new ways of targeting advertising campaigns, developing new forms of 3D cinema or even assessing new drugs to treat depression. This content was last updated on 15 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}