{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/English/School-of-English.aspx",
    "content": [
        {
            "p": "Nottingham’s School of English is staffed by vibrant, international academics with a wide range of teaching and research experience. Our staff and students work side-by-side to explore a wide range of topics around the use of English, both in literature and in everyday language. We have ambitious expansion plans to meet our teaching and research needs. Our academic staff come from across the globe, and bring with them a wealth of experience and expertise. Research areas within the School include various types of applied linguistics, language, gender and sexuality, modern and contemporary literature, Malaysian literature in English, and creative writing. English is a fascinating and wide-reaching subject which enables you to investigate how language shapes, and is shaped by, the dynamic environments in which it is used. English covers a range of areas and texts. Literature study may concentrate on relating works totheir historical and social context or wider questions of artistic meaning. Language and applied linguistics study includes psychological and cognitive approaches, while creative writing will develop your writing skills and insight into the process of writing – it will train you incultural, literary and linguistic theories, enabling you to develop the high-level creative and analytical skills needed for international interactions, whether academic or professional. You will take a combination of compulsory and optional modules, which are taught in weekly seminars and combine traditional lecture-style content with small group discussions, case studies and presentations. In your ﬁrst year, you can expect around 12 scheduled contact hours aweek and you will spend a significant amount of time each week in independent study. Staff offer individual and small group consultations and encourage you to seek their advice and feedback on your work. You will be assessed using a combination of individual research-based essays, portfolios,exams, oral presentations and occasional group work. We believe that a conducive learning environment for our students is important. As such, we aim to have facilities designed to support their academic and extracurricular pursuits. Students enrolled in our English courses will have access to well-equipped classrooms, language laboratories, library resources, literary events and spaces, computer labs and online resources. At UNM’s School of English, we take pride in our distinguished faculty members who are experts in their respective fields and passionate about the English language and literature. Our faculty comprises experienced professors, researchers and educators who bring real-world experience to the classroom. We are committed to providing high-quality education, nurturing the intellectual growth of our students and working to deliver well-structured and effective English courses in Malaysia. The creative, analytical and communication skills developed during an English degree will equip you for the changing demands of the 21st-century workplace. English graduates have a range of career choices open to them. Just a fewinclude advertising, banking, broadcasting, business, communications, the creative industries, government service, human resources, journalism, law, lecturing, management, marketing, public relations, publishing,research and teaching. Some students may choose to undertake postgraduate study or teacher training. UNM’s School of English currently offers these two undergraduate English courses: Students who graduate from the University of Nottingham’s School of English should develop valuable skills in critical thinking, communication, research, and cultural understanding. This makes them well-equipped for a variety of careers. Our graduates pursue successful careers in education, publishing journalism, marketing, public relations, research and even creative industries. UNM’s School of English also provides career guidance and networking opportunities to support students in their professional development. Yes, UNM believes that students will be able to broaden their horizons through study abroad opportunities. In fact, we have a study abroad programme where students can choose to study for one or more semesters in our UK or China campuses. Yes, there are various scholarships and financial aid options to support students in their academic journey. These opportunities are based on academic merit, financial need and other specific criteria set by the university. This will depend on the course and institution you are enrolled in, as well as the level of study. The undergraduate English courses offered at UNM cost RM29,700 per year for Malaysian students and RM35,500 per year for international students. Yes, you can choose to continue your postgraduate studies in English at UNM. Current courses available include: English Language and Literature MA English with Creative Writing MA Humanities (English) MPhil/PhD Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}