{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/central/the-david-ross-sports-village-at-the-university-of-nottingham.html",
    "content": [
        {
            "p": "The £40 million David Ross Sports Village offers an inspirational and accessible sports provision for all. The sports village has been supported by a significant commitment from Nottingham alumnus and Carphone Warehouse founder - David Ross. Getting involved with sports and exercise during your time at university has so many great benefits, like making new friends, building your confidence, trying something new and staying fit and healthy. Whether you’re a budding beginner or a seasoned pro athlete, we’re here to support all of our students. We are so proud of our brand new David Ross Sports Village, complete with the latest equipment and top-of-the-range facilities, with accessible sports provisions for all. Facilities at our sports village include: For a sneak peek at what’s on offer, take our 360 tour of the David Ross Sports Village . Our Sports, Health and Wellbeing package is available for students living in university halls on University Park and Jubilee campus, Dagfa and Varsity. This package gives you access to the gym, swim, courts and over 150 classes at the David Ross Sports Village, Jubilee and Sutton Bonington Sports Centres, plus loads of other great features, including: Watch the video below to find out more about this membership. Our sports, health and well-being package provides a huge range of options to stay active during your time on campus with outstanding modern facilities and programmes located right on your doorstep. Are you ready to expand your horizons for an unforgettable student experience at Nottingham? We're here to support you through every step of your journey. Faculty of Medicine and Health Sciences UCAS code C600 Duration 3 years full-time UCAS code C630 International Students Find out why thousands of international students choose to study with us every year. UON This guide will take you around the UK and make a few suggestions to get your wanderlust fired up in each of the four nations. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": [
        "uk_pdf_files/sport-health-and-wellbeing-package.pdf"
    ]
}