{
    "url": "https://www.nottingham.ac.uk/studentservices/documents/examinations/list-of-approved-overseas-institutions-v.2.xlsx",
    "content": [
        {
            "p": "We're committed to ensuring everyone can get involved with sport and fitness during their studies. From support in the gym to scholarships for elite athletes, adaptive fitness classes to inclusive sports clubs, our dedicated team can offer you an extensive range of support to get active. We have our own dedicated Inclusive sport team to support students with a disability and/or long-term condition. We work closely with the Students' Union, Disability Support and Mental Health Advisory teams to ensure that there are accessible opportunities for everyone during their studies. Please see below for details of our support and if you have any questions, please contact our Disability Sport Officer at adam.lever@nottingham.ac.uk or speak to a member of our fitness team who will be happy to help! We strive to ensure that our facilities are accessible to disabled users. We have detailed online access guides to all our venues plus access videos following the journeys of disabled students to their activities. We offer a range of support to access our hugely popular health and fitness offer, including discounted memberships, supported gym sessions, adaptive classes and accessible climbing. Our inclusive sports team work alongside our clubs and Just Play sessions to promote a welcoming environment and where appropriate we can support adaptations to ensure you can take part. We have an established tradition of supporting and working with elite athletes who choose to study at the University of Nottingham. Our campaigns encourage an open and inclusive atmosphere to ensure that everyone feels confident to get involved with sport and fitness during their time at university. Join our network of leaders supporting our Inclusive sport team across a range of initiatives including on campus sessions, delivering to local schools and assisting para-sport major events. From live spectator sport to one-day tournaments, from our award-winning Girls' Night In to our hard-hitting 'Let's Talk #GreenandGold' events, we've got you covered! Make sure you don't miss out and get involved with the latest events from University of Nottingham Sport. +44 (0)115 748 7000 sport@nottingham.ac.uk Find our opening times here."
        }
    ],
    "pdf_files": []
}