{
    "url": "https://www.nottingham.edu.my/Study/Offer-holders/Paying-your-fees/Malaysian.aspx",
    "content": [
        {
            "p": "100% of one academic year fee upon registration at the start of semester 1 of the academic year (either based on 2 or 3 semester programme) or 100% of one semester fee at the start of semester 1 and 2 of the academic year, or semester 3 (for 3 semester programme). 100% of one academic year fee upon registration at the start of semester 1 of the academic year or 50% of course fee upon registration at the start of the semester 1 and the balance of 50% at the start of semester 2 of the academic year (semester basis). 1. Postgraduate students (full-time / part time basis) - Masters Level 2. Postgraduate students (School of Education, MSc Management Psychology, MSc Finance and Investment & MBA Part-Time Only)- Masters Level 3. Postgraduate students (School of Political, History and International Relations (part time basis)- Masters Level 4. MRes, MPhil and PhD Research Students (Full-Time / Part-Time) Fee category Amount Remarks Registration for Thesis Pending Period RM850 Postgraduate research students registering for their thesis-pending period (writing period) will need to pay for the registration fee. *Extension to Thesis Submission Date RM850 per application Postgraduate research students registering for an extension of the permitted submission date for a thesis must pay an additional fee. Submission After Agreed Submission Date RM1800 per month Postgraduate research students submitting their thesis later than the permitted submission date without approved extenuating circumstances, must pay an additional fee if their thesis is accepted for examination. MPhil/MRes Re-Examination Fee The University tuition fees for a given academic year include the fees for initial examination (ie the first attempt at an examination) in that year. If you are required to undertake re-examination and are permitted to, or are required to, undertake further study before that re-examination then the fee you pay for this further study will include the re-examination fee. Otherwise, you must pay for any re-examination, or for any initial examination where a University tuition fee has not been paid. If there are extenuating circumstances the University may decide to treat a re-examination as a first attempt, in which case no additional fee will be charged. PhD re-examination fee RM1,200 Paying your Application Fees, Local course deposit, Tuition Fees, Accommodation Fee and Miscellaneous Fee. Payments can be made by: NottinghamHub - Visa/Mastercard (preferred choice for payment of fees) Crossed cheque or bank draft payable to 'The University of Nottingham in Malaysia Sdn Bhd'. Credit / Debit card payment is available for Visa/Mastercard/American Express over-the-counter at the Semenyih Campus Finance Office Bank transfers (telegraphic transfers) or direct bank-in: please note that telegraphic transfers take an average of two weeks processing time. You are advised to make your transfer through the bank and avoid making payment through a money changer. Please ensure that you give the correct details to the bank. The beneficiary name should be \"THE UNIVERSITY OF NOTTINGHAM IN MALAYSIA SDN BHD\". CIMB Bank Berhad No 17 Jalan Jelok 6 Metro Point, Kajang 43000 Selangor Bank Account Number : 8008306319 Swift Code: CIBBMYKL Please note that cash payments are not acceptable. All cheques and bank transfers must be forwarded to the Finance Office for official receipt. Please include your name and course on the back. Do also note that cheques/bank drafts are no longer acceptable in USD currency effective from 1st June 2016. User guide - Paying accommodation fees and print receipts User guide - Paying other fees and print receipts User guide - Checking charges and due dates User guide - Paying tuition fees and print receipts User guide - Optional purchase and print receipts SPECIAL FINANCIAL AID OPTIONS Affin Bank Berhad LTAT Branch Bangunan LTAT Jalan Bukit Bintang 55100 Kuala Lumpur Bank Account Number :100260005567 Swift Code: PHBMMYKL Commencing from the academic year 2024/2025, students will be entitled to a 2.5% early payment discount if they were to pay the full academic year fee before or on 31st August 2024. Payments made after the due date would not be entitled to any early payment discounts. The early payment discounts will also not be applicable for any subsequent withdrawals during the academic year from the program/course. Early payment discount is not applicable to sponsoring bodies. All such discounts will be calculated based on net payment due after all other scholarships and discounts. For info about the Early Bird Discount, click here. The actual tuition fees payable are in Ringgit Malaysia and any shortfall or excess from any translation of foreign currencies to Ringgit Malaysia and bank charges must be borne by the student. Commencing from the January 2017 (academic year 2016/2017) all requests for tuition fee refunds upon withdrawal will be based on a percentage basis with a 15% step reduction as follows: Refund Table No of Days From Start of Registration/Session % Of Refund 0 30 80% 31 60 65% 61 90 50% The university will not entertain any requests for refund 91 days and beyond from the date of registration. In all cases, any other debt owing to the University will be subtracted from any refund of fees. The University reserves the right, at the discretion of the Director of Financial and Business Services, to make an administrative charge against any refund in order to cover any costs associated with making the refund. Please be informed that the early bird discounts will also not be applicable for any subsequent withdrawals student for the refund payments. In order to expedite your refund process, you may fill in online refund form via the Joget Application. Please click here to scan the QR Code. For those students who are facing financial difficulties, you can opt for Instalment Plan. Terms and conditions applies. Instalment Plan More information on Sponsorship / Scholarship Support available to Malaysian students. Tuition fee due date as per the below: Failure to settle the outstanding tuition fees will result in a late penalty of 5% per annum being imposed on any outstanding balance or a minimum of RM100 whichever is higher. For those who wish to apply for tuition fee installment plans, the deadlines to submit the form together with supporting documents are on the same due date with tuition fees.Students will be notified of the outcome via email. Finance Office will not accept any late applications. For any inquiries regarding the payment of tuition fees please contact the Finance Office: Tel: +6 (03) 8924 8607 Email us at: Finance-Office@nottingham.edu.my Finance-Refund@nottingham.edu.my Finance.CreditControl@nottingham.edu.my (Instalment Plan) Operating Hours: Trent Building, Level 1 (Block A) Monday – Friday (9.00 am – 5.00 pm) Student’s Service Centre, Level 1 (Block H) Monday – Friday (9.30 am – 5.00 pm) Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": [
        "pdf_files/USER-GUIDE-PAYING-ACCOMMODATION-FEES-AND-PRINT-RECEIPTS.pdf",
        "pdf_files/USER-GUIDE-PAYING-OTHER-FEES-AND-PRINT-RECEIPT.pdf",
        "pdf_files/USER-GUIDE-CHECKING-CHARGES-AND-DUE-DATES.pdf",
        "pdf_files/USER-GUIDE-PAYING-TUITION-FEES-AND-PRINT-RECEIPTS.pdf",
        "pdf_files/USER-GUIDE-OPTIONAL-PURCHASE-AND-PRINT-RECEIPTS.pdf",
        "pdf_files/Special-Financial-Aid-2024.pdf",
        "pdf_files/QR-SCAN-FOR-REFUND.pdf",
        "pdf_files/Tuition-Fee-Installment-Plan-Request-Form-YA2020.pdf",
        "pdf_files/Special-Financial-Aid-2024.pdf"
    ]
}