{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Find-an-undergraduate-course/Find-a-course.aspx",
    "content": [
        {
            "p": "An Undergraduate degree is your first degree which gives you a thorough grounding in your chosen area of study. They usually take three to four years full-time, or longer, if part time. Foundation programmes provide students a pathway to study for an undergraduate degree. While undergraduate degrees are a pathway if students want to pursue a postgraduate programme like a Master's degree or PhD. Education should be a transformative experience, and students should be empowered to pursue their dreams. Hence, our undergraduate degree programmes are carefully designed to provide a solid foundation of knowledge, practical experiences, and skills to prepare students for the challenges and opportunities ahead. Whether you have a clear idea of what you want to pursue or are still exploring your options, this page will help guide you towards the undergraduate degree programme that aligns with your interests, passions and career aspirations. Each undergraduate degree programme page listed below provides detailed information about the programme, including a programme overview, curriculum, admission requirements and career prospects. Browse our diverse range of undergraduate programmes below, sorted by area of study. From Business to Education and Engineering, there is a programme for everyone to discover. Application guide, intake deadlines and student requirements at your fingertips. Discover our variety of secure and comfortable student residence halls inside and outside our campus. Learn more about the opportunity to study in our China or UK campus. More on our teaching facilities and resources. The guide for international students, from entry requirements to visa applications, Get up to date on our latest Open Days, masterclasses and campus events. Get in touch with our friendly counsellors to find out more about UNM. Find a programme Get in touch Get the full list of tuition fees for all undergraduate programmes. A list of our accredited programmes recognised by top accreditation bodies Discover a wide range of scholarships for future and current UNM students. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}