{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/our-campus-and-facilities/places-to-eat-on-campus.html",
    "content": [
        {
            "p": "Hungry? Don’t worry, there are plenty of dining options at the University of Nottingham. We’ll talk about the best places to refuel: on campus and in the city. The University of Nottingham gives you plenty of options to eat, with many of them on a budget. Since no one likes a long wait when it comes to food, let’s dive right in. These are the most popular places to grab a meal on campus according to students. The most popular place to eat on campus. And the most crowded at times. Possibly there’s a reason for this. Either way, the students love it. What’s the best to eat there? Burgers, sides, smoothies, milkshakes. Your vegan-friendly place to eat on campus, serving nachos, salads, burgers, curries, and wraps. No need for an introduction here: The trademark place to get your dose of caffeine, as well as wraps, toasties, paninis and other goodies. At Love Joes you can get a great meal deal with a wrap side and drink. As you might have already figured out, it’s all about chicken here. This is the place to go for an easy fast-food fix, with the usual most-wanted on the menu: burgers, fries and pizza. All Nottingham catered halls offer varied and healthy menus. You can eat up to 19 meals a week in an allocated hall of residence, with a flexible meal plan* that lets you eat at any of our cafes on University Park and Jubilee Campus. The bars located in the campus halls also serve some bites to eat. Paninis, sub rolls, nachos and salads are usually on the menu, but the food options don’t stop here. With spaghetti, carbonara, penne, and meatballs, Vesper has everything a pasta fan could ever want. Even more, you can also find some tasty mac n cheese or lasagna on the menu. Catering for vegetarians as well, they serve bean burgers, but also chicken and beef options. They served a range of chicken curries, including korma, kotsu, tikka, and other chicken boxed meals. The perfect place to grab lunch on the go between lectures or study sessions. Both George Green Library and Hallward Library host coffee shops. The usual cafe food menu can be found there: sandwiches, paninis, salads, wraps, and pastries. Located in Cavendish Hall, the cafe is ideally located if you’re from a hall in the Sports Zone. Again, the usual menu applies here as well. A place that has jacket potatoes on the daily menu, and also special menus that change every day, such as Mexican, Indian, and Thai. Still hungry? Here are the top student-rated places to eat in Nottingham. No, it’s not a Tarantino flick, but a cosy, rather hidden Italian restaurant. You have to make a reservation to book a table, as they’re only 20 seats in the entire restaurant. At Annie’s, you can try some real American burgers right in the middle of Nottingham, with veggie options and even a student discount. The place is a cross between Polish and American, with a bit of Nottingham soul. A great place to have breakfast as you can pick and mix what you like. There are a lot more nice food places for you to check out in Nottingham: Bunk, Mod Pizza, Zaap Thai, Ugly Bread Bakery, Red’s True Barbecue, and more. We’ll let you discover them at your own pace. We’ve covered the most popular places, but once at Nottingham you’ll see that there are other nice places waiting to be discovered, and become the next popular eating spot. There are plenty of food options for both non-vegans and vegans, while further into the city you can find diverse source of nutrients. Campus and facilities Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities. The University of Nottingham, University Park, Nottingham, NG7 2RD Jubilee campus The University of Nottingham, Wollaton Rd, Lenton, Nottingham NG8 1BB Sutton Bonington campus The University of Nottingham, Sutton Bonington, Leicestershire, LE12 5RD, UK If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}