{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/scholarships-and-bursaries-ug/bursaries/core-bursary.html",
    "content": [
        {
            "p": "For students with a household income between £0-£35,000 as assessed by student finance The Core Bursary offers financial support to students from lower-income backgrounds during their time at university. You don't have to apply for the Core Bursary as eligibility is automatically determined based on your Student Finance assessment. The bursary is paid directly to your bank account in three instalments across the academic year. Unlike a student loan, the bursary is non-repayable and can be spent on anything you like to help you while you study. The amount you receive and the eligibility criteria for the bursary can differ based on your start date. For current students looking for specific details of their bursaries, please see the information below. If you have any questions about this bursary or your eligibility, please contact us. If you are a current student at the University of Nottingham, please find the specific details of your bursary based on your start year below. To be eligible for the Core Bursary in the 2024/25 academic year, you must: Part-time students - The university offers financial support through the Core Bursary on a pro-rata basis for new part-time undergraduate students in 2024. You will need to have a means-tested assessment carried out by Student Finance (SF) in order for us to assess your eligibility for the bursary. Your award will depend on your household income taken from the SF assessment and the number of credits you are taking. Further information can be found on our web page 'Funding for part-time undergraduates' You don't have to apply for the Core Bursary. We conduct automatic assessments using Student Finance and applicant data to determine which students are eligible. If you are eligible, confirmation of the bursary will be shown in the awards section of the Nottingham Hub by the end of October and you will receive the bursary payment directly to the bank account registered on the Nottingham Hub. The bursary is paid in three instalments over the academic year, typically in November, January and May (although this may vary year on year). If you believe you are eligible, but the award is not showing in the Nottingham Hub by the end of October, please contact us. Assessments will close for the current academic year on Friday 20 June 2025. You must have applied for your means tested assessment with Student Finance by 5 May 2025 in order to ensure that Student Finance can complete your assessment by the 20 June 2025 deadline. We are unable to accept late assessments. We conduct several automatic assessments throughout the academic year, including a final assessment at the closing date. If your household income has decreased to meet the bursary criteria during a reassessment, you will be entitled to receive the Core Bursary from that point onwards, or to receive a larger award if applicable. If your household income has increased above the threshold during a reassessment, you will not receive any more bursary payments. However, we will not ask you to repay any previous payments to this point unless your income was assessed incorrectly. Bursary value: Up to £3000 depending on household income Eligibility criteria Scholarships and bursaries For UK students who have been in care or are estranged from their family For UK students with personal circumstances or backgrounds that may have impacted academic potential To encourage potential in students from lower-income backgrounds or who have faced significant difficulties For students showing strong academic ability who have overcome significant obstacles to their academic progression If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}