{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/English-BA-Hons-U6UENLSH.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK Think you know ‘English’? Think again. At Nottingham, we go beyond a love of books. Our huge choice of optional modules in everything from Vikings to drama means you can discover new passions, explore what you already love, and tailor your degree to what interests you the most. You’ll build from a starting point in applied linguistics, drama, and literature (from medieval to present day), exploring what it is to be human through the historical, cultural and social contexts of a text. Mandatory Year 1 Beginnings of English Drama, Theatre, Performance Studying Literature Studying Language Academic Community Optional Writing and Place Shakespeare's Histories: Critical Approaches Creative Writing Practice The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Monday 16 December 2024. Due to timetabling availability, there may be restrictions on some module combinations. You’ll have at least the following hours of timetabled contact a week through lectures, seminars and workshops, tutorials and supervisions. Your tutors will also be available outside these times to discuss issues and develop your understanding. We reduce your contact hours as you work your way through the course. As you progress, we expect you to assume greater responsibility for your studies and work more independently. Your tutors will all be qualified academics. The largest first year lectures are typically attended by up to 300 students, whereas the corresponding seminars are of 16 students. In years two and three, lectures may include up to 170 students, and seminar groups may range from 12 to 24. As well as scheduled teaching, you’ll carry out extensive self-study such as: reading books and journal articlesdoing preparation work for seminarsresearching your assignments in the librarycollaborating with fellow studentsAs a guide, 20 credits (a typical module) is approximately 200 hours of work (combined teaching and self-study). This course is also available part-time. Ordinarily you will study 50% of the modules each year, taking 6 years to complete your course. It may be possible to complete within 4-5 years by taking more modules each year. Teaching ordinarily takes place on University Park campus Monday-Friday, 9am-6pm. Timetables are normally available shortly before the start of each term, when you can commence module selection. Up until that point, we will only be able to give you an indication using a 'typical' timetable. You will receive the same teaching and learning support as a full-time student, and the same timeframes to complete each module's work. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). From the essays where you learn to write analytically, to the creative side which helps you write for so many different audiences – letters, fiction, poetry – you get such a range. Doing an English degree really sets you up well. It gives you a lot of options. Charlotte Emma Jones English BA 90% in work or doing further study 15 months after the course. Data for English (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Arts Entry requirements AAB UCAS code Q392 Duration 3 years full-time Start date Sep 2025 UCAS code Q3W8 UCAS code QQ38 Entry requirements AAA UCAS code QV31 First-year student Aurora shares a typical day... School of English Nina is an English Language and Literature BA student. She shares her top 3 tips for getting the most from your degree. Bring history to life. From caves, to prisons, to England's oldest Inn, Nottingham has plenty of medieval places to explore. A student placement like no other, ten years in the making. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}