{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/our-campus-and-facilities/jubilee-campus.html",
    "content": [
        {
            "p": "The University of Nottingham, Wollaton Rd, Lenton, Nottingham NG8 1BB Jubilee Campus is a community. It’s vibrant. It’s a breath of fresh air. And there’s always something going on whether you’re meeting your friends in the gym for a game of basketball, or you’re going to Costa study. Our state-of-the-art facilities now include: A tour of Jubilee Campus to find out why our students love living and studying on our cutting-edge contemporary campus. Green Flag grounds, walks and garden guides. The local community are welcome to enjoy the walks, parks and gardens in the University’s landscaped settings which feature: The campus has been a Civic Trust Green Flag Award Winner every year since 2003 – the only university campus to achieve this status Please visit Estates website for more information about the grounds. Built on a site that previously had industrial use, Jubilee Campus is an exemplar of brownfield regeneration and has impeccable green credentials. An important feature of the campus is the series of lakes which, as well as being home to a variety of wildlife, provide storm water attenuation and cooling for the buildings. Less visible - but equally important to the sustainable and environmental credentials of the campus – are the: Jubilee campus during lockdown June 23rd 2020.Copyright belongs to University of Nottingham.Photography by Lisa Gilligan-Lee. The environmentally-friendly nature of the campus and its buildings have been a big factor in the awards that it has received, including: The Jubilee Campus also won international praise with the Energy Globe Award. The University of Nottingham, University Park, Nottingham, NG7 2RD Campus and facilities Beyond a welcoming community, the facilities you’ll find at the University of Nottingham will provide you with the complete package for a great student experience. UON Hungry? Don’t worry, there are plenty of dining options at the University of Nottingham. We’ll talk about the best places to refuel: on campus and in the city. Sutton Bonington campus The University of Nottingham, Sutton Bonington, Leicestershire, LE12 5RD, UK If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}