{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/science/explore-our-maths-facilities.html",
    "content": [
        {
            "p": "Everything you need is in one place, making it easy to find. The beauty of studying maths at Nottingham is that our dedicated building means most of the lecturers and your personal tutor are all based in one place – this makes finding your way around so much easier. The hub of the modern building is the Atrium which is often used for meeting friends or using the study spaces for a bit of extra work between lectures. Staff offices are based upstairs which is great for arranging appointments if you need to clarify something you’re not sure about or meeting with your tutor group. I feel I got to know my tutor really well so he knew when I was struggling and things like that. Gabby Teriaca BSc Mathematics What’s more the George Green science library (complete with a café and a Starbucks!) is just a short stroll away. Let mathematics student Gabby show you around… Maths student Gabby takes us on a tour of the maths building and the facilities students use whilst studying here. Student experience Transform your future by studying at a world-leading university. Semenyhi campus, Malaysia If you're looking for a British style degree and the opportunity to study in Asia, consider a course at one of our international campuses in China and Malaysia. Campus and facilities Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities. Accommodation We bring our students together in a friendly, safe and vibrant community that creates a sociable and enriching living experience - and we can't wait for you to join us. Each of our halls and accommodation sites has their own identity, character and community – they are the perfect base for exploring your new life in Nottingham. Ready to take the next step? Head over to UCAS to accept your offer and start planning for the future."
        }
    ],
    "pdf_files": []
}