{
    "url": "https://www.nottingham.ac.uk/studentservices/support/financialsupport/studentfunding/medicine-inc-gem.aspx",
    "content": [
        {
            "p": "For students with 'home' fee status who usually live in England Tuition fees are paid by the NHS. The NHS also provide a non means tested grant of £1,000 and a means tested bursary of up to £4,491 towards living costs (Please check current year rates as these may change year to year). The means tested bursary is lower if you live with your parents during term time. Eligible students can also apply for a reduced rate, non means tested, loan of £2,081 (2024/25 rate) from Student Finance. This is lower if you live with your parents during term time. The NHS pay additional allowances depending on our personal circumstances; and also provide the Disasbled Student's Allowance for this final year. These are similar to the ones offered by Student Finance in Years 1 - 4. NHS Bursary information Eligible students can also apply for a reduced rate, non means tested, loan of £2,670 (2024/25 rate) from Student Finance. This is lower if you live with your parents during term time. The loan is also lower for the final year of the course. These are similar to the ones offered by Student Finance in Years 0 - 3 In Year 1 you will be charged a tuition fee which in 2024/25 will be £9,250. You are responsible for paying the first £3,465 of the tuition fee to the University yourself. Eligible students can then apply for a tuition fee loan of up to £5,785 from Student Finance for the remainder of the fee. This loan is not means tested. You may be eligible to take out a loan towards living costs of up to £10,227. £4,767 of the loan is non means tested; the remainder is means tested on household income (2024/25 rates.) The loan is lower if you live with your parents during term time. Apply on-line for both the tuition fee loan and maintenance loan at gov for student finance. Depending on your circumstances you may be eligible for supplementary grants: Tuition fees are partially paid by the NHS. You can apply to Student Finance for a tuition fee loan to pay the balance of the tuition fee. The NHS provide a non means tested grant of £1,000 and a means tested bursary of up to £4,491 towards living costs (Please check current year rates as these may change year to year). The means tested bursary is lower if you live with your parents during term time. Eligible students can also apply for a reduced rate, non means tested, loan of £2,670 (2024/25 non final year rate) from Student Finance. This is lower if you live with your parents during term time. The loan is also lower for the final year of the course. and also provide the Disabled Student's Allowance for this final year. These are similar to the ones offered by Student Finance in Year 1. You may be eligible for University Scholarships and Bursaries. Please note the assessment process for the Core Bursary is different during the years your fees are paid by the NHS. Bursaries and Scholarships Bursary assessment for NHS Funded years"
        }
    ],
    "pdf_files": []
}