{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/quality-and-rankings/study-at-a-world-leading-university-.html?title=UmVjZW50bHkgdmlld2Vk&variant=cmVjZW50",
    "content": [
        {
            "p": "As a member of the UK's prestigious Russell Group and the Universitas 21 global network of research-intensive universities, we deliver the highest standard of education, recognised worldwide. When you become part of our global student community, our inspiring academics will help develop your skills, knowledge and confidence to achieve your career goals. Students from over 150 countries call the University of Nottingham home, and these are just some of the reasons why; A degree from the University of Nottingham opens the door to endless opportunities and our graduates go on to achieve incredible things. As one of the top 100 universities for graduate employability worldwide, we’ll help you get where you want to go. Did you know? *Graduate Market Report 2024, High Fliers Research Limited Our research makes an impact around the world by tackling some of the major challenges facing society, the economy and the environment. This is the place where the MRI scanner was invented; where you’ll find the world’s largest group of human rights scholars; and where the answers to global food security are being unearthed. *Complete University Guide 2025 Through our connections to industry, the jobs we create and the students we welcome from around the world. We’ve built strong relationships by collaborating with huge household names such as PWC, KPMG, Jaguar Land Rover and Unilever, giving our students the unique potential to gain work experience or even graduate jobs with these powerhouses of industry. At Jaguar Land Rover during my placement year, I was part of a team delivering an engine assembly line for a new engine. This experience changed my career prospects immeasurably and best of all, I got a job out of it! Joe Hicks Manufacturing Engineering Help and support A helpful guide to take you through the steps to create a 'Find Your Nottingham hub' account. The My UoN account will help you save courses and resources to a personal portal that you may find useful throughout the application process. Applying Everything you need to know, from understanding your offer to accepting your place. You've firmly accepted your offer, that's great news. We'll guide you through what's next. Finding the right words to include in your personal statement can be tricky, but we're here to guide you through it. Our open days are a great way to discover what makes us one of the world's top universities. Join us on campus or access our open days on demand."
        }
    ],
    "pdf_files": []
}