{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/science/a-week-in-the-life-maths-student.html",
    "content": [
        {
            "p": "From quantum physics and coding to gymnastics society and pub golf. We know there’s a lot to consider right now and choosing where you’re going to spend the next few years of your life is a big decision. You probably know already that when you come to university you’ll be learning in a different way and be given more responsibility when it comes to managing your work. But this also gives you more flexibility and more freedom. You’ll have the opportunity to follow your interests and explore maths in ways not possible at school. You’ll grow not just academically, but as a person too. Expert teaching in a wide variety of modules, coupled with internship opportunities, work experience and mentoring other students will look great on your CV. So whether you already have a career in mind or not, we will give you the skills and knowledge ready for the workplace. See how Daisy has really made the most of her university experience and why she loves maths at Nottingham. It is different for everyone, that’s the great thing about university, but for me this is how it goes. Just a heads-up I have very few ‘contact hours’ (guided study, lectures, tutorials…) but this is not the case for everyone. In the earlier years of your degree your week will be much more structured; I am a fourth-year student who has chosen lots of coursework/project-based modules, so a lot of my work is independent. I often start my Monday by looking at the week ahead. University comes with a lot of excitement, fun and opportunities, so I find taking the time to be organised very important – it allows me to get the best out of all these opportunities without feeling overwhelmed. This week, after I had finished planning, my housemates and I went to George Green library. There are multiple different libraries and workspaces all over the university campuses so there is always somewhere that suits you, whether that be a nice quiet corner or a café with your friends. I spent most of my day working on my dissertation and so at lunchtime we went to the lake on University Park campus and had lunch there. The green and open space on campus is one of the reasons I love being a student at Nottingham; I can recharge during the workday. My dissertation is titled “Synchrony in Human Cortical Rhythms” and is an investigation into the brain and neurological disorders such as epilepsy. The maths department at Nottingham offers a huge range of modules, I have studied topics ranging from quantum physics to epidemic modelling and even taught maths in a local school! The final hour of my day was a lecture for a C++ coding module. The lecturers deliver the material in a different style each week, depending on what is best. This lecture consisted of mainly note-taking, with some coding demonstrations and problems to solve as well. After university I went to gymnastics. I only joined the gymnastics society this year as a complete beginner and have been made to feel very welcome. There is no sense of hierarchy and people are very willing to help each other out. I have been in various societies over the last four years, including MathSoc, the boxing society and VegSoc (the vegetarian and vegan society) and have had the same welcoming experience across the board. In my first year I went to Prague with MathSoc and met some of my best friends that I keep in touch with to this day, even those who have graduated and moved away. I went to a lecture 3-4, this was a traditional lecture in the sense that we spent the whole time covering new material. 4-5 there was an ‘office hour’ for the same module. Office hours are hours set aside by staff where students are encouraged to ask questions about their module. I went to the office hour to clarify the details of a calculation that the lecturer had gone through the hour before. On Tuesday I made use of the facilities available in the maths building. I met a course mate to go through problems from a module we were both finding challenging. The building has small group study rooms, a larger undergraduate study room, a large computer room and some social spaces. We worked in a small group study room, which was perfect as we could discuss our thought processes. On one occasion, neither of us could figure out a problem; we knocked on our lecturer’s office door (staff offices are also in this building) and she was more than happy to help. After this I used the new kitchen facilities (I’m very excited about having a microwave at uni!) in the library to heat up my tea and then headed to the pub in the student union to watch some of the England football with my friends. The student union has places to eat, socialise, work and drink and is always full of friendly faces. On Wednesday I had an exciting call with the company which has recently offered me a graduate job. Both the maths department and the university career’s team were extremely supportive in the job application process. Something I have found to be special to Nottingham is the range of part time roles available. I came to university anticipating that I would work in a pub or a café part time, instead I have been paid to represent the university at open days, redesign the maths curriculum and more. I am certain that these opportunities enabled me to get the graduate job I wanted. After this meeting I stayed at home and did some reading for my dissertation, as well as some problems for a particular module. Whilst lectures are back in person post Covid and all the facilities are open, there is a large element of flexibility as to where and how you spend your time. I spend most days on campus because the facilities enable me to be more productive, and because campus feels like one big village – I am always bumping into people. However, the option to stay at home if you feel you need to, contributes to the fact I rarely feel overwhelmed. In the evening I celebrated my housemate’s 21st birthday at the sports night, which happens every Wednesday. Like on campus, I always feel safe going out into the city and know that another student, probably a friend, is round the corner wherever I go. Thursday was spent working independently on code for my dissertation. I want to reemphasise that the majority of my week is spent on independent study but that that is not the case until the later years of the course, and due to the choice you have over your own modules, that is never the case for some students. I tutored an A-Level maths student. There are lots of opportunities to earn money alongside your studies whilst also contributing to your academic and professional development. I particularly enjoy tutoring after working in a school one afternoon a week last year; I feel much more qualified. Aside from this, working in the school was a refreshing change of pace and I enjoyed having a more ‘hands on’ element to my degree. I spent the evening watching TV in my room – university life is filled with a lot of fun but there is a chance to relax and recharge alone. The best thing about university is that you decide! Friday morning was spent in a lecture and then a problem class. Problem classes are chances to work on questions while you can ask for help from peers, PhD students or your lecturer. I finished the problem sheet independently after the problem class. I had a lecture for a different module in the afternoon. After this, I went through the lecture notes with a friend to consolidate the material we had found challenging. This is a much more typical day for a student in years 1-3. On Friday evening I attended a pub golf social with the University of Loughborough gymnastics team. The social aspect of being a member of any society is incredibly rewarding and adds a whole extra dimension to student life. Socials range anywhere from watching a film to going to the Christmas markets to a night out – there’s no pressure to do anything you don’t want to. Finally, the weekend is here! Every weekend is different, but this weekend I am going into the city centre to do some shopping, going out for dinner and going for a swim at the Sports Centre on campus. I try to work enough during the week that I can take every weekend off but even the structure of your week is flexible – the libraries are still open at weekends! Being a maths student can naturally be challenging at times, but that’s what makes it rewarding. Hopefully this blog has shown you that university is so much more than sitting in lectures. The University of Nottingham is a genuine community where there is support provided from staff and students alike and I have enjoyed (almost!) every day of my time here. Daisy Newson Maths student Faculty of Arts Chloe is a third-year Music and Music Technology student. She discusses what she loves most about our facilities, learning new skills, and the sense of community in the department... Product Design and Manufacture Follow Maian, a product design and manufacture student, as she takes you through her typical day to give you a taste of what to expect studying with us. UON Whether you want to keep fit, make new friends, or try something new, there are over 70 clubs you can join, from popular to ‘don’t know what it is but it looks cool’ sports. Jubilee campus Innovative buildings and green spaces designed to inspire tranquillity and creativity. Ready to take the next step? Head over to UCAS and accept your offer and start planning for the future."
        }
    ],
    "pdf_files": []
}