{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/international-student-life/students-with-families.aspx",
    "content": [
        {
            "p": "If you plan to bring your husband, wife, partner or children to live with you while studying, there are some arrangements you will need to make for their life in the UK. Some Student route visa holders are able to apply for Dependant visas for their spouse, partner, and children. The criteria to be eligible to bring Dependants has recently changed, and we recommend that your view the Dependant criteria as explained by the UK Council for International Student Affairs (UKCISA), and also contact the Visa and Immigration team for confirmation of eligibility and the application requirements. We know that finding somewhere suitable to live is a top priority for students coming to Nottingham with their families. The University of Nottingham, like most universities, only has a limited number of accommodation places suitable for couples and families. We recommend applying for accommodation as early as possible if you wish to stay in one of these. Find out more about our university houses. Many students with families choose to live in private housing. We recommend that you prioritise Nottingham Standard properties where possible. Please take care to prepare yourself for the 'right to rent' checks that landlords are required to carry out on the immigration status of you and your family members. Find out more on the UKCISA website. If you are not able to arrange accommodation for your family before you travel to the UK we would strongly advise you to come on your own to begin with. You can then stay somewhere short term while you search for suitable accommodation. The University does not have any temporary accommodation suitable for families and staying in hotels can prove very expensive. Before signing a contract for private rented accommodation we strongly advise that you have the rental contract checked by Students' Union Advice, which is located in the Portland Building, as they will advise you about the terms and conditions of the contract and alert you to any potential difficulties. They also produce booklets and information on house hunting in the private sector. The university has a day nursery and play centre on University Park Campus, catering for children of univty students and staff aged four months to five years. Find out more about our childcare services. Busy Bees, a private company, also provides day care at the University of Nottingham close to the other university childcare provision. The University has a small fund called the Childcare Support Scheme to offer eligible students some financial assistance towards meeting the costs of essential registered child care while they are studying. Some Nottingham City primary schools have a nursery attached to them for children aged three to four and some nursery classes form their own nursery school. The demand for these is very high but your child's name could be put on the waiting list if there is one near your home. There are also many private nurseries, including those located in the City and Queens Medical Centre Hospitals. You can search for nursery schools near you on the UK government website. Children usually begin school in the September after their fourth birthday. After they have turned five years old, schooling is compulsory. Schooling in England is split into the following stages: From age 16 to 18, various options are available: children can continue to study in a school sixth form or college (taking A levels, a foundation course or an equivalent qualification), or they can enter an apprecenticeship or traineeship for certain types of careers. They may work part-time but must be in some form of education or training until they are 18 years old. Find out more about thison the UK government website. State education is free in the UK. All materials, such as pencils, paper, textbooks and exercise books are provided by the school at no charge. Most schools have a uniform and you will be expected to provide this, as well as suitable clothing for physical education (PE) lessons. You will also need to pay for your children's lunches in most cases. The school year runs from September to July, divided into three terms, usually with a two-week vacation period between them (ariound Christmas/New Year and Easter), one-week half-term holidays in the middle of each term, and a five or six-week vacation period in the summer. The school day is typically between 9am and 3.30pm, Monday to Friday, with an hour break for lunch. Class sizes in UK state schools vary but are typically around 30 students. If your child needs help with English, or has any special education requirements, the school will arrange specialist support. To apply for a school place for your child, you will need to know when you will be arriving in Nottingham and the address you will be living at. You should not apply for a place more than six weeks before you and your child will arrive. See the UK government website for general information on school admissions. There are two local councils that handle state school admissions in the areas close to our campuses: Nottingham City Council covers areas such as Dunkirk, Lenton, Wollaton and the city centre. Nottinghamshire County Council covers areas such as Beeston, Bramcote, Chilwell and Sutton Bonington. In addition to the schools run by the councils there are some private schools which charge fees and there are 'voluntary aided' schools in Nottingham. The Church of England or the Roman Catholic Church usually run the voluntary aided schools with only limited involvement by the council. The schools manage their own place allocation so you can contact them directly to find out more. Our Centre for English Language Education (CELE) offers a range of English language courses and support, and is accredited by the British Council for the teaching of English in the UK. CELE offers presessional English courses for applicants who need to meet the required level of academic English to start their degree and continues to support students through their degree course with academic language and communication skills courses and consultations."
        }
    ],
    "pdf_files": []
}