{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Education/Education-Teaching-English-to-Speakers-of-Other-Languages-MA.aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/145/7/0078(3/28)A9688 This course is suitable if you are currently or looking to teach English to speakers of other languages, keen to build on your existing knowledge and experience, seeking to improve your career prospects or interested in researching your own teaching practices/context. It will prepare you to conduct independent research into teaching and learning and provides a pathway to doctoral study. You will meet expert tutors in the field of English language teaching, a major branch of applied linguistics, who have many years' experience teaching at this level and who are committed to providing the best quality study experience. Our teaching is informed by leading research and we offer optional modules which reflect the latest in applied linguistics and language teacher education. You will learn in a modern, high-tech learning environment with a lively, multi-cultural social experience. We offer a range of support including interactive, collaborative teaching methods, individual tutorials, opportunities to pursue your professional and research interests, access to extensive study materials and free support for developing proficiency in academic English. As a school, we are committed to improving and investigating transformative and effective practices in Education. You will study in a supportive, dynamic and inclusive environment with an international team from across the globe. Many of our colleagues are research active with ongoing national and international research grants. The taught element of this course is made up of four 30-credit modules, plus a 60-credit dissertation. To be awarded a MA TESOL, you need to complete and pass four modules (two core and two elective) plus a dissertation. Language Teaching: Methodology and Curriculum The module focuses on topics which have been the subject of recent discussion and research in the field of foreign and second language teaching. These include: You will be expected to read, understand and engage critically with the research presented on these topics. Understanding Language Learning and the Language Learner The module focuses on key areas in Applied Linguistics relating to Second Language Acquisition (SLA), and explores them from the perspective of both language learners and teachers. These include: Dissertation This substantive piece of scholarship within the field of the course will normally be based on interests and skills you have developed in the course of the modules already studied. You will choose a topic in consultation with your course leader and an appropriate supervisor. MA students are to complete TWO elective modules. Practice-based Inquiry The content will involve you in active critical consideration of participating in and leadership of practitioner inquiry in relation to professional context mapping and workplace learning. These processes will be achieved through: Assessment in Language Education This module will look at: Programme coordinator: Dr Tiong Ngee Derk All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A relevant second class honours degree (or international equivalent). Relevant experience may be required for some of the modules. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Malaysians applying as a matured student without the standard entry requirements but with substantial and relevant work experience (and have successfully passed APEL’s assessment through Malaysian Qualifications Agency) at an appropriate level may be considered. Admission is at the discretion of the School. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Each 30-credit module is assessed by a 6,000-word written assignment. To complete the masters, you must achieve a pass of 50 on each assignment. The 15,000-word dissertation is an original piece of work and should be related to one of the selected modules on an approved topic. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Our graduates embark on successful careers within both education and academia. Many also branch out using their acquired leadership skills to work with international organisations and NGOs. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}