{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/scholarships/sporting-excellence.aspx",
    "content": [
        {
            "p": "Unlock your academic and sporting potential with a £5,000 tuition fee scholarship. We're offering scholarships of £5,000 towards full-time tuition fees for international students at any study level with outstanding sporting ability. These International Sporting Excellence Awards are separate from our package of sports scholarships at foundation, bronze, silver and gold level. To apply for this scholarship, you must: This scholarship is now open for applications for 2023/24 entry. You do not need to receive an offer of study before applying for this scholarship, but we recommend applying for an academic course as soon as possible. Search for courses and find out how to apply. You may be shortlisted for a scholarship after your initial application but you must receive and firmly accept an offer before a scholarship can be awarded to you. You may be offered either an International Sporting Excellence Award or another sports scholarships package. Apply online through the sports scholarship page. Priority is given to sports within the BUCS programme, Olympic, Paralympic and Commonwealth sports, with other sports considered on a case-by-case basis. This award cannot be combined with another University of Nottingham regional or sports scholarship. However, you may also be able to receive a subject scholarship from your academic school or an external scholarships, where the combined total does not exceed 100% of tuition fees. This could include, for example, an award from Nottingham University Business School and/or the government or other funding body in your country. If you are awarded this scholarship, it will be deducted from the tuition fees charged to you as a student at the University of Nottingham. We will not pay tuition fee scholarships to you directly. See full terms and conditions and find out more about performance sport at Nottingham."
        }
    ],
    "pdf_files": []
}