{
    "url": "https://www.nottingham.ac.uk/studentservices/support/financialsupport/managingyourmoney/living-costs-in-nottingham.aspx",
    "content": [
        {
            "p": "Money management is an important part of student life. Whether you are living away from home for the first time, are an international student moving to the UK to study, or a mature student who has lived independently before, you will need to carefully consider your income versus expenditure to make sure you have all the essentials covered during your time at university. Full-time home undergraduate students can apply for a maintenance loan, which can be up to £10,227 depending on your personal circumstances. This is separate to, but runs alongside, the Tuition Fee Loan. The maintenance loan is usually paid in three termly instalments. To help you plan for the academic year, please see: Month by month finance tips for students How much you spend depends on your personal situation, lifestyle, and choices. The list below details possible expenses related to studying in Nottingham. These are indicative costs, and we recommend you research in line with your own individual needs. Costs may be annual, monthly, weekly, or daily depending on the item and your purchasing habits. Please note that the costs detailed on this page are all accurate as of October 2024 but are subject to change at any time. Make sure you check specific costs of services before making any decisions. The university has a range of support available to help students through the cost of living challenge. This includes free kitchen access, free access to showers and free period products. There are other variable costs you may need to factor into your budget, such as food and groceries, mobile phone bills, travel outside of Nottingham, course costs (including books, stationary and printing), toiletries, clothing and shoes, haircuts and personal care, streaming services, other subscriptions, celebration events, entertainment/socialising, car/vehicle costs, broadband packages and contents insurance. You may also have larger one-off costs at the beginning of the year such as a laptop or bike. This webpage could give you an idea of the items you may need to bring on starting at the University of Nottingham, and help you decide what you may need to purchase in advance of arrival. Don’t forget to shop around for the best offers and take advantage of any available student discounts! You can get discounts signing to platforms such as Totum, Unidays and student beans. You can use comparison websites and tools to check the best offers from everything from holiday insurance through to utility bills. Before spending your cash, you could always explore options that are cheaper or even free! Our libraries service has plenty to offer students free of charge, and you could explore local gifting and freecycle groups online. Consider second hand items on online marketplaces and local charity shops for everything from clothes, to books, to household items. You could also sell your old unwanted items to create yourself some extra funds. We recommend finding a budget planner to help you plan your finances. Your budget is affected by your choices. The more you understand your financial situation, the better informed your choices will be. UCAS budget planner Money saving expert budget planner"
        }
    ],
    "pdf_files": []
}