{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/international-students/international-students-home.aspx",
    "content": [
        {
            "p": "Welcome information for international students As an international student, we understand you have even more to think about as you prepare to join us at Nottingham. This section is designed specifically for you, providing all the information you need as a student joining us from overseas. From completing essential tasks and preparing to travel, to managing your health and finances, this section ensures you are well-prepared for life in the UK. Click on the guides below to navigate through a list of essential tasks you need to complete before and when you arrive. You can also use our Welcome toolkit for international students to find out more about the support services available, as well as practical information to help you settle into living and studying in the UK. Prepare to travel | Get ready for life in the UK Tasks you need to complete before you begin studying with us Everything you need to know when you arrive on campus Plan your travel arrangements carefully for a smooth journey, including your visa, packing and transport connections. Accommodation Pay attention to any pre-arrival instructions from your accommodation provider and explore our helpful guides for living in halls. Your visa application Follow our 10-step guide to prepare and submit your student visa application. Packing for your flight Discover essential tips for effectively packing your suitcase and hand luggage. Entering the UK Understand the entry procedures, required documentation and import restrictions for a stress-free arrival experience. Travelling to Nottingham Wherever you’re coming from, there are plenty of ways to reach Nottingham. Visit our guide for making your way to campus. Late arrival Review important arrival and registration deadlines to ensure you can start your studies on time. There are some important things to complete when you arrive, such as opening a bank account and registering with a doctor’s surgery. Follow our guides below to prepare yourself for living and studying in the UK. Banking and money Guidance on opening a UK bank account, choosing the best one for you and how to keep your money safe and secure. Your visa documentation Check on what type of visa documentation you may be issued and where to collect your biometric residence permit (BRP), if applicable. Settling into UK life We understand there may be differences like the food and the weather, but we are here to guide you through life as a new student in Nottingham. Health services It is important to register with a UK health service when you arrive here. Find out your entitlements and what you will need to pay based on the length of your study. Library services and support Browse our library resources, from webinars and drop-in sessions on adjusting to university life to online spaces to practice conversation skills. Visa responsibilities Review your student visa responsibilities while you are in the UK and ensure you comply with them. Check out our Instagram pages @uniofnottingham and @uonstudentnews to connect with other students, get tips on starting university, and to stay up to date with what's happening on and around campus. Once you're here, join in on the fun by sharing your snaps and tagging @uniofnottingham #WeAreUoN."
        }
    ],
    "pdf_files": []
}