{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Electrical-and-Electronic-Engineering/Department-of-Electrical-and-Electronic-Engineering.aspx",
    "content": [
        {
            "p": "From microwave ovens to iPads, from broadband internet to satellite communication, we are surrounded and empowered by products based on electrical and electronic engineering. Nottingham is one of the leading universities offering a degree-level education in electrical and electronic engineering. The Department of Electrical and Electronic Engineering was one of the first departments to be established at the University and our academic staff have an extensive research portfolio. The department is built on a strong foundation with a wealth of experience from the department in the UK, which was established in 1933. We have close links with industry, especially with our campuses in the UK and China. Our department is equipped with top-notch laboratories, advanced equipment and computational facilities. Students have access to specialised labs to study and research electronics, power systems, telecommunications, robotics and control systems. The hands-on experience emphasised in our postgraduate programmes enables students to apply theoretical knowledge to their project work. Our electrical and electronic engineering postgraduate degree holders are known to be well-rounded professionals equipped with technical expertise, problem-solving skills, and critical thinking skills, which are essential for success in the real world. Many alumnus find rewarding careers in industries such as energy, automation, robotics, aerospace, healthcare technology, telecommunications and academia. The Department of Electrical and Electronic Engineering at Nottingham University Malaysia is committed to nurturing the next generation of leaders in this field. Our academic excellence, research innovation, and industry collaboration legacy speak for themselves. Together, we shape the future of this industry globally. Our Master’s programme provides students with advanced knowledge and specialised skills in electrical and electronic engineering disciplines. Meanwhile, our doctoral programmes offer students a rigorous research-oriented experience, allowing students to delve into specific areas of interest within this field. Explore our electrical and electronic engineering postgraduate programmes today. Admission requirements for electrical and electronic engineering postgraduate programmes at UNM include a relevant undergraduate degree. For specific details, visit our Engineering MPhil/PhD programmes page. You can still apply for our postgraduate courses if you do not have an undergraduate background in engineering. However, you may have to take preparatory courses to fill in the knowledge gap for a strong foundation. Each potential student will be considered on a case-by-case basis. Some specialisations postgraduate students in this field can look into include power systems, control systems, telecommunications, signal processing, embedded systems, robotics, nanoelectronics and even renewable energy. Yes, UNM offers scholarships, grants, fellowships, and assistantships to support our postgraduate students. These financial aids may be used to cover tuition fees, research expenses, or living expenses. The following are details on E&E postgraduate programme durations: Electrical and Electronic Engineering MSc: Full-time - 1 year Engineering MPhil: Full-time - 1 to 2 years, Part-time - 2 to 4 years Engineering PhD: Full-time - 3 to 4 years, Part-time - 6 to 8 years Postgraduate degree holders in this field can find opportunities in various sectors, including telecommunications, power and energy, aerospace, automotive, electronics, research institutions, academia, and more. Some career roles include engineers, consultants, researchers, academics, and project managers, among others. Department of Electrical and Electronic Engineering The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih, Selangor Darul Ehsan, Malaysia Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}