{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/international-students/uk-health-services.aspx",
    "content": [
        {
            "p": "Welcome information for international students Everyone can feel unwell sometimes, and the health service is here to help when you need it. It is very important that you register with a UK health service when you arrive in the UK. You must be registered to access NHS healthcare, which is not something you should leave until you are feeling unwell. We recommend organising this as soon as you have your UK address confirmed. The length of your study in the UK will impact how you can access these services, and what you will need to pay. What is the National Health Service (NHS) and how can I register? The University of Nottingham Health Service is located on University Park Campus. If you are based at Sutton Bonnington, you can register with a health service closer to you. Find out more about the NHS Students studying for more than six months As part of your student visa application, you will need to pay the NHS surcharge or Immigration Health surcharge. This is £776 per year. If you have any dependant family members applying with you, they will also need to pay the same amount. Medical insurance will help you pay for health-related costs if you become unwell. For example, if you need to travel back home due to illness and cannot complete your studies, insurance could cover the travel cost for you. Students studying for less than six months We advise you to get private medical insurance before you travel because any hospital treatment will be charged. You can register with a GP service as a ‘temporary resident’. This will give you access to a family doctor and their services, but you will need to pay for treatment. You will also be able to access emergency and urgent care services, mental health, and sexual health services. For the most current and up-to-date healthcare guidance, please refer to the UK Council for International Student Affairs (UKCISA) information. Health centre registration You can register with a local health service based on your term-time address. If you’re located in Nottingham city, you can register with the University of Nottingham Health Service, conveniently situated in Cripps Health Centre on University Park Campus. If you are studying at Sutton Bonington or if you are living in Derby city, you can register with a doctor closer you. For more information and to register, use the button below. Register with a health service If you register with the University of Nottingham Health Service, you may be eligble to receive a number of different recommended vaccines. Find out more using the button below. Vaccine guidance Do I need to bring my medication? If you need medication, we recommend bringing enough for three months. Some medicines may not be available in the UK, or they may be more controlled. Contact the University of Nottingham Health Service when you arrive so they can help you get your medication. You can register as a private or NHS patient, depending on your eligibility. Many dentists accept NHS patients, but waiting lists can be long. You must also be registered with a GP to access NHS dental services. NHS dentistry is not free, but it is cheaper than accessing private dentistry. The cost depends on what treatment you need. For more details, see NHS dental charges. Our on-campus dental practice, Cripps Dental Centre, provides NHS and private care for students. Find out more on the Cripps Dental Centre website. Alternatively, you can find a dentist local to you using the link below. Find a local dentist Use our Welcome Kit for International Students to find out more about the healthcare and support sevices available. International Students Welcome Kit"
        }
    ],
    "pdf_files": []
}