{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/central/specialist-facilities-at-sutton-bonington.html",
    "content": [
        {
            "p": "Affectionately known as 'SB' among our students and staff, the campus has the best specialist facilities, including a 1,100-acre University Farm, Centre for Dairy Science Innovation and animal small holdings, our paperless Super Lab, specialist glasshouses and food processing facility. Our rural Sutton Bonnington Campus is an inspiring and vibrant space affectionately known as ‘SB’ among our students and staff. This specialist campus is home to our Schools of Biosciences and Veterinary Medicine and has outstanding facilities including a 1,100-acre university farm, centre for dairy science innovation, animal small holdings, our paperless super lab, specialist glasshouses and food processing facility. Its not just study, Sutton Bonnington Campus facilities also include: The Nottingham Ancient and Environmental DNA Laboratory (ÆDNA) opened in June 2022 which will allow DNA from ancient and environmental samples to be analysed. Dr Andrew Clarke Assistant Professor in Archaeogenetics and ÆDNA project lead Join us at the University of Nottingham, where you'll have access to world-class facilities, be taught by award-winning educators and experience a city voted in the top ten for best student experience in the UK. UON Whether you want to keep fit, make new friends, or try something new, there are over 70 clubs you can join, from popular to ‘don’t know what it is but it looks cool’ sports. Jubilee campus Innovative buildings and green spaces designed to inspire tranquillity and creativity. Faculty of Medicine and Health Sciences Discover what it's like to be a student in the Faculty of Medicine and Health Sciences at the University of Nottingham. So, what is it really like to study nursing here? If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}