{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Industrial-Economics-BSc-Hons-U6UIDECN.html",
    "content": [
        {
            "p": "Jubilee Campus, Nottingham, UK How can companies remain competitive in a crowded marketplace? How do they decide how much to invest in research and development? How do regulatory systems impact profit margins, innovation and growth? Our BSc Industrial Economics will uncover the answers to these questions and more, giving you an understanding of the complex relationships between economics and global business practices. You will examine a company, take an in-depth look at its structure, markets, competitors and external economic environment. You can also apply for this course with an integrated placement year. Pease see the course page for more details. Mandatory Year 1 Entrepreneurship: Theory and Practice Introduction to Economics Microeconomics for Business Professional and Academic Development Quantitative Methods 1B Optional Financial Accounting Quantitative Methods 1A Business Finance Business Law Computers in Business Environment Society and Governance Fundamentals of Financial and Management Accounting The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 29 August 2024. Due to timetabling availability, there may be restrictions on some module combinations. Each academic year, you are required to complete a number of compulsory and optional modules, totalling 120 credits. A typical 10 credit module requires a total of 100 hours of study. This includes teaching hours comprising lecturers and small group teaching. It is typical for students to have at least 8 to 12 teaching hours per week, as well as student (office) hours. Throughout your program, you will also be expected to carry out independent study, which is likely to increase as you progress. Jubilee Campus has eco-friendly buildings, alongside green spaces, wildlife and a lake. This campus is home to our business, education and computer science schools, as well as a sports centre and student accommodation. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). I learned how important communication is and to look at things as an opportunity. I discovered how a large business operates and how to navigate it. I had to be versatile and adapt. James Andrews, BSc Industrial Economics Faculty of Social Sciences Entry requirements AAA UCAS code N20A Duration 3 years full-time Start date Sep 2025 77% say staff value students views and opinions about the course Data for Industrial Economics (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}