{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/life-in-nottingham/how-safe-is-nottingham-for-students--.html?title=TGlmZSBpbiBOb3R0aW5naGFt&variant=bGlmZUluTm90dGluZ2hhbUpzb25QYXRo",
    "content": [
        {
            "p": "Nottingham is considered to be a generally safe city, with low crime rates, find out more below. Moving to a new place makes everyone a bit anxious. You ask yourself if you’ll fit in, and you probably wonder how safe it is. It’s quite normal to be nervous or even overwhelmed during your first weeks, but once you settle in, you’ll realise that Nottingham is a nice, quiet place. Ranked as the 6th best city in the UK for students, you’ll be glad to hear that Nottingham has held the Purple Flag status since 2010, which means that our Nottingham is a safe place to live or go for a night out. However, just like any other place, it is important to stay aware of your surroundings and any potential risks, and to know how to prevent them. This will ensure that you can enjoy your years of study and student life without having to worry about your safety. The University of Nottingham campuses are places where you can feel safe, and live in a comfortable environment where you can feel at home. Besides our security measures for your physical and material safety, the University of Nottingham does not tolerate any type of harassment, hate crime, or unwanted behaviour that you find offensive, intimidating or humiliating. Lock all your doors and windows It can be that simple to keep most burglaries at bay. Be considerate about your stuff Don’t flash your stuff in public or leave it unattended. Leaving your laptop unattended on that coffee shop table might not be such a good idea. After all, you don’t want a semester of work stolen. Talk about what’s your plan for the night Whether it’s the first time living on your own, or you’ve been here for a while, being sensible about your personal safety will help you enjoy your experience at the University of Nottingham. It's important to consider who knows where you are, when they can expect to see you again and remember to communicate with friends and family if your plans change. If unsure, you don’t need to feel pressured about being on your own in terms of safety. At the University of Nottingham we have an array of services to provide support - from advice centres to wellbeing - should you ever need them. Here, we’re all part of a safe, diverse and inclusive community. Life in Nottingham Welcome to Nottingham! It’s known for its role in the Robin Hood legend and for the hilltop Nottingham Castle Museum and Art Gallery, rebuilt many times since the medieval era. In the Lace Market area, once the centre of the world’s lace industry, the Galleries of Justice Museum has crime-related exhibits. Wollaton Hall is an ornate Elizabethan mansion with gardens and a deer park. Nottingham and Nottinghamshire The city has many highlights if you consider studying at the University of Nottingham. Here are the \"hidden gems\" students should know about when visiting Nottingham. Find out more about Nottingham and what the city is famous for. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}