{
    "url": "http://www.nottingham.edu.my/Study/Accommodation/Accommodation.aspx",
    "content": [
        {
            "p": "We want your time with us to be as enjoyable as possible and at the University of Nottingham Malaysia, we want you to feel right at home as it won't be just a place for you to study for the next few years but a home away from home. We understand that choosing the right university accommodation depends on budget, location, security, and convenience. We are committed to providing you with the necessary information for your informed decision. The University offers a variety of On-Campus Student Accommodations where learning facilities and amenities are all just a short walk away. Newer accommodation consisting of six halls of residence are located in Student Village North (J Halls), while Student Village South (I Halls) consist of five halls of residence completed when the purpose-built campus was first constructed. Each residential hall has its own Hall Warderns (staff) and Hall Tutors (postgraduate students) who will be available to care for your safety and welfare. Entrance into your halls are via door access control using your student ID card. Security is provided by a team of in-house security officers and outsourced security guards. The University also has over 400 CCTV cameras throughout the campus. Staff, students and residents at the University of Nottingham Malaysia accommodation may use facilities such as: a swimming pool, indoor and outdoor sports facilities (football, hockey, rugby, cricket, basketball, squash, tennis, archery, and more), indoor gyms, outdoor gym stations, jogging track around the main lake, and an outdoor amphitheater which are all located within the campus. The On-Campus F&B allow for outdoor as well as indoor dining options with air-conditioning. A range of cuisines are available from Monday to Sunday with some outlets operating on a 24/7 basis. The following outlets and menu options are available: The University manages a fleet of buses and vans to provide free shuttle services on fixed routes available throughout the year. You will need to show your student or staff ID upon entering the vehicles. Kindly download our mobile app \"whereismybus.nottingham.edu.my\" for the latest bus schedule for the various routes. This app will also show the current location of the bus on the chosen route. Progressing and continuing students are encouraged to apply before the end of the semester or academic year and enjoy the option to request for the same room in the new semester/year. New students may apply for on-campus accommodation as soon as you have your University student ID which is usually issued soon after you have submitted your course application. Please note that we do not guarantee the availability of your preferred type of room, as such, we advise new students who are interested to apply, accept and pay for your preferred room as early as possible. University accommodation costs Our on-campus accommodation page has detailed information about room types and rates, and floor plans. It is important to review the pricing options and plan your budget accordingly. OLAA is the University's on-line accommodation application portal, which will allow you to: OLAA will also provide you with other important information on how and when you can check-in. Apply now For more information on accommodation prices, check out our On-Campus and Off-Campus accommodation pages. Our room rates vary depending on room type, so be sure to apply early. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}