{
    "url": "http://www.nottingham.edu.my/Study/Undergraduate-courses/Faculty-of-Science/Foundation-in-Science.aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/010/3/0312(9/24)MQA/SWA0146 The Foundation in Science programme provides an alternative entry route into science degree programmes offered at the Malaysia Campus. The course is tailor-made to prepare students for our UG programmes. Upon successful completion of all the required credits, progression to an undergraduate degree is automatic and unconditional. Students are assessed via a combination of coursework and exams which are intended to provide well rounded education in a holistic environment. Alongside the core knowledge modules, students will also acquire soft skills such as English proficiency, presentation, critical thinking, scientific writing and leadership. Core modules are taught over 2 semesters to build a strong foundation for students. This is enhanced by 1 semester of elective modules tailored to different pathways such as Bioscience, Pharmacy, Psychology, and Computer Science. This allows students the flexibility and time to explore before deciding on an undergraduate programme. Our Foundation in Science programme provides an easy and quick transition to undergraduate programmes at UNM with direct admission and campus access. It allows students to familiarize themselves with the UNM learning system and culture before progressing to undergraduate. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 70% average based on 6 subjects, including Mathematics and 2 relevant science subjects. Consideration to be made based on relevant individual grades if specific subjects are required. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. Applicants who have successfully completed 12 years of education (definitions will vary according to school system) and meet the entry requirements for the programme, may be eligible to apply for the two semester programme. Acceptance is at the discretion of the University. Note: We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. This pre-university course will provide you with a basic understanding of science-related subjects. You will get a broad tour of topics, including mathematics, physics, chemistry, and biology. It will help prepare you for undergraduate degree courses in science, engineering, and related fields. You will get a solid foundation in essential scientific concepts and principles, preparing you for a career in some of the fastest-growing industries. Yes, without question. You may pursue undergraduate degrees in science, engineering, and related fields. Some UNM courses you should consider are Electrical and Electronic Engineering, Civil Engineering, Biomedical Sciences, and Pharmacy. Yes, of course. However, you may need to meet additional entry requirements, such as providing proof of English language proficiency. This full-time course lasts for 2 or 3 semesters. Yes, you can choose to transfer to other degree programmes, depending on the specific requirements of the course. You should check with the relevant academic department or admissions office for more information. You will be exposed to a combination of lectures, tutorials, and laboratory sessions to help you understand the curriculum and ultimately excel in the material. Yes, you will have ample opportunity to try your hand at practical work, such as laboratory experiments and fieldwork. These are specifically designed to help you develop practical skills and apply what you learn to real-world situations. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}