{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/science.html",
    "content": [
        {
            "p": "Get inspired: everything you need to know about becoming a student in the Faculty of Science at the University of Nottingham. Welcome to a future where possibilities are boundless, and your journey is the destination. Let's dip into what truly matters – your experience, the inspiring minds shaping it, the cutting-edge facilities surrounding you, and the additional options that enhance your academic journey. Uncover what it's really like to be a part of our scientific community. Hear it straight from our students. Curious about the daily life of an undergraduate student? Explore Andrew's typical week and hear about his experience as a student. See a typical week in the life of Andrew, an undergraduate student in the School of Computer Science. Studying at the University of Nottingham is one of the best choices I’ve ever made. It has given me the opportunity to experience and explore a new culture and environment. My study life has never been more interesting. Andrew MSci Computer Science with Artificial Intelligence School of Pharmacy Join Tanishka around her living space, campus and city centre. School of Computer Science Explore Andrew's typical week and hear about his experience as a student. School of Biosciences Olly talks about socials, field trips and extracurricular activities. School of Physics and Astronomy Balancing studies, making friends, sport and a focus on wellbeing Meet our award-winning academics, the brilliant minds driving your education. Follow their stories and insights and hear about their passion for science. You learn best when you’re excited right? By getting students interested in the subject, they do their very best. I think that’s a successful lecture. Silke Weinfurtner Professor in the School of Mathematical Sciences School of Chemistry Light-interacting materials that can improve sustainability. Award-winning work in brain imaging. School of Mathematical Sciences Quantum technology and fundamental physics. How nutrition influences fertility and reproductive processes. Your learning environment isn't just classrooms, it's an ecosystem designed for innovation and discovery. Take a look at our laboratories, research centres, and collaborative spaces. See our world-class Super Lab and clinical skills suite Everything you need is in one place, making it easy to find. A simulated pharmacy, chemistry labs, and modern equipment. Learn about your chemistry study environment from our current students. Beyond textbooks, explore the variety of ways to enhance your academic journey – internships, industry placements, and study abroad opportunities that set you apart. It's not just about what you study, it's about the skills and experiences you gain along the way. Emily spent a year working at Upperton Pharma Solutions as part of her degree. She shares some of her highlights from her work placement year. I originally started studying at another university, but I moved to the University of Nottingham because I realised I wanted to do a placement. Nottingham was the perfect place for that. Emily Chemistry with a Year in Industry MSci Watch Emily’s video to find out about doing a placement year. Physics students Tim and Ilaria researched extra-terrestrial life (SETI). Watch Rhedd's video to find out about doing a Food Science placement year. School of Psychology Find out more about studying your degree in Malaysia."
        }
    ],
    "pdf_files": []
}