{
    "url": "https://www.nottingham.ac.uk/student-living/individual-requirements.aspx",
    "content": [
        {
            "p": "Find the campus that's right for you If you are applying for accommodation and have an individual requirement, our team is here to make your move as smooth as possible. Please let us know so we can make reasonable adjustments for your comfort and safety. Contact us about your individual requirements Whether you need a specific room type or a deaf-alerter in your room, please provide details in your online application and we will contact you to discuss further. If you have any queries before you submit your form, please complete our Enquiry Form, and select the enquiry topic Access and Individual Requirements. Where appropriate we can arrange visits to our accommodation to help you make an informed choice and be confident about what to expect before you arrive. So that we can plan effectively, and so you can secure the best accommodation for your needs, you must approach us as early as you can, especially if you have complex needs. If an application is made after the deadline, this may delay any necessary adjustments to be made, but we will endeavour to assist within a reasonable time frame. Students who have accommodation adjustments in place because of their disability can stay in our adjusted accommodation for the duration of their studies. To secure this, you need to let us know by the end of February each year that you wish to stay. The university's disability team can also offer advice, including on any financial implications that result from any formal adjustments we agree to make. At the University of Nottingham, we are committed to supporting inclusivity and accessibility. The University recognises some students will bring an assistance animal onto campus to access University life and their teaching and learning as an agreed reasonable adjustment. The animal will require access to relevant University buildings and student accommodation where relevant. Others will request to bring an animal onto campus to provide some level of emotional support outside of teaching and learning environments. Applicants who wish to request to bring an assistance animal or emotional support animal should in the first instance contact Disability Support Services: Email: disability-supportservices@nottingham.ac.uk Phone: +44 (0)115 82 32070 Phone lines are open 9 am-12 pm, Monday-Friday only. AccessAble is here to take the chance out of going out. To give you the accessibility information you need to work out if a place is going to be accessible for you. Use AccessAble to find wheelchair friendly venues or check out disabled access and facilities. AccessAble is Your Accessibility Guide. The University of Nottingham has been fully surveyed by AccessAble and you can find the guides for individuals buidlings and rooms to ensure you Our halls on campus have all been surveyed with up to date information on their accessibility. AccessAble is here to take the chance out of going out. To give you the detailed information you need to work out if a place is going to be accessible to you. Start Exploring"
        }
    ],
    "pdf_files": []
}