{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/visa-help/student-route/visa-checking-service.aspx",
    "content": [
        {
            "p": "We offer a free visa application checking service for current Nottingham students and their dependants. We strongly recommend that students extending a student visa in the UK use this service. Having your application checked by an immigration adviser lowers the risk of any mistakes which could cause a visa refusal and affect your immigration status and/or your registration with the University. We will rigorously check your visa application and will tell you if anything is incorrect or missing. We can also check any applications for your family members applying as your dependants. This service is only available for current students extending a Student route visa within the UK. Offer-holders and current students applying for their visa outside the UK should refer to our 10-step guidance on obtaining your student visa from overseas. For other types of visa such as the Skilled Worker route, our immigration advisers will try to answer any specific questions you may have, but we cannot offer a full checking service for these visa categories. Use our 10-step guide to extending your student visa to prepare your evidence and other necessary documents. The 10 step guidance contains instructions on how to complete the visa application form - please use it. Complete the online visa application form up until the 'Declaration' section. Don't go past this section or make any payments yet. Save your answers and download the PDF of your draft form for our Immigration Advisers to check with your supporting documents. Make sure you have these items ready for your visa application: Please submit your PDF draft visa application form and all supporting documents to us via Student Route Visa Application Checking Service. This is a Microsoft Form, and you will need to be signed in with your University IT account to use it. Due to the high number of in-country applications, this service is not currently available for CELE students progressing to their main course and applying to extend within the UK. We would advise all CELE progressing students to review the presentation information that has been shared with them and refer to the application form guide How to extend your student visa. Should you have any specific questions, please email the team at immigration-support@nottingham.ac.ukmailto:immigration-support@nottingham.ac.uk quoting your student ID number. Your application will be checked and an Immigration Adviser will contact you at your University email address with advice on any changes and how to proceed. Visa application checks can take up to 5 working days during busy periods. If your visa expires imminently (within the next 7 days) please also email immigration-support@nottingham.ac.uk to tell us, and include your student ID number. If you wish to book an appointment to discuss your application form and documents, please do not do this until you have: 1) submitted your draft form and supporting documents via the above Microsoft Form, and 2) received a response from an Adviser This will help us to support and advise you in the most efficient way."
        }
    ],
    "pdf_files": []
}