{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/postgraduate-research/examination-research-students.aspx",
    "content": [
        {
            "p": "Postgraduate Research candidates are expected to submit a thesis for examination at the end of their registered period of study. A team of examiners will compile independent reports on the thesis and in most cases, candidates will attend a viva voce (oral) examination. The examiners will then determine whether the work submitted and performance in the viva voce meet the criteria, for awarding the degree as outlined in the Quality Manual. The information on this page will signpost you to the different processes and policies on research assessments, including criteria for award, the role of examiners and advice on the timings, location and format of your viva voce. You are required to submit a thesis for examination at the end of your period of registered study. In some cases, researchers have a ‘thesis pending period’, within which to write up their research and submit the thesis. For more information on how to submit your thesis, please refer to the thesis submission webpage. The thesis should be presented in a satisfactory manner. The subject matter must be clearly and precisely expressed, its arguments logical and intelligible, and its language appropriate. It must show that the researcher not only has ideas, but also has the ability of putting them into suitable words. The thesis must be written by the researcher and be the result of the researcher's own work. Please refer to assessment procedures in the quality manual for more information. Note, you will find more detailed information for examiners, supervisors and candidates under the 'Key Documentation' section of Quality Manual. Quality manual assessment procedure Every research thesis will be evaluated by examiners who have appropriate academic qualifications, relevant expertise in the area of research being examined, and a suitable level of experience in examining research degree submissions. The examination team is usually composed of one Internal Examiner, a member of academic staff at Nottingham and one External Examiner who is a member of staff of another academic institution. Alternative arrangements may be permitted, please discuss this with your supervisor and visit the quality manual for more information. The role of the examiners is to consider whether the information, arguments and results of the researcher's work as presented in the thesis and defended in the viva voce examination (if appropriate) meet the academic standards relevant to the degree. Quality Manual role and appointment of examiner guidance The examiners should submit independent reports on the thesis to Student Services before the viva voce examination takes place. The reports should contain a full and frank assessment of the merits and weaknesses of the thesis. The Internal and External Examiners are each required to submit an independent report on the thesis in advance of the viva voce examination. The reports should be submitted to Student Services. These reports should be in sufficient detail to allow the university to be satisfied that the quality of the thesis is (or is not) adequate and should normally fill at least one side of A4 paper. Particular detail is expected when the examiners find a thesis to be unsatisfactory, but in every case the reports should cover the following points: Does the thesis show originality, and is it an addition to knowledge? Is it satisfactory in extent, style and literary presentation? Is it a work of substance such as may reasonably be expected of candidates who have fully applied themselves to research for not less than 2 (normally 3) calendar years, or for a longer but equivalent period of part-time study? Following the viva voce examination the examiners will complete and sign the joint report form. Both examiners must indicate on the Joint Report Form the agreed result of the whole examination, and their recommendation to Quality and Standards Committee. Once this recommendation has been approved formally, Student Services will write to the researcher to inform them of the outcome and to provide a copy of the independent and joint reports. The viva is an oral exam that will test your general comprehension of the field of study within which the subject of the thesis falls, your acquaintance with the general literature of the subject and knowledge of the relation of the work to the wider field of scholarship. Vivas will normally take place within three months from the submission of the thesis to Student Services. Examinations will normally take place at the university, but the Head of School may give permission in exceptional circumstances for the viva to be held in another location or online. Both examiners will attend your viva. Supervisors are not to be invited to the viva except in special cases with the agreement of both examiners and the approval form the Head of School. If the school wishes to do so, an independent, non-examining chair may be appointed to preside over the viva proceedings to ensure consistency between different vivas and to provide an additional viewpoint if the conduct of the viva should become the subject of an appeal from the researcher. An Independent Chair is required under specific circumstances, such as conducting the viva online, if reasonable adjustments are to be made to the assessment that might affect its conduct, or if requested by the Head of School. The quality manual viva guidance sets out procedures in more detail: Quality manual viva guidance Award of degree for which the researcher is registered, or Award of the degree subject to correction of typographical errors within one month Award of the degree subject to minor amendments to be completed within three months, or Require the candidate to attend for a second viva voce examination and resubmit the same thesis (which may be subject to minor amendments to be completed within three months), or Resubmit the thesis in a revised form within twelve months with/without attending a second viva voce examination, or That no degree be awarded and that the candidate is not allowed to present him/herself again for examination for the degree for which the thesis was submitted. Award of the degree subject to correction of typographical errors within one month, or Award of the degree with minor amendments to be completed within three months to the satisfaction of the internal examiner, or (in the case of PhD researchers) Award of degree of MPhil without further conditions, or (in the case of PhD researchers) Award of the degree of MPhil with minor amendments to be completed within three months No degree awarded and no further examination opportunity. * Exceptionally, where a researcher has been previously registered as a part-time researcher and it has been demonstrated that circumstances exist such that it would be in the best interests of that researcher, the examiners may recommend that the degree be awarded subject to minor amendments being completed within six months. Note that those may vary for different doctoral programmes, see the range of research degrees. You will be given immediate informal feedback on the outcome of the examination. More formal details will be transmitted later in writing. Please also see section above on 'Examination Reports'. Quality manual further guidance If you have been recommended minor corrections to your thesis within one month or three months, you should upload the corrected work to the university’s etheses service. Once you have uploaded your thesis the relevant examiner will check that the corrections are satisfactory. If they are they will formally approve your work by informing Student Services Once this is done, Student Services will write to you confirming your graduation date (if known). If it has been recommended that you resubmit your work within twelve months, then you should follow the same procedure per your initial submission. A second viva may be required. A referral recommendation carries a fee. Please see the University fee schedule for more information. In exceptional circumstances an extension to the resubmission period or of time allowed for minor corrections may be granted. Please refer to thesis pending extension section for further information. Successful candidates will be eligible to graduate once their thesis has been uploaded to the university’s Nottingham ePrints service and approved by the examiner. Please observe key graduation eligibility dates. You will only be invited to register for an upcoming in-person graduation ceremony once the final award has been confirmed, including any corrections approved or ratification required by exam boards. Students wishing to be conferred at an inter-ceremony to graduate in absentia (without a ceremony) must apply prior to the dates provided on the Graduation webpages. Details of how to register to either attend your graduation ceremony, graduate in absentia or defer your graduation will be emailed out in advance and once details are confirmed. For more information, please visit the Graduation webpages"
        }
    ],
    "pdf_files": []
}