{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/ielts/about.aspx",
    "content": [
        {
            "p": "IELTS is jointly owned by British Council, IDP: IELTS Australia and Cambridge Assessment English Every year, IELTS helps millions of people realise their dreams of working, studying or living abroad, or improving their opportunities at home. The test has been developed by experts to evaluate your English skills in reading, writing, listening and speaking – and it’s trusted by organisations all over the world, from universities and immigration bodies to companies. So the IELTS journey you start here at The University of Nottingham, could take you almost anywhere. IELTS conforms to the highest international standards of language assessment IELTS is the most widely accepted English language assessment product that uses a one-on-one speaking test to assess your English communication skills. This means that you are assessed by having a real-life conversation with a real person. This is the most effective and natural way of testing your English conversation skills. You can take IELTS Academic or IELTS General Training, depending on where you are applying and your future plans. If you would rather use a computer than writing out your answers on your paper, you can do that in the University of Nottingham. When you take IELTS on a computer, you take the Listening, Reading and Writing sections on the same day. You also take the Speaking test on the same day, face-to-face with an IELTS examiner (not on a computer) and you get the test results in 3-5 days. If you need to take an IELTS test to support your UK visa application, you need to be aware of changes made by UK Visas and Immigration to Secure English Language Tests (SELTs) for visa purposes. Read this information carefully, before applying for an IELTS test. B Floor, Exchange Building Jubilee Campus, Wollaton Road Nottingham, NG8 1AW, UK t: +44 (0) 115 951 4419 email: ielts@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}