{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/country-info/countryinformation/bangladesh.aspx",
    "content": [
        {
            "p": "Unlock your potential at a world-leading university with a truly international student community. Students who have taken Intermediate/Higher Education Secondary School Examinations are usually required to take a foundation course. We offer foundation courses for international students who are not qualified for direct entry to our undergraduate degree courses. These courses are available at the University of Nottingham International College, just next to University Park Campus, in partnership with Kaplan International Colleges. Find out more about the courses, entry requirements and progression options on Kaplan's website: Applications and enquiries for these courses are handled by Kaplan and the college. International foundation courses Full-time courses across our five faculties typically last for three to four years, although some degrees such as medicine and architecture have a longer duration. Our Undergraduate Prospectus lists entry requirements for A levels and International Baccalaureate students for each course. Students with three or four year bachelor degrees awarded from recognised institutions may be considered for entry to undergraduate programmes at year one or two respectively. Students taking APs or SATIIs should refer to entry requirements for the USA. We offer a wide range of postgraduate masters degree programmes across our five faculties. Full-time masters courses typically last for one year. Students must have completed a relevant degree from a recognised University in Bangladesh. This should be equivalent to at least a UK ‘Upper Second Class (2:1)’ or ‘Lower Second Class (2:2)’ degree. Take a look at our Postgraduate Prospectus to check the requirements of your chosen programme. The summary below is provided as guidance for degrees from Bangladesh. We may require higher grades than listed below, this depends on where you have studied and the course you are applying for at Nottingham. If you are unsure, please contact us for further information. Entry requirement Upper Second Class (2.1) Lower Second Class (2.2) Percentage CGPA out of 4.0 Percentage Scale (in Masters) CGPA on a 4.0 scale (in Masters) Our PhD courses, available across a wide range of subject areas, typically include three years of full time research followed by an optional writing-up period of one year to complete your thesis. Applicants should hold a masters degree of a good standard from a recognised university in a relevant subject area. See the masters section for guidance on the grades and GPAs we typically require from universities in Bangladesh. These will vary depending on the University where you have studied and the course you are applying for at Nottingham. You should identify possible supervisors at Nottingham before applying and prepare a research proposal to submit with your application. South Asia Undergraduate Excellence Award South Asia Postgraduate Excellence Award Developing Solutions Masters Scholarship Chevening Scholarships Commonwealth Scholarships Commonwealth Shared Scholarship International Sporting Excellence Award Sports scholarship packages Read about our international sports scholars Find out more about tuition fees Graphic adapted from FreeVectorMaps.com Find out more about student life \"After coming here, I realised that the lectures are indeed given by world-class professors. You're in a classroom with students from literally every continent in the world, and it's truly a multinational, multicultural experience which really helps you learn a lot.\" Eriko, MSc Entrepreneurship, Innovation and Management Read our International Student Life blog \"I chose to study at the University of Nottingham because of its approach of research-led teaching and holistic line of education, which will broaden and enrich my knowledge and provide me with skills ideal for tackling challenges sustainably. My friends who have studied in Nottingham have always said remarkable things about the university and I was eager to be a part of the Nottingham community. The green and sustainable campus and vibrant community provides an ideal atmosphere for a truly wonderful and elevating student-life experience. Read Sameer's story \"I joined Standard Chartered Bank Bangladesh in the prestigious International Graduate Program in 2014 that is considered to be one or the most coveted corporate graduate trainee programs in the country. The program allowed me to train for a month in the sprawling city of Shanghai for a month and has since challenged me in my everyday life. Today I am an Associate Director in Commercial Banking looking after the financing of some of the most recognized RMG clients in Bangladesh. I truly believe The University of Nottingham has had a huge role in shaping up my ideas, persona and aspirations.\" Senior Recruitment Adviser for India, Sri Lanka, Bangladesh and Nepal, based in New Delhi rohil.kapoor@ nottingham.ac.uk Our official representatives in Bangladesh can assist you with applying for our courses, visa processes and preparing to study with us. About our overseas representatives We regularly travel to Bangladesh to meet with prospective students and their families, visit schools and to attend education fairs and other events each year. Meet us in Bangladesh You are welcome to visit our campuses in Nottingham for an open day or an independent visit. Visit us in Nottingham Contact us by email or telephone Connect with us on social media International Student Life blog Bengali Society Facebook page"
        }
    ],
    "pdf_files": []
}