{
    "url": "https://www.nottingham.ac.uk/studywithus/why-study/campuses/nottingham.aspx",
    "content": [
        {
            "p": "Each of our UK campuses has a unique character and provides access to world-leading facilities. Virtual tour Nottingham is located in the heart of the Midlands and has excellent road and rail links to major cities across the UK. There are easy transport links to the local East Midlands Airport as well as major airports in Birmingham, Manchester and London – making it accessible from anywhere in the world. Getting to Nottingham This 300-acre landscaped site is only 20 minutes from the city centre by public transport. This is where the majority of our courses are taught. You'll find numerous libraries and halls of residence, as well as Lakeside Arts and the David Ross Sports Village. The Students' Union is in the centre of the campus and has recently undergone a £15m redevelopment. Our Medical School is connected to University Park Campus by a short footbridge More about University Park Campus Futuristic architecture, eco-friendly buildings, a library in a lake and innovative technologies make Jubilee Campus an inspiring place to be. You can find everything you’ll need as a student on Jubilee Campus, including food outlet, sports facilities and halls of residence. It's also only a 15-minute walk to University Park Campus. Our Business School, School of Education and School of Computer Science are all based here. More about Jubilee Campus Sutton Bonington Campus has world-leading laboratories and specialist facilities for studying biosciences and veterinary medicine. The campus is home to over 2,500 students. It's a place where it’s easy to get to know your fellow students and teaching teams, yet feel part of a wider global community. You will find everything you need to enjoy student life and feel supported on Sutton Bonington Campus including halls of residence, sports centre and Student Services Hub. More about Sutton Bonington Campus How to apply Fees and funding"
        }
    ],
    "pdf_files": []
}