{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/our-campus-and-facilities/heart-of-UK.html?title=UmVjZW50bHkgdmlld2Vk&variant=cmVjZW50",
    "content": [
        {
            "p": "We are Nottingham. Locally rooted, yet globally connected, we are the heart of the UK. One destination with endless possibilities. One beating heart with a desire to drive change A bustling city with a legendary past, Nottingham boasts vibrancy, culture and a tonne of green spaces. We don’t mean to brag, but with a large student population, it’s no surprise that Nottingham is ranked as the 9th best city in the UK for students and 53rd in the world, according to the QS Best Student Cities 2022. But what makes our vivacious city so special for students? And what do you need to know before arriving in the heart of the UK? While we love our Nottingham roots, the University of Nottingham strives to be a university without borders. We have inspiring campuses in three countries, energising us to be a globally engaged university committed to making a difference in our cities and regions. And our global impact isn’t just locational. As a member of the UK's prestigious Russell Group and the Universitas 21 global network of research-intensive universities, we deliver a high standard of education at home and abroad. The University of Nottingham was founded in 1881 as Nottingham Civic College, but the city of Nottingham’s story stretches much further back – to the 6th century, in fact. Nottingham has a vibrant past filled with folklore and industrialisation. Medieval outlaw, Robin Hood helms from the city and there’s no better place to learn about the local legend. Nottingham has ample industrial history too, from lace making and hosiery to tobacco, bicycles and even arrow making. Did you know that there’s also a network of caves directly underneath the city dating back to 1250? Undergraduate students visiting the Robin Hood statue at Nottingham Castle, Nottingham City Centre. Copyright - University of Nottingham Some pretty amazing medical discoveries have been made here too. While lecturing at the University of Nottingham, physicist Sir Peter Mansfield pioneered the creation of Magnetic Resonance Imaging (MRI) and transformed the world of medical imaging. Mansfield was knighted in 1993 and won the Nobel Prize in 2003. He remains an inspiration to students and staff and serves as a reminder of what can be achieved here in Nottingham. The University of Nottingham really is the heart of the UK, boasting a central location 110 miles northwest of London, 30 miles southeast of Sheffield and 45 miles northeast of Birmingham. We also have excellent travel links. Buses and trains run throughout the city and further afield and we’re one of eight cities in the UK with a tram network. The university also provides free hopper bus services that run between the main University Park campus and Jubilee, Sutton Bonington and King's Meadow campuses, and the Royal Derby Hospital Centre. East Midlands Airport is only 12 miles away from University Park. Nottingham has an abundance of art galleries, theatres, cinemas, and live music venues - there’s something for everyone to enjoy in between studies.For history buffs, Nottingham Castle has 1,000 years of history to explore. The bustling high street, Victoria Shopping Centre and Broadmarsh have plenty of shops to keep shopaholics busy. And sport lovers can get their fix at the City Ground, home of Nottingham Forest FC. Nottingham students can also enjoy an array of exciting bars, restaurants and independent eateries. Situated on the edge of the Peak District, Nottingham also benefits from a variety of green spaces right on its doorstep. Stately homes, walking trails and seemingly never-ending forests offer quiet thinking spots when you need a break from study. Did you know University Park sits within 300 acres of extensive greenery? Whoever you are, whatever you're into, find your people here at Nottingham, the heart of the UK. Students walking across bridge in Nottingham Castle play area, Nottingham City Centre. The University of Nottingham is within 4 miles of the city centre and there are many transport links that will get you there. In fact, it’s so close that you might even take yourself there on a bike or on foot. How do you get to Nottingham’s city centre from the University of Nottingham campus? Nottingham and Nottinghamshire Nottingham is considered to be a generally safe city, with low crime rates, find out more below. Sport As the Sports University of the Year for 2024 and top University in the UK for team sport, we offer an award-winning programme of sport, health and fitness opportunities for our students and community. Courses What is a Foundation programme? Applying Although the majority of our applicants will have A levels, we welcome and value a wide range of alternative qualifications. If you want to find out more about our entry requirements, it's time to read on... If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}