{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/postgraduate-research/thesis-pending.aspx",
    "content": [
        {
            "p": "Research programmes are designed to allow for the all research to be completed and written up within the registered period of study. For eligible researchers, time is allocated to allow for the completion of any research yet to be written up. This time is referred to as the thesis pending period. Students whose programme of study lasts for less than four years (eight years in the case of part-time students) and who have completed their research and the period of registered study, may enter the thesis pending period. In all cases the thesis must be submitted within four years (full-time) or eight years (part-time) of the start of study or within 12 months (full-time) or 24 months (part-time) of the end of registration, whichever is the less. This may vary depending on the terms and conditions in your individual studentship. More information on the regulations can be found in the quality manual. Entry into thesis pending is dependent on satisfactory progression in the final Progression Review. Most students enter the thesis pending period upon finishing the registered period of study, but you can also choose to enter the thesis pending period early or alternatively request a further period of registered study. You should discuss your options with your supervisor in the first instance. During the thesis pending period you will still be entitled to use the library and University computing facilities but not the facilities for research as this stage of your study should be concluded. The information on this page will signpost you to different processes and policies that may apply during this stage of your researcher's journey You can opt-in to register in your thesis pending period if you are a full-time researcher, and for a maximum of 1 year. Local authorities will provide an exemption of council tax for a maximum period of 4 years. Registering in your thesis pending period is optional, and it may allow you to be exempt from council tax. You should always check with your individual Council as to their exemptions. You will be entitled to the use of library facilities and University computing facilities (but not to facilities for research) during your thesis pending, whether you are registered or not. Some sponsors of international researchers also require their researchers to register in thesis pending. If you want to register you need to download and complete the registration in thesis pending form before you commence your thesis pending period. Late applications will not be accepted. Once you have submitted your first submission thesis for examination, you are no longer permitted to register, and you are no longer eligible for council tax exemption. Please note, there is a fee payable to register in your thesis pending period, please visit the tuition fees webpages. Registration in thesis pending form If you have completed your research and the minimum period of registered study as required by regulations, you may enter the thesis-pending period earlier (before the agreed end of your registered period of study). This would normally be an outcome from your final annual review, and it would have to be approved by your supervisor and Head of School. Your thesis pending period will not extend as a result of this request. Please complete the form below and submit to Student Services. Request to enter thesis pending early form During the thesis pending period and any period of corrections or thesis re-submission, supervisors and PGRs should continue to meet regularly. For part-time candidates, this should involve a minimum of 6 recorded supervisions a year and for full time candidates, this should involve a minumum of twelve monthly recorded supervisions a year. Supervisors will read and comment on at least one draft of the canddiate's thesis prior to submission. The aim of these meetings should be to support the PGR student to reach the point of final thesis submission in a timely way and minimise any extensions. In exceptional circumstances an extension to the thesis pending period (or submission deadline) may be granted. All applications should be agreed with your school and submitted with supporting evidence to Student Services for consideration. You can access the extension to thesis pending period form and also find the regulations by visiting the quality manual. Normally, only circumstances affecting your thesis-pending period can be considered. Requests based on circumstance which occurred prior to your thesis pending period will be refused. Normally, a maximum of 6 months (twelve for part time researchers) extension will be granted for a first request. Second or subsequent requests which will exceed 12 months (24 months for part time researchers) will require approval by the university’s Quality and Standards Committee. The fee for an agreed extension to the thesis pending period can be found in the fee schedule. Extension to thesis pending form Quality Manual extension to thesis pending regulations and form You are required to submit a thesis for examination before the conclusion of the thesis-pending period. You must give formal notice of at least 3 months to your school of your intention to submit. The school should ensure that Student Services office is informed so that the procedure for appointing examiners can be initiated. Any delay in submitting your notification of submission form can lead to a delay in your examination taking place. Visit examination research students for more information on the examination process. Your supervisor’s signature on the notification of submission of thesis form acts as confirmation that: Upon receipt of your completed form, Student Services will ask your school to nominate examiners. When approved, we will email you with the names of your examiners, asking you to declare any possible conflict of interest. Notification of submission form"
        }
    ],
    "pdf_files": []
}