{
    "url": "https://www.nottingham.edu.my/Study/How-to-apply/policy-on-credit-transfer.aspx",
    "content": [
        {
            "p": "The University places no requirement on schools to grant ROL or to consider ROL applications if a school or programme has a policy of not so doing. Where the learning has occurred prior to the student being admitted to the University, applications for ROL should be made before the student first registers with the University as schools may choose not to consider any applications for ROL that are submitted after admission. The process covers: Recognition of Prior Learning (RPL) i.e. where credits or qualifications have been awarded by a higher education degree-awarding body or professional bodies. Credit transfer can be either on the basis of an individual application or as part of a formal arrangement with an external institution. The admitting school determines the status of that award (including considerations of volume and level) as it relates to the programme the applicant wishes RPL to be applied to. Recognition of Prior Certified Learning (RPCL) i.e. where students have obtained masterslevel (level 7) credits or above via professional development or employment-based awards, e.g. the Cambridge ESOL DELTA, Trinity Dip TESOL, National Award for Special Educational Needs Co-ordinators (SENCO). Applicable to School of Education only.* Terminology: The term Recognition of Other Learning (ROL) is used where Recognition of Prior Certified Learning (RPCL) and Recognition of Prior Learning (RPL) are being referred to together It is the student’s responsibility to apply for ROL and to provide all the necessary evidence to support their application. When applying for ROL, please complete the Application for Prior Certified Learning (RPCL) or Credit Transfer Form. Please note that exemption from our modules may mean that your course duration is shorter than advertised. Double Counting: General: Undergraduate: Postgraduate Taught: Postgraduate Research: Decisions for all applications will be made by the admitting school, which can request any supporting evidence from the student which it deems necessary to reach a decision. The school may also wish to interview the applicant or may have additional criteria which must also be satisfied. Once a decision has been made by the school, the applicant would be told in writing by the Admissions Office. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}