{
    "url": "http://www.nottingham.edu.my/Study/Offer-holders/Paying-your-fees/Paying-your-fees.aspx",
    "content": [
        {
            "p": "*This content is intended for local students only. Mandatory e-Invoice Implementation at University of Nottingham Malaysia Welcome to the University of Nottingham Malaysia's (UNM) e-Invoice Information Page. In compliance with the Inland Revenue Board (IRBM) mandate which was gazetted in Dec 2023, we would like to announce that we will be implementing electronic invoicing (e-Invoice) starting 1 August 2024. This page provides detailed information about the e-Invoice system, its benefits, and the integration with the IRBM’s e-Invoicing portal called MyInvois. What is e-Invoice An e-Invoice is a digital representation of a transaction between a supplier (in this case, UNM) and a buyer (students). e-Invoice replaces paper such as invoices, credit notes, and debit notes. An e-Invoice contains the same essential information as traditional document, for example, supplier’s and buyer’s details, item description, quantity, price excluding tax, tax, and total amount, which records transaction data for daily business operations. Benefits of e-Invoice The implementation of e-Invoice not only provides a seamless experience to taxpayers, but it also improves business efficiency and increases tax compliance. Overall benefits include: We understand that this may raise questions or concerns, therefore we have prepared a list of FAQs for your reference. Our finance team will be available to assist with any inquiries regarding your invoices. We are committed to ensuring a smooth transition to the e-invoicing system. Please take note of the following: The university will be sending out detailed communications via email. You can also check the university's website or contact the finance department for more information at Finance.eInvoice@nottingham.edu.my The University collects essential information such as name, identification number, address, email address, contact number for the e-invoicing purposes. Your data will be securely processed and you have the right to access your e-Invoice data and report any concerns. For a detailed understanding of how your data is managed by the University, please visit our Data Protection Notice on UNM’s official website. Please refer to e-Invoice Guidelines issued by Inland Revenue Board Malaysia (IRBM) under section 134A of the Income Tax Act 1967 - https://www.hasil.gov.my/en/e-invoice/guidelines/ Yes, taxpayers can continue to claim tax deductions or personal tax relief using existing documentation until such time the legislation has been amended. · Refer to Early Payment Discount Information pages. · Please send an email to finance office to request an adjustment. · Check with your bank for daily transaction limits. · We recommend to clearing your browser's cache, following the steps below, and trying again later. Here are the steps: - § In Chrome a. On your computer, open Chrome. b. Click the three dots at the top right. c. Click Clear browsing data. d. At the top, select a time range and mark everything. e. Click “Clear data”. § In Edge a. On your computer, open Edge. c. Click History. e. Click “Clear” now. · If the payment shown failed but has already been deducted from your bank account, please avoid making another payment and email to finance office for further checking. · Students will receive an email from the finance office about their tuition fees and due dates. · For New Students: Students need to make payment for full year academic fees before or on the last day of registration. · For Progression Students: Students will receive an email from the Finance Office about their tuition fees, due dates, and early bird discount when they progress to the next year. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}