{
    "url": "http://www.nottingham.edu.my/Study/Foundation-courses/Tuition-fees.aspx",
    "content": [
        {
            "p": "Foundation course tuition fees per semester for 2023-2024 Foundation courses have a vital role in tertiary education as they provide students with the necessary skills and knowledge to excel in their chosen undergraduate courses. They help to bridge the gap between secondary school and university. They are particularly useful for students who may not meet the entry requirements for direct admission into a bachelor’s degree programme, and for those who need to enhance both language and academic skills. There are various types of foundation programmes available, catering to different academic interests. The following foundation programmes are available at UNM: Foundation in Science caters to students who are interested in pursuing scientific fields such as medicine, pharmacy, or pure sciences. Subjects available in this programme include biology, chemistry, physics, and mathematics. Foundation in Arts and Education is geared towards students who are interested in humanities, social sciences, education and other art-related fields. Foundation in Business and Management is designed for students aspiring to pursue business and management-related degrees. This course introduces fundamental concepts in areas such as economics, finance, marketing and entrepreneurship, preparing students for undergraduate programmes in business-related fields, such as those offered by Nottingham University Business School. Foundation in Engineering is specifically for students who plan on taking up engineering degrees. It covers subjects essential to the engineering field, such as mathematics, physics, chemistry and engineering principles. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}