{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/scholarships-and-bursaries-ug/scholarships/halford-scholarship-programme.html",
    "content": [
        {
            "p": "For students showing strong academic ability who have overcome significant obstacles to their academic progression Nottingham alumnus Andrew Halford generously established this major award for undergraduate students entering the University from 2016 onwards. Andrew is an Industrial Economics graduate (1980). In 2024 the Award offers financial support of £7,500 per year over the ordinary duration of their course to one student. The student will be academically able and aspire to a university education despite circumstances which would ordinarily prevent them from achieving this. The successful applicant will receive between £22,500 to £37,500 depending on their course duration. This is a pre-entry award, meaning applicants will need to apply prior to starting their course in the 2024/25 academic year.* This fund is now closed. For this scheme you must meet the following criteria: The main criteria for this award, in addition to the criteria outlined above, are: Successful candidates will be expected to provide an annual update on their progress and the impact the scholarship has made which will be shared with the scholarship donor. Scholars also agree to their academic marks being reviewed to check they are progressing with their studies *i.e. Undergraduate courses commencing in either September 2024 or April 2025 **A 'home' student is one who meets certain UK residence criteria. These are the same criteria as apply to eligibility for home funding from Student Finance. If you have any questions please contact us by emailing bursaries@nottingham.ac.uk or by calling us on 01158232071 and asking for John Hudson, Claire Lowe or Alison Hickling. Scholarships and bursaries Competitive funding opportunities based on a range of factors, such as financial need, academic potential or non-academic skills Non-competitive, guaranteed funding for eligible students For students with a household income between £0-£35,000 as assessed by student finance For academically able students who face or have overcome barriers to attend university If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}