{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/central/find-a-tribe-to-match-your-vibe-at-our-students--union.html",
    "content": [
        {
            "p": "Discover more about the societies, sport and networks at our Students' Union Taking the next big step into a new chapter of your life is exciting! Not only is your university experience setting you up for a successful career in your chosen field, it’s also a period of growth and discovery where you’ll make new lifelong friends. As exciting as all the possibilities are, it’s normal to feel nervous at the prospect of packing up and leaving home for the first time, to a new city or a different country. We’re here to support you. Our Students’ Union (run by students, for students) is there to help ease you into university life and get the most out of your student experience. Our SU offers something for everyone, with: UoN is home to loads of different and unique societies to allow you to enrich your student experience and try something new. They are also a great way of making new friends and meeting people with similar interests. Lucy Cooper Modern Languages student International students As an international student we understand you have even more to think about as you prepare to start with us at Nottingham.This section is dedicated to you. We cover all the extra bits you need to know as an international new starter, from applying for your visa to deciding what to pack, and how to plan for your journey. School of Mathematical Sciences From quantum physics and coding to gymnastics society and pub golf. Faculty of Arts Chloe is a third-year Music and Music Technology student. She discusses what she loves most about our facilities, learning new skills, and the sense of community in the department... Product Design and Manufacture Follow Maian, a product design and manufacture student, as she takes you through her typical day to give you a taste of what to expect studying with us. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}