{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Undergraduate-courses.aspx",
    "content": [
        {
            "p": "At the University of Nottingham Malaysia, choose from a diverse range of undergraduate programmes that will equip you for your future career. From arts and social sciences to engineering and sciences, we have something for everyone. We take pride in offering a wide range of quality undergraduate degree programmes that cater to diverse career aspirations. Explore our scholarship opportunities to support your academic journey and achieve your dreams, whether you aspire to become an engineer, a pharmacist, a teacher, an entrepreneur, or any other professional. Just 45 mins outside of Kuala Lumpur, take a virtual tour of our lush 48-hectare campus. Take a tour Application guide, intake deadlines and student requirements at your fingertips. Discover our variety of secure and comfortable students residence halls inside and outside our campus. Learn more about the opportunity to study in our China or UK campus for one semester. More on our teaching facilities and resources. The guide for international students, from entry requirements to visa applications, Get up to date on our latest Open Days, masterclasses and campus events. Get in touch with our friendly counsellors to find out more about UNM. Find course Get in touch Get the full list of tuition fees for all undergraduate programmes. Accredited degrees offer students, parents and potential employers an assurance Take the next step in your academic journey with our prestigious undergraduate scholarships. The comprehensive guide to our foundation, undergraduate and postgraduate programmes which include fees, modules and more. A concise guide for international students featuring UNM's top programmes, facilities, and fees. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}