{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Civil-Engineering/Department-of-Civil-Engineering.aspx",
    "content": [
        {
            "p": "Civil engineers must consider many factors in the design process, from the construction costs and expected lifetime of a project to government regulations and potential environmental hazards such as earthquakes. Civil engineers hold supervisory or administrative positions, from supervisor of a construction site to city engineer. At The University of Nottingham Malaysia Campus, we offer the following undergraduate degree programmes within civil engineering. At The University of Nottingham to be consistently rated among the top civil engineering schools in the UK. You will benefit from a course informed by world-leading research that ranked the Department of Civil Engineering second in England in the latest Research Assessment exercise. Everyday we rely on some aspect of civil engineering to enable us to live our lives. As a civil engineer you must be socially aware and interested in working with people to solve problems and meet challenges. Whether it is building the French Millau bridge, the London Eye, the Petronas Towers or life-saving water treatment plants in developing countries, civil engineering is the core discipline that enables projects to happen. Touching just about every kind of structure you can think of – bridges, roads, tunnels, skyscrapers, water supply facilities and even the coast and flood defences that protect homes – civil engineering is fundamental to the world around us and underpins a modern society. At The University of Nottingham Malaysia Campus we offer MEng (Hons) Civil Engineering undergraduate degree programmes within civil engineering. The main areas and principles of civil engineering are introduced in the first and second years. More advanced subjects are included in later years, together with optional modules. You will undertake a broad range of activities, including field courses and individual project, group-based design work, laboratory work and CAD work. Assessment at the end of each semester combines examinations, coursework, laboratory work and projects. Progression through a course is based on an annual appraisal covering all that year’s modules. During your studies you will have the opportunity to spend up to two semesters in the UK at Malaysia Campus fees. Alternatively, you have the opportunity to transfer to the UK campus after your first, second or third year, and complete your degree in the UK campus paying UK fees. Industrial training is compulsory for the MEng degree curriculum. This also provides a great way to identify top career prospects. You will be expected to participate in industrial training during the summer semester after the second year of studies, although participation in other years or multiple-participation is also allowed. All industrial training must last at least twelve consecutive weeks in the same company or institution. The MEng programme is accredited by the Board of Engineers Malaysia, the Institution of Civil Engineers (ICE), the Institution of Structural Engineers (IStructE), the Chartered Institution of Highways and Transportation (CIHT), the Institution of Highways Engineers (IHE), and The Permanent Way Institution (PWI) Civil engineers are needed all over the world in design, construction and management positions. By the end of our civil engineering degree, you will be equipped to embark on a career in civil engineering, or other disciplines that require numerate, problem-solving graduates, perfectly prepared to find employment across specialities including structural design, construction, geotechnical, water resources, transportation, and urban planning. The MEng course is designed to produce graduates with leadership potential, providing the breadth and depth of knowledge to reach the top in their chosen career. You will need strong analytical and problem-solving skills, a solid foundation in mathematics, physical sciences and programming subjects, and proficiency in computer-aided design (CAD) software. Being able to communicate effectively with others is also essential. There are several professional organisations for civil engineers in Malaysia, including: The Institution of Engineers, Malaysia (IEM) The Board of Engineers Malaysia (BEM) The Association of Consulting Engineers Malaysia (ACEM) These organisations will provide you with networking opportunities, professional development resources and support for continuing education and licensure. The PE licence is required if you want to practise as a consulting engineer or to sign off engineering drawings and designs. To obtain a PE in Malaysia, you need a recognised civil engineering degree and a minimum of 4 years of relevant working experience. You must also pass the Professional Assessment Examination and complete a Professional Interview. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}