{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Find-an-undergraduate-course/UG-SchoolDeptsearch.aspx",
    "content": [
        {
            "p": "Welcome to our comprehensive undergraduate course search page, designed to help you explore the diverse range of academic opportunities available at the University of Nottingham Malaysia. We believe in providing students with a dynamic and engaging learning experience, and our Bachelor’s Degrees aim to prepare students to thrive academically, and in their future careers. Below is a list of courses available at our university. Academic excellence: UNM is renowned for its academic excellence and commitment to providing students with a world-class education. Our faculty members are experts in their fields and dedicated to fostering a passion for lifelong learning. Diverse programmes: Our institution offers a rich tapestry of academic disciplines. Whether you’re interested in art and humanities, social science, science or other professional fields, our wide array of Schools and Departments will have a programme that suits your interest. Research opportunities: Students will have the opportunity to engage in groundbreaking research and gain hands-on experience via research projects and initiatives. Campus culture: Our vibrant campus culture includes a supportive community of students, faculty and staff. You will have the chance to participate in extracurricular activities, clubs and events that align with your interests and studies. Career development: UNM is dedicated to preparing students for successful careers. Students have access to career development resources, internships, and networking opportunities that will propel them towards their professional goals. Global perspective: Opportunities to study abroad, international programmes and diverse cultural exchanges will expand your worldview and allow you to build connections with students from around the world. State-of-the-art facilities: Benefit from state-of-the-art facilities at UNM, including libraries, research laboratories, multimedia centres, and specialised study spaces. We are committed to providing students with the best resources to enhance their learning experiences. Start your journey today and embark on an unforgettable journey as you enrol in our undergraduate courses. We invite you to discover your passion, uncover new interests and develop the skills needed to succeed in an ever-changing world. The admission requirements for undergraduate courses vary depending on the academic discipline and course itself. Please refer to the course page of the programme you’re interested in for accurate information. Yes, UNM encourages students to participate in our study abroad programme to gain international exposure and cultural experiences. You can speak to one of our team at the Careers Advising Service for guidance on choosing the right undergraduate course. This will depend on the course you’ve enrolled in. Changes to courses are usually only possible during the designated add/drop period at the beginning of each semester. Unfortunately, our undergraduate courses are only available full-time, in-person. Yes, the University of Nottingham offers Wellbeing and Learning Support for our students, including counselling and mental health advice. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}