{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/central.html",
    "content": [
        {
            "p": "Whether you've already applied or thinking about submitting an application to study with us, dive into what student life is like in Nottingham. Take the time to discover a variety of information to support your questions or queries about student life in Nottingham. Below you'll find the following: Find out why Campus and facilities Whether you're a seasoned athlete, gym fanatic or just want to try something new, our extensive sport, health and wellbeing package has something for you. Faculty of Arts Chloe is a third-year Music and Music Technology student. She discusses what she loves most about our facilities, learning new skills, and the sense of community in the department... School of Health Sciences At Nottingham, around 50% of your course is practice-based. Giving you the chance to gain real-life clinical experience of midwifery care. As an archaeology student, you might be particularly excited about our practical facilities. Well, we don’t just have one laboratory. We have five! Students settling in for a night watching films. Taking the next big step into a new chapter of your life is exciting! At the University of Nottingham, we're here to guide you through the experience as you join us in your next steps. Student experience If you’re searching for like-minded individuals or want to learn about fellow students from different walks of life to understand their university experiences, we have a range of social networks you can be part of. Civil Engineering Read about how our civil engineering students spend their free time Chemical and Environmental Engineering Read about our chemical and environmental engineering society Hear about NatSci Soc modern languages and cultures Second-year student Isabelle shares a typical day... Follow Feroz, as he attends his group design project seminar, meets with his tutor and attends a fundamental materials lecture. We spoke with Daniel, who explains what life is like as a health sciences foundation student. School of Mathematical Sciences From quantum physics and coding to gymnastics society and pub golf. Discover what it's like to be a student in the Faculty of Arts at the University of Nottingham. Faculty of Engineering Faculty of Medicine and Health Sciences Discover what it's like to be a student in the Faculty of Medicine and Health Sciences at the University of Nottingham. Faculty of Science Get inspired: everything you need to know about becoming a student in the Faculty of Science at the University of Nottingham. Browse all of our top tips articles Book onto one of our open days Moving to Notitngham from overseas? Browse our undergraduate prospectus or head back to the homepage and we'll help you find relevant study options, tailored information and advice to become a student at the University of Nottingham."
        }
    ],
    "pdf_files": []
}