{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Education/School-of-Education.aspx",
    "content": [
        {
            "p": "The School of Education provides an exciting and rewarding learning experience with a global view. We are committed to providing quality education to students from around the world. As one of the leading centres for research in education we have contributed to the improvement of social justice and equality in education. Our postgraduate education courses are designed to equip students with the knowledge and skills to become innovative and effective educators. The University of Nottingham Malaysia follows in these footsteps –you will benefit from the innovative teaching and learning methods and high-quality research this provides across our MA, MPhil and PhD programmes. These courses are suitable for both, experienced educators and those who seek to enter the field of education. Our faculty feature experienced educators and researchers who are committed to cultivating and providing a supportive learning environment for our students. All courses are delivered with flexibility and convenience in mind as we understand that many of our students are already in the workforce. Additionally, as a leading research-intensive institution, we believe that postgraduates are central to our research mission. We are committed to providing all the support and skills training you need to fulfil your potential. Postgraduate education courses are suitable for: Experienced educators who desire to enhance their skills and knowledge to become more effective teachers and leaders in their field of work. Individuals who intend to transition into a career in education and need the necessary qualifications and training. Individuals who want to specialise in a particular area of education. For instance, curriculum development, educational leadership, or special education. Those who plan to pursue a career in academia and become professors or researchers in the education field. Those who would like to advance their career opportunities in education and increase their earning potential. Individuals who are passionate about education and want to make a positive impact in the lives of their students. Yes, UNM offers a range of scholarships and financial assistance options for eligible students. Yes, international students from around the world are welcome to enrol in the programmes offered by UNM. However, they must fulfil the eligibility requirements. In Malaysia, a postgraduate degree in education can open up a variety of career opportunities, such as: Teaching in higher education, such as being a lecturer in a university or college. School leadership as you’re equipped with the skills needed to become a principal, vice-principal or head of department. Curriculum development. Research and contribute to the knowledge base of the educational field. Training and development, such as corporate training. Non-profit and advocacy work that focuses on education-related issues. For instance, advocating for education policies or providing educational resources to communities. Kindly note that our modules and class schedule for the academic year 2025/2026 will be revised. Jalan Broga, Selangor Darul Ehsan, Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-PGT-Schedule-2023-2024.pdf",
        "pdf_files/UNM-PGT-Schedule-2024-2025-updated20240816-forwebsite.pdf"
    ]
}