{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/visa-help/atas.aspx",
    "content": [
        {
            "p": "The Academic Technology Approval Scheme (ATAS) is the UK's immigration approval system for international students and researchers in selected science areas. The requirement to have ATAS clearance applies to all international students and researchers (apart from exempt nationalities) who are subject to UK immigration control who are conducting research or studying courses leading to a qualification at masters or doctorate level (PhD) in certain science and technology subjects. If the ATAS requirement applies to you, you will need to make an application for ATAS clearance. ATAS applications are processed by the UK government department, the Foreign and Commonwealth Development Office (FCDO). Applications are made online, and once your clearance is granted, you will receive an ATAS certificate as confirmation. Please take care to ensure the details you submit in your ATAS application are correct and match those held by the University. If your course requires ATAS clearance you will need to obtain an ATAS certificate before you can apply for your visa. The ATAS certificate is also required before you can register at the University. Students applying under the Student visa route will have the ATAS requirement stated in their CAS document. Students coming for less than six months on a Standard Visit visa will have the ATAS requirement stated in their offer letter. If you have a different kind of visa which permits study in the UK, such as Dependant or BNO, the ATAS requirement will be stated in your offer letter. You will not be asked for the ATAS certificate as part of your visa application, but you will need it to register on your course. We recommend reading the below frequently asked questions and answers on the ATAS application process. If your question has not been answered, please contact the Visa and Immigration Team."
        }
    ],
    "pdf_files": []
}