{
    "url": "https://www.nottingham.edu.my/Study/Frequently-Asked-Questions/index.aspx",
    "content": [
        {
            "p": "What is the main focus of University of Nottingham? At University of Nottingham, we are committed to providing a truly international education, inspiring our students, producing world-leading research and benefitting the communities around our campuses in the UK, China and Malaysia. Our purpose is to improve life for individuals and societies worldwide. By bold innovation and excellence in all that we do, we make both knowledge and discovery matter. Can I apply if I'm under 18 years old? If you are an applicant who will be under the age of 18 when you register with the University, it is essential that your parents or legal guardian complete an Under 18 Consent Form. Further information is available in the University Policy. How much are tuition fees and are there any scholarships being offered? You may also email sponsorship enquiries to us. Local students : Email Admission office by providing us with the application index number as reference. International students : Email International office by providing us with the application index number as reference. Contact International Office for enquiries on students or general questions about our course and application process. After receiving the offer from University of Nottingham Malaysia, you need to formally accept the offer before the formal offer letter can be issued. You will be given a four-week duration to accept. If you are a foundation,undergraduate and postgraduate-taught applicant, you are required to pay a tuition deposit fee of RM 1,000 when accepting the offer. The tuition is not applicable if you are a postgraduate research student. Offer letters are not transferable between campuses. You may contact our UK International Office for them to advise you accordingly. If you decide to not join UNM, please read up on the University's accepting and obtaining a refund policy. Yes. You are welcome to visit University of Nottingham Malaysia from 9am to 5.30pm during weekdays. Campus location map What are the available modes of transportation to get to University of Nottingham Malaysia? Please refer to our transportation information page for details. Transportation Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": [
        "pdf_files/Consent-Form-for-Applicants-Under-the-Age-of-18-2018.pdf",
        "pdf_files/Policy-for-Students-Under-the-Age-of-18-Years-2018.pdf"
    ]
}