{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/your-first-few-weeks/teaching-and-studying.aspx",
    "content": [
        {
            "p": "Student life at Nottingham Studying is a big part of your student experience, and we understand that it can be quite a change from being at school or college. You'll find everything you need to know to help you get prepared for your studies on this page - from information about how assessments and module enrolment work, through to additional learning opportunities that can complement your studies, like languages, study abroad opportunities and employability schemes. Exams and assessments play a big role in your university experience and are designed in multiple different ways. When exams form part of your assessment these will usually take place in January and May/June. Reassessments take place in August. Explore our webpages for more information on what you need to know and who you can talk to. Exams and assessments You will be able to view your personal teaching timetable once you have registered. This will display lectures and the groups you have been assigned to for seminars, practicals, workshops, and group tutorials. You should check this regularly to make sure you don’t miss any of your scheduled teaching. Timetabling If your programme of study offers optional modules, you will need to complete module enrolment. This is open for new students from Monday 27 January to Friday 7 February. You should complete module enrolment at your earliest convenience to ensure you don’t miss out on any popular modules and have timely access to your individual timetable. Module enrolment Whether you’re an Ancient History BA looking for a year-long placement, or a Zoology MSci looking to collaborate with a local employer on a short-term project, there are so many work experiences you can explore through the Careers and Employability Service, or your school or department. Work experience From Wi-Fi access to storage solutions to virtual computing and printing on campus, Digital and Technology Services are here to help you with all of your digital needs. Our Smart Bars will be able to help you with any troubleshooting questions you may have. We also provide lots of online and digital tools available to you to assist with your learning, including Microsoft 365 and Teams. Find out what support is available to you and learn about IT essentials at our induction hub. Digital and Technology Services Libraries Access a wide range of free learning resources to develop the digital skills and knowledge that will help you with your studies (particularly the first month) and preparing for life after university. Take the self-assessment to get your free personalised skills report. Digital Student The majority of undergraduate, full-degree students have the opportunity to apply for an international experience during university. This is a chance to explore new cultures, make international connections and gain a unique perspective on the world. Not only that, students who study abroad are also more employable and have a competitive advantage in the workplace. Visit the our webpage to find out what options are available with your degree. Global opportunities by faculty Did you know you can learn a language alongside your degree, even if you aren’t a languages student? And usually, you can even earn credits towards your degree by doing so. We offer a variety of language and cultural modules, and welcome all language enthusiasts from complete beginners right through to those with plenty of experience. Explore the languages you could learn If English is your second language, we also offer courses to help you take your language skills to the next level. Centre for English Language Education The Advantage Award gives students the opportunity to develop essential life and work-based skills, through the completion of extracurricular modules. Taking part will also give students the chance to reflect on their experiences and understand how to showcase these to employers when applying for jobs. Advantage Award Our Careers and Employability Service hosts several careers fairs throughout the year so you can meet employers with graduate vacancies on offer. You can chat with company representatives to explore their vacancies, find out about application deadlines, make connections and, of course, pick up some freebies. The Careers team also advertises more than 5,700 graduate jobs on MyCareer and you can sign up for their Jobs by Email newsletter for vacancies direct to your inbox. Recruitment fairs The ALACS team offer a wide range of in-depth, practice-based courses on academic skills, including writing successful assignments and dissertations, criticality, academic integrity, understanding feedback, effective presentation and discussion skills, and courses to develop important language skills - all delivered by experienced and qualified tutors. You can also book onto our one-to-one consultations to discuss your academic work. ALACS"
        }
    ],
    "pdf_files": []
}