{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/graduation/terms-and-conditions.aspx",
    "content": [
        {
            "p": "By registering for the graduation ceremony, you acknowledge that you have read, understood and agree to these terms. You can contact the graduation team if you have any queries regarding these terms, via the Student Enquiry Centre: Student Enquiry Centre (a) If you are provisionally eligible, you will receive an invite to register for a graduation ceremony by email to your University of Nottingham account. Please note that this does not confirm eligibility, which may be affected by your circumstances subsequent to the invite being sent. If you were expecting an invitation and haven’t received one, please contact the Graduation team. (b) You must register using the form on NottinghamHub before the deadline stated in your invitation to guarantee your place at the graduation ceremony. (c) If you are unable to attend the date of the graduation ceremony, you can apply to defer to a subsequent graduation ceremony or graduate in absentia (without a ceremony) and have your certificate posted to you. If you wish to defer, you must notify the Graduation team no later than 3 weeks prior to the proposed graduation ceremony date. Please note you may only defer twice. If you select to defer and do not attend, you will graduate in absentia. (d) If you fail to register or defer your graduation ceremony (as set out in (b) and (c) above), you will be unable to attend and will automatically graduate in absentia. (a) Each graduand is allocated two free tickets for their guests at the time you register. You must apply for the free guest tickets at the time of registration to guarantee their tickets. (b) If capacity is still available following the first release, we will issue a second release for additional guest tickets which will be sold on a first come first served basis. We will notify all graduands of the second release and its details, including the price of additional tickets, prior to the second release issue. (c) Please note that we cannot guarantee that any additional tickets will be available. (d) You will receive confirmation of your tickets and guest tickets by email to your University of Nottingham email address, normally within 24 hours of registration. We strongly advise that you do not make any travel or accommodation arrangements for guests before securing the guest tickets or, where you do so, that you are able to cancel such arrangements. If you do not receive your confirmation email, please contact the Graduation team. (e) Guests who are unable to secure tickets may watch the graduation ceremony on live stream at the University of Nottingham website or at a venue on our campus in close proximity to the graduation ceremony venue. (a) Children and babies are welcome to join in the celebration of graduand’s achievements, but you acknowledge that the graduation ceremony will be a long and formal event, and so it is your decision as to whether it will be appropriate for them to attend. We ask that you ensure young children and babies respect the formality of the graduation ceremony and, where they are unable to, are removed from the venue. (b) Children under the age of two will be allowed entry without a ticket and must sit on the lap of a parent or guardian throughout the graduation ceremony. (c) Children aged two and above will be counted towards the guest ticket count. (d) Baby pushchairs can be stored in the graduation hall. (e) Children aged under 16 must be accompanied by a guest adult at all times (note that graduands are seated separately from guests). (f) Guests are advised that complementary alcoholic drinks will be available for guests/attendees over the age of 18 at post-graduation reception. Parents and/or guardians of under 18 years in attendance at the post-graduation reception accept full liability for the actions of those children under the age of 18 and the university reserves the right to reject to supply complementary alcoholic drinks to anyone who has is not able to provide proof of age. (a) If you or your guests have any special access needs, you will need to let us know as part of the registration process or otherwise by contacting the Graduation team no later than three weeks prior to the first graduation ceremony. Failure to do so may result in those accessibility needs of yourself or your guests not being met, for which we will not be held responsible. (b) Our Graduation team will use reasonable efforts to meet the accessibility requests of you and your guests which are received on time. A graduand cannot give their ticket or their guest ticket(s) to another graduand. The university will not honour any informal arrangements made between graduands to pass guest tickets on to another graduand. (a) With respect to custom, it is recommended that you wear academic dress to the graduation ceremony. (b) Academic dress can be hired from our supplier, Ede and Ravenscroft, using their website. If you choose to do so, they can arrange for you to collect your academic dress from our campus on the day of the graduation ceremony. Orders must be received by Ede and Ravenscroft at least two weeks prior to the graduation ceremony. (c) You understand that we do not control Ede and Ravenscroft website and we will not be responsible in any way for it. Further, by accessing the Ede and Ravenscroft website, you will be subject to a separate privacy notice and other applicable sales and website terms. We strongly recommend that you review those terms before proceeding. (d) Irrespective of whether you are wearing academic dress, formal business attire is required at the graduation ceremony for you and your guests. You should consider suitable footwear which you are able to walk in throughout the day of your attendance at the graduation ceremony. We understand that sometimes things don't go as planned. If you need to cancel a ticket for any reason we request that you notify us as soon as possible so that we may allow for others to attend. Where you have paid for additional guest tickets, you will be entitled to a refund provided you notify us by emailing our Graduation team at least two weeks prior to the graduation ceremony. You will not receive a refund for any cancellations after this time. Eligible refunds will be processed within 30 working days. Please note that guest tickets are not allocated to any particular individual and so you may reallocate your guests to your friends and family of your choice. Academic dress must be arranged separately by you with the supplier. The University is not a party to this arrangement. Refunds for academic dress will be subject to the supplier’s refund policy, and you must contact them directly. You must carry your University of Nottingham student ID card or other valid photographic ID in order to confirm your identity and ensure that you are admitted entrance. (a) Parking areas may be up to a 15-minute walk from the graduation ceremony venue. If you require disabled parking, you must notify us in accordance with paragraph 1.4 above. (a) You are allocated a numbered seat based upon the order that the awards are read out and therefore the order you will cross the stage in. You must remain in your allocated seat throughout the graduation ceremony. (b) Your guests will be seated in a separate section from graduands. (a) You and your guests should arrive 90 minutes before your graduation ceremony start time and make sure you're gowned and seated 30 minutes before it starts. Ceremonies last for approximately 75 minutes. You can find a schedule of the day on our On the day webpage. (b) Check-in will close 45 minutes before the graduation ceremony start time. If you arrive within 10 minutes after check-in has closed, you will still be able to take part in the graduation ceremony but will not be seated with your cohort and you will cross the stage at the end of the graduation ceremony rather than with your cohort. (c) If you arrive less than 35 minutes before the scheduled start of the graduation ceremony, you will not be permitted to take part in the graduation ceremony. Whilst the Graduation team can attempt to move late graduands to another graduation ceremony on the same day this may not be possible due to availability and in such cases the graduand will graduate in absentia. Facilities can be provided for nursing mothers, please approach a member of our Graduation team who will be able to direct you on the day. (a) Mobile phones and other electronic devices must be turned off or put on silent mode. You must refrain from making or taking phone calls during the graduation ceremony. (b) Mobile phones are not permitted on to the stage and must be left with your guests or on your seat. (c) Pyrotechnics and confetti cannons are not permitted in the ceremony hall (d) The use of photography equipment within official photography areas is prohibited. (e) Smoking is prohibited inside the venue and on campus except in designated smoking areas. (f) You and your guests must be in appropriate attire (see paragraph 2). (g) Applicable rules, regulations, guidelines and policies, including fire, health and safety regulations must be adhered to at all times. (h) You and your guests must not be under the influence of alcohol or any other substances. (i) Graduands must adhere to the Student Code of Discipline during the graduation ceremony. (j) Graduands must ensure their guests are aware of all requirements set out in this paragraph 4.6. We reserve the right at our sole discretion to refuse entry or remove any graduand or their guests if we believe they are in breach of these terms or their conduct is substandard, or they present health, safety or welfare concerns to graduands, guests or staff. We reserve the right to make changes to the agenda, format, location and any other aspect of the graduation ceremony without notice and without liability to you. We may at any time, with or without giving notice, in our absolute discretion and without giving any reason, change, cancel or postpone the ceremony, change its venue or any of the other published particulars. In the case of postponement, we will offer an alternative date which will be within 12 months of the postponed date. In case of a cancellation, we will provide a refund within 30 working days. Except in the case of cancellation, we will not return any money paid by you in connection with the ceremony unless we are satisfied that it is reasonable to do so, about which the decision shall be in our sole discretion and, when announced, final and conclusive. In any case, we shall not be liable for any loss, liability, damage or expense suffered or incurred by you or any other person. (a) Graduands eligible to attend the graduation ceremony will have: i. their name included in a programme. It may also appear on some University of Nottingham merchandise. You must inform us at the time of registration using the form on our website, or otherwise by contacting the Graduation team no later than 3 weeks prior to the graduation ceremony if you would like your information withheld from the programme and/or merchandise; and ii. their full name announced during the ceremony. All information will be taken directly from our student record database. If you feel the name reader at the ceremony would benefit from more information on how to pronounce your name, please complete the name pronunciation form on the graduation website before registration closes. (b) Please see our student and applicant privacy notice for information about how we handle your personal data for the graduation ceremony. (c) The graduation ceremony will be live streamed in its entirety and footage from the graduation ceremony available for your subsequent purchase via the website (d) We may use footage from the graduation ceremony for marketing purposes, including media postings and online postings. Please see our privacy notice for the subjects of photography and videography for more information. (e) You and your guests are prohibited from using flash photography within the graduation ceremony venue and must be respectful of other attendees’ privacy when taking photos. (f) You must refrain from taking ‘selfie’ photographs on the stage (g) You acknowledge that attendance at the graduation ceremony is conditional on you and your guest’s personal information being processed in accordance with this paragraph 6 and, if you object or wish to opt out, you may not be able to attend the ceremony. Notwithstanding, if you wish to opt out or otherwise object to your personal information being processed in the manner set out above, you must advise us prior to registration by emailing the Graduation team. (h) It is your responsibility to check that all details relating to you are correct at the time of registration. If for example, an incorrect award listed, and you do not inform us it is incorrect, this will be reflected in the graduation ceremony programme and the incorrect award read out during the graduation ceremony. If hiring academic dress, it could also cause the wrong type of academic dress you book to be allocated. Please contact our Graduation team as soon as possible if anything is incorrect. However, after the registration deadline it may not be possible for any amends to be reflected in the graduation ceremony programme. If you have any outstanding academic tuition fee debt with us you will not be able to attend the graduation ceremony. You must settle such outstanding debt a minimum of 3 weeks prior to the graduation ceremony to ensure your name is included in ceremony materials. If you or your guests need proof of your graduation date to get a visa, then you should request a Confirmation of Student Status Letter. You can obtain this via the online store free of charge. (a) How we will contact you. Communications relating to the graduation ceremony will be sent to your University of Nottingham email address. (b) Changes to these terms. We may update these terms and any guidance on graduation ceremonies at any time. If any changes may affect your graduation ceremony, we will notify you via email to your University of Nottingham email address. (c) We are not responsible for events outside of our control. We will not be liable for any losses direct or otherwise incurred by you or your guests relating to or arising out of the graduation ceremony due to circumstances beyond our reasonable control including (but not limited to) fire, explosion, terrorist act (or threat of terrorist act), act of God, epidemic, pandemic, national mourning, or as a result of any industrial action or dispute involving the University of Nottingham, or the venue at which the graduation ceremony is due to be held. (d) Nobody else has any rights under this contract. This contract is between you and us. Nobody else can enforce it. (e) Resolving disputes. These terms are governed by English law and claims made arising out of or in relation to them can only be brought in the English courts. Academic Dress means the collective term for the cap, hood and gown worn by graduands. Graduand means a student of ours who has met all the eligibility criteria and has been invited to apply to attend a graduation ceremony. Graduation ceremony means a graduation ceremony event organised by us for the graduand’s graduation. Guest means a person who is a family member and/or friend of a graduand who attends with a guest ticket. ‘us’, ‘we’, ‘our’ means the University of Nottingham. ‘you’, ‘your’ means the graduand."
        }
    ],
    "pdf_files": []
}