{
    "url": "http://www.nottingham.edu.my/Study/Fees-and-Scholarships/Scholarships/Scholarships-financial-assistance.aspx",
    "content": [
        {
            "p": "Unlock your future with UNM's array of scholarships, from the Provost’s Excellence Scholarship offering up to 100% off your programme fees to various other funding options tailored to support your academic goals. UNM provides scholarships to support academic excellence and research initiatives for deserving students. Open to current and future students of UNM, find out more about our array of scholarships and financial assistance available for Malaysian and international students. Explore our range of scholarships based on programme and eligibility. Start your foundation and undergraduate studies with the help of these scholarships. Explore scholarships and funding opportunities for our postgraduate programmes. Find financial assistance in the form of allowances and grants offered by these participating organisations. Please read the following carefully and ensure that you understand the conditions of the scholarship you have applied for or been offered to. The University of Nottingham Malaysia reserves the right to withdraw your scholarship if you are subsequently found to be ineligible or if these terms and conditions are not adhered to. The University also reserves the right to amend its scholarship provision without notice. All our scholarships are applicable for tuition fee reduction only, no allowance or stipend are provided. Your Obligations: 1. Accept the scholarship offer by the given deadline – the University reserves the right to withdraw the offer of a scholarship if it is not accepted by the deadline given. 2. To hold only one scholarship during the duration of your course. In the event that you are offered more than one scholarship, you must choose only one. You are advised to choose the scholarship with the higher quantum unless you choose otherwise. 3. Join your academic course at the given start date and before the registration deadline. 4. Inform the Sponsorship Unit of any other scholarships or sponsorships currently held, or awarded at a later date. The scholarship shall be withdrawn if other source of funding have been awarded. 5. Seek permission and obtain consent from the Sponsorship Unit before making any changes to your courses – this includes course transfers, suspending studies, withdrawal etc. Please note that approval is not guaranteed. Where changes are made without prior approval, the scholarship will be withdrawn and you may be required to repay the scholarship in full. 6. Pay all outstanding tuition fees by University deadlines if you have not been awarded a full scholarship. 7. Meet the scholarship requirements (if any) or satisfactory progress for you to be able to continue the scholarship in the next academic years. The scholarship will be withdrawn if you do not meet the requirements. 8. Agree to act in an ambassadorial capacity, to provide student profiles or testimonials if requested, and to attend scholarship or recruitment events as required by the University of Nottingham Malaysia. 9. Agree to the University of Nottingham Malaysia contacting you during the period approximately three years after your graduation for an update on how the scholarship has influenced your career. Your data will also be passed to our Alumni and Donor Relations Office who retain data in support of your lifelong relationship with the University. 10. Where a scholarship is co-funded with an external organization or donor, we will pass on the details to the external organization for the purpose of selection and reporting. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}