{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/your-first-few-weeks/your-student-experience.aspx",
    "content": [
        {
            "p": "Student life at Nottingham University life is about much more than your course. There are so many opportunities for you to get involved in the wider community, develop your skills, and make the most of the vast array of extra-curricular opportunities available to you. Discover how to pursue your passions, find new ones, and form lasting friendships in the process. Part-time work is not only a useful way to earn some extra money, it’ll also look great on your CV. Our Careers and Employability Service is on hand to support you in finding something that fits around your studies, whether it be something local, or here on campus. Part-time work We have over 70 sports clubs and leagues to help you get active on campus. There’s also our David Ross Sports Village, offering a gym, pool and a climbing wall, on-site sauna and steam room. With our membership covering sports facilities at all of our campuses there really is something for everyone. Sport The ResX team supports students in halls of residence and partnership accommodation sites. They will be your first point of contact for any wellbeing concerns, or if you need to talk about anything that is worrying you. They will also deliver events and activities to provide you with the opportunity to connect with other students in your halls. Residential Experience We have hundreds of societies and clubs you can get involved in. Meet new people with shared hobbies and interests or take the opportunity to learn a completely new skill – such as bellringing, film-making or how to build the perfect Lego palace. Clubs and societies Our university is a place where everyone can feel comfortable being themselves. We value the diversity of our community and have policies around dignity, respect and discriminatory harassment. Take a moment to familiarise yourself with these and to understand our values, how you can report an issue, and what we will do to support you. Standards of behaviour Whether you are a seasoned performer or a musical novice, there are many opportunities to make and enjoy music on campus. You can join orchestras, choirs, smaller ensembles or chamber groups, or one of the Students’ Union’s musical societies. Music opportunities Many of our students tell us that volunteering is one of their favourite things to do at the University of Nottingham. There are plenty of volunteering and fundraising initiatives to get involved in through Karnival – from helping local foodbanks to trekking to Everest Base Camp for charity. Be sure to follow us on Instagram (@nottinghamkarnival) and stay up to date. Volunteering The university is taking a stand against climate change and has set ambitious carbon reduction targets. Every one of us has a part to play and every one of us can make a difference. Find out more about sustainability and how you can get involved, from recycling correctly and saving energy, to signing up to Green Rewards and subscribing to our newsletter, plus much more. Sustainability To stay up to date with what's happening on and around campus, make sure you connect with our social media channels for current students: Instagram Facebook group"
        }
    ],
    "pdf_files": []
}