{
    "url": "https://www.nottingham.ac.uk/student-living/accommodation/parent-hub.aspx",
    "content": [
        {
            "p": "We understand what parents think when sending their children off to University. We’re here to make it easier. As parents and guardians of students at the University of Nottingham, we know that you want your child to have everty success, and so do we. As a University we are committed to providing a supportive and positive environment for all. Coming to university can be a big adjustment for our students and their supporters.Sometimes students encounter personal or academic difficulties. The university has a number of specialist support services to aid students through challenging times, and enable them to fulfil their potential. Below you will find information on catering, your Residential Experience Team and socialising in halls. Scroll down for handy guidance on everything you might need to know from collecting your parcels to doing your laundry. The Residential Experience (ResX) team are here to support you during your time in halls. Whether promoting positive community values or helping to support your wellbeing in halls, there is plenty to get involved with Whatever your background or faith, our University chaplains are here to offer spiritual and pastoral support. As well as supporting you in your faith, our chaplains can help you practise and explore your beliefs. The Student Life Hub gives you access to a wide range of support, including arranging to speak to our friendly Support and Wellbeing Team. They’ll offer advice, refer you to further services and highlight useful resources. Disability Support Services are here to support the University community in creating an inclusive and equitable teaching and learning environment to the benefit of all students. To support you to make the most of your time at university, HealthyU is here to provide information and advice on a range of health issues important to students. The Funding and Financial Support team at Nottingham provides information and advice on most aspects of student finance to both current and prospective students and administers a range of funding schemes such as bursaries, scholarships and support funds. As a parent, guardian or someone with care responsibilities it can be an exciting but difficult time seeing your child step into adulthood and independence for the first time. We are experts at providing student accommodation and have been helping students transition into independent living since the first Halls were built on University Park. We understand that as a parent you might have plenty of questions For students arriving into on campus catered halls, arrivals will begin September 24-25, Once the Accommodation Induction has been completed students will receive their key collection pass and have booked their arrivals slot. For self catered sites arrivals instructions will have been sent to students by email, if you are unsure, you can contact your site directly to find out more. Find your hall contact details We have partnered with Howden for Students to provide contents insurance for each and every room on campus, at no extra cost. Students will need to confirm their cover upon arrival. Confirm your cover and find out more Our campus' and Halls of Residence are all incredibly safe with restricted access to buildings via key cards and 24/7 security on campus at all times. Find out more about security Fees for your accommodation are paid via NottinghamHub. 2023/24 fees will be available to pay from early September. Sign in to the NottinghamHub There is plenty of support available for students living on and off campus. You can find support services via your Residential Experience teams in Halls or directly with the Support and Wellbeing Service. Find more servcies for students Keep in touch, let them know they are supported and help encourage them to seek support when they need it. There is no perfect plan for supporting your children at University. You can find helpful resources here"
        }
    ],
    "pdf_files": []
}