{
    "url": "https://www.nottingham.ac.uk/studentservices/support/financialsupport/bursariesandscholarships/hillsboroughguidance.aspx",
    "content": [
        {
            "p": "Applications for the 23/24 academic year are now closed. Closing date 29th May 2024 The Hillsborough Trust Memorial Bursary offers support to students who are experiencing financial difficulties whilst studying at Nottingham. Trustees of the Hillsborough Disaster Appeal donated money to a number of Universities, including The University of Nottingham, in order for undergraduate bursaries to be awarded to students normally resident in the locality of the University. The University awards a small number of bursaries of around £500 depending on tax and Gift Aid regulations. Unlike a student loan, the bursary is non-repayable and can be spent on anything you like to help you while you study. As the number of bursaries is limited the University attempts to target those students in most need, therefore you must apply for this bursary so your eligibility can be assessed. If you have any questions about this bursary or your eligibility, please contact the bursary team. To be eligible for the Hillsborough Trust Memorial Bursary in the 2023/24 academic year, you must: As there are limited awards, the following additional criteria will also be taken into consideration: Applications are assessed under a procedure agreed by the Financial Support Funds Committee of the University that includes Student Union representation. Priority will be given to students who meet several of the additional criteria. If you believe you are eligible for the Hillsborough Trust Memorial Bursary based on the above criteria, we encourage you to fill out the online application. Apply now All applicants will be informed of the outcome of their application in writing within 4 weeks of the closing date. If you have any queries regarding the application process for the Hillsborough Trust Memorial Bursary please contact our team. If you are unhappy with the outcome of your application you should initially contact the Funding & Financial Support team to discuss your concerns. If after an explanation of the assessment you believe there has been an error or a procedural inconsistency and you wish to appeal you should email the Funding Manager detailing the basis of your appeal. Please send your email to john.hudson@nottingham.ac.uk and copy in financialsupport@nottingham.ac.uk. Appeals must be lodged within 2 weeks of the date of the email notifying you of the initial outcome. You will be contacted within 7 working day of receipt of the appeal with confirmation of the outcome of the appeal. Please note that the Funding & Financial Support Management’s decision is final. Details about the Funding & Financial Support appeal process can be requested from the team at any point and this does not affect your right to raise an official complaint. Further details can also be found on our website. Students who are eligible for the Hillsborough Trust Memorial Bursary may also be eligible for other types of funding. For UK students with personal backgrounds or circumstances that may have impacted their academic potential For students who live and/or attended school in the Nottinghamshire, Derbyshire or the East Midlands For academically able students who face or have overcome personal barriers to attend university. View all scholarships and bursaries **A 'home' student is one who meets certain UK residence criteria. These are the same criteria as apply to eligibility for home funding from Student Finance. University Park Nottingham NG7 2RD Please see our need help page for telephone and online contact points"
        }
    ],
    "pdf_files": []
}