{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Archaeology-BA-Hons-U6UARCGY.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK We are constantly making new discoveries that change our understanding of past human societies. At Nottingham, archaeology covers the human story from prehistory to the development of the modern world. Using your foundation knowledge from year one, you will select specialist modules such as human bones or medieval castles to complete your degree. On this course, you will complete 20 days of archaeological fieldwork. This includes taking part in an approved excavation project, or a related placement, in the UK or overseas. In the core module, 'Communicating the Past' you will consider how best to present heritage to the public, working in groups to create an interactive activity based on your studies. Recent project titles have included: Mandatory Year 1 Comparative World Prehistory Interpreting Ancient Art and Archaeology Rome to Revolution: Historical Archaeology of Britain Understanding the Past I – Introduction to Archaeology Understanding the Past II – Landscapes and Surveying Optional Great Discoveries in Archaeology Greek and Roman Mythology Studying the Greek World Studying the Roman World Interpreting Ancient History Interpreting Ancient Literature The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 22 August 2024. Due to timetabling availability, there may be restrictions on some module combinations. You’ll have at least the following hours of timetabled contact a week through lectures, seminars and workshops, tutorials and supervisions. Your tutors will also be available outside these times to discuss issues and develop your understanding. We reduce your contact hours as you work your way through the course. As you progress, we expect you to assume greater responsibility for your studies and work more independently. Your tutors will all be qualified academics. Sizes of lectures and seminars vary according to topic. A popular lecture may be up to 75 participants, with specialised seminars of 10. As well as scheduled teaching you’ll carry out extensive self-study such as: As a guide, 20 credits (a typical module) is approximately 200 hours of work (combined teaching and self-study). On this course, you will also undertake 20 days of fieldwork. This usually takes place during the summer break and can involve up to five days in a museum or similar environment. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. One of the most important skills that I gained from my degree was the ability to critically analyse and interrogate data. This is an invaluable skill for anyone, and in my role it's important as it allows me to confidently challenge reports and understand these on a deeper level. David Hanks Archaeology BA graduate, now working as Collections Manager for English Heritage Faculty of Arts Entry requirements BCC UCAS code Y14F Duration 4 years full-time Start date Sep 2025 Entry requirements ABB including A in history UCAS code VV14 Duration 3 years full-time (available part-time) Department of Classics and Archaeology Entry requirements ABB UCAS code VVC4 Duration 3 years full-time Entry requirements AAA UCAS code Y002 Duration 3 or 4 years full-time depending on language or placement choices 87% say staff value students views and opinions about the course Data for courses in Archaeology at University of Nottingham, the For more official course information visit Discover Uni See course data If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}