{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/international-students/late-arrival.aspx",
    "content": [
        {
            "p": "Welcome information for international students If you think that you might arrive late in Nottingham to start your course, it's important you read the steps below to find out what you need to do. As a new full-time student studying at our UK campus you will need to register online and complete in-person registration (this cannot be completed remotely). You have until 3 weeks after your course start date to complete in-person registration, otherwise you will be unable to start your studies. The information below will help you understand what you need to do and if you need to notify us, depending on when you will arrive. If you are arriving late, you can visit our international late arrivals Welcome Hub on 8 October to be welcomed to the University of Nottingham and chat with staff and international student ambassadors. If you are studying a presessional English course, you must register in-person within one week of your course start date. For all other courses, you must register in-person within three weeks of the course start date. Late arrival is permitted up to these deadlines after your course start date. If you cannot arrive and register within these times, you will not be able to join your course. If you will be late but are arriving before the registration deadlines you do not need to notify the university. This also includes your school, department and the visa and immigration team (or the UK Home Office). Late arrival cannot be considered as an extenuating circumstance. You will be responsible for catching up on any work missed. You may want to consider contacting your accommodation provider to tell them your expected arrival date. If you have had a visa refusal or are experiencing delays with your visa application, please contact the visa and immigration team directly who will be able to support you. If you are unable to arrive until after the registration deadlines you should not attempt to travel to the UK as you will not be allowed to join your course. If you think you are going to miss the registration deadline, you can choose to defer your place by completing our enquiry form. More information about deferring your place is available for undergraduate and postgraduate students. After you have activated your IT account, you will need to log in to NottnghamHub and complete online registration. When you have registered online, you will then need to book an appointment to complete in-person registration at the start of your course to confirm your attendance."
        }
    ],
    "pdf_files": []
}