{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/central/david-ross-sports-injury-clinic.html",
    "content": [
        {
            "p": "Get hands-on sports injury experience at the David Ross Sports Village. Our £40 million David Ross Sports Village has its own Sports Injury Clinic that provides specialist physiotherapy and sports rehabilitation services, as well as an aquatic therapy pool. During your placement, you will have the opportunity to work alongside experienced physiotherapy and sport rehabilitation staff, and get hands-on experience in a variety of sport, rehabilitation and exercise practises. The centre incorporates numerous facilities including a fitness suite, climbing wall, glass squash courts, a hypoxia chamber, an indoor sprint track and a main hall with retractable seating used for international sports events. For more experience, the university has links with many professional and semi-professional sports clubs and teams in the East Midlands region and beyond, so you will have plenty of placement options. sports hall with 4 large halls and 20 badminton courts | 25m swimming pool | 12m climbing wall | 6 standard squash courts | all-glass squash court | martial arts dojo | snooker room | table tennis - archery - fencing salle | 10 team changing rooms plus officials/private changing 200-station fitness suite | free weights area | spin studio | two dance studios | changing rooms | lockers | Finnish sauna | steam room | arctic ice fountain | ice-cold bucket shower | full-sized 3G rubber crumb sports pitch | full-sized sand dressed pitch | outdoor viewing area | 3 netball courts | 3 tennis courts 60m sprint track | bespoke training area | specialist strength and conditioning services hydrotherapy pool | private consulting rooms | specialist physiotherapy and sports massage services The University of Nottingham provides inspirational and accessible sports for all students with state of the art facilities and venues: David Ross Sports Village, Jubilee Sport Centre, Highfields Sports Complex, Riverside Sports Complex, Sutton Bonington Sport Centre, and campus gyms. Civil Engineering Follow Feroz, as he attends his group design project seminar, meets with his tutor and attends a fundamental materials lecture. Faculty of Social Sciences Discover what it's like to be a student in the Faculty of Social Sciences at the University of Nottingham. Nottingham provides a proven pathway towards career success alongside unrivalled facilities and valuable industry exposure. School of Mathematical Sciences Everything you need is in one place, making it easy to find. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}