{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/visa-help/student-route/funding.aspx",
    "content": [
        {
            "p": "Financial evidence is extremely important for your visa application, and it's essential to get it right. The purpose of financial evidence is to show that you – or your parents, guardians or financial sponsor – can afford to pay for the cost of your studies, including tuition, accommodation and general living costs such as food, utilities, travel and leisure while studying in the UK. There are strict requirements for the funding amounts and forms of evidence accepted by UK Visas and Immigration (UKVI). If the financial documents you provide don't meet these requirements, your application will be rejected. This is the most common reason for student visa refusals, so make sure you understand and follow these rules. Start planning your financial evidence early as it may take some time to prepare your finances and obtain the bank statements or sponsorship letter you will need. If you are applying for or extending a student visa within the UK, and you have been living in the UK with a visa for 12 months or more, you do not need to prepare any financial evidence. Students from certain countries which have a 'differential evidence requirement' in UKVI's regulations don't need to submit financial evidence with their visa application, but they must still prepare it. Check the UK government website for the list of countries this applies to. If you're a national of one of these countries you can apply for a visa without submitting financial evidence, but you must still prepare evidence to show that you meet the funding requirements outlined below in case you are asked to submit evidence later. If you're from any country not on this list, you will need to provide financial evidence when applying for a student visa. Your financial evidence must show that you have funding for: If your visa is for a course of less than nine months, then you will only need living expenses for the length of the course. For any longer courses, you will just need to show that you have living expenses for the first nine months (£9,207 or £10,224 if applying on or after 2 January 2025). If you have a spouse, partner or family members who are applying as visa dependents, you will need additional living expenses or them, at a rate of £680 per person per month, for the first nine months of your course (£6,120 per person). These amounts are determined by UK Visas and Immigration (UKVI), and your financial evidence must show that you can meet them, even if you think that your actual spending will be lower. You must have arranged your finances and funding (such as a scholarship or loan) before applying for your visa. You cannot rely on money you may earn later, such as income from part-time jobs you expect to take in the UK. We do not offer any scholarships to students after they have started their courses, and it is very rare to find any additional financial support after you have arrived in the UK. If your course lasts for more than one year, you should plan your funding for the whole duration so that you don't run out of money in the UK, even though you will only provide financial evidence for the first year's tuition fees and first nine months of living expenses in your visa application. There are different types of documents you can provide as financial evidence, depending on how you are funding your studies. You may use a combination of these, as long as they cover the full amount of funding when added together. The Confirmation of Acceptance for Studies (CAS) that we issue for your visa application will show: Any tuition fee payments which are showing on your CAS at the time you make your visa application will reduce the amount of money you need to show in your financial evidence by the same amount. For example, if you have paid a £2,000 tuition fee deposit, you can take away £2,000 from the total amount you need to show in your bank statement. If you make a payment after your CAS has been verified, you will receive an email which confirms the change in your CAS. You should wait until you receive this confirmation before making your visa application, to make sure that the payment appears in the CAS when your application is handled. The CAS will not include information on accommodation costs and payments, which will always display as £0.00. Accommodation is included within the monthly amount required for living expenses and you must provide separate evidence that you can meet these costs. We recommend that you don't pay accommodation fees until after you receive your visa – except the accommodation deposit for booking your room. We cannot include details of any external scholarships, stipends or loans in your CAS. You must provide separate evidence for these, as listed below. If you or your parent(s) or guardian are paying for some or all of your study costs, you must provide bank statements showing the required amount of funding has been in the account for the right amount of time. Bank statements must meet the following criteria, or your visa application will be rejected. The bank statement must: If the statements from your bank do not confirm the required details such as transaction dates, you must provide a signed letter from the bank, on letter-headed paper, which confirms the amount of money available to you and the dates it has been held in the account. If you are using the personal bank account of a parent or legal guardian, this must meet the same specifications. It must be a personal account: business or company account statements will not be accepted. As well as their bank statement, you must include these documents: The bank must be recognised and regulated by the financial regulatory body in your country. UKVI will not accept statements from unregulated financial institutions. All bank statements must be in English, or must be accompanied by an official translation. If your money is another currency, it will be calculated in pound sterling (£) using the exchange rate on OANDA for the date of the application. You should print a currency conversion from OANDA and include this with your other documents. Make sure you have the right amount in your account at least a month before your visa application so that you can meet the 28-day rule. Remember that the full amount (your tuition fees and living costs, or as much of this as you are funding) must stay in the account throughout this period. You account balance can't dip below this level at any point. Currency conversions will only be taken at the time you apply, so you should keep slightly more than the required funding amount in your account, in case the exchange rate changes during the 28-day period. We recommend that you keep the full amount of money in your bank account until after your visa application has been processed and confirmed as successful, just in case you receive a visa refusal and need to submit a new application. Paying your tuition fees in advance could save you time in some cases, since this will appear in your CAS within a few days, but you will still need to provide bank statements meeting the 28-day rule for your living expenses. If all or part of your study costs will be funded by an official sponsor, you must provide an official sponsorship letter. Recognised financial sponsors include the UK government, your country's government, the British Council, international organisations, international companies and universities. The sponsorship letter must be issued within the last six months before your visa application. It must include the sponsor's name and contact details, the duration of your funding and the amount of money the sponsor is giving to you, or a statement that your sponsor will cover all of your fees and living costs. If the duration of your funding is shorter than your course, your visa will be granted to the shorter date. If you have a scholarship from the University of Nottingham, you do not need a sponsorship letter from us as this information will be confirmed in your CAS instead. If you are taking a student loan from your government or from a regulated student loans scheme, you must provide an official letter from the loan provider, dated within the last six months before your visa application, confirming a loan in your name for the purposes of study. The financial institution must be regulated by either the Financial Conduct Authority, the Prudential Regulatory Authority or by the official regulatory body for the country the financial institution is in, for the purpose of student loans. Before making your student visa application, check the full guidance on the UK government website on the money you need and the financial evidence requirements. The Student route guidance includes financial evidence requirements on pages 45-50."
        }
    ],
    "pdf_files": []
}