{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Media-Languages-and-Cultures/Media-Communications-and-Culture-MA.aspx",
    "content": [
        {
            "p": "UNM/JPT-R3/0323/7/0005(3/29)MQA/SWA0506 Nottingham Malaysia’s MA in Media, Communications and Culture provides you with the theoretical and analytical training required to continue to a higher education degree or to develop professional skills relevant to working at management level in the fields of media, communications policy and industry. The programme will develop your specialist knowledge of key research methods through specific empirical examples and case studies. The course will increase your understanding and critical awareness relating to the dynamics of media transformation and the challenges this creates within politics, business, public administration and everyday life. Modules challenge students to re-think the conditions of knowledge and the very foundations of European modernity from a postcolonial and decolonial perspective. Using an interdisciplinary approach and drawing upon current research, the programme also aims to equip you with the practical skills to engage with relevant developments and discourses in this field. For example, theories of posthumanism help graduate students understand how thinkers in the humanities and social sciences struggle with contemporary global issues wrought by the Anthropocene: climate change, ecological and environmental damage, and provoke questions on humans’ relationship with technology and other living organisms. The emerging digital and globalised world provides a focus for research that considers a variety of media and cultural forms. Substantive, focused research of this nature is carried out yielding results of great benefit and consequence. The first of its kind in Malaysia, the CSCC aims to bring together local and international scholars to produce results that will inform wider policies. CSCC researchers are dedicated to carrying out interdisciplinary research into the role and politics of communication and culture in this era of globalisation. The School of Media, Languages and Cultures is a dynamic research community providing internationally recognised and respected degrees in culture, media and communications. You will engage with the most up to date, dynamic and forward-thinking studies in the workings of global, regional and local societies. You will learn theories and issues in the fields of postcolonialism, contemporary media, the culture industry and posthumanism that will help you understand the critical role of the humanities and social sciences in thinking through current global culture and issues we face today. The full-time MA Media, Communications and Culture course lasts 12 months and is divided into two semesters and a summer period, and you will take three modules per semester. You will then complete a dissertation over the summer to be submitted in September. If you are studying the course part-time, you can complete this within 24 or 36 months, depending on your circumstances.This course covers the history of contemporary media communications and cultural studies, new forms of political economy and agency in an era of digital media. Some modules cover geography and information infrastructures, the ethics and politics of communication practices, and the symbolic and aesthetic forms of contemporary media. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A relevant second class honours degree (or international equivalent). Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Malaysians applying as a matured student without the standard entry requirements but with substantial and relevant work experience (and have successfully passed APEL’s assessment through Malaysian Qualifications Agency) at an appropriate level may be considered. Admission is at the discretion of the School. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. *Classes are typically held at Semenyih, with modules at KLTC scheduled for part-time students as needed. Graduates from the MA (Media, Communications and Culture) program have gone on to a PhD and academia, education, civil service, research institutes and think tanks, writing, UNHCR, journalism and the media, corporate advertising and careers in civil society organisations. This content was last updated on 09 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}