{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Business/Nottingham-University-Business-School-Research.aspx",
    "content": [
        {
            "p": "The school recognises that the continued intellectual development of our staff is the foundation of excellence in teaching and for the creation of leaders who are able to compete with knowledge, creativity and integrity in a globally competitive environment. Our research clusters at the Nottingham University Business School Malaysia Campus were established to facilitate the exchange of ideas and to explore emerging research issues and areas, as well as to work effectively with industry counterparts and other research organisations. Besides enhancing research networking and collaboration, the clusters better integrate and highlight niche areas and strengths of expertise within the school. NUBS is dedicated to providing the best for all our students: Research excellence - Nottingham University Business School is renowned for its commitment to research excellence. Our faculty is globally recognised for contributions in various fields of business and we are here to guide and mentor our students in their research journey. Interdisciplinary approach - We encourage students to explore the intersection of business with other fields, and disciplines, such as economics, entrepreneurship, and sustainability. We understand that a broad perspective helps to address complex real-world challenges. Global reach - The Nottingham University Business School Malaysia is located in Malaysia, a thriving economic hub in Southeast Asia. You will have the opportunity to conduct research that transcends borders and make a meaningful impact on international business communities. ‘Postgraduate by research’ refers to programmes where students mainly engage in research activities and projects that lead to their thesis or dissertation, in order to obtain their postgraduate degree. Postgraduate research in business refers to advanced academic programmes that allow students to participate in in-depth research on business-related topics that will contribute to new insights and knowledge to the field. The choice will depend on your career aspirations. For instance, a Business and Management MPhil or PhD is suitable for those who are interested in academia, management consultants and finance analysts. Yes, UNM offers scholarships and funding opportunities to support students who are enrolled in our postgraduate business programmes. Explore our courses further to learn more about the admission requirements, research overviews and course content. Our postgraduate research in business programmes provides the knowledge, support, and global perspective you will need to excel. Join us in advancing business frontiers and making a lasting impact on the business world. Jalan Broga, Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}