{
    "url": "https://www.nottingham.ac.uk/student-living/presessional-and-international-foundation.aspx",
    "content": [
        {
            "p": "Courses run on various dates through the academic year at the Centre of English Language Education and the University of Nottingham International College. If you are applying through CELE or UNIC, we are here to help you settle in to your new city. We can help you with single occupancy accommodation. However, for courses that run outside of typical study periods availability may vary and room moves may be required. Agents applying on behalf of students should use the student's own email address. We will send accommodation offers to this address for students to review and accept. All agreements are made between the student and accommodation provider so students must accept their offer themselves. We have the following accommodation available for our pre-sessional students. Visit our Halls of Residence information for full details on our options : 10 week Pre-sessional course starting 3 April 2025 (ending 13 June) - catered hall options across University Park and Jubilee Campus or self-catered options at Dagfa, Varsity, Broadgate Park or Raleigh Park 20 week Pre-sessional course starting 3 April 2025 (ending 12 September) - Self-catered options of En-suite at Melton Hall on Jubilee Campus, Studio and Standard at UPP Broadgate Park, and Standard at Raleigh Park, alternatively catered on campus Hall accommodation will be available until 21 June and students can then transfer to self-catered options over the summer. 10 Week Pre-sessional Courses starting 3 July 2025 (ending 12 September) - Self-catered options of En-suite at Melton Hall on Jubilee Campus, Townhouse Standard on University Park, Studio and Standard at UPP Broadgate Park, and Standard at Raleigh Park 6 Week Pre-sessional Courses starting 31 July 2025 (ending 12 September) - Self-catered options of Premium En-suite and Townhouse Standard at Dagfa 3 Week CELE Academic Skills Induction starting 1 September 2025 (ending 19 September) - Self-catered option of Townhouse Standard at Dagfa. To book accommodation for your pre-sessional course you will need to submit an online application, You will receive a response at least four weeks prior to your course commencing, this will detail your fees for your accommodation for the full duration of the booking. Your offer will start from the date requested and finish on 17 September 2025, if you wish to end your booking before 17 September you can contact us to advise. On the 17th September you will be able to move to your allocated full year accommodation (for students who have booked their 2025/26 accomodation through the University of Nottingham). Look through all the accommodation options. Make sure you understand the criteria of the accommodation guarantee. If you have firmly accepted your offer at the University of Nottingham and have your Nottingham ID, you can apply for accommodation from 1 April 2025 onwards. You will need your Nottingham ID to access the online form and complete registration. You will make a selection based on the following preferences: Once you have submitted your application, you will receive a confirmation email. You will then receive further details of your accommodation offer within four weeks.You will need to accept your licence/tenancy agreement and the terms and conditions which include your full liability for all fees (subject to registering as a full-time student at the University of Nottingham). If for any reason you will no longer be attending the University or do not require your accommodation, it is your responsibility to cancel your accommodation in accordance with the accommodation providers’ terms and conditions. We will guarantee you a room in University-arranged accommodation* for your first year if you: 1. firmly accept your offer of a course place at the University of Nottingham 2. apply to us for accommodation 3. accept your accommodation licence/tenancy agreement and the terms and conditions by the deadline given in your residential offer letter * In order to fulfil our guarantee we may offer accommodation that is not in one of our advertised residences. We may also offer temporary accommodation, or a place in a room shared with another student for a short time. We offer this until we are able to transfer you to suitable permanent accommodation."
        }
    ],
    "pdf_files": []
}