{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/international-students-hub/travelling-to-nottingham-international-student-guide.html",
    "content": [
        {
            "p": "Everything you need to know about travelling to Nottingham once you have reached the UK - a guide for international students. We're delighted that you have decided to us at the University of Nottingham - we can't wait to meet you. But first, we need to get you here. You may have travelled a long way from your home country to the UK, so the last thing you want is to land with your luggage with no travel plans and no idea where to go. We're here to make sure you arrive safe and sound, ready to embrace life in your home away from home. This article will cover: The great news is that Nottingham is easily accessible via public transport from major UK airports and cities, including London, Birmingham, Manchester, and East Midlands Airport. It is likely that you will be flying into one of these cities. There are a few different things to consider when arranging your trip, so it's always best to plan ahead. Some things to keep in mind: Top tip In the UK, ticket prices for trains and buses can vary, depending on the date and time of travel and the day you book the tickets. You may see one price on Monday and a new price for the same trip by Friday, so it is always best to keep an eye on prices. Don’t wait too long, as the prices can rocket as you approach the date of travel – advance tickets are always cheaper. Travelling to Nottingham by train from your arrival airport is usually the most popular mode of transport. British trains are generally comfortable and clean, even if you book a ‘standard’ rather than ‘first-class’ ticket, and there is usually good space for your luggage. There are several different options to book your train tickets, including: Things to remember: While travelling to Nottingham or anywhere around the UK via bus tends to be the most cost-effective option, it will add between 1-3 hours to your journey depending on where you are coming from and which service you use. If you don’t mind the extra time there are a few services you can use: National Express Discount Our partnership with National Express offers a 20% discount on tickets from Heathrow to Nottingham Broadmarsh Bus Station between the 1st of September and the 2nd of October 2022. Find out more at the National Express website. Travelling by taxi is a good choice for your peace of mind – no organizing travel between stations or hauling luggage around with very little pre-planning required. Depending on where you travel from in the UK, it may be expensive to book your own taxi. We offer an airport transfer service, with fixed-price transfers provided by a trusted local taxi firm. DG Cars provides a private hire service from airports across the UK that will take you directly to your university accommodation. If you would like to book this service, you can either: You will need to provide them with the following information: You will have to pre-book and pre-pay for this service and you will be met at your arrival terminal by the driver with a name board to pick you up. (Just like the star that you are!) Transfer fees: The table below may help you plan your journey to Nottingham from our major cities and airports. These details may vary depending on the travel routes and times of the day. Approximate journey time London Heathrow (LHR) 4 hours by coach (from Victoria Coach Station) or 2 hours by train (from St Pancras International) Transport for London Heathrow Airport London Gatwick (LGW) Gatwick Airport Stanstead Airport (STN) 3 hours by train or 5 hours by coach Stanstead Airport Luton Airport (LTN) 2 hours by train or 3 hours by coach Luton Airport Birmingham Airport (BHX) 2 hours by train or 2 hours by coach Birmingham Airport Manchester Airport (MAN) Manchester Airport East Midlands Airport (EMA) 45 minutes by the Nottingham Skylink bus arriving at University Park Campus or Nottingham city centre East Midlands Airport You are almost here! You’re finally on the last leg of your epic journey, and you’ve made it to Nottingham. You’re on the home straight – congratulations! Just one last bit of travel until you reach your new home. When you’ve arrived in the city, getting to campus is easy. Whether you arrive at East Midlands Airport, Nottingham train station, or Nottingham city centre, there are a few easy ways to travel to our campuses: Our campus maps and directions will help you find your final destination, so you can book your travel. International Students Discover all the relevant information related to studying in the UK. Once you have an unconditional offer from a university, or you have met the requirements they have given you, apply for the relevant visa. Most students coming to study full-time in the UK need a student visa. You will also need to complete the form and make the payment for the healthcare surcharge. Coming to the UK as an international student is a fun adventure with lots of chances to learn and grow. Enjoy the British culture, get involved with the university community, and ask for help when you need it. UON Everything international students need to know about how to register for NHS healthcare while studying in the UK. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}