{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Politics-History-and-International-Relations/Politics-History-and-International-Relations.aspx",
    "content": [
        {
            "p": "There has never been a more relevant or exciting time to study politics and international relations. Economic globalisation, social mobility and rapid changes in domestic, regional and global politics increasingly impact on our daily lives. The School of Politics, History and International Relations is part of a global university with a thriving international student body, providing a unique environment for studying international relations. Our staff are internationally trained educators engaged in a broad range of cutting-edge, policy-relevant and curiosity-driven research. We aim to provide students with a comprehensive understanding of the complex dynamics that shape our world and empower them to critically analyse past events and current international issues. As such, our students engage with policymakers from international organisations and the public sector, and can also benefit from a range of internship and study abroad opportunities. There has never been a more relevant or exciting time to study politics and international relations on an Asian campus. Economic globalisation, social mobility and rapid changes in domestic, regional and global politics increasingly impact on our daily lives. International relations studies the complex relations between and among states, development, societies, individuals, identities and cultures in areas such as economics, law, politics and security. It considers some of the most burning questions of the day,such as: how power and resources are allocated on the international stage, where and when power is exercised and justified, who power is exercised for, and why it is exercised in the way it is. It also investigates deeper questions relatingto how we understand and conceptualise contemporary global transformations. View our undergraduate degree programmes. Our faculty members are distinguished and passionate educators, renowned in their respective fields. Students can be rest assured that they will be taught by experienced lecturers and professors who can bring a wealth of expertise and diverse perspectives to the classroom. We are committed to providing all our students with a supportive and intellectually stimulating environment that fosters critical thinking, guiding them towards success in their chosen field. Political science is the study of political systems, institutions, and behaviour at domestic and international levels. History looks at past events, cultures, and societies to gain insights into human experiences, which helps us understand how they have shaped the present. International relations explores the interactions between nations and international organisations in the global arena. Yes, our undergraduate programmes provide students with a strong foundation, which prepares students for advanced research and specialisations at the graduate level. Related master's and doctoral degrees at UNM include: International Relations MA, and International Development Management MSc These courses are effective for developing critical thinking, research and communication skills, and cross-cultural understanding. Students with these skills will be better able to analyse complex problems, understand diverse perspectives, engage in informed discussions and make informed decisions in both their professional and personal lives. Additionally, these skills are transferable and valuable in many professional settings, and as a result, graduates of these courses are highly employable. Yes, we offer several scholarships for students who are doing well academically. There is also financial aid for deserving students. International relations courses are suitable for individuals who are interested in understanding global affairs, politics and the interactions between nations. Thus, this course is for you if: You’re passionate about global issues. You’re an aspiring diplomat or policymaker. You’re interested in working for international organisations like the United Nations or World Bank. You’re interested in global business and trade. You’re interested in journalism and media and passionate about reporting on global events, conflicts, and international relations. You are interested in academia and research in this field. You want to develop a global perspective. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}