{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/life-in-nottingham.html?title=TGlmZSBpbiBOb3R0aW5naGFt&variant=bGlmZUluTm90dGluZ2hhbUpzb25QYXRo",
    "content": [
        {
            "p": "Welcome to Nottingham! It’s known for its role in the Robin Hood legend and for the hilltop Nottingham Castle Museum and Art Gallery, rebuilt many times since the medieval era. In the Lace Market area, once the centre of the world’s lace industry, the Galleries of Justice Museum has crime-related exhibits. Wollaton Hall is an ornate Elizabethan mansion with gardens and a deer park. If you're thinking of coming to to study in Nottingham, the first question people ask is: “what’s good about Nottingham?” Why should I go there and not any of the other destinations across the UK? What does Nottingham offer me as an individual? We asked our international students and staff how they maintained their connections to home whilst living in Nottingham. Take a look at their recommendations for restaurants, food shops, and religious or community groups that cover the globe. Nottingham is an eclectic and diverse city that’s home to so many hidden gems! The city has evolved considerably over recent decades, changing with the times and becoming much more cosmopolitan with an open-door policy for things that are exciting and new. Nottingham is famed for its links to the legend of Robin Hood as well as its lace-making heritage, 11th century Nottingham Castle and famous names like Raleigh bikes and Boots. It was granted its city charter in 1897 as part of Queen Victoria's Diamond Jubilee celebrations. Nottingham is a friendly city and our campuses are safe places. The city has held Purple Flag status since 2010 which indicates that Nottingham is one of the best and safest places for a night out in the UK. There’s a reason that 47,000 students from over 150 countries call our university home! If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}