{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/sport-and-societies/societies-and-clubs.html",
    "content": [
        {
            "p": "Nottingham’s Student Union is home to more than 300 societies and over 70 sports clubs, there’s something for everyone. Nottingham’s Student Union is home to more than 300 societies and over 70 sports clubs, as well as student media groups, student-run services, and student networks. So, there’s guaranteed to be something for everyone. One of the best things about going to university means you can give something new a whirl, whether that's trying out a new sport or volunteering for a cause that means a lot to you. Joining a society or sport is a great way to make friends outside of your course while still being part of a like-minded community. If you already enjoy sports or are interested in taking up a new one, we have 70 sports clubs to choose from. There are loads of opportunities to keep fit, build friendships, and try something new. From aikido to windsurfing, motorsport and trampolining, there are so many interesting and exciting clubs to join. To find out what else is on offer, visit our A – Z activities list. There are plenty of sporting events to get involved with throughout the year, including BUCS, Intramural Sports, Just Play, Leadership Academy, Inclusive Sports and the famous Notts Varsity competition. You can even start your own sports club if we don’t currently offer one that you’re interested in. Whether you want to celebrate your love for cake or need a space where you can speak about your culture, we have over 300 student groups to choose from, each offering a safe, welcoming, and exciting space for every student. Plus, you can create your own society should you wish. To find out what is on offer, visit our A – Z activities list. Our student networks provide exciting opportunities to meet like-minded people, make new friends, support one another and help shape equality, diversity and inclusion at our university. Meetings and social events take place throughout the year in an informal and relaxed environment. Many network members find a great deal of support from the students they meet, which they in turn can provide to others. We have a variety of student-run groups to get involved with, including Impact Magazine, Nottingham’s official student magazine, and URN, the University of Nottingham's multi-award-winning student radio station. We also have student healthcare societies made up of medical, nursing, midwifery, physiotherapy, and sports rehabilitation students. You can join them whether you’re based at QMC, Derby or a different campus, and make the most of their full activity and social calendars. To join a sports club or society, visit their page via the A – Z activities list and log in using your university account. You will then be able to make a card payment online and receive all the necessary information about your new club. Alternatively visit the SU Box Office, located in the Portland Building, to join in person - card and cash payments are accepted. All our clubs and societies are run by a committee, and you can apply to be on the committee of your chosen club or society each academic year. A committee is a team of people that lead, organise and publicise a group within the Students’ Union. Being part of a committee can be rewarding as well as a great way to gain experience and invaluable skills for your future career. Absolutely. Most societies and sports clubs are active on social media, and you can find their handles via their page on the A – Z activities list. Social media is a great way to stay informed about what’s going on within your chosen club or society so we recommend connecting with them if you can. For more information about your Student Union and how to join a club or society, check out the SU website. Scholarships and bursaries Discover information that may help you fund your study at the University of Nottingham. Competitive funding opportunities based on a range of factors, such as financial need, academic potential or non-academic skills Non-competitive, guaranteed funding for eligible students If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}