{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Agricultural-Business-Management-BSc-Hons-U6UAGBSM.html",
    "content": [
        {
            "p": "Sutton Bonington Campus, Leicestershire, UK Combine the latest agricultural science with business and technology developments. At Nottingham we take an applied approach. You will learn how to use the science of agriculture to sustainably tackle global challenges, such as: You’ll get to see current practice round the UK through external visits, guest lectures and the Agronomy Field Course. Bring together your understanding of agronomy, livestock and business principles to develop management plans for real farms. Mandatory Year 1 Academic Skills Agricultural Business in the Global Economy Environmental Science and Society Geographical Information Systems for Environmental Monitoring Principles of Ecology Regenerative Agriculture Sustainability in Agricultural Systems The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Wednesday 2 October 2024. Due to timetabling availability, there may be restrictions on some module combinations. In your first year, you will take 120 credits in core modules. As a guide, one credit equals approximately 10 hours of work. You will spend around half of your time in lectures, seminars and practicals. The remaining time will be independent study. Core modules are typically taught by professors or associate professors. PhD students may support teaching on some modules. Careers advice Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). Sutton Bonington Campus combines world-leading laboratories with a countryside location, just a few miles from the city of Nottingham. The campus is home to over 2,500 biosciences and veterinary medicine students. I chose this course at Nottingham as it balanced my passion for agricultural production with business and entrepreneurial aspects. The modules I’ve undertaken have been specifically tailored to rural and agricultural settings, whilst still being relevant and desirable to business and employers outside of agriculture enabling me to pursue a diverse range of career opportunities. Chloe Dunne BSc Integrated Agricultural Business Management 2019 56% say staff value students views and opinions about the course Data for courses in Agriculture at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Science Entry requirements BBB UCAS code D400 Duration 3 Years full-time Start date Sep 2025 If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}