{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/central/our-farm.html",
    "content": [
        {
            "p": "Discover the farming facilities at the University of Nottingham You may have chosen your degree because of your interest in the science behind animal and crop production, have a desire to lead change and manage a business in our ever-changing rural industries, or even harbour a passion to be a part of the solution to the global food security crisis. Whatever your reasons were, as an agricultural sciences student, you will get that hands-on knowledge and close feel of the domain through field course modules to develop your practical skills and experience, and enable you to follow any number of different career paths. With 445 hectares (1,100 acres) of land, we provide facilities for teaching and research while producing over 2m litres of milk a year, lambs from a grass based grazing system and a range of field crops, including milling and feed wheats, oilseed rape, maize, beans and triticale. The farm has areas of stewardship land, including field margins, beetle banks and ponds as well as extensive areas of woodland. We use the farm in our undergraduate programmes in agriculture, and the farm office is based on the Sutton Bonington Campus, with the main land holding and University Dairy Centre nearby. The farm has 446 hectares (1100 acres) based across three land centres: Sutton Bonington 221 ha (545 acres); Bunny Park 160 ha (395 acres); Clifton 65 ha (160 acres). The main Sutton Bonington site is located on the edge of two national character areas: the Trent Valley Washlands and the Leicestershire and Nottinghamshire Wolds. Across the farm there are a wide range of soil types, including sand, clay, alluvial and loam-based soils. The farm is within a Nitrate Vulnerable Zone and has environmental features including ponds, beetle banks, field margins, nesting boxes and mature and new woodland areas. → precipitation: approximately 600 mm per year → summer rainfall: typically between 20 and 30 rain days → wind: annual averages 2005-2009: between 3.5 and 4 metres per second, gusts average 7 m/s → height: circa 25m (Clifton) to 50m (Bunny Park) above sea level. → Sutton Bonington: 35-45m Ready to take the next step? Head over to UCAS and accept your offer and start planning for the future. Top Tips Within our top tips and advice hub, you'll find information associated with applying and studying at the University of Nottingham. Faculty of Arts Second-year student Max shares a typical day... School of Health Sciences We spoke with Daniel, who explains what life is like as a health sciences foundation student. At Nottingham, around 50% of your course is practice-based. Giving you the chance to gain real-life clinical experience of midwifery care. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}