{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Biosciences/School-of-Biosciences.aspx",
    "content": [
        {
            "p": "The School of Biosciences at The University of Nottingham Malaysia shares close teaching and research collaborations with the University of Nottingham UK. Alongside a commitment to innovative teaching, the School of Biosciences is an internationally-recognised leader in sustainable agriculture, food and nutrition security, as well as modern therapeutics for health. The latest UK Research Assessment Exercise (RAE) confirmed the School’s top position in our research areas. The Malaysia Campus is expanding its research portfolio to address global challenges, focusing on the United Nations Sustainable Development Goals (SDGs). Our presence in Malaysia allows us to conduct significant research projects on climate-resilient crops, underutilised crops for food security, food safety, waste management, medical biotechnology for diseases, molecular drug discovery, and other areas. Biosciences at Nottingham encompasses a range of disciplines as diverse as the environment and its protection; the growth, development and reproduction of plants and animals; the production and preservation of agricultural and food commodities; biotechnology, microbiology, ecology, genetics, health, nutrition, and the interrelated areas. Biosciences play a crucial role in understanding the fundamental of life processes and developing new technologies, processes, approaches to improving human health, and addressing environmental challenges. The programme consists of core and optional modules. You will get the opportunity to choose a variety of optional modules based on your interests. Additionally, you will complete a year-long research project during your final year. The research project encourages and develops your critical thinking. You will conduct independent research – including a literature survey using the library with access to e-journals – and undertake data handling, analysis and interpretation. You will carry out your project under the supervision of a research-active member of academic staff, and benefit from the supportive environment we provide. Students who enrol in a bioscience programme at UNM will have access to state-of-the-art facilities and well-equipped laboratories necessary for hands-on experience and to conduct groundbreaking research. Our facilities include advanced research laboratories, specialised equipment, science labs, computer labs, bioinformatics resources, libraries, databases and collaborative spaces. UNM’s facilities are regularly maintained to ensure a stimulating and supportive learning environment. Our faculty members are renowned experts in their respective fields. They have extensive experience in research, industry, and teaching. With their commitment to nurturing the next generation of scientists, students will receive a well-rounded education in and out of the classroom. Our faculty members are actively engaged in research, contributing to scientific advancements and pushing the boundaries of knowledge in biosciences. Students who enrol and graduate from a bioscience programme are well-equipped to pursue careers in biotechnology and pharmaceutical industries, healthcare organisations, environmental and conservation organisations, research and academic institutions and government agencies. The skills and knowledge gained during their studies are widely applied in various industries including food and beverages, agricultural and plantation, healthcare products and services, renewable and clean energy, wastewater management, chemical, among others. Yes, the University of Nottingham Malaysia offers various scholarships and financial aid options for eligible students, including those pursuing bioscience programmes. While it is possible to directly pursue a PhD after completing your undergraduate qualification with first class result, some research experience or a master’s degree is generally recommended before pursuing a PhD. This ensures a stronger foundation and research expertise in your chosen field. Postgraduate bioscience programmes available at UNM include Biotechnology MSc and Biosciences MRes/MPhil/PhD. The specific entry requirements vary depending on the programmes and level of study. However, undergraduate Bioscience programmes in Malaysia generally require a relevant pre-university qualification. Students who have just completed secondary or high school can enrol in UNM’s Foundation in Science for a direct progression to degrees offered by the School of Biosciences. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}