{
    "url": "http://www.nottingham.edu.my/Study/Undergraduate-courses/Biosciences/Biotechnology-BSc-Hons.aspx",
    "content": [
        {
            "p": "UNM/JPT-R3/0512/6/0008(8/29)MQA/SWA0157 This degree in Biotechnology is designed to expose students to the fundamentals and specific skills of the industry. It places emphasis on the application of advances in biotechnology to address global issues. Students will learn the key concepts and techniques in microbial, plant, and medical and pharmaceutical biotechnologies to address modern-day problems in healthcare, industrial, environmental, renewable energy, crop and food production. With that, our programme is designed with a focus on 3 key areas of biotechnology: Industrial biotechnology which sits at the core of the programme linked with plant biotechnology and medical/pharmaceutical biotechnology. Topics covered include genomics and proteomics, genetic engineering of microorganisms and crops, food hygiene and safety industrial bioprocesses and bioproducts, pharmaceuticals, and various others. At UNM, our programmes are delivered through interactive teaching methods as well as the use of various pedagogies and digital formats to suit the needs of our students. With carefully designed programme content and assessments, students are steered to become independent learners and critical thinkers to innovate into the world of tomorrow. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 77% average based on 6 subjects including 2 science-based subjects such as Biology, Chemistry, Physics or specific subject in mathematics Consideration to be made based on relevant individual grades if specific subjects are required. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. In addition to the entry requirements listed above, applicants must have at least a credit (normally grade C) in mathematics at SPM/GCSE/IGCSE/ High School Diploma or equivalent for an entry to Biotechnology. This requirement can be waived if applicants have obtained similar or equivalent grade at a higher level. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Science is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Science. This rigorous programme provides students with a strong academic background that will result in enhanced language, mathematics, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as chemistry, ecology, computer programming or psychology. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Nottingham’s Biotechnology graduates are highly sought after worldwide. The vast majority of our students secure employment within 6 months of graduation or continue with further studies. Biotechnology graduates go on to work in a diverse range of roles and markets with job titles such as; Research Scientist, Scientific Analyst, Project Manager, Consultant, Educator and Advocator in both the public and private sectors. Alternatively, many of our degree graduates who pursued academic excellence opted to further their postgraduate study within the Schools’ postgraduate (MRes / MPhil / PhD) programmes. Biotechnology offers numerous future opportunities for those interested in the field. As a biotechnologist, you can work in various settings such as clinical laboratories, regulatory bodies, private companies, and government agencies. Following are some career options for students who graduate with a biotechnology degree: The promising benefits of biotechnological innovations have prompted the Malaysian government to take initiatives in creating a favourable ecosystem for the growth and advancement of the industry. In 2022, an announcement was made regarding the implementation of the National Biotechnology Plan 2.0. This strategic plan aims to harness the strengths of biotechnology to propel Malaysia towards achieving a high technology status by 2030. The plan specifically focuses on vital areas such as agriculture and food security, healthcare and wellbeing, as well as the industrial and circular economy. These efforts demonstrate the government's commitment to nurturing the biotechnology sector and utilising its potential for the overall development and progress of the country. Yes, the BSc (Hons) Biotechnology programme at UNM incorporates industrial training or internships to provide practical experience and exposure to real-world applications of biotechnology. Yes, upon completion of this programme, you can consider pursuing postgraduate studies such as MSc Biotechnology or Biosciences MRes/MPhil/PhD programme at UNM to further enhance your expertise and research capabilities. Yes, the university has various scholarships and financial assistance schemes for deserving students. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}