{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Psychology/School-of-Psychology.aspx",
    "content": [
        {
            "p": "Over the past two decades, psychology has become one of the most popular degree topics in the world. It is a fascinating subject that helps us to understand the ways in which our minds, brains, relationships and societies work. At our Malaysia Campus, we have first class facilities and talented scholars working on cutting-edge research. We also enjoy connections with other leading universities across the world and undertake collaborative research with a range of partners both locally and internationally. Our research spans nine themes: Active vision research investigates the way the brain handles visual information and focuses on visual cognition and visuomotor coordination in humans and apes. Visual ecology research examines how visual perception and cognition are determined by people’s knowledge or prior expectations about the characteristics of their living environment. Face and object processing research investigates the way our visual system processes and recognizes complex visual stimuli, such as faces. Evolutionary psychology research revolves around the idea that theories from evolutionary biology can shed light on human psychology. Among other things, it focuses on the evolutionary origins of altruistic behaviour and human sex differences. Memory research investigates the biological and cultural factors influencing the development of autobiographical memory across the lifespan and examines the role of autobiographical memory in the development and maintenance of depression and posttraumatic stress disorder (PTSD). Language and development research includes multilingual processing in adulthood, interactions between language acquisition and other aspects of cognitive development, differences between monolingual and multilingual language acquisition, and the role of the learning environment on lexical acquisition. Autism research focuses on intercultural differences in behaviour and cognition in Autism Spectrum Disorders (ASD). ASD characteristics and attitudes towards ASD are studied in individuals with and without ASD. Ageing research aims to identify factors that predict healthy brain ageing across ethno-regional groups. It examines and compares risk and protective factors for dementia, cognitive and functional decline cross-nationally through international data sharing and harmonisation. Human-factors of Sustainability research focuses on various psychosocial factors that underlie the current issues associated sustainability and livability and attempt to provide adequate solutions for them using the scientific method. Entry requirements vary depending on the course you decide to enrol in. Generally, applicants are expected to have a bachelor’s degree from a recognised institution, preferably in psychology or a related field. While applications are considered case by case, you may have to meet the required minimum GPA, relevant coursework or prior experience in psychology. You may also need to submit letters of recommendation and meet the English language proficiency requirements. The duration depends on the programme and whether you’re a part-time or full-time student: Full-time students Psychology MRes - 1 to 2 years Psychology MPhil - 1 to 2 years Psychology PhD - 3 to 4 years Developmental Disorders MSc - 1 year Part-time students Psychology MPhil - 2 to 4 years Psychology PhD - 6 to 8 years Developmental Disorders MSc - 2 years Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}