{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Applied-Mathematics/School-of-Mathematical-Sciences.aspx",
    "content": [
        {
            "p": "Data science and business analytics, collectively known as data management, are major components of Industry 4.0. Today, many industries around the world including agriculture, manufacturing, trading, healthcare and finance are rapidly evolving into data-driven economies. Thus, data scientists and business analysts are in high demand to meet the needs of the industries. The School of Mathematical Sciences offer two undergraduate degrees: BSc Mathematics and Data Science and BSc Mathematics and Management, and these programmes aim at preparing students for careers in data science and business analytics respectively. It is foreseeable that future organizations, private or government, will require data management to identify trends and patterns in the behaviour of the public. For the tertiary sector, the identification of these trends is crucial when making decisions on the launching of new products and services, as well as when using risk management to minimize loses. The latter is especially important to banks which have considerable investments. For the healthcare industry, data management allows for a more accurate, faster and cheaper diagnosis using artificial intelligence, for example medical prescriptions can be generated for medicine collection. For the secondary sector, the efficiency of the systems in the manufacturing industry can also be maximized through the use of data management to identify wastage. For the primary sector, the harvesting of goods such as growing of crops and fishing can be maximised or sustained with the use of data science. Data management allows for a prediction of the crop yield on a plot of land given the soil content and water level, and also helps in preventing overfishing to ensure sustainable fish stocks. As for the authorities, the trend in the daily behaviour of the public is important in maximising the efficiency of the public use of infrastructures and enforcing of the laws to prevent both financial and personal crimes. In addition, data management is useful in improving military intelligence gathering capabilities and enhancing the prediction of the occurrence of natural disasters to minimize the impact. In other words, data management touches every aspect of life of everyone, from farmers to merchants to law enforcers. Given the importance of data management in the global economy, our school is offering two undergraduate programmes which help pave the way for careers in data science and business analytics Although industrial training is not a compulsory module under the current course structure, students are encouraged to look for a placement opportunity during the summer vacation after second year of study. Industrial training provides a great way to help students identify top career prospects and enhance their soft skills. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}