{
    "url": "https://www.nottingham.ac.uk/studentservices/support/financialsupport/managingyourmoney/month-by-month-money-management-tips.aspx",
    "content": [
        {
            "p": "Click the boxes below for ideas and tips on managing student finance month by month across the academic year. Please note, this guide is aimed at students who start study in September. Put together your budget – Use a budget planner to get a head start on your finance for the year. Familiarise yourself with the information available from the University about managing your money and budgeting. Remember to budget for costs seven days a week, including weekend activities or work/studying. Open a student bank account – if you haven’t already, look for the best offer for you personally. This may include arranging an interest-free overdraft. Travel options – Will you be travelling regularly? It may be worth purchasing a National Rail 16-25 Railcard Look for work – need to up your income? Part time work alongside studying will increase your income, as well as boosting your skills and CV. Have a look at the University of Nottingham careers service for inspiration and advice, including jobs available on campus. External sources of funding – Some educational trusts and charities offer financial support to home, EU and international students. First student loan payment – Check the date your first payment is due. If you are a first-year student you need to register in person as well as online, and your first payment is likely to be 5-6 working days after the date that shows on your letter/online account. For other students, your first instalment will be paid on the first day of term, if you have completed registration on time. Remember that the next instalment will be paid in January. Seasonal food – carrots, what can’t they do? Use them in bolognaise, soups, stews, casseroles, salads. Don’t forget to look at the wonky/imperfect veg section for additional savings. Books and course materials – You may have increased costs at the beginning of your course for books and course materials. Don’t forget to budget these in. Visit the libraries service to see if you can borrow rather than buy books to cut your spending. Did you know that the University of Nottingham libraries has an Interlibrary Loans service, allowing you to access resources from libraries across the world? Council tax exemption – Full time students are exempt from paying council tax. More details available on the Students’ Union advice student council tax page Household bills – if you’re living in a shared accommodation off-campus, you may be responsible for bills. Check your tenancy agreement to understand the responsibility of household members and the landlord. Speak to your housemates at the beginning of term to agree how to manage, split and pay bills. Don’t forget to take meter readings when you move in. See our paying household bills page and moodle course for our top tips on managing bills. There is extensive advice on housing available at Students’ Union advice housing Get insured – it is strongly advisable to get insurance for your household items and anything you will be using outside your home, such as laptops or bicycles. Shop around for the best deal for your personal circumstances. Get licensed – you need a TV license to watch live TV, whether this is on a television set, laptop, mobile or tablet device. You also need one if you use catch up services and live streaming. Failure to have a licence could result in a fine. Get your Totum card – useful for student discounts at a range of retailers. Shopping loyalty cards – Have you scoped out the supermarket(s) you’re going to shop at regularly? See if they have loyalty cards to rack up points and/or discounts. Our cost of living page has information on cheaper food options and free kitchen access. Bus/Tram Passes – Travelling locally? Local travel companies offer annual student bus passes which can work out much cheaper than individual journeys. Large local providers include NCT, NET and Trent Barton. Don’t forget about the free hopper buses for travel between campuses. Seasonal food – apples. Add to your bag for an easy and nutritious snack on the go. At home, slather apple slices in peanut butter for a tasty and protein rich studying snack – trust us, it’s delicious! Cold weather – as the weather begins to get colder and darker, think about the impact this may have on your bills and budget accordingly. There are study spaces across University Buildings (including libraries) which can be booked. Struggling for money? – If you are struggling for money or have an unexpected expense speak to the funding and financial support team to see if you are eligible for any bursaries or support funds. You can also contact Students’ Union advice for individual information and support. Seasonal food – leeks. Make a warming batch pot of potato and leek soup, which you can freeze in individual portions for a quick and easy winter meal. Christmas – if you celebrate Christmas consider the impact on your budget. Socialising, presents for loved ones and travel home can all add up. It’s important to celebrate important times in life but consider the impact at the end of that long loan period. Seasonal food – pears. An easy snack which are a good source of fibre, vitamins C and K and high in potassium. Second student loan pay date – you should receive your second instalment in January. Remember that the next payment will be in April/May, so budget accordingly. Seasonal food - oranges. Packed with vitamin C which boosts the body’s immune system. Next year accommodation – if you’re continuing study next year then it’s time to look for your next place to live. This is exciting but should come with careful consideration. For more advice, see our moodle course on shared living. Students’ Union advice have lots of information on housing and can offer advice around a variety of issues including money and housing. Seasonal food – Cauliflower. Gone are the days of soggy boiled cauliflower, try making a fritter or delicious vegan bang bang cauliflower dish. Apply for next year’s funding – Continuing or returning student? You need to reapply for student funding each year. This usually opens in March. Student finance England Student finance Scotland Student finance Wales Student finance Northern Ireland Seasonal food – spinach. An iron powerhouse, add to pasta, curries, lasagne or salad dishes. Second student loan pay date – you should receive your third instalment in April/May. This will be your last payment for this academic year. Graduating this year? – Contact the careers team for advice and guidance on your next steps, including managing your money between finishing University and starting employment. Seasonal food – look out for new potatoes. Delicious and versatile, cook up a batch that can be eaten warm or cooled and added to salads. Moving out – if you are leaving a property, ensure you have checked all meter readings and sorted final bills with utility providers. The Students’ Union Advice provide a handy moving out guide Seasonal food – tomatoes. Another versatile item, whip up a delicious summer salad with mozzarella, add to sandwiches or make some spicy salsa. Working over summer – if you can, working over the summer is a great way to up your income ready for the next financial year. Depending on your individual circumstances, try to pay off any outstanding credit, including overdrafts. Any additional income can be saved for the next academic year to help with bills or unexpected costs. Seasonal food – broccoli. Add to stir fries for a boost of iron and fibre."
        }
    ],
    "pdf_files": []
}