{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/country-info/countryinformation/azerbaijan.aspx",
    "content": [
        {
            "p": "Unlock your potential at a world-leading university with a truly international student community. Students studying Svidetel'stvo Srednem Obrazovanii / Secondary School Leaving Certificate (grade 11) are typically required to complete a Foundation course. We offer foundation courses for international students who are not qualified for direct entry to our undergraduate degree courses. These courses are available at the University of Nottingham International College, just next to University Park Campus, in partnership with Kaplan International Colleges. Find out more about the courses, entry requirements and progression options on Kaplan's website: Applications and enquiries for these courses are handled by Kaplan and the college. International foundation courses Full-time courses across our five faculties typically last for three to four years, although some degrees such as medicine and architecture have a longer duration. Applicants from Azerbaijan are typically required to successfully complete a foundation programme. However, if you have completed 1 or 2 years of study at a recognised institution, you may be eligible for year one entry and we can typically accept grades ranging from 3 to 5. Our Undergraduate Prospectus lists entry requirements for A levels and International Baccalaureate students for each course. Students taking APs or SATs should refer to our entry requirements for the USA. We offer a wide range of postgraduate masters degree programmes across our five faculties. Full-time masters courses typically last for one year. Applicants should hold a specialist diploma or bachelor's degree of a good standard from a recognised university, usually in a relevant subject area. Check course details in our Postgraduate Prospectus to see whether your chosen course requires the equivalent of a First Class (1st), Upper Second Class (2:1) or Lower Second Class (2:2) degree. Our entry requirements for degrees and specialist diplomas from Azerbaijan universities vary depending on the university where you have studied and the course you are applying for at Nottingham. The summary below is provided as guidance but requirements may vary for individual courses and we do require higher grades from some universities. How to apply Search for courses English language requirements Our PhD courses, available across a wide range of subject areas, typically include three years of full time research followed by an optional writing-up period of one year to complete your thesis. A masters (Magistr) and bachelors (Bakalavr) degree or specialist diploma from a recognised university are usually required for PhD entry. See the masters section for guidance on the grades we typically require from Azerbaijani universities. These will vary depending on the university where you have studied and the course you are applying for at Nottingham. You should identify possible supervisors at Nottingham before applying and prepare a research proposal to submit with your application. Commonwealth of Independent States Undergraduate Excellence Award Commonwealth of Independent States Postgraduate Excellence Award Chevening Scholarships International Sporting Excellence Award Sports scholarship packages Find out more about tuition fees Graphic adapted from FreeVectorMaps.com Find out more about student life Contact Lauren Murphy lauren.murphy@nottingham.ac.uk Our official representatives in Azerbaijan can assist you with applying for our courses, visa processes and preparing to study with us. About our overseas representatives We regularly travel to countries around the world to meet with prospective students and their families, visit schools and to attend education fairs and other events. Meet us overseas You are also very welcome to visit our campuses in Nottingham for an open day or an independent visit. Visit us in Nottingham Contact us by email or telephone Connect with us on social media International Student Life blog Azerbaijanian Society"
        }
    ],
    "pdf_files": []
}