{
    "url": "https://www.nottingham.ac.uk/studywithus/visitingus/campus-tours.aspx",
    "content": [
        {
            "p": "Explore University Park Campus and discover our award-winning green spaces, iconic Trent Building, impressive libraries, boating lake and loads more on one of our student-guided tours. We are unable to enter subject-specific facilities on the tour, although we will indicate several of these locations from the outside. Our next campus tours will take place on: The tours run from 11am until 2pm on a drop-in basis. While the event starts at 11am, you can drop-in at any point during this time, with the last tours leaving at 1.15pm. Campus tours last approximately one hour. You may be able to speak to an academic as part of your visit. Academics from a number of subjects have made themselves available to chat to visitors on these dates. If you would like to check if there will be an academic available to speak to you in your chosen subject area, please email opendays@nottingham.ac.uk. Book your campus tour We are currently unable to offer tours of Jubilee Campus or Sutton Bonington Campus for the below subjects. However, you are welcome to visit these campuses independently. You can explore the spaces yourself using the self-guided tour for Jubilee Campus and Sutton Bonington Campus. Equally, you are welcome to attend a University Park Campus tour, regardless of your chosen subject. The accommodation and facilities available at University Park Campus are available to all students at the University of Nottingham. Subjects taught at Jubilee Campus and Sutton Bonington Campus, that we are unable to offer campus tours for: You’ll learn all about what it’s like to live and study at the University of Nottingham. And although you won’t be entering accommodation, you’ll get a good idea of life on campus – so it’ll be easy to imagine yourself here. For specific information about your chosen course, check out our on demand talks. You can also chat to a student about your subject, and find out all you need to know about student life. Want to know what living here would feel like? Explore our halls of residence online and find your home from home. Our grounds are always open to the public, so if you can’t attend one of our tours, you can still explore our campus. Do bear in mind though that you won’t be able to go inside any halls of residence or some teaching buildings. On the web pages below, you can find the recommended route around our campuses, with some information about the buildings you'll visit: University Park Campus self-guided tour Jubilee Campus self-guided tour Sutton Bonington Campus self-guided tour Even if you’re not able to visit us in person, there are still lots of ways to find out what life here on campus is like. You can: Access over 150 talks and tasters on Open Days on demand Explore campus with our virtual tour Connect with us on social media Please contact us at opendays@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}