{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/social-sciences.html",
    "content": [
        {
            "p": "Discover what it's like to be a student in the Faculty of Social Sciences at the University of Nottingham. The Faculty of Social Sciences is one of the largest and most diverse in Europe, with seven different schools with teaching and research varying across a wide range of topics, theories and methods of analysis. Our faculty includes the following schools: Tanmay takes you through a typical day at the University of Nottingham Follow Tanmay, a first-year management student, as he guides you through his day. From breakfast and badminton on University Park Campus, to catching the hopper bus to Jubilee Campus for lectures. Business School Get a feel for life on campus Faculty of Social Sciences Obtaining sufficient information is crucial to making the best choice for your desired course and university. Deciding on the right course and university for you is a significant decision, so it is essential that you have as much information as possible to make an informed choice. From communities and societies to field trips and volunteering projects, find out what it's like to study education at the University of Nottingham Choosing the right course for you At the University of Nottingham, we offer the freedom to shape your own learning and physical experience while providing support and guidance throughout your journey. Our courses cover a wide range of modules that are designed to expand your subject knowledge and provide an engaging learning experience The benefits of a professional placement are numerous. By participating in a placement, students can gain a wide range of skills that are directly applicable to their chosen career and enhance their knowledge and expertise in the subject. Explore the world, create connections and develop skills to excel in your career We have passionate staff, exceptional facilities and a plethora of learning opportunities to further develop a deep understanding of the topic you love. Our renowned reputation, status and high-quality learning experience will set you apart and onto a bright and successful future. School of Business Teaching that inspires...Nottingham University Business School researchers are involved in a world-first trial to track the entire leather production process using blockchain technology to trace the material from start to finish. At the University of Nottingham, we offer a warm and safe community that allows you to be yourself, find your feet and have a great time. School of Economics The employability and high-earnings of Nottingham’s economics graduates Our unique, engaging and flexible learning experience is the best place to explore your academic and personal development alongside other curious and like-minded individuals. A degree that offers flexibility, choice and exploration, no matter your interests or goals. We are a reputable institution with a strong academic standing that provides students with a valuable education, opening opportunities for them in the future. Browse our undergraduate prospectus or head back to the homepage and we'll help you find relevant study options, tailored information and advice to become a student at the University of Nottingham."
        }
    ],
    "pdf_files": []
}