{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/ielts/appeals/appeals.aspx",
    "content": [
        {
            "p": "If you wish to appeal against your IELTS test results you need to follow the ‘Enquiry on Results’ (EOR) procedure. To have one or more sections of your test remarked, you need to pay the £120 EOR fee via the University of Nottingham online store and submit a request via the British Council IELTS Test Taker Portal within 6 weeks of your test date. You do not need to return your IELTS Test Report Form to us at this stage. Once we receive your request and payment, we will send the appropriate test materials to the British Council to be remarked. The outcome of your Enquiry of Result (EOR) can become available on the same day as your application and up to 21 days after your application. The turnaround time of your application will depend on several factors, including the number of sections requested for remark. If you have not received your outcome after 21 days, please contact ielts@nottingham.ac.uk If your score changes as a result of the remark, you will be refunded the £120 fee and will need to return your original Test Report Form before we can issue a new certificate with your updated scores. IELTS test takers can appeal against decisions affecting IELTS test results (e.g. decisions relating to Enquiry on Results outcomes, malpractice and administration). The appeals process focuses on whether, in the course of reaching decisions, the IELTS Test Partners used procedures which were consistent with the regulatory authorities’ code of practice and applied the procedures properly and fairly. The appeals process is not concerned with making judgements about test takers’ work in the test, and an appeal will not normally involve re-marking or re-assessment of a test takers’ work. The appeals process allows for reviews in two consecutive stages. A fee of £250 is charged for each stage and the outcome at each stage may be confirmation or overturning of the original decision. Where an appeal leads to the overturning of the decision, the appeal fee will be refunded in full, including fees from any previous appeal stages. For further information, please contact ielts@nottingham.ac.uk If you want to make a complaint regarding the conduct of your test, you must do so before you leave the test venue on the day. IELTS will not accept complaints relating to test day conduct after results have been released. Please feel free to talk to us about any queries or complaints regarding your test day experience. The test day supervisor will be available to discuss any concerns you may have and provide a complaint form for you to fill in, if required. In the event that you are unhappy with the way the test centre has responded to your complaint, further information about the University of Nottingham complaints procedure can be found at the Academic Services Division complaints page. Further information about the British Council global complaints procedure can be found here."
        }
    ],
    "pdf_files": []
}