{
    "url": "https://www.nottingham.edu.my/Study/Accommodation/On-campus-accommodation.aspx",
    "content": [
        {
            "p": "All residential halls are within easy walking distance to the academic buildings and on-campus conveniences like retail, food and beverage outlets, plus in door and outdoor sports and leisure facilities. The University offer various room types to suit your budget within our 11 halls of residence, totaling about 2,400 beds. They range from single ensuite bathroom, twin shared to four shared rooms with or without air-conditioning. We also have special rooms for residents with special needs. Let's have a look at your home away from home! All our rooms are fully furnished with an internet connection. Every floor has a pantry-area where light cooking is allowed. Each room in Student Village North (J Halls) has a mini refrigerator while Student Village South (I Halls) rooms share refrigerators in the common Pantry Lounge on each floor. There are also free maintenance (upon appointment) and free room cleaning services (upon request) in the presence of the Resident. Residents may use the coin-operated laundry facilities at their own expense available in both Student Villages North and South. Student Village North has two Hubs, Radius and Nexus, where additional facilities are located, including TV room, Games room and leisure learning spaces. Residents will also have access to the Sports Complex, including the gymnasium and swimming pool, and an on-campus medical clinic. Rentals are inclusive of water, electricity and WIFI. For rooms with air-conditioning, there is a seperate meter reading for air-conditioning usage. Meter reading will be taken on a monthly basis and chargeable to the resident on a quarterly basis. Floor Plan Only light cooking and heating up of food and drinks are allowed at the designated pantry area on every floor. Residents are advised to bring their own utensils, cutlery and crockery. Only halal food is allowed to be cooked and stored in the pantry. We have on-campus F&B outlets, some of which operate 24x7, besides the vending machines. During the semester months (February to May, and September to December), you may also get to enjoy the following: Applying for UNM’s on-campus accommodation is straightforward. Students can access our Online Accommodation Application portal. You will be able to submit accommodation preferences and other necessary information. We encourage students to apply as early as possible as accommodation spaces are limited. For more information regarding Campus Accommodation, please refer to our Accommodation Handbook. Off-campus accommodation refers to housing options that are not situated within the university’s premises. These can include privately rented apartments, houses, or shared accommodations outside the campus area. On-campus accommodation is housing provided by the university within its campus boundaries. This allows students to stay closer to the university facilities and campus amenities. The choice between on-campus and off-campus accommodation depends on the student’s preferences, circumstances, and priorities. For instance, lifestyle choices, budget and personal comfort. Benefits of on-campus housing include: Off-campus accommodation may offer: Our university offers various types of accommodation to cater to different preferences and budgets, including General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/Floor-Plan-2024.pdf",
        "pdf_files/Digital-Accommodation-Handbook-2023.pdf",
        "pdf_files/Digital-Accommodation-Handbook-2023.pdf"
    ]
}