{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Mathematical-Physics-MSci-Hons-U7UMTHPY.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK About Physics at the University of Nottingham We have a proud history of learning and innovation. Research undertaken within the School of Physics and Astronomy, by Professor Sir Peter Mansfield, was recognised with a 2003 Nobel Prize for the invention of Magnetic Resonance Imaging body scanners. This technology has already helped more than half a billion people worldwide. More recently, our use of quantum technologies to understand how the brain works is changing the way that neurological conditions are detected and treated. Our research activities cover cutting-edge topics ranging from probing quantum mechanics at ultralow temperatures to understanding the largest structures in the Universe. Mandatory Year 1 From Newton to Einstein Quantitative Physics Core Mathematics Computing For Physical Science The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 28 March 2024. Due to timetabling availability, there may be restrictions on some module combinations. Typically in the first year, there are 10 lectures per week with associated problem sheets and directed reading. Some modules are supplemented by additional workshops where you will have the opportunity to put your learning into practice. You will benefit from having both a maths and a physics tutor. You will take part in weekly small group tutorials (typically five students), where your tutor will provide support and guidance. These will alternate between maths and physics in the first year. Subsequent years will vary with the largest change being fewer group tutorials. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. 73% say staff value students views and opinions about the course Data for Mathematical Physics (Full time) at University of Nottingham, the, over two years For more official course information visit Discover Uni See course data Faculty of Science Entry requirements AAA UCAS code F350 Duration 3 years full-time Start date Sep 2025 UCAS code F371 Duration 4 years full-time UCAS code F346 UCAS code F300 If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}