{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Mathematics-and-Economics-BSc-Jt-Hons-U6UMTHEN.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK How do government economic policies affect us? What drives inflation and interest rates? How can using mathematical models help tackle unemployment? Our BSc Mathematics and Economics explores these questions and more. This course enables you to study mathematics whilst learning key economic principles. It is run jointly by the School of Mathematical Sciences and the School of Economics. Mandatory Year 1 Core Mathematics Introduction to Macroeconomics Introduction to Microeconomics Probability and Statistics 1 The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 19 December 2024. Due to timetabling availability, there may be restrictions on some module combinations. The course is a joint honours degree jointly offered by the School of Mathematical Sciences and the School of Economics. The majority of modules are worth 10 or 20 credits. You will study modules totalling 120 credits in each year. As a guide one credit equates to approximately 10 hours of work. During the first year, you will typically spend approximately: You can attend drop-in sessions each week up to a maximum of two hours and the remaining time will be spent in independent study. In later years, you are likely to spend up to 15 hours per week in lectures and workshops subject to your module selection. In your first year you will meet with your personal tutor every week during term time. In small groups of five to six students, you'll run through core topics and practice working together in a group to solve problems and communicate mathematics effectively. All of our maths modules are delivered by lecturers or professors. PhD students sometimes support problem classes and computing workshops in their areas of expertise. Lectures in the first two years often include at least 200 students but class sizes are much more variable in the third year subject to module selection. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2023, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. The course stood out to me due to the teaching methods. There is a lot of support available and many ways to consolidate and revise previous learning. Even without having studied further maths, I feel like everyone gets to an equal footing quite quickly. Alexander Kitsis BSc Mathematics and Economics 85% say staff value students views and opinions about the course Data for Mathematics and Economics (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Social Sciences Entry requirements A*AA UCAS code L100 Duration 3 years full-time Start date Sep 2025 Faculty of Science Entry requirements A*AA/AAA/A*AB UCAS code G100 If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}