{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/international-students/travelling-to-nottingham.aspx",
    "content": [
        {
            "p": "Welcome information for international students Whether you're coming from within the UK or abroad, there are plenty of ways to reach our campuses. Nottingham is easily accessible via public transport from major UK airports and cities including London, Birmingham and Manchester. Use our guide below to plan your journey and arrival. You have arrived in Nottingham, what’s next? Whether you arrive at East Midlands Airport, Nottingham Train Station or Nottingham city centre, there are several ways to reach our campuses. If you're arriving by train, timetable information is available from National Rail, and we advise booking your tickets online. We suggest you arrive at Nottingham Train Station, and from there you can get a taxi. There is a taxi rank on Station Street, or you can use Uber or DG Cars to book a taxi directly. You can also get the tram directly to University Park Campus. Follow the signs from your platform, and head north on the Phoenix Park or Hucknall tram lines. More information including tickets and timetables, see the NET site. National Rail website National Express offers regular coach transfers between London Heathrow/Gatwick and Birmingham Airport to Nottingham Broadmarsh Bus and Coach Station. Our partnership with National Express offers a 20% discount on tickets from Heathrow, Gatwick and Birmingham to Nottingham Broadmarsh Bus Station from Friday 15 November through to Saturday 7 December and Friday 10 January through to Monday 10 February. Book your ticket and find out more on the National Express website. You can also view the National Express luggage policy at the bottom of the page. National Express website Taxi transfers are available from our local taxi firm DG Cars, who provide a private hire service from airports across the UK to your accommodation. If you would like to book a private transfer, you will need to pre-book and pre-pay for this service. You will be met at your arrival terminal by the driver with a name board for you. Make a booking with DG Cars You can also book a taxi from the following airports: East Midlands Airport is just 15 miles from Nottingham city centre and there is a dedicated bus service between the airport and the city centre. From there, you can either get a taxi or tram to campus. The estimated journey times below are provided for guidance only, and may vary depending on the travel route and time of day. Please visit the operator websites for full details of travel connections, times, fares and bookings."
        }
    ],
    "pdf_files": []
}