{
    "url": "https://www.nottingham.ac.uk/student-living/accommodation/what-to-bring.aspx",
    "content": [
        {
            "p": "Find the campus that's right for you As you're preparing for your big move, you may start to think about what you should be bringing with you. We have listed below some things to start you off. This does not cover everything, however it may help you with deciding on what to pack. You will need to check that any pots or pans you bring with you are made for induction hobs, All of the halls above use induction hobs, as part of our commitment to fire safety and sustainability. You should carefully consider what you need to bring with you - remember space may be limited, so it is a good idea to bring clothing you know you will wear for the current season of the British climate. It is also a great excuse to visit home when you need to swap (and maybe have your laundry done for you too!) If you intend to play a sport at university or visit the gym, you should consider this too. It is also a good idea to bring different types of shoes; you may be going on a night out one day, and walking to your lecture the next. Slippers are a great way to make your room feel like home. Throughout the term there will be many occasions to wear fancy dress, so you may want to bring some old costumes with you. You should bring your own coat hangers too, and consider an outfit for a formal dinner on Welcome Week. Think about your daily routine, from getting up to going to bed, and list all of the things you need to use throughout the day. Remember to bring your toothbrush, toothpaste, shower gel and shampoo - to name a few. You may also want to bring personal care items such as hairdryers, shavers or straighteners. Remember that if you do forget anything, we have a number of shops around campus and in the city centre. Remember to bring any electrical equipment that you may need to use with you. Your laptop or PC is likely to be a pivotal part of your academic study, check the equipment advice before you arrive. You may wish to bring extension leads or other equipment to help improve your comfort while studying. If you are an international student, you may need to bring a socket converter. Don't forget chargers for these items! Please note, any electrical equipment that you do bring needs to be under 1200 Watts to comply with our safety regulations in halls. If you are on a repeat prescription, please make sure that you have an adequate supply of your medication with you. You can also manage your prescriptions at the university, via Cripps Health Centre. You may also want to consider bringing general first aid items, such as plasters and paracetamol. The documents that you need to bring will vary from person to person but you should consider those that might be helpful while you are at university. These might include a driving license, course offer letters, or any registration details that you feel will be relevant. You will be informed of any specific documentation that you need to bring prior to your arrival. If you are going to be living in catered halls, you only need to bring a few essentials to supplement your daily meals. This may include a mug to make hot drinks and cutlery and plates for snacks. If you are going to be living in a self-catered residence, please see a full list of items to bring on the relevant provider's website. Bringing personal items and decorations can help to make your room feel a lot more like home. You may wish to bring photographs of family and friends, plants and ornaments, and extra cushions or blankets for your bed. You are able to bring LED fairy lights, as long as they are battery operated. All rooms also have a noticeboard and you can decorate these in whichever way you choose. Please refrain from using anything that may leave a mark on your wall to secure items. This includes blu tack, tape, or anything else that may cause damage. If there is damage found to your room, the repair costs may fall to you. You can find out more here. - Candles, incense sticks or burners. - Cooking appliances e.g. rice cookers, fridges, sandwich toasters, Air fryers, coffee makers - Electric or gas heaters. - Anything that may cause harm to yourself or others, including any form of weapon, chemicals, or fireworks. - Pets (including small caged animals). If we find an item that is prohibited in your room, we will send you an email to ask you to remove it from your room within 24 Hours, if you fail to do this, we will remove the item and keep it for you until the end of term."
        }
    ],
    "pdf_files": []
}