{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/life-in-nottingham/what-do-people-go-to-the-city-for--.html?title=TGlmZSBpbiBOb3R0aW5naGFt&variant=bGlmZUluTm90dGluZ2hhbUpzb25QYXRo",
    "content": [
        {
            "p": "Here are the \"hidden gems\" students should know about when visiting Nottingham. Nottingham is an eclectic and diverse city that’s home to so many hidden gems! The city has evolved considerably over recent decades, changing with the times and becoming much more cosmopolitan with an open-door policy for things that are exciting and new. Did you know that Nottingham City Transport is the only company to win UK Bus Operator of the year five times! Nottingham is on the cutting edge of public transport and provides a quality service with a smile. The Robin Hood Network will offer a multi-operator ticketing system to allow free roaming across the bus, tram and rail networks. Nottingham also has one of greenest transport systems, making travel sustainable for regular commuting by switching to electric and biogas-fueled buses. Nottingham is set to be the first city outside of London to have fully contactless payment apps for buses and trams. This award-winning transport system gives you the most convenient connectivity between the University of Nottingham’s campuses; regardless of where you find your accommodation. Nottinghamshire is incredibly convenient for travel anywhere across the country. You can be in London within an hour and forty minutes and there are great links to the north, south and Ireland. And when the HS2 train arrives in 2030, it’ll only be 20min to get to Birmingham, you can be in Leeds in 27 mins and it’ll take just 52 mins to get into central London. Nottingham will get you there. It’s a little-known fact that Nottingham is the home of world-class pioneers and disruptive thinkers. It was Nottingham’s very own Ada Lovelace and her innovative work with Charles Babbage that created the world’s very first mechanical computing machine in the 1800s. The 'Invest in Nottingham' initiative actively helps innovative companies relocate to and thrive in the Nottingham area. It’s been a great investment as Nottingham’s Digital Tech sector contributes an impressive £2.5BN to the local economy and employs upwards of 36,500 people – many being grads from the University of Nottingham. The University of Nottingham’s school of Computer Science is one of the UK’s leading educational institutions in the field and has long-standing partnerships with global tech companies like IBM and Microsoft. If you’re looking to get into tech, then Nottingham is the place to be. Big businesses and start-ups (in the know) understand that Nottingham is bursting with talented professionals. The University of Nottingham is a leading contributor to this abundance of talent. There are some 35,050 students (that’s nearly twice the seating capacity of Madison Square Garden) enrolled in courses relevant to innovation-hungry STEAM industries. The access to talent benefits businesses looking to build teams of quality professionals. BioCity Nottingham is an ultramodern Bioscience business incubator. They boast a 91% survival rate for the companies that exist within their business network. The University of Nottingham has run successful bootcamps at Biocity that were sponsored by AstraZeneca, PERA and AdamsonJones. By choosing Nottingham as their location, companies can take their pick from a 2.1 million strong workforce within Nottingham’s recruitment catchment area. Nottingham is a city that’s constantly in a state of change and growth. Nottingham is undergoing a multi-million facelift of its Broadmarsh Southern Gateway. The new gateway will be a top to bottom transformation that will include a brand spanking new library, college, hotels, offices, modern homes, shops and bars. The new development will be housed within a picturesque, traffic-calmed environment – quite literally a breath of fresh air compared to the typical, smoggy, overly congested city centres of other cities. There’s also a £650 million redevelopment of the famous Boots Island site in progress to build new office spaces, retail, student accommodation and a 5-star hotel. Nottingham provides great opportunities for a budding entrepreneur’s start-up with its commercial property. The average rental price comes in at a bargain of just £19.52 per square foot. Far less than what you’d expect to pay in London and other major cities in England. The quality of life is great for the Nottingham Native. You’ll actually save an average of £6k per annum compared with living in London, where the average house price is a staggering £730,014! It’s not surprising then that Nottingham is the ‘saver friendly’ choice for homebuyers. Life in Nottingham Welcome to Nottingham! It’s known for its role in the Robin Hood legend and for the hilltop Nottingham Castle Museum and Art Gallery, rebuilt many times since the medieval era. In the Lace Market area, once the centre of the world’s lace industry, the Galleries of Justice Museum has crime-related exhibits. Wollaton Hall is an ornate Elizabethan mansion with gardens and a deer park. Nottingham and Nottinghamshire The city has many highlights if you consider studying at the University of Nottingham. Find out more about Nottingham and what the city is famous for. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}