{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/visa-help/student-route/student-status-change-immigration-advice.aspx",
    "content": [
        {
            "p": "Changes to your status as a student can have an impact on your student visa. The information applies to those with either a Tier 4 visa or a Student route visa. It is important that you understand if the change made to your status does have an impact and, if so, what action you need to take as a result in order to comply with immigration requirements. Please refer to the table below for specific information on your situation. If you are unsure which status applies to you and/or you do not understand the immigration implications please contact an Immigration Adviser in the Visa and Immigration Team (email: immigration-support@nottingham.ac.uk). It is your responsibility to ensure you understand and follow the immigration rules and regulations. Please note that this document only applies once you have changed your status. Status changes (please refer to the status which applies to you below) Immigration implications University responsibility: To notify the Home Office of this change within 10 working days of the start date of the interruption and withdraw immigration sponsorship where the period of interruption will be greater than 60 days. Impact on Student visa: If your interruption is for 60 days or less it should not have an impact on your visa. If your interruption is for more than 60 days the University is required to withdraw immigration sponsorship and we expect your visa to be cancelled by the Home Office*. You will need to apply for a new visa from overseas in order to return to your studies. Your responsibility: If your interruption is for more than 60 days you should arrange to leave the UK within 60 days of the start date of the interruption. You should contact the Visa and Immigration team three months before your intended return date for advice on securing a new visa for your return. You are also required to keep your contact details up to date with the University in case we, or the Home Office, need to contact you. Update your details by visiting your NottinghamHub. Additional information: Please be aware of Home Office time limits on studying in the UK on a Student visa and also University limitations on immigration sponsorship. Failure to follow immigration regulations may mean that the University will be unable to act as an immigration sponsor on your behalf in the future. University responsibility: To notify the Home Office of this change within 10 working days of it taking effect. Impact on Student visa: We expect your visa to be cancelled by the Home Office* and you will need to apply for a new visa from overseas in order to return to your studies. Your responsibility: You should arrange to leave the UK within 60 days of the change taking effect. University responsibility: There is no requirement for the University to notify the Home Office. Impact on Student visa: Your current visa continues to be valid but you may need to extend your visa (subject to University limitations on immigration) in order to complete your course. In limited circumstances the new application may need to be made overseas. Your responsibility: To ensure that you seek advice from the Visa and Immigration team in order to extend your visa (if appropriate) and request a new CAS from us in sufficient time to obtain your new visa. Additional information: Please be aware of Home Office time limits on studying in the UK on a Student visa and also University limitations on immigration sponsorship. University responsibility: To notify the Home Office of this change within 10 working days of it taking effect Impact on Student visa: This depends on the type of transfer as outlined below: Higher level studies and same level studies - If the new course is at a higher level or the same level as the previous course and cannot be completed within the duration of the existing visa you will need to apply for a new visa this may need to be done from overseas. You should contact the Visa and Immigration team for further advice. Lower level studies (including examination board recommendations to downgrade) - Unless the transfer is to the lower level of an integrated course and can be completed on the existing visa, a new visa application from overseas at the time the transfer is implemented will be required. You should contact the Visa and Immigration team for further advice. Your responsibility: Higher and same level studies - To ensure that you extend your visa at the time of transfer if your new course is longer or the same length but cannot be completed on your current visa. If your new course is shorter, you should arrange to leave the UK within four months of the new course completion date. Please see below for ‘course completion (if earlier than expected)'. Lower level studies – Unless the transfer is to the lower level of an integrated course and can be completed on the existing visa, a new visa application from overseas at the time the transfer is implemented will be required. You should contact the Visa and Immigration team for further advice. Impact on Student visa: We expect your visa to be curtailed by the Home Office, to a date four months after your new completion date* Your responsibility: To arrange to leave the UK within four months of the new course completion date. If you choose to leave the UK during this four month period, you will not be permitted to return to the UK on your Student visa. Impact on Student visa: We expect your visa to be cancelled by the Home Office* Your responsibility: To arrange to leave the UK within 60 days of the change taking effect. Additional information: The University is not able to act as an immigration sponsor for a new course in the future for a student whose previous course is terminated (including where an Honours degree is downgraded to an ordinary degree). If you submit an appeal against the decision to terminate your course please email immigration-support@nottingham.ac.uk for advice on what this means for your visa. Additional information: The University is not able to act as an immigration sponsor in the future for a student who is assumed to have withdrawn from the course as a result of lack of engagement. If you are moving to study at another UK institution you should contact your new institution for immigration advice on making a fresh visa application. Impact on Student visa: If there is a gap of less than 60 term-time days between receiving your exam results and the resit examination(s)/study period it should not impact on your visa. However, if there is a gap of more than 60 term-time days between receiving your exam results and the resit examination(s)/study period we expect your visa to be cancelled by the Home Office*. In these circumstances a new visa will be required to return to the UK to take your resits/return to your studies. A Standard visitor visa may be recommended in some cases. Your responsibility: If the gap between receiving your results and the resit examinations/study period is more than 60 term-time days you should arrange to leave the UK within 60 days. For advice on obtaining a new visa for future examinations/study periods on the UK, please email immigration-support@nottingham.ac.uk. Undergraduate students receiving examination results in June and resitting in August do not need to leave the UK during the summer vacation if their Student visa is still valid. If you have questions about your specific situation, please email immigration-support@nottingham.ac.uk. University responsibility: To notify the Home Office of this change within 10 working days of it taking effect but ONLY where a gap of more than 60 term-time days exists (between a student receiving results and the resit/repeat period of studies). Impact on Student visa: If there is no gap (apart from University vacations) between your previous studies and your resit studies your current visa continues to be valid but you may need to extend your visa in order to complete your course. If the gap between receiving your results and the resit/repeat period of studies is more than 60 term-time days we expect your visa to be cancelled by the Home Office*. In these circumstances a new visa will be required to return to the UK to take your resits/return to your studies. A Standard Visitor visa may be recommended in some cases. Your responsibility: If there is no gap between receiving your results and the resit/repeat period of studies, but your studies can no longer be completed within the dates on your original visa you should apply to extend your visa. For advice on obtaining a new visa for future study periods on the UK, please email immigration-support@nottingham.ac.uk. If there is a gap of more than 60 term-time days we advise that you arrange to leave the UK within 60 days of the change taking effect. Impact on Student visa: If the work placement or study abroad period was already included in your visa from the outset there should be no impact on your visa if your placement is in the UK or at an approved exchange or study abroad partner overseas. If the work placement or study abroad period was not included in your visa from the outset and you have transferred to a course including a work placement or study abroad period, the duration of the course will extend beyond the end date of your visa and you will need to apply for a new visa. You can apply in the UK or overseas, either before or after the work placement/study abroad period (but not during). If your work placement will be undertaken overseas please contact an Immigration Adviser for advice. Your responsibility: To ensure that the University knows the location of your work/study and to keep us informed if the arrangements change. To extend your visa if you transfer to a course including an optional study or work placement and to seek advice on doing this by contacting mmigration-support@nottingham.ac.uk. *The Home Office should contact you by email to confirm when cancellation action is taken against your visa, however Students who remain in the UK after sponsorship is withdrawn should still take steps to regularise their leave or depart the UK and should not wait to receive a cancellation letter before doing so."
        }
    ],
    "pdf_files": []
}