{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/BMBS-Medicine-Clinical-BMBS-U6UBMBSCP4.html",
    "content": [
        {
            "p": "Lincoln Medical School, Lincoln, UK September 2025 is the final year the University of Nottingham will offer entry to this course. It’s important you understand these changes before applying to this course. Find out more Doctors play a vital role in the lives of so many, from the most joyful, to the toughest moments. At Lincoln Medical School, we'll help you gain the clinical skills, knowledge and confidence required for a career in medicine. Developed in partnership with the University of Lincoln, the Lincoln Medical School course allows you to graduate with two degrees from the University of Nottingham, a BMedSci and a BMBS. Once you complete your BMedSci, you'll then work towards your BMBS. Mandatory Year 1 Biomedical Skills 1 Integrated Medicine 1 Medicine 1 Medicine 2 The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 20 June 2024. Due to timetabling availability, there may be restrictions on some module combinations. During your first three years, you'll have approximately 16 to 18 hours of teaching contact time with around 20 hours of independent study per week. You'll spend around five days on placement each semester. During your time in the Clinical Phase, you'll spend between 35 to 40 hours across five days every week studying and on placements. You'll spend around three to four days on ward, clinic or GP placement visits per week plus 8 hours of independent study time. This will include some out of hours work. Your holidays will also differ during the Clinical Phase from the standard student timetable. You'll have about six weeks' holiday in each of the clinical phases. This is usually taken as two weeks at Christmas, two weeks at Easter, and two weeks during the summer. Careers advice Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). For your early years, you will spend most of your time studying at Lincoln Medical School. Based at the University of Lincoln's city centre campus on the waterfront, you'll enjoy modern teaching and learning facilities. What I love about this course is you get everything Lincoln has to offer as a city and university (a lot!), but with the added bonus and additional security of being affiliated to Nottingham’s School of Medicine and following their very well-established TEF Gold degree course- you’re essentially a member of 2 universities for the price of 1! Amy Cowan, Medicine at Lincoln student 69% of students say teaching staff have supported their learning well. Data for courses in Medicine (non-specific) at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Medicine and Health Sciences Entry requirements AAA UCAS code A100 Duration 5 years full-time Start date Sep 2025 Entry requirements BBC UCAS code A108 Duration 6 years full-time Entry requirements Minimum of a 2:2 degree in any discipline UCAS code A101 Duration 4 years full-time Entry requirements AAB UCAS code B121 Duration 3 years full-time If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}