{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Course-Accreditations.aspx",
    "content": [
        {
            "p": "At UNM, we take great pride in our commitment to excellence, which is reflected in the prestigious accreditations we have earned. Firstly, we are recognized by the UK's Quality Assurance Agency (QAA), an esteemed organization that safeguards the standards of UK education. Accredited degrees offer students, parents and potential employers an assurance that the quality of the degree meets a certain standard and level of competency. The assurance comes from select, approved accreditation bodies within the profession itself. When a programme is accredited, it means that the external body has thoroughly evaluated the programme’s curriculum, faculty, learning outcomes, and overall quality. Accredited programmes have met the established industry standards and are recognised for providing a credible and valuable educational experience. With our accredited programmes, students can be assured of receiving a first-class education. We take great pride in our accredited programmes and invite you to join us on a transformative educational journey that will empower and equip you to reach your full potential in your field of study. Get in touch with our friendly counsellors to find out more about UNM. Find a programme Get in touch Application guide, intake deadlines and student requirements at your fingertips. Explore ideal degree programmes catered to your interests. Get the full list of tuition fees for all undergraduate programmes. Programme accreditation is vital as it serves as quality assurance. Accredited programmes demonstrate that they meet industry-recognised standards, ensuring that students receive valuable education that aligns with the demands of their field of study. Accreditation also enhances the credibility of the university, making graduates more competitive in the job market. Not all university programmes are accredited. This is because accreditation is a voluntary process for universities, and as such, not mandatory. However, reputable universities in Malaysia typically seek accreditation for their courses to ensure quality and recognition in the academic and professional domains. It is advisable that students choose accredited courses to receive a credible and valuable education. Graduating from a non-accredited course may affect your employability and limit your access to certain career opportunities that require accredited qualifications. Additionally, credit transfer to other institutions or further studies may be more challenging with non-accredited courses. Thus, carefully consider the accreditation status of the course before enrolling to ensure a recognised educational experience. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}