{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Chemical-and-Environmental-Engineering/Environmental-Engineering-MSc.aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/524/7/0025(1/28)MQA/SWA0647 The MSc Environmental Engineering course is aimed at students who have an interest in environmental engineering but initially undertook a more mainstream undergraduate programme. It is ideal for those who want to specialise in environmental engineering after graduating from their undergraduate degree or after working in the environmental engineering field. The syllabus covers a number of traditional subjects which you can choose from; such as air pollution, contaminated land and water treatment. The compulsory part of the programme concentrates on developing and improving research, teamwork and communication skills in a context relevant to environmental engineers. The Department of Chemical and Environmental Engineering is a leading centre for the development of industrial processes and applications in energy, sustainability and environmental engineering. Our taught postgraduate programmes produce high quality engineers who will graduate with the advanced skills and training demanded by industry and organisations all over the world. You will take a mixture of module choices from a restricted list of traditional environmental engineering subjects and from free choice options from across the campus, enabling you to build your own multidisciplinary syllabus. You will also be required to complete a Group Design Project with relevance to environmental engineering. You must pass all the components in the autumn and spring semesters, comprising 120 credits, to progress to the final stage of the MSc Individual Research Project. The MSc Individual Research Project is worth 60 credits and occupies the entire summer semester. *Students may choose modules from any other course provided it is approved by the programme director. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. An upper second class honours degree (or international equivalent) in engineering or a related field. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Applicants must have graduated from an approved university. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Students completing this programme have undertaken jobs in a range of industries, including oil and gas, petrochemicals, food, environmental protection, nanotechnology, consultancy and management. The programme also aims to provide a strong foundation for further study to PhD level and pursuit of a career in research. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}