{
    "url": "https://www.nottingham.ac.uk/student-living/community-engagement/meet-the-team.aspx",
    "content": [
        {
            "p": "Find out more about the amazing team working to make our communities safer and stronger. You can also find out about our incredible Community Engagement Ambassadors below. We envision a community where students are empowered as responsible citizens, actively engage with residents, and contribute to a vibrant and thriving environment for all Head of Community Engagement brydie.adams@nottingham.ac.uk I love being the Head of Community Engagement because it allows me to collaborate with a diverse range of stakeholders, all united by a common goal: supporting both the student body and the local communities. Working alongside such a passionate and driven team fuels my own motivation, and the ability to witness the positive impact of our campaigns is incredibly rewarding. The vibrant energy of the city adds another layer of excitement to the work, making each day a worthwhile and engaging experience. Community Engagement Manager (Safety, Cohesion & Wellbeing) raelene.wilson@nottingham.ac.uk I love working in the community engagement team, it's a very positive and proactive team. It's great to be able to engage with students and the wider community, promoting sustainability, safety and students being happy within their community. I think as a whole, we're a creative, happy and an approachable team. No day is the same, we support each other, everything we do is a team approach and always having the students at the centre of why and how we do various campaigns. Community Engagement Manager (Social Responsibility) georgia.petch@nottingam.ac.uk I enjoy working in the Community Engagement Team because it allows me the freedom to develop and implement campaigns which deliver genuine impact to diverse resident-student communities. This, combined with the equally rewarding supportive network created among our team enables the ultimate environment for productivity and job satisfaction. Community Engagement Coordinator – Social Media Lead celia.holmes@nottingham.ac.uk I really enjoy working for the team as there’s a very positive atmosphere in the office which impacts all aspects of our work. It’s been amazing to witness the implementation of the Community Engagement Ambassador scheme and to hear the great feedback from students and long-term residents alike. The scheme has made a real difference to the area, and it’s been fantastic to see the before and after. Community Engagement Coordinator – Ambassador Lead chris.parkes@nottingham.ac.uk I really enjoy the variety of work involved with my role, from undertaking home visits to assist with student difficulties, to working on campaigns such as British Heart Foundation, to collaborating in the community with police and council colleagues on efforts to reduce crime. My favourite part of the role is working with the student Community Engagement Ambassadors who work out in the community assisting students and residents with issues such as waste management, recycling and home security. We are a small but enthusiastic and dynamic team who can turn our hand to anything and love getting involved in as much as possible to support our amazing students at the University of Nottingham. Business Support Administrator shivani.singh@nottingham.ac.uk I love working in the Community Engagement team because everyone here has a fantastic vibe. They are warm, welcoming, and genuinely care. Internal wellbeing initiatives make the work environment lively and enjoyable. Work doesn’t feel like a burden; it’s fun and rewarding! Despite having the least outward-facing role, I get amazing opportunities to meet people from other teams, students, and more. There's always something new to learn and I feel supported at every step. The Community Engagement Ambassador (CEA) scheme started in the 22/23 academic year. The UoN Community Engagement Team recruited 12 students to support community cohesion initiatives in communities where a large population of privately rented student properties exist. The CEAs are employed and managed by the university working each week across the academic year. The scheme has expanded year-on-year with the newest cohort being made up of 26 ambassadors. They'll be out working and helping in multiple communities including Lenton, Radford, Dunkirk, Beeston and Kegworth. Community Engagement Ambassadors"
        }
    ],
    "pdf_files": []
}