{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/postgraduate-research/order-official-letters.aspx",
    "content": [
        {
            "p": "During your PGR studies you may be required to obtain official documents from the University of Nottingham. The PGR official documents and letters order form allows you to order any free of charge student letters. For any other paid services, e.g. degree confirmation letter, you will need to visit the UoN Online Store to process your payment securely. Request an official PGR document or letter Each of the letter type will only confirm information held on your student record on the day it is produced and will include: your name, student ID, date of birth, course details and start date. Depending on your status it will either include the final submission deadline, date of your submission or date of your completion (inclusive of graduation date, only if you registered to attend). You can see the exact wording below. Additionally, depending on the purpose of the letter, we will include addressee details of your choice, and your address details. See the table below for further details on specific types of letters and their purpose. This letter will confirm your student status and does not have an addressee, so you can use it for a variety of purposes, i.e. transport card, employment agency, etc. If you are a new starter you need to have started your course and be fully registered and active. The letter will be emailed to your University email address. If you opt in to collect the letter – we will email you once it is ready for collection. Collection orders may take up to 10 working days. This will confirm your student status and enable you to apply for a travel visa. It is essential you know the name and address of the Embassy/Consulate/Visa Application Centre you are applying at before ordering the document. It will be copied directly from your order. The letter follows the same format as the standard status confirmation letter but it will come with an address (as provided) at the top. If you opt in to collect the letter – we will email you once it is ready for collection. Collection orders may take up to 10 working days. As a full-time student at the University of Nottingham you may not need to pay council tax. This document is for fully registered, full-time students. If you told us you live in one of the following areas, and you are fully registered, you may not need to request a letter. Student Services will automatically inform your Council of your status, in October and January each year, using your term time address on file: If you live outside of the above areas, or you missed the reporting period as a non-standard starter, then you may need to request a council tax exemption certificate. It's always best to check your status with your local council. We only provide an electronic version of the council tax exemption certificate. The letter will be emailed to your University email address. We are unable to amend the wording of our official letters upon request. If you require a Sponsored Student Progress Report, which would be completed by your tutor/supervisor regarding your attendance and academic performance provided to your official sponsor, students can order one on the UoN Online Store. Additional information for sponsors details the recent changes to letter templates and provides further details on potential examination outcomes, graduation ceremonies and academic year dates can be downloaded as a supplement to a student confirmation status letter. When opening a student bank account, you may be asked to provide proof that you are a student at the University of Nottingham. We only provide an electronic version of your bank letter, and banks will allow you to upload this document directly to their application portal. Some banks may ask you to print off a copy of your electronic letter to present in their branch. You should check the exact application requirements with your bank. The letter follows the same format as standard status confirmation letter but it will be addressed to the bank of your choice, and additionally include your term time and home address. Please ensure that your address details match those on your portal before ordering, as the bank may seek further verification from University. Once you receive your letter, if you believe any of the information is incorrect, you need to contact us via the Student Enquiry Centre."
        }
    ],
    "pdf_files": []
}