{
    "url": "https://www.nottingham.ac.uk/studentservices/support/financialsupport/studentfunding/postgraduate-masters-loans-from-student-finance.aspx",
    "content": [
        {
            "p": "The Government, through the Student Loans Company (SLC) / Student Finance England, is offering Postgraduate Loans of up to £12,471 for eligible students who are studying a standalone taught or research Masters course of 180 credits, commencing between August 2024 and July 2025. The loan is a contribution towards the costs associated with completing a Postgraduate Masters course and can be used towards tuition fees or living costs as you decide. The loan is not means tested and will be paid directly to you, the student, rather than the University. As the loan is not sufficient to cover both your tuition fees and livings costs, it is important that you source funding in addition to the loan, to ensure you can cover all costs before starting your course. The University has to confirm your registration to the SLC to release your Masters Loan. However, due to the data checking that is required by the SLC, this confirmation can take up to three weeks from when you are fully registered with us for your course and from the start date of your course/year. Payment will not be made until after the start date the SLC have recorded for your course/year. Where data provided by the SLC doesn't match that held on your University record, or the University identifies any other information affecting your eligibility, registration will not be confirmed until these issues are resolved. All postgradutes should read through the information below. The loans offered and the eligiblity criteria are different to those from Student Finance England Student Finance Wales Student Awards Agency for Scotland Student Finance Northern Ireland Please note: If you move straight from an undergraduate course to a postgraduate course you must apply to the original awarding authority eg: If Student Finance Wales funded your undergraduate course you must apply to them for postgraduate funding. If you are not eligible for the loan please ensure that before signing up for a course you investigate other funding available, for example through Research Councils, Studentships and charitable trusts. More funding information for postgraduate courses"
        }
    ],
    "pdf_files": []
}