{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/postgraduate-research/uploading-your-thesis.aspx",
    "content": [
        {
            "p": "You will need the following information: Go to Nottingham ePrints and log in with your university username and password. Click on 'New Item'. On the following pages, you should then select the relevant options from ‘Item Type’, ‘Thesis Type’ and ‘Faculty/School’. On the following pages, select Item Type (i.e. ‘Thesis’), Thesis type and Faculty/School from the pick lists. Upload your PDF(s). This should follow the format of [your surname, your first name, student ID, type of submission (ie first, corrections, resub). For each file you need to provide further information. Please do not start a new thesis deposit if you have supplemental files (e.g. audio, video, list of required corrections). Put them all on the same record. Please note, research data should be archived separately. You can find more information on the research data management webpage. You should use 'Version' to indicate: 'Thesis – as examined' 'Thesis for reader access – any sensitive & copyright-infringing material removed' In the ‘Description’ field please indicate if this is your first submission, corrections or re-submission. ‘Visible to’ allows you to specify who can access the full text of your thesis. UoN advocates a policy of openness wherever possible and research funders may also require outputs to be available open access. Please consider the open access status of your thesis in discussion with your supervisor. You can select: ‘Anyone’ - the document is available to anyone via the world wide web ‘Repository staff only’ - the document can be requested by site visitors who identify themselves via a web form. If you don’t choose the ‘Anyone’ option, you should choose ‘Repository staff only’. This allows a log to be maintained of those requesting the full text of a thesis. If the title is embargoed (i.e. suppressed pending future publication), then access will be declined. If your thesis is restricted, then there is a later option to specify this and it will not be discoverable at all. For ‘Licence’, you should check the appropriate licence to assign to your work with your supervisor as they know the circumstances surrounding your research (the commercial and ethical sensitivity, possibility of patent application and funder requirements). For more information on the meaning of Creative Commons licences, please see UoN Libraries Licences webpage. For ‘Supervisor Discussion’, you must check the appropriate licence to assign your work and whether an embargo is required with your supervisor. Within ‘Embargo’, you may request an embargo period if you wish to suppress the full text pending publication of an article or book based on the content of your thesis. Please note that bibliographic details of your thesis, including any abstract, will be visible to the public. ‘Waiver’ refers to supervisor access. Where an embargo is applied to your thesis, it cannot be released without author permission. Please indicate whether you will pre-approve a request from your supervisor to view the thesis during an embargo period. Click ‘Next’ to fill in the bibliographic details (author, title, abstract etc). For ‘Award Date’ enter the date when you expect to graduate. If a thesis has an official ‘Restriction’ then enter the details here to ensure that the thesis is not visible within the live repository. Optionally add ‘Keywords’ to help others to find your thesis. ‘Comments and Suggestions’ are only visible to you and administrative staff. If there are particular reasons why you would need an embargo for longer than two years, please give details here. Read the ‘Deposit Licence’ carefully and deposit your files(s). There is no automated confirmation from the system. Your submission will be checked by Registry and Academic Affairs team and we will acknowledge your submission via email. First submissions, corrections and re-submission will be forwarded to examiner(s). Once the degree has been conferred, the final version of your thesis will be published (i.e. the full text made available on an open access basis online) unless: The content contains confidential material, or material that infringes copyright. In this case an alternative version with the sensitive or copyright-infringing material removed should also be submitted. The content includes third party copyright material for which permission to reproduce cannot be established. There are several options that may lead to permission for third party copyright material to remain (the guide Copyright and intellectual property guidance for electronic thesis submission outlines these). If none of these succeed, an alternative version with the copyright material removed should also be submitted. A restriction has been applied for due to time-limited confidentiality issues. In this case bibliographic details and the full text would only be visible to repository staff. An embargo has been requested. The thesis is not formally restricted, but the author wishes it to remain confidential prior to publication in a different form. In this case the full-text would only be visible to repository staff. However, it is important to note that with embargoed theses, the bibliographic details (author, title and abstract) are discoverable and available to read. Please consider whether the abstract contains commercial or sensitive information in consultation with your supervisor."
        }
    ],
    "pdf_files": []
}