{
    "url": "https://www.nottingham.ac.uk/student-living/community-engagement/community-chest-fund.aspx",
    "content": [
        {
            "p": "Do you want to help your local community? Have you thought of a way to contribute to the safety, social harmony and environment in which you live? Would you like to promote social responsibility and community engagement to students and long-term residents? If so, apply to the Community Chest Fund and receive a grant of up to £500 to make your project a reality and your community an even better place to live. To check that you meet the criteria and apply for the fund, please complete this form With the help of past grants, students have run a number of projects that have not only helped to combat waste management, noise and crime issues, but also further strengthened relationships between themselves and local residents. '[...] when it was announced there would be no Lenton Festival this year, Holy Trinity Lenton decided to galvanise the community to run a Lenton Fun Day themselves. The aim of this was to bless Lenton with a free event, as well as unite students, families, local businesses and community groups together as one. The day included bouncy castles, sumo wrestling, a fire engine and police van, live music and performances, face painting, balloon modelling, crafts, sports, games, ice cream and lots of food! The University of Nottingham Community Chest provided £500 towards this which covered hire of a bouncy castle and bouncy slide and face painting supplies. All which were a huge hit!' - Testimony from Holy Trinity Church Lenton Community Chest funding, 2024: £500 The annual SB Fest takes place on Sutton Bonington campus each May for the local community and the student community to enjoy. The festival features a dog show, live music, beer festival, discovery zone, dairy farm tour, farmers' market and outdoor games. Karnival was granted £200 to fund SB music society setting up the stage and drum set safely for the live music taking place all day and for the post-festival cleaning fees which enabled the campus to return to normal swiftly. Community Chest funding, 2024: £200 As the meeting point of Dunkirk and Lenton, Radford and Park, and the City Centre, Canning Circus is a very busy thoroughfare for students and residents. One of the highlights of the Christmas season is the annual switch-on of the Canning contemporary tree, which is highly anticipated by the surrounding community. Local school children, choirs and university music groups perform festive favourites to get everyone in the mood, while mulled wine, mince pies and cakes from CakeSoc have all been enjoyed at recent events. The University of Nottingham and Nottingham Trent University jointly funded this event with £250 from each institution. Community Chest funding, 2023: £250 Lenton Recreation Ground is one of many Green Flag parks in Nottingham and is very popular with students all year round. Towards the end of the summer term, local city councillors, local resident groups and community organisations organise a festival for the whole community. In 2022, there was a bouncy castle, and sports day races were enjoyed along with a hot days and entertainment from school children, dance groups and university societies. The SU Community Officer ran a tombola and the Community Engagement team staffed an information stall all day while the SU Volunteer Centre provided some general stewards to help the day run smoothly. Community Chest Funding, 2023: £500 Being situated so close to University Park Campus, Dunkirk is home to hundreds of students, as well as long-term residents. The local community centre holds an open tea afternoon every year where the whole community is invited to sample food from around the globe. Malaysian Soc and Cake Soc have previously provided free food samples, while Sustainability Soc have delivered a craft workshop for kids. Musicality Soc have even performed songs from their shows to keep everyone entertained, and the SU Volunteer Centre has supported the event by recruiting general helpers to serve the tea and coffee. This event is always well attended and loved by students and the wider community every year. Community Chest Funding, 2023: £315 Radford Recreation Ground is located in an area of high-density student housing. In October of every year, just after students have moved in, the Radford and Park Nottingham City Councillors hold a community cohesion event to bring together this diverse community. The big attraction is the delicious, authentic homemade curry which attendees are served free of charge. In the past, student groups such as BlowSoc have performed to entertain the crowds. United through good food and music, students and long-term residents mingle together and enjoy an afternoon in the park. Community Chest funding, 2022: £500 The student and non-student residents of Charles, Lawley and Varden Avenues in Lenton Abbey have enjoyed the support of Community Chest funding from the University of Nottingham for a number of years. The Neighbourhood Watch group is led by local resident Steve Hadfield, now in his 29th year as coordinator, who supports residents against becoming victims of crime and reckons the best way to do this is by working together as a community. As soon as new residents move in, the group post a welcome letter through the letterbox. This contains helpful information about wheelie bins, buses, post boxes and parking. It also contains contact details for someone they can approach for help if they need it. Not content with just being a useful point of contact, Steve organises popular community events such as Halloween parties, scarecrow day, quiz nights and street parties. The group has had 60 people attend the Halloween event, with some Chinese students bringing homemade food which was a real talking point. All events have involved students and have helped them feel that they belong to a community. Community Chest Funding, 2020: £300 Beeston is popular with our students as they value living in a vibrant and diverse community, located very close to University Park campus. A group of international students add to this community spirit by hosting the annual Malaysian Festival. Held by the Malaysian Society, it offers the Beeston community the chance to experience everything that is unique about Malaysian culture – from its food and handicrafts to games and traditional dances. Along one side of Beeston Square, gazebos shelter trestle tables full of traditional Malaysian games and handicrafts, while at the very centre of the hubbub, a wide space is cordoned off for traditional dancing – each routine painstakingly choreographed by one of the members of the organising committee. The event is always well attended by local residents and students alike with the highlight being the chance to sample delicious food from the cooking show and the various food vendors catering for the event Community Chest Funding, 2019: £500"
        }
    ],
    "pdf_files": []
}