{
    "url": "http://www.nottingham.edu.my/Study/Undergraduate-courses/Business/Business.aspx",
    "content": [
        {
            "p": "Nottingham University Business School (NUBS) is is proud to be among an elite group of business schools worldwide to gain 'triple crown' accreditation from the three most influential accrediting organisations - AACSB, AMBA, and EQUIS. The School has unrivalled global reach through tri-campus locations in the UK, China and Malaysia, offering unique perspectives and connections to changing business ideas. Do you see yourself starting your own company? Or working in an investment bank? Or are you a people person passionate about sales and closing deals? Our business and management courses can make those aspirations (and more) a reality, opening doors to some of the most dynamic and lucrative careers. As you may know, business and management are very versatile, interdisciplinary fields that encompass numerous subjects, including finance, marketing, operations, human resources, and strategy. Our courses will help you develop skills like critical thinking, problem-solving, and communication, making you suited for a wide range of industries and job roles. All courses at Nottingham University Business School involve the study of organisations, their management and the changing external environment in which they operate. While the exact blend of subjects studied depends on the particular course, each degree prepares you for a career in business and management and allows you to develop skills in qualitative and quantitative analysis, critical thinking, oral and written presentation, information technology and group working. Our programmes enable you to either opt for a broad-based management education or to specialise in a particular aspect of management. All programmes have been carefully designed to allow you to acquire the fundamentals of management and the most recent trends in business thinking. Combining studies in accounting, economics, finance, management and marketing, the interdisciplinary nature of our courses will provide you with the competitive edge to pursue a career in any line of business. Certain programmes are accredited by the Association of Chartered Certified Accountants (ACCA) / Chartered Institute of Management Accountants (CIMA) / Institute of Chartered Accountants in England & Wales (ICAEW) / CPA Australia / Chartered Institute of Marketing (CIM). As part of a joint certification programme with SAS, a global leader in business analytics, graduates of certain programmes will be awarded SAS Academic Specialisations. Further details on these accreditations and certifications can be found in the individual webpages of our degree programmes. Our interdisciplinary approach to business education will enable you to have a head start in a wide spectrum of careers. Many of our graduates have secured prestigious jobs in multinational corporations. Some of our graduates have become auditors, entrepreneurs, executives in the banking and financial services industry and industry regulators. Other career options include academia, investment research, management consultancy, risk management business analysis, marketing, human resource management, entrepreneurship and other service-oriented professions. Yes, you will have a variety of study abroad opportunities, including through exchange programmes with UNM campuses in the UK and China and some other universities around the world. These programmes will give you the chance to experience different cultures and broaden your horizons – so be sure to make good use of them. You will have access to our state-of-the-art lecture theatres, computer labs, F&B outlets, and library facilities. You will also enjoy a range of online resources, including databases, journals, and e-books. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}