{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Chemical-and-Environmental-Engineering/Department-of-Chemical-and-Environmental-Engineering.aspx",
    "content": [
        {
            "p": "Chemical Engineering has been established at The University of Nottingham since 1961, and ranks as a UK top 5 chemical engineering department in The Guardian University Guide 2024. The department is a leading centre for the development of industrial processes and applications in energy, sustainability and environmental engineering. Our taught postgraduate programmes produce high-quality engineers with the advanced skills and training demanded by industry and organisations all over the world. We aim to educate and empower our students to become innovative problem solvers who are capable of addressing global challenges related to this field. Learning will depend on the specific course. However, students can expect to learn through lectures, seminars, supervision, lab sessions, workshops, and drop-in sessions. Students are usually assessed via group coursework, individual coursework, dissertation, examinations and presentations. The Department of Chemical and Environmental Engineering at UNM boasts state-of-the-art laboratories equipped with advanced experimental setups, tools and simulation software. We aim to support students in gaining hands-on experience in chemical and environmental engineering processes. Students will have access to modern analytical instruments, pilot-scale reactors, and computational tools that are necessary for both research and practical application. Besides this, students will also have access to the library, online databases and resources that will help them in their academic endeavours. The University of Nottingham’s esteemed faculty members are accomplished experts in their respective fields and passionate about teaching and research. Students will be able to gain insights from our lecturers’ and professors’ wealth of experience and industry knowledge, ensuring a well-rounded education. Our faculty members actively mentor students, guiding them through the academic and research journey. A postgraduate degree in environmental engineering opens up diverse and rewarding career paths. Our graduates are in high demand in industries such as water treatment, renewable energy, environmental consulting, and research. In addition, the demand for professionals in these fields is growing due to the increasing emphasis on sustainability and environmental preservation. Chemical engineering focuses on designing and optimising chemical processes, materials and energy systems. It involves developing and improving manufacturing processes, ensuring product quality, enhancing efficiency and industrial sustainability. Environmental engineering deals with applying engineering principles to protect and preserve the environment. It focuses on issues such as water and wastewater treatment, air pollution control, waste management, and sustainable development. Yes, our postgraduate students will have the opportunity to specialise in their area of interest within the chemical and environmental engineering field. For instance, students can focus on areas such as process design, renewable energy, sustainable manufacturing, advanced materials, water resource management, environmental impact assessment, etc. Specialisation allows our students to develop expertise in a particular field of interest, opening up specialised career pathways. Yes, our postgraduate programmes place much importance on research and offer research opportunities for students. These experiences allow students to develop the skills needed, contribute to advancements in the field, and gain practical experience. Students can work with faculty members on projects related to topics in this field. UNM offers master’s and doctoral degrees in this field. Our postgraduate programmes include: Engineering MPhil/PhD Advanced Chemical Engineering MSc Environmental Engineering MSc A degree in chemical or environmental engineering will give you an advantage if you want to pursue postgraduate studies in this field. However, a degree in a related field and equivalent qualifications will also be considered. Department of Chemical and Environmental Engineering The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih, Selangor Darul Ehsan, Malaysia Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}