{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Engineering/Energy-Fuel-and-Power-Technology/research.aspx",
    "content": [
        {
            "p": "The central theme of the Energy, Fuel, Power and Technology Research Division is the development of renewable energy and sustainable, alternative fuels through a broad range of innovative experimental and computational studies. Our research adopts a multidisciplinary approach with international and local collaborative partners. Our work is mainly supported by the Malaysian government (e.g. Ministry of Science, Technology and Innovation (MOSTI) and the Ministry of Higher Education (MOHE)), governmental agencies and industry. We have dedicated facilities for both fundamental and applied research, as well as internationally recognised expertise within the following three research groups: The Internal Combustion Engines Research Group works on an array of combustion-related topics, with a particular emphasis on sustainable energy conversion technologies for ground transportation. Our strength lies in advanced computational research focussed on improving in-cylinder modelling of diesel-biodiesel combustion and emissions. Our wide-ranging computational studies are complemented by experimental research activities on biofuels production and its use in engines. We have a number of partnerships and collaborations, including with the Malaysia Palm Oil Board, Engines Research Group at The University of Nottingham UK, Combustion Engine Group at the Politecnico di Milano in Italy, and the Department of Mechanical Engineering at the Technical University of Denmark. The Renewable Energy Group focusses on many types of renewable energy research, such as solar energy (including solar thermal applications and solar desalination), biofuel production and engines optimisation, biomass pyrolysis, gasification and biogas generation from biomass, small hydro/wind energy and energy storage systems for renewable energy. We have attracted a significant amount of funding from different sources. Current partnerships and collaborations include, The SCORE project UK, Panasonic Research and Development Sdn. Bhd., INTEL corporation Malaysia, and Megaduct Sdn. Bhd. This Fuels and Sustainability Research Group focuses on sustainable energy solutions to address depleting fossil fuel reserves as well as emissions of greenhouse gases and other pollutants from the use of fossil fuels. We specialise in developing low carbon fuels in addition to carbon reduction and mitigation technologies. Current partnerships and collaborations include the Ministry of Science Technology and Innovation and Niko Resources. Our energy, fuel and power technology division offers postgraduate programmes that are at the forefront of innovative research and education in this field. Explore the possibilities and opportunities of renewable energy engineering in Malaysia and the world today. UNM offers an Engineering MPhil/PhD programme in this field. You may apply for the PhD programme directly after your bachelor’s degree. However, meeting specific admission criteria is essential. A master’s degree can enhance your qualifications and research readiness. Our energy, fuel and power technology postgraduate programmes cover a wide range of research areas including internal combustion engines, renewable energy and fuels and sustainability. Yes, UNM offers various scholarships and financial aid opportunities for deserving students. Graduates can pursue careers such as energy analysts, researchers, energy consultants, renewable energy specialists, and power system engineers. There will be positions available in both the public and private sectors. Our research and educational programmes are designed to address global energy challenges and promote sustainable energy solutions, contributing to a cleaner and more environmentally friendly future. Yes, we welcome international students. Please refer to our international students page for specific requirements and application details for international students. Renewable energy engineering is a specialised field that concentrates on designing, developing, and implementing sustainable energy systems. It revolves around harnessing energy from renewable sources like sunlight, wind, water, and organic matter to generate power, reduce carbon emissions, and promote environmentally friendly energy solutions. An energy engineer plays a big role in planning, executing, and overseeing energy systems to enhance efficiency, curtail energy consumption, and advance sustainability. They engage in a wide array of projects, encompassing the installation of renewable energy systems, conducting energy audits, designing energy-efficient structures and solutions, and managing energy use within industrial settings. A MSc (Master of Science) in energy engineering is a postgraduate programme dedicated to the exploration of energy systems, renewable energy technologies, energy conservation, and sustainable energy practices. Students will be equipped with the knowledge and competencies necessary to address energy-related challenges and contribute to the development of clean and efficient energy solutions. A MPhil (Master of Philosophy) in renewable energy is a research-oriented postgraduate programme that allows students the opportunity to delve into an in-depth study of renewable energy sources, technologies, and sustainable practices. A MPhil in renewable energy engineering usually encompasses coursework and extensive research. It prepares individuals for careers in research, academia, or industry with a focus on renewable energy. A MPhil and PhD (Doctor of Philosophy) are distinct degrees. Although both postgraduate programmes emphasise research, a PhD represents a higher level of academic achievement. It generally entails more extensive research work, and the completion of a doctoral dissertation. On the other hand, a MPhil programme may serve as a stepping stone towards a PhD. It can also function as a standalone master’s programme, depending on the university and the student’s career aspirations. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}