{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/medicine-and-health-sciences/what-is-it-really-like-to-study-sports-and-exercise-science.html",
    "content": [
        {
            "p": "Follow Luke as he takes you around our campus, including our state-of-the-art David Ross Sports Village, practical lab sessions and his favourite study spaces. University is an exciting time. You’re getting hands-on practical experience, being taught by leading academics, and building the knowledge needed for an exciting career. But university is not just about studying. It’s also about meeting new people and trying out new things. With so much to take in, how can you find the time to do it all? If this question has crossed your mind, let Luke, a Sport and Exercise Science BSc student, show you what a typical day looks like. From a tour of the state-of-the-art David Ross Sports Village and a practical lab lesson to sharing his favourite study spaces and what being a member of the rowing society involves, follow Luke as he takes you around our campus and Nottingham. Luke Knight provides an insight into his life studying Sport and Exercise Science BSc at Nottingham University. Find out more about the course here: https://www.nottingham.ac.uk/ugstudy/course/Sport-and-Exercise-Science-BSc Follow the rowing team on Instagram here: https://www.instagram.com/UONBC/ Student experience If you’re searching for like-minded individuals or want to learn about fellow students from different walks of life to understand their university experiences, we have a range of social networks you can be part of. Campus and facilities Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities. Faculty of Engineering Discover what it's like to be a student in the Faculty of Engineering at the University of Nottingham. Faculty of Science Get inspired: everything you need to know about becoming a student in the Faculty of Science at the University of Nottingham."
        }
    ],
    "pdf_files": []
}