{
    "url": "https://www.nottingham.ac.uk/student-living/contact.aspx",
    "content": [
        {
            "p": "Our office is open from 9am-5pm Monday-Thursday and 9am-4:00pm Friday. Our office is located B05 Portland Building. You can contact us on Live Chat between 9.30am and 4.30pm Monday to Thursday, and 9.30am and 4.00pm Friday. If you have any further queries, please complete our enquiry form below. We aim to respond within 2 days. If you have any queries about Hall maintenance or facilites or you need residential support through our ResX teams you can find contact details on our Hall Contacts page. Want to speak to an Accommodation Officer face to face via teams? You can book an online teams appointment with an officer below: *Please do not book a teams meeting with a Gmail account as we are experiencing issues with these email addresses receiving invites* Book your Teams Meeting here Your Residential Experience Team (ResX), is available 7 days a week, 9am - 3am Monday - Friday, 5pm - 3am Saturday and Sunday. You can find members of the team across our halls and campuses. You can also find all of the events and activities happening in your halls and on your campus focussing on improving your wellbeing and building a happy and friendly community. See what events are taking place. Find the event for you You can speak to the team via email and telephone. 0115 748 7600 Email ResX You can also find the ResX teams social media accounts across Instagram and Twitter @UoNResX The Community Engagement team work across the city to provide support to our students living in the community including Lenton, Radford and Beeston. You can find Community Engagement Ambassadors across the city helping to build positive relationships and provide support where needed. You can contact the Community Engagement team by email or on twitter. Email Community EngagementFollow us on Twitter Check out the latest edition of our Community Newsletter. We expect students to act in accordance with the University Code of Conduct during their time with us and to be ambassadors for our University. If you find an occasion where this isn't being observed, please contact the University via our helpline or use the report an issue button below.. Report an issue Community reporting guide Ancaster | Cavendish | Willoughby | Florence Boot | Dagfa | Varsity WP-West@nottingham.ac.uk 0115 748 7600 Welcome Point West, University of Nottingham, Willoughby Bungalow, Willoughby Drive, University Park Nottingham, NG7 2QR Nightingale | Rutland | Derby | Sherwood WP-Central@nottingham.ac.uk Welcome Point Central, University of Nottingham, The cottage, Beeston Lane, University Park, Nottingham, NG7 2RJ Lenton & Wortley | Lincoln | Hugh Stewart | Cripps WP-North@nottingham.ac.uk Welcome Point North, University of Nottingham, Cripps Hall Lenton Hall Drive, University Park, Nottingham, NG7 2QW Newark | Southwell | Melton WP-Jubilee@nottingham.ac.uk Welcome Point Jubilee, University of Nottingham, Newark Hall, Jubilee Campus, Nottingham, NG8 1BB If you need to find contact details for one of our partnership sites, you can find all of the details below. Just select from the dropdown the site you need."
        }
    ],
    "pdf_files": []
}