{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Politics-History-and-International-Relations/School-of-Politics,-History-and-International-Relations-Research.aspx",
    "content": [
        {
            "p": "Opened in September 2010, the School of Politics, History and International Relations (PHIR) provides the University with a unique research-hub in the fields of political science, international relations (IR) and history, located in one of the politically most dynamic regions of the world. The principal focus of our activity lies in the provision of graduate-level teaching, doctoral and post-doctoral research and interacting with governments, civil society bodies and international organisations located in Malaysia and the region. Research collaboration is promoted through The University of Nottingham’s Research Priority Groups - principally the Integrating Global Society and the Science, Technology and Society groups - and through staff and student membership of our sub-discipline, tri-campus research centres: Academics and research staff in the School of Politics, History and International Relations are currently conducting research in the following areas. national and international conferences and to cover research costs, travel and other incidentals. The research in politics, history and international relations postgraduate course at UNM is dedicated to advancing knowledge, fostering critical inquiry, and addressing real-world challenges. We are committed to developing students with a strong grasp of the world’s political, historical, and international complexities. Join us today to change the world for the better. International relations is the study of interactions between sovereign states, global organisations, and non-state entities concerning global issues, diplomacy, security and cooperation on an international scale. Politics examines governance, power dynamics, political systems, policies, and decision-making processes within local, national, and international societies. History is the analysis of past events, societies, cultures, and their impact on shaping the present and future. This is accomplished through the study and interpretation of historical records and artefacts. The relationship between history and international relations can be seen in the following ways: History provides the backdrop for understanding international relations. It provides contacts and shapes geopolitical landscapes. Historical events influence diplomatic relations, foreign policy decisions, global conflicts, or collaboration among nations. Studying history helps us learn from past mistakes and successes. It offers insights for addressing contemporary issues. History reveals how international systems develop. This helps us to understand the current global dynamics and governance structures. Research in these fields covers a wide range of topics, such as political systems and institutions, historical events and eras, diplomatic relations, global governance, conflict studies, social movements, policy analysis, human rights, and international cooperation. Collaboration often occurs through joint research projects, academic exchange programmes, collaborative publications, and partnerships between universities, research institutions and international organisations. We hope to make a global impact by fostering a global exchange of ideas and perspectives. Graduates of UNM’s Politics, History Development and International Relations PhD can pursue careers in academia, research institutions, government and non-government organisations, international agencies, think tanks, journalism, policy analysis, diplomacy, advocacy, and consulting roles. They are highly sought after due to their expertise in critical analysis, research, and communication. Yes, UNM offers scholarships, grants and other financial aid to outstanding students. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}