{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Education/Education-MA.aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/142/7/0017(2/28)MQA/SWA0650 The MA/PG Diploma/PG Certificate in Education are unique modular and flexible programmes designed to reflect the needs of individuals or organisational cohorts. While each module has its own particular focus, all are concerned with investigating contemporary educational issues in the light of economic and social contexts, appropriate literature and the shared experience of course members. A hallmark of these programmes are their commitment to equality and diversity and their flexibility to meet the needs of individuals and organisations. The overall purpose is to deepen and refine your capacity for critical reflection on your practice as well as on the mental models which inform your work. Why choose this course? As a school, we are committed to improving and investigating transformative and effective practices in Education. You will study in a supportive, dynamic and inclusive environment with an international team from across the globe. Many of our colleagues are research active with ongoing national and international research grants. The MA requires candidates to complete four taught modules (120 credits) and a dissertation (60 credits). Those with Recognition of Previous Learning (RPL) credits may study fewer modules. Each 30-credit module is assessed by a written assignment of 6,000 words (or equivalent). The 30-credit module Practice Based Inquiry is compulsory for this qualification. This is the only compulsory module. For the remainder of the credits, you can choose from any of the School of Education’s other postgraduate taught modules, including any Educational Leadership and Management (ELM) module, any Special and Inclusive Education (SIE) module and any TESOL module. In addition, you will need to submit a dissertation, worth 60 credits, which is an original piece of work and should be 14,000-15,000 words (or equivalent) on an approved topic related to one of the selected modules. Modules are taught within a block of either a three-day extended weekend or four days over two consecutive weekends. Practice Based Inquiry The content will involve you in active critical consideration of participating in and leadership of practitioner inquiry in relation to professional context mapping and workplace learning. These processes will be achieved through: Dissertation This substantive piece of scholarship within the field of the course will normally be based on interests and skills you have developed in the course of the modules already studied. You will choose a topic in consultation with your course leader and an appropriate supervisor. This module critically examines contemporary debates surrounding orthodoxies in curriculum, learning and assessment in schools, and how these relate to policy and practice. In particular, it considers the way different orthodoxies frame what children and young people learn in schools, how they learn and how assessment practices inform learning processes. The module will explore these orthodoxies in terms of their origins and purposes and it will consider alternative models from an international perspective. The module starts by considering the history, politics and ideology of the curriculum as it currently exists. It then develops understanding through application of psychological, social and cultural theories of learning and assessment. These theorised views of schooling and classroom practices enable us to analyse and critique the wide-ranging policy and research discussions about curriculum, learning and assessment that are currently underway. You will be engaged in considering how developments of, and alternatives to, current practices will impact learning and teaching in the future. This module looks at how people learn and how learning is supported in a digital age. It explores current and historical theories of learning and how they inform the design of learning technologies. It will help you understand the potential of digital technology for learning in a variety of contexts (such as schools, colleges, workplaces, museums, both face-to-face and online) and help you develop an ability to critically reflect on examples of learning technologies in current use. This module focuses on how people learn together in pairs, teams, small groups, the classroom, or an informal community. It works through classical and modern theories of social learning, explaining the social aspects of almost any type of learning and mechanisms that boost the power of learning together. Equipped with these theories, it explores the various technologies mediating and supporting social learning, such as social media, participation in the World Wide Web, online communities, online communication platforms and virtual reality. The module will address the essential features of effective learning, as relevant to your sector by examining: Programme coordinator: Dr Chai Xun Yu You can view the 2022/2023 course timetable and note this is subject to change. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A relevant second class honours degree (or international equivalent). Relevant experience may be required for some of the modules. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Malaysians applying as a matured student without the standard entry requirements but with substantial and relevant work experience (and have successfully passed APEL’s assessment through Malaysian Qualifications Agency) at an appropriate level may be considered. Admission is at the discretion of the School. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Our graduates embark on successful careers within both education and academia. Many also branch out using their acquired leadership skills to work with international organisations and NGOs. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-PGT-Schedule-2022-2023.pdf"
    ]
}