{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/accommodation-at-uon/Your-list-for-university-packing.html",
    "content": [
        {
            "p": "Our top tips and go-to list for university packing will ensure you are prepared and ready for a stress-free move to your home away from home. You’ve got your results, accepted your spot, picked your accommodation, and now it’s time to start packing. We know packing up from home and moving out is a big deal, and we bet you’ve got loads of questions. This might be your first time away from home or even your first time in the UK. We're here to support you. This quick guide and handy checklist will help you feel prepared and confident and get you packed and ready for a stress-free move to university. Before you panic buy anything and everything, remember to check on your chosen accommodation to find out what will already be provided. Most of our halls will provide: It's a good idea to look through the images of your room to get an idea of the extra space you may (or may not) have before purchasing any extras. Depending on your choice, your halls might be catered or self-catered, with a private or shared kitchen. You may be self-catered and still have a shared cooking space, so check before adding kitchen supplies to your list! Our students have created some useful vlogs to give you an idea of what it's like living in catered halls and living in self-catered accommodation. There will be loads of things that will be easier to buy when you arrive at your halls, especially if you are travelling a distance to Nottingham. If you need bits and pieces of furniture, there's an IKEA accessible by an easy bus journey. Better yet, if your parents dropped you off, get them to take you and foot the bill (including the Swedish meatballs!). If you are in shared or self-catered halls, you might want to wait to meet your flatmates before buying all your kitchen supplies, as it might be more cost and space effective to share different bits and pieces. Events Open days are a great way to learn more about your course, meet academics and chat to students. They also help you to get a feel for the place, so that you can decide whether life as a Nottingham student is right for you. Student experience As a member of the UK's prestigious Russell Group and the Universitas 21 global network of research-intensive universities, we deliver the highest standard of education, recognised worldwide. Help and support A helpful guide to take you through the steps to create a 'Find Your Nottingham hub' account. The My UoN account will help you save courses and resources to a personal portal that you may find useful throughout the application process. Applying Everything you need to know, from understanding your offer to accepting your place. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}