{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Media-Languages-and-Cultures/School-of-Media-Languages-and-Cultures-Research.aspx",
    "content": [
        {
            "p": "The School of Media, Languages and Cultures engages with the most up-to-date, dynamic, and forward-looking studies of the workings of global, regional and local societies. Our community of researchers and teachers are of international standing and our degree programmes are renowned all over the world. The school received the top rating in the UK for teaching in an independent review of teaching quality, and we are internationally recognised for the standard of our research. As convergence and digitalisation now form part of the much bigger multimedia industry, there is an increased need to make sense of the implications for society by conducting more research into the areas of communications and culture. Our research programmes provide you with an opportunity to explore contemporary cultural, media and communication theories, policy and practice in depth. Research in the School of Media, Languages and Cultures is directed through the centre for the Study of Communications and Cultures (CSCC). The centre enables substantive, focused research of this nature to be carried out, yielding results which will be of great benefit and consequence to academia, policymakers, and the wider society. Researchers at the centre are dedicated to carrying out interdisciplinary research into the role and politics of communication and culture in this era of globalisation. The centre operates as an international, regional and national centre of expertise for high-quality research, and provides an intellectual network for researchers, postgraduate students and professionals in the fields of media, communication and culture. It is currently carrying out a range of collaborative research projects with scholars from a wide spectrum of countries in and around the region, including those from Australia, India, the Philippines, Singapore, Vietnam, Cambodia and Thailand. UNM’s School of Media, Languages and Cultures offers Master’s degrees (MPhil & MRes) and PhD programmes. Admission requirements vary depending on the specific programme you’re interested in enrolling in. However, generally, applicants are expected to hold a relevant undergraduate degree to enrol in a Master’s course, and a relevant Master’s degree for a PhD course. You may also have to submit official transcripts, and letters of recommendation, and demonstrate English language proficiency. Yes, in many cases, we welcome students from diverse academic backgrounds. However, you may have to meet specific prerequisites and as such certain coursework may be recommended to bridge knowledge gaps. Yes, the university offers various scholarships, financial aid, and grants to support postgraduate students. The duration varies depending on the degree and whether you’re taking the course part-time or full-time. Part-time Media, Languages and Cultures MPhil/MRes - 2 to 4 years Media, Languages and Cultures PhD - 6 to 8 years Full-time Media, Languages and Cultures MPhil/MRes - 1 to 2 years Media, Languages and Cultures PhD - 3 to 4 years Yes, absolutely! UNM welcomes applications from international students and offers a range of support services to ensure a smooth transition to university life in Malaysia. Graduates can pursue diverse careers in fields such as academia, media production, publishing, translation and interpretation, international relations and more. The interdisciplinary nature of our programmes equips students with valuable skills applicable to a wide range of professions. Yes, we encourage student-faculty collaboration on research projects. Students will have the opportunity to work closely with faculty members on ongoing research or propose their own research ideas under faulty guidance. We welcome you to explore the postgraduate courses offered by our School of Media, Languages and Cultures. Enrol today for a well-rounded education experience. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}