{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/international-students/banking-and-money.aspx",
    "content": [
        {
            "p": "Welcome information for international students Opening a UK bank account provides a safe and convenient place for your money, supports your visa application and allows you to get paid for any work you do in the UK more easily. When you arrive in the UK to study with us, you should open a UK bank account to manage your money. You can also open an app-based or online bank account before you arrive. There are several banks to choose from, so read on for our advice on selecting the best one for you. In addition to banking, it is very important that you keep your money safe while in the UK, and we have a team who can help you with this. We also suggest planning a budget to manage your student finances, ensuring you have what you need each month while studying in Nottingham. Opening a bank account in the UK helps you avoid exchange rates and international withdrawal fees. It also makes it easier to get paid for any work and to pay bills. Most UK banks offer accounts to international students, with a wide range of options available in Nottingham. Banks in the UK will ask for proof of your student status and UK address before you can open an account. This means you will have to have completed your university registration first. Steps to open a UK bank account: 1. Research: before you arrive, research banks to find one that suits your needs. 2. Register: complete university registration when you get here, and contact your chosen bank to begin setting up an account. 3. Evidence: provide proof of identity (passport or Biometric Residence Permit) and proof of your student status and UK address. You can request a letter from Student Services using the link below. You may need to visit the bank in person to give them this information. 4. Request: ask for a letter for your chosen bank from Student Services, and work with the bank to finish setting up your account. Request a letter for your bank 5. Update: If you are receiving a bursary or scholarship from the university, update your bank details on NottinghamHub once your account is set up. You may want to consider opening an online bank account where there is no need to request a letter from Student Services or visit a branch in person. Consider the following when choosing a bank: There are three main types of UK bank accounts useful for students: Here are some of the banks you will find in the UK, with branches in Nottingham city centre. We are sharing this information to help you research these banks – we cannot recommend specific banks to you. Online-only banks include: Planning your finances ensures you have enough funds for studies, living costs and leisure activities. Click on the link below for guidance on budget planning, keeping your money safe and accessing your funds easily while studying in Nottingham. How to manage your money effectively"
        }
    ],
    "pdf_files": []
}