{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/registration/",
    "content": [
        {
            "p": "All students need to register for each year of their studies You are required to register initially as a new student at the start of your course and then re-register at the beginning of each academic year as a returning student. This confirms your intention to study at the University of Nottingham as well as providing you with access to our services, buildings, Moodle, your personalised timetable, funding (if applicable) and more. You must complete online and in-person (on campus) registration within 3 weeks of your course start date (1 week for CELE students). For undergraduate and postgraduate taught students joining the university on 23 September 2024, your deadline is 14 October 2024. For postgraduate research students joining on 1 October 2024, your deadline is 21 October 2024. This is with the exception of those studying part time or taking distance learning courses. If this applies to you, you are only required to register online. Once you have completed all parts of your registration you will receive an email to your University email account to confirm your registration is complete within 24 hours (excluding weekends). If you are an existing student returning to your programme of study, you only need to complete online registration. This needs to be done as soon as possible to avoid delays with your funding at the start of term (if applicable). The latest date to complete your registration is 7 October 2024. For students who are returning from a period of interruption, this needs to be done within 2 weeks of your return date. Please refer to our key dates. Once you have completed your online registration you will receive an email to confirm your registration is complete within 24 hours (excluding weekends). Online registration - returning students If you are unsure what to do next or if you have any questions about your registration, please refer to our FAQs. You can also contact us or visit our student enquiry centre."
        }
    ],
    "pdf_files": []
}