{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Economics/School-of-Economics-Research.aspx",
    "content": [
        {
            "p": "Nottingham’s School of Economics celebrates its 100th anniversary this year. It is highly regarded and established as one of the best economics schools in the world. The School of Economics was established in 2010 at Malaysia and in 2011 in the Ningbo Campus in China, confirming our position as truly global. In the most recent Research Assessment Exercise (RAE), the School was ranked 3rd in the UK, behind only Oxford and Warwick, on the ‘research power’ measure – which takes into account both quality of research and the number of researchactive staff who were returned in the RAE. On the ‘grade point average’ measure we were ranked sixth in the UK. The Globalisation and Economic Policy Centre (GEP) is a major research centre studying the impact of globalisation and economic policy. GEP has built an international reputation. The Centre’s academics have advised the UK Treasury, the World Bank and World Trade Organisation. The Malaysia branch runs regular events including an annual international conference, seminars, workshops and public lectures. PhD economic programmes and research in economics experience open doors to diverse career opportunities including but not limited to the following: Economic research and analysis: Explore roles as an economic analyst or researcher in government agencies, financial institutions or well-known think tanks. Policy development: Play a vital role in influencing public policy by working as an economic policy advisor. Financial services: Choose a career in banking, investment, or finance. Analyse market trends and offer your expert advice on financial strategies to clients. International organisations: You will be able to make significant contributions to global economic development with organisations such as the United Nations or the World Bank. Academia: Shape the future of economics and raise the next generation of economists by pursuing roles as a researcher or professor. With a PhD in economics, you will be able to pursue careers in academia, work in government organisations, contribute to economic think tanks, join the private sector as an economist or consultant or even become an expert in financial analysis. Your experience in economics research will be invaluable. Yes, it is worth it if you are passionate about this field. You will have opportunities for high-level research in economics and intellectual growth. An economics PhD will open doors to many prestigious careers. Yes, PhD economics programmes can be challenging as there will be rigorous coursework, complex mathematical modelling and extensive research work. However, the intellectual rewards and career prospects will make it worthwhile. Yes, economics PhD holders are in demand. Many sectors and industries require economic analysts, policy development and researchers. Economists with advanced degrees and a deep understanding are sought after in academia, financial institutions, research organisations, government organisations and numerous other industries. Yes, your application for a PhD in economics is welcome and applicants with degrees or experience in related fields will be considered. However, certain prerequisites may need to be fulfilled before you are accepted into the programme. All applications are considered on a case-to-case basis. Current research in economics at UNM includes: Advanced Macroeconomics Advanced Microeconomics Theory Advanced Applied Econometrics Econometrics Methods Macroeconomics Methods Microeconomics Methods Yes, UNM provides scholarships, grants and funding to support students who are part of our PhD economics programme. Yes, the University of Nottingham welcomes international students and offers resources such as our international student services. Join us and explore the complexities of economics to make a lasting impact on the global economy. Explore our postgraduate economics courses to learn about what UNM has to offer. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}