{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Education-BA-Hons-U6UEDUCA.html",
    "content": [
        {
            "p": "Jubilee Campus, Nottingham, UK Are you interested in exploring formal and informal education through a variety of perspective disciplines such as sociology, psychology, philosophy, history and politics? Do you want to keep your career options open? Then our BA Education degree is the perfect choice for you to explore a wide variety of educational practices and ideas. Our course will help you challenge established educational practices and debate issues such as social justice in education, inclusion, alternative education, and education and mental health. You’ll cover concepts in learning in the digital age, global education, and the impact of cognition and development on learning. One of the highlights of our degree is the placement module, which offers an excellent opportunity to put your understanding of educational theories into practice in a real-world setting. This experience will not only enhance your learning but also strengthen your CV, giving you a competitive edge in the job market. Additionally, you’ll have the opportunity to study abroad for a semester at our Malaysia campus, giving you an exciting international perspective on education. This experience will enhance your understanding of different cultures and approaches to education. Mandatory Year 1 Big Ideas in Education: Inclusion, Equalities, Rights and Justice History of Education Joining the Academic Community Learning and Development The Purposes of Education Optional Exploring and Developing Education Collaborations Literacy, Learning and Education Mathematics and Science in Schools Understanding Counselling in Education The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Monday 18 November 2024. Due to timetabling availability, there may be restrictions on some module combinations. You will have approximately 12 to 14 hours of contact time per week in lectures, tutorials, seminars and placements. You will also be expected to engage in independent study. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). Jubilee Campus has eco-friendly buildings, alongside green spaces, wildlife and a lake. This campus is home to our business, education and computer science schools, as well as a sports centre and student accommodation. I loved the alternative methods of teaching and assessment we were able to try, as well as seeing the impact of student voice and opinion on the course. Elizabeth Jennings 2021 BA Education graduate 91% of students say teaching staff have supported their learning well. Data for Education (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Social Sciences Entry requirements ABB UCAS code L300 Duration 3 years full-time (available part-time) Start date Sep 2025 Faculty of Science Entry requirements AAA UCAS code C800 Duration 3 years full-time Faculty of Arts Entry requirements AAB UCAS code V500 UCAS code V100 If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}