{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Biosciences/Biosciences-research-programmes-MPhilPhD.aspx",
    "content": [
        {
            "p": "UNM/JPT-R/421/7/0036(7/26)MQA/SWA0820 UNM/JPT-R/421/7/0035(7/26)A7510 UNM/JPT-R/421/8/0034(7/28)MQA/SWA0822 We offer high-quality doctoral training to postgraduate students who wish to pursue an MPhil, MRes or PhD. As a research student, you will work under a supervisor who will assist you in your research and thesis design. An MPhil is a shorter research degree where you will do a research project over one to two years. The PhD involves an independent in-depth research project which allows you to develop additional skills through different training programmes offered by the School. Both MPhil and PhD are assessed by a research thesis. For MRes, it is usually a one-year programme that includes both taught modules and a research project. You will also have regular meetings with your supervisor and annual review of your research progress. Current research areas of interest within the School include development of climate resilient crops, exploration of underutilised crops to enhance food and nutritional security, reduction of food waste and much more. Bioscience is an internationally important and rapidly advancing field offering promising careers for well qualified graduates to significantly impact society. Research in the School of Biosciences addresses key global challenges increasingly focused on the United Nations Sustainable Development Goals (SDG). With help from the graduate school, postgraduate students in the School of Biosciences are provided with different training courses. These courses will allow you to develop a range of transferable skills in oral and written communication, career management, networking, team working, research methodology and management, information technology, teaching and learning. The School has excellent links with the UK School providing close contact with world class researchers from both campuses. UNM’s training closely follows our academics research topics meaning that your learning will be up to date, relevant and applicable to the global issues of today. Most of our academic staff are research active with well-connected national and international research collaborations. We constantly strive to incorporate the latest state of the art technologies into our research. As a research student, you will work under a supervisor who will assist you in your research and thesis design. Our current research themes include: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A master's degree (or international equivalent) plus, an upper second class honours degree (or international equivalent) in an agricultural, biological or other relevant science disciplines. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Or A first class honours degree (or international equivalent) in an agricultural, biological or other relevant science disciplines. Non-UK qualifications will be assessed against this standard. MPhil and MRes An upper second class honours degree (or international equivalent) in an agricultural, biological or other relevant science disciplines. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. The broad scientific training offered by the School’s postgraduate research programmes leads to a range of career options for many graduates. As a world class educational facility, students will learn valuable transferrable skills to take into industry or further education. Careers and job titles include; scientific officers and managers, product development executives, academic teachers, agricultural and environmental consultants, food and nutrition advisers and scientific writers. Other career prospects include positions within industry, for instance as a forensic biologist or in pharmaceutical development, business management, food manufacturing or maybe as a successful bio-entrepreneurs. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}