{
    "url": "https://www.nottingham.ac.uk/studentservices/money/cost-of-living.aspx",
    "content": [
        {
            "p": "Students are among the groups most likely to be affected by the cost-of-living challenge. This webpage highlights all the information, advice and support available to you at the university. MyWellbeing Hub (part of your online Student Life hub) brings together mental health and other welfare support available on campus and online. The hub can help you make contact with our Support and Wellbeing team, or to access a range of resources and services. You may find yourself in financial difficulty as a result of the cost-of-living challenge. There are university support funds you may be eligible to apply for, along with services and facilities that could help manage and stretch your budget. If you are already claiming all the support you are eligible for from the Government - including your student loan - but are still struggling to make ends meet, you may be eligible to apply to the Student Hardship Fund. There’s also the Student Crisis Fund. This provides small, interest-free loans to students experiencing financial difficulties because of an unexpected change in their circumstances after admission to the university. When applying, make sure you read the application guidance carefully, including the evidence required to support a claim. We want to process applications as quickly as possible - a full picture of your financial situation helps us get funds where they are needed most. Find out more and apply Many students look for part-time or temporary work while studying. You can find more information on our Careers and Employability Service webpage. Please be mindful not to take on too much work, as outlined in the guidance on student employment during studies. If you feel like you’re taking on too much work, please consider applying for one of our support funds. As part of the university’s Career and Employability Service, Unitemps can help you find part-time and temporary work that fits around your studies. It doesn’t need to be directly related to your degree and there are a variety of opportunities available. This includes administrative work, marketing, events and hospitality work, translation work, project work and many more. It also includes opportunities available at the university and the Students’ Union. Becoming a student ambassador will allow you to not only increase your income, but to complete meaningful work, develop new skills and boost your CV. We have many ways for you to get involved and you can find out more on our student opportunities webpage. We have a number of kitchens across our campuses for you to use our free microwave, toaster and hot water facilities. Please see the list below to find the kitchen closest to your school. Jubilee Sutton Bonington Queens Medical Centre You can keep your home energy bills down by using our free shower facilities at various locations across our campuses. Too Good To Go We have teamed up with Too Good To Go to tackle food waste. Download the app to buy unsold fresh food at a great price. At the university, collections are currently available at: Free period products are available across our campuses - please keep a look out for the Project Period signs. If you would like to see provision of period products available in additional locations not yet catered for, please contact your local building operations manager. Our Students' Union has also implemented Community Cabinets. These are here to provide easy access to free period products, condoms and pregnancy tests. The cabinets are located at central points around Portland Building (The Studio, opposite Blackwell's, near SU Advice and outside the Get Involved Zone). We have increased our study spaces across our campuses. If you’re wanting an alternative place to work that won’t contribute to your heating or electricity bills, you can use our new resource booking system. Study spaces are available in our libraries - some spaces can be booked in advance including PC, group study spaces and more. Three libraries will be open 24/7 throughout most of term time. We have a Laptop Loan and Repair service, if you're having any problems with your device. All you need to do is request an appointment and our Digital and Technology Services team will be able to assist you. For any cyclists, Dr Bike is a free on-site bike maintenance service. The mechanic will give cycles a thorough check and make minor repairs, such as changing brake blocks and tightening brakes. The service and any parts used are free of charge. You can find out more about the service - including dates of sessions - on the Dr Bike webpage. We have recently signed up to the Student Mental Health Charter to help us enhance our mental health support. There are a number of services and support mechanisms available to you: Further information and resources can be found on our mental health and wellbeing support webpage. We would recommend speaking to our Funding and Financial Support team who can best advise the support available to you in your circumstances. International students must demonstrate that they have sufficient funds to support themselves throughout their studies as a condition of their visa. Therefore, international students are only eligible to apply for The Student Crisis Fund. This fund can provide small, interest-free loans to students and research students experiencing financial difficulties because of an unexpected change in their circumstances after admission to the university. Grants may be awarded in some circumstances. If you are experiencing any financial difficulties because of an unexpected change in your circumstances after your admission to the university, you may be eligible for The Student Crisis Fund. This fund can provide small, interest-free loans to researchers and grants may be awarded in some cases. You can speak to our Funding and Financial Support team who will be able to assist you with identifying appropriate funds and submitting your application. This can include funds such as: How can I keep travel costs down? University Park Nottingham NG7 2RD Please see our need help page for telephone and online contact points"
        }
    ],
    "pdf_files": []
}