{
    "url": "http://www.nottingham.edu.my/Study/Undergraduate-courses/Biosciences/Nutrition-BSc-Hons.aspx",
    "content": [
        {
            "p": "UNM/JPT-R3/0721/6/0003(8/29)MQA/SWA0156 Nutrition is the study of nutrients in food coupled with how the body uses them and their relationship between diet, health and disease. Through evidence-based research, students will learn to identify facts from fiction concerning dietary recommendations and healthy eating. They will learn how to handle and prepare food, where to identify key nutrients and the impact of processing on the nutritional quality of foods. BSc (Hons) in Nutrition programme has been accredited by the Association for Nutrition (AfN) (reference no AC339) and is the only AfN accredited programme in Malaysia. (Date accreditation was granted on 1 May 2024; Date due for reaccreditation: 18 March 2029). AfN Programme Accreditation is a quality mark awarded to degree programmes which meet the high standards required by the AfN. Through a combination of theoretical learning and practical experiences, students learn about various aspects of nutrition, including macronutrients, micronutrients, dietary requirements, metabolism, and the impact of nutrition on human health. By studying this programme, students gain valuable knowledge and skills that are crucial for understanding and promoting good nutrition practices in individuals and communities. Additionally, students will explore global issues in Nutrition including the role of food and diet in relation to health and disease. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 77% average based on 6 subjects including 2 subjects from Biology; and/or Chemistry; and/or Physics/specific subject in mathematics. Consideration to be made based on relevant individual grades if specific subjects are required. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. In addition to the entry requirements listed above, applicants must have at least a credit (normally grade C) in mathematics at SPM/GCSE/IGCSE/ High School Diploma or equivalent for an entry to Biotechnology. This requirement can be waived if applicants have obtained similar or equivalent grade at a higher level. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Science is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Science. This rigorous programme provides students with a strong academic background that will result in enhanced language, mathematics, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as chemistry, ecology, computer programming or psychology. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Nottingham’s Nutrition graduates are highly sought after worldwide. Nutrition graduates go on to work in a diverse range of roles and markets with job titles such as; Nutritionist (public health, clinical), Nutrition Advisor, Food Scientist, Food Analyst, Project Manager, Consultant, Educator and Advocator in both the public and private sectors. Alternatively, many of our degree graduates who pursued academic excellence opted to further their postgraduate study within the Schools’ postgraduate (MRes / MPhil / PhD) programmes. Yes, the curriculum incorporates practical experiences and internships to provide students with hands-on learning opportunities. These experiences may include laboratory work, clinical placements, community projects, or industry attachments, allowing students to apply their knowledge in real-world settings. Graduates of the programme can pursue various career paths in the field of nutrition and health. These may include roles like a nutritionist or dietitian, public health nutritionist, food and nutrition consultant, research assistant, nutrition educator, or roles in the food industry, among others. Yes, upon completion of the programme, students can consider pursuing postgraduate degrees, such as master's or doctoral programmes, in nutrition or related fields. This programme provides a solid foundation for further academic and research pursuits. The University of Nottingham Malaysia offers a range of scholarships and financial assistance options for eligible students. Yes, the programme provides research opportunities that allow students to delve deeper into specific areas of nutrition. Under the guidance of our expert faculty members, students can undertake independent research or collaborate on ongoing projects to contribute to the field of nutrition. Learn more about the school’s research portfolio here. Yes, the University of Nottingham Malaysia often invites industry professionals and experts as guest speakers or for interactive sessions. This helps the students to gain insights into current trends and practices in the field of nutrition. This content was last updated on 06 August 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}