{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Computer-Science/School-of-Computer-Science.aspx",
    "content": [
        {
            "p": "Computer science is intimately concerned with knowing – in detail – how computers and computer systems work. Building on that knowledge helps us understand how we can create computer systems and program them to do what we want them to do. It is also about the way computers store and process information and how humans and computers interact with each other. The School of Computer Science undertakes world-class research which feeds directly into undergraduate teaching with an exciting range of optional modules and research-related project work. Teaching staff at the Malaysia Campus consists of both local and international academics. Their interests cover all aspects of computer science, and they are all actively engaged with undergraduate teaching. Our degrees in computer science and software engineering produce highly employable graduates and provide the basis for rewarding and lucrative careers. computers don’t now play an integral role. They are in our phones, our cars, our televisions. They help doctors to monitor our health, artists to create visual images and special effects in movies, and are a standard tool for musicians. Computing professionals are the architects of this new information age. They look at engineering issues to build tools that help us create large-scale software systems. Computer scientists also consider philosophical issues about what can or can’t be computed, and ask profound questions about the fundamental nature of the ‘computation’ process. At the Univeristy of Nottingham Malaysia we offer the following undergraduate degree programmes within computer science. Each year of your degree will be divided into two semesters, with exams at the end of each semester. Each module will be taught by an experienced academic, supported by lab and tutorial sessions. The lab sessions and tutorials provide support and hands-on practice in applying lecture material. The programme also utilises modern teaching methods such as e-learning and social media. Our single honours degrees have a common first year, allowing you to easily move between our degrees at the end of Year 1. The first year of the computer science and software engineering degree consists of modules that develop your understanding of six major themes: operating systems and architecture, programming, mathematical foundations, software engineering, net-centric computing, intelligent systems and human-computer interaction. On the first year of our joint honours course in mathematics and data science, you will study a subset of the computer science modules as well as key modules provided by the School of Mathematical Sciences. The second year of your degree revolves around a year-long software engineering group project. You will cover a relevant area designed to simulate what it is like to work on a real software project. You will also undertake more advanced study of core computer science (including programming, networks, data structures, logic and concurrency) and further specialist modules, as well as topics from a selection of optional module. While many computer science graduates do become programmers, others are employed in a wide variety of jobs. These include computer analysts, IT consultants and planners, network/systems designers and engineers, researchers, software designers and engineers, web designers, web developers and producers as well as roles across advertising and marketing, business and financial analysis, accountancy and investment/merchant banking and legal and quality assurance professions. Some of our graduates have gone on to work for traditional computer companies such as Adobe, Google, Hewlett-Packard, IBM and Microsoft. Others have found jobs with employers such as Accenture, Experian, and Ocado. New computer science graduates frequently command some of the highest-paid entry-level positions compared to graduates in other disciplines. Many of our graduates continue to further studies in subjects such as machine learning, e-commerce, information security and psychology. Given we live in a digital age, Computer Science will only grow in importance, with many career opportunities in tow. Are you passionate about technology and innovation, and enjoy problem-solving? Do you aspire to build your tech startup as an entrepreneur? Are you fascinated with Artificial Intelligence (AI)? If you’ve answered yes to any of those questions, then this course would be perfect for you. If you intend to pursue a degree in computer science, the following subjects in SPM are recommended: Yes, plenty of them. In fact, in your second year, you will be required to undertake a software engineering group project, while in your third, you will propose your own project, enabling you to enhance your research skills and specialise in your area of interest. No, work experience is not required for enrolment. However, relevant work experience may be considered and taken into account during the admission process. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}