{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Applied-Psychology/Management-Psychology-MSc.aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/311/7/0077(3/28)A7262 Take the next step in your career by applying psychology to the world of work. This course will help you to manage people, even if you've never studied psychology before. You'll learn how to effectively motivate employees, how to train them, how to recruit them, how to design job specifications, how to assess performance, how to manage well-being and how to lead along with learning how to manage organisational change and diversity in the workplace. At Nottingham, we make sure the course has a practical focus and aim to improve your skills as a practitioner. You'll learn about consultancy as part of your studies and gain a good grasp on research methods applicable to the workplace, something that is particularly valuable to future employers. You'll be taught by research-active experts in the field, some of whom completed their own MSc’s at Nottingham Malaysia. By the end of the course, you should be ready to apply what you've learned to the real world of work. Management Psychology applies psychological principles and theories to address practical issues in business, organisations, and management. The MSc in Management Psychology at UNM is offered on a full-time and part-time basis. The division has adopted a blended learning approach built around three learning modes: Students will apply newly acquired skills to practical work through modules including: You will complete 120 credits of taught modules plus an empirical research project worth 60 credits on topics relevant to your specialist area of interest. The programme is organised in workshop-based modules. Modules vary from 10 and 20 credits. Twenty credit modules are organised over two weeks with face-to-face teaching taking place during two consecutive weekends and three weekday evenings. Ten credit modules require face-to-face teaching over one weekend and three weekday evenings. The schedule for the different modules will be published in advance so that you can plan your time accordingly. The timetable for taught modules for the year ahead will be published each August. Your empirical project will be planned in the final semester of study. Our assessment strategy reflects our focus in applied skills and academic applied psychology. Typically, each module is assessed by a combination of coursework, exam, practical activities and a short reflection on the learning process. The assessment requirements and percentages carried by each activity/task per module are outlined in the tables below: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. An upper second class honours degree (or international equivalent) in a relevant field. Non-UK qualifications will be assessed against this standard. Applicants will be considered if they have a first degree in a relevant subject such as management, psychology or other related disciplines. If deemed necessary, applicants may also be required to attend an interview. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Modules are assessed by a combination of exams and coursework at the end of the relevant semester. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. KLTC is a UNM facility located in the heart of Kuala Lumpur. Select postgraduate programmes from business, politics and applied psychology are delivered here to support the flexibility of postgraduate students. The centre also served as a supplementary venue for the University’s external events, seminars and conferences. KLTC is located on the second floor of Chulan Tower, near the Petronas Twin Towers and the Bukit Bintang district. It is easily accessible via the city’s train system, with the building located next to the Conlay MRT station. Free shuttle bus services are also available from the UNM Semenyih campus to KLTC. Management psychologists are well paid and in high demand as they make a positive difference to organisational culture, productivity and performance. Most work within a variety of large public or private organisations, often specialising in specific areas of work psychology. Some choose to work for psychology and management consultancies or other management level posts. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}