{
    "url": "https://www.nottingham.ac.uk/studywithus/student-experience/nottingham-city.aspx",
    "content": [
        {
            "p": "Nottingham is ranked as the 9th best city in the UK for students and 50th in the world, according to the QS Best Student Cities 2023. Museums, theatres, art galleries, multiplex and arthouse cinemas, literature events, music festivals and venues, you'll never be short of things to do in Nottingham. Events listing – Left Lion magazine What's on – Visit Nottinghamshire There's dining options to suit every budget in Nottingham. With its mix of independent and chain cafes, restaurants, delis and outdoor markets, eating out in the city is an eclectic and international adventure. You'll find a large selection of traditional pubs and modern cocktail bars in the city. Nottingham is home to Ye Olde Trip to Jerusalem, one of the oldest pubs in England, which is built alongside the caves of Nottingham Castle. Named one of the best and safest places for a night out in the UK. Nottingham has been awarded a Purple Flag award for nine consecutive years. From clothes to comics and vintage to vinyl, small independents and retro shops nestle alongside big high street names to earn Nottingham a reputation as one of the country’s top shopping cities. Find vintage bargains in Hockley, designer boutiques in the Exchange Arcade and your favourite high street shops in the Victoria and Broadmarsh shopping centres. Exciting local attractions include: Visit Nottinghamshire – Things to do in Nottingham You can also venture further afield and experience thrills at Alton Towers theme park or explore the picturesque Peak District or Sherwood Forest - home of the Major Oak. The city of Nottingham is home to a wide range of sports centres, including: The city is also home to Nottingham Rugby Club and two football clubs, Nottingham Forest and Notts County Football Club. Spectators can also enjoy international cricket at the Trent Bridge Cricket Ground. The National Water Sports Centre is the perfect hangout for adrenaline junkies. If you prefer something more relaxed, you can hire a canoe or rowing boat for a quiet day on the River Trent. How to apply Fees and funding"
        }
    ],
    "pdf_files": []
}