{
    "url": "https://www.nottingham.edu.my/Study/Offer-holders/Information-for-offer-holders.aspx",
    "content": [
        {
            "p": "We recommend that you respond to your offer as soon as possible. Please carefully review the acceptance instructions for your course to identify any specific deadlines and requirements that may apply to you. It is mandatory to read the information provided in the \"Welcome to the University of Nottingham Malaysia\" link below before accepting your offer. Information for Master of Pharmacy (Honours) Applicants on Fitness to Practise Information for Bachelor of Pharmacy (Honours) Applicants on Fitness to Practise For progressing students (foundation to undergraduate), please liaise with the Visa Office and Accommodation Office regarding student visas and accommodation. For inter-campus exchanges and exchange students from partner universities, kindly contact International Student Support. The course deposit is not applicable, but you MUST accept your offer through our online application system, NottinghamHub. NottinghamHub Method of payment as a Malaysian or International student varies. Refer to the payment process page for relevant information. Apply for accommodation once you submit your course application. Important information for international students on required immigration and health checks. Obtain your student pass and visa (international students only). Check out current students and student registry for information on timetables, exams and academic support, etc. Registration and Induction Student Handbook General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/Welcome-to-the-University-of-Nottingham-Malaysia-Jan-2024.pdf",
        "pdf_files/Admissions-key-dates-2024-Entry.pdf",
        "pdf_files/Contact-details-2024-v2.pdf",
        "pdf_files/Information-for-Master-of-Pharmacy-Honours-Applicants-on-Fitness-to-Practise-2024.pdf",
        "pdf_files/Information-for-Bachelor-of-Pharmacy-Honours-Applicants-on-Fitness-to-Practise-2024.pdf",
        "pdf_files/Student-Handbook.pdf"
    ]
}