{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/see_all_articles.html?path=L2NvbnRlbnQvdW9uL2diL2VuL3N0dWR5d2l0aHVzL3Vnc3R1ZHkvYXJ0aWNsZXMvZXhwbG9yZS1tb3JlLWFydGljbGVzL2NlbnRyYWwvamNyOmNvbnRlbnQvcm9vdC9jb250YWluZXIvY2Fyb3VzZWxfMTk5NTI5NDg5Mw==&variant=c3RhdGlj&title=RGVsdmUgaW50byB3aGF0IGxpZmUgaXMgbGlrZSBhcyBhIHN0dWRlbnQgYWNyb3NzIG91ciBjb3Vyc2Vz",
    "content": [
        {
            "p": "Article type 1 - 28 of 28 Campus and facilities Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities. The University of Nottingham, University Park, Nottingham, NG7 2RD Jubilee campus The University of Nottingham, Wollaton Rd, Lenton, Nottingham NG8 1BB Sutton Bonington campus The University of Nottingham, Sutton Bonington, Leicestershire, LE12 5RD, UK Ningbo campus, China If you're looking for a British style degree and the opportunity to study in Asia, consider a course at one of our international campuses in China and Malaysia. Beyond a welcoming community, the facilities you’ll find at the University of Nottingham will provide you with the complete package for a great student experience. Medical Schools Gain the experience you need at major hospitals and healthcare facilities in the region. Start your journey to become a doctor, learning from world-leading researchers and clinicians to achieve your goals in Lincoln. This is the place where your student experience comes to life Scholarships and bursaries Discover information that may help you fund your study at the University of Nottingham. Competitive funding opportunities based on a range of factors, such as financial need, academic potential or non-academic skills Non-competitive, guaranteed funding for eligible students International Students Discover all the relevant information related to studying in the UK. Once you have an unconditional offer from a university, or you have met the requirements they have given you, apply for the relevant visa. Most students coming to study full-time in the UK need a student visa. You will also need to complete the form and make the payment for the healthcare surcharge. Coming to the UK as an international student is a fun adventure with lots of chances to learn and grow. Enjoy the British culture, get involved with the university community, and ask for help when you need it. UON Everything international students need to know about how to register for NHS healthcare while studying in the UK. Everything you need to know about travelling to Nottingham once you have reached the UK - a guide for international students. Find out what international students can expect from the University of Nottingham open days, whether you join us online or in person. This article explains what to expect in the UK, what differences in the way of life from your home country may cause some culture shock and how you can prepare yourself to make the move less stressful. Find out why thousands of international students choose to study with us every year. This guide will take you around the UK and make a few suggestions to get your wanderlust fired up in each of the four nations. Find your home away from home at the University of Nottingham Finding the familiar in a new city Life in Nottingham Welcome to Nottingham! It’s known for its role in the Robin Hood legend and for the hilltop Nottingham Castle Museum and Art Gallery, rebuilt many times since the medieval era. In the Lace Market area, once the centre of the world’s lace industry, the Galleries of Justice Museum has crime-related exhibits. Wollaton Hall is an ornate Elizabethan mansion with gardens and a deer park. Nottingham and Nottinghamshire The city has many highlights if you consider studying at the University of Nottingham. Here are the \"hidden gems\" students should know about when visiting Nottingham. Find out more about Nottingham and what the city is famous for. Nottingham is considered to be a generally safe city, with low crime rates, find out more below. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}