{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/transfer-interrupt-or-withdraw-from-your-studies/",
    "content": [
        {
            "p": "Things don't always go to plan. There are many reasons why you might need to interrupt your studies, transfer, or withdraw from your course. Before making any decisions you should always talk it though with your school or department to ensure that you are making the right choice for you. Undergraduate full-time transfers Students who wish to transfer from another institution to the University of Nottingham for an undergraduate course should contact Admissions initially to check eligibility. This is because courses may not be able to consider applications for year 2 or 3 entry due to accreditation requirements, core modules that may not be covered by other providers and/or lack of vacancies on the course. If the course supports transfers, Admissions will check to see if an offer for a place on year 2 or 3 can be made (depending on course vacancies, previous qualifications, previous study and if any core modules are required). If a transfer would be considered, an application should then be made through UCAS. The standard application process would then apply. A Recognition of Other Learning application may also be required depending on the year of entry. Other information on the detail of transfers is included in this policy. Postgraduate transfers Students wishing to transfer their study on a postgraduate taught or research course should contact Admissions. Applications should be submitted through NottinghamHub. They are assessed by the relevant academic department and transfers will be subject to the recognition of other learning process. Partnerships A number of teaching partnerships exist and are covered by a Memorandum Of Agreement between the University of Nottingham and the partner institution. Applications to partnership courses are normally submitted through UCAS or NottinghamHub. More information can be found as part of the recognition of other learning process. If you are considering a transfer of course our quality manual is a good starting point, as there are some conditions attached to the transfer process. However, please note that not all courses offer the opportunity for transfer onto them, please check the lists below to see which courses may be available. Please note, for all transfers you must meet the entry criteria for the course. Please ensure you check that you meet the entry criteria on the online course catalog before requesting a transfer. Requests to transfer will normally need to be received either prior to or within three weeks of the start of the session/semester. Find out more about course transfers If you have decided that you wish to study elsewhere, the first thing that you should do is enquire with your chosen university/higher education institution as to whether that will be possible in your circumstances. When you have secured a place you will need to be released from the University of Nottingham through our withdrawal process. complete the withdrawal form and return to Student Services. We would encourage you to still have a conversation with your personal tutor or course director to ensure that this is the right decision for you. You may want to interrupt your studies. Voluntary interruption of study is one of the ways the university can support you through personal difficulty and can also be used in other time-limited circumstances (for example, by SU sabbatical officers). You should make your request to your school, and it is for the school to decide whether or not to recommend the interruption, taking into account the guidance found in the Quality Manual. In the case of research students who have already had an interruption of a year, any further extension will only be approved in exceptional circumstances. Further details and interruption forms can be found on the quality manual voluntary interruption of study webpages below. Quality Manual voluntary interruption of study As an apprentice you may request to take a break in learning from your apprenticeship if you plan to return to the same programme at a later date. You may take a break in learning either with, or without a break in employment and the reason for the break and its expected duration must be discussed and agreed with your employer. Examples could include medical treatment, parental leave or leave for other personal reasons. You should request the break in learning through your programme team or relevant Degree Apprenticeship Officer who will be happy to guide you through the process. You may still have to pay/owe tuition fees if you interrupt your studies or withdraw. Tuition Fee charges are payable up to the date on your record the interruption started or the Last Date of Attendance if you withdraw. You will be liable for fees as specified in the table in section 1.3 of the fee regulations. If you or your sponsor have already paid the course fee in full, then (subject to the University refund policy) any overpayment will be refunded to the fee payer on request. A full breakdown of liability of tuition fees whilst interrupting or in the event of a withdrawal can be found on the tuition fees webpage. Please note you are also likely to be charged tuition fees on your return to study. For tuition fee queries, please raise an enquiry. You need to consult your funding body (e.g. Student Finance England or other sponsor) before interrupting your registration. The university is not able to guarantee the resumption of any external grant or loan. The Student Loans Company (SLC) will be informed by the university when a withdrawal, transfer or interruption has been processed in cases where students are in receipt of a loan. You should also contact the SLC (your relevant funding body eg Student Finance England or Wales) to inform them of your change of circumstances The Funding and Financial Support team can offer advice and guidance to students funded through the SLC and will be able to discuss the impact your decision may have on your funding. If your registration status is interrupted, you are not able to attend any teaching or take any assessments. In addition, when you have interrupted your studies you will not pay tuition fees whilst un-registered. Depending on the length of interruption you may not have access to library or IT facilities. You will be subject to relevant regulations of the university, such as traffic regulations, the regulations for library and computer Use and the university's code of discipline for students. You will need to contact your accommodation provider to discuss your change of circumstances (including where your accommodation is managed by the university). You should expect that you will remain liable for your full year’s accommodation fees in most instances. Visit the Accommodation services website for further details. Changes to your student status may have an impact on your student immigration status. For more information on your specific situation, please see student status change immigration advice or contact the Visa and Immigration team for further advice. If you have successfully completed one or more stages of your course you may qualify for an award. If you have any questions about this please get in touch. You will receive a diploma supplement listing your modules and marks with your certificate after your award is conferred. You can also get a document confirming the marks and modules you have completed prior to your withdrawal from our online store. Careers advisers within the Careers and Employability Service offer independent and impartial guidance. They can help if you have changed your career intentions since starting your course and with the career implications of not completing your degree or starting a new one. They can also help you think about possible employment options if you are looking for work during an interruption in your studies or if you are thinking of leaving higher education altogether, as well as referring you to useful sources of help and advice. If you are a postgraduate researcher, every year you will need to go through an annual review process which may include a request for a transfer or an additional period of study. Our Quality Manual covers this in detail, including a forms and documentation section. Quality manual Research degree programmes"
        }
    ],
    "pdf_files": []
}