{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/postgraduate-research/key-dates-postgraduate-students.aspx",
    "content": [
        {
            "p": "You are required to submit your thesis for examination by the submission deadline given to you during your studies. The dates below are estimates for graduation guidance only and vary across campuses and years. Even when they have been correctly observed, no guarantee can be given that the necessary examination procedures will have been completed in time for a candidate to graduate at the next degree congregation. Date for final version of the work to be approved by examiners and award recommended is around 15 June annually. Once your award is recommended we will issue you with a formal outcome letter, and pass your details onto graduation team, who will then invite you to the next available ceremony. To be in a good position to receive your outcome by 15 June and graduate in July, we would recommend you submit your \"Notification of Intention to Submit\" form by no later then end of December so that we can start the process of appointing your examiners. Please note that examination timescales vary depending on availability of examiners and your recommended corrections, there is no guarantee that all the procedures can be completed in time for the next in person congregation. Date for final version of the work to be approved by examiners and award recommended is around 15 November annually. Once your award is recommended we will issue you with a formal outcome letter, and pass your details onto graduation team, who will then invite you to the next available ceremony. To be in a good position to receive your outcome by 15 November and graduate in December, we would recommend you submit your \"Notification of Intention to Submit\" form by no later then end of May so that we can start the process of appointing your examiners. Please note that examination timescales vary depending on availability of examiners and your recommended corrections, there is no guarantee that all the procedures can be completed in time for the next in person congregation In addition to the two degree congregations in July and December, there are multiple inter-ceremonies throughout the year. These allow you to graduate and receive your certificate but not attend a ceremony. For more information see graduation website here: Inter-ceremony graduation"
        }
    ],
    "pdf_files": []
}