{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/English/School-of-English-research.aspx",
    "content": [
        {
            "p": "Nottingham’s School of English is staffed by vibrant, international academics with a wide range of teaching and research experience. Our staff and students work side-by-side to investigate a wide range of topics around the use of English, both in literature and in everyday language. Students investigate how language shapes, and is shaped by, the dynamic environments in which it is used. The School’s global footprint allows you to draw on the supervisory expertise of over eighty staff specialising in aspects of English across the three campuses, and to spend periods of time in the UK and China. You can also enjoy access to dedicated funds to cover research and resources costs and to help disseminate your findings at local and international conferences. The School features a world-class network of researchers and academics, which offers a wide range of research opportunities. Our English postgraduate programmes equip you with the skills to succeed in a variety of careers, including broadcasting, publishing, teaching, advertising, marketing, publishing, journalism, communications, business, banking, law, human resources, and public relations, just to name a few. Former research students hold senior posts in top-tier universities across the world and prominent positions in government and the private sector. The University employs the best educators to its schools and departments, and the School of English at Nottingham is no exception. We have ambitious expansion plans to meet our teaching and research needs. Our academic staff come from across the globe, including the UK, Canada and the US, and bring with them a wealth of experience and expertise. Research expertise within the School includes systemic functional linguistics, 19th century socialist literature, British and American literature, computer-mediated communication, and the use of metaphor in inter-religious dialogue. As well as collaborating with their counterparts in the UK and China, the School staff also work closely with colleagues based elsewhere in the faculty, especially specialists in English language and literary, film, TV and cultural studies in the School of Education and the School of Modern Languages and Cultures. English postgraduate studies refer to advanced academic programmes that explore various aspects of the English language, including literature, linguistics, creative writing and all its related fields. Benefits of pursuing a postgraduate degree in English include: The opportunity to deepen your knowledge in this field You will develop critical thinking skills You will have the opportunity to specialise in specific areas of interest. A Master's or PhD in English opens doors to career opportunities in education, publishing, mass communications, writing, and more. UNM offers both Masters and PhD in English: Masters in the English Language: English Langauge and Literature MA English with Creative Writing MA PhD in the English Language: Humanities (English) MPhil/PhD Yes, at UNM, we accept students from diverse academic backgrounds. However, you may be required to attend prerequisite courses to ensure that you have a strong foundation in English studies. You may also have to attend an interview and each acceptance to the course is on a case-by-case basis. This will depend on the course you’re enrolled in. Some specialisations available include literature and creative writing. Find out more about specialisations by contacting us today. Yes, we offer scholarships, grants or assistantships to support our postgraduate English students. Choosing the right course is important if you want to excel. To do so, research universities, review the programme curriculum, faculty expertise and research opportunities. Consider also your career aspirations and whether the programme you want to enrol in aligns with your interests. UNM offers part-time options for students who are unable to commit full-time, although classes are only available in person. Check out the individual English postgraduate programme pages for more information. Discover the endless possibilities of postgraduate English studies at the University of Nottingham Malaysia. Whether you aspire to be an academic scholar, a creative writer, or a language specialist, our programmes are designed to empower you to excel in your chosen career path. Explore our postgraduate English courses to learn more about what we offer. Your journey begins here. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}