{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/English/Programmes-in-English-MPhil-PhD.aspx",
    "content": [
        {
            "p": "UNM/JPT-R/220/7/0015(7/26)MQA/SWA0816 UNM/JPT-R/220/8/0016(7/28)MQA/SWA0823 We offer high-quality doctoral training to postgraduate students who wish to pursue an MPhil or PhD. As a research student, you’ll work closely with two allocated supervisors who will assist you in planning, executing and presenting your research. We encourage applications in any topic related to English studies. The School of English offers research opportunities across a variety of topics related to English studies and draws on the resources of Nottingham’s renowned Centre for Research in Applied Linguistics. This is an interdisciplinary research centre devoted to describing and understanding language as it is acquired and used in the real world. You will cover the range of theoretical approaches making up the contemporary critical terminology of English and English studies. The course will also develop your awareness of practices in language use and their application to various contexts. The course will focus on developing your ability to engage in critical evaluations of current research along with developing your ability to problem-solve in respect of real-world projects and case studies. Our global footprint allows you to draw on the supervisory expertise of over 80 staff specialising in numerous fields of English studies across our three campuses. Located in the UK, Malaysia and China, students are encouraged to spend a period of time at any or all of our campuses worldwide. If you are interested in applying for an MRes/MPhil or PhD in the School of English, please email the Programme Director, Dr Shivani Sivagurunathan, to discuss your research proposal before making a formal application or visit our applications pages to find out how to apply. We encourage applications in any topic related to English. Our current research topics include: The School also offers research training seminars and students also have access to training programmes offered by the graduate school. The University also has an early-career researchers’ network which provides peer-support for students. Exceptional candidates working in areas of research deemed priority areas for the school may also be eligible to partial fee waiver scholarships at the discretion of the Programme Director. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A good master’s degree (usually merit or higher) plus, an upper second class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. Or A first class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. MPhil An upper second class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. The School features a world-class network of researchers and academics offering a wide range of research opportunities. The school seeks to equip you with the skills to succeed in a variety of careers, including teaching, broadcasting, publishing, literary criticism, advertising, marketing, publishing, journalism, communications, business, banking, law, human resources, and public relations to name but a few. Former research students hold senior posts in top-tier universities across the world and prominent positions in government and the private sector. This content was last updated on 12 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}