{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Civil-Engineering/Civil-Engineering-MEng.aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/526/6/0076(10/24)MQA/FA4898 Civil Engineering MEng (Hons) is one of the courses available under the Faculty of Engineering at the University of Nottingham, Malaysia. Every day we rely on aspects of civil engineering to enable us to live our lives. As a civil engineer, you must be socially aware and interested in working with people to solve problems and meet challenges. Whether it is building the French Millau Bridge, The London Eye, the Petronas Towers or life-saving water treatment plants in developing countries, civil engineering is the core discipline that enables projects such as these to happen. Civil engineers deal with design, construction, and the management of projects to help improve the world we live in. By joining this course you’ll learn about structures, geotechnics, materials, fluids, surveying and construction management. We work with local engineering professionals who assist with site visits and guest speaker lectures. You’ll get the opportunity to work towards becoming a professional/chartered engineer and be able to get work experience with well-known civil engineering companies. Students choosing this programme will be equipped to embark on a career in civil engineering or other disciplines that require numerate problem-solving skills. Some key sectors our graduates enter include civil engineering, consultancy, contracting, civil engineering management, finance and surveying. The programme was ranked 9th in the UK for civil engineering in The Times and Sunday Times Good University Guide, 2020. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 79% average based on 6 subjects, including Advanced Functions, Calculus and Vectors and relevant science subjects. Consideration to be made based on relevant individual grades if specific subjects are required. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Engineering is a 1+4 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Engineering. Modules on the programme aim to improve language and study skills as well as enhance understanding of mathematics and the physical sciences. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway from thermal science or chemistry to electricity and magnetism. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Civil engineers are required worldwide for design, construction and management positions. Our Civil Engineering degree offers a great platform for a career in various professional disciplines including Structural Engineering, Geotechnical Engineering, Water Resource Engineering, Environmental Engineering, Highway and Transportation Engineering, Construction Project Management & Surveying and Geospatial Engineering. Some graduates have progressed to postgraduate levels and/or obtained PhD degree both locally and overseas with some alumni currently employed as postdoctoral researchers and academics at universities worldwide. Many of our graduates move into managerial positions and/or achieve Professional/Chartered Engineer status during their working career. Our Engineering courses give students the opportunity to study abroad for 12 months, either at our UK or China campus or at a University within the Universitas 21 group. The latter includes The University of Auckland (New Zealand), British Columbia (Canada), Hong Kong (China), Melbourne (Australia), Singapore and Tennessee (United States). This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}