{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/medicine-and-health-sciences/explore-different-clinical-settings-to-excel-as-a-midwife.html",
    "content": [
        {
            "p": "At Nottingham, around 50% of your course is practice-based. Giving you the chance to gain real-life clinical experience of midwifery care. As a passionate aspiring midwife, we know you understand the dedication required to care for pregnant women and deliver their babies. We know the importance of exposure to a varied caseload, in real environments. That’s why with us you’ll work with You’ll undertake your placements across two NHS Hospital trusts (Nottinghamshire and Derbyshire). This approach enables you to gain a wider perspective of the sector and understand the challenges families and healthcare professionals face across maternity services. Not only that but you’ll also get the opportunity to follow a woman’s pregnancy journey throughout (you must choose a minimum of one). We know you want to get stuck in and experience life as a working midwife and this scheme allows you to do that. You can even put yourself on call for labour and commit to being there at the labour and birth for that woman. All of this is done under the supervision of a registered midwife. With support provided at each stage, this is an invaluable experience that will greatly prepare you for life as a registered midwife. Find out a bit more about the placements available to you as a midwifery student and the NHS trusts we work with. Faculty of Arts Discover what it's like to be a student in the Faculty of Arts at the University of Nottingham. Faculty of Medicine and Health Sciences Follow Luke as he takes you around our campus, including our state-of-the-art David Ross Sports Village, practical lab sessions and his favourite study spaces. Student experience If you’re searching for like-minded individuals or want to learn about fellow students from different walks of life to understand their university experiences, we have a range of social networks you can be part of. Campus and facilities Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}