{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Graduate-Entry-Medicine-BMBS-U6UGRDEM1.html",
    "content": [
        {
            "p": "Royal Derby Hospital, Derby, UK There is no set pathway to commencing your medical journey. If you’ve always considered becoming a doctor but decided to study a different subject at degree level, this course is ideal for you. Our four-year Graduate Entry Medicine (GEM) course has been designed specifically for graduates who are ready to embark on a career in medicine. Mandatory Year 1 Cardiovascular sciences Respiratory sciences Endocrine system Limbs and back Alimentary system Personal and professional development 1 Personal and professional development 2 Urogenital system Integrative module Clinical Pharmacology and Therapeutics The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 20 June 2024. Due to timetabling availability, there may be restrictions on some module combinations. Building on the intellectual skills of your previous degree, your first 18 months will see you work in small groups to examine clinical scenarios using case studies, and study the various different systems of the body. In the final months of your second year, you'll begin the Clinical Phase which will see you rotate through a series of placements at major teaching hospitals and within primary care across the region. Your final two years form the Clinical Phase of the programme. You'll focus on full-time clinical training and rotate through a series of placements at various teaching hospitals, community, and partnership trusts and within primary care settings across the region. These years will provide you with the professional knowledge, skills, values, and behaviours to succeed through direct experience. The first component is a 47-week Foundations for Practice (FFP) phase, covering specialities such as junior medicine, junior surgery, mental health and primary care. This concludes with two four-week student-selected modules and a four-week junior assistantship (JAST). The second component is our Advanced Phase (AP), which is broken down into a 26-week Advanced Practice phase 1(AP1), comprising obstetrics and gynaecology, child health, integrated medicine, palliative care and healthcare of later life. This leads into a 24-week Advanced Practice phase 2 (AP2), covering senior medicine, senior surgery, critical illness and senior primary care. The final component of the course is a Preparation for Practice (PFP) phase, which includes a The clinical phase is taught using a blended learning approach of clinical placement activities, self-directed learning (supported by extensive learning resources provided on our Virtual Learning Environment, Moodle), clinical tutorials and clinical skills/simulation training. During your first 18 months you will have approximately 14 to 15 hours of teaching contact time with around eight hours of independent study per week. You will also spend around four hours on placement every five weeks. During your time in the Clinical Phase, you'll spend between 35 to 40 hours across five days every week studying and on placements. You'll spend around three to four days on ward, clinic or GP placement visits per week plus 8 hours of independent study time. This will include some out of hours work. Your holidays will also differ during the Clinical Phase from the standard student timetable. You'll have about six weeks' holiday in each of the clinical phases. This is usually taken as two weeks at Christmas, two weeks at Easter, and two weeks during the summer. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). Come and join us for our open day at the Royal Derby Hospital. Find out more about your course, meet our staff and students and view our facilities. You will have the opportunity to join workshops, activities and listen to talks. When booking your open day place please note that the Graduate Entry Medicine open day is being held on Saturday 29 June 2024. This course is based at the Royal Derby Hospital Royal Derby Hospital is based in the city of Derby, around 15 miles from Nottingham. This modern, purpose-built building offers you all the facilities you need to study. You will have access to laboratories and anatomy, clinical skills and computer suites. We develop exceptional knowledge and skills in Derby. The support we receive provides a great foundation for a fulfilling career in medicine. Joshua Valverde Graduate Entry Medicine BMBS Faculty of Medicine and Health Sciences Entry requirements AAA UCAS code A100 Duration 5 years full-time Start date Sep 2025 UCAS code A10L Entry requirements BBC UCAS code A108 Duration 6 years full-time Entry requirements AAB UCAS code B121 Duration 3 years full-time If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}