{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Environmental-Engineering-including-an-Industrial-Year-MEng-Hons-U7UEVENGY.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK As our populations grow, we need to produce new things smarter, safer and cleaner whilst protecting our natural resources. Through your commitment to a more sustainable future, you will work towards managing and reducing waste to minimise pollution. As an environmental engineer, you will be passionate about protecting, restoring and preserving the planet. Environmental engineers design processes and products that minimise impacts on air, land and water, whilst making the most of finite natural resources. Mandatory Year 1 Fundamentals of Engineering Design Fluid Mechanics Chemistry for Engineers Process Engineering Principles Mathematical Methods for Chemical and Environmental Engineering Introductory Geology Thermodynamics and Heat Transfer The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 5 October 2023. Due to timetabling availability, there may be restrictions on some module combinations. On average, you will have around 20 contact hours a week in year one and two. Combined with coursework and self-study, you may spend over 40 hours a week on your studies. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2023, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. 87% say staff value students views and opinions about the course Data for courses in Chemical, process and energy engineering at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Engineering Entry requirements AAA UCAS code H805 Duration 4 years full-time Start date Sep 2025 UCAS code H806 Duration 3 years full-time If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}