{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/scholarships-and-bursaries-ug/scholarships/travel-scholarships.html",
    "content": [
        {
            "p": "For students who will be travelling or studying abroad as part of their course Our Travel Scholarships, also known as Aspire Scholarships are funded by generous private donations to support students who will be travelling abroad as part of their course. Each scholarship has eligibility criteria that must be met to receive the award. To be considered for an award, your must complete an application so we can assess your eligibility. Travel Scholarships are quite varied and largely competitive with a limited number of awards available. We recommend you read through all the options available before submitting your application. You must apply for the award in the academic year before your study abroad year. You can find further information on individual scholarships below. Interest in languages, music or fine art For current or former residents of Willoughby Hall For Russian, Serbian or Croatian travels For high achieving students planning to travel To be considered for a Travel Scholarship, you must complete an application in the academic year before your study abroad year. For additional information for each scholarship and tips on what information to include when you apply, please see the funds guidance notes. Scholarships and bursaries To encourage potential in students from lower-income backgrounds or who have faced significant difficulties For students with a household income between £0-£35,000 as assessed by student finance For students showing strong academic ability who have overcome significant obstacles to their academic progression For UK students with personal circumstances or backgrounds that may have impacted academic potential Note: All references to household income refer to the figure which is calculated by Student Finance when a student applies to them for means-tested funding. Please refer to our Data Protection and Confidentiality Statement - for anyone who makes an application for funding from the Funding & Financial Support Team. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}