{
    "url": "https://www.nottingham.edu.my/Study/Foundation-courses/People/Science1/jaya.kumar",
    "content": [
        {
            "p": "Assistant Professor, Jaya Kumar graduated from University Putra Malaysia with a BSc in Biotechnology and from University Kebangsaan Malaysia with an MSc in Genetics. He also has a Cambridge International Diploma for Teachers and Trainers. Eventually, he pursued and completed a Postgraduate Certificate for Higher Education from the University of Nottingham Malaysia. Jaya has a PhD in Psychology from the University of Nottingham Malaysia (UNM), through which he studied the effects of stereotype threat on students within a classroom setting. Jaya taught A Level, UNSW Foundation Year and AUSMAT Biology for 7 years prior to joining UNM in 2013 to teach Biology in the Foundation in Science. He currently Heads the Foundation in Science in UNM. Jaya Kumar is a Senior Fellow of the UK Higher Education Academy (now know as Advance HE) and the Director of the Nottingham Recognition Scheme in UNM. These roles has provided the opportunity for Jaya to also be the pioneering Deputy Chair of the Malaysian Senior Fellows Working Group. He is also a Professional Technologist with the Malaysian Board of Technologists (MBOT). His interest in teaching and learning has also led to his involvement in the Teaching and Learning Observation College as an Associate and he is a two-time Lord Dearing Award recipient. Biology, Genetics, Stereotypes and Prejudice, Social Psychology, Stereotype Threat, Stereotype Inoculation, Role Model Effect Previously taught on these courses in the Foundation in Science and School of Psychology: Currently teaching on the following modules: Malaysia needs more Science, Technology, Engineering and Mathematics (STEM) literate professionals as it becomes more digitalised and demand for healthcare-related skills increase amidst the pandemic… read more Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}