{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/scholarships-and-bursaries-ug.html?path=L2NvbnRlbnQvdW9uL2diL2VuL3N0dWR5d2l0aHVzL3Vnc3R1ZHkvYXJ0aWNsZXMvc2Nob2xhcnNoaXBzLWFuZC1idXJzYXJpZXMtdWcvamNyOmNvbnRlbnQvcm9vdC9jb250YWluZXIvY2Fyb3VzZWxfY29weQ==&variant=c3RhdGlj&title=RXhwbG9yZSBtb3JlIGZ1bmRpbmcgb3B0aW9ucw==",
    "content": [
        {
            "p": "Discover information that may help you fund your study at the University of Nottingham. Scholarships and bursaries are two types of financial support you can receive during your time at university. Scholarships and bursaries are non-repayable and students will receive this support alongside their regular student loans. The scholarships and bursaries on this page are for students with home* fee status. If you’d like to learn more about financial support for international students, please see the international scholarships pages. Competitive funding with eligibility criteria Guaranteed funding for eligible students The key difference between a scholarship and a bursary is the availability of the funding. Scholarships tend to have limited places and often require an application to assess your eligibility against others. Due to the competitive nature of a scholarship, eligibility often includes showing evidence of exceptional academic potential, talent in a non-academic skill and/or facing adverse personal circumstances. Bursaries are not competitive, they aim to help students access university more easily through financial support. At the University of Nottingham, the Core Bursary, Care Experienced and Estranged Bursary and Nottingham Potential Bursary have unlimited places. This means that if you meet the eligibility criteria, this bursary is guaranteed. In most cases, you do not have to pay back funds from a scholarship or bursary. This is how scholarships and bursaries differ from student loans. *A 'home' student is one who meets certain UK residence criteria. These are the same criteria as apply to eligibility for home funding from Student Finance Discover information for full time undergraduate students who normally live in England and have 'home' fee status. In other words you must have 'settled status' and lived in England for more than three years prior to the start of your university course. The Hillsborough Trust Memorial Bursary offers support to students who are experiencing financial difficulties whilst studying at Nottingham. Scholarships and bursaries For students with a household income between £0-£35,000 as assessed by student finance To encourage potential in students from lower-income backgrounds or who have faced significant difficulties A range of competitive scholarships based on the subject you're studying to help you excel in your area of interest Take a look at our scholarships help outstanding international students make a positive impact in their studies and careers. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}