{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/spend-part-of-your-degree-here/visiting-students-modules.aspx",
    "content": [
        {
            "p": "Most visiting and exchange students at the University of Nottingham select a range of modules or classes to study when they are in the UK. Visiting and exchange students will be designated a home academic school/department at Nottingham on nomination, based on the exchange agreement with their home university. The majority of credits should be taken in the home academic school/department but students can often choose modules from other schools/departments. Approved modules for visiting and incoming exchange students Click on the individual drop-down sections below to find out further information about selecting your modules at the University of Nottingham and how to submit your module preferences. All visiting and exchange students on undergraduate or postgraduate taught programmes are required to adhere to the following credit loads: Please visit Approved modules for visiting and incoming exchange students to view approved modules for visiting and incoming exchange students in each school/department. Modules are taught in either in either the autumn semester, spring semester or for the full academic year. It is not possible for students studying for one semester only to enrol onto full year modules. The university publishes its module catalogue every April. To search for a module on the module catalogue: The module catalogue does not confirm if modules are available, it should only be referred to for information about specific modules. Students can access the module catalogue through the Approved modules for visiting and incoming exchange students webpage. Students should check how modules are assessed and think about assessment preferences, those accustomed to continuous assessment may consider choosing a module with coursework assessments such as essays/presentations, rather than 100% exam. Credits are only awarded for completed modules where all assessments have been taken. If the January to June semester at your home university starts before the end of the autumn semester at the University of Nottingham, you may need to check before you arrive at the University of Nottingham, if you can submit an alternative assessment or overseas exam in place of your January exams at Nottingham. Further information can be found on the Overseas examinations webpage. Visiting and incoming exchange students are required to submit their module choices through an online form prior to their arrival in the UK. Please ensure you have agreed a list of back-up modules with your home university, in case any of your first choice modules are not available. Please note that you can only submit this form once and any requests for changes will need to be submitted during the Change of Mind period once you are registered as a University of Nottingham student. Your individual timetable will be published once your requested modules have been confirmed. You can find out further information about the teaching timetable and the link to the login page to access the teaching timetable on the Timetabling webpage. Individual student timetables for the 2024/2025 academic year will be released to visiting students, who have completed online registration and registered for modules, from Wednesday 25 September 2024. Where you need to make a change to your modules, you should follow the general procedure for the Change of Mind period, which is released at the start of the academic year and is for a limited period. This may delay the publishing or your individual timetable, as this requires all modules to be confirmed. The Change of Mind period for spring semester 2025 is from Monday 27 January to 5pm, Friday 7 February 2025. Please refer to the Module Enrolment webpage for further information. Module enrolment Architecture and Built Envionment require a portfolio to be submitted in addition to the application. The course location for Environmental Science and Plant Science modules is on the University Park Campus. Chemical and Environmental Engineering modules are only open to students who are nominated to study in Chemical and Environmental Engineering for the full year. Modules are subject to approval from the department before students can be enrolled onto modules. Chemistry are happy to consider students into Level 1 or Level 2 for the full year, or for one semester, or the whole year in Level 3 or Level 4. In all cases, please contact the Visiting students team for further guidance. Economics modules are only available to exchange students whose home school is Economics. Please check the Approved modules page carefully for availability. The majority of English modules are only available to exchange students who have been nominated for the School of English, please refer to the Approved modules page webpage for modules which are available to students who aren't hosted by the School of English Electrical and Electronic Engineering are happy to consider students for Level 1 and 2 modules for the full year exchange only, single semester exchange students will only be able to enrol on the more advanced Level 3 or 4 modules. In all cases, please contact the Visiting students team, to check that your module choices can be accommodated. Medicine and Health Sciences do not accept visiting students except for the School of Life Sciences, but certain criteria may need to be met. School of Medicine modules listed on the Approved modules for Visiting students webpage are only available to postgraduate exchange students from The University of Melbourne, who are nominated for the School of Medicine. Students from a university whose exchange agreement is with the Department of Modern Languages and Cultures will be nominated and hosted by the unit, which the exchange agreement is with: French and Francophone Studies, German Studies or Spanish, Portuguese and Latin American Studies. However, your minimum 30 credits, which must be taken in your host language department, can be taken in the wider School of Cultures, Languages and Area Studies. They will not be restricted to the modules offered by the specific language unit. Politics and International Relations modules are only available to students hosted by this school. Schools of Cultures, Languages and Area Studies; English; and Humanities Departments of Architecture and Built Environment; Chemical and Environmental Engineering; Civil Engineering; Electrical and Electronic Engineering; and Mechanical, Materials and Manufacturing Engineering Schools of Health Sciences, Life Sciences, Medicine and Veterinary Medicine and Science Schools of Biosciences; Chemistry; Computer Science; Mathematical Sciences; Pharmacy; Physics and Astronomy; and Psychology Schools of Business; Economics; Education; Geography; Law; Politics and International Relations; and Sociology and Social Policy Optional language modules"
        }
    ],
    "pdf_files": []
}