{
    "url": "https://www.nottingham.ac.uk/studentservices/support/financialsupport/managingyourmoney/fraud-and-scams.aspx",
    "content": [
        {
            "p": "Anybody is at risk of being targeted for fraud, but students can be particularly vulnerable. Scams can be very sophisticated and take many forms. What they have in common is that they are all trying to get hold of your money, usually by attempting to obtain your personal information or persuading you to hand over your cash. These attempts can be in person, on social media, email, phone, or video call, and/or text. Fraudsters may use cold calling and high-pressured sales techniques. They will claim the opportunity is time limited so that you act quickly, with little time to consider or investigate further. These scams may also be promoted on social media with a too-good-to-be-true outcome. They may use fake celebrity endorsement to draw you in. Has someone contacted you unexpectedly? Have you been asked to provide your personal information? Does the information provided sound too good to be true? Are you being pressured into making an immediate decision? Does the text or message you received contain spelling or grammatical mistakes? Have you been asked to hold money in your bank account on behalf of an organisation? Have you been asked to download software or apps to your phone or laptop? Below are some common scams aimed at all students. This is not an exhaustive list, and they may vary in detail as fraudsters invent new ways to target students: These usually take the form of phishing emails claiming to be from the Student Loan Company. They can be very sophisticated and look legitimate, using the SLC logo and branding. They usually ask students to click a link and provide personal information, including passwords and financial information. The SLC would never ask for this information via email. Avoid clicking the links in the email, and if you are concerned about the contents of the email use the Student Loan Company website for your country (England, Scotland, Wales, or Northern Ireland) directly via their website or phone line to query. Criminals are increasingly targeting students, both online and in-person, and offering them cash to receive money into their bank account and transfer it to another account. They often operate on social media sites, offering quick and easy routes to receive money. They may operate in crypto currencies. Most mules are recruited, sometimes unwittingly, by criminals to transfer stolen money on behalf of others. Those involved are likely to find their bank accounts closed and can face a prison sentence, even if they were not aware of the criminal activity. For more information, see the National Crime Agency website. Fraudsters may contact you by phone, email, or text claiming to be from your bank and reporting a problem, such as fraudulent activity or an attack. They can clone phone numbers, so the number may look legitimate. They may ask for personal information including bank details, pin number and/or ask you to transfer money to a different account to protect it. Banks will never ask you for your pin code or bank details, or to transfer money. Fraudsters can create panic by making you feel that this is immediate and urgent. If you receive a call, text, email, or other communication along these lines do not respond and call your bank directly on the number on the back of your card to speak to somebody directly. They may ask for your name, first line of address to confirm your ID, but this is ok as you have called them directly on a recognised phone number. Communication is usually by text or email, purporting to be from a large organisation such as Amazon, HMRC or the Royal Mail. The communication claims that you are due a refund or tax return and asks you to provide your bank information. They may also claim that you have won a prize or competition. Do not click any links and search the official company page or contact them directly if you want to confirm. Be suspicious of unofficial or misspelt links to large websites. Texts and emails can be reported to your phone company or email provider to help them to identify and crack down on fraud. There are several scams targeting international students across the United Kingdom. Below is a list we are aware of; this is not an exhaustive list, and the details may vary as fraudsters adapt their approach. The UK Government has up to date information on current fraud, tricks, and scams. International students and/or their families are contacted and offered discounts or ‘help’ to pay their tuition fees. This could be face-to-face, online or via social media or communication apps. The fraudsters pay the students tuition fees with a stolen card, which may mean that it shows up as paid on university accounts. The student or their family then pays the scammers, but the bank cancels the original payment. This means the student, or their family, has paid out the money and still owes the tuition fees. International students are contacted, usually over the phone, with the caller claiming to be from somewhere official such as an embassy, the UK Home Office, or the Police (either in the UK or overseas). They can fake caller ID information, so the number you see may be cloned. They may claim that you have been involved in a crime or are at risk of deportation and demand a payment. This fraud is designed to instil fear and make decisions quickly without thinking. Legitimate officials will never contact you and ask for a fee or fine over the phone, they would also never request to video call. Helpful advice can be found on the UK Council for International Student Affairs website. If you receive an unexpected call, contact the Visa and Immigration team at the University of Nottingham, or UKVI on 0300 123 244. Beware of phone calls from numbers you don't recognise - even if they're from your home country – caller ID information can be faked Beware of police officers communicating by video chat Beware of unsolicited messages and adverts online, particularly on social media channels Never give any personal details out - including bank details - to someone you don't know, whether over the phone, via email or in person The account numbers on your bank card can be used to make purchases, even if your bank card isn’t present at the time of purchase – never share the numbers printed on your card Avoid anyone who asks you to pay for a service in cash – especially if it is a considerable sum – and certainly never meet anyone you don’t know to hand over cash Don’t download apps sent to you on a link If you receive any messages or phone calls that you suspect to be fraudulent, report them to Action Fraud on 0300 123 2040 or via the action fraud website. If you have been a victim of a scam, you can contact a support and wellbeing officer, a Student Immigration Advisor or the students’ union Advice Team for guidance and support."
        }
    ],
    "pdf_files": []
}