{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Media-Languages-and-Cultures/International-Communication-Studies-with-Performing-Arts-BA-Hons.aspx",
    "content": [
        {
            "p": "UNM/JPT-N/321/6/0250(11/24)MQA/SWA12915 The School of Media, Languages and Cultures offers several three-year The International Communication Studies with Performing Arts pathway is conceived with a clear aim - allowing students to combine their Career with their Passion. Performing Arts worldwide is a multibillion industry, which demands qualified practitioners in a range of positions that encompass the whole creative and production process, from performers to technical staff, from stage direction to communication and management. Our graduates will learn how to become leading voices in this fascinating field, gaining understanding on the dynamics of Creative Industries, and on the social and cultural elements inherent to them. They will have the opportunity of gaining hands-on practice in the process of development and production of music, dance and theatre shows, while developing further understanding in the field of Media and Communication. This course is particularly intended for students with a passion for Performing Arts (including music, dance and theatre), who want to find solid career options within the field. Its core modules include Global Music Studies, Music in Film and Writing for Performance. Learning outcomes: Students will learn and practise the four skills of listening, speaking, reading and writing together with basic grammatical structures. This will enable them to manipulate the language and participate effectively in everyday social situations. Learning outcomes: The module aims to introduce students to: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Arts and Education is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Arts and Social Sciences. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as politics, the world economy, media and education. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. An international communications degree is your passport to a variety of rewarding professions. Likely career fields include the audio-visual, digital and print media industries, marketing, production, public relations and research. Graduates with a passion for language can pursue interpreting, publishing and translation roles while others may continue their studies and pursue research and/or teaching degrees. Many of our graduates go overseas to work at universities in South Korea, Japan, China, and Europe. Some of our graduates have pursued postgraduate study at LSE, National University of Singapore, Mahidol University (Thailand), Oxford University and the University of Nottingham campuses in both China and the UK. This content was last updated on 09 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}