{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/applying/what-to-expect-from-the-university-application-process.html?title=UmVjZW50bHkgdmlld2Vk&variant=cmVjZW50",
    "content": [
        {
            "p": "To ease application anxiety, we run through what to expect from the process. The application process is daunting, and your queries are understandable. After all, this is a huge step toward your future. So, to ease any application anxiety, we’re going to run through what you should expect from the process. Picking a degree is a unique challenge for everyone. For some, career aspirations or subject enjoyment can make the decision easier. For others, the choice is a little more difficult. If you’re unsure about what to study, try to stay calm and consider your options. Whether you have a specific career in mind or not, more than a third of the UK's graduate jobs are open to graduates of any discipline. For all undergraduate courses at Nottingham, you apply online through UCAS. The UCAS website has lots of information and advice on the process. Once you’ve registered with UCAS you need to make your application and write your personal statement. It can be helpful to set yourself goals or deadlines by which you’d like to have a certain step in your UCAS application completed. Join us and be guided by our Admissions Manager, Maryam. With her expert guidance, you'll discover some common myths we hear from potential students. From your reference worries to your predicted grades, and everything in between, Maryam clears up some key points you need to know to start your university experience. Once your application has been submitted, you’ll typically have to wait a few weeks for universities to assess your application and make a decision. Response times and policies differ for each university and course. University interviews are used by admissions staff as a means of comparing applicants with a good chance of being offered places on their courses. If you receive an invitation to interview it’s natural to be nervous. But it’s also important to remember that receiving an invitation to interview means your application has already impressed us. Think of your interview as another opportunity to see whether the course and university itself are for you. This is the best part, receiving your offers. All offers and their conditions will appear on UCAS so check the platform regularly. Campus and facilities Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities. Beyond a welcoming community, the facilities you’ll find at the University of Nottingham will provide you with the complete package for a great student experience. Whether you're a seasoned athlete, gym fanatic or just want to try something new, our extensive sport, health and wellbeing package has something for you. Scholarships and bursaries Discover information that may help you fund your study at the University of Nottingham. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}