{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Applied-Psychology/Applied-Psychology-Research.aspx",
    "content": [
        {
            "p": "The Department of Applied Psychology enjoys a strong reputation for teaching and research. It is a world-class centre of excellence in research in applied psychology, and a leading provider of education and training in areas of applied psychology and related subjects. Our international team of highly-qualified staff have expertise in a range of areas and enable the department to be a centre for the collection, evaluation and dissemination of information on research, education, practice and policy in its core areas. This cluster is concerned with contemporary issues in occupational health and wellbeing, with an emphasis on cross cultural contexts. Areas of interest include: This cluster is concerned with the impact of culture and group level processes on work and organisational outcomes. Areas of interest include: Students who are part of a postgraduate applied psychology programme will have the opportunity to build specialised knowledge and skills for careers in counselling, therapy, human resources, research and other fields. Graduates will have the potential to become experts in human behaviour and psychology. Applied psychology research is vital for advancing the understanding of human behaviour and improving real-world practices in areas such as mental health, organisational development and education. Research in applied psychology covers a wide range of topics. For example, clinical interventions, behavioural assessments, organisational behaviour, educational strategies and social psychology experiments. A PhD in Applied Psychology is an advanced research degree that focuses on conducting original research that contributes to the field’s knowledge. Graduates will be prepared for careers in academia, research and specialised practice in psychology. Graduates with a PhD in applied psychology can pursue careers such as university professors, researchers, and consultants, and become experts in various specialised areas of psychology. MPhil programmes are shorter and more research-focused. PhD programmes involve extensive research and often include coursework. Students may also have to take on teaching responsibilities in PhD programmes. Yes, UNM welcomes international students and offers an MPhil in Applied Psychology with English as the medium of instruction. Department of Applied Psychology The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih, Selangor Darul Ehsan, Malaysia Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}