{
    "url": "http://www.nottingham.edu.my/Study/Postgraduate-courses/Biosciences/Biosciences-research.aspx",
    "content": [
        {
            "p": "Bioscience includes all aspects of life on earth, from microbes and plants to animals and humans along with the ecosystems and environments in which they co-exist. Knowledge and understanding of biosciences are fundamental in allowing us to develop practical solutions to many key global challenges. Research in the School of Biosciences address key global challenges increasingly focused on the United Nations Sustainable Development Goals (SDGs). We also believe that industry–academic collaboration is important because it provides facilities for high-profile life science research for students and links students directly to potential employers. Current research areas of interest within the School span several key domains, including agricultural sustainability; food, nutrition and health; biotechnology and pharmaceutical sciences. These encompass the following examples: We are proud to offer you Bioscience research programmes that are designed to foster intellectual curiosity, innovation, and scientific discovery. Discover our MRes, MPhil and PhD programmes in Biosciences that are tailored to provide an enriching academic experience for students who are passionate about life sciences and contributing to the forefront of scientific knowledge. Students who embark on bioscience research in their postgraduate studies can expect to investigate living organisms, their biology and related processes to advance scientific knowledge. You will have the opportunity to research fields related to sustainable agriculture, food and nutrition security, modern therapeutic for health and more. Bioscience researchers are scientists and professionals dedicated to the study of life sciences. Bioscience researchers: Conduct scientific investigations Generate new knowledge Hypothesise and test Collect and analyse data Publish research findings Advance scientific disciplines Apply research to real-world issues Develop innovative technologies Collaborate with peers Teach and mentor to pass on knowledge Contribute to scientific policy Promote ethical research practices Seek funding and grants Stay current with research trends Bioscience research studies are crucial for understanding and solving complex biological challenges and advancing medical science. It is also an opportunity to address key global challenges such as food security and climate change. Graduates can pursue careers in academia, research institutions, pharmaceutical companies, biotechnology firms, healthcare, environmental organisations and government agencies. A Master in Philosophy (MPhil) is a shorter research degree where you will do a research project over one to two years while Doctor of Philosophy (PhD) involves an independent in-depth research project which allows you to develop additional skills through different training programmes offered by the School. Master of Research (MRes) is a one-year programme that includes both taught modules and a research project. PhD programmes usually take 3 to 4 years to complete full-time, depending on the research and individual progress. Part-time students may take 6 to 8 years to complete the programme. Yes, UNM offers scholarships, grants, and research assistantships to support bioscience research postgraduate students. Yes, UNM welcomes international students for postgraduate bioscience research programmes. More details are available on our international students page. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}