{
    "url": "https://www.nottingham.ac.uk/studywithus/visitingus/travelling-to-nottingham.aspx",
    "content": [
        {
            "p": "Our open days for 2024 entry are scheduled to take place on: Whether you're travelling by car, bus, coach or train, getting to our open days and between campuses is easy with our free shuttle bus service - and you'll be welcomed by our friendly staff and student helpers. For visitors interested in arts, law and social science subjects. Drive to West entrance (Google maps) For visitors interested in science, engineering, medicine and health science subjects. Drive to North entrance (Google maps) Due to parking restrictions, all visitors to University Park and Jubilee Campuses should travel to University Park Campus. Free parking (including parking for Blue Badge holders), is available at University Park Campus. Blue Badge holders are also able to park at Jubilee Campus, which is very close to University Park. Free shuttle buses run between these two campuses all day, and it is only a 15-minute walk between them. When you arrive on campus, security staff will direct you to the nearest available parking. For designated Blue Badge car parking, please ask our security staff on arrival and they will direct you. If you're travelling by car, you can make your way directly to Sutton Bonington Campus where free car parking is available. On arrival follow directions to open day car parking. Drive to the open day car park (Google maps) For University Park and Jubilee Campuses, book a train to Nottingham railway station. Staff and students in blue t-shirts will be at Nottingham railway station to direct you to free shuttle buses that will take you to University Park Campus and Jubilee Campus. These run from 8am to 5pm. From Nottingham railway station, you can also take the Hucknall - Toton Lane tram to reach the University Park Campus south entrance using the University of Nottingham stop. For Sutton Bonington Campus, book a train to Loughborough railway station or East Midlands Parkway and make your way to our campus. For University Park and Jubilee Campuses, you can book a coach to the coach station in Nottingham. This is a short walk from the railway station, so you can still make use of the free campus shuttle buses or the tram. Find one of our helpers in blue shirts for directions. For Sutton Bonington Campus, you can book a coach to Loughborough railway station or East Midlands Parkway. From there, you can make your way to Sutton Bonington Campus. Alternatively, you can travel to Nottingham coach station and take a free campus shuttle bus to University Park Campus where you can transfer to the Sutton Bonington shuttle bus once on campus. Just find a student helper in a blue t-shirt when you arrive. The university is easy to reach using the Nottingham's tram-based park and ride sites and this can help you avoid traffic queues on the day. Toton Lane park and ride is close to the M1 and the tram runs directly to University Park Campus from there. For more information visit the tram website. Tram ticket information and prices are also available on the NET website. Free shuttle buses are available to take you between campuses throughout the day – helping you get to the next activity easily. A free hop-on-hop-off shuttle bus also runs in a loop around University Park Campus."
        }
    ],
    "pdf_files": []
}