{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Engineering/Faculty-of-Engineering-Research.aspx",
    "content": [
        {
            "p": "The Faculty of Engineering is one of the strongest faculties in The University of Nottingham with all engineering departments recognised as being amongst the best in higher education. Here at the Malaysia Campus all of our courses are taught in English and the degrees awarded are exactly the same as those in the UK. We are committed to giving our students an unrivalled combination of quality and excellence, strength and pragmatism, enabled learning, boldness and innovation, respect and tolerance. Graduates with an engineering degree can expect to take up leading roles in well-known global companies and leading-edge organisations the world over. It is difficult to overstate the importance of engineering in our rapidly evolving world. Engineering solutions are all around us – portable devices, clean water and healthcare products that enable us to live longer and, arguably, better lives. If we are to continue to innovate then we need the right people. People who can challenge, people who can create and most of all, people who can apply new knowledge in new products and new processes. These are just some of the things you will learn on one of our many engineering courses. Research excellence lies at the core of the mission of The University of Nottingham, and the Malaysia Campus is strongly maintaining this mission by conducting world-changing research that is of national importance and international academic interest. internationally-renowned leaders in their respective areas. Following the strategies of the UK Campus, research is organised cross-disciplinary across the various academic departments. We broke down traditional academic ‘walls’ to enhance multidisciplinary research and the results are the five main research divisions: A postgraduate research degree in engineering opens doors to numerous career prospects: Research scientist - Lead research projects and push the boundaries of engineering knowledge. Academia - Share your knowledge and expertise as a university professor. Inspire the next generation of engineers. Engineering consultant - Provide specialised engineering solutions to industries and companies that are seeking expertise and innovation. Entrepreneurship - Bring your research-driven innovations to the market or launch your own engineering startup. Industry leader - Take up leadership roles in engineering firms. You will be able to implement innovative solutions and drive growth in the company. Push the boundaries of engineering knowledge and make a lasting impact on the world. Whether you want to be an expert researcher or a visionary engineer, our postgraduate research in engineering programme is designed to provide the knowledge, support and skills you need to excel. We invite you to explore our Engineering programme page for more on admission requirements and research opportunities available. Research in engineering involves the systematic investigation, analysis and experimentation in this sector to expand knowledge and solve engineering challenges. You will have the opportunity to drive technological advancements in numerous engineering disciplines. Research in engineering leads to innovation and improvements in technology. It brings about solutions to real-world problems by enhancing our understanding of complex systems. As such, engineering research helps address global challenges and bring a positive impact to the world. At UNM, engineering research covers a wide range of areas, including electrical systems and applied mathematics, energy, fuel and power technology, manufacturing and industrial processes and materials, mechanics and structures. Postgraduate research engineering programmes focus on independent research. Students will likely have to complete a thesis or dissertation based on their research and thus, have the opportunity to gain a deep understanding in their preferred area of interest. Coursework programmes involve structured classes and assessments. Benefits include the opportunity to become an expert in a specific engineering area, contribute to advancements in the field, develop critical research skills and access diverse career opportunities. UNM offers an Engineering MPhil/PhD that is available both full-time and part-time. We aim to provide students with the essential skills for a fulfilling career as an engineer. Yes, UNM provides scholarships and funding for deserving students. Faculty of Engineering The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih, Selangor Darul Ehsan, Malaysia Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}