{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/international-students/entering-the-uk.aspx",
    "content": [
        {
            "p": "Welcome information for international students This page will guide you through what to expect when you enter the UK, and explain what you can and cannot bring through customs. Arriving at a UK airport | Import restrictions | Airport eGates and passport stamps | European students It's very important you have the right documents when you arrive at a UK airport. As you are entering as a new student, you will need to be prepared to answer some simple questions about your studies and where you will be staying. This is a list of things to be aware of and things to have with you when you arrive. For more detailed information, you can visit the UK Border Force website. Please ensure that you: Visas and immigration When you come through border control at the airport, a border control officer will stamp your passport. This stamp shows your date of entry into the UK, so it is required for registration at the university if you are entering with a student visa. Travellers from some countries (Australia, Canada, Japan, New Zealand, Singapore, South Korea and the USA) are likely to be directed to electronic passport gates (eGates or ePassport gates) which are also used by UK, EU, EEA and Swiss citizens. If you will be arriving to start your course in September, you may find there are dedicated student lanes at some UK airports so watch out for these when you arrive. UK government guidance European students will require a visa, unless you have already registered as a ‘settled’ or ‘pre-settled’ UK resident under the EU Settlement Scheme. Find information on our help with your visa web pages. Irish citizens have the right to travel, live, work and study in the UK under the UK-Ireland Common Travel Area arrangements. These rights are not affected by Brexit, and you won't need to apply for a visa or the EU Settlement Scheme."
        }
    ],
    "pdf_files": []
}