{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/engineering/a-day-in-the-life-of-an-aerospace-engineering-student.html",
    "content": [
        {
            "p": "Read all about Ify, one of our aerospace engineering students, as he describes his typical day and gives you a taste of what to expect at university. Choosing both a course and a university that’s right for you is a big decision - and a huge factor in your future career. We’re hoping to help make that decision a little easier, making sure that you have as much information as possible to help you make the best possible choice. Read all about Ify, one of our aerospace engineering students, as he describes his typical day and gives you a taste of what to expect: 8am – Rise and shine, I wake up and get ready for uni. After eating my cereal and grabbing my things, I’m ready for my day. 9am – I head over to the L4 lab where I’ll be working this morning. I’ll be experimenting in the wind tunnel lab for my aerodynamics module. Today I’ll be assessing delta wings in the wind tunnel, analysing how it affects aerodynamic performance. 12pm – I take a break for lunch with some mates. 1pm - After that I’ll be working on a group project, meeting in a group workspace. This is based on looking at a heavy cargo airdrop plane. A vehicle that’s used to transport and drop heavy things like tanks and huge supply drops. 3pm – My careers session with a tutor. We looked at my CV and they provided great feedback that’s given me the confidence to start my applications for my placement year. 4pm – I have my last lecture of the day; I really like this lecture as it’s on Aerospace Design. 5pm – After uni I head over to my mate's house. I have a year in industry next year and need to prepare for the interviews I have coming up. I can’t wait to get real world experience but need to practice my interview technique to make sure I get accepted onto the job I want. 6pm – Happy with my practice, I head home to work on the coding for my computer modelling techniques module. I work on this for a few hours, trying to get as much work done as I can. 8pm – I finally relax. It’s been a long day but I got so much done. Time to put my feet up and play some games! Follow Ify in the day in the life of an Aerospace Engineering student at the University of Nottingham. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}