{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/engineering/a-day-in-the-life-of-an-electrical-and-electronic-engineering-st.html",
    "content": [
        {
            "p": "Read all about Ometere’s day to see what life is like at the University of Nottingham. Choosing both a course and a university that’s right for you is a big decision - and a huge factor in where your future may lead. We’re hoping to help make that decision a little easier, making sure that you have as much information as possible to help you make the best choice. Read all about Ometere, a current electrical and electronic engineering student, as she takes you through a typical day to give you a taste of what to expect. She’ll take you to one of our amazing libraries as she prepares for a test, attends an inspiring seminar and works on her electric car during lab week. 8AM – Rise and shine, I wake up and get dressed. After eating my breakfast, I pack my bag and make sure I’m prepared for my day. 9AM – I catch the bus to the University Park campus. This is super easy; the buses are really efficient and it drops me off in the middle of the campus. 10AM – I study and go over my notes in the Hallward Library. I have a progress test coming up, which is 5 questions for each module I’m studying, making sure I understand everything we’ve covered. 12PM – I take a break for lunch with some mates. There are so many places to eat on campus and I love the Portland Building. 2PM – I have my Power and Energy seminar in the Pope Building. This involves circuit analysis and nodal analysis. These are ways in which we analyse circuit cells. 3PM – Time for a tutorial in the Coates Building. I'll be catching up with my tutor and making sure everything is fine. 4PM – My final seminar. This is on Engineering Mathematics. It sounds really advanced, but it didn’t take long to get the hang of, and now it’s my favourite seminar. Bonus lab week – I love lab week. It’s when we work on our physical projects in actual laboratories. We built our own electric cars that are programmed to follow road signs. It seems like such an advanced thing that I couldn't even imagine creating one before starting my degree. It really shows how far I’ve come since then. Ometere Makoju shows you a day in the life of an Electrical and Electronic Engineering student at the University of Nottingham. I’ve never felt more at home since I got here. Nottingham really cares about its international students.\" Ometere Makoju Electrical and Electronic Engineering student If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}