{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/science/a-week-in-the-life-of-a-chemistry-student.html",
    "content": [
        {
            "p": "Sarah talks about photochemistry, atoms and wellbeing at the university. Hi, I’m Sarah. I’m going to be showing you a week in my life as a fourth year chemistry student at the University of Nottingham. Monday I headed onto campus for lectures. Currently, I am really enjoying the module Inorganic and Materials B, because we are learning about photochemistry, which we have not learned about before. I have really liked learning about familiar concepts in a new way, and also learning about new, more sustainable approaches to chemistry. After that, I came back home and worked on coursework for the rest of the night. Of course, I had to make sure I had enough study snacks! Tuesday On Tuesday I was in the lab all day. For lunch, I picked up a panini and crisps from George Green Library and walked to Highfields Park. One of the reasons I chose the University of Nottingham was because of how green University Park Campus is. I’m grateful for it every day. Having Highfields Park on campus means I can take time to relax and embrace nature even when I’m very busy. I like to buy bird seed and feed the birds on campus. I then returned to the lab to read some papers, and had a meeting with my research group. Once I came home, I had a quick dinner and continued studying. Wednesday I spent all day in the lab on Wednesday working on my research project, which is photochemistry based. My favourite aspect of chemistry is learning how the universe works through the atoms that compose it. Throughout my degree, I have learned so much about many different aspects of my surroundings, and have enjoyed it greatly. When I got home, I made a quick pasta bake using leftover ingredients. This is a great thing to do after a long day as it’s very filling and requires minimal effort. After that, I continued with my coursework and had a study session with my housemates. Thursday On Thursdays I have two lectures. After those, I came home and prepared to celebrate Thanksgiving. Thanksgiving is an American holiday that originally goes back to when the pilgrims migrated to America. Fun fact: pilgrims actually came from Nottinghamshire. Nowadays, Americans use Thanksgiving to appreciate family and friends – and of course, eat lots of food! After celebrating with my housemates, I called my family in the US and continued with my coursework. Friday After my Friday morning lecture, I headed to Portland Clothing to take advantage of their sale, and went to Joe’s in Portland Building for lunch. Later I met with my project supervisor to discuss my coursework and research project. I have had extremely positive experiences with the chemistry staff at the University of Nottingham. Not only do they teach well, they truly care about students' wellbeing. Almost every time I enter the chemistry building, I see a staff member I know and have a brief chat, which has made me feel a lot more ‘at home’ at university. Thanks for spending this week with me. I hope it’s given you some insight into what it’s like to be a fourth year chemistry student at The University of Nottingham. Hear about NatSci Soc Division of Physiotherapy or Sport Rehabilitation Get hands-on sports injury experience at the David Ross Sports Village. Civil Engineering Follow Feroz, as he attends his group design project seminar, meets with his tutor and attends a fundamental materials lecture. Faculty of Social Sciences Discover what it's like to be a student in the Faculty of Social Sciences at the University of Nottingham."
        }
    ],
    "pdf_files": []
}