{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/life-in-nottingham/what-is-the-city-famous-for--.html?title=TGlmZSBpbiBOb3R0aW5naGFt&variant=bGlmZUluTm90dGluZ2hhbUpzb25QYXRo",
    "content": [
        {
            "p": "Find out more about Nottingham and what the city is famous for. If you look across the Nottingham city skyline there’s one landmark that always catches your eye. Nottingham Castle is a popular tourist attraction and a huge draw for people that love their history! So many fascinating stories of the past have played out within the castle walls - riots, rebellions and royal rows, take your pick! In 1068, William the Conqueror first ordered the construction of Nottingham Castle to establish a presence of Norman power and superiority over central England. Then in 1330, the castle became the setting of a bloody coup by the loyal supporters of Edward the III, using the complex network of caves hidden below the castle floors to stage a cunning siege! And then in 1642, King Charles hoisted his flag high above the castle to rally his army... and so began the brutal English Civil War! A war through which the strong walls of Nottingham Castle managed to endure. Until the year 1831, when the castle was torched by rioters during the Industrial Revolution. Fortunately, the spirit of Nottingham’s creativity would blossom through the ashes of these charred remains and the castle rose again as a municipal art gallery for our viewing pleasure! Today you can visit the castle for a selection of informative talks, tours and exhibitions. A feast for the senses that comes with a beautiful 360-degree view of Nottingham city. Not for the faint of heart. The Caves of Nottingham are a network of endlessly winding passages below the streets of the city. Nottingham boasts the UK’s largest network of over 800 subterranean caves that has history chiseled into its limestone structure, from WWII air raid shelters to medieval tannery. The immersive 45-minute audio tour enhances the ancient atmosphere surrounding you. So few people are aware of the fascinating history lying hidden in the limestone caves beneath their feet. The caves are ideally located within the city centre – so you’ll have ample time for a bit of shopping too! No list would be complete without mentioning the most iconic historical figure to be associated with Nottingham – Robin Hood. “He robbed the rich to feed the poor.” The legend of this folklore hero has captivated people across the world. Whether it be film, TV or print media; you’re probably familiar with the Robin Hood mythology already. You’ve seen him portrayed by many famous stars, from Russell Crowe and Kevin Costner to Errol Flynn. The legend actually began as early as 1225 when a fugitive known as ‘Robert Hod’ became infamous for robbing travelers moving between Nottingham and Yorkshire through Sherwood Forest. Then from around the mid-1200s “Robin Hood” become a popular nickname for outlaws – so it’s likely that Nottingham has seen a number of different Robin Hoods in its time - just as Hollywood has! Bow-shooting outlaws aren’t the only figures that’re famous for their Nottingham origins. Famed English writer and poet DH Lawrence began life in Eastwood, Nottinghamshire. In fact, the very building of his birthplace has been converted into the DH Lawrence Museum. Literary enthusiasts of his works: Sons and Lovers, Women in Love and Lady Chatterley’s Lovers regularly make the pilgrimage to this popular site. By immersing yourself in the landscape of Eastwood’s mining heritage, it’s easy to see how the location itself was a huge inspiration to DH Lawrence’s writing. Nottingham has an impressive array of world-class sporting facilities, many of which you’ll have already heard of and seen on TV. The City Ground is the home of Nottingham Forest Football Club. The stadium played host to a number of international football games during Euro 96 and is a beloved landmark among its faithful supporters. In fact, the supporters themselves raised £2,000 of the £3,000 needed to finance the move to the City Ground back in 1898. Then right across the road you can enjoy a spot of cricket at the Trent Bridge Cricket Ground. A beautifully designed sporting facility that’s a regular fixture for international test matches – and for good reason. You’ll usually see the place packed to maximum capacity with eager cricket fans in the summer months and you can even have your wedding there. And if you continue on down the road, you’ll find the incredibly scenic National Water Sports Centre. Whether its canoeing, kayaking, white water rafting or Olympic rowing that takes your fancy – this place does it all. It’s also a popular venue for recreational bike riding and you can see why. If football, cricket and water sports don’t take your fancy, tennis fans are in for a real treat! Nottingham is home to the largest public tennis centre in the whole of Great Britain. The facility supports a thriving local tennis community of all ages and abilities – including many keen racket swingers from the University of Nottingham. For people that enjoy the great outdoors, Sherwood Forest is the perfect getaway. The site attracts a staggering 350,000 visitors every year. And those visitors enjoy a variety of activities such as: nature walks, archery, historical events and tours. It’s also an important conservation site that homes The Major Oak, a tree that’s approximately 1,000 years of age. Run by the National Justice Museum Trust, this educational site uses real spaces, objects and stories to immerse visitors in the fascinating history of social justice and its effect on modern times. A total of £3.5 million was raised for the restoration of the venue in 1994 and in 2005 it unveiled its National HM Prison Service to the general public. The most extravagant of all the major buildings in the heart of the city. The Theatre Royal’s heritage stretches all the way back to 1865. Over the years it’s withstood two world wars, the rise of cinema, TV and radio and maintains a strong foothold in Nottingham’s city culture. The venue recently launched its digital archive where people can trace this heritage back to its early beginnings. And there’s no shortage of entertainment. Whether you enjoy plays, music concerts, stand-up comedy, pantomime or even dance – this place has something for everyone. Nottingham’s Lace Market is one of the oldest parts of the city. It makes up a large portion of Nottingham’s Creative Quarter. The Lace Market was renowned in the fashion world for its intricate lace manufacturing. This legacy continued in 1970 when international fashion designer Paul Smith opened his first boutique in the area – and the rest as they say, is history. The area has held on to its creative origins and still attracts a large portion of Nottingham’s mod and hipster crowd with its bohemian vibe. And last but not least we have Nottingham’s favorite stately home – Wollaton Hall. Built between 1580 and 1588, this quintessentially regal building was considered to be “the architectural sensation of its age”. The hall is surrounded by acres of scenic grounds, a beautiful lake and a wild deer park that’s home to over 90 red and 120 fallow deer – a truly magnificent sight during the winter months. The location is so impressive that even Hollywood came calling! In 2011 Wollaton Hall was selected by movie director Christopher Nolan for his third and final Batman movie: The Dark Knight Rises, standing in as the infamous (new look) Wayne Manor. Throughout the year the venue puts on a wide variety of exciting events such as: tours, a dinosaur exhibition, open-air plays and open air cinema screenings during the summer (including the Batman movie – naturally). Life in Nottingham Welcome to Nottingham! It’s known for its role in the Robin Hood legend and for the hilltop Nottingham Castle Museum and Art Gallery, rebuilt many times since the medieval era. In the Lace Market area, once the centre of the world’s lace industry, the Galleries of Justice Museum has crime-related exhibits. Wollaton Hall is an ornate Elizabethan mansion with gardens and a deer park. Nottingham and Nottinghamshire The city has many highlights if you consider studying at the University of Nottingham. Here are the \"hidden gems\" students should know about when visiting Nottingham. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}