{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/disability-support-services/minibus-service.aspx",
    "content": [
        {
            "p": "The minibus service allows disabled students to travel to lectures, seminars, tutorials, library, meetings with support teams and attend other academic activities. The minibus is accessible for both manual and powered wheelchairs and operates on all the University’s campuses: University Park, Jubilee, Sutton Bonington, Kings Meadow, University accommodation, Queens Medical Centre and City Hospital Nottingham. Journeys need to be pre-booked in order to accommodate all students. Whilst the service aims to be responsive and offers some degree of flexibility it does not and cannot operate as a taxi service. During term-time the minibus operates Monday to Friday, from 8am to 6pm. Out of term-time: The minibus does not operate on University closure days. Once you have been referred for the minibus, you will be sent an information pack and an email welcoming you to the service. You will receive a minibus service user form for you to book your minibus journeys. Please complete and submit this form by 5pm every Wednesday for journeys commencing the following Monday. After you have submitted the form you will receive email confirmation of your booked journeys and the drivers by midday on Friday. Please remember to check your emails regularly. If you have any difficulty reading or completing the form please email disability-supportservices@nottingham.ac.uk so we can assist you. Please note the following points: If you have already received email confirmation for your booked journey, please call the driver to make the change. If you have not received email confirmation of your booked journey yet, please email minibus@nottingham.ac.uk Please be aware that booking times may be altered to take into account regulations surrounding Covid-19. You will be notified of any changes in advance by email. It is your responsibility to ensure all the appropriate restraints (clamps and belts) are used during journeys. Please ask the driver if you require help - you should not distract the driver whilst the minibus is moving. In accordance with University policy, food, drink, smoking and vaping are not permitted in the minibus. All passengers must comply with these safety procedures and the University of Nottingham will not assume liability for passengers who do not comply with them. Failure to comply with these safety procedures will result in the withdrawal of the service. The service will follow the Covid-19 guidelines laid down by the government and our operation of the service will be reviewed regularly. The following additional safety measures will be in place: University Park Nottingham NG7 2RD Please see our need help page for telephone and online contact points"
        }
    ],
    "pdf_files": []
}