{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/English-and-History-BA-Jt-Hons-U6UENLHT.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK Everything has a story. And this course is perfect if you love finding new interpretations. Whether this is through literature, or looking to the past to discover the secrets of the people, places and events of our ancestors, it is these stories which give us our sense of place in the world. This course combines studying the history of Europe and beyond with English language, literature and drama from Old English to the present. You will study a choice of themes, ranging from American Civil Rights, to the Crusades, to Colonial India. You can also tailor your degree to what you enjoy most, choosing from a huge range of optional modules covering historical figures, events and themes from the 6th century CE to the present day. As a joint honours student, you will benefit from skills development and assessment methods from both subjects. Each subject is taught separately, but you can choose a uniting theme for your final year dissertation. Mandatory Year 1 Learning History Optional Studying Language Studying Literature Beginnings of English Drama, Theatre, Performance Making the Middle Ages, 500-1500 Themes in Early Modern History Roads to Modernity: An Introduction to Modern History 1750-1945 The Contemporary World since 1945 The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Monday 16 December 2024. Due to timetabling availability, there may be restrictions on some module combinations. Your tutors will also be available outside these times to discuss issues and develop your understanding. We reduce your contact hours as you work your way through the course. As you progress, we expect you to assume greater responsibility for your studies and work more independently. Your tutors will all be qualified academics. You will have a personal tutor from the School of English and a joint honours adviser from the Department of History. Outside of your contact hours, the rest of the time is yours to carry out independent work. This may mean time spent in the library, doing preparation work for seminars, reading books and journal articles from the reading list and researching your assignments. As a guide, 20 credits (a typical module) is approximately 200 hours of work (combined teaching and self-study). Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. The main skills I've gained are debate and discussion. It urges you to step outside your comfort zone a bit more. Also research skills. I think my research ability has doubled! You have to go into depth when researching and creating your essays, and that’s definitely a skill that can help me going forward. Devraj Jheet English and History BA English and History BA Faculty of Arts Entry requirements BCC UCAS code Y14F Duration 4 years full-time Start date Sep 2025 First-year student Aurora shares a typical day... School of English Nina is an English Language and Literature BA student. She shares her top 3 tips for getting the most from your degree. Bring history to life. From caves, to prisons, to England's oldest Inn, Nottingham has plenty of medieval places to explore. A student placement like no other, ten years in the making. 54% say staff value students views and opinions about the course Data for English and History (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}