{
    "url": "https://www.nottingham.ac.uk/student-living/accommodation/stay-in-halls.aspx",
    "content": [
        {
            "p": "Find the campus that's right for you Love the convenience and community of living in halls? Good news – you don’t have to leave after your first year! Whether you are heading into your second year, final year, or any year in between, our halls are open to returning students – and we would love to welcome you back. Living in our halls keeps you close to everything that matters – your lectures, local amenities, and the vibrant social life on and around campus. The University offers a range of catered and self-catered accommodation options both on and off campus, designed to suit your needs and lifestyle. Our award-winning halls provide an exceptional experience, blending comfort, convenience, and a strong sense of community. You will be just a short distance from lectures, libraries, and social spaces, making it easy to balance your studies with everything university life has to offer. When you choose to live in our halls, you gain more than just a great location. You will also benefit from exclusive programs like Active Living and the Residential Experience Team, designed to support your wellbeing, help you build friendships, and enrich your university journey. Enjoy a vibrant calendar of social events, fitness classes, and personal development opportunities – all created to help you thrive. Start your application now With our exclusive ‘Next Year’s Room, This Year’s Price’ promotion, there is no better time to secure your accommodation for next year. Returning students can book their room for the 2025/26 academic year at this year’s rates*, offering both value and peace of mind. Do not miss this limited-time opportunity to plan ahead and make your next academic year as seamless as possible. *= Subject to availability and terms and conditions. The University of Nottingham works with a variety of providers to supply accommodation across Nottingham. These are fantastic options for students entering their second year and beyond. You can find many of our partner sites below. Live in the heart of Beeston town centre, 15 minutes from the University Park campus. We have dedicated flats for our returner community, you can book a room and live with other returners, or apply with friends to share a flat. And on-top of that, we have returner discounts available. You can speak to the Village Team to let them know you are interested in booking again and they will contact you to ensure you get the best choice of rooms at the best rates. Live in our community of over 2,000 students opposite the West Entrance of the University Park campus. Book a room with us and live with other returners, or apply with friends to share a flat. And on-top of that, we have returner discounts available. Broadgate Park is the place to be. Deakins Place is a brand-new purpose-built modern student accommodation that along with neighbouring Student Roost property Nottingham Two, forms Student Roost's Nottingham Student Quarter. It is the ideal place to relax and socialise with a modern hosting kitchen, a multimedia lounge, and a dedicated yoga studio amongst the spaces for our residents to enjoy. Deakins Place offers a range of room types to suit everyone including ensuite flats and self-contained studios. Our student accommodation in Nottingham is located just a short walk from the University of Nottingham’s Jubilee Campus. Madison Gardens is the perfect choice for students looking for an affordable, convenient and comfortable place to call home. Morriss House is a 700-bedroom property on Derby Road, in the heart of the student community in Lenton. Packed with features including study areas, a karaoke room, games room, a fitness rooms as well as a café area. Nottingham Two is situated adjacent Deakins Place, forming Student Roost's Nottingham Student Quarter. It is a five-minute walk to the Jubilee Campus, close to the city centre and Lenton. The property is made up of a mix of en-suites, which share a kitchen and living area with two to four other students, and self-contained studios which offer a private kitchen and living area. All residents have access to Deakins Place gym and a common room which features study pods and games tables. Situated on the old Raleigh cycles site, this student complex is located close to the popular student areas of Lenton and Radford. Just outside of Jubilee Campus, it also offers easy access to University Park and the city centre. With its great location, Riverside Point is an ideal place to live during your time at the University of Nottingham. The property consists of en-suite bedrooms arranged in flats for five residents, each having its own shared kitchen and living area providing a great space to relax with flatmates. The property is also conveniently located for access to Jubilee Campus and is only a 15-minute walk from the University Park Campus. We would love you to stay with us for another year. Speak to your team at reception to see if you can rebook the room you are staying in now. Alternatively, check what is available in your city on our website. Triumph House, built in 2022, provides a variety of stunning studios and en-suite serviced apartments with hotel-like services located close to Jubilee Campus, the Queens Medical Centre, and only a 15 minute walk to University Park. Included is an in-house wellness spa, gym and entertainment area. Conveniently located in Dunkirk and on University Park for both University Park and Jubilee Campus, and College Road for Sutton Bonington campus. University Houses owned and managed properties range from 3 or 4 bedroomed to one 5 bedroomed house for groups of 3, 4 & 5 students to share, with shared bathroom and kitchen facilities. These propertiesoffer the opportunity for students to enjoy a bit more independence, whilst having the support of the Estates Maintenance Helpdesk. To apply, please complete the application form or contact us for more information. Start your application Contact us"
        }
    ],
    "pdf_files": []
}