{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/our-campus-and-facilities.html?path=L2NvbnRlbnQvdW9uL2diL2VuL3N0dWR5d2l0aHVzL3Vnc3R1ZHkvYXJ0aWNsZXMvZXhwbG9yZS1tb3JlLWFydGljbGVzL2NlbnRyYWwvamNyOmNvbnRlbnQvcm9vdC9jb250YWluZXIvY2Fyb3VzZWw=&variant=c3RhdGlj&title=SGF2ZSB5b3Ugc2VlbiB0aGUgZmFjaWxpdGllcyBhY3Jvc3Mgb3VyIGNhbXB1c2VzPw==",
    "content": [
        {
            "p": "Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities. Nottingham is located in the heart of the Midlands and has excellent road and rail links to major cities across the UK. There are easy transport links to the local East Midlands Airport as well as major airports in Birmingham, Manchester and London – making it accessible from anywhere in the world. This 300-acre landscaped site is only 20 minutes from the city centre by public transport. This is where the majority of our courses are taught. This is University Park, Nottingham. Home of it all. Futuristic architecture, eco-friendly buildings, a library in a lake and innovative technologies make Jubilee Campus an inspiring place to be. Jubilee Campus is it's own unique space... Home to our veterinary and bioscience courses, Sutton Bonington Campus offers a student experience that's as unique as our students are. From sports to events and societies, and even a farmers market. Our home of bioscience. The heart of veterinary medicine. A gateway to life in all its glorious forms. Where nature helps nurture new discoveries, and dairy stories are written. The home of opportunity, find out more about the courses available at our Ningbo Campus, China or at our our Semenyih Campus, Malaysia. The University of Nottingham, University Park, Nottingham, NG7 2RD Campus and facilities Beyond a welcoming community, the facilities you’ll find at the University of Nottingham will provide you with the complete package for a great student experience. UON Hungry? Don’t worry, there are plenty of dining options at the University of Nottingham. We’ll talk about the best places to refuel: on campus and in the city. Sutton Bonington campus The University of Nottingham, Sutton Bonington, Leicestershire, LE12 5RD, UK If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}