{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Business/Nottingham-University-Business-School.aspx",
    "content": [
        {
            "p": "Nottingham University Business School (NUBS) Malaysia is an integral part of Nottingham University Business School established in the UK. The school aims to enhance business and management knowledge and practice in a responsible and sustainable way using our global presence. NUBS was established on the Malaysia Campus in 2000, and our presence here provides students with unique insights into Asian business growth and development. We are a large and culturally diverse school, with over 30 full-time academic staff, from countries such as Malaysia, Indonesia, South Korea, Australia, India and the United Kingdom and over 1,000 foundation, undergraduate, and postgraduate students. The school is accredited by the European Quality Improvement System (EQUIS) and the Association of MBAs (AMBA). The MSc Finance and Investment programme is accredited by the Finance Accreditation Agency (FAA), an international and independent quality assurance and accreditation body for the financial services industry supported by Bank Negara Malaysia (the Central Bank of Malaysia) and the Securities Commission of Malaysia. These endorsements signify that the School has met the stringent standards for business education. Find out more about the Business School’s rankings. If you’re looking to do a Master’s in Business in Malaysia, NUBS strives to provide students with the best possible education and experience in preparation for successful careers in the business world. Our Postgraduate Business Courses are designed to provide advanced knowledge and skills in various areas of business, including finance, management and entrepreneurship. Our programme features: An experienced faculty with a deep understanding of the industry. NUBS’ professors are committed to providing students with a challenging yet supportive learning environment. We understand that our students may have busy lives and careers, which is why we offer flexible schedules for our courses. You can choose to study full-time or part-time. We offer opportunities for internships and other practical experiences that will give you a competitive edge in the job market. No matter which postgraduate business course you enrol in at NUBS, you will have access to career development resources such as career counselling, and networking opportunities. Our programme offers a global perspective, and courses focus on global business issues, ensuring that students have a broad understanding of different cultures and business practices. Admission requirements vary depending on the programme you want to study. However, applicants generally need to have an undergraduate degree from an accredited institution and achieve a minimum GPA. Work experience may also be considered for some courses. For more detailed admission requirements, visit the page of the course you intend to apply for. The length of the programme may vary depending on the course itself and degree level. A full-time postgraduate business course typically takes 1 to 2 years to complete, while part-time programmes may take up to 4 years. NUBS graduates are well-prepared for a variety of careers in the business world, including roles in marketing, finance, management, consulting, entrepreneurship and more. You may also choose to pursue advanced degrees or research positions. No, unfortunately, all our courses are in-person. However, you can choose to either study full-time or part-time. Jalan Broga, Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}