{
    "url": "http://www.nottingham.edu.my/Study/Postgraduate-courses/Business/Master-of-Business-Administration-MBA.aspx",
    "content": [
        {
            "p": "UNM/JPT-R3/0414/7/0120(6/29)MQA/SWA0136 Our MBA is a programme in general financial and corporate management. Our programme adds value to your first degree by helping you develop an integrated and critically-aware understanding of management and organisations in an international context. It will help expand your career prospects, earning potential and enhance your CV. An MBA will elevate your employability status making you attractive to the most prestigious employers who require your skillset. We are the only UK-based University in Malaysia with a full-time MBA programme. You will join like-minded peers from diverse backgrounds in terms of position (CEOs, CFOs, CTOs, and middle managers), industry (public and private sectors, NGO, entrepreneurs) and experience. The programme also offers an international study experience where students can take up to 2 modules at our Singapore partner institution (PSB Academy) under their Malaysia fees payment. The programme has a block delivery format which allows students the flexibility to pace their study and time (subject to the exact schedule) and customize their study interests by choosing up to 4 optional modules catering to specific interests and selected management project topic. Top 60 worldwide – 3rd in the UK and 55th in the world for best full-time MBA – The Economist MBA 2021 1st in the UK – for salary increase and top 10 in the UK for salary and potential to network, and 12th in the world for personal development and educational experience – The Economist MBA 2021 5th in the world – for best MBA for sustainability – Corporate Knights Better World MBA Ranking 2020 Top quality school – benchmarked against international standards - EQUIS and AMBA accredited More than 19,000 – Business School alumni connect you to a powerful global network of business contacts Individuals wishing to study overseas can take up to two approved modules delivered by our overseas partner institutions (subject to the availability of modules). You must complete a total of 12 taught modules (8 core modules and 4 elective modules) and a Management Project. Most modules will involve group work with like-minded individuals from diverse industries and countries. You will also develop the skills to implement agreed solutions effectively and efficiently, along with interpersonal skills to enable you to interact across a wide range of business stakeholders. We also host a Business Leaders Seminar Series, which serves as a platform for interaction and exchange of ideas with industry leaders from various sectors. You will also have the opportunity to attend study skills sessions, workshops on soft skills such as teamwork, leadership and critical thinking, and additional workshops and seminars on research methods relevant to management projects. Management Project Each student is required to complete a management project that will focus on an area of interest. Students may choose any one from three types of management project: In this module you will 'examine the complex cycle of financial reporting, management accounting, corporate financing, and investment within a business. You will learn how good financial stewardship ensures that financial resources are in the right place, at the right time, and in the right form to sustain the business in meeting the needs of its stakeholders. You will enhance your financial literacy through the practical experience of developing financial reports, analysing risk, recommending financing, and making investment decisions. Core to your ethos will be environment, society, and governance (ESG) objectives, sustainable value creation, and responsible investment. Experienced professionals will share their insights into global capital markets, micro-finance, and funding in the non-profit. In this module you will gain an advanced understanding of the function of a wide range of markets for the production, exchange, and consumption of goods and services. We will examine how people perceive the choices available to them, and assess the associated risks, to make optimal decisions. We will also explore the nature of competition in dynamic markets, and the approaches that companies take to gain temporary and lasting advantage. Change is at the heart of our teaching. You will learn about innovation and the impact of disruptive technologies, such as digital platforms that create new markets, and how transformation occurs whilst protecting consumers and building market resilience to achieve lasting social good, and how greater environmental awareness is impacting and changing market behaviours. Identifying, defining, and solving problems is key to a thriving society and economy. Whether working individually, within an organisation, or setting up a new business, it is your entrepreneurial skills that will enable you to establish new sources of value. Challenges and opportunities come in many forms. Whether it is the need to develop a circular economy, expand clean technologies, enable regeneration, or ensure resource sustainability for future generations, this module gives you the opportunity to make your mark. Using the University’s Ingenuity™ creative problem-solving model, you will work in teams, mentored by experienced entrepreneurs, to address a practical entrepreneurial challenge. This module will integrate your thinking to build your business planning and pitching skills. Designing, forming, and leading organisations provides people with essential livelihoods. Doing this with a shared sense of purpose enables the organisation to amplify its social good across many markets and countries. Within a good governance structure, we examine what leaders do to motivate and empower employees, shape cultures, drive change, resolve conflicts and increase inclusion using power and effective decision-making. We will explore a range of human interaction techniques including motivation and rewards, job design, teamworking, and leadership. From this you will enhance your team-working skills, leadership profile, and your interpersonal effectiveness. You will hear from experienced and successful leaders of the challenges they faced in their careers and the lessons that were learned leading to their improved practice. We are all consumers and the targets of marketing activity from many organisations. But do we really understand why these companies do what they do for us? How do they know what products we want, how much we are prepared to pay, where we want to buy them, or how we want to be spoken to? You will explore how companies create valuable relationships in a context of changing consumer behaviour, varied needs, dynamic market conditions, and unrelenting global competition. This takes place in an era of improving professional standards as the marketplace rewards ethical marketing, transparency, customer engagement, and responsible consumption. You will learn through case studies and from discussions with a range of expert practitioners. Well designed and well managed operational systems that align with an organisation’s strategy are central to achieving and sustaining high levels of performance. We focus on contemporary and emerging practice across the industrial, service, public, and not-for-profit sectors, emphasising high performing operational processes capable of delivering an organisation’s products and services efficiently and effectively. You will be able to assess the challenges in managing complex operations, projects, and supply chains to deliver high-quality outcomes, using Lean techniques and Six Sigma. You will understand the critical importance of IT and digitally enabled systems in supporting strong operational performance. We share insights from business and industry, including analysis of contemporary case studies and expert practitioner views to drive business agility, rapid fulfilment and customer-focused product variety while promoting resource sustainability and operational resilience. Strategy is the practice of how an organisation fits within its chosen environment to ensure sustainability, competitive advantage in the good times, and resilience in more challenging times. You will develop strategic analyses both for the external competitive environment, and for the organisation’s internal resources and competences, establishing priorities for where and how to focus development resources. Ever mindful of current and emerging global competition you will use creativity and nuance to make clear the organisation’s strategic purpose, giving clarity of role to key stakeholders, and ensuring transparent governance. Experienced practitioners will share their successes and failures of developing and delivering business, societal, and international strategic interventions. You will learn from a dynamic blend of case studies, cutting-edge research insights, and guest speakers. How do business leaders recognise their need to be responsible and accountable for their environmental and social impacts? How can they develop effective strategies to address sustainability challenges such as climate change, and how can those strategies play a fundamental role in core company performance and success? This sustainable business simulation tackles these questions in an innovative way. Students gain first-hand experience of leadership roles in sustainability, and the complexities of creating sustainability strategies to ensure ‘shared value’ for companies, their stakeholders, and the environment. They learn how to defend those strategies in a board conference with experienced business practitioners, and how to approach a sustainability crisis through a simulated press conference with real journalists. The aim is: student understanding of what is required to be a responsible business leader. The idea that managers should operate in the interests of shareholders is examined and its consequences explored. The course looks at what should happen in practice, but also what does happen. Where theory and practice apparently diverge possible reasons are explored. Learning outcomes: The module examines the risk and return characteristics of classes of financial securities (equities, bonds, derivatives) and the processes and consequences of combining these securities in portfolios. The traditional meanvariance approach is extended in two ways, first by recognising that return distributions may not be well described by mean and variance, and secondly by examining the possibility that investors take into account non financial, ethicalconcerns in their portfolio building decisions. Any finance module, and a portfolio management module, in particular, needs, post 2008, to reflect (and to reflect on) the gap between textbook treatments and \"the real world\". Standard textbook treatments offer \"the efficient markets hypothesis\", \"the capital asset pricing model\" and \"the Black Scholes model\" in a relatively uncritical way, but post 2008 these models have been ridiculed in the financial press as \"unrealistic\". This major difference of opinion is examined in the module. This course provides students with an appreciation of the role of law in consumer and commercial transactions. One of three central aims of the course is to offer participants an appreciation of the legal status of corporations and the rights and responsibilities of the various stakeholders in the corporate entity. This module examines ethical issues and dilemmas, covering a range of complex and controversial problems relating to business in a global economy. The main concepts and theories underpinning the business ethics field will be introduced, and students shall have the opportunity to apply these to business situations. More specifically, the course explores issues of human rights, globalization and sustainable development, and places these within different philosophical and cultural perspectives. The course also explores the role of corporations, multinational corporations, and Nation-States from an ethical perspective, and situates these explorations within a political-economic framework. This module explores the role of Business Intelligence (BI) in transforming the way companies strategize and organize for change to induce sustainable growth and innovation, new organizational forms, and intellectual property. BI is prevalently relevant to the digital economy. Being digitally fluent is a must to lead and manage, and to respond to changes in competition and markets. Entrepreneurship in Practice will introduce students to the more practical elements of innovation and enterprise activity across multiple contexts, including not just new venture creation but corporate and social entrepreneurship as well. Whereas Entrepreneurship and Creativity focus on idea generation and entrepreneurial theory, Entrepreneurship in Practice will prepare students to recognise opportunities and to implement innovation and enterprising ideas. The ability to make informed and timely decisions will be an important aspect of this, and the module will use a start-up business simulation to encourage this. What is Innovation Management? - definitions and models of the process; Innovation Strategy; the national and competitive environment; innovation processes within multinational firms; innovation processes within large public sector organisations; the systems of innovation specific to small high technology firms; Management techniques for innovation, shared vision, effective team working and a creative climate; Learning from Markets, marketing technological and complex products and learning through alliances; Integration of Approaches, Key themes, learning to manage and measure innovation and through the group presentations - Appraisal of innovation management within different organisations. This course is about leadership based on the observation that the leadership needs of organisations vary by the stage of the organisation's existence. Leading an entrepreneurial start-up requires different skills from leading a mature organisation. Consequently, organisations need to be aware of their progress through the organisation's lifecycle and evolving needs. This course examines the stages of an organisations existence and the associated evolving leadership needs, plus additional situations such as leading in a crisis. The course focuses on identifying leadership needs and the necessary decisions together with the appropriate leadership style. As a secondary theme, there will also be a number of sessions focussing on leadership qualities and styles which will encourage participants to reflect on their own development as leaders. A number of models of leadership are considered and different leadership perspectives. Understanding of the concepts is achieved predominantly but not exclusively through the use of case study material. *Elective modules are subject to change All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. A relevant second class honours degree (or international equivalent) or a relevant professional qualification deemed equivalent to a first degree with honours, plus at least three or more years of full-time management or leadership work experience, normally gained since graduating from the first degree. Non-UK qualifications will be assessed against this standard. Applicants are required to attend an interview. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. In addition to lectures, some modules have lab sessions, some have workshops and some drop in sessions. Each module is run with the aim of providing best learning experience for students and module objectives are achieved by devising the most appropriate delivery and assessment methods. Depending on the module, you may be assessed by examination, group or individual coursework, group or individual presentations, or a combination of assessment methods. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. KLTC is a UNM facility located in the heart of Kuala Lumpur. Select postgraduate programmes from business, politics and applied psychology are delivered here to support the flexibility of postgraduate students. The centre also served as a supplementary venue for the University’s external events, seminars and conferences. KLTC is located on the second floor of Chulan Tower, near the Petronas Twin Towers and the Bukit Bintang district. It is easily accessible via the city’s train system, with the building located next to the Conlay MRT station. Free shuttle bus services are also available from the UNM Semenyih campus to KLTC. The Nottingham MBA is ideal for individuals seeking to develop their potential in order to manage and lead in the current dynamic and complex organisational environment. It is a highly valued qualification in both the public and private sector for middle/senior level managers and entrepreneurs alike. It will help to develop management skills for senior positions, enhance career prospects and nurture leadership capabilities. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}