{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Biochemistry-BSc-Hons-U6UBCHMY.html",
    "content": [
        {
            "p": "Medical School Building and University Park Campus, Nottingham, UK Are you fascinated by the molecular fundamentals of life and the chemical processes occurring in living organisms? If you are, then biochemistry is the degree for you. Biochemistry is a science which seeks to understand how cellular activity determines organism level outcome. You will learn how the regulation of gene expression and protein function controls every aspect of cell behaviour, from cell division and cancer to cellular metabolism, obesity, protein degradation and neurodegenerative disease. With practical experience from term one, you will be trained by scientists who are leaders in the fields of biochemistry and the molecular basis of disease. This teaching will ensure you graduate Biochemistry BSc with the core skills needed to be successful in your future profession with potential careers from laboratory scientist to data analyst, patent law and teaching. Mandatory Year 1 Core Skills in Biochemistry Genes, Molecules and Cells Fundamental Inorganic and Organic Chemistry Optional Life on Earth Fundamentals of Neuroscience Human Physiology Molecules of Life The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Monday 16 December 2024. Due to timetabling availability, there may be restrictions on some module combinations. On average there are 20 hours contact time with staff per week. Each hour of contact time should be followed with approximately 1-3 hours* of self-directed study. *increases with progression Core hours of directed learning are 9 am – 5pm, Monday to Friday, with Wednesday afternoon reserved for sports and other societies. Occasionally lectures are held from 5-6 pm. Classes start on the hour and should finish by 45 minutes past the hour, to enable students and staff to get to their next engagement. All lectures are recorded for inclusion and for revision purposes. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. 83% in work or doing further study 15 months after the course. Data for courses in Molecular biology, biophysics and biochemistry at University of Nottingham, the For more official course information visit Discover Uni See course data If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}