{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/scholarships/guidance-notes.aspx",
    "content": [
        {
            "p": "To help you make the most of your scholarship application, the guidance notes below should help you plan your responses to the scholarship application form. Word count: When answering questions with a word limit, make sure that you keep to the word limit and don’t exceed it. Any responses that exceed the word limit may not be assessed. Prepare your responses in a word document first before submitting on the form if you think you might go over the limit. Be prepared: Read the questions carefully and take your time to ensure you answer the questions fully. We want to hear about you. Don’t give generic responses. Plagiarism: Ensure that your answers are your own. Don’t copy and paste responses. Ensure that any sources are acknowledged, as you would in an academic context. Accuracy: Scholarships are assessed and awarded based on the information provided in your online scholarship application. We reserve the right to withdraw a scholarship, if we are of the reasonable opinion that information provided is not accurate. As a guide, here are examples of some of the questions that you’ll be expected to complete as part of our online scholarship application form. Note that not all questions apply to all scholarships. How does the academic programme you've applied for align with your academic and career aspirations? (Applicable to Undergraduate and Postgraduate Academic Excellence Awards, Undergraduate and Postgraduate International Excellence Awards, and GREAT) We want to understand why you've chosen this specific academic programme and how it aligns to your personal academic and career aspirations. What is it about the specific course that interests you personally? Are there any particular modules that you're particularly interested in studying and why? Do your career goals align with a module we teach? Are you drawn to this course because of specific academic staff or facilities? If so, give details. Remember to link your responses back to the original question. What are your expectations of the university, and how do you feel being part of the university community will help you to achieve your academic or career aspirations? (Applicable to Undergraduate and Postgraduate Academic Excellence Awards, Undergraduate and Postgraduate International Excellence Awards, and GREAT) What is it about the University of Nottingham that attracts you, and how do you feel that being part of the university community will help to achieve your goals? Be specific. We want to hear about your personal expectations and anticipated contributions. How do your academic achievements to date demonstrate that you should be selected for this scholarship? (Applicable to Undergraduate and Postgraduate Academic Excellence Awards, Undergraduate and Postgraduate International Excellence Awards, and GREAT) Remember, we're looking for evidence of academic excellence. Tell us what makes you stand out from your peers academically (either within school/university or any extra-curricular academic undertakings) and why you should be selected for this scholarship. Have you won any academic prizes or received commendations relevant to your chosen degree programme? If yes, please give details. (Applicable to Undergraduate and Postgraduate Academic Excellence Awards, Undergraduate and Postgraduate International Excellence Awards) Only include evidence which is relevant to your academic programme of study. Do not include evidence of non-academic prizes. How will your masters' studies at the University of Nottingham enable you to make a developmental impact on your home country, in line with the criteria of the scholarship? (Applicable to Developing Solutions Scholarship only) Please note that as part of the review process, responses to this question will be prioritised. Only candidates with satisfactory responses to this first question in line with the Developing Solutions scholarship criteria will be put forward for full application review. Be specific and realistic. We want to hear about how your chosen course will contribute to your ability to make a developmental impact. Are there any specific learning outcomes from the course that will facilitate this? What developmental impact are you hoping to achieve? What is your plan and how do you intend to implement it. What are the expected outcomes? You may want to focus on localised development impacts, for example, specifically within your area of work or localised community/region, in conjunction with the UN's Sustainable Development Goals. How will your University of Nottingham degree support your future career objectives? (Applicable to Developing Solutions Scholarship only) We want to hear about your future career objectives. Be specific on how your degree will support this. You may want to outline your future career objectives, don’t generalise - what are these, and what are your short to medium-term plans?"
        }
    ],
    "pdf_files": []
}