{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Applied-Mathematics/Mathematics-and-Data-Science-BSc-Hons.aspx",
    "content": [
        {
            "p": "UNM/JPT-N/461/6/0032(3/26)MQA/PSA14369 Mathematical Sciences will allow you to achieve a quality degree driven towards data analytics. Taught modules will allow you to enhance your experiences and knowledge by building on skills in computing, statistical and mathematical modelling and management. Mathematical science degrees are widely used in all aspects of modern society, from statistics and computing to management, scientific work and teaching. Both data analytics and data science are a major component of Industry 4.0. Today more than ever all industries around the world including agriculture, manufacturing, trading, healthcare and finance are rapidly evolving into data-driven economies. The worldwide situation of the recent Covid-19 pandemic has taught us that economies based on data science and data analytics are not only important but essential for the survival of the majority of businesses. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. BBB, including Mathematics, excluding critical thinking and general studies. 79% average based on 6 subjects with at least 70% in Advanced Functions and Calculus and Vectors. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. Successful completion of the Foundation in Engineering or Science programme with a minimum of 50% in all mathematics modules. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Engineering or Science is a pathway for students to pursue a BSc (Hons) in Mathematics and Data Science. Modules on the programme aim to improve language and study skills as well as enhance understanding of mathematics and the physical sciences. Successful completion of this programme with no failed modules and a minimum of 50% in all mathematics modules are required for progression to the BSc (Hons) Mathematics and Data Science. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. The programme serves to prepare graduates for the career path of data science. Based on the selection of modules in the programme, graduates and enter specialized fields in data science. The University of Nottingham’s Mathematics and Data Science BSc (Hons) programme is an interdisciplinary undergraduate degree that combines the mathematical foundations with the skills and techniques of data science. This course will equip students with a strong background in computational expertise and mathematics that is necessary to analyse, interpret, and extract insights from complex data sets, which will help to make informed data-driven decisions across various industries. This course offers many advantages. The combination of mathematics and data science enables students to gain a comprehensive skill set that is in high demand in the job market. Graduates of this programme will possess a strong foundation in mathematical science principles, statistical analysis, and programming skills, which prepares them for careers in data science, data analytics, machine learning, and other related fields. Yes, internships and practical experience are part of the course to provide students with the opportunity to apply the mathematical and data science knowledge they learnt in real-world settings. This will further help them gain practical skills and build professional networks. Yes, the strong foundation gained from this undergraduate degree will allow students to pursue postgraduate degrees in fields such as engineering, data science, computer science, statistics and other related disciplines. UNM students can consider the Engineering MPhil/PhD for postgraduate studies. A degree in this discipline opens doors for work in sectors such as: Graduates can pursue job roles such as: Proficiency in programming languages will help you succeed in this course. However, you do not need prior knowledge to enrol. A Mathematics and Data Science course typically introduces students to several common software and tools used in the field. Students will learn programming languages such as Python and R and be exposed to tools and frameworks such as TensorFlow, scikit-learn and SQL databases that are commonly employed in the data science ecosystem. Yes, UNM offers both scholarships and financial aid to deserving students who are enroled in this degree. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}