{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Biomedical-Sciences/Biomedical-Sciences-MPhilPhD.aspx",
    "content": [
        {
            "p": "UNM/JPT-R/421/7/0036(7/26)MQA/SWA0820 UNM/JPT-R/421/8/0034(7/28)MQA/SWA0822 The MPhil and PhD biomedical programmes are 1-2 year and 3-4 years in duration respectively. Research is crucial to the biomedical industry with many of our academic staff at the leading edge of scientific and healthcare developments. The current research curriculum allows students to gain hands on experience in their chosen field as well as participating in regular research symposiums. Both are an opportunity to develop their research network and practice their science outreach skills. With expert supervision from leaders in their field, extensive training, leading-edge facilities and strong links with industry, students at the University of Nottingham Malaysia thrive in a vibrant, multidisciplinary environment at one of the world’s most respected research-led universities in the world. All of our research students work in one of the following research divisions: In the area of healthcare delivery systems, we extract innovative models and approaches from across sectors to alleviate health challenges in resource-limited low-income countries. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. MPhil An upper second class honours degree (or international equivalent) in biomedical sciences, pharmacology, pharmacy or a related scientific discipline. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. PhD A master's degree (or international equivalent) plus, an upper second class honours degree (or international equivalent) in biomedical sciences, biochemistry, pharmacology, pharmacy or a related scientific discipline. Non-UK qualifications will be assessed against this standard. Or A first class honours degree (or international equivalent) in biomedical sciences, biochemistry, pharmacology, pharmacy or a related scientific discipline. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. With a wide variety of eventual specialisation, our Biomedical Sciences research degree is purposely designed to maximise your career options. Having a strong toolkit of research skills provides an excellent basis for entry into the biomedical or biotechnology industries in either a research capacity or clinical trials evaluation. The qualification allows students to work in roles of a medical scientific liaison capacity helping to interpret advanced research data for healthcare professionals. The University of Nottingham Malaysia has and will also continue to produce academics who work in institutions worldwide to train the next generation of biomedical scientists! This content was last updated on 15 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}