{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Media-Languages-and-Cultures/School-of-Media-Languages-and-Cultures.aspx",
    "content": [
        {
            "p": "The School of Media, Languages and Cultures engages with the most up-to-date, dynamic, and forward-looking studies of the workings of global, regional and local societies. Our community of researchers and teachers are of international standing and our degree programmes are renowned all over the world. The school received the top rating in the UK for teaching in an independent review of teaching quality, and we are internationally recognised for the standard of our research. The School of Media, Languages and Cultures consists of a diverse and international body of staff. Each staff member brings their own unique set of cultural and research specialisations and experiences to the delivery of a contemporary programme with wide-ranging significance to the modern environment. Our work explores communication in all its forms, and includes modules in Modern Languages, Cultural Studies, Media Studies (including Film, Television and Journalism), and Critical Theory. You will engage with the most up-to-date, dynamic, and forward-looking studies of the workings of global, regional and local societies. Joining our school means becoming a part of a vibrant community that fosters creativity, critical thinking, and global perspectives. Here's what you can expect: Interactive workshops: Engage in hands-on workshops where you can apply theoretical knowledge to practical scenarios. Guest lectures: Learn from industry professionals and renowned scholars who frequently visit our campus to share their expertise. Study tours: Participate in study tours to media houses, film studios, and cultural sites to gain a first-hand experience of the industry. Graduates from the School of Media, Languages, and Cultures are equipped with skills that are highly valued in various sectors. Some potential career paths include: Media Analyst Journalist Film and Television Producer Cultural Consultant Language Specialist Public Relations Officer Translator/Interpreter Digital Marketing Specialist Publishing Editor Media Researcher Language Teacher Event Coordinator Linguistics Consultant Yes, we have collaborations with several media houses and cultural organisations where students can undertake internships or placements. We have partnerships with several international universities, allowing students to participate in exchange programmes and gain a global perspective. Assessment methods vary by course but typically include a combination of coursework, presentations, exams, and project work. Yes, we have various student-led clubs and societies that focus on media production, languages, and cultural activities. Joining these groups is a great way to enhance your university experience. Yes, the University of Nottingham Malaysia provides on-campus accommodation options specifically designed for postgraduate students, ensuring a conducive environment for study. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}