{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/postgraduate-research/registered-period-of-study.aspx",
    "content": [
        {
            "p": "Periods of registration (also referred to as registered period of study) for postgraduate research degrees are set out in the University of Nottingham Qualifications Framework (UNQF) and may vary depending on the degree you are on. You can find the different processes and policies that may apply during this stage of your journey. For a PhD you would normally be registered for 3 years (full-time) or 6 years (part-time). Regulations set out the minimum and maximum period for your degree. This may vary depending on the terms and conditions in your individual studentship. You are expected to be undertaking your research in this period, with full access to research facilities and submit your thesis by the end of that time. The information on this page will signpost you to different processes and policies that may apply during this stage of your researcher's journey. You must complete the university’s formal registration process upon joining the university (admissions to the university), and re-register for every academic year. For more on registration see regulations section and our registration website. Only a registered researcher may follow a programme of study leading to a university award, and actively perform research, with full access to relevant services and facilities. Quality manual registration regulations As a registered researcher you should receive appropriate training to enable you to undertake and present research effectively and efficiently. The quality manual outlines what information should be provided to you, and what your responsibilities are. Please see the quality manual induction and training webpage for more information. Quality manual induction and training guidance You must attend all activities necessary for the pursuit of your studies, undertake all associated assessments and attend meetings and other activities as required by your school. You are expected to participate in planning and progressing your studies, you must familiarise yourself with university, faculty, and school requirements and procedures for research study. You must follow safety codes and participate in any mandatory training. See the regulations governing attendance and engagement - UNUK for more information relating to engagement. It is equally important you ensure you are aware of your responsibilities as a researcher, See the Responsibilities of the student for further guidance. Please also note the university sets out the management of non-engagement, this can also be found in the quality manual. Quality manual engagement regulations It is expected that during periods where you should be engaging with your programme, the prime focus should be on your studies. You should not arrange any employment or other activity that will cause you to be unable to attend and engage with required activities. When considering any employment opportunities, you should always consult your supervisor. Full-time researchers may only undertake part-time employment with the permission of their school and in accordance with the requirements of any scholarship they hold. Note: there are additional restrictions for international researchers. Please visit the Quality Manual for guidance on employment during studies. Quality Manual student employment regulations A PhD is a considerable time commitment and, at Nottingham, it typically takes three to four years to complete one full-time, or up to six years part-time. As a PhD is a programme of study, rather than a contract of employment, we do not offer fractional contracts (eg 0.8 full time equivalent). PGRs can however agree a flexible work pattern with their supervisor and may wish to seek advice or support from Student Wellbeing in agreeing their personal study arrangements. If adjustments are needed for submission dates, extenuating circumstance claims or extension requests should be submitted. A person who has been a member of staff (usually with a significant research element to their role) for no less than four years may be eligible to gain a research degree via the ‘staff by publication’ route. Under these circumstances we would expect the member of staff to have already generated a significant amount of independent research work prior to making an application. The support offered from the university at this stage is largely to bring elements of the research (usually pre-existing published research papers, articles or book chapters) together into a final thesis format ready for examination. As a consequence, they do not follow the standard progression monitoring process. This route is therefore not suitable for those who have a significant amount of research left to undertake, or who require full supervision in order to develop their skills as an independent researcher. Staff members wishing to complete a research degree, but who require fuller supervision, may register on a standard research degree programme (usually 3 years full-time or 6 years part-time) if they meet the necessary criteria. However, It is not possible to be registered for a full-time PhD whilst holding a full-time contract of employment (please note, certain exceptions may apply for specific NHS schemes). For clarity, any researchers registered on a standard research degree programme (usually 3 years full-time or 6 years part-time) can potentially submit a thesis where the research is presented as a series of publications. For standard programmes the ‘by publication’ element refers purely to the final thesis format rather than the way in which the degree is structured. Researchers should speak to their supervisors in the first instance if they are considering producing a thesis in a publication format, as disciplinary differences may apply that they will need to be aware of. Postgraduate researchers may have taught modules that form part of their degree or are beneficial in supporting their degree. You should discuss enrolment on any taught modules with your supervisor. If you intend to enrol on a module outside of the standard online module enrolment periods, please complete the below form: Module enrolment form for postgraduate researchers Observing modules: If you would like to attend the teaching for a module that is not part of your PhD programme, you may wish to attend as an observer, rather than formally enrolling on the module. Observing a module means that you will not be assessed and therefore will not form part of your academic record. To observe a module, please seek permission to attend the lectures and have access to their materials from the module convenor. You do not need to complete the form. Supervisors are responsible for providing appropriate and regular supervision until submission of your thesis and during subsequent period of corrections/resubmission (if relevant) until such a point that examiners have reached a final decision on the award of the degree, and for being accessible at mutually convenient times to listen and offer advice. You will be allocated a supervisory team containing at least two co-supervisors with: More on supervisors allocation and responsibilities are detailed in the Quality Manual. You will normally be involved in discussions about supervision allocation and arrangements. If for any reason the change to supervisory team is required, a form is available for use by your school to notify changes to the supervision arrangements. Both you and your supervisors will have the opportunity to request a change. Supervisors must provide their part-time candidates with a minimum of 6 recorded supervisions a year and their full-time candidates with a minimum of 12 monthly, recorded supervisions a year. although it is expected that in many cases the actual number of meetings may exceed these minima. You are required, jointly with your supervisor, to ensure the maintenance of a supervision record for auditing purposes, and in order to monitor your progress. Supervisors will advise you on the exact local practises. Supervision arrangements form Quality Manual supervision regulations All researchers registered on research degrees lasting more than one year full-time or two years part-time are subject to progression review. The basic principles of the progression review are common to all researchers and all years of their programme, visit the Quality Manual to read more on specific requirements. Each school may have a different form or system to record your progression review. You are expected to take responsibility and familiarise yourself with your school requirements and all relevant procedures and remain up to date with any changes (ie Covid-19 response) whilst participating in planning and progressing through your studies. There are number of possible outcomes from your progression review, that may vary depending on your degree and year of your studies, including: Progression review form (sample) Quality Manual progression review requirements During your final progression review, the school may recommend that your registration be exceptionally extended for up to 1 further year. In such case submission will still be expected within the 4 year maximum period (for full time researcher). You and your school will need to complete the request to register for an additional period of study, available from here. Please note, tuition fees will be payable for that period. Request to register for an additional period of study form You may wish to transfer your studies. This might be an outcome of your progression review to transfer to another degree (eg, from MPhil to PhD), or you may choose to transfer a mode of study (eg, from full-time to part-time), or it might be a result of changing your project. In all of those instances, you need to complete a transfer form, Please note that transfer of programme may result in a change to the tuition fee due. Normally transfers to part-time study cannot be approved in the last 6 months of registered study, except under exceptional circumstances. If you are changing project you may need to withdraw and re-apply. In any case, please speak to your supervisor regarding the transfer in the first instance. Transfer form You may, for a variety of reasons, want to interrupt/pause your studies. This is referred to as a voluntary interruption of study and is one of the ways the university can support you through personal difficulties, such as injury, illness, unavoidable family commitments, bereavement, and can also be used in other time-limited circumstances. A form is available for you to request a voluntary interruption of study from your School. See the Voluntary interruption of study guidance in the quality manual. To ensure that registration on the programme of study is not protracted over a lengthy period of time, the university will normally approve interruptions up to the total of 12 months. Any further interruption will only be approved in exceptional circumstances. During the period of interruption, you will not normally receive any statutory researcher support from the Government, (for example, researcher loans) or any university bursary or scholarship (such as Core Bursary). However, depending on your circumstances, and individual terms and conditions of your funding agreement, paid leave might be available to you, ie. compassionate leave. Normally, you will need to ensure that you have prior permission in writing to interrupt your study but we appreciate this may not always be possible if urgent circumstances arise. We ask that you keep your supervisory team informed and discuss any breaks in study with them. You can also access support from our Wellbeing Service. Researchers should be advised to contact the Financial Support team within Student Services for advice on the financial implications of interrupting their studies. UKRI funded researchers should contact BR-RA-DTP-funding@nottingham.ac.uk for further information. Voluntary interruption of study form Quality Manual University guidance Subject to eligibility criteria, if you receive Research Council or University of Nottingham funded maintenance stipend, you can receive up to 13 weeks of paid sick leave at your normal stipend value. Please read the policy on sick leave for more details and ensure you follow the procedure for reporting sickness. If the period of illness exceeds 4 weeks, you will be required to formally interrupt your studies. Quality Manual sickness leave policy The university recognises the importance of taking holiday for the health and wellbeing of researchers engaged in postgraduate research. This should be taken in line with school expectations (eg not taking leave during postgraduate training courses, school research events, seminars etc) You must also ensure that your leave does not adversely impact any contractual obligations (for example Research Council terms and conditions), and by arrangement with supervisors. As a guide, postgraduate researchers may normally take up to 25 days holiday in each year plus public and university holidays. Your research may in appropriate cases take place away from University of Nottingham site. This may be another higher education institution or a research laboratory within a non-academic organisation, or another location linked to your research work. If you are studying for more than 4 weeks away from a UON site (either UK or overseas) you must inform Student Services about the arrangements for this, by completing the study away notification form. Completion of the study away notification form is not required for researchers who are part of a partnership agreement, exchange or mobility scheme, or any other formalised external study visit the quality manual for more details on this policy. Study away from the University form Quality Manual external study regulations To find out more about scholarships, funding opportunities and other financial support and guidance on how to pay your outstanding charges please visit our Student Fees and Payments section of the website. You should contact the Funding and Financial Support team to discuss the funding implications of your changing circumstances, like interruptions, transfers, withdrawals, etc. If you wish to withdraw from the university, please complete the form below and return it to your faculty PGR team. You should discuss your withdrawal with your supervisor. It is your responsibility to ensure that your sponsor/funder is informed. Student Services will inform you of an outcome of your request in writing. Depending on your programme of study, after the period of registered study you may be able to enter a thesis pending period which may also be referred to as additional writing up period. For more information on thesis pending period, please visit the thesis pending webpage. You must give formal notice to your school of your intention to submit the thesis to ensure that the procedure for appointing examiners can be initiated. Visit the thesis submission webpage for further details on the submission procedure. You are required to submit a thesis for examination before the conclusion of the thesis-pending period. You must give formal notice of at least 3 months to your school of your intention to submit. The school should ensure that Student Services office is informed so that the procedure for appointing examiners can be initiated. Any delay in submitting your notification of submission form can lead to a delay in your examination taking place. Visit the examination research students webpage for more information on the examination process. Your supervisor’s signature on the notification of submission of thesis form acts as confirmation that: Upon receipt of your completed form, Student Services will ask your school to nominate examiners. When approved, we will email you with the names of your examiners, asking you to declare any possible conflict of interest. Notification of submission form"
        }
    ],
    "pdf_files": []
}