{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/country-info/countryinformation/brazil.aspx",
    "content": [
        {
            "p": "Unlock your potential at a world-leading university with a truly international student community. We offer foundation courses for students who are not qualified for direct undergraduate entry. We offer foundation courses for international students who are not qualified for direct entry to our undergraduate degree courses. These courses are available at the University of Nottingham International College, just next to University Park Campus, in partnership with Kaplan International Colleges. Find out more about the courses, entry requirements and progression options on Kaplan's website: Applications and enquiries for these courses are handled by Kaplan and the college. International foundation courses Full-time courses across our five faculties typically last for three to four years, although some degrees such as medicine and architecture have a longer duration. Our Undergraduate Prospectus lists entry requirements for A levels and International Baccalaureate students for each course. Brazilian students must complete a foundation course for entry to our undergraduate programmes. As well as our own foundation courses, we accept foundation certificates from selected providers in the UK. If you have taken a year in a recognised university, we can typically accept grades ranging from 7.0 and 8.0 but requirements may vary depending on the course. This summary is provided as guidance and requirements may vary for individual courses, which often require high grades in relevant subjects. Students taking APs or SATs should refer to our entry requirements for the USA. We offer a wide range of postgraduate masters degree programmes across our five faculties. Full-time masters courses typically last for one year. Applicants should hold a bachelors degree of a good standard from a recognised university, usually in a relevant subject area. Check our postgraduate course pages to see whether your chosen course requires the equivalent of an Upper Second Class (2:1) or Lower Second Class (2:2) degree. Our entry requirements for degrees from Brazilian universities vary depending on the university where you have studied and the course you are applying for at Nottingham. The summary below is provided as guidance but requirements may vary for individual courses and we do require higher grades from some universities. Entry requirement Upper Second Class (2:1) Lower Second Class (2:2) High standing institutions 7.5 7 All other universities 8 Our PhD courses, available across a wide range of subject areas, typically include three years of full time research followed by an optional writing-up period of one year to complete your thesis. Applicants should hold a masters degree of a good standard from a recognised university in a relevant subject area. See the masters section for guidance on the grades we typically require from Brazilian universities. These will vary depending on the university where you have studied and the course you are applying for at Nottingham. You should identify possible supervisors at Nottingham before applying and prepare a research proposal to submit with your application. Americas Undergraduate Excellence Award Americas Postgraduate Excellence Award British Council Scholarships for Women in STEM Chevening Scholarships International Sporting Excellence Award Sports scholarship packages Find out more about tuition fees Graphic adapted from FreeVectorMaps.com Find out more about student life International Relations Manager (Americas) Contact Will Our official representatives in Brazil can assist you with applying for our courses, visa processes and preparing to study with us. We regularly travel to Brazil to meet with prospective students and their families, visit schools and to attend education fairs and other events each year. Meet us in Brazil You are also very welcome to visit our campuses in Nottingham for an open day or an independent visit. Visit us in Nottingham Meet us over Skype Contact us by email or telephone Connect with us on social media International Student Life blog Brazilian and Portuguese Students Society Capoeira Society Brazilian and Portuguese Soc on Facebook"
        }
    ],
    "pdf_files": []
}