{
    "url": "http://www.nottingham.ac.uk/studywithus/international-applicants/visa-help/visas/limitations-on-tier-4-immigration-sponsorship.aspx",
    "content": [
        {
            "p": "The University of Nottingham is a recognised immigration sponsor under the Points Based System: Student route (formerly known as Tier 4). As such, the University is required to comply with the UK Visa and Immigration requirements as outlined in the Student sponsor guidance. Failure to comply with these requirements could result in the University's Sponsorship Licence being suspended and/or revoked. The Student sponsor guidance outlines the responsibilities/duties of an immigration sponsor in terms of issuing CASs to prospective students (including current students requiring a visa extension). We must only assign a CAS to a student who we believe will: While the University is obliged to follow the requirements outlined in UKVI sponsor guidance when acting as an immigration sponsor, the institution is under no legal obligation to issue CASs to individual students and we reserve the right to withhold a CAS and/or withdraw immigration sponsorship where this is justified in light of University and/or UKVI policy or where deemed necessary based upon the facts of an individual case. Where immigration sponsorship is withdrawn this may result in a student record being suspended/interrupted or even closed where it is not possible to continue on a course in the absence of immigration sponsorship. In order to meet the requirements of the Student route visa category students must: Academic Ability Academic/English language qualifications are checked against University requirements. Information on admission policies and requirements can be found in the Quality Manual. Academic Progress Academic progress must be shown for international students undertaking further studies in the UK. All proposed studies must be completed within permitted UKVI time limits.* Applicants and higher level studies – Academic progress is usually demonstrated by moving up a level on the RQF/CEFR scale (e.g. Foundation to UG degree, UG degree to PGT degree). The Home Office requires full qualifications to be successfully completed (or highly likely to be completed). This means that the full qualification must be completed rather than parts of the qualification. Further investigation of individual cases will be required if progress is not being demonstrated in this way to establish if a CAS can be issued. Applicants and same level studies (successfully completed) - Applicants seeking to undertake a subsequent course at the same RQF/CEFR level as their previous course which they successfully completed must provide a strong and valid academic justification for repeating studies at the same level. Cases will be considered by the Head of Direct or UCAS/UTT Admissions in liaison with the University's Visas and Immigration Senior Manager where necessary and will only be accepted for the purpose of issuing a CAS if it is clear that the new course is related to the previous course, (e.g. connected to the previous course, part of the same subject group or involves deeper specialisation) or the student's previous and new course combined, support the student's genuine career aspirations. Applicants and same level studies (failed) Where applicants have taken a previous course at the same level on the RQF scale as the new course for which they are applying, but they failed all or part of the first course or were downgraded to receive a lower qualification than that which was aimed for (e.g. starting an MSc/MA and leaving with a PG certificate or diploma) a CAS should not be issued. Applicants and same level studies (incomplete but successful to date) Where applicants have withdrawn having successfully completed more than 33% of their original course a CAS should not be issued. Where applicants have withdrawn having successfully completed 33% or less of their original course a CAS should not normally be issued unless there is evidence (retained as part of the Admissions file) that the applicant is outside the UK and a strong and compelling case can be made to justify issuing a CAS in these circumstances. Any CAS issued must note that the visa application will be made overseas. Cases will be considered by the Head of Direct or UCAS/UTT Admissions in liaison with the University's Visas and Immigration Senior Manager where necessary. Failure to disclose previous studies on an application may lead to any CAS which has been assigned being withdrawn. Applicants and lower level studies – Where applicants are going backwards in terms of academic progression according to the RQF/CEFR scales a CAS must not be issued. Current students and resits/repeats - Current students undertaking re-sit examinations or repeating certain elements of their studies in attendance can be regarded as making progress and may be eligible for a CAS if their attendance is academically necessary, they had good attendance on the course to date, they have EC evidence and they can complete the course within UKVI time limits for studying in the UK. Where one or more of these requirements is not met a CAS will not be issued. Students with a status of 'resit in attendance' will be required to attend all failed modules where the modules are running. The length of time permitted for a re-sit in attendance/repeat of studies should not exceed the period originally allowed by the University for that element of the studies (e.g. 12 months for writing up a PhD thesis). These time limits are based upon an expectation of sufficient academic progress being made during time spent in the UK. Students will only be granted one resit with attendance/repeat of studies period under immigration sponsorship (e.g. 12 months for an extension to the thesis pending period ideally approved in 6 month blocks). Where students are unable to study on a full time basis for health reasons but remain in the UK on a student visa, this time will count towards the University's maximum permitted time for immigration sponsorship. However, if students leave the UK, the time spent overseas will not count towards the University's maximum permitted time for immigration sponsorship. If extra time is approved by an academic school, the University will only act as an immigration sponsor for the student to remain in the UK for the length of time originally allowed for that element of the studies and this will be counted backwards from the new expected completion date. For PhD students undertaking an additional period of registered study or thesis pending, we will not be able to act as an immigration sponsor beyond 24 months unless and until the student submits their thesis and needs to be in the UK to attend the viva. Where corrections are required we will act as an immigration sponsor for the student to remain in the UK to complete the corrections up to a maximum period of 12 months. If a student requests an extension to their post-viva correction period, the repeat period of study should not exceed that which was originally permitted for that element of the PhD. We will not act as an immigration sponsor beyond this. Any time spent overseas will not be discounted from the 12 month period and we will not extend immigration sponsorship for extensions to resubmission. Current students moving to the UK campus from UNNC or UNMC - Where a student's course is terminated at the overseas campus either on academic, disciplinary or immigration grounds, we will not act as an immigration sponsor for study at the UK campus. Voluntary Course Transfers: Current students and course transfer requests (successful completion to date/higher level studies) - Transfers on to courses at a higher level on the RQF/CEFR scale can be approved (subject to ATAS requirements/sponsor approval, UKVI time limits and consideration of the link between the previous course successfully completed in the UK and the new course as appropriate). If the new course cannot be completed within the duration of the existing visa a CAS can be issued and the student will, in most cases, need to make a new visa application at time the transfer is implemented. Advice will be given by the Visa and Immigration team on the required timing of the application and whether the new visa application can be made in the UK or if it must be made overseas, according to the Immigration Rules. Current students and course transfer requests (successful completion to date/same level studies with progression) - Transfers on to the next stage of a same level course on the RQF/CEFR scale can be approved (subject to ATAS requirements/sponsor approval, UKVI time limits and consideration of the link between the previous course successfully completed in the UK and the new course as appropriate). Where the change relates to the course title only (within the same academic school) and does not impact on dates/duration/course level or ATAS, the transfer can be approved without any need for a new visa application to be made. If the new course cannot be completed within the duration of the existing visa, a CAS can be issued and the student will, in most cases, need to make a new visa application at time the transfer is implemented. Advice will be given by the Visa and Immigration team on the required timing of the application and whether the new visa application can be made in the UK or if it must be made overseas, according to the Immigration Rules. Current students and course transfer requests (successful completion to date/same level studies - backward transfers/transfers onto a previous or earlier stage of a same level course on the RQF/CEFR scale) – Where students request to transfer having successfully completed or attempted more than 33% of their original course the transfer should not be approved. Where students request to transfer on to an earlier stage of a same level course having successfully completed 33% or less of their original course the transfer can be approved (subject to ATAS requirements/sponsor approval, UKVI time limits and consideration of the link between the previous course successfully completed in the UK and the new course as appropriate). If the new course cannot be completed within the duration of the existing visa a CAS can be issued but the student will need to apply for a new visa from overseas. Current students and course transfer requests (successful completion to date/lower level studies) – Transfers on to a course that is at lower level on the RQF/CEFR scale (e.g., MEng to BEng/PhD to MPhil) can be approved, however, unless the transfer is to the lower level of an integrated course and can be completed on the existing visa, a new visa application from overseas at the time the transfer is implemented will be required. Advice will be given by the Visa and Immigration team at the time of any transfer request. Current students and course transfer requests (failed or downgraded (including ordinary degree)/backward transfers) – Where students request to transfer having failed all or part of the first course or having been downgraded to a lower qualification/ordinary degree the transfer should not be approved. Involuntary Course Transfers: Current students and course transfer recommendations - Course transfers following exam board recommendations may involve students downgrading from one qualification to another that is lower on the RQF/CEFR scale (e.g. MEng to BEng/ PhD to MPhil). These requests will be automatically processed but may have immigration implications and students are advised to contact the Visa and Immigration team for advice. The student may need to make a new visa application from overseas at the time the transfer is implemented regardless of whether the course can be completed within the existing visa, and should seek guidance from the Visa and Immigration team. *UKVI has strict restrictions on the length of time that international students can spend at undergraduate level in the UK on a student visa and the progression requirements need to be read in light of these time restrictions: 2 years on a student visa for studies below degree level (excluding time spent on a child student visa). 5 years on a student visa for studies at UG level (with exceptions for certain longer courses) Where a student will be unable to finish a new course within these time limits a CAS should not be issued. Time limits are calculated based upon the length of the visa issued not the length of the course itself. Funding Applicants - Tuition fee deposits apply to self-funded PGT applicants to demonstrate willingness and ability to pay. Deposits are compulsory for these groups and can only be waived where the applicant receives full funding for tuition fees from a recognised sponsor (as confirmed by the Fees and Charges team) or where the applicant will receive US loans (as confirmed by the Federal Aid Manager). Additional checks of financial evidence are not routinely made. However, where an applicant receives a visa refusal on financial grounds the University will not issue a second CAS unless the applicant can confirm that appropriate funding and evidence of that funding is in place. Refusals must be managed by an Immigration Advisor and financial evidence must be checked by the Adviser before a new CAS is issued. Current students - Checks of financial evidence are made for current students to ensure that sufficient funding is in place before a CAS can be issued. This includes low risk nationals but excludes those who have existing immigration permission for 12 months prior to their visa application where they are applying in the UK. Where students have an outstanding debt to the University or an approved third party accommodation provider a CAS will not be issued. Where current students have previously been suspended for unpaid tuition fees the University reserves the right to ask for either part of all of any future fee liability before a CAS is issued. Credibility The intention of applicants is assessed by reference to their studies to date (whether within or outside the UK and including any incomplete courses) and, where available, the personal statement/research statement on their application form and any references provided. It is also assessed by the use of tuition fee deposits for foundation and postgraduate taught masters applicants. Where an applicant or students receives a visa refusal on credibility grounds, we would require the decision to be challenged via the Administrative Review route. We would not normally issue a second CAS following a refusal on credibility grounds. For applicants moving from other institutions, their immigration history (including previous refusals) will be considered as part of an assessment of their credibility when determining if a CAS can be issued. Location of study - partnerships and collaborative arrangements UG and PGT level - Where there is a clear, defined period of study which sits outside of the standard visitor immigration rules, the University can act as the immigration sponsor under the Student route for the duration of the study in the UK. PGR – Where the first period study will be based in the UK and where the student is spending frequent and substantial periods of time in the UK throughout their registered period for study purposes, we will act as the immigration sponsor under the Student route for the duration of the PhD. Where the first 6 months or more of the PhD/research is based outside the UK, Student route immigration sponsorship will not be appropriate and a CAS should not be issued at the outset. A CAS may be issued when the student commences their UK study period at a later stage. Where applicants and current students extending their visa do not meet the academic ability, academic progress, funding and credibility or location of study requirements outlined above the University will not assign a CAS and act as an immigration sponsor. If a CAS has already been assigned when it becomes clear that an applicant or student does not, in the opinion of the University, meet the requirements, the University will withdraw the CAS or notify the Home Office that immigration sponsorship is being withdrawn if the CAS has been used to make a visa application. In order to comply with the conditions of their permission to stay in the UK, students must observe and follow the Immigration Rules. Where students are unable to meet the requirements of the rules the University should not issue a CAS unless and until the situation has been remedied and, where appropriate, the student has returned home to make an application overseas. Examples of situations which would fall under this heading and where a CAS should not be assigned include: Situation Notes Where students have overstayed on their previous visa without having submitted an in-time application to the UKVI Where a student has overstayed on their previous visa for more than 30 days the University would not act as an immigration sponsor under the Student route for the student in the future. Please notify the Visas and Immigration Team as soon as possible if a student falls within this category. An assessment will be carried out of the circumstances, but, as students will lose their right to study in the UK where they have overstayed, the University will need to suspend/interrupt the student and update their record accordingly until the immigration situation can be regularised. We will usually support students who make in time applications which are returned/refused where they can resubmit a valid visa application via the Visa and Immigration Team within 14 days from the date of the refusal notice and where they can make a premium application to minimise the length of overstay. Where students have remained in the UK in breach of immigration regulations, the University would not act as an immigration sponsor under the Student route for the student in the future. Where a student is suspended or re-sitting without attendance and will be inactive for a period of more than 60 term-time days. Where students have January and May re-sits without attendance one CAS will not be issued to cover both exam periods. Students will be required to return home after the January exams and re-enter the UK for the May exams either on a standard visitor visa or on a Student visa (if progression or completion is possible) Where a student is waiting for an academic offence hearing or an academic appeal but has no academic attendance requirements This is not an exhaustive list and there may be other scenarios where students are unable to comply with the conditions of their visa/meet the requirements of the Immigration Rules. There are situations where it will not be possible to issue a CAS for practical reasons such as those outlined below: Insufficient time for a visa application to be processed and for the student to join/re-join the course before the official latest/final date for registration Where the visa application is likely to be refused either because it is outside of the Immigration Rules (e.g. switching from a visitor visa within the UK, or an over-stayer who returns home but will receive a ban if they apply for a UK visa within 12 months) or because the evidence to be included by the applicant is unsatisfactory and would result in a refusal We are unable to assign a second/subsequent CAS for the same course where a visa refusal has been issued and the problem/issue has not been resolved We are unable to assign a CAS if the original visa covers the original period of studies (excluding the additional period for graduation) where the request is received within the final four weeks of the course We are unable to assign a CAS if a student extends the period of their studies and the new completion date falls before, on or within two weeks of the end date of their current visa. We are unable to assign a CAS where a student has acted in breach of University and/or immigration regulations which then raises concerns over whether they will comply with the conditions of their permission to stay in the UK This is not an exhaustive list and there may be other scenarios where it will not be practical to issue a CAS. In certain circumstances (outlined below) immigration sponsorship will be withdrawn by the University either by withdrawing an assigned CAS or by reporting to the UKVI against a used CAS. If the University becomes aware that an applicant/student is unable to make a successful visa application after a CAS has been issued If an applicant/student fails to disclose key information relating to their application to study at the University or their immigration status in the UK which comes to light after a CAS has been issued. This includes instances where documents provided by the student are found to be inaccurate, incomplete or false. If an applicant/student acts in breach of the Immigration Rules and/or the conditions of their permission to stay in the UK, or if there is reason to suspect that this might be the case. This includes non-attendance, non-engagement and ongoing poor attendance as well as failure to make expected academic progress in line with an agreed action plan following an initial period of poor attendance. If a student is suspended as a result of unpaid tuition fees If there is an academic appeal which goes beyond 3 months or, where still under consideration, prevents the student from registering in the next academic year by the deadline for registration If a student suspends their studies voluntarily for a period of more than 60 days. Where multiple suspensions are taken over a 6 month period these will be considered cumulatively. If a student suspends their studies voluntarily within the first 4 months of commencing the programme for any duration or reason. If a student withdraws from their studies or the course is terminated If there are any other relevant circumstances, such as the student moving into a different immigration route, or the course being completed sooner than expected. This is not an exhaustive list and there may be other scenarios when the University will withdraw immigration sponsorship. It is important to note that although Extenuating Circumstances may be accepted from an academic point of view to justify an additional or repeat period of study this does not guarantee that immigration sponsorship will be extended to cover this. Each case will be considered on its merits and in light of the nature of the ECS. Where leave is curtailed as a result of The University of Nottingham withdrawing immigration sponsorship on the grounds of a breach of the Immigration Rules/conditions of permission to stay in the UK, the University will not automatically re-instate immigration sponsorship (by issuing a new CAS) if/when a student is ready to return to their studies. Consideration will be given to the nature of the breach, the reason for it and the action taken by the student to remedy the situation, when determining if a new CAS can be issued. The University will report successful completion of the student's course to the Home Office where the student meets the immigration requirements of the Graduate Visa route. This includes, but is not limited to: The University will not be able to support applications, by way of a report to the Home Office, where any of the following apply: The University will not be able to support 'bridging' visa applications under the Student route where students intend to apply for the Graduate Immigration Route, but have outstanding reassessment/repeat periods of study which are external or 'not in attendance'. The limitations on immigration sponsorship for reassessments/repeat periods of study are set out above. --------------------------------------------------------- The original version of this document was approved by the University's Panel lawyer and University Executive Board in May 2012 (v1). Subsequent modifications must be approved by the Registrar. Version 16/Feb 2024"
        }
    ],
    "pdf_files": []
}