{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Engineering/Electrical-Systems-and-Applied-Mathematics/research.aspx",
    "content": [
        {
            "p": "A wide range of research is carried out in the Electrical Systems and Applied Mathematics Research Division, covering various areas including electrics, communications, machines and applied mathematics. One of our main focuses is to invent and apply state of the art technologies, intelligence,computational and mathematical algorithms to various domains to improve current systems and processes for the benefit of mankind. The domains we are currently pursuing are in the areas of renewable energy and automotive systems. We have in depth technical expertise and conduct research in the areas of audio-visual systems, wireless communications, optical communications, antennas, power electronics, machines and embedded systems. Innovative research: Engage in groundbreaking research that pushes the boundaries of electrical systems and mathematical applications. Collaborative environment: Work alongside experts from various disciplines, fostering an interdisciplinary approach to problem-solving. State-of-the-art facilities: Benefit from advanced labs and research centres, equipped with the latest tools and technologies. Industry relevance: Our research is aligned with industry needs, ensuring that you're working on projects with real-world applications. Global network: Collaborate with researchers from our UK and China campuses, as well as other leading institutions worldwide. Our main research groups in the division are: Research expertise within the Applied Electromagnetics and Communications Research Group includes equalisation and algorithm design and analysis, detection algorithm design and analysis, and matlab based simulations. The Applied Mathematics Research Group applies mathematical techniques to solve problems in various domains such as mathematics, physics and engineering. Members of our group are actively involved in research in quantum information, quantum field theory, probability and statistics, fractional calculus and asymptotic analysis. The common thread in the research activities of the Intelligent Systems Research Group is the use of intelligent systems for pattern recognition and machine learning in order to predict an outcome and/or decide on a suitable course of action in engineering and industrial processes. The inference engine used is the Support Vector Machine, a linear classifier with good generalisation capability. Graduates from the Electrical Systems and Applied Mathematics division are equipped to take on roles in various sectors, given the interdisciplinary nature of their studies. Potential career paths include: Electrical Systems Engineer Applied Mathematician Data Scientist Systems Control Engineer Research Scientist Quantitative Analyst Systems Designer Network Engineer Electromagnetic Engineer Machine Learning Engineer Telecommunications Engineer Energy Management Specialist Yes, students are encouraged to work alongside faculty on ongoing research projects, gaining hands-on experience and insights. Yes. UNM has established collaborations with various industries, providing students with opportunities for internships and practical research. The division provides mentorship and guidance on research publication, helping students present their work in reputable journals and conferences. Our curriculum is regularly updated to include the latest technological trends. Topics like AI (Artificial Intelligence) and IoT (Internet of Things) are integrated into courses and research projects. Faculty members often provide guidance based on current industry needs, emerging trends, and student interests to help choose a relevant and impactful research topic. Through a mix of foundational knowledge, hands-on projects, industry collaborations, and exposure to the latest trends, UNM ensureS students are adaptable and ready for the dynamic tech landscape. Yes, UNM offers scholarships and financial assistance to deserving students. Students are encouraged to discuss these opportunities with their supervisors. Electronics, Communications and Intelligent Mathematical Techniques Division Jalan Broga, Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}