{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/art/explore-our-archaeology-labs.html",
    "content": [
        {
            "p": "As an archaeology student, you might be particularly excited about our practical facilities. Well, we don’t just have one laboratory. We have five! If you’ve ever been curious about what happens in an archaeology lab, wonder no more. We reveal all about the facilities on offer... You will develop advanced skills in: You’ll also learn how professional archaeologists use archaeological finds to investigate issues such as ancient trade, migration, subsistence and social status. Third-year students can take advantage of our long-term partnership with our neighbours at the British Geological Survey, and learn advanced techniques including the analysis of isotopes to study past mobility and diet. Students examining ore This lab is used for practical classes and seminars. We use the space for handling, analysing and the in-depth study of a range of materials - including animal bones, ceramics, seed and charcoal collections, and lithics (stone artefacts). Staff and students discussing animal bone anatomy in the teaching lab This is where you will learn about ancient technologies, from the earliest stone tools to the development of ceramics, metal and glass material cultures around the world. You will also learn about dyes, pigments and perfumes and how these were created in the past. You will learn through experimentation, replication and analysis – there are opportunities to knap flint, fuse glass, fire pottery and create your own perfumes, depending on the modules you choose. Alongside our kit for analysing ancient materials, we also have a suite of equipment that you'll be able to use for analysing soils, sediments and peats to interpret ancient environments. As you’ve probably guessed, this is where you can examine the skeletons and bones in our collection. You can analyse both human and non-human remains together, which helps build greater understanding of the bones themselves as well as the activities, health and behaviour of people and animals. Human and non-human animals are often separated in modern western archaeological analysis. However, people lived closely with their animals and were sometimes buried alongside them. We believe that studying both together can be a powerful way of understanding past societies. Undergraduate student examining animal bones in the bones laboratory This lab allows us to prepare samples for isotope analysis, which tell us about the diets and migration patterns of past people and animals. So that might be answering a question like, “Did this person’s diet include fish?”. In particular, we use this analysis to connect ancient and modern data to explore how and why human-animal-environment relationships have changed, and with what consequences for the future. Using a near infrared spectrometer in the isotopes lab We are committed to preserving and presenting heritage using digital technologies. As such, we have recently refurbished our imaging lab to improve our 3D photogrammetry, geophysics and CAD model building capabilities. Using the latest equipment and software, we can create digital illustrations, 3D models and visualisations of archaeological artefacts and sites. In addition to our dedicated labs, we also have a collections room, containing artefacts used in research, practical sessions and other teaching throughout our modules. Okay, it’s not a lab, but we thought it’s worth sharing... The Museum is home to a collection of local archaeological artefacts from Nottinghamshire, Derbyshire, Lincolnshire and Leicestershire. These collections offer a glimpse into everyday life over a wide period of time. Students use them in dedicated handling sessions, offering another way for you to get up-close and personal with our artefacts. Faculty of Arts Third-year student Emily shares a typical day... Emily discusses how using the labs brought her modules to life, handling material remains, and discovering an interest in archaeobotany... \"Give archaeology a go and don’t be put off if you don’t know anything. It’s kind of like seeing how history was made!\" How to get your hands dirty... If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}