{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/art/a-day-in-the-life-of-a-film-and-television-studies-student.html",
    "content": [
        {
            "p": "Second-year student Max shares a typical day... Max An early start takes us to the Sir Clive Granger Building for ‘Interrogating Practice’. This module introduces the concept of writing critically about film, and how our emotional connection to films can affect how we approach criticism. In the previous week, we held a screening of the 1948 film, Letter from an Unknown Woman, during which we made notes on techniques used to portray certain emotions, which we then discussed in the workshop. One thing I love about this course is the variation of screenings we are provided with, oftentimes being introduced to films I have never heard of before or would never have chosen to watch myself. Sitting down as a collective to analyse a film offers a unique viewing experience which you will struggle to replicate elsewhere. The remainder of the workshop allowed us to gather into groups for a research project, culminating in a presentation later in the semester. The opening slide of the 'Interrogating Practice Workshop' with Dr Nuno Jorge After the workshop, my group walk to Hallward Library, grabbing a bite to eat and a drink from the coffee shop - the falafel sandwich and a peach ice tea being particular favourites of mine! We then head downstairs to find a quiet corner to discuss our research project, the films we want to discuss, and the concepts we want to focus on, as well as getting a head-start on some reading for the week ahead. I find myself in Hallward multiple times throughout the week as it’s a brilliant space for both independent and group work. Settling down in Hallward Library Over in the Trent Building, this particular module discusses how history can be mediated by media products and artwork, crossing over with other arts and media students and giving us a broader range of discussion. Whilst not being directly related to film or television, this seminar gives me an opportunity to discuss how certain historical figures have been portrayed in film, and how this may have affected our memory of them. University isn’t all study and libraries, and luckily for Film and TV students, Nottingham hosts a number of brilliant cinemas to choose from. I often try to visit The Arc in Beeston at least once a week, making the most of the venue being only a 15-minute walk from my accommodation! This particular trip was to see Puss in Boots: The Last Wish; a film that had no right being as brilliant as it was! I find myself sometimes viewing films through a critical lens after studying them, analysing each frame for meaning and significance. Whilst this certainly didn’t change during this film, it’s always refreshing to see something a little less serious and in need of a critical dissection. Ending the day, I head back to the Trent Building to flex my creative muscles at the Creative Writing Society. This week's focus being romance, following Valentine’s Day. After a series of cursed and heart-warming writing prompts, we walk over to the Portland Building to visit Mooch, and wind down after what has been a busy day. With a balance of academia married with a wealth of leisure options, us Film and Television Studies students at UoN have all the tools to create a varied and exciting university experience. The Creative Writing Society Faculty of Arts Sarah tells us about her time shadowing the stage production manager for Florence + The Machine."
        }
    ],
    "pdf_files": []
}