{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/scholarships-and-bursaries-ug/scholarships/local-scholarships.html",
    "content": [
        {
            "p": "For students who live and/or attended school in Nottinghamshire, Derbyshire or the wider East Midlands area Local Scholarships are funded by generous private donations to encourage and develop the potential of students from the local area. These scholarships focus on those with a lower income background and/or those who have overcome significant difficulties to come to University. After you graduate, you won't have to repay the funding you receive from a Local Scholarship. Local Scholarships are largely competitive with a limited number of awards available. We recommend you read through all the options available before submitting your application. Applications are used to assess who most closely meets the eligibility criteria based on the information we're given. Students who apply for any of the 2024 Local Scholarships must meet the following general criteria plus the specific criteria of their chosen scholarship: Additional eligibility criteria for each Local Scholarship can be found below. For students from Nottinghamshire and Derbyshire For students from the East Midlands Applications for the 2024 entry Potential Scholarships open on 23 September 2024. Applications will be looked at once the closing date has passed and all applicants will be informed of the outcome of their application by email to their university email account within four weeks of the closing date. Guidance notes are available with additional information for each scholarship and tips on what information to include when you apply. Scholarships and bursaries To encourage potential in students from lower-income backgrounds or who have faced significant difficulties For UK students with personal circumstances or backgrounds that may have impacted academic potential For students with a household income between £0-£35,000 as assessed by student finance For students from lower-income backgrounds who are interested in entrepreneurship *A 'home' student is one who meets certain UK residence criteria. These are the same criteria as apply to eligibility for home funding from Student Finance. **Otherwise eligible part-time students who are unable to study full-time because of a disability should contact the Funding and Financial Support team to discuss their funding options. Note: All references to household income refer to the figure which is calculated by Student Finance when a student applies to them for means-tested funding. Please refer to our Data Protection and Confidentiality Statement - for anyone who makes an application for funding from the Funding & Financial Support Team. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}