{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/international-students-hub/travelling-in-the-uk-international-students.html",
    "content": [
        {
            "p": "This guide will take you around the UK and make a few suggestions to get your wanderlust fired up in each of the four nations. One of the best things about choosing to study in the UK and at the University of Nottingham, is the easy access to four nations with their own distinct culture and each with stunning natural scenery, lively cities and pristine coastlines. The United Kingdom of Great Britain and Northern Ireland (the UK) includes Scotland, England, Wales and Northern Ireland. In each country, you're never far from the coast or countryside, with so much to see and do. If you plan on travelling in the UK during your time here, you’ll need to know the best ways to get around and the best spots to visit in each country. We’ve got it covered! We’ll take you around the UK and make a few suggestions to get your wanderlust fired up in each of the four nations. We’ll kick things off in jolly old England - the home of our university. There are endless attractions, including world heritage sites, stunning coastlines, castles and cities steeped in ancient history, ready for you to explore! London (Source – Visit London) We couldn’t possibly cover everything so we’ve shortlisted some of the most popular places for you to add to your travel plans. If you only make one trip to a city in England, make it London. The iconic capital has something for everyone: To explore what else is on offer in this famous city, plan your trip with Visit London. After the busy crowds and lights in London, the peace and tranquillity of one of England’s most picturesque landscapes is just what you need. Located in Cumbria in the North-West, the Lake District is less than 3 hours from London by train and well worth the journey. The Lake District is England’s largest national park and a World Heritage site, home to our highest mountain, Scafell Pike. Expect quintessential English towns and villages, rolling mountains and 12 of the country's largest lakes, ready for exploring. Resources for planning your trip: Lake District National Park Visit Lake District Next, we head ‘Up North,’ to a part of England steeped in rich history. Northumberland has more castles than any other county, including Alnwick Castle - better known as Hogwarts School of Witchcraft and Wizardry. Visit the shores where Viking invaders landed, including Bamburgh – home of Uhtred of Bebbanburg from the hit Netflix series, ‘The Last Kingdom.’ Northumberland has so many unforgettable sights. We've chosen a few of our favourites to help you plan your trip: To explore everything Northumberland has to offer, check out Visit Northumberland. Croeso i Cymru! - Welcome to Wales! Eager to explore beautiful landscapes, castles, countryside and gardens, or relax in cosmopolitan Cardiff and soak in the famously easy-going and friendly Welsh culture? Wales is definitely worth the trip. It is easily accessible from anywhere in the UK, including Nottingham, by train, car or a quick flight. Here are some of our top picks to help you start your Welsh adventure. First stop, the capital, featuring beautiful architecture and a lively social scene packed with attractions, events and activities for all tastes. Some of the city's top attractions include: Visit Cardiff will help you plan your perfect trip. This is one for the adventurers! Snowdonia National Park consists of 14 majestic mountain peaks, including 3,546-foot-high Snowdon, accessible by train. (Good news for the non-hikers among us!) Snowdonia attracts over 4 million visitors a year and once you've experienced the outstanding natural beauty of the area, it's easy to see why. If you aren’t into climbing mountains, there are still plenty of things to do in Snowdonia, including guided Safaris, stargazing trips, kayaking, cycling and ziplining. Discover Snowdonia National Park. We know what you are thinking – how on earth do I pronounce that?! Aberystwyth = [AB] + [UH] + [RIST] + [WITH] The beautiful Welsh language is tricky for the rest of the UK to pronounce, so you're not alone! This historic university town on the west coast is a popular holiday destination for young people and students. (The 50+ pubs may have something to do with this!) The town features Victorian architecture set against a beautiful beachfront complete with a promenade to soak in the sunshine and the views. Aberystwyth (Source: Study International ) There is nowhere quite like Scotland, with its proud tradition and heritage, breathtaking landscapes and alluring legends. From spending the day in the historical city of Edinburgh, with a spot of lunch and shopping, to hunting the legendary Loch Ness monster, Scotland has it all. Our top picks for Scotland will have you packing your bags and booking your travel! From markets and museums to castles and monuments, there's so much to see and do in this vibrant city. Edinburgh is never short of festivals or a great night out, with endless great places to eat, drink and socialise. Key attractions include: Forever Edinburgh is a great resource to help you plan an unforgettable trip. Urquhart Castle on Loch Ness (Source: Planet Ware ) Loch Ness is home to the world-famous monster that has captured the imaginations of visitors from all over the globe. Many have made their way to this magical part of Scotland to catch a glimpse of Nessie – some say they have! The Loch is part of a waterway connecting the eastern and western coasts of the country. Loch Ness and three other lochs are joined by the Caledonian Canal. You can cruise the canal by boat, taking in the wonders of Scottish highland scenery. Get a glimpse of what to expect in Scotland on the Visit Scotland Youtube channel. Last but certainly not least is Northern Ireland. From wild rugged coastlines to green rural landscapes and buzzing cityscapes, you won’t forget this small country in the north of Ireland in a hurry. Known for their friendly hospitality, you can be sure of a warm welcome. Northern Ireland is easily accessible, with most airports flying into Belfast International or Belfast City airports. This iconic and dynamic capital city and the home of the Titanic is full of life and culture. Explore the historic cobblestoned streets of the Cathedral Quarter for a pint of Guinness, buff up on Irish history at the Ulster museum or grab a coffee and take a leisurely stroll through the Botanic Gardens. On your Belfast visit, make sure you check out these top attractions. The Cathedral Quarter, Belfast (Source: The Belfast Telegraph) From Belfast city centre, you can hop on a train and be in the seaside towns of Portrush and Portstewart in around 1hr 30mins. Stroll along beautiful beaches, take in stunning scenery, grab an ice cream, eat in one of the fantastic restaurants, or sample fish and chips alfresco. No trip to Northern Ireland is complete without a visit to the Giant’s Causeway. The causeway is a unique rock formation formed nearly 60 million years ago and people from all over the world come to marvel at the views from the causeway found on the beautiful Northern Irish coast. Legend has it that the causeway was built by Irish giant Fionn McCool, but you’ll have to book the National Trust tour for the rest of the story! Travelling in the UK is relatively easy once you know the best ways to get around. You can plan day trips to different towns and cities and return the same day if you want to keep costs low, and there are several different ways to travel. Travelling by train throughout the mainland (England, Scotland and Wales) is probably the most popular way to travel. For shorter journeys, train tickets are generally inexpensive. Planning longer train journeys in advance will keep the cost reasonable. The UK has beautiful stretches of countryside, so you can enjoy the views as you travel from city to city. Train journeys are also a reliable and speedy way to travel as most towns and cities across each country have train stations. Nottingham has services via train throughout England, Scotland and Wales. For example: Nottingham > London (England): 2 hours 7 minutes Nottingham > Edinburgh (Scotland): 5 hours 30 minutes Nottingham > Cardiff (Wales): 3 hours 18 minutes As a student, if you are aged between 16-25 or over 25 but in full-time study, you can also apply for a Railcard from National Rail. It costs £30 per year and gives you 1/3 off rail travel in England, Scotland and Wales. Well worth it if you plan on exploring! To plan your train journeys, you can use National Rail or Translink. For more insight into travelling to the UK by train, watch the video below by Visit Britain, showcasing the beautiful places across the country connected by train. Exploring the UK by bus is the most cost-effective choice and is great for shorter journeys. If you're travelling further afield, the journey tends to be a lot longer in comparison to the train, but a fraction of the price. For example, the journey from Nottingham to Cardiff by train is around 3 hours, while a cost-friendly service like Megabus takes over 5 hours, but it only costs £14. You can also plan and book bus journeys throughout the UK with National Express. The UK is well connected by domestic flights to more than 20 commercial airports. This can be a quicker and cheaper choice than a long train journey, especially if you book well in advance. It is also the easiest way to reach Northern Ireland. International Students Discover all the relevant information related to studying in the UK. Once you have an unconditional offer from a university, or you have met the requirements they have given you, apply for the relevant visa. Most students coming to study full-time in the UK need a student visa. You will also need to complete the form and make the payment for the healthcare surcharge. Coming to the UK as an international student is a fun adventure with lots of chances to learn and grow. Enjoy the British culture, get involved with the university community, and ask for help when you need it. UON Everything international students need to know about how to register for NHS healthcare while studying in the UK. Everything you need to know about travelling to Nottingham once you have reached the UK - a guide for international students. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}