{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/disability-support-services/support-for-specific-disabilities/mobility-impairments.aspx",
    "content": [
        {
            "p": "Whether you are a full-time electric wheelchair user or need to limit the amount you walk, we can explore your requirements, provide information and advice and create a Support Plan for your needs. Accommodation – Together with our Accommodation Service, we can explore your needs and options and explain what fees (and discounts) might apply to your situation. Transport, parking and getting about – We can help you know what to expect and explore your options, so you can decide what would work. For example, you might want to understand the parking availability, want a referral to our accessible minibus service for disabled students or want to ask questions about campus accessibility and public/University transport. Student life – So that you can make the most of student life, we can also put you in touch with other services such as our specialist Sports Disability Officer and the Students’ Union. Adjustments to assessments – we will discuss your needs and can put in place alternative arrangements for exams and other assessments, such as access to a computer, rest breaks or a nearby accessible toilet. Teaching and learning access – We can also discuss what other needs you might have to ensure you are able to fully access your teaching and learning. For example, you might need practical help in laboratories, to use our book pick and save service through our library team or a note taker in lectures. Services and networks – We can ensure you are linked to relevant networks such as the Disability Liaison Officer and Support and Wellbeing networks for your academic school. Funding – Most students are eligible for DSA (Disabled Students’ Allowance) and we can advise you on the application process and what to expect. Depending on what you need, DSA may fund, for example, specialist equipment and assistive software to help you access your teaching and learning and work effectively. In some instances, DSA can also provide support in areas such as travel, where you might incur additional costs as a result of your disability. Personal carers – If you have any need for assistance with daily living tasks such as showering, getting dressed, meal preparation, shopping etc. you will be responsible for making your own arrangements for these and ensuring you have secured sufficient funding to cover the costs. If you are a fee-paying student based at home, please contact your local Social Services Department to request a community assessment to discuss a suitable care package. If you are an international student, please contact local UK based personal care agencies before coming to the University so you can discuss your personal requirements and related costs. Please make these arrangements well before you join us so that everything runs smoothly, and you have the right support and funds in place. If you have any questions please contact us by emailing Disability Support Services."
        }
    ],
    "pdf_files": []
}