{
    "url": "https://www.nottingham.ac.uk/studywithus/why-study/study-abroad.aspx",
    "content": [
        {
            "p": "Do you aspire to be a global graduate? Do you want to enhance your employability while travelling the world? Do you dream of having an international career? If yes, then studying or working abroad during your degree can help you on your way. Study abroad gives students an opportunity to apply to study or work in another country during their degree The duration of your study abroad experience could range from one week to one year. This will depend on the programme you apply for, and the course you are studying. “My decision to study abroad was without a doubt one of the best decisions I have ever made, and I am confident the skills, experiences and friendships I obtained in Malaysia will last a lifetime.” Emily, BSc International Management, University of Nottingham Malaysia Discover your inner confidence as you settle into a new culture, make friends, step outside your comfort zone, connect and collaborate, and showcase your resilience. Studying abroad can help you: *2019 International Education Report: Gone International Mobility Works. Report on the 2017-18 graduating cohort. Universities UK International. Programme Duration About Who can apply? International Summer schools 1 week – 6 weeks All students from any undergraduate course Inter-campus exchange 1 year or 1 semester*, or as part of a summer school programme Students studying for a degree which is also offered at our international campuses University-wide 1 year or 1 semester* Students studying an eligible degree School exchange Destinations vary but can include Canada, USA, Latin America, Europe and much more *Dependent on your chosen degree Discover what our students have to say about their exciting study abroad experiences. “You will never regret going, but you could regret not going. A year abroad is not just about studying in another university; travelling and settling in another country, it is an education in its own right.” Chloe Gibbons. LLB Law with South East Asian Law. National University of Singapore. The University of Nottingham was the first UK university to open a branch campus overseas with the opening of our Malaysia Campus in 2000, followed by our China Campus in Ningbo in 2004. We are proud to offer students diverse opportunities with our portfolio of"
        }
    ],
    "pdf_files": []
}