{
    "url": "https://www.nottingham.ac.uk/student-living/community-engagement/recycling.aspx",
    "content": [
        {
            "p": "It’s really important to #RecycleRight and ensure that as many household waste items as possible are re-used or recycled properly. Failing to put the right items in the right bins can result in bins becoming contaminated and being diverted from recycling plants to end up in landfills or incinerators. Repeatedly mismanaging your recycling and contaminating your bin may result in it being removed and potentially a fine from your local council. Make sure you know how to recycle right. Understand the recycling scheme for where you live now. This could be very different to how recycling is managed at your ‘home’ address and in on campus halls. It’s not just what you recycle but how you recycle. Items need to be clean, dry and (in most areas) loose. Know your bin days and remember to put bins out on time. A missed bin might force you to put perfectly recyclable materials into your general waste bin. Clothes, shoes, books, furniture, video games, cooking equipment, crockery and pretty much anything else* can be recycled at the British Heart Foundation (BHF) donation banks located in key areas across Nottingham and also on campus. Find your nearest BHF donation point. *Bedding and sharps cannot be donated to BHF but they can be taken to the Swap Shop at Thomas Helwys Church (Church Street, NG7 1SJ) where Trent Compassion will wash and redistribute them to refugees If you want to know more about recycling on and off campus then take a look at the university's #WasteNott campaign . Students moving off campus and into the community for the first time are often faced with having to learn a new recycling system which is different to their family home area. This can occasionally lead to confusion within a shared student house and sometimes lead to the wrong thing being put in the wrong bin. When this happens it is regarded as ‘recycle bin contamination’ and causes problems for that household, the environment and the wider community. A contaminated bin gets all contents diverted away from the recycling centre and instead goes to be processed as general surplus waste. A completely refreshed and emboldened campaign to reduce recycle bin contamination has been launched for this year. Building on the university’s strong campus sustainability imagery, a new recycling hero helps educate students to not bin the top contaminated items, plastic bags and greasy takeaway containers, along with a QR code to the City Council website for more information. Student Ambassadors made over 1,700 individual house visits across Lenton, Dunkirk and Radford to engage with residents on the importance of recycling and how to avoid costly contamination. As part of the campaign, Ambassadors were tasked to place an A4-sized vinyl information sticker on nearly 2,000 separate recycling wheelie bins that will help as a quick and useful visual reminder. Ambassadors were also kept busy with litter-picking duties on roads that needed a tidy-up. The campaign included an audit of all waste facilities and over 200 waste facility issues have been reported to the City Council Housing Licence and Compliance team for potential follow-up action by the landlord or managing agent. Helping residents recycle more effectively is an important step in ensuring Nottingham City Council achieve its ambitious Carbon Neutral city status by 2028."
        }
    ],
    "pdf_files": []
}