{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Modern-Languages-with-Translation-BA-Hons-U6UMODLTY.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK Do you have a passion for translation? Are you looking for a career in translation or interpreting? This course offers you the opportunity to study one or two languages to degree level and gain practical experience in translation and interpreting. Study one language from post A level and opt to add another either as post A level or beginner. This course has a strong vocational focus and provides insights into practical and technical translation and interpreting. We model our translation assignments on real-life situations and you will complete at least one translation project for an external organisation. The exciting experience of the year abroad develops your communication skills, builds your confidence and helps you stand out to future employers. You can teach English in a school or study at one of our partner universities. However, we encourage you to work for a translation company to further develop your practical translation skills. Mandatory Year 1 Introduction to Translating and Interpreting Studies Exploring Language and Linguistics Language Meaning, Variation and Change Optional Spanish 1 Spanish 1: Beginners French 1 French 1: Beginners German 1 German 1: Beginners Russian 1 Russian 1: Beginners Serbian / Croatian 1: Beginners The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 3 October 2024. Due to timetabling availability, there may be restrictions on some module combinations. As well as scheduled teaching you’ll carry out extensive self-study such as preparation for seminars and assessments, as well as language practice. As a guide 20 credits (a typical module) is approximately 200 hours of work (combined teaching and self-study). An average week will have between 12 to 15 hours of classes. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. I find so many aspects of translation interesting, particularly when it comes to literature and marketing. Language is such a powerful and persuasive tool and the prospect of converting these meanings to be shared in other languages is very inspiring. There’s also the more practical purposes of translation and interpretation, which, simply put, can be used to help people. I think that the right to defend oneself is very basic, and language differences shouldn’t be such a barrier. Jesney Swift Modern Languages with Translation BA (Spanish and Russian) 90% of students say teaching staff have supported their learning well. Data for Modern Languages with Translation (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Arts Entry requirements BCC UCAS code Y14F Duration 4 years full-time Start date Sep 2025 Entry requirements ABB - including B in one of Mandarin Chinese, French, German, Russian or Spanish UCAS code R900 Modern Languages BA Entry requirements ABB UCAS code T900 Duration 4 years full-time (year 3 abroad) UCAS code R906 If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}