{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/fees-payments/how-and-when-to-pay-student-fees.aspx",
    "content": [
        {
            "p": "The preferred payment method is via NottinghamHub. For alternative payment methods please visit the Paying Student Fees page NottinghamHub Fees and Payments What you pay depends on what type of student you are (UG/PGT/PGR) and whether your Fee Status is Home or International. You can find the fee for your course in our fee regulations. Tuition fee charges will be displayed on your NottinghamHub account after you complete registration in each academic year. The instalment dates below do not apply to sponsored students. Payments must be made by the due date listed below however you can also pay earlier if you wish. Due Date Amount due Home Undergraduate & PGCE 16 October 2024 22 January 2025 7 May 2025 25% 50% All other students 34% 33% Amount Due Home students 14 April 2025 11 August 2025 3 November 2025 International students UPP Broadgate Park 12 September 2024 £250 reserve £250 deposit £250 fee 1st Instalment * See below As per: Contract (Less fee) Due date 15 January 2025 2nd Instalment 3 May 2025 * If you are reliant on a Student Finance Maintenance Loan to pay your 2024/25 accommodation fees, please ensure a minimum payment of £250.00 (plus £250.00 damage deposit for students staying at Broadgate Park) is received by 12 September 2024, with the balance of your 1st instalment to be paid by 7 October 2024. We are not able to arrange alternative payment plans or take payments for Students who will be staying at Bonington Student Village, Riverside Point, Raleigh Park, Hydrogen, Nottingham Two, Radford Mill, St Peters Court, Study Inn, University of Derby (Healthcare Students) and University of Lincoln (Healthcare students). If you are staying at any of these halls, you will need to contact the accommodation provider directly. We offer the following alternative payment plans for 2024/25 accommodation fees. 12 September 2024 - Reservation fee of £250.00 (all students) PLUS Damage deposit £250.00 (Broadgate Park students ONLY) The balance of all accommodation fees to be split equally into 3 instalments due 7 October 2024, 15 January 2025, 3 May 2025 12 September 2024 - Reservation fee of £250.00 (all students) PLUS Damage deposit £250.00 (Broadgate Park students ONLY) The balance of all accommodation fees to be split into 9 x monthly instalments (Undergraduate) or 11 x Monthly instalments (Postgraduate) to be paid on the 1st of each month October 2024 – June (Undergraduate) / August (Postgraduate) 2025 Please email sas@nottingham.ac.uk once your 2024/25 accommodation fees are showing on your NottinghamHub portal, stating your Student ID number, full name and alternative payment plan required."
        }
    ],
    "pdf_files": []
}