{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/applying/How-to-write-a-personal-statement.html?title=UmVjZW50bHkgdmlld2Vk&variant=cmVjZW50",
    "content": [
        {
            "p": "Finding the right words to include in your personal statement can be tricky, but we're here to guide you through it. You know we’re a good match, now all you’ve got to do is tell us why. Your personal statement is an opportunity to tell us everything about you and how special you are but finding the right words can be tricky. If you’re tired of sitting in front of a blank page for hours on end, searching for the best way to describe yourself, you’ve come to the right place. Here are our top tips for writing a personal statement. A personal statement forms part of your application to study at university. It’s your chance to articulate why you’d like to study a particular course or subject, and what skills and experience you possess that demonstrate your passion for your chosen field. Your personal statement can be up to 4,000 characters (including spaces) or 47 lines of 95 characters (including spaces); whichever is shorter. You! No one knows you better than you know yourself. You need to tell us why you’re the perfect candidate for the course and what makes you stand out from the crowd. A helpful way of ensuring you strike the right balance is by splitting your statement into sections: However, getting these details down isn't always easy, and some people find it helpful to make notes over time. Carrying a notebook with you or setting up a memo on your phone can be useful. Whenever you think of something useful for your personal statement, jot it down. Just like you, your personal statement should be unique, so there’s no specific format to follow when it comes to putting pen to paper. That said, we have compiled some general guidelines for you to follow: We recommend you write your personal statement first, then copy and paste it into your online application once you're happy with it. Make sure you save it regularly, as it times out after 35 minutes of inactivity. Life is full of opportunities and studying at the University of Nottingham could be your biggest yet! If you’re looking for more application guidance, head over to our 'Applying' hub. Campus and facilities Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities. Nottingham and Nottinghamshire The city has many highlights if you consider studying at the University of Nottingham. Applying We consider applicants solely on the basis of their merits, abilities and potential – regardless of gender, ethnic or national origin, age (subject to the university regulations on minimum age), disability, religion, sexual orientation or any other irrelevant distinction. Student experience We are Nottingham. Locally rooted, yet globally connected, we are the heart of the UK. One destination with endless possibilities. One beating heart with a desire to drive change If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}