{
    "url": "https://www.nottingham.edu.my/Study/How-to-apply/university-policy-and-minimum-age-requirement.aspx",
    "content": [
        {
            "p": "1. This requirement may be waived on an individual basis, provided that your parents or legal guardians have given their written agreement in advanced to additional safeguards and requirements. These include acknowledging that the University will not act in \"loco parentis\" by completing the compulsory under 18 consent form. 2. If you are at least 16 years old at the time of registration, on receipt of the signed Under 18 consent form, the Head of Admissions will act on behalf of Quality and Standards Committee to waive the minimum age requirement. 3. If you are not yet 16 years old, upon receipt of the Under 18 consent form, the Head of Admissions will liaise with relevant schools and department for further consideration. You will be notified via email, once a decision has been taken. 4. For international applicants who are 15 years of age, you will need to provide details of a guardian based in Malaysia. This guardian should (if possible), live in or near Kuala Lumpur or Semenyih, should be an adult who the University can contact in case of an emergency and can act in Loco Parentis. 5. The University is unable to waive the minimum age requirement for applicants below 15 years of age. 6. For international applicants, it is important to note that the acceptance to the University is not a guarantee that you will be able to obtain a visa to study in Malaysia. You will still need to meet the visa or other immigration conditions imposed by EMGS and Immigration Malaysia. 1. Upon receiving the signed 'Under 18 Consent Form', the Head of Admissions will act on behalf of Quality and Standards Committee to waive the minimum age requirement. Once a decision has been taken, an offer will be sent to the successful applicants. 2. One month before registration, the Admissions office will create a list of unconditional firm under 18 offer holders and circulate to relevant Head of Schools and the Accommodation office. 3. The Accommodation office will inform wardens of the under 18 students who will be joining their hall of residence. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}