{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Pharmacy/School-of-Pharmacy.aspx",
    "content": [
        {
            "p": "Established in 1925, the School of Pharmacy is at the forefront of academic development and progress. Our teaching staff are at the leading edge of scientific and healthcare developments and we have a long and distinguished research history. At The University of Nottingham Malaysia Campus we offer the following undergraduate degree programmes within pharmacy. Pharmacists are experts in medicines, their development and clinical usage. Pharmacy is a professional role requiring in-depth knowledge across a range of biological, chemical and professional disciplines. It requires a range of skills and knowledge and these are delivered through the themes of biology and physiology, clinical and pharmacy practice, chemistry, pharmaceutics, professionalism and leadership and pharmacology and therapeutics. Pharmaceutical scientists are central to the discovery and development of new drug entities, the design of novel drug delivery systems and therapeutics. You will experience an integrated range of teaching and learning styles – from lectures and tutorials to practical classes, workshops and case studies. Our programmes develop a range of transferable skills and you will be taught to work to the highest professional and ethical standards. You will be allocated a personal tutor to help with personal and academic issues. The school also has a Learning Community Forum that provides an opportunity for you to discuss programme related issues with academic staff. All students are strongly encouraged to take advantage of one of the many vacation work experience placements that the school secures each year. The four-year MPharm degree is accredited by the General Pharmaceutical Council (UK) and was the first 2+2 Pharmacy programme to be recognised by the Pharmacy Board of Malaysia. Code of conduct/ fitness to practise As with all fully accredited UK MPharm programmes, students are required to abide by a code of conduct and are subject to fitness to practise regulations. Appropriate health and good character checks will be required when you join us as a student. You will be provided with further information when you are made an offer. The four-year BPharm degree is provisionally accredited by the Pharmacy Board of Malaysia, with full accreditation achievable in 2026 when the first batch of BPharm students enter their final year. Our MPharm programme is your passport to a pharmacy career in many countries around the world. Graduates of the 2+2 MPharm can be found working as community and hospital pharmacists in the UK and Malaysia. The industrial sector allows pharmacists to work in clinical trials, drug discovery and development, marketing, product registration and quality assurance. Numerous pharmacists are employed in the regulation of medicines. MPharm graduates may also pursue careers in academia or as medical journalists or scientific writers. Our BPharm programme prepares you for a rewarding pharmacy career in Malaysia. As BPharm graduates, you can expect to secure employment as community and hospital pharmacists, as well as in the pharmaceutical industry. You can also pursue careers in clinical trials, drug discovery and development, marketing, product registration, quality assurance, and medicine regulation. Furthermore, BPharm graduates have the option to pursue careers in academia, work as medical journalists or scientific writers, and continue their studies. Our BSc Pharmaceutical and Health Sciences programme puts you in an ideal position to pursue a career in Malaysia’s burgeoning pharmaceutical industry. Graduates can embark upon a range of careers including: pharmaceutical, chemical or cosmetic industries; medical sales and marketing; research managers in the biotechnology sector; academics in higher education institutions; scientific writing; and other appointments which require a general science background. In Malaysia, individuals need a minimum of a Bachelor of Pharmacy (BPharm) degree to become a registered pharmacist. Pharmacy course requirements differ across universities. However, at UNM, the Pharmacy MPharm (Hons) programme requires A Levels students to have a minimum of ABB in biology, chemistry and physics/mathematics. Pharmacy BPharm (Hons) entrance requirements for A Levels students is a minimum of BBB in these three subjects. There are also English language requirements that students must meet. At UNM, the duration for a degree in pharmacy is four years full time. The Pharmaceutical and Health Science Bsc (Hons) is three years. Pharmacy courses in Malaysian universities typically cover pharmacology, medicinal chemistry, pharmacy practice, pharmacotherapy, and pharmaceutics. Pharmacists in Malaysia can work in various settings, such as hospitals, community pharmacies, pharmaceutical companies, or persue a career in academia. UNM offers a range of support services for students, such as career advisory services, counselling services and learning support. Students also have access to study resources to help them achieve academic success. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}