{
    "url": "https://www.nottingham.ac.uk/studywithus/why-study/employability.aspx",
    "content": [
        {
            "p": "Join the UK's top university for graduates entering highly skilled jobs* At the University of Nottingham, your success once you graduate is just as important to us as your time on campus. It’s why we’re committed to empowering you to achieve your dreams – no matter what they look like. More University of Nottingham graduates enter highly skilled employment than any other UK university. In fact, we’ve been top for the past 4 years.* We’ll equip you with not just the subject knowledge, but also the skills, experience and connections you need to make your mark on the world. *HESA Graduate Outcomes, classification of full-time, UK graduates entering work in the UK from 2018/19 to 21/22, published 2024. For decades, leading businesses have been coming to us to find their newest recruits. We are the third most targeted UK university by the country's top companies - and we’ve been in the Top 10 since 2013 (The Graduate Market report 2024, High Fliers Research). With connections to countless global and UK organisations, it’s no wonder our graduates are highly sought after by some of the world's biggest companies including: JP Morgan, ASOS, Unilever, PepsiCo, Walt Disney Company, GSK and Deloitte. From internships and placements to recruitment fairs and access to top graduate jobs, we'll help you make the most of our networks. We’re proud to rank in the top 2 Russell Group universities for work experience (Rate my Placement, Best Universities for Work Experience 2024). Whatever course you choose, we’ll support you to gain valuable industry insights and connections – from work experience and work-based learning to employer-sponsored projects and competitions. We work closely with alumni and industry experts to make sure what we teach today is relevant to employers tomorrow – giving you the skills and experience you need to stand out. Develop your skills in the workplace and gain practical, hands-on industry experience to ensure you’re career-ready. Our expert team is here to support you with lifetime access to our careers service. We can help you gain valuable industry experience through an optional placement year. No matter what you’re studying, you can build one into your degree. Develop new skills and gain experience that will make you stand out from the crowd with our free scheme designed to prepare you for the job market. Our postgraduate students and early career researchers get access to the Researcher Academy – with dedicated facilities, training courses and placements. We’ll help you find work opportunities around the world, as well as advise on visa options if you want to work or start a business in the UK after graduation. You’ll be in good company as a UoN graduate. Find out how to harness the power of our 340,000-strong alumni network."
        }
    ],
    "pdf_files": []
}