{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Postgraduate-courses.aspx",
    "content": [
        {
            "p": "At the University of Nottingham Malaysia, have your pick of postgraduate programmes that meet the demands of cutting-edge industries as well as provide an outlet for endless curiosity. From engineering to biotechnology, finance to psychology, international relations to business management – you would be hard-pressed to find a more diverse and refined array of offerings. With a distinctively global outlook, our postgraduate programmes are designed to provide you with advanced knowledge that is highly valued by employers not only in Malaysia, but across the world. You will have access to faculty members with many years of experience in industry as well as state-of-the-art academic facilities equipped with the latest technology and resources. Located a mere 45 minutes from the Kuala Lumpur city centre, take a virtual tour of our lush 48-hectare campus. Take a tour Application guidelines, intake deadlines and student requirements at your fingertips. Discover a choice of secure and comfortable accommodation on and off campus Discover how our research transforms lives and shapes the future. Discover more about our world class teaching facilities and resources. Guidelines for international students, from entry requirements to visa applications, Get up-to-date on our latest Open Days, masterclasses and campus events. Get in touch with our friendly counsellors to find out more about UNM. Find a course Get in touch Get a full listing of tuition fees for all postgraduate programmes. Accredited degrees offer students, parents and potential employers an assurance Take the next step in your academic journey with our prestigious postgraduate scholarships. The comprehensive guide to our foundation, undergraduate and postgraduate programmes which include fees, modules and more. A concise guide for international students featuring UNM's top programmes, facilities, and fees. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}