{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Media-Languages-and-Cultures/Media-Languages-and-Cultures-MPhilMResPhD.aspx",
    "content": [
        {
            "p": "UNM/JPT-R/310/7/0013(7/26)MQA/SWA0182 UNM/JPT-R/310/7/0015(7/26)A7510 UNM/JPT-R/310/8/0014(7/28)MQA/SWA0181 The School of Media, Languages and Cultures offers research degrees that are interdisciplinary that broadly covers the fields of media, communications and culture. Under this umbrella are options focusing on media democracy, media reform, Southeast Asian cinema, youth and new media, internet governance, civil society, creative industries, digital media, and film. Other areas of expertise include music, food culture and identity, migration, cross-cultural and intercultural issues, and multiculturalism and sociology In a globalized world where constantly evolving technology becomes the basis and medium of socio-cultural and political communication, the school’s research degrees tap into a much-needed understanding of our common urban modern world, providing a critical understanding of the inner workings and meanings of objects, media and everyday cultural artefacts that we take for granted. PhD in Media, Languages and Cultures offers training in various types of research methodologies in the social sciences to obtain data. Through mentoring and supervisory guidance from our research-active faculty members, students acquire analytical and critical skills to help them analyse the collected data and learn to be independent researchers. Graduates will be equipped to be active researchers and educators in university, or in the relevant sectors. The School of Media, Languages and Cultures is a dynamic research community providing internationally recognised degrees in culture, media and communications. You will engage with the most up-to-date, dynamic and forward-thinking studies in the workings of global, regional and local societies. As convergence and digitalisation now form part of the much bigger multimedia industry, there is an increased need to make sense of the implications for society by conducting more research into the areas of communications and culture. Our research programmes provide you with an opportunity to explore contemporary culture, media and communication theories, policy and practice. Our community of researchers and teachers are of international standing, with each staff member bringing their own unique set of cultural and research specialisations. This mix of experiences delivers a contemporary programme with wide-ranging significance to the modern environment. If you are interested in applying to do an MPhil, MRes or PhD in the School of Media, Languages and Cultures we would recommend that you contact us and discuss your research project proposal with the relevant supervisor in the first instance. You can then visit our applications pages to find out how to apply. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A master’s degree (or international equivalent) plus, at least a second class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Or A first class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. MPhil and MRes At least a second class honours degree (or international equivalent) in a relevant discipline. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Our PhD graduates have gone on to work as academics in higher education and the civil service, research institutes and NGOs while the MRes is a path to further study or work in research institutes and the fields of film, media and communications. This content was last updated on 11 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}