{
    "url": "https://www.nottingham.ac.uk/studentservices/services/recognition-of-other-learning.aspx",
    "content": [
        {
            "p": "Credits are a standard way of measuring learning. ROL means you can start your course at the appropriate level through substituting individual modules or reducing the total amount of credits you need to study to gain a qualification. For example, you could use ROL to start in the second year of a Bachelors degree or put it towards the total credits you need to complete a Masters degree. Some degrees have specific arrangements with partners outside of the University of Nottingham, where students can be exempted from the initial stage of a programme and admitted with advanced standing. These arrangements are not covered here, more information can be found in the ‘Types of Collaboration’ section of the university quality manual's, partnership and placements. ROL can come from previous study, employment, voluntary work and training courses, including courses and qualifications you didn't complete but where credit was awarded. Recognition of other learning - Quality Manual PG Study - Already applied? - I have an offer There are 3 types of ROL you can put towards a qualification, you can put more than one of these types of ROL towards a qualification. Prior Learning is university- level learning and achievement that occurred at some time in the past (perhaps as the result of a previous course, self-directed study, or active experience), and recognition of this is when it is formally taken into account by the university when admitting a student to a course of study. The University of Nottingham will consider recognising credits from qualifications you've completed in the last 10 years. Examples of higher education qualifications include Foundation and Bachelor's degrees, HNC and HNDs, postgraduate certificates and diplomas, and Master's degrees. Modules from such qualifications are made up of higher education credits. Most standard qualifications are equal to a certain number of credits. For instance, at undergraduate level, an HNC is worth 120 credits and an HND is worth 240 credits. If you started but didn't complete a UK higher education course, or you have a higher education qualification or credits from a non-UK institution, you may be able to use prior certified learning (see below) instead of prior learning. Prior certificated learning is university-level learning that occurred at some time in the past; which did not result in a UK higher education qualification or credits and for which you were awarded some form of official recognition. This can include professional development and employment-based awards, qualifications awarded by a non-UK higher education institution, and uncompleted university courses where you were awarded credit. Whether you can use ROL depends on how well your previous knowledge, skills or experience matches the learning outcomes of modules on your course. This will be assessed by the School or Department that you’re applying to, on the basis of evidence that you will supply during the ROL application process. The way you apply for ROL depends on the type of ROL you want to put towards your qualification. Before you apply for ROL, you need to have applied for your course or already be registered on it. To transfer credits from a previous UK university-level qualification or to convert prior certified learning into credits towards your University of Nottingham qualification, complete this form. You will need to provide evidence of your previous qualification and upload this information to your ROL application. Guidance on what constitutes appropriate evidence is suggested in the form or you can ask your Course Director or Admissions tutor. Applying for a course in School of Education? – read more about Education ROL requirements and guidance Your school will aim to make a decision on your application for ROL as quickly as possible but as this sometimes takes an amount of investigation and academic consideration it can take some time. If your ROL application has been outstanding for longer than 4 weeks, please contact Admissions (if you are an applicant or offerholder) or your Course Director (if you are a registered student). PG Study - Already applied? - I have an offer There are specific rules relating to recognition of other learning (ROL). Depending what course you are taking, there are rules about how many credits of ROL you can have and at which stages. More details about these rules can be found in the Limitations on ROL section of the Quality Manual. ROL sits outside of our policy for immigration sponsorship, as confirmed in our limitations on immigration sponsorship policy. The policy is linked here: limitations on immigration sponsorship and endorsement Tuition fees are calculated on the basis of the number of credits studied and therefore ROL has an impact on tuition fees charged. More information can be found in the ‘Part-time and part-course students and non-award bearing study’ section (section 5.5) of the tuition fee regulations for the year that you are studying. It is recommended that you seek financial advice before proceeding in cases of individual credit reduction through ROL. More information can be found here: For PGT courses - Student Loans for Postgraduate Masters students from the Student Loans Company For PGR courses - Student Loans from the SLC* for Doctoral students Quality manual - recognition of other learning"
        }
    ],
    "pdf_files": []
}