{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Mechanical-Materials-and-Manufacturing-Engineering/Department-of-Mechanical,-Materials-and-Manufacturing-Engineering.aspx",
    "content": [
        {
            "p": "The MSc Mechanical Engineering programme offers you the opportunity to study advanced topics in mechanical engineering, covering engineering science, designand technology. From a broad base, it builds on our key research and academic strengths and concludes with an individual project in the summer term. You will develop the skills to solve problems using both logic and creative/innovative approaches, excellent numerate, computer and analytical skills, the ability to plan, prioritise and work to deadlines under pressure and the ability to communicate with others. The field of Mechanical, Materials, and Manufacturing Engineering is ever-evolving, with innovations shaping the future of industries. World-class faculty: Learn from a team of internationally recognised experts who bring a wealth of research and industry experience to the classroom. State-of-the-art facilities: Our advanced labs and workshops provide hands-on experience with the latest tools and technologies. Industry collaborations: Engage in real-world projects with leading engineering firms, gaining practical insights and building valuable networks. Holistic curriculum: Our courses blend theoretical knowledge with practical skills, ensuring you're industry-ready upon graduation. Global perspective: With links to our UK and China campuses, you'll gain a global understanding of engineering challenges and solutions. Graduates from the Department of Mechanical, Materials, and Manufacturing Engineering at UNM are highly sought after in various sectors. Potential career paths after completing your mechanical engineering masters, mechanical engineering MSc or PhD engineering include: Mechanical Engineer Materials Scientist Manufacturing Engineer Aerospace Engineer Robotics Engineer Product Development Engineer Energy Engineer Automotive Engineer Yes, we have collaborations with various engineering firms, providing students with internship opportunities to gain practical experience. Our faculty is actively involved in research and industry collaborations, ensuring that our curriculum is updated with the latest developments. Yes. At UNM, we encourage interdisciplinary projects and have collaborations with other departments within the university. The department provides mentorship, resources, and even funding opportunities for promising student projects and innovations. At UNM, our courses are designed to provide a balanced approach, with a mix of theoretical lectures, practical labs, workshops, and real-world projects to ensure comprehensive learning. Yes, with links to our UK and China campuses, students have opportunities for international exchanges, gaining a global perspective on engineering education. Students will work with various industry-standard software tools related to CAD (Computer-Aided Design), CAM (Computer-Aided Manufacturing), simulation, and more. Yes, various research grants and scholarships are available. Students are encouraged to discuss these opportunities with their supervisors. Yes. UNM believes in interdisciplinary learning and often has collaborative projects with departments like Electronics, Computer Science, and Business. Department of Mechanical, Materials and Manufacturing Engineering University of Nottingham Malaysia Jalan Broga, 43500 Semenyih, Selangor Darul Ehsan, Malaysia Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}