{
    "url": "https://www.nottingham.ac.uk/studentservices/support/financialsupport/managingyourmoney/food-on-a-student-budget.aspx",
    "content": [
        {
            "p": "Living on a student budget might mean navigating tight budgets. Food is an essential spend, but the amount you spend can vary based on your planning and choices. Understanding your budget and planning your spend around your income can help you to ensure you can afford nutritious food throughout the academic year. Think about your income streams including student loans, help from family or part-time work, and allocate some of this to a regular food spend. Be realistic about how much this will be – budgeting under the amount you spend will quickly add up after a few shopping trips. Keep an active track of your food spend for a few weeks to understand how much you are spending and what is realistic for your situation. Bring your own drinks to campus in a bottle or reusable cup. Look at sharing items (and the cost!) with housemates, such as salt, sugar, squash and spices. Meal kits and ready meals are often more expensive than buying ingredients and cooking yourself. Instead of a fajita meal kit, could you buy the wraps, spices, vegetables, and protein separately to make more batches of the meal for cheaper? Keep takeaways and meals out as an occasional treat and factor them into your budget. Plan your meals around your schedule. You may find it useful to batch cook some meals ahead of exam periods for easy access to nutritious meals or save some of your budget for takeaways or treats around this time. Create a meal plan and stick to it! Use a shopping list based on your meal plan. Try the downshifting challenge, swapping out premium brands for cheaper alternatives which can be just as tasty. Check the reduced-price section for bargains, especially items that can be frozen. Keep an eye out for discounts and promotions, checking the price per weight to work out the best value for money. Check dates on items for maximum shelf life once purchased. Compare supermarket prices and distance to your home to work out the best option for you. Don’t forget to consider local shops such as butchers and greengrocers. Supermarket loyalty cards can offer discounts on items or points which can be redeemed against future spend. Plan your meals to minimise food wastage and save money. Batch cook meals and keep some in the fridge or freezer. You could always bring these to campus and heat up for a delicious meal on the go. Explore budget friendly meals from websites such as The Student Food Project Consider cooking with friends or housemates to save money and socialise in a budget-friendly way. Invest in a few kitchen basics to make meal preparation easier, such as a chopping board, vegetable peeler and frying pan. There are a variety of supermarkets across Nottingham, and the cost of food will vary between them. Cost is one factor in buying groceries, alongside other considerations such as quality, distance from your home and online delivery costs. Which publish monthly breakdowns of the cheapest supermarket: supermarket price comparison If you’re struggling to afford food essentials, you may be able to access support. Please find a list of resources below, these are correct as of July 2024 but are subject to change at any time. The Residential Experience Team provides advice and practical support for students living in ResX supported accommodation who are facing financial challenges. We can signpost to cost-effective services across the University and city, provide basic living supplies for students in need, and host a range of free food and social events for residents. Please contact us by email or follow us on Instagram to find out more Instagram.com/UonResX Tuesday 4-7pm, Friday 1-3pm open to all students. The Food Bank is open during term time only, however outside of food bank a student can contact the SU to arrange an emergency food parcel collection. UoNSU Food Bank is there to provide students with food support on a one off or long-term basis. On each visit you can pick what you want - after your first visit you will be signposted to SU Advice for help with managing your money, to ensure you’re getting the support you need. The food bank can be found in the Student Union (C Floor, Portland Building) and is open Tuesday 4-7pm and Friday 1-3pm. You are also able to volunteer at the Food Bank. Volunteering will cover collecting donations, date checking, stock take and most importantly, supporting students! Volunteer hours can contribute towards your Nottingham Advantage Award and earn you 10% off at Mooch. If you are interested in volunteering, please fill the form below. Foodbank volunteer form"
        }
    ],
    "pdf_files": []
}