{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/art/our-music-facilities--chloe-s-experience.html",
    "content": [
        {
            "p": "Chloe is a third-year Music and Music Technology student. She discusses what she loves most about our facilities, learning new skills, and the sense of community in the department... Chloe The facilities were part of the reason I chose Nottingham. I really like the range that we have. As I do Music and Music Technology, I’ve used all of the facilities for different things. The availability is also really good. I’ve never had any issues with getting a practice room, or booking out the recording studio. I also like that our facilities are light and modern. It is quite a modern department, which is great. I really like the Recording Studio. I didn’t see many unis that actually had their own recording studio, and ours is industry standard. You have ensembles who aren’t even part of the uni coming in to use it, because it’s the best around. It’s great that we’re given an induction on using the studio, then we’re just set free to do what we want with it! I’ve gone in to record myself just for fun and to get to know the space. I really liked having that, it’s been a highlight. I’ve used it for workshops, when I’ve had practical lectures in there, like for the ‘Conducting’ and ‘Music and Health’ modules. I’ve also been in there for student ensembles. I’m in Choir, and we practice in the Hall every Tuesday. It’s hundreds of people, we get the big staging out and it’s such a big space. We’ve fitted in a full orchestra and a full choir at the same time! You can also book the space out for personal use. I’m a pianist, so a couple of times I’ve booked it out so I can just play the grand piano. It’s music specific books and manuscripts. Some of the manuscripts you can take out like a book, and some are just for looking at in the library. Then it’s got DVDs and CDs of specific recordings, some of which are historical recordings, which you can’t find online. I’ve used some of the archive material as part of ‘The Social Life of Scores’, which is a module where you spend a lot of time looking at more historical stuff. The library offers the ideal space to analyse these old (and quite expensive!) scores. I use the library quite a lot, I’m in there most days. It’s really useful to have that space where you’re always guaranteed to find a seat and it’s always quiet. I also have a part-time job in there as a librarian, which is something music students can do in second and third-year. There are two recording studios. The main one has a performance room and a recording room with a mixing desk. You get to use that in third-year. You can use it a lot, for like 3 hours a week every week. The Music Technology compulsory modules in third-year use it, so ‘Recording Studio Practice’ and ‘Music Production’. Now they’ve added this new downstairs studio, too, called the Mustard Room (as the walls are painted mustard yellow!). That’s really great as it’s for first-and-second years to get to know it. It’s not got two rooms, like the main studio, it’s just the room with the desks and fancy dials, but you can use that from first-year and book it out in your free time to familiarise yourself with it. I had never done music technology before uni. The studio has been really good, as I had no clue what any of it did, so if I didn’t have access to the recording studio I’d just be so lost. The module that we’re doing at the moment is teaching us how to use it, and then next semester it’s about creatively using it! The module brings everyone up to the same level. This is a room filled with Mac computers and MIDI keyboards. All of my first and second-year music technology modules were in here. Again, you can book out this space, so if you don’t have access to programmes like Sibelius, or Cubase or Logic on your own laptop you can use it in the studio. It’s like learning how to use your DAW, which is your digital audio workspace, before you then take it to the recording studio. It’s learning how to use the bit on the computer before you add all the extra buttons! Having access to the recording studio has opened up that door for me career-wise, now I’ve got those skills. Even just having the Rehearsal Hall, to use for conducting and things like that, it’s so good having that space rather than just doing it in a classroom. It’s giving you those skills which are transferrable in the future, for someone doing music. The facilities are genuinely really good here. I really like that fact that we have our own lecture theatre, which no other uni that I looked at had for music. I’ve never in my three years had a lecture or seminar outside of the music building. I found that really positive as it makes a little music community. There’s so many student music societies, it’s not even just music students, but people who are involved with music. Because we’re such a small cohort everyone says hi to each other, and because you’re always in this building, you’re seeing the same people every day. Faculty of Arts Third-year student Chloe shares a typical day... With our professional facilities right here on campus, we bring the music to you. Faculty of Arts students share their thoughts on staff who have inspired and supported them. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}