{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/graduation/inter-ceremony.aspx",
    "content": [
        {
            "p": "Eligibility, deadlines and application requirements In some circumstances, you may want to receive your documents before the next set of graduation ceremonies. This means that you can graduate early and receive your degree certificate and diploma supplement through the post. Applying for your documents early means that you will not be able to attend a graduation ceremony in person later. To get your documents early you must: Check your name in NottinghamHub is displayed correctly, amendments should be made by the application date Update your home address in NottinghamHub, this is where we will post your documents To apply to graduate early, you will need to complete an application form. If your application is successful, your certificate and diploma supplement will be posted to your home address after the conferral date, or you can ask to collect if from a Student Service Centre. Month Application date Award date Documents available for postage or collection January Monday 6 January Wednesday 15 January Friday 31 January February Wednesday 5 February Wednesday 19 February Friday 28 February March Wednesday 5 March Wednesday 19 March Monday 31 March April Wednesday 2 April Wednesday 16 April Wednesday 30 April May Wednesday 7 May Wednesday 21 May Friday 30 May June Wednesday 4 June Wednesday 18 June Monday 30 June To ensure you receive your certificate in a timely manner, please log in to NottinghamHub with your university username and password, and check the following details are correct: Full name - this will be printed on your certificate. If this is incorrect, you will need to follow these instructions Home address - this is the address we will send your certificate to Home email address - this is where we will send the email instructions and log in for you to download a copy of your certificate Check your name and address are correct If you have any outstanding debt owing to the university, you will not be able to graduate. Please review the finance tab in NottinghamHub if you are unsure. See our terms and conditions for more details. Check if you have any outstanding fees If you have any questions, please submit any enquiry through the Student Enquiry Centre."
        }
    ],
    "pdf_files": []
}