{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/social-sciences/world-class-teaching-and-facilities.html",
    "content": [
        {
            "p": "Nottingham provides a proven pathway towards career success alongside unrivalled facilities and valuable industry exposure. The School of Law is proud to welcome students, staff and partners into our internationally renowned and vibrant community. With a focus on excellence in teaching, coupled with a strong research base, we provide global leadership on legal knowledge and education. And our academia isn’t the only thing that’s award-winning. Nottingham’s School of Law boasts a vibrant and active social scene. Our award-winning student-run societies provide outlets for personal and professional development as well as a positive contribution to the local community. As well as the industry standards, as a Nottingham student, you can study a variety of specialist areas through optional module choices, expanding both your knowledge and career opportunities – perfect for those who wish to keep their options open after graduation. Law students can also study law abroad as part of our four-year programmes. Locations include Australia, Europe or the USA. The University of Nottingham is a prestigious Russell Group university with high status and recognition around the world. We consistently rank highly in UK and international league tables: Providing a learning environment that will enable you to develop your potential and widen your horizons. The School of Law's ethos combines pre-eminent scholarship with a friendly, inclusive collegiality incorporating all students and staff into a single, cohesive intellectual community. Alongside the broad range of research areas pursued by our staff, the school is home to six research centres and groups as well as respected journals such as the Human Rights Law Review and the Public Procurement Law Review. We welcome academic visitors and are proud of our well-established JC Smith Trust Fund Visiting Scholar scheme. We recognise your hard work and strong academic profile, and that’s why we want you to join us and add value at the University of Nottingham. School of Mathematical Sciences Everything you need is in one place, making it easy to find. Student experience Transform your future by studying at a world-leading university. Semenyhi campus, Malaysia If you're looking for a British style degree and the opportunity to study in Asia, consider a course at one of our international campuses in China and Malaysia. Campus and facilities Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities."
        }
    ],
    "pdf_files": []
}