{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/events.html?title=U3R1ZHkgT3B0aW9ucw==&variant=c3R1ZHlPcHRpb25zSnNvblBhdGg=",
    "content": [
        {
            "p": "Open days are a great way to learn more about your course, meet academics and chat to students. They also help you to get a feel for the place, so that you can decide whether life as a Nottingham student is right for you. Book your place on an open day Book your campus tour Find out more about postgraduate study Our open days for September 2025 entry for most of our courses will take place on: We have slightly different dates for the subjects below. The following will take place on our Sutton Bonington campus. For Veterinary Medicine, our open days will take place on: For certain Biosciences courses (Agricultural sciences, Animal science, Biotechnology, Food, Nutrition, Dietetics, Microbiology), our open days will take place on: Visit our open day to explore our award-winning campuses, tour the facilities, check out accommodation options, and chat with our friendly staff and students! If you’re not able to visit us in person, there are still lots of ways to find out what life here on campus is like. You can: Explore our campus with a 360 virtual tour. Click here to have a look around our University Park campus. Explore this campus Home to our veterinary and bioscience courses, Sutton Bonington Campus offers a student experience that's as unique as our students are. From sports to events and societies, and even a farmers market. Sutton Bonington is surrounded by the beautiful and peaceful countryside. The campus has world-leading labs and specialist facilities, a working dairy centre and commercial farm. We have an open campus policy and welcome visitors throughout the year. We also have various Open Days and Offer Holder Days throughout the year where you will have the opportunity to speak to Academic Staff and current students about the courses you may be interested in. You can chat to our students and staff to find out more about student life at Nottingham and your course. Faculty of Medicine and Health Sciences Bachelor of Science with Honours Qualification Bachelor of Science with Honours Entry requirements AAB Start date Sep 2025 UCAS code C100 Fees (UK) TBC Location Medical School Building and University Park Campus, Nottingham, UK Faculty of Arts Bachelor of Arts with Honours Qualification Bachelor of Arts with Honours Entry requirements ABB UCAS code Q800 Location University Park Campus, Nottingham, UK If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}