{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Electrical-and-Electronic-Engineering-MEng-Hons-U7UEEENG.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK Electrical and electronic engineers design, develop, test and oversee new technologies. This can be to generate and process power as well as to create anything from drones and electric cars to the technology in smartphones, sat navs and systems in hospitals. Our course will give you the specialist knowledge and skills that will help you be part of a more sustainable future. Through lab-based projects, working individually and in small teams, you'll bring together your numerical, analytical and technical knowledge to problem solve different situations. Mandatory Year 1 Applied Electrical and Electronic Engineering Construction Project Contemporary Engineering Themes A Engineering Mathematics Information and Systems Introduction to Software Engineering and Programming Power and Energy The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 25 July 2024. Due to timetabling availability, there may be restrictions on some module combinations. On average, you will have around 20 contact hours a week in year one and two. Combined with coursework and self-study, you may spend over 40 hours a week on your studies. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2023, High Fliers Research). My favourite thing about the EEE course at Nottingham was the project weeks. After every two or three weeks in lectures we got a whole week in the labs working on a group project. This broke up lectures and was a fun and immersive way to learn, I went from no coding experience to being able to code a new language in a week! Safia Patel 86% say staff value students views and opinions about the course Data for Electrical and Electronic Engineering (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Engineering Entry requirements ABB UCAS code H62A Duration 4 years full-time Start date Sep 2025 UCAS code H622 Duration 3 years full-time UCAS code H61G Entry requirements AAA UCAS code H605 If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}