{
    "url": "http://www.nottingham.edu.my/Study/Undergraduate-courses/Economics/Economics.aspx",
    "content": [
        {
            "p": "Economics is about the real world and the choices we face. This fascinating subject requires you to question how society works and enables you to develop and use a wide range of skills relevant to the world today. Nottingham’s School of Economics has an enviable reputation. We consistently rank amongst the top ten in the UK’s higher education league tables and were awarded top marks by the UK Quality Assurance Agency for our teaching quality. The quality of our research is nationally and internationally recognised. We ranked third for research power in the latest UK Research Assessment Exercise and were placed 32nd in the world, 8th in Europe and 4th in the UK in the prestigious Tilburg University Top 100 Worldwide Economics Schools Research Ranking. Economics graduates from The University of Nottingham Malaysia Campus have been recruited by commercial banks such as Alliance Bank, CIMB, Citibank, HSBC, OCBC, Royal Bank of Scotland, UOB, multinational companies such as Frank Knight, Frost & Sullivan,GlaxoSmithKline, IBM, KPMG, PwC, as well as policy institutes such as Asia Strategy and Leadership Institute, Bank Negara Malaysia and IDEAS. In addition, a substantial fraction of our graduates are pursuing their master and doctoral studies around the world, as our three-year honours degree is internationally recognised for entry into postgraduate programmes of renown universities around the world, including the London School of Economics, University College London and the University of Warwick. If you intend to enrol in a Bachelor of Economics course, you should consider taking Mathematics, Additional Mathematics, and Statistics in secondary school or pre-university. Others on your list should be Accounting, Economics, Business Studies and Computing. Yes, it is possible to study economics without a strong background in mathematics. However, many economics courses do require a level of proficiency in mathematics, and advanced economics programmes will require you to have a solid understanding of numerical concepts and techniques. Thus, it’s advisable to take additional mathematics courses or seek help to build your mathematical skills. As the name implies, economists are social scientists who study how the economy works - in particular, how goods and services are produced, distributed and consumed. They often evaluate data to discern the economy’s health (for example, to see if a recession is likely), and use mathematical and statistical tools to evaluate the impact of policies on the economy. As an economist, you can work in many settings, specialising in areas such as macroeconomics, microeconomics and international trade. You will have the opportunity to do research and collaborate with other professionals to analyse economic issues, and advise policymakers. We offer courses for Economics BSc (Hons) and Economics and International Economics BSc (Hons). Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}