{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Engineering/Materials-Mechanics-and-Structures/research.aspx",
    "content": [
        {
            "p": "The Materials, Mechanics and Structures Research Division is a collaborative effort dedicated to support cutting edge research activities that cover all aspects of mechanics, materials processing, and structural engineering design. Our mission is to promote high quality multidisciplinary research, from fundamental to applications, in the areas of aerospace, biomaterials and biomechanics, computational mechanics, dynamic systems and control, geomechanics, advanced nanomaterials and polymer composites processing. We aim to provide an ideal environment for carrying out any theoretical, computational and experimental works, which are supported by modern instrumental facilities and fast computational technologies. Most of our research projects are financially supported by the Ministry of Science, Technology and Innovation (MOSTI), Ministry of Higher Education (MOHE), Ministry of Finance (MOF) and various industrial collaborators and partners. Research groups within the Materials, Mechanics and Structures Research Division are: The Advanced Materials Research Group was established with the purpose to support and foster multidisciplinary research on advanced materials in science and engineering among the division members. Bioengineering Research Group aims to achieve excellence of research in the areas of Tissue Engineering (TE) and Biomaterials. TE provides an advanced alternative therapy to patients with diseased or damaged organs through the regeneration of tissue. Our overall goal is to contribute to the better and healthier human lives. We are currently focused on the development of scaffold library by means of rapid prototyping (RP) technology in combination with novel biopolymers to cater for tailored TE applications. Research partners and collaborations include the Ministry of Higher Education, Hospital Universiti Kebangsan Malaysia, and the MIDAS project at The University of Nottingham Malaysia Campus. Current research in the Geomechanics Research Group focuses on the development and improvement of the design and construction aspects of some common engineering works in the construction industry. Our research outputs are intended for practical civil engineers to improve their knowledge and competency in carrying out design and construction works. The Polymer Composites Research Group is formed by a dedicated team with expert knowledge in design, manufacture and performance optimisation of both polymer and advanced fibre reinforced composites. Fundamental principles are applied, and ‘state-of-the-art’ techniques are utilised to ensure that the properties and performance of the end products are perfectly adapted to design specifications. Our research themes combine curiosity-driven research with application driven objectives, leading the development of advanced synthetic/natural fibre reinforced composites. The Structural Integrity and Dynamics Research Group activities have a connection with the structure, its dynamics and the thermo-fluid–structure interactions. We have received funding from industrial and government organisations. Our materials, mechanics and structures postgraduate division is equipped with all the necessary facilities and resources needed for groundbreaking research in these disciplines. The state-of-the-art labs and equipment enable our students and researchers to explore theoretical concepts, conduct simulations and engage in hands-on experimentation. Students and researchers will also have access to extensive libraries, journals and collaborative spaces to brainstorm and share knowledge. Our postgraduate engineering programme offers in-depth research training in disciplines within material science, mechanics, and structural engineering. We aim to provide students with a comprehensive research experience and specialised training in their chosen field. Join us today to be part of cutting-edge research projects. Our Engineering postgraduate programmes cover a broad spectrum of research areas, including advanced materials, bioengineering, geomechanics, polymer composites, and structural integrity and dynamics. Research topics for these areas are broad, and students will have the opportunity to explore their interests. Yes, we do accept students from different educational backgrounds. However, foundational knowledge in relevant subjects might be required. Preparatory courses might be needed to bridge the knowledge gap. Prospective students will be considered on a case-by-case basis. Advanced studies in this field equip individuals with specialised knowledge and highly sought-after skills in various industries. Students will be able to work on cutting-edge research, tackle real-world engineering challenges, and contribute to technological advancements. Yes, UNM offers scholarships, assistantships, grants, fellowships and financial support for outstanding postgraduate students. These can cover tuition fees, living expenses, or research funding. UMN’s Engineering MPhil and PhD programmes are available part-time and full-time. The durations are as follows: Engineering MPhil Full-time: 1 to 2 years Part-time: 2 to 4 years Engineering PhD Full-time: 3 to 4 years Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}