{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/contact-us/representatives/representatives.aspx",
    "content": [
        {
            "p": "Our official representatives can help you apply for courses and get ready for study. The University of Nottingham works with official representatives around the world – such as education agencies and counsellors – who provide an important link for international students interested in studying in the UK. Our representatives are contracted partners with the university and receive remuneration for the successful performance of the services they provide. We actively review each representatives' performance on a holistic basis and engage students feedback to ensure they continue to meet the high standards we set. Find representatives in your country Our overseas representatives can: Representatives can not make offers of study on behalf of the university. Once they have submitted your application, a decision will be made by the university. When working with one of our representatives, we recommend that you clarify in advance any service charges and expectations. You should not make payments for tuition fees or course deposits to any representative; only directly to the university. For any enquiries or correspondence about our representatives – including feedback about our appointed representatives and enquiries about working as a University of Nottingham representative – please contact the Agent Relations Team who will forward your enquiry to the relevant person. Our standards and expectations As an institution, we are committed to the UK Agent Quality Framework (AQF) and pledge to create and maintain the highest standards of agent management, ensuring the UK remains leading study destination for international students. We have recently signed a pledge with the British Universities' International Liaison Association and the British Council, which declares that we are committed to: Students can read more about working with Educational Agents in the Student Guide to Choosing an Education Agent. All of the listed Country Representatives have provided us with evidence that they are trained by the British Council and have up to date awareness about UKVI Laws and compliance. If you have any questions, please contact ruth.walker@nottingham.ac.uk. If you used the services of an Agent, we would be grateful if you could provide us with some feedback using this form. Your responses are confidential and will not affect your studies. Feedback on our agent services contributes to our commitment to the Agent Quality Framework. Agent feedback questionnaire Check the list below and follow the links to our representatives' websites. Representatives are also listed in our country information pages, including maps of their office locations in some countries."
        }
    ],
    "pdf_files": []
}