{
    "url": "http://www.nottingham.edu.my/Study/How-to-apply/how-to-apply.aspx",
    "content": [
        {
            "p": "Taught courses Academic requirements vary by programme - check our prospectus and course guides page for details or you can also check our faculties, schools and departments pages for details. Research courses If you plan to study for a research degree, e.g. MRes or PhD, you will need to make contact with a potential supervisor from the relevant department/school before submitting an application. Contacting Potential Research Supervisors It is important to take note of any deadlines and submit your applications before the published deadlines for all programmes. Please check when to apply page for details. International applicants should apply as early as possible as your visa application can take up to two months to process. If we receive your application nearing the deadline, we cannot guarantee that you will be able to make it in time for registration. Applications will automatically be deferred to the next available intake if you are unable to make it in time for registration. International students: All International students planning to study in Malaysia MUST apply for Visa approval to study in Malaysia BEFORE entering Malaysia. Failure to obtain this approval letter on time will result in International students not being allowed to enter Malaysia and to register with the University. The University will not be liable for any action taken by the Malaysian immigration authorities if you do not adhere to this regulation. An applicant should be at least 18 years of age for admission to the University. For the purpose of this regulation, the date of 'admission' is defined as the first day of the relevant registration. This requirement may be waived on an individual basis, provided that your parents or legal guardians have given their written agreement in advance to additional safeguards and requirements. These include acknowledging that the University will not act in \"loco parentis\" by completing the compulsory under 18 consent form. Waiving age requirements Under 18 consent form Policy for students under age of 18 years You can upload the completed consent form via your NottinghamHub portal once you have submitted an application. The University charges an application fee for all of its programmes. You must pay the application fee before we can process your application. Application/change course Applicants seeking a change of semester, year of entry, or mode of study are exempt from the application fee. Malaysian Applicants: RM100 per application International Applicants: RM200 per application Deferment The university will review deferral requests, and approval is not guaranteed. Please refer to the 'Accept Your Offer' page for additional information. The deadline to defer your offer to 2025 is on 30 October 2024. After the specified deferral deadline, a new application must be submitted, and the applicable new application fee is required. Course deposit Foundation, undergraduate and postgraduate taught offer holders are required to pay a non-refundable course deposit at the point of accepting your offer. If the University has not received the deposit by the stated deadline, we will withdraw the offer of a place on our course, so it is essential that you have funds for your course deposit available before applying. Please refer to the 'Accept Your Offer' page for additional information. Malaysian Offer Holders: RM1,000 International Offer Holders: RM2,000 Before starting with the online application, you must read the Compliance with the MQA Standards and Programme Standards and Checklist for application documents. Compliance with the MQA Standards and Programme Standards Checklist for applications Applicants applying for credit transfer (Recognition of Other Learning – ROL) Please be aware that application for Recognition of Other Learning (ROL) should be made before you register with the University as schools may choose not to consider any applications for ROL submitted after admission. The University will not be able to assess exemptions until you have submitted an official application to the University. Policy on Credit Transfer (RPL) or Prior Certified Learning (RPCL) Transfer of credits form How to upload your transfer of credits form You can apply directly through our online application system, NottinghamHub. You will receive an automatic confirmation once you submit your application and can track its progress. Apply online User guide NottinghamHub - online application Make sure that you upload scanned copies of your degree certificate and transcripts, as well as any other supporting documents, as we will not be able to assess your application without them. Any document you submit must be in English. You can also supply an official translation if the original documents are not available in English. We recommend that you provide certified copies of your qualifications, but you can also provide them when you register as a new student. The preferred payment method is via our online application system, NottinghamHub. You can proceed to make the application fee payment once you have submitted your application. If you are paying in international currencies, we highly recommend that International offer holders use the Nottingham Flywire site. Pay fees online Important: You must email the proof of payment to the Finance Office (copying the Admissions Office) if the payment is not done through NottinghamHub or Nottingham Flywire site. You can log in at any time to NottinghamHub portal to track the progress of your application. You will also receive updates through email if you are required to submit additional documents to support your application. Our Admissions Committee will review your application, and a decision will be made within two working weeks of receiving your complete application documents and the payment of the application fees. Programmes such as MPharm, BPharm, MBA, and certain postgraduate programmes that require interviews may have longer processing times, while applicants with borderline grades may also be required to attend an admissions test. Additionally, research applications may take up to three months to process. After a decision has been made on your application, you will receive an email with instructions on what to do next in the event of a successful application. Notification via email will also be sent for unsuccessful applications. Successful applications Successful applicants will find details on how to accept your offer on our offer acceptance page. Accept your offer You are also required to read the information available via the link in your offer letter or you can click on the ‘I have an offer link’ below. I have an offer Unsuccessful applications There is no right of appeal against the outcome of an admissions decision, unless if additional relevant information can be provided by an applicant in support of their application. The additional information should be provided together with an explanation of why this was not available when the application was originally submitted. We are unable to provide feedback to all unsuccessful applicants routinely. However, we will provide general feedback to unsuccessful applicants upon written request. The University will normally respond to requests for feedback within 28 days. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/Consent-form-for-applicants-under-the-age-of-18.pdf",
        "pdf_files/User-guide-NottinghamHub-online-application.pdf"
    ]
}