{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/country-info/countryinformation/barbados.aspx",
    "content": [
        {
            "p": "I chose to study at Nottingham because of its outstanding relationships with industry partners as well as its wonderful reputation for supporting international students during their university journey. Nottingham is a breathtakingly beautiful place and although the work is challenging I have received amazing support from both lecturers and administrative staff. This has made the experience even more enriching. The culture may be a bit different from your home country however Britons are very open to visiting international students. By the way, do not forget to pack warm clothes! Omari Blackman from Barbados (pictured, far right) MSc Electronic Communications and Computer Engineering The University of Nottingham has an estimated 15 students from Barbados studying at our UK Campuses, based on 2012/13 data from the Higher Education Statistics Agency (HESA). The African/Caribbean Society is the Students’ Union’s society for students from African/Caribbean countries or with an interest in African/Caribbean culture, and organises social events throughout the year. If you want to know what studying at Nottingham is really like, our International Student Life blog is a must-read. Whether they’re writing about societies and support groups, applications and accommodation or shopping and sight-seeing, our international students, from a range of countries around the world, are here to help both current and future students get the most out of your time here throughout your Nottingham journey. Below is an approximate guide to entry requirements for students from Barbados for admission to The University of Nottingham at the following levels. We offer foundation courses for international students who are not qualified for direct entry to our undergraduate degree courses. These courses are available at the University of Nottingham International College, just next to University Park Campus, in partnership with Kaplan International Colleges. Find out more about the courses, entry requirements and progression options on Kaplan's website: Applications and enquiries for these courses are handled by Kaplan and the college. International foundation courses We accept students for direct entry to undergraduate programmes who have completed Caribbean Advanced Proficiency Examinations (CAPE) at the double unit level. We require for six grade I or II double-unit subjects, depending on the course applied for. Students taking A levels or the IB should refer to the online undergraduate prospectus for entry requirements. Students taking APs or SATIIs should refer to entry requirements for the USA. Find out how to apply Class II (upper division) from the University of the West Indies: where GPA marking is used, we consider 3.0 to 3.49 to be equivalent to an UK 2:1 degree. For more information, please see our postgraduate course pages. A masters degree from the University of the West Indies will be considered for admission, if awarded on the basis of research and completion of a thesis. For all research degrees, we recommend that you make initial enquiries with a potential supervisor or the relevant University of Nottingham school / department before applying. A research proposal is required when submitting your application. Americas Undergraduate Excellence Award Americas Postgraduate Excellence Award Developing Solutions Masters Scholarship Chevening Scholarships Commonwealth Scholarships Commonwealth Shared Scholarship International Sporting Excellence Award Sports scholarship packages Find out more about tuition fees Staff from The University of Nottingham make regular visits to countries around the world. Come along and meet us, and we'll be happy to discuss any questions you have about living and studying in Nottingham. Details of upcoming visits. For further contact details, please see our International Office Contacts page. Our overseas representatives in the Caribbean are: You can also connect with us through social media. International Relations Manager (Americas) Contact Will Use our online enquiry form to make an enquiry about studying at the University of Nottingham. You can also connect with us through social media:"
        }
    ],
    "pdf_files": []
}