{
    "url": "https://www.nottingham.ac.uk/studentservices/support/financialsupport/studentfunding/placements-and-study-abroad.aspx",
    "content": [
        {
            "p": "It is important that you tell Student Finance that you will be abroad/on a placement year. When completing your funding application you need to indicate what you will be doing, and where you primarily be, during each term. If you are applying for a tuition fee loan and require the maximum loan to cover your tuition fee, please tick the appropriate box and also tick to allow the University to change the amount. This will allow the University to amend the fee to the correct figure, after the beginning of the academic year, once you have gone abroad or attending your work placement. If you are going to be on an unpaid placement in a hospital, health care authority, Local Authority, prison sector, the UK Parliament or working on research within a Higher Education Institute, you may be eligible to apply for the usual package of financial support. Student Finance refer to this as a 'Type B Placement' and you may be asked to send in evidence of the placement from your School/Department. University Core Bursary If you meet the eligiblity criteria for the Core Bursary you need to ask Student Finance to carry out a means tested assessment and share the income information with the University in the usual way - Core Bursary Assessment Procedure The Study Abroad team have a useful web page outlining the funding for a student who is studying abroad. The impact of receiving a Turing Grant on your funding from Student Finance You can be means tested (if relevant) for the overseas rate maintenance loan which is slightly higher than for the years you are at Nottingham. This is in addition to any funding from the Turing Grant. Students on a work placement who receive a Turing grant should be assessed for the overseas rate maintenance loan rather than the reduced rate maintenance loan. The tuition fee for Turing students is the same as all students who are on a year abroad in 2024/25 and a tuition fee loan is available from Student Finance. The fee for a Semester abroad is different; the University will advise Student Finance of the correct fee during the academic year. Tuition fee information for 2024/25 The non means tested maintenance loan is available for all eligible students regardless of household income. You are still entitled to receive the Core Bursary while you are on a Turing year or semester out. If you are on a non Turing work placement abroad, so receive the reduced rate loan, you can still be assessed for the Core Bursary. If you meet the eligiblity criteria you need to ask Student Finance to carry out a means tested assessment and share the income information with the University in the usual way - Core Bursary Assessment Procedure If they refuse to do this, which they shouldn't, please let us know through the Student Enquiry Centre Ask a question through the Student Enquiry Centre"
        }
    ],
    "pdf_files": []
}