{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/engineering/A-day-in-the-life-of-a-Civil-Engineering-student.html",
    "content": [
        {
            "p": "Follow Feroz, as he attends his group design project seminar, meets with his tutor and attends a fundamental materials lecture. Choosing both a course and a university that’s right for you is a big decision - and a huge factor in your future career. We’re hoping to help make that decision a little easier, making sure that you have as much information as possible to help you make the best possible choice. We’re 8th in the UK for Civil Engineering (The Guardian University Guide, 2023), but don’t take our word for it, follow Feroz, one of our civil engineering students. He’ll describe his typical day, giving you a taste of what to expect. 8AM – I wake up and get ready for uni. After eating my breakfast and grabbing my things, I’m ready for my day. The walk across campus is one of my highlights of the morning as it’s so green it really sets my mood for the day. 9AM – I head over to the Engineering and Science Learning Centre for my first lecture. It’s on Group Project Design and I’ll be working in my design team. This will last for a few hours as there is so much to discuss and a lot of work to be completed this module. 1:20PM – I met with my tutor, Barbara. This is a great opportunity to shar any doubts I have and make sure I understand everything that’s being taught. 2PM – I grab a late lunch in the Coates Café. They always have a variety of hot food and I feel spoilt for choice. 3PM – Fundamental Materials is my absolute favourite lecture. Everything I learn here can be used in everything civil engineering related. It’s so important and I feel like my deeper understanding grows with each lecture. 5PM – I walk home and chill for a few minutes before heading back out to the gym. 7PM – I make some dinner whilst planning how to spend my weekend. I’m already looking at heading onto campus to study at the library tomorrow. Day in the life of a civil engineering student Faculty of Social Sciences Discover what it's like to be a student in the Faculty of Social Sciences at the University of Nottingham. Nottingham provides a proven pathway towards career success alongside unrivalled facilities and valuable industry exposure. School of Mathematical Sciences Everything you need is in one place, making it easy to find. Student experience Transform your future by studying at a world-leading university. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}