{
    "url": "https://www.nottingham.ac.uk/studywithus/courses/online-study/why-study-online-at-nottingham.aspx",
    "content": [
        {
            "p": "There are three main types of online study options at Nottingham. Each has its own set of benefits, and enable you to achieve your aspirations. To support communication between students and staff, our distance learning courses are mostly taught through an online virtual learning environment, Moodle. Modules are accessed on Moodle through the University website, and you will use virtual discussion groups and tutorials, self-directed study, self-managed learning, group tasks and coursework. Some of our courses are classed as online learning, meaning you will be free to follow the course in your own time, without needing to check in with tutors. From masterclasses to postgraduate qualifications, our online CPD is designed to enable you to develop your interest, accelerate your career and help enhance the performance of your organisation. Our online programmes give you the flexibility to choose when and where you study – supporting you to manage your learning alongside your work and other commitments. You will also access a dynamic and supportive online environment that promotes valuable professional networks. The University’s range of Massive Open Online Courses (MOOCs) can be studied for free, have no entry requirements and are open to anyone, anywhere in the world – all you need is an internet connection. The majority of our courses will require you to study for around three to six weeks in sessions of three to four hours per week. You will be taught by University of Nottingham academics and researchers. As a member of the UK's prestigious Russell Group and the Universitas 21 global network of research-intensive universities, we deliver a high standard of education. We consistently rank highly in UK and international league tables. Our teaching is delivered by some of the brightest minds in their fields and shaped by the latest ground-breaking research. Online study builds skills and experience - valuable to employers without the need for in-person work experience or placements. Our graduates are consistently targeted by globally-recognised companies, giving your career the best possible start. Visit our Careers and Employability Service for more information. You’ll have access to a global network of students, both on and offline, including students from over 150 international communities. To get the most out of distance learning, you will need to be committed and self-motivated. However, when you embark on distance learning it is important that you balance your home life and work with your studies. This will require planning and careful time management. You are not alone in this, and we recommend that you make the most of your contact with the programme administrators and tutors to answer any questions or help solve any problems you may encounter. We offer a broad range of student support services, covering everything from financial support to issues of disability, equality and diversity. Distance learning programmes are set up to provide you with a variety of learning opportunities. The more you engage with the materials and learning opportunities, the better you will do and the more you will get out of it. In the majority of cases you are not expected to study alone but to interact with others to benefit from collaborative and shared learning. Talking to other students helps with your learning, and also with your work management. Your tutors will use the online learning environment (Moodle) to offer you discussion forums, chat rooms and web conferences as is relevant to your course. Using these tools together with social media will make you feel part of a community. Good communication is vital to the distance student experience."
        }
    ],
    "pdf_files": []
}