{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/module-enrolment/get-help-with-module-enrolment.aspx",
    "content": [
        {
            "p": "Module Change of Mind period will open from 12noon on Monday 27 January to 5pm on Friday 7 February 2025. If you require changes to your modules outside of the change of mind period, please note that these may be accepted in exceptional circumstances. You will also need approval from the school offering the module and your home school. In this instance, please complete the exceptional amendment form below. If you are an exchange/visiting student, and have been advised you need to select your modules, you should also use the exceptional amendment form below to submit your choices. Exceptional Amendment Form 2024/25 I can't log into NottinghamHub Difficulty submitting online If you are unable to submit your completed NottinghamHub form because the 'submit' box is greyed out: If this doesn’t fix the issue, you can either talk to our team on live chat, or use the relevant alternative online form below to add your submissions to. Submissions made on the relevant online form are all checked manually by our team, so we recommend using NottinghamHub where possible. My choices have not been approved Clashes The range of optional choices across our curriculum sometimes means that there are timetabling clashes with other modules, you can check your student timetable to see if this is the case for you. If you have a clash you may need to select another module. Module requirements Some modules have prerequisites that you must meet before you can take them, we review everyones choices to make sure they comply with the programme and module regulations, and if you don't meet the requirements you may be asked to choose another module. At capacity The module you've selected may be full. If a module is capped the number of places available will be visible when you make your choice (e.g., 2 places left). We will use any information you give us about your alternative choices to allocate you to another module."
        }
    ],
    "pdf_files": []
}