{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/central/discover-our-vibrant--modern-jubilee-campus.html",
    "content": [
        {
            "p": "Innovative buildings and green spaces designed to inspire tranquillity and creativity. A tour of Jubilee Campus to find out why our students love living and studying on our cutting-edge contemporary campus. With distinctive modern architecture, inspiring spaces to work and relax and a variety of start-up businesses on site, Jubilee Campus is an exciting and innovative place to be Explore Jubilee Campus - a modern purpose-built campus which now extends to 65 acres and is located only one mile from University Park. The initial phase was opened by Her Majesty the Queen in 1999. Our Jubilee Campus features innovative buildings designed with green spaces teeming with wildlife, in an urban setting, inspiring creativity and tranquillity while you study. This purpose-built, sustainable space is just one mile from University Park Campus, allowing students to enjoy the facilities and amenities of both. The distinct 65-acre campus has an entrepreneurial spirit, home to our Business School, the University of Nottingham Innovation Park and the Ingenuity Centre – complete with a meditation floor overlooking the campus. Other facilities and features include: If you're ready to take the next step, we'd love to welcome you to Nottingham. Find out everything you need to know about how to accept your offer and join us. Faculty of Medicine and Health Sciences Discover what it's like to be a student in the Faculty of Medicine and Health Sciences at the University of Nottingham. So, what is it really like to study nursing here? Electrical and Electronic Engineering Read all about Ometere’s day to see what life is like at the University of Nottingham. UON What are societies? Societies are mainly about socialising with like-minded people, while others are about, for example, playing certain sports, taking part in activities, sharing hobbies or helping the wider community. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}