{
    "url": "https://www.nottingham.edu.my/Study/Offer-holders/Paying-your-fees/UNM-Finance/Tuition-fee-structure.aspx",
    "content": [
        {
            "p": "OR Postgraduate students (full-time / part time basis) - Masters Level Postgraduate students – (School of Education, MSc Management Psychology, MSc Finance and Investment & MBA Part-Time Only) - Masters Level Postgraduate students (School of Political, History and International Relations (part-time bases) - Masters Level MRes, MPhil and PhD Research Students (Full-Time / Part-Time) Fee category Amount Remarks Registration for Thesis Pending Period RM850 Postgraduate research students registering for their thesis-pending period (writing period) will need to pay for the registration fee. *Extension to Thesis Submission Date RM850 per application Postgraduate research students registering for an extension of the permitted submission date for a thesis must pay an additional fee. Submission After Agreed Submission Date RM1800 per month Postgraduate research students submitting their thesis later than the permitted submission date without approved extenuating circumstances, must pay an additional fee if their thesis is accepted for examination. MPhil/MRes Re-Examination Fee The University tuition fees for a given academic year include the fees for initial examination (ie the first attempt at an examination) in that year. If you are required to undertake re-examination and are permitted to, or are required to, undertake further study before that re-examination then the fee you pay for this further study will include the re-examination fee. Otherwise, you must pay for any re-examination, or for any initial examination where a University tuition fee has not been paid. If there are extenuating circumstances the University may decide to treat a re-examination as a first attempt, in which case no additional fee will be charged. PhD re-examination fee RM1,200 Paying your Application Fees, Local course deposit, Tuition Fees, Accommodation Fee and Miscellaneous Fee. Payments can be made by: NottinghamHub - Visa/Mastercard (preferred choice for payment of fees) Crossed cheque or bank draft payable to 'The University of Nottingham in Malaysia Sdn Bhd'. Credit / Debit card payment is available for Visa/Mastercard/American Express over-the-counter at the Semenyih Campus Finance Office Bank transfers (telegraphic transfers) or direct bank-in: please note that telegraphic transfers take an average of two weeks processing time. You are advised to make your transfer through the bank and avoid making payment through a money changer. Please ensure that you give the correct details to the bank. The beneficiary name should be \"THE UNIVERSITY OF NOTTINGHAM IN MALAYSIA SDN BHD\". CIMB Bank Berhad No 17 Jalan Jelok 6 Metro Point, Kajang 43000 Selangor Bank Account Number : 8008306319 Swift Code: CIBBMYKL Please note that cash payments are not acceptable. All cheques and bank transfers must be forwarded to the Finance Office for official receipt. Please include your name and course on the back. Do also note that cheques/bank drafts are no longer acceptable in USD currency effective from 1st June 2016. User guide - Paying accommodation fees and print receipts User guide - Paying other fees and print receipts User guide - Checking charges and due dates User guide - Paying tuition fees and print receipts User guide - Optional purchase and print receipts Special Financial Aid Affin Bank Berhad LTAT Branch Bangunan LTAT Jalan Bukit Bintang 55100 Kuala Lumpur Bank Account Number :100260005567 Swift Code: PHBMMYKL Postgraduate students (School of Political, History and International Relations, part time) - Masters Level CIMB Bank Berhad No 17, Jalan Jelok 6 Metro Point, Kajang 43000 Selangor Bank Account Number:8008306319 Swift Code: CIBBMYKL Affin Bank Berhad LTAT Branch Bangunan LTATJalan Bukit Bintang 55100 Kuala Lumpur Bank Account Number :100260005567 Swift Code: PHBMMYKL STUDENT FEES FROM SANCTIONED COUNTRIES Please take note that effective immediately any funds from Iran, Sudan, Cuba, Myanmar, Syria, Crimea and North Korea will not be accepted by our bankers as these countries are listed as sanctioned countries. We have been informed by our bankers that they will not be able to accept remittances from the above countries. By making your payment with Flywire you can: To start making your payments, click on the Pay Now with Flywire button below. If you have any questions about making online payments, visit http://www.flywire.com/help or http://www.flywire.com/howto to find the payment instructions and video."
        }
    ],
    "pdf_files": [
        "pdf_files/USER-GUIDE-PAYING-ACCOMMODATION-FEES-AND-PRINT-RECEIPTS.pdf",
        "pdf_files/USER-GUIDE-PAYING-OTHER-FEES-AND-PRINT-RECEIPT.pdf",
        "pdf_files/USER-GUIDE-CHECKING-CHARGES-AND-DUE-DATES.pdf",
        "pdf_files/USER-GUIDE-PAYING-TUITION-FEES-AND-PRINT-RECEIPTS.pdf",
        "pdf_files/USER-GUIDE-OPTIONAL-PURCHASE-AND-PRINT-RECEIPTS.pdf",
        "pdf_files/Special-Financial-Aid-2024.pdf",
        "pdf_files/USER-GUIDE-PAYING-ACCOMMODATION-FEES-AND-PRINT-RECEIPTS-v2.pdf",
        "pdf_files/USER-GUIDE-PAYING-OTHER-FEES-AND-PRINT-RECEIPTS.pdf",
        "pdf_files/USER-GUIDE-CHECKING-CHARGES-AND-DUE-DATES.pdf",
        "pdf_files/USER-GUIDE-PAYING-TUITION-FEES-AND-PRINT-RECEIPTS.pdf",
        "pdf_files/USER-GUIDE-OPTIONAL-PURCHASE-AND-PRINT-RECEIPTS.pdf"
    ]
}