{
    "url": "https://www.nottingham.ac.uk/studentservices/contact-us/index.aspx",
    "content": [
        {
            "p": "Student service centres will close for the winter break at 2pm on Friday 20 December. The live chat service will reopen at 10am on Thursday 2 January and all centres will reopen to in-person enquiries at 9am on Monday 6 January. We know that there's lots of information for you to understand while you are here at Nottingham, that's why we're always here to help you. There are several different ways that you can speak to us, meaning you can contact us in the way that suits you best. We'll answer questions about your student journey, or connect you to the right person across the university. FAQs Report + Support Wellbeing FAQs - our searchable FAQs on the student enquiry centre are really easy to use, you can find information here about everything we can help with, including registration, exams, timetabling, module enrolment, fees, financial support, graduation, placements, postgraduate research, course transfer, interrupt or withdraw, visas and immigration and much more. Report + Support - if you or someone you know has experienced or witnessed an incident, you can tell us anonymously or ask to speak to an advisor. Speaking to an advisor does not mean that you are making a formal report to the university, it is to enable you to access the support you need to make an informed decision. Wellbeing - providing pro-active information about how you can take care of your mental health and information about specialist services you can access if you feel you are struggling. Monday - Friday, 10am - 4pm, click on the pop-up in the corner of this page. Quick questions can be answered on live chat, which is run by friendly humans. The student enquiry centre is available 24/7. Submit an online enquiry or view our FAQs at any time to suit you. Monday - Friday, 9am - 5pm Student service centres are available on every campus, stop by and say hello. Monday - Friday, 10am - 4pm Call us on 0115 74 86500 and the phone menu will direct you to the team you need based on your faculty and query."
        }
    ],
    "pdf_files": []
}