{
    "url": "https://www.nottingham.ac.uk/studentservices/forms/forms.aspx",
    "content": [
        {
            "p": "Find the form that you need from the list below, including academic appeals, academic misconduct, interruption of study, module enrolment, postgraduate research students, student complaints, students with support plans and withdrawal and transfer of study. Click on the required form below and open it in Desktop App to complete it, you should then save a copy to your desktop. Remember, please do not complete the form in the browser window. To access the form Download it to your desktop Save a copy of your form Complete the form and save Please read the academic appeals procedure and guidance on how to complete an academic appeal form, before completing this form. Academic appeal form If you wish to request a Review of the Decision (outcome) of an Academic Appeal, please read Section 6 of the academic appeals procedure, before completing this form. Academic appeal review request form Interruption of study - UG/PG students Amendment to agreed interruption of study Return from interruption of study Request to change supervision arrangements Request to transfer study Module enrolment request Request to study away Interruption of study Request for additional period of study Notification of submission of thesis Request to enter thesis pending early Request to register during thesis pending Request for extension to thesis pending OR submission deadline Application for restriction on thesis Request to withdraw Coursework extension request forms are microsoft forms and can only be used for one extension request per piece of work.They do not need to include any supporting documentation. Coursework extension - guidance If you have already been granted an extension on the basis of a Support Plan but your circumstances have changed, and you would like to request a further extension to the already extended deadline, please follow the extenuating circumstances procedure. If your faculty/school is still using a Microsoft Word form, please submit the completed form as an attachment to an enquiry in the student enquiry centre. Your local assessment team will receive your claim and be in touch with a decision. Engineering Arts Social Sciences Science Health Sciences Life Sciences Vet School Undergraduate Medicine Postgraduate (Taught) Medicine Academic misconduct self-referral form Academic misconduct paper-based request form Academic misconduct review request form Please read the student complaint procedure, before completing a Level 2 or Level 3 complaint form. You can only submit a Level 2 complaint if you have already progressed a Level 1 complaint with your department or School. Level 2 complaint form Level 3 complaint form Please read the relevant process information before submitting the request to withdraw form. Please read the relevant process information before submitting the transfer forms. Request to withdraw from study Request to transfer taught programme Transfer foundation programme - Honors degree"
        }
    ],
    "pdf_files": []
}