{
    "url": "https://www.nottingham.edu.my/Study/How-to-apply/checklist-for-applications.aspx",
    "content": [
        {
            "p": "Make sure that you upload scanned copies of your certificate and transcripts, as well as any other supporting documents, as we will not be able to assess your application without them. Any document you submit must be in English. You can also supply an official translation if the original documents are not available in English. Additional documents for foundation and undergraduate applicants Additional documents required for applicants applying for credit transfer (Recognition of Other Learning – ROL) Additional documents for compliance to the Malaysian Qualifications Agency (MQA) Standards or Programme Standards Additional documents for postgraduate taught and research Additional documents required for postgraduate research applicant We don't expect you to have all the answers, but a successful proposal should: Title This should be clear, concise and describe the theme of your proposal. Overview Include a short summary of your proposal, stating the problem or question you plan to address. Background summary Identify the study area your proposed thesis falls into, explaining its significance, likely impact and how it will contribute to the field. Aim Explain the key aims of your research and the questions you will address in order to achieve them. Methods and timescale Detail how you intend to carry out your research. Will you collect data using libraries, archives, field studies or interviews for example? How you will analyse the data you collect. A schedule of key activities can help demonstrate that your research is achievable within the timeframe of your PhD. Bibliography List the publications and sources you have cited in your proposal. You can also include sources you have read in preparation. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}