{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/central/explore-our-300--acre-university-park-campus.html",
    "content": [
        {
            "p": "Our beautiful and vibrant University Park Campus inspires has something for everyone. University Park Campus Explore our largest campus, which has been part of the University since 1929. The campus is widely regarded as one of the largest and most attractive in the country. When you head off to university, you might be moving away from home for the first time so finding somewhere to live with the facilities and amenities you need will help ease you into student life. University Park Campus is the centre for your student experience at Nottingham. Located just 2 miles from the city centre, the parks, gardens and woodlands provide an escape from the hustle and bustle of campus life. In the mood for something more social? University Park has that covered too. The campus is home to ultramodern facilities, including: “Both Jubilee Campus and University Park Campus are vital green spaces for the community in Nottingham. This Green Flag Award* is testament to all the hard work of staff and volunteers, who do so much to ensure that it maintains the high standards.” Paul Todd Green Flag Awards, Keep Britain Tidy Accreditation Manager If you're ready to take the next step, we'd love to welcome you to Nottingham for the student experience of a lifetime. Find out everything you need to know about how to accept your offer. Campus and facilities Discover the farming facilities at the University of Nottingham Top Tips Within our top tips and advice hub, you'll find information associated with applying and studying at the University of Nottingham. Faculty of Arts Second-year student Max shares a typical day... School of Health Sciences We spoke with Daniel, who explains what life is like as a health sciences foundation student. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}