{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Economics-with-German-BA-Hons-U6UECNGMY.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK Are you looking for an exciting opportunity to pursue your passion for economics and immerse yourself in German culture? Do you want to gain a global perspective on your studies and enhance your career prospects? BA Economics with German is a four-year degree run in partnership with the Department of Modern Languages and Cultures. You’ll cover a diverse range of subjects including macroeconomics, microeconomics, mathematics, statistics, economic history, developmental and behavioural economics. You’ll become proficient in German through modules that develop your existing language skills. Tailor your career interests with a wide range of optional modules. You'll spend your third year studying in Germany. The perfect opportunity to apply your language and economic skills in a real-world setting. You'll graduate with the practical skills, knowledge and confidence needed to stand out to potential employers as you start your career. Our graduates are highly sought after in a variety of sectors. These include investment banking, accountancy, government departments and much more. Be a part of shaping our global future. Our successful alumni work at top organisations such as the Bank of America, Barclays, Bloomberg, Deloitte, Oxfam and the World Bank. Mandatory Year 1 Current Economic Issues Foundations of Economics German 1: Beginners German 1 The Politics of Economics and the Economics of Politicians Optional Mathematical Economics and Econometrics Mathematical Economics and Statistical Methods Quantitative Economics The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 22 August 2024. Due to timetabling availability, there may be restrictions on some module combinations. You will have at least the following hours of timetabled contact a week through lectures, seminars, tutorials, computer classes and supervisions. You will also be expected to engage in substantial independent study. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2020, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. The best thing about my course is the broad range of topics it covers over both microeconomics and macroeconomics. I have enjoyed applying the knowledge learnt in seminars and in my current dissertation research. Francesca Hollin BA Economics with German Faculty of Arts Entry requirements ABB UCAS code R220 Duration 4 years full-time Start date Sep 2025 Faculty of Social Sciences Entry requirements A*AA UCAS code L100 Duration 3 years full-time Entry requirements BCC UCAS code Y14F Entry requirements AAA UCAS code Y002 Duration 3 or 4 years full-time depending on language or placement choices Economics with German at University of Nottingham, the To see official information about this course and others visit Discover Uni. Make an informed choice. See course info If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}