{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Pharmacy/Pharmacy-research-programmes-MPhilPhD.aspx",
    "content": [
        {
            "p": "UNM/JPT-R/421/7/0036(7/26)MQA/SWA0820 UNM/JPT-R/421/8/0034(7/28)MQA/SWA0822 Our PhD degrees are offered full-time and part-time. Part-time is available to Malaysian students only. The full-time PhD would normally take three years of full-time research with a further year for writing up. Our MPhil degree may be awarded after one year of study – followed by a one year write-up period – if you or the University decides that this is a more appropriate qualification. Research is crucial to the pharmaceutical industry and our academic staff are at the leading edge of scientific and healthcare developments. The current research areas reflect the breadth of expertise of our staff, the acquisition of research funds and recent applications for grants. We offer high-quality doctoral training to postgraduate students who wish to pursue an MPhil or PhD. As a research student, you will work under a supervisor who will assist you in your research and thesis design. Our MPhil and PhD degrees are based on research in the School of Pharmacy. Some of the areas in which postgraduate degrees can be studied are given below. Some of the areas in which postgraduate degrees can be studied are given below. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. PhD A master’s degree (or international equivalent) plus, an upper second class honours degree (or international equivalent) in pharmacy or a related scientific discipline. Non-UK qualifications will be assessed against this standard. If deemed necessary, applicants may also be required to attend an interview. Or A first class honours degree (or international equivalent) in pharmacy or a related scientific discipline. Non-UK qualifications will be assessed against this standard. MPhil An upper second class honours degree (or international equivalent) in pharmacy or a related scientific discipline. Non-UK qualifications will be assessed against this standard. Applicants must have graduated from an approved university. Other equivalent qualifications will be considered on a case-by-case basis. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Find out about scholarships, financial assistance and specific research funding available to all malaysian and international students. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Our programmes provide you with an opportunity to embark on an area of research of your interest, allowing you to focus on this niche area of knowledge and make an important contribution to science. Becoming a MPhil/PhD student at our school means joining a thriving research community and exploring world-changing issues at the forefront of science and healthcare. It also means developing skills prized by academia and the biotechnology, healthcare and pharmaceutical industries. Recent MPhil/PhD graduates from the School of Pharmacy at the Malaysia Campus generally pursue careers in academia or research, working for government departments, international research organisations, and universities or as experts and consultants in their field of expertise. This content was last updated on 15 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}