{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/discover.html",
    "content": [
        {
            "p": "Take our questionnaire to find your perfect course. Answer a few questions and sign up to save your personalised results. 1st Sports University of the Year 2024 (Times, Sunday Times, Daily Mail) 3rd in the UK for top employers (High Fliers Graduate Report 2024) Top 20 UK university (QS World University Rankings 2025) This is the place where your journey begins. We’re ranked one of the UK’s top 20 universities (QS World University Rankings 2025). As a UoN graduate you’ll be highly prized by leading companies. We’re the 3rd most targeted of all UK universities when it comes to top employers and have been top 5 for the past 3 years.* This is the place where your future comes into focus We are ranked in the top two Russell Group universities for work experience (Rate My Placement Best Universities for Work Experience 2024) and our students have access to our careers and employability service for life. *HESA Graduate Outcomes, classification of full-time, UK graduates entering work in the UK from 2018/19 to 21/22, published 2024. This is the place where you'll find your tribe. We’re ranked 5th best uni in the UK for student life. (UniCompare, Best Universities for Student Life 2025). With over 300 societies and more than 70 sports clubs you’ll find your people and your passion. Plus you can enjoy the city of Nottingham with its legendary tales of Robin Hood and unbeatable nightlife. This is the place where potential isn't all that blooms. We’ve won over 22 Green Flag awards for the most beautiful campuses in the UK. Our stunning campuses are home to students from over 150 countries worldwide. Whether you're interested in a BSc, BEng or a BA degree, we have a huge range of university courses for you to explore. Take our questionnaire to receive personalised bachelors and integrated masters degree recommendations. Then sign up to the Find Your Nottingham hub to save your results and explore what the University of Nottingham has to offer undergraduate students. Get tailored study options and information based on the subjects and activities you’re passionate about. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}