{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Find-a-taught-course/Postgraduate-taught-course-search-by-School-or-Department.aspx",
    "content": [
        {
            "p": "Nottingham is internationally renowned for its world-changing and award-winning research. In Malaysia, the University is utilising the unique environment to undertake field-leading research that will not only have an impact nationally but will influence and inform many disciplines globally. Embarking on a postgraduate journey is a significant step towards advancing your academic and professional aspirations. At the University of Nottingham Malaysia, we are dedicated to providing a transformative educational experience that combines rigorous academic studies with real-world applications. Our diverse range of postgraduate programmes, offered across various esteemed schools and departments, is designed to cater to the evolving needs of the global industry. Dive in and explore the myriad opportunities awaiting you at one of the world's top-ranking universities. The University of Nottingham Malaysia offers a diverse range of postgraduate studies at Masters and PhD levels that are tailored to meet the demands of the modern workforce. Here's why you should consider furthering your studies with us: Global recognition: Our degrees are recognised worldwide, ensuring that our graduates are sought after by employers globally. Research excellence: Benefit from our award-winning research facilities and faculty. Diverse community: Join a community of students from over 70 countries, providing a rich cultural experience. Scholarships: Numerous scholarships are available for deserving students, ensuring that financial constraints are not a barrier to quality education. Applications can be made online through our portal. Ensure you have all the necessary documents ready before starting the application process. Typically, a postgraduate taught course at the University of Nottingham Malaysia is studied over one year full-time. Yes, UNM offers a range of scholarships and financial assistance for eligible postgraduate students. Visit our scholarships page for more details. Non-native English speakers are required to provide evidence of their English proficiency, typically through IELTS or TOEFL scores. The specific requirements vary by course, so please check the course details. Yes, the University of Nottingham Malaysia provides on-campus accommodation options specifically designed for postgraduate students, ensuring a conducive environment for study. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}