{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Psychology/School-of-Psychology.aspx",
    "content": [
        {
            "p": "Over the past two decades, psychology has become one of the most popular degree topics in the world. It is a fascinating subject that helps us to understand the ways in which our minds, brains, relationships and societies work. The School of Psychology is consistently ranked amongst the top schools in the United Kingdom and is among the leading centres for research and teaching in the world. Our teaching was rated as ‘excellent’ and many of our staff conduct field-leading research across a wide spectrum of psychological investigation. perceptions, thoughts, feelings and actions of people from infancy to old age, ranging in focus from individuals to groups, organisations and societies. It is multidisciplinary, involving biology, medicine, chemistry, physics, computer science, mathematics and philosophy, and has a vast number of realworld applications. It also provides a gateway to many diverse and well-paid careers. Cognitive neuroscience is a related scientific discipline concerned with the study of the biological substrates underlying cognition, perception and action. Teaching is research-led, meaning that you will benefit from internationally-recognised scientists determining your curriculum and presenting lectures, tutorials, practical classes and seminars. On completion of your course you will have acquired a range of knowledge and skills including the ability to analyse and assess contemporary theories, empirical studies and practical applications. Your knowledge of specialised areas of contemporary interest within psychology will be developed through your selection of special options and project work. Practical and project work will also develop your problem-solving skills, including the ability to design, conduct and analyse various types of psychological research. Additionally, the course will improve your oral and written communications skills, and your ability to use information technology and information retrieval systems. You will be assessed through a variety of methods including formal exams and coursework. A psychology degree equips graduates with a diverse set of skills that are in high demand across various fields of work. Many of our graduates will go on to choose psychology-related careers – as researchers and educators, or as practitioners in a range of sub-disciplines of psychology, such as clinical and counselling, educational and school, engineering, sports, forensic, health, and industrial/organisational. Business-employed research psychologists work on a variety of interesting projects like developing advertising strategies, developing artificial intelligence systems, and evaluating new drugs for mental health treatment. Recent statistics from the Higher Education Statistics Agency (UK) show that 88% of psychology graduates are employed and/or pursuing further education after graduating. Yes, there are several scholarships offered by the government, private organisations and foundations. You can also apply for financial aid and scholarships offered by UNM. The eligibility criteria and application process vary depending on the scholarship you’re applying for. The admission requirements for a psychology degree in Malaysia vary depending on the university and level of study. However, students are generally expected to have a pre-university qualification to enrol in a degree programme. At UNM, students are required to have a minimum of BBC in their A Levels or STPM in order to enrol. Students who have completed their high school education and want to take up psychology can consider our Foundation in Science programme which gives a direct pathway to undergraduate degrees in the Science Faculty. Undergraduate degrees offered by UNM include Psychology BSc (Hons) and Psychology and Neuroscience BSc (Hons). Postgraduate psychology courses at UNM include Psychology MRes/MPhil/PhD and Developmental Disorders MSc. Yes, it is. The Malaysian government has established the Malaysian Society of Clinical Psychology and the Malaysian Psychological Association to regulate the profession, ensuring that practitioners adhere to ethical standards of practice. At UNM psychology course subjects prepare students to specialise in fields such as clinical psychology, counselling psychology, developmental psychology, cognitive psychology, social psychology, forensic psychology and neuropsychology, among others. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}