{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/english-language.aspx",
    "content": [
        {
            "p": "Using and understanding English at a high level is essential for your studies with us. You must submit evidence of your English language ability when you apply. The exact English language requirements vary across our courses, and there are different ways you can demonstrate your English ability, depending on the courses and tests you have taken previously. This page provides an overview of our English language policies for applicants. For full details, see our policies on minimum English language entry requirements and alternative English language qualifications in the Quality Manual. If you're a native English speaker, or you have studied in an English-speaking country or institution, we may be able to accept your academic qualifications as evidence of your English language ability. You will meet our English language entry requirements for degree programmes if you have: If you have completed a degree course which was split between multiple countries or universities, the following rules will apply: If you haven't taken any qualifications meeting the criteria listed above, you will need to provide an English language test result, such as IELTS, PTE or TOEFL. See below for further guidance. We accept a variety of English language tests and qualifications. The International English Language Testing System (IELTS) Academic test is one of the most common. The IELTS test includes grades in listening, reading, writing and speaking, plus an overall grade. IELTS requirements for each of our courses are listed in our course listings. We also accept Pearson Test of English (PTE) and TOEFL (IBT) test certificates. Check the table below against the IELTS requirement listed in our course listings to see what grade you will need. You can also meet our entry requirements through a presessional English course with our Centre for English Language Education (CELE). IELTS, PTE and TOEFL test certificates must date from within the last two years before the course you are applying for. As well as these English tests, we can accept a variety of other English language qualifications from around the world. See our policy on minimum English language entry requirements and our equivalencies tables for full details. If your current test scores at the time you apply don't meet the English requirements for your chosen course, but you meet the academic requirements, we may make you a conditional offer with an English language condition. You would then need to take another English language test to meet our requirements, or successfully complete one of our presessional English courses at the required level, before beginning the degree course. You can take a presessional English course at our Centre for English Language Education (CELE) to help you develop your English language ability to the level needed for our degree courses, and to prepare for academic study with us. CELE is accredited by the British Council for the teaching of English in the UK. CELE's presessional courses provide quality preparation for your academic study, teaching you academic skills in addition to English language skills. If you complete your presessional course at the required level, you can then progress to your degree course and won't need to retake IELTS or any other English language test. Entry requirements for presessional English courses vary depending on the length of the course and your target score. Find out more in our CELE webpages. Due to the extra student visa rules for courses below degree level, you will normally need to have an IELTS for UKVI (Academic) certificate for presessional English courses taught on our campus. For further guidance, and for online presessional courses, see our CELE webpages. There are some extra student visa rules for courses below degree level. This means that any students who will need a Student route visa (formerly known as a Tier 4 student visa) applying for a one-year programme must provide an English test certificate classed by the UK's Home Office as a Secure English Language Test (SELT) at level B1, under the UK's Visas and Immigration (UKVI) policies. For students taking their test outside the UK, we accept these SELT tests: Note that we do not ordinarily accept LanguageCert for entry at the University of Nottingham. See above for guidance on our temporary policy on LanguageCert following the Covid-19 pandemic. If you do not require a student visa you will not need to provide a SELT and we can accept other English language tests and qualifications such as a non-UKVI IELTS or PTE test, TOEFL iBT. Integrated foundation courses in medicine, nursing and midwifery, physiotherapy, sports rehabilitation, and veterinary medicine and science do not require a SELT as they are part of a continuous programme which includes a degree. See our policy on minimum English language entry requirements for details of the IELTS requirements for these courses. Note that many of these courses are not available to international students. For foundation courses at the University of Nottingham International College, see Kaplan's website for entry requirements and English language entry levels."
        }
    ],
    "pdf_files": []
}