{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Electrical-and-Electronic-Engineering/Department-of-Electrical-and-Electronic-Engineering.aspx",
    "content": [
        {
            "p": "Electrical and Electronic Engineering continues to transform the way we live – from the latest consumer products through to sophisticated scientific and industrial technologies. The subject area encompasses an interesting range of topics and develops a variety of skills that are in great demand by employers. Nottingham is one of the leading universities for a degree level education in electrical and electronic engineering. The Department of Electrical and Electronic Engineering was one of the first departments to be established at the Malaysia Campus and our academic staff, like our UK-based colleagues, have an extensive research portfolio. There are a wide range of topics under the heading of electrical engineering, so as well as providing you with a thorough grounding in both the academic and practical aspects, our programmes enable you to specialise in a particular branch of the subject depending on your interests and talents. One of these branches, mechatronic engineering, is a professional discipline that encompasses electrical, electronic and mechanical engineering with intelligent embedded control. At the University of Nottingham Malaysia Campus, we offer the following undergraduate degree programmes within electrical and electronic engineering. Lectures, practical laboratory sessions and project work are supplemented by problem solving workshops and tutorials. For a typical week in your first year you can expect to attend about 10-12 hours of lectures, five hours of problem-based workshops, six hours of practical, hands-on laboratory sessions and one hour in a small group tutorial. Additionally you will undertake independent work and complete the necessary reading in preparation for writing reports and laboratory experiments. You will be assessed through a broad range of methods including coursework, dissertation and oral presentations, as well as tests and examinations. With MEng, you will undertake substantial projects with greater opportunity for specialisation and experience of research methods. During your first year in our electrical and electronics engineering programme, you will gain an understanding of the principles and practices of electrical engineering and your chosen specialist subject area, through the study of analogue and digital electronics, the application of electrical energy and practical work including programming and projects. Your understanding in foundational subjects such as mathematics and science will also be enhanced. During your second year you will continue to develop your understanding and undertake group projects, presentations and seminars that will enable you to gain the skills and understanding essential for the workplace. In your final year, you can choose from a range of specialised topics, as well as undertake an individual research project which forms a major component of the final year assessment. An industrial internship is a required component of the curriculum. You are encouraged to undertake industrial training over the summer of your second year, though you are allowed to undertake it in later years and to do it multiple times if you so choose. All of our MEng undergraduate programmes are fully accredited by the Institution of Engineering and Technology (IET), allowing our graduates a fast-track development to the status of Chartered Engineer (CEng). Accredited MEng degrees provide exemption from further study on the route to CEng status. Our MEng programmes are currently accredited by the Board of Engineers Malaysia (BEM) providing graduates with the ‘Accredited Engineering Degree’. The route to professional engineer status can be found at the Institute of Engineers Malaysia (IEM) website. Electrical and electronic engineering continue to remain robust and buoyant industries. Many of our graduates pursue engineering careers in a range of industries, such as electrical and electronic design, manufacturing, power plants, devices and systems design and development, electrical and electronic equipment and systems design and fabrication, and transmission. Others enter the management and commerce sector, or software and IT. Some also choose to continue their studies with further education. A degree from Nottingham has a high reputation within the electrical and electronic engineering industry, and industry and finance generally, opening up a world of opportunity and prospects. In recent years the majority of our graduates have quickly found career employment with over 97 per cent of our graduates starting work or registering for further study, within three months of graduation. You can work in telecommunications, power generation and distribution, control systems, electronic design and manufacturing, as well as computer hardware and software development. As the field gives you a front seat to technological advances, you can also opt to work on renewable energy systems, artificial intelligence and machine learning, robotics and automation, wireless communication networks and advanced materials for electronic devices. You need a minimum of BBB, including mathematics and physics, in A Levels or STPM to enrol in the Electrical and Electronic Engineering MEng (Hons) and Mechatronic Engineering MEng (Hons) programmes. You should also be able to communicate well in the English language. You will be able to take part in research projects in areas such as renewable energy, robotics, automation and telecommunications. These projects often involve the use of advanced technologies or experimental methods, allowing you to keep up with the industry’s latest developments. You will also have hands-on experience in designing, building and testing electronic circuits and devices. Among other things, you will learn about circuit analysis and design, digital signal processing, control systems, communication systems, electromagnetics and power systems. Understandably, salaries for electrical and electronic engineers vary according to factors such as location and industry. That being said, you can expect to earn between RM2,900 to RM4,000 per month (JobStreet). Department of Electrical and Electronic Engineering Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}