{
    "url": "https://www.nottingham.ac.uk/student-living/community-engagement/community-protection.aspx",
    "content": [
        {
            "p": "Community Protection in Nottingham is a unique service, set up to tackle antisocial behaviour and environmental crime in Nottingham. The aim is to create a safe and clean environment in every one of the city's neighbourhoods. This service is a partnership between Nottingham City Council and Nottinghamshire Police and it functions with officers providing a local presence in every city neighbourhood. It's aided by a network of specialist departments including Environmental Health and Trading Standards. There are more than 100 Community Protection Officers (CPOs) providing a visible presence in every neighbourhood, working within local neighbourhood policing teams to provide a friendly and fast response to neighbourhood issues. You can contact the Community Protection Service Centre helpline on 0115 915 2020 and they can direct your call to the right team or agency. Follow the Community Protection team on Twitter to find out what they get up to. Community Protection has many enforcement tools and powers at its disposal. Occasionally there are issues in densely populated student areas relating to late night noise, house parties and drinking on the street. The Community Protection team have the power to take the following measures in response to issues. This notice seeks to stop an individual, business or organisation, from persistently committing antisocial behaviour which impacts a community’s quality of life. It is intended to deal with particular, ongoing problems or nuisances. Designed to stop individuals or groups from committing antisocial behaviour in a public space, this is intended to deal with nuisance behaviour by imposing conditions on the use of a specific area. The order aims to ensure that law-abiding members of the public can enjoy public spaces, safe from the impact of antisocial behaviour. It can also prohibit certain activities in a public space, such as drinking alcohol. These are fast and flexible powers that can be used to protect victims and communities by quickly closing premises being used to commit nuisance or disorder. A closure notice can be issued by the police or council to shut premises for up to 48 hours with the ability to apply for a six month closure notice through the courts."
        }
    ],
    "pdf_files": []
}