{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/sport-and-societies/sports-clubs-at-the-university-of-nottingham.html",
    "content": [
        {
            "p": "Whether you want to keep fit, make new friends, or try something new, there are over 70 clubs you can join, from popular to ‘don’t know what it is but it looks cool’ sports. Besides the mammoth number of societies at the University of Nottingham - not that we’re bragging, but there are over 200 - we also host a respectable number of sports clubs for all levels of skill and ability. Our clubs represent the University of Nottingham at local, national and international level, but don’t fret that much about it because it’s all about the experience and what gets you going. Being active can mean going for a walk in Highfields Park, or having a session in the gym. Also, if you want to try something new, or rekindle an older passion, there are plenty of options at Nottingham. Here some less-known sports played at Nottingham: Canoe Polo: Played 5 a side, it combines paddling and ball handling with tactical and positional play. The ball can be thrown by hand or flicked with the paddle, and protection is compulsory! Floorball: A cross between ice- and field hockey, you play it 6 a side on an indoor rink with lightweight sticks and a plastic ball. Kendo: It means the 'The Way of the Sword' and uses strikes and thrusts done with a bamboo sword called Shinai, while wearing a protective armour called Bogu. Korfball: If basketball and netball had a baby, well, you get the idea. There are already five korfball teams playing for the Uni, catering to all abilities and levels of commitment. Lifesaving: Yes, it’s also a sport! You can get to compete nationally in the BULSCA league against other universities around the country. Trampoline: Who doesn’t love a good bounce? There’s even a national competition to join. Windriders: windsurfing, kitesurfing, wingspurfing. As you already guessed, it’s all about riding the wind like a true airbender. Or, here some well-known sports played at Nottingham: There are five teams across the club, with skills levels from novice to almost pro, with the representative university team being one of the largest university ice hockey clubs in the UK. Quite popular at Nottingham, this club is actually the second longest-running sports club here, with Shotokan Aikido being a Japanese martial art used for self-defence. One of the biggest clubs at our University meant for all levels of ability and experience. It’s not only about netball, it also encourages teamwork and building friendships. There is a women’s and a men’s team for cricket. Usually, the clubs here are very competitive, but they know how to combine sport with social, so everyone can have a good time. A sport that may soon make its Olympic debut, the University of Nottingham Cheerleading Squad routines include stunts, dance, and gymnastics to achieve competitive and crowd-pleasing performances. There are two clubs for football actually: Men’s and Ladies. The Men’s University of Nottingham Football Club (UoNFC) is known for its prestige and popularity. Have you found your sport yet? If not, don’t worry, as this is just the tip of the sports clubs pile. More than 55 sports clubs left to choose from, and there are also dozens of societies to keep you active and moving. Also, if there’s a sport you want to see come alive at the University of Nottingham, bring it over. At the University of Nottingham there’s always room for anything new. Life in Nottingham Welcome to Nottingham! It’s known for its role in the Robin Hood legend and for the hilltop Nottingham Castle Museum and Art Gallery, rebuilt many times since the medieval era. In the Lace Market area, once the centre of the world’s lace industry, the Galleries of Justice Museum has crime-related exhibits. Wollaton Hall is an ornate Elizabethan mansion with gardens and a deer park. Nottingham and Nottinghamshire The city has many highlights if you consider studying at the University of Nottingham. Here are the \"hidden gems\" students should know about when visiting Nottingham. Find out more about Nottingham and what the city is famous for. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}