{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/art.html",
    "content": [
        {
            "p": "Discover what it's like to be a student in the Faculty of Arts at the University of Nottingham. Our courses will get you workplace-ready, regardless of if you have a specific career in mind, or are keeping your options open. The faculty includes the following schools and departments: Get a feel for life as an Arts and Humanities student. See what a typical day in the life of a student looks like, get tips and advice on studying at Nottingham and hear what our graduates went on to do in their careers. Day in the life Sian shares her typical day... modern languages and cultures Second-year student Isabelle shares a typical day... Theology and Religious Studies Maggie shares her typical day... Sarah, an exchange student from the University of Nottingham Malaysia Campus, shares her typical day... School of English Nina is an English Language and Literature BA student. She shares her top 3 tips for getting the most from your degree. Faculty of Arts \"Give archaeology a go and don’t be put off if you don’t know anything. It’s kind of like seeing how history was made!\" Ciara graduated in Classical Civilisation at Nottingham, and decided to stay on for an MRes in Archaeology. Below, she tells us why... Daniel explains what made him choose his course, and what he's enjoying so far. American and Canadian Studies (Study Abroad) BA graduate Aodhbha explains how her course led her to a career that helps others. 2017 graduate Dot is now working as a Freelance Translator. She explains why she puts enjoying what she does at the forefront of her career choices. 2018 graduate Emily is now working as Product Manager for The Sun at News UK. 2004 graduate Jonathan is now working as United Nations editor & précis-writer. University Park Campus, Nottingham, UK Find out what it's like to study a foundation degree. Meet the team and find out what some of our current students have to say. Take a look around our music and archaeology labs and facilities. With our professional facilities right here on campus, we bring the music to you. Chloe is a third-year Music and Music Technology student. She discusses what she loves most about our facilities, learning new skills, and the sense of community in the department... As an archaeology student, you might be particularly excited about our practical facilities. Well, we don’t just have one laboratory. We have five! Emily discusses how using the labs brought her modules to life, handling material remains, and discovering an interest in archaeobotany... Meet some of our inspiring academics and hear what our students think of their teaching and support. Steph joined the Department of American and Canadian Studies in 2004. She teaches modules on histories of immigration and ethnicity in the United States, the US-Mexico border and Latinx cultures. Faculty of Arts students share their thoughts on staff who have inspired and supported them."
        }
    ],
    "pdf_files": []
}