{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Electrical-and-Electronic-Engineering/Electrical-and-Electronic-Engineering-MEng-Hons.aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/523/6/0238(3/25)MQA/FA8591 Electrical and electronic engineering MEng (Hons) is one of the courses available within the Department of Electrical and Electronic Engineering. Electrical and electronic engineering continues to transform the way we live – from the latest consumer products through to sophisticated scientific and industrial technologies. It can form a platform for many different disciplines ranging from renewable energy to nanotechnology and provide you with a thorough grounding in both academic and practical aspects. This degree offers you the chance to study a range of topics while still allowing you to specialise in the later years of the programme. Topics include communications, computer modelling, electrical machines, electronic design, instrumentation, microelectronics, power generation and distribution, signal processing, software engineering and finally renewable energy systems. The variety of modules taught throughout the course makes this a truly multidisciplinary degree. A Nottingham degree has a high reputation within the electrical and electronic engineering industry, opening up a world of opportunity and prospects. Our programmes will equip you with a variety of skills that allow for adaptation and improvisation in the fast changing world of technology. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 79% average based on 6 subjects, including Advanced Functions, Calculus and Vectors and relevant science subjects. Consideration to be made based on relevant individual grades if specific subjects are required. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Engineering is a 1+4 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Engineering. Modules on the programme aim to improve language and study skills as well as enhance understanding of mathematics and the physical sciences. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway from thermal science or chemistry to electricity and magnetism. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Industrial training is compulsory if you pursue the MEng degree curriculum. You will be expected to participate in industrial training during the summer vacation following the second year of study, although participation in other years or multiple-participation is also allowed. All industrial training must last at least 12 consecutive weeks in the same company or institution. If you pursue the BEng degree you are not required to participate but will be strongly encouraged to do so. Industrial training also provides a great way to identify top career prospects. An Electrical and Electronic Engineering MEng degree is an undergraduate programme that focuses on concepts and practical applications of electricity in all its forms for designing and manufacturing the latest consumer devices to sophisticated scientific and industrial technologies. The eligibility criteria for UNM’s MEng Electrical and Electronic Engineering degree is a minimum of BBB, including mathematics and physics in A Level or STPM. Students who have completed their secondary school diploma can opt to enrol in UNM’s Foundation of Engineering for a direct pathway to this degree. UNM’s Electrical and Electronic Engineering MEng (Hons) degree programme is a four-year, full-time course. Graduates of the E&E degree offered at UNM have a wide range of career opportunities in various industries for instance, telecommunications, electronics and power automation. They can also pursue postgraduate degrees like Electrical and Electronic Engineering MSc and Engineering MPhil/PhD, offered at the University of Nottingham Malaysia. The E&E MEng (Hons) degree offered by UNM covers typical core modules such as Engineering Mathematics, Information and Systems, Electronic Processing and Communications, Power Networks, Analogue Electronics, Advanced Control, Aerial Robotics and Advanced Electrical Machines. Students will learn via lectures, tutorials, practical classes, lab sessions. There will also be a group project in Year 3. Students will have access to state-of-the-art laboratories, computer facilities and research centres. In addition to this, UNM also provides Careers Advisory Service and Wellbeing and Learning Support to all students. Students will be able to participate in various research projects in the fields of renewable energy, robotics, aerospace technology, automation and telecommunications. These research projects may involve the use of experimental methods, providing students with an opportunity to gain practical knowledge of the latest developments in the industry. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}