{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/graduation/your-data.aspx",
    "content": [
        {
            "p": "Learn where we use your data and how to opt out Whether you are attending your graduation ceremony in person or are choosing to graduate in absentia: If you would like to opt out of having your name included in the graduation brochure or shared with Campus clothing, you will need to complete the form that will be available on this page closer to the summer ceremonies. In order to manage the graduation events, we need to process your personal data and share this with third parties. We provide data to Ede and Ravenscroft, our gown hire company, regarding students eligible for graduation and the award they are receiving or expected to receive. This is for the purpose of simplifying the gown hire process for our students and graduates. We provide names of all graduating students to Campus Clothing to print names on their “Class of\" products. If you have any further questions, please contact us. You will be filmed at the ceremony for the Graduation DVD and this will be available to buy from www.mygraduationfilm.com. The ceremonies will be live-streamed and will be available to view on the graduation live page. Some of this content may be shown at future graduation and university events. Crowd shots will be taken by the university's photographers which may include images of yourself and your guests. University photographers will also take individual and group shots to be used by the university and these images may be used in printed and electronic format. Verbal consent will be sought for close up photographs before these are taken. Please tell a photographer on the day if you would not like your photograph to be taken. The University of Nottingham processes your personal data in order to provide its service to you. Please visit the privacy notices webpage, which explains how we process your personal data and the rights you have with respect to your personal information. Specific information on the purposes for which we process your data and the legal bases for this is available on the privacy information for students and applicants webpage."
        }
    ],
    "pdf_files": []
}