{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/applying/how-long-does-the-application-process-take.html",
    "content": [
        {
            "p": "You’ve submitted your application, but when will you find out if you’ve been accepted into your dream university? Unfortunately, there's no hard and fast rule when it comes to hearing back about your university application. However, we aim to respond within a couple of weeks, depending on your course. Here’s a rough overview of the application process and its timeline. This part of the process largely depends on your own time management. If you have the time and focus, you could have your application submitted within a few weeks, working to UCAS deadlines. As soon as you submit your application, UCAS will send it to your chosen universities. They’ll then decide whether to make you an offer or not. The journey your application makes once it's received by an institution varies slightly depending on both the university and the course, but typically it'll be seen by more than one pair of eyes – often by both general admissions staff and academic tutors. Depending on your chosen course, you may be invited to interview for your place. University interviews are used by admissions staff as a means of comparing applicants with a good chance of being offered places. Many Nottingham courses require interviews, however, not all courses need them. Additional length may be added to the application process if you receive an invitation to interview. We start making offers daily once applications open. All applications are processed in due course and can take anywhere between a few days to a few weeks after submission, depending on demand. UCAS gives universities deadlines for making offers, but you could also hear back before these dates: Learn about the application process Visit the university homepage If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}