{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/accommodation-at-uon.html?path=L2NvbnRlbnQvdW9uL2diL2VuL3N0dWR5d2l0aHVzL3Vnc3R1ZHkvYXJ0aWNsZXMvYWNjb21tb2RhdGlvbi1hdC11b24vamNyOmNvbnRlbnQvcm9vdC9jb250YWluZXIvY2Fyb3VzZWxfMTAyNTgyNTAyM18=&variant=c3RhdGlj&title=VG9wIHRpcHMgZm9yIGxpdmluZyBpbiBOb3R0aW5naGFt",
    "content": [
        {
            "p": "We bring our students together in a friendly, safe and vibrant community that creates a sociable and enriching living experience - and we can't wait for you to join us. Each of our halls and accommodation sites has their own identity, character and community – they are the perfect base for exploring your new life in Nottingham. Find the right accommodation for you Things to do before you join us Visit the hub if you're already living here. How to be a good neighbour and community support How we support you in halls and the events we run. Everything you need to know about life in halls Helping you to settle in and get the best out of your accommodation is what we do. You can find helpful guides for living in halls, and the support we provide for our students. Find your new home Hear what our students have to say about our campuses, and what makes each one unique. What's around University Park Campus? What's around Jubilee Campus? What's around Sutton Bonington Campus? Why not check out our helpful guides for what to bring or find out what it is like living in halls. Where you live is a big part of your university experience and for your protection we are accredited by the Universities UK/Guild HE Code of Practice for the Management of Student Housing. Accommodation at the University of Nottingham is supported by both university managed halls and privately managed halls. As such we adhere to both the UUK (Code for university managed halls) and ANUK (Code for privately managed halls) codes. If you want to know who is managing your site look for the Guild HE Code of Practice for the Management of Student Housing logo on our Halls webpages. Accommodation Our top tips and go-to list for university packing will ensure you are prepared and ready for a stress-free move to your home away from home. Get familiar with your university halls - from where to collect parcels to how to do laundry Here are some quick pros and cons of the main housing options available to students, including tips to pick the right one for you. UON Hungry? Don’t worry, there are plenty of dining options at the University of Nottingham. We’ll talk about the best places to refuel: on campus and in the city. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}