{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/central/your-essential-guide-to-accepting-your-offer.html",
    "content": [
        {
            "p": "Everything you need to know, from understanding your offer to accepting your place. Deciding where to study is an exciting time, but it can sometimes feel stressful, too. Don't worry, that's completely normal. We understand you may need some extra support to make your decision. That's why we’ve pulled together all the information you need, to make the process as simple and hassle-free as possible. International applicants should first read all sections on this webpage. Also see our 10 steps to obtaining your student visa from overseas. When you receive your offer to study with us, you’ll either have an 'unconditional offer' or a 'conditional offer'. Unconditional offer Conditional offer You can reply to all of your offers through UCAS Hub. UCAS also have detailed information on how to reply to your offers. You don't need to reply to any offers until all five of the universities or colleges you applied to have notified you of their decisions. Depending on when this takes place, you will have from one to five weeks to respond. Once you’ve logged into your UCAS Hub, there are three types of reply you can make. Firm acceptance Insurance acceptance Decline You are unable to go back and choose your firm and insurance choices when you get your results. Therefore, make sure you are happy with your choices when you reply! We will usually accept applications more than 12 months before the date of admission if there are good reasons. For example, if you will be gaining relevant work experience, spending time abroad to improve your languages, or need to secure a university place before being considered for industrial sponsorship. If you would like a deferred start date, please state your preferred starting date on your application form. You can request deferral through our enquiry form. Please include your full name and University of Nottingham ID number. The deadline to defer your offer to 2025 is one day after the latest date to register. For undergraduate courses this will be 15 October 2024. Requests for deferral will be approved at the discretion of the academic school or department. The maximum period allowed for deferral is one academic year. Please note that your academic qualifications must be valid at your revised start date. For offer holders whose first language isn’t English, your English Language qualifications/tests must also be valid at your revised start date. Applicants are considered solely on the basis of their merits, abilities and potential, regardless of gender, ethnic or national origin, age (subject to the university regulations on minimum age), disability, religion, sexual orientation or any other irrelevant distinction. To find out more take a look at our policies. The Quality Manual sets out the university's policies and procedures relevant to both the tuition and the supervision of all students. Applying Now you've received and offer from the University of Nottingham, there's a few tips we think will help as your prepare for the next steps. You've firmly accepted your offer, that's great news. We'll guide you through what's next. We consider applicants solely on the basis of their merits, abilities and potential – regardless of gender, ethnic or national origin, age (subject to the university regulations on minimum age), disability, religion, sexual orientation or any other irrelevant distinction. You’ve submitted your application, but when will you find out if you’ve been accepted into your dream university? If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}