{
    "url": "https://www.nottingham.ac.uk/studentservices/welcome/mynottingham-app/mynottingham-app.aspx",
    "content": [
        {
            "p": "Welcome information Access emails, academic timetables, hopper bus timetables and your meal card - all in one place. Get the most out of your university experience with the MyNottingham app. Download it below. If your IT account hasn't been activated yet, you'll start on the guest profile with limited features. Once you've activated your IT account and registered online with the university, switch to the student profile to access all features, including emails, timetables (when available), and your library account. Follow the steps below to switch your profile. Having trouble with the MyNottingham app? Check the FAQs below to see if your query is answered here. If you can't find the answer to your question, or want to provide feedback, you can: Before trying to log in with a username and password, please ensure that you have activated your IT account. Once you have done this, make sure you are entering your university username and password correctly. Your username will be a short combination of letters and possibly numbers (eg svtxx3) and is not your applicant ID, student ID or email address. Timetables are released at the beginning of each academic year - usually on the Wednesday during Welcome Week. If you don't see your timetable on the 'Teaching and exam timetables' tile, it's because it hasn't been released yet. Check the Timetabling webpage for release times. If you're still having trouble accessing your timetable once it's been released, submit a query via the Student Enquiries Centre. Please first ensure that you have activated your IT account and logged in with your university username and password. Your username will be a short combination of letters and possibly numbers (eg svtxx3) and is not your applicant ID, student ID or email address. If you are still receiving an error message, please refer to Moodle Help and Support. Please make sure you are entering your university email address rather than your username. If you're still unable to access your email, please report the issue to the IT Service Desk. This may be due to poor network connection. Please try again later. If you continue to receive this message, please try signing out and back again into the app. If the problem persists, contact cateringfinance@nottingham.ac.uk or call 0115 7484997. For further MealPass FAQs, visit the MealPass webpage. MyNottingham app will only allow you to view your balance and pay via the QR code. To enjoy the benefits and vouchers log on to your MealPass app. You can rearrange and personalise your homescreen using Grid Mode. In Grid Mode, you can drag and move tiles, and delete unwanted ones by tapping the 'Remove' icon in the top right corner of each tile. To return your homescreen to the default, tap 'Reset'."
        }
    ],
    "pdf_files": []
}