{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/sport-and-societies/connect-with-like-minded-individual.html",
    "content": [
        {
            "p": "If you’re searching for like-minded individuals or want to learn about fellow students from different walks of life to understand their university experiences, we have a range of social networks you can be part of. Our student community is incredibly diverse, comprising of a vast range of identities, backgrounds and lived experiences. Discover a few of the waysyou can get invovled when studying at Nottingham, below. The Women’s Network represents anyone who considers womanhood to be part of their identity inclusive of trans, non-binary and intersex inclusive people, and anyone who experiences oppression as a woman. The aim of the network is to create a safe and engaging space for students who identify as women through: Campaigning on issues affecting our members and furthering the equality of students who identify as women in the university environment. Organising various social events through interaction with women students and continually adapting to changing student needs. Supporting members by signposting them to various welfare and outreach programs in the Students' Union (SU), university, and wider Nottingham area. More information can be found on the SU website. The Black and Minority Ethnic (BME) Students’ network exists to provide a safe space within our SU. Self-identifying BME students can come together, discuss the issues affecting them, and campaign to improve their student experience. The aim of the network is to create a safe and engaging space for BME students through: The Disabled students’ network is a collective of fellow students you can go to for advice, support or just a chat. The network encourages cooperation, coordination, and collaboration to create an engaged supportive community in the Students’ Union for students with disabilities. Supporting activities and interaction between different Students’ Union groups. The aim of the network is to create a safe and engaging space for disabled students through: More information can be found on the SU website. The Mature students' network raises awareness of issues affecting mature students and promotes and protects the welfare of mature students. ‘Mature student’ refers to undergraduate students who are aged over 21 upon entry to university, and postgraduate students who are aged over 25 upon entry to university. The aim of the network is to create a safe and engaging space for mature students through: The International students' network is supported by the Student Union's part-time International Students' Officer. The officer works alongside an elected committee. All international or EU students are automatically considered members of the network. The aim of the network is to create a safe and engaging space for international students through: Coming out stories Grace, Myles, Rowan, James and Heather share their coming out stories with Craig Butterworth, co-chair of the University LGBTQIA+ Staff Network. The LGBT+ Network exists to represent all students studying at the University of Nottingham who do not conform to the heteronormative or cisnormative expectations of society (and therefore anyone who self-identifies as LGBTQIA+). This also includes questioning students and anyone who experiences any sort of queerphobia/bigotry. The aim of the network is to create a safe and engaging space for LGBT+ students by: As the Sports University of the Year for 2024 and top University in the UK for team sport, we offer an award-winning programme of sport, health and fitness opportunities for our students and community. Find out more about sports clubs, facilities and getting active here. We have around 300 sports, societies, movements and networks at the university of Nottingham. Click on the links below to find one that appeals to you. Campus and facilities Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities. Faculty of Engineering Discover what it's like to be a student in the Faculty of Engineering at the University of Nottingham. Faculty of Science Get inspired: everything you need to know about becoming a student in the Faculty of Science at the University of Nottingham. School of Computer Science Assistant Professor Stuart Reeves takes you on a tour of our School of Computer Science. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}