{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Architecture-BArch-Hons-U6UATTRE.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK Architects design buildings, spaces, the places in which we live and work; our homes, schools, sports buildings, theatres, hospitals, the environment in which we spend our lives. We work with both new build design and existing buildings with a focus on environmental sustainability. Our course will equip you with the knowledge to design spaces that improve our surroundings, making a positive contribution to our environment. Mandatory Year 1 Architectural Design Studio 1A People, Buildings, Landscape Integrated Design in Architecture Tectonics 1 (Structures and Construction) Architectural Humanities 1: History of Architecture Architectural Design Studio 1B Environmental Science for Architects 1 The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 22 August 2024. Due to timetabling availability, there may be restrictions on some module combinations. Hours needed: You will have 6 hours twice a week in Studio over the whole course. Taught Modules - Typical lectures hours are: Lectures finish early in Semester 2 in year 3 to allow for focus on Design Studio coursework. There are also additional lectures with invited speakers, academics and practitioners. Individual and group tutorials, group seminars and workshops are scheduled supporting taught modules throughout the year. You will spend time away from the university on field study trips and site visits. You will work independently between scheduled studio hours to progress design skills. You will complete independently coursework for all taught modules. You will also spend some time with our support teams, including: These teams monitor your academic progress and check on your wellbeing, help you reflect on feedback and act as a first point of contact for any guidance on academic or personal matters you may have. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2023, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. 87% in work or doing further study 15 months after the course. Data for Architecture (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Engineering Entry requirements AAA UCAS code K230 Duration 4 years full-time Start date Sep 2025 If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}