{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/English/English-with-Creative-Writing-BA-Hons.aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/222/6/0027(1/28)MQA/SWA0756 The University of Nottingham Malaysia has a very successful English School and is known globally for its international quality of teaching and research. The English School began its operation in 2013 and offers two high-quality undergraduate degrees: English Language and Literature & English with Creative Writing. Teaching and research areas within the School include various types of applied linguistics, systemic functional linguistics, Shakespeare and his contemporaries, 18th and 19th-Century literature, modern British and American literatures, world literatures in English, literary linguistics, sociolinguistics, corpus linguistics, metaphor studies, discourse analysis and creative writing. This programme will delve into the unique techniques of fiction, creative non-fiction, poetry, and playwriting genres. Students will have the chance to get feedback from peers and professionals in the industry. Students will also gain exceptional writing skills while getting insight into the writing process. The creative and analytical skills gained through this programme will enable you to develop high-level creative and analytical skills needed for academic and professional interactions. This module offers an introduction to key issues and skills in the discipline for those making the transition to studying English at the university level in the School of English at UNM. Whereas the other modules necessarily concentrate your attention within closely defined disciplinary boundaries (with a focus that is essential to learning specific skills and acquiring specialist knowledge), this module emphasizes points of intersection between the diverse disciplines contained within the study of English. Taught in small groups, students are encouraged to explore critically and reflectively what it means to be a student of English, and are supported in developing a toolkit of study, writing, critical thinking, theory, research and communication skills which can be transferred to other modules. This module introduces students to the process of writing fiction and creative non-fiction by engaging in a variety of forms of reading and writing practice. Activities include creative and analytical responses to published writing, writing exercises in fiction and creative non-fiction, and revision of work written over the course of the module. The content includes character, narrative, and point of view. This introductory module allows students to gain a broad and basic understanding of linguistics as an academic discipline. It is designed to equip students for further studies in the field of linguistics as a whole, and to develop individual specialisms in the future. Ideally, students should be well prepared to become more specialised in any of the areas covered, and take initial interests further. At the end of this module, students should be able to define the discipline, and the main pre-occupations of its sub-fields. Students will be expected to have developed an understanding of linguistic contrasts, from the phonological to the pragmatic level, and of the types of analyses open to students of those fields. This module introduces students to the core areas of linguistics, discourse, language acquisition, and pragmatics, focusing on several broad areas pertaining to linguistics and its methodological issues in phonetics, phonology, syntax, semantics, and pragmatics. This module introduces students to some of the core skills for literary studies, including skills in reading, writing, researching and presentation. The module addresses topics including close reading, constructing an argument, and handling critical material, as well as introducing students to key critical questions about literary genres, production and reception. These elements are linked to readings of specific literary texts, focused on poetry and prose selected from the 20th and 21st century literature. This module examines the influence of English as an international language. It provides students with an overview of the historical, literary, and social development of English including its spread as a global language through the processes of colonisation and globalisation. It also considers how English continues to evolve in the 20th and 21st centuries as an international lingua franca and focuses on its prominent role in global communications and as a resource for the shaping of identities and knowledge across the world. This module draws from a range of analytical approaches including historical linguistics, stylistics, sociolinguistics, multimodality, and globalisation theories. This is a full-year module that introduces students to a range of core texts in the literary canon from the medieval to 21st century. It aims to provide students with a background to the history of English literature and drama, and provide a broad overview of the key developments in terms of genre, subject matter, style and reception. Students will explore a range of texts including Beowulf and Dream of the Rood, and works from authors including Chaucer, Shakespeare, Wycherley, Henry Fielding, Laurence Sterne, Wordsworth, Jane Austen, Dickens, Wilde, and Virginia Woolf to twenty-first century novel and poetry. The authors will be situated within their socio-historic context, and we will consider the relationship between culture, history and literature. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Arts and Education is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Arts and Social Sciences. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as politics, the world economy, media and education. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. The creative, analytical and communication skills developed during an English degree will help the students face readily the changing demands of the 21st-century workplace. English graduates have a range of career choices open to them. Obtaining a degree in English and Creative Writing equips you with a diverse set of transferable skills, setting the stage for numerous fulfilling career paths. Here are some job opportunities directly related to an English and Creative Writing degree: Yes, upon completion of this course, you can consider pursuing postgraduate courses such as: Yes, UNM has various scholarships and financial assistance schemes for deserving students. This graduate programme offers a wide range of modules that cover various genres and forms of creative writing including writing for performance and poetry writing. These are designed to build a strong foundation in essential writing skills. Those who wish to pursue postgraduate degree in ‘English and Creative Writing’ may have an opportunity to specialise in a module of their choice. Yes, UNM often organises literary events, or creative writing showcases where students can share their work. There may also be opportunities to submit your writing to university publications or external literary journals. While prior writing experience is beneficial, it is not a requirement. The curriculum is designed to cater to students with varying levels of writing proficiency and provides guidance and support to help you develop your writing skills. Yes, UNM’s BA (Hons) English with Creative Writing programme prepares you for a career in writing and related fields. It equips you with the necessary skills to pursue a professional writing career in social media, publishing, marketing and more. Yes. UNM often organises guest lectures, author talks, or writing workshops where established writers or authors visit the campus to share their experiences and insights with students. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}