{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Media-Languages-and-Cultures/International-Communication-Studies-with-Film-Television-BA-(Hons).aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/321/6/0155(10/24)MQA/SWA0174 International Communications with Film and Television studies immerses students in the techniques, strategies and theories that drive movies and television globally. Hands on experience is a key component of this course, facilitating and pushing students to master what they’re learning through practice and reflection. Modules focus on the analysis, history, and cultural-political context of cinema and television; most also include at least one production assessment, where students create, film, and edit scenes in various styles and approaches. In the Documentary Approaches and Documentary Practice module in the third year, the final project involves short documentaries produced by groups of students who work together while learning to specialize in camera, directing, sound, or editing. A deep understanding of the “nuts and bolts” of media in both theory and practice gives students a hand up not only in the fields of advertising, content creation, criticism and beyond. It also offers those pursuing careers in film and television production a unique skill set that exceeds the scope of traditional filmmaking programs. Our facilities include up-to-date digital cinema cameras and accessories. Our Digital Media Lab provides an excellent post-production environment for students doing module assignments and practical exercises including filmmaking, audio and podcasting. We also offer students workshops for in-demand skills such as editing, sound mixing and colour grading. Of all the ICS majors, Film and Television studies has the strongest combination of theory and practice. It therefore offers students a greater flexibility in their skill sets, applicable to various areas of local and transnational media industries, including the fields film and television writing, production, and postproduction. With a broad background in cultural, social and political approaches to a variety of objects of study, however, Film and TV-stream students are not limited to media-related jobs. They choose a language and take all ICS core courses, and can thus apply their critical thinking and practical experience to numerous areas of the global economy such as non-governmental or activist organizations, journalism, diplomacy, and advanced scholarship Students will learn and practise the four skills of listening, speaking, reading and writing together with basic grammatical structures. This will enable them to manipulate the language and participate effectively in everyday social situations. Learning outcomes: Learning outcomes: By the end of the module, students should be able to: The module aims to introduce students to: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Arts and Education is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Arts and Social Sciences. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as politics, the world economy, media and education. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. An international communications degree is your passport to a variety of rewarding professions. Likely career fields include the audio-visual, digital and print media industries, marketing, production, public relations and research. Graduates with a passion for language can pursue interpreting, publishing and translation roles while others may continue their studies and pursue research and/or teaching degrees. Many of our graduates go overseas to work at universities in South Korea, Japan, China, and Europe. Some of our graduates have pursued postgraduate study at LSE, National University of Singapore, Mahidol University (Thailand), Oxford University and the University of Nottingham campuses in both China and the UK. This content was last updated on 09 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}