{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/our-campus-and-facilities/sutton-bonington-campus.html",
    "content": [
        {
            "p": "The University of Nottingham, Sutton Bonington, Leicestershire, LE12 5RD, UK Home to our veterinary and bioscience courses, Sutton Bonington Campus offers a student experience that's as unique as our students are. From sports to events and societies, and even a farmers market. Sutton Bonington Campus encompasses world-leading laboratories and specialist facilities for studying biosciences and veterinary medicine. The campus is home to over 2,500 students from the Schools of Biosciences and Veterinary Medicine, which creates a place where it’s easy to get to know your fellow students and teaching teams, yet part of a wider global community. Sutton Bonington is affectionately known as ‘SB’ to those that study, work and live here, which defines the culture and atmosphere. It is a relaxed and friendly place where you’ll feel at home, with access to help and support when you need it. The Guild is the dedicated campus Students' Union, run by students for students. They provide a varied calendar of events and student-led activities throughout the year. There are over 40 societies based at Sutton Bonington Campus to get involved in, from music soc, dance and SB players to climbing, lacrosse and biking. You can join existing sports clubs and societies or start your own. Our continued investment provides inspiring and dynamic spaces for you to study and learn. From the University Farm, Centre for Dairy Science Innovation and animal small holdings, to the paperless Super Lab, specialist glasshouses and food processing facility. You will find everything you need to enjoy student life and feel supported on Sutton Bonington Campus including: Student Services Hub, for welfare and support It’s easy to access other campuses using the free hopper bus that connects Sutton Bonington and University Park Campuses, and the Nottingham tram network. The University of Nottingham, University Park, Nottingham, NG7 2RD Campus and facilities Beyond a welcoming community, the facilities you’ll find at the University of Nottingham will provide you with the complete package for a great student experience. UON Hungry? Don’t worry, there are plenty of dining options at the University of Nottingham. We’ll talk about the best places to refuel: on campus and in the city. Jubilee campus The University of Nottingham, Wollaton Rd, Lenton, Nottingham NG8 1BB If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}