{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/find-uon.html?title=UmVjZW50bHkgdmlld2Vk&variant=cmVjZW50",
    "content": [
        {
            "p": "Browse our undergraduate prospectus or answer a few questions and we'll help you find relevant study options, tailored information and advice before applying to become a student at the University of Nottingham. 1st Sports University of the Year 2024 (Times, Sunday Times, Daily Mail) 3rd in the UK for top employers (High Fliers Graduate Report 2024) Top 20 UK university (QS World University Rankings 2025) Open days are a great way to learn more about your course, meet academics and chat to students. They also help you to get a feel for the place, so that you can decide whether life as a Nottingham student is right for you. Explore our University Park Campus University Park is the University of Nottingham’s largest campus at 300 acres. Part of the University since 1929, the campus is widely regarded as one of the largest and most attractive in the country The University of Nottingham, University Park, Nottingham, NG7 2RD Jubilee campus The University of Nottingham, Wollaton Rd, Lenton, Nottingham NG8 1BB Sutton Bonington campus The University of Nottingham, Sutton Bonington, Leicestershire, LE12 5RD, UK Student experience We are Nottingham. Locally rooted, yet globally connected, we are the heart of the UK. One destination with endless possibilities. One beating heart with a desire to drive change Applying Interested in undergraduate study at Nottingham? Here's our guide to submitting your application. Although the majority of our applicants will have A levels, we welcome and value a wide range of alternative qualifications. If you want to find out more about our entry requirements, it's time to read on... We consider applicants solely on the basis of their merits, abilities and potential – regardless of gender, ethnic or national origin, age (subject to the university regulations on minimum age), disability, religion, sexual orientation or any other irrelevant distinction. You’ve submitted your application, but when will you find out if you’ve been accepted into your dream university? Scholarships and bursaries Discover information that may help you fund your study at the University of Nottingham. Disability support We are here to support the University community in creating an inclusive and equitable teaching and learning environment to the benefit of all students. Our specialist service provides student-led support to enable disabled students to flourish as independent learners. We are here to help you if you have a disability, mental health difficulty, long-term medical condition, autistic spectrum condition, or a specific learning difference such as dyslexia, dyspraxia, dyscalculia or ADHD. Study abroad The majority of University of Nottingham students have the opportunity to have an international experience during their university career. Nottingham has 200 university partners in 40 different countries spanning six different continents across four different exchange programmes. These include Inter-campus exchange, International exchange and International summer schools. Centre for English Language Education The Centre for English Language Education helps develop your academic and language skills before you start university, preparing you for the demands of academic study in a range of disciplines at all levels. We also offer academic language and communication skills support during your studies. Nottingham and Nottinghamshire Nottingham is considered to be a generally safe city, with low crime rates, find out more below. The city has many highlights if you consider studying at the University of Nottingham. Here are the \"hidden gems\" students should know about when visiting Nottingham. Find out more about Nottingham and what the city is famous for. Information to support your application Browse our frequently asked questions Need more help? Supporting your child's university decisions We're Sports University of the Year 2024 Make an enquiry with our team of support staff Explore University Park Campus and discover our award-winning green spaces, iconic Trent Building, impressive libraries, boating lake and loads more on one of our student-guided tours. Find out more > Widening participation Imagine and create your future. Join our programmes to take part in activities to inspire, support and inform your higher education experience. Don’t let your background determine your destination – write your own story. Clearing Your guide to helping a student to navigate Clearing – as a parent, guardian, family member, teacher, school counsellor or education agent. Take your first step into a world where the exceptional happens. Find out how to apply to study at the University of Nottingham. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}