{
    "url": "http://www.nottingham.edu.my/Study/Offer-acceptance/index.aspx",
    "content": [
        {
            "p": "To keep your offer open, we must receive a response from you within the deadline. This is typically a 4-week deadline, but we may set an earlier deadline for late applications, such as when the registration date or visa application deadline is approaching. Deadline to accept your offer You are required to pay a non-refundable course deposit at the point of accepting your offer. The non-refundable course deposit is an advance payment to the University in order to secure a place on all our courses except for postgraduate research. Accept your offer and pay your course deposit After accepting your offer, international applicants can proceed to apply for a visa to study in Malaysia. We can waive the course deposit requirement for students whose fees will be fully paid by a recognised sponsor, upon receipt of appropriate evidence. If you are fully sponsored for your course fees, please send a copy of your sponsorship letter, quoting your full name and Nottingham ID number to: sponsorship@nottingham.edu.my You must provide this before the stated deadline for your deposit. The University will only accept sponsorship letters from recognised sponsors (overseas governments, international businesses, universities, trusts and charities, etc.) and not from friends or family members. If your family will pay your tuition fees, you or your family must pay the deposit. If the University has not received the deposit by the stated deadline, your offer for a place will expired. It is essential that you have funds for your course deposit before applying. If you have not paid the deposit before the deadline but you are still interested in studying our course, you will need to reactivate the offer. Please email the Admissions Office before or by the application deadline stated for your programme. We will strictly not entertain requests to reactivate your offer after the application deadline. The offer may be reinstated at the University's discretion, depending on various factors. If all places on the course have already been filled, or if it is too late to reactivate your offer due to ongoing classes or, for international applicants, if the visa deadlines have passed, we regret to inform you that we will be unable to restore your offer. The University will refund the course deposit (minus bank charges) under the following circumstances: Visa refusal If your visa application is refused, we will usually be able to refund your course deposit. If the refusal was due to fraudulent documentation or conditions which you could have foreseen (as determined by University), you will not be eligible for a refund. You must provide official evidence of your visa refusal. Unable to meet offer conditions If you have been unable to meet the conditions of your offer, you will be eligible for a refund, but you must provide evidence that you have attempted to meet those conditions (e.g. academic results or English language test results) which will be assessed by the University. If you have not attempted to meet your conditions, you will not be eligible for a refund. In short, refund of the tuition fee deposit will only be considered once you have obtained a letter of rejection from the University. Suspension of programme In the unlikely event that the degree programme is suspended, you will receive a refund of your deposit. Refund requests must be strictly submitted online on or before 30 October in the calendar year in which your offer was made to be considered. Online Refund Request for Course Deposit Deferrals are not automatically granted and you may need to meet certain conditions or requirements before we can approve your request. Deferral requests will be considered by the university and are not guaranteed. You can ask to defer up to one calendar year. Decisions are usually confirmed once offer details for the following year are available. The conditions of your offer can change subject to the deferred year entry requirements. You will need to pay the course deposit before a new deferred offer can be issued. Please note that the tuition fee for each academic year will differ, and the new tuition fees will apply to applicants and offer holders who have applied for deferred entry to a new academic year. Defer your offer If you have accepted, declined, or your offer have expired, please email Admissions Office to request for the manual deferral request form. Similarly, if your application status in NottinghamHub portal is ‘Matriculation’, you will need to apply for the deferral manually. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/Deadline-to-accept-your-offer.pdf",
        "pdf_files/Accept-your-offer-and-pay-your-course-deposit.pdf",
        "pdf_files/Defer-your-offer.pdf"
    ]
}