{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/social-sciences/a-day-in-the-life-of-an-education-student.html",
    "content": [
        {
            "p": "From communities and societies to field trips and volunteering projects, find out what it's like to study education at the University of Nottingham As a prospective education student at the University of Nottingham, we want to share some insight into what your days might look like while you study with us. You’ll have the opportunity to immerse yourself in both academic and social aspects of your course, building connections and finding like-minded, lifelong friends while you get a world-class education degree. We'll take a look at some of the different experiences you'll be able to get involved in, including: Your typical university day might include activities with the Education Society, like taking part in their book club, volunteering or going to a social event. The society provides a space for you to get academic support, meet new people, share ideas and build transferable employability skills. We asked first-year student, Pippa Oldacre, to share her experience of meeting her new classmates during our induction week. Pippa Oldacre BA Education If you decide to join our Learning Community Forum (LCF), you could become a course representative, with the opportunity to influence academic life. Second-year students, Annie Shepperson and Emily Pearce explain what’s involved in being a course representative. The LCF allows a strong link of communication between staff and students and forms relationships that allow anything to be said, and nothing to be ignored. We’ve seen the positive effect of having a student representative interact with staff. Issues that are raised are resolved quickly after the meeting, meaning we can share this with other students across the years to keep them in the loop. Annie Shepperson and Emily Pearce As part of your 'Joining the Academic Community' module, a day as an education student might include a field trip. Our students recently visited St Anns Community Orchard to explore collaborative and experiential learning in an outdoor environment. The day involved a number of team-building activities on the beautiful orchard site set within the historic Hungerhill Allotments. Activities included: Volunteering could be one of the most rewarding ways you could spend a day as an education student. You’ll also gain real-world experience and expand your skill set for life after university. First-year student, Fatima Suleman, wanted to gain some more experience working with children in an educational setting to prepare herself for the placement module in year two. So far I've completed three sessions with my mentee and I've found it to be a very rewarding experience. I can offer support with what they want to do, and I can also develop skills such as problem-solving and communication through working with them. Fatima Suleman School of Computer Science Assistant Professor Stuart Reeves takes you on a tour of our School of Computer Science. Student experience Discover more about the societies, sport and networks at our Students' Union International students As an international student we understand you have even more to think about as you prepare to start with us at Nottingham.This section is dedicated to you. We cover all the extra bits you need to know as an international new starter, from applying for your visa to deciding what to pack, and how to plan for your journey. School of Mathematical Sciences From quantum physics and coding to gymnastics society and pub golf. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}