{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Politics-History-and-International-Relations/School-of-Politics,-History-and-International-Relations.aspx",
    "content": [
        {
            "p": "Opened in September 2010, the School of Politics, History and International Relations (PHIR) provides the University with a unique research-hub in the fields of political science, international relations (IR) and history, located in one of the politically most dynamic regions of the world. The principal focus of our activity lies in the provision of graduate-level teaching, doctoral and post-doctoral research and interacting with governments, civil society bodies and international organisations located in Malaysia and the region. In keeping with the nature of our discipline, we recruit staff from across the world. All members of staff are active researchers, pursuing cutting-edge, policy-relevant and curiosity-driven research across a broad spectrum of ‘IR’, comparative politics and international history. The results of their findings are published in some of the leading journals and academic presses, and frequently help shape national debates and policy decision-making. In our research and teaching activities we routinely draw on the resources of our associated schools in the UK, the School of Politics and International Relations and the School of History, and the Division of International Studies at The University of Nottingham Ningbo, China. This global network gives our staff and graduate students access to a team of researchers that forms one of the largest concentrations of IR and politics scholarship in the world. The School hosts its own ‘Nottingham International Affairs’ seminar series in which academics and practitioners share their research findings and work experience in the areas of IR, development, politics and foreign relations. The series culminates in a prestigious annual lecture: last year delivered by the EU Ambassador to Malaysia. The school’s student society, PHIR-NOTT, supplements these formal activities with its own round-table discussions, study-trips and social events. Our graduate students frequently take advantage of the range of intellectual opportunities made available in the various research institutes, embassies and international organisations located in Kuala Lumpur and the region. Many of these institutions contribute to the school’s internship programmes, which provide students with real-work experience in areas of international affairs, media, politics and development. The school has established itself as one of the premier centres for the study of politics, history and international relations in the region. We provide a dynamic learning environment that offers you the opportunity to stretch and test yourself, to question assumptions and contribute to the way we understand, conceptualise and engage with global political phenomena. Yes, a Master’s in international relations can be worthwhile for individuals interested in understanding global politics, diplomacy, and international affairs. Students will gain a deep understanding of complex international issues, enhance analytical skills, and have networking and career advancement opportunities. However, the degree's worth also often depends on individual career aspirations and how the knowledge gained aligns with personal and professional goals. International relations is a field that attracts individuals interested in diplomacy, international law, global governance, security studies, humanitarian efforts, and fostering international relations among countries. As such, some reasons people study international relations are: To gain insights into global affairs. Understand geopolitical dynamics. Analyse international conflicts and cooperation. Explore cultural exchanges. Comprehend the impact of international policies and events on nations and societies. The difference between an MA (Master of Arts) and an MSc (Master of Science)in International Relations often lies in the emphasis on curriculum structure rather than the subject matter. Usually, an MA programme in International Relations might focus more on humanities, social sciences, theories, and qualitative analysis. An MSc programme may emphasise quantitative analysis, data-driven methodologies, and scientific approaches to understanding international relations. This distinction can vary between institutions. However, the core content of both degrees usually covers similar topics related to international politics, history, diplomacy, and governance. Politics, History, and International Relations postgraduate programmes offered by UNM include International Relations MA International Development Management MSc Yes, UNM offers various scholarships, grants, and financial aid options for eligible postgraduate students. Prospective students will require a relevant second-class honours degree or equivalent from an approved university. An interview may also be needed. Please refer to the specific programme page for detailed information. Some of the extensive research opportunities for postgraduate students in this department include collaborating with faculty on ongoing projects, conducting independent research, and presenting findings at conferences. Yes, our postgraduate programmes offer part-time study options to accommodate working professionals. Part-time studies require two years, while full-time studies take one year. Graduates can explore careers in academia, international organisations, government, NGOs, public policy, journalism, diplomacy, research, and more. Yes, UNM encourages global exposure and offers opportunities for international exchange programmes, research collaborations and study abroad experiences with partner institutions. Our programmes offer a unique interdisciplinary approach, a supportive academic environment, access to cutting-edge resources, and opportunities for practical engagement in global issues. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}