{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/medicine-and-health-sciences/day-in-the-life-of-a-health-sciences-foundation-student.html",
    "content": [
        {
            "p": "We spoke with Daniel, who explains what life is like as a health sciences foundation student. University is an exciting time. You’re getting stuck in on placement, being taught by passionate academics, and building the knowledge you’ll need for an exciting career. But university is not just about studying. It’s also about meeting new people and trying out new things. That’s why we’ve asked Health Sciences with Foundation Year BSc student, Daniel to share more about his journey to university and what a typical day looks like. Daniel is a mature student, returning to uni after spending 10 years building his career in the energy industry. His journey to university may be slightly different to yours, but this is a good example of how your day may look like as a student. After developing my career within Data Science for 10 years in the energy industry, like many, I had a lot of time to reflect on my direction in life during the Covid-19 pandemic and whether the career I fell into truly reflected my passions. Looking back to my school years, I did not make the right choices with my A Levels the first time – and that’s OK. It set me on a path to develop myself professionally and I have gained a huge amount of practical and professional skills and qualifications to set me in good stead when I considered applying to university. I found that the University of Nottingham appreciated these skillsets when applying, and had the right route of entry through a Foundation year to help me get back up to speed with the knowledge required to progress onto a science-based degree. Being originally from Nottingham, I already had a lot of exposure to the campus. Frequently as a child, I was taken to Highfields Park and enjoyed the same facilities and grounds which are still there today. It made sense to put the University of Nottingham as my first-choice university, as I already had a massive appreciation for all the sentimentality that came with it. I had some apprehension about joining the university. Would I fit in? Am I suitable? Am I capable? I quickly realised after Welcome Week that these apprehensions were hogwash, and I found the amount of support available, should you choose to take it, not only easily accessible but ample and extremely valuable. You can see me on most days attending my lecture activities and filling out the gaps in my day in the various libraries across campus, making use of that time to get post-lecture materials such as problem sheets done or working towards completing any coursework. It’s really important, I’ve found, to give yourself well-deserved breaks. Walking around the campus and grounds is a good way to freshen your mind! Some other activities I’m involved in include representing the Sutton Trust at various schools and colleges around Nottinghamshire, where I talk about making the most of the opportunities presented to you to help you succeed in your short-term and long-term goals. I have taken my own advice and made the most of opportunities presented to me, such as being a course representative, where I collect feedback and make real differences to improve the lives of students. I cannot think of a better place to have chosen to study, than the University of Nottingham. - Daniel, Health Sciences with Foundation Year student School of Health Sciences At Nottingham, around 50% of your course is practice-based. Giving you the chance to gain real-life clinical experience of midwifery care. Faculty of Arts Discover what it's like to be a student in the Faculty of Arts at the University of Nottingham. Faculty of Medicine and Health Sciences Follow Luke as he takes you around our campus, including our state-of-the-art David Ross Sports Village, practical lab sessions and his favourite study spaces. Student experience If you’re searching for like-minded individuals or want to learn about fellow students from different walks of life to understand their university experiences, we have a range of social networks you can be part of."
        }
    ],
    "pdf_files": []
}