{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/postgraduate-research/thesis-submission.aspx",
    "content": [
        {
            "p": "You are required to submit a thesis for examination after your period of registered study and before the conclusion of the thesis pending period. Your thesis should be submitted to the Nottingham ePrints service and must be the result of your own work, done mainly while you were registered as a researcher of this university. Student Services will work with your supervisors in preparing the thesis to be sent for examination. The information on this page will signpost you to the different processes, policies and detailed instructions on submission. More detailed information can be found in submission pack. The word limit for your thesis depends upon the qualification you are working towards: PhD theses should not exceed 100,000 words MPhil theses should not exceed 60,000 words Please note, the word limits for MRes theses vary according to the number of taught module credits taken. Please see our quality manual regulations for MRes and supplementary regulations. For PhD and MPhil, the word limits are inclusive of appendices, footnotes, tables, and bibliography. For Mres, bilbiography is not included in word count. In any case, the university may withhold a thesis that exceeds word limits from examination. A proof-reader may only ensure that the meaning of the author is not misrepresented due to the quality and standard of the English used. This can include correcting spelling and basic grammar errors. Inaccuracies in academic content should not be corrected nor should the structure of the piece of work be changed; doing so may result in a charge of plagiarism. You should submit your thesis in pdf format to the Nottingham ePrints system. Your thesis should be presented on A4 size, normally with a size 12 font. There should be a margin of at least 4cm on the left side of the page, both for typescript and diagrams, to allow for binding (if required). Other margins should be of at least 2.5 cm. You can download an example UoN thesis template for the cover sheet The structure of thesis chapters may vary, students can view copies of previously submitted work on ePrints for ideas on the chapter structure of the main body of text, and are encouraged to discuss the most appropriate format for their research with supervisors. Alternative formats for submission may apply. For certain doctorates (music, creative writing, drama and performance practice as research, translation studies) an appendix detailing submission requirements is available. For more information, please visit the university's quality manual for further guidance. You are also allowed to submit by published works, please consult your supervisor and also refer to the university guidance in the quality manual. Quality manual alternative formats guidance You are required to submit your thesis for examination by the submission deadline notified to you during your course of studies. In exceptional circumstances, you can apply for an extension to your submission deadline, in line with the extension to thesis pending policy in the quality manual. If your submission deadline falls on a non-working day then you are permitted to submit on a first working day after this deadline. Also see the key dates for graduation guidance. Please note, even when they have been correctly observed, no guarantee can be given that the necessary examination procedures will have been completed in time for a candidate to graduate at the next degree congregation. Extension to thesis pending form Quality manual thesis pending policy You are required to submit a thesis for examination before the conclusion of the thesis pending period. You must formally notify your school at least three months prior to your intended submission date. The school should ensure that Student Services are informed so that the procedure for appointing examiners can be initiated. Any delay in submitting your Notification of Submission form can lead to a delay in your examination. Visit the examination webpage for more information on the examination process. Your supervisor’s signature on the Notification of Submission form acts as confirmation that: the thesis is the result of work done mainly while you have been registered as a researcher of The University of Nottingham you have been given appropriate plagiarism guidance you have been advised on thesis embargo and/or restriction if appropriate to your discipline, you are aware of the requirement to submit all data collected during the period of study as a researcher of this university, to your School prior to arrangement of the viva voce examination. Upon receipt of your completed form, Student Services will ask your school to nominate examiners. When approved, we will email you with the names of your examiners, asking you to declare any possible conflict of interest. Notification of submission form You are required to submit your thesis for examination by the submission deadline notified to you during your course of studies. Full time doctoral researchers submitting a thesis after this deadline, without receiving formal approval from the university for an extension of time, will be permitted to submit up to 12 months after their latest submission date as long as the maximum period from initial registration has not been reached. Once the work has been submitted the late submission fee for each month or part month (as per the university fee schedule, please see under Postgraduate Research – Exceptional Fees – Current Academic Year) that passes between your expected submission date and the date that your thesis is actually submitted will be raised and is payable immediately. For researchers who are not on doctoral programmes, or who are not full time, or for whom this is not the first submission, there is no recourse to submit a thesis late and an extension to thesis pending must be requested. Quality manual policy on extension to thesis pending Quality manual maximum period from initial registration Your thesis should be submitted to the Nottingham ePrints service in pdf format and must be the result of your own work, done mainly while you were registered as a researcher of this university. Student Services will work with your supervisors in preparing the thesis to be sent for examination. Notitngham ePrints is the used to store your first submission, as well as corrections and/or re-submission. Once the degree has been conferred, your final version will be retained for publication in the repository, all previous drafts will be removed. For detailed instructions, please visit the uploading your thesis webpage. You are not routinely required to use Turnitin prior to thesis submission. However, you are strongly recommended to discuss this with your supervisory team for their recommendations for best practise within your area of research. Your submission will be checked by the Student Services team. Once initial processing is complete, the Student Services team will write to confirm receipt of your thesis. Your thesis will then be stored securely in a local drive so that it can be shared with your examiners. It will then be removed from Nottingham ePrints. Doing so generates an automatic ‘Item Destroyed’ message, please do not be alarmed. First submissions, corrections and re-submission will be forwarded to examiner(s) for examination and/or final approvals. The final version will be retained for publication in the repository, unless you indicate a different preference. For detailed instructions, please visit the uploading your thesis webpage. In most cases, your thesis will be published in the University’s online library when you have graduated. Exceptions apply, such as embargo and thesis restriction, the distinction and process for application is explained below. You should discuss these options with your supervisor. You may wish to delay online publication of the full text by requesting an embargo period, of up to two years* to allow publication through alternative channels. Please note: If you wish extend the embargo beyond the initial period, please enquire by emailing UA-etheses@exmail.nottingham.ac.uk. For embargoed theses, the full text is not publicly available but the bibliographic details (author, title and abstract) are discoverable and available to read. You must request embargoes when submitting the final draft of your thesis to Nottingham ePrints. Creative writing researchers may apply for an extended embargo of up to seven years. The University Senate may fully restrict theses in special cases- where a thesis includes work which is politically, commercially or industrially sensitive.Theses may be restricted for a period of two years from conferral of the degree, if requested to do so. Thesis restrictions may be applied for by completing the application for restriction form below. Where the restriction is contractually obliged, the documentation should be appended to the application form. For more information visit the quality manual. Application for restriction form Quality manual application for restriction policy"
        }
    ],
    "pdf_files": []
}