{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Education/School-of-Education-Research.aspx",
    "content": [
        {
            "p": "The School of Education provides an exciting and rewarding learning experience with a global view. We are committed to providing a quality education to students from around the world. As one of the leading centres for research in education we have contributed to the improvement of social justice and equality in education. The field of education is dynamic, with evolving pedagogies, technologies, and societal needs shaping its landscape. Here's why you should consider taking up an education research course at UNM: Global perspective: With links to Nottingham's UK and China campuses, you'll gain a comprehensive understanding of educational challenges and solutions from a global context. Diverse research areas: From interdisciplinary research to educational leadership, our broad spectrum of research areas ensures that you can delve deep into your area of interest. Collaborative environment: Engage with experts from various disciplines, fostering a holistic and interdisciplinary approach to research. Impactful research: Our commitment to social justice and equality means that your research can make a tangible difference in educational practices and policies. The School of Education at Nottingham is a leading centre for research in education, with a broad commitment to improving and investigating social justice and equality in education. In the latest Research Assessment Exercise (RAE) we were ranked sixth out of 82 education departments in the UK. We have developed three major research agendas that build not only on the strengths of key researchers, but also the research activities of the academic staff as a whole. These overlapping research agendas cover research for and about: staff include: Graduates from the School of Education, especially those with a research background, are equipped to take on roles in various sectors. Potential career paths include: Educational Consultant Policy Analyst Curriculum Developer Academic Researcher Teacher/ Educator Educational Technology Specialist Education Administrator Learning and Development Specialist Special Education Researcher Community Education Officer Yes, various research grants and scholarships are available. Students are encouraged to discuss these opportunities with their supervisors. Yes. The School of Education at UNM has ties with local educational institutions and communities, providing ample opportunities for community-engaged research. The School regularly reviews and updates its research agendas based on global educational trends, ensuring that our research remains relevant and impactful. Yes, the School of Education at UNM regularly organises workshops and training sessions on various research methodologies, tools, and software to support researchers. Yes. UNM encourages collaborations across its campuses, allowing researchers to gain diverse perspectives and insights Jalan Broga, Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}