{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/visa-help/student-route/duration.aspx",
    "content": [
        {
            "p": "Our guide to how long you can stay in the UK on your student visa. Your visa start and end date depend on your course dates and academic level. As well as the study period, your visa should include a 'wrap-up period' after the completion of your course, when you can remain in the UK for travel, work, leisure, to attend your graduation, or to make a new visa application. Below degree level: foundation course or presessional English course If you are applying for your visa from overseas, and it's for an academic course of six months or more or a pressessional English course of any duration, you can enter the UK a maximum of one month before your course start date – or seven days before your intended date of travel as stated in your application form, whichever is later. If your course is for less than six months and not a presessional English course, you can enter the UK up to seven days before the course start date. The visa durations listed above are the typical dates of validity under the UK's student visa policies, but occasionally student visas are granted for different periods. Your visa decision letter and biometric residence permit (BRP) or vignette (if visa is less than 6 months) will confirm the exact dates of your visa validity, so check these when you receive them. If you think that visa has been issued with incorrect dates, you should contact our Visa and Immigration team on immigration-support@nottingham.ac.uk for advice as it is important to get it corrected if an error has been made. BRP holders studying a course of 12 months or more will see their BRP expiry date is 31 December 2024 as UK Visas and Immigration are moving all visa holders to digital status in 2024. UKVI have informed us that they expect to update their information on how to prove your immigration status digitally in early 2024. You do not need to do anything and your immigration status will not be affected. You MUST check your visa decision letter or email for the true end date of your visa. If you are taking a presessional English course at our Centre for English Language Education (CELE) before studying a masters degree course at Nottingham, and you have met the UK's minimum English language requirements as well as our academic requirements, we may be able to issue you a combined CAS or 'joint CAS' for both courses. Your visa will then cover the presessional English course, the masters course and a wrap-up period. In other cases where you plan to study more than one course in the UK – such as a presessional English course followed by a degree course, or a foundation course followed by an undergraduate degree course – you will need to extend your visa after successfully completing the first course. If you will study more than one course in the UK, make sure that you don't exceed the time limit for student visas. For most students, there is maximum period of five years in which you can remain in the UK on a student visa while studying degree level courses (RQF level 6). This limit applies to visas issued under the previous 'Tier 4' rules as well as newer Student route visas. There are exceptions to the five-year rule for degree courses in architecture, medicine and veterinary medicine, due to the longer duration of these courses. There are no longer any time limits on study at postgraduate level (RQF level 7) and above, but academic progression rules still apply (see below). When we are preparing your CAS for a student visa application, we may send you a questionnaire if you have studied in the UK before, to make sure that you won't exceed the time limit. You must answer this accurately as your visa could be refused if you don't declare details of previous study. If you are extending your student visa within the UK to begin a new course, this must demonstrate academic progression as defined in the Student route rules – usually meaning that it must be at a higher level than your previous course. For example, this can include progressing from a foundation course to undergraduate degree course, from a bachelors degree to a masters programme, or from a masters to a PhD programme. You may be allowed to study another course at the same level as your previous course in some circumstances, and this will be assessed alongside any relevant time limits when we handle your application for that course. Your visa expiry date is very important and if you stay in the UK beyond this date without applying for a visa extension, you will be classed as an overstayer – which means that you are in the UK without immigration permission. Overstaying your visa is a criminal offence. If you overstay by more than 30 days you will usually be barred from coming back to the UK for at least 12 months. If you are extending your student visa, applying for a graduate visa or applying for a different kind of visa to remain in the UK, you must do this before your visa expires and you become an overstayer. In very limited circumstances it is possible to apply for a student visa extension in the UK within 14 days of becoming an overstayer, but only if you can demonstrate a good reason beyond your control why you could not apply before the visa expiry date. The Visa and Immigration team will make an assessment of your circumstances in line with the limitations on immigration sponsorship policy."
        }
    ],
    "pdf_files": []
}