{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Chemical-Engineering-with-Environmental-Engineering-including-an-Industrial-Year-MEng-Hons-U7UCEEEIY.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK Through combining chemical with environmental engineering, you will design processes and products that minimise impacts on air, land and water. As a chemical and environmental engineer you will work with the following areas: Mandatory Year 1 Fundamentals of Engineering Design Fluid Mechanics Chemistry for Engineers Process Engineering Principles Mathematical Methods for Chemical and Environmental Engineering Introductory Geology Thermodynamics and Heat Transfer The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Monday 19 February 2024. Due to timetabling availability, there may be restrictions on some module combinations. On average, you will have around 20 contact hours a week in year one and two. Combined with coursework and self-study, you may spend over 40 hours a week on your studies. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2023, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. I really enjoy the challenges and breadth of content in my course. We are taught the fundamentals of chemical processes and the theory behind their execution on an industrial scale, and then get to use this knowledge within design projects in a manner similar to that which employers would expect in industry. Andrew Shaw 87% say staff value students views and opinions about the course Data for courses in Chemical, process and energy engineering at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Science Entry requirements AAA-AAB UCAS code F103 Duration 4 Years full-time Start date Sep 2025 Faculty of Engineering Entry requirements AAA UCAS code H200 Duration 4 years full-time UCAS code H810 Duration 3 years full-time If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}