{
    "url": "https://www.nottingham.edu.my/Study/Postgraduate-courses/Computer-Science/School-of-Computer-Science.aspx",
    "content": [
        {
            "p": "Computing professionals are the architects of the new information age. Affordable high-tech devices have created an environment rife with both challenges and opportunities. With these challenges come great opportunities; which are waiting to be explored by highly-trained computer science graduates. Your learning is supported by a number of activities, which may include lectures, laboratory sessions, small group tutorials, problem-solving classes and coursework. Research related project work is an important part of all our degrees. Computer science constantly changes, and our programmes are taught by people carrying out world-class cutting-edge research, which influences our curriculum. This provides a strong set of core topics and a choice of options in both fundamental and applied computing. employable graduates and provide the basis for rewarding and lucrative careers. The School of Computer Science undertakes world-class research, and our teaching staff at the Malaysia Campus consist of both local and international academics. Our research was ranked in the top 10% of UK Institutions in the latest Research Assessment Exercise (RAE), with 80% of our research activity rated as world class or internationally leading. The main focus of our research lies in the development of various intelligent systems and computational techniques with applications to a range of real-world problems. Our multidisciplinary research includes areas in computational intelligence, computer vision, human-computer interaction, operational research and simulation and modelling. The research conducted within the school is generally encapsulated by the aims and scope of the Computing in Health (CiH) research group, which is linked to several University-wide priority areas. CiH complements the research themes pursued at the UK Campus, but also takes full advantage of the specific research expertise of staff involved in cross-campus co-supervision of research projects. Yes, the University of Nottingham Malaysia offers various scholarships and financial assistance opportunities for eligible students. The School of Computer Science covers a wide range of research areas in its postgraduate programmes. These include artificial intelligence, data science, machine learning, cybersecurity, software engineering, computer vision, robotics, and more. The department has experienced faculty members and well-equipped laboratories to support research endeavours. Yes, the Computer Science postgraduate programmes at the University of Nottingham Malaysia are open to both local and international students. A postgraduate degree in Computer Science opens up many career opportunities. Graduates can pursue careers as software engineers, data scientists, artificial intelligence specialists, cybersecurity analysts, IT consultants, research scientists, and more. The skills and knowledge acquired during the postgraduate programme enhance employability prospects in various sectors. Yes, the School of Computer Science offers specialised research opportunities like: Image processing and computer vision Artificial intelligence and applications Human-computer interaction and ubiquitous computing Software engineering and E-learning These specialisations provide focused knowledge and skills in specific areas of computer science. Yes, the School of Computer Science encourages students to gain practical experience and industry exposure during their postgraduate studies. They may have opportunities for internships, industry projects, or collaborations with local and international organisations. These experiences can enhance practical skills and provide valuable networking opportunities. Yes, postgraduate students in the School of Computer Science often have the opportunity to work on their own research projects. They can explore topics of their interest within the computer science field, under a faculty advisor's supervision. This allows students to develop their research skills and contribute to advancing knowledge in their chosen area. The School of Computer Science at UNM provides various support services to postgraduate students, including academic advising, research supervision, career guidance, and counselling services. Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}