{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/accommodation-at-uon/8-tips-for-choosing-the-right-student-accommodation.html",
    "content": [
        {
            "p": "Here are some quick pros and cons of the main housing options available to students, including tips to pick the right one for you. The results are in and you’ve accepted your spot at the University of Nottingham - we are so excited to welcome you! Time to celebrate and relax, right? Before you pop the champagne, you may want to consider the important matter of choosing which of our halls to live in for your first year away from home. We know there are loads of options so we're here to support and guide you. We’ve created this list of our 8 top tips to help you make the right choice. Location is arguably the most important factor when choosing the right student accommodation to suit your needs. We highly recommend mapping out the area you want to live in, based on a few key factors. Let’s be honest – what are the chances of you making your 9 am lecture if it involves getting up at the crack of dawn to get organised and jumping on a tram or bus to get to class? That’s what we thought! In your first year there will probably be a few late nights, so if this is your first time living away from home, organising your time and schedule might be a learning curve. The closer to your campus you are, the better, so make sure you find out where your classes are based. To further narrow down your choices, think about what’s really important to you. It might be the proximity to nightlife, or maybe you’re an avid runner and want to be close to parks/running routes to stretch those legs. Top tip: create a list of the ideal area you'd like to live in. This might include things like: You can then check which halls cross off the most on your list! Are you a social butterfly, ready for late nights and parties til’ dawn, or are you a morning person, and your idea of a great night ends with you tucked in bed with a good book before 10pm? If you resonate more with the latter, consider our quieter accommodation options. Deciding how much personal space you need will help narrow our accommodation options, so do some research and use the filters on our accommodation page. For example, is en-suite a non-negotiable? If so, you can cross off all the student accommodations with shared bathrooms. Maybe you don’t mind sharing if it's only with a couple of other people – another way you might narrow down the list. All of our student accommodation at the University of Nottingham is located within easy travelling distance of our campuses.We also offer a free hopper bus between Jubilee Campus and University Park. If you prefer to travel by bike, all of our accommodation options include secure bike storage. Before you find your perfect halls, get super excited and start decorating in your head – stop, take a deep breath and consult your budget. Wait – you don’t have a budget? Hear us out. We know budgeting is the last thing you want to do, but when it comes to big decisions, it's essential and will make your life much easier in the long run. If you stretch your budget because you want an en-suite room now, you might live to regret it later when all you can afford to eat is super noodles and baked beans. When creating a budget, you need to consider: After you’ve created and tallied a realistic cost sheet of the things you can’t live without, then you can make an informed decision on your accommodation. (If you still can’t live without that en-suite – there's always a part-time job!) Discover more budgeting tips. Next up, we’ve got catered and self-catered halls to choose from. Let’s consider the pros and cons of both. For more insight into the pros and cons of catered and self-catered accommodation, you can watch our student vlogs: Living in catered halls Living in self-catered halls Be sure to carefully read the details of each accommodation to find out what extras may be included in the price of your room. For example, some halls have a cleaner included in the price which you may be very glad of when your workload starts to kick in. Halls of residence on the University Park Campus and Jubilee Campus (as well as Dagfa and Varsity), include our sports, health and well-being package. Don’t forget to check out what facilities are included as these will also differ from hall to hall. For example, some student accommodation includes outdoor space and communal areas so if you are a particularly social person this might be appealing. All the facility information is available on our accommodation page. Try and keep an open mind when viewing the different rooms on offer. It can be hard to picture yourself living in halls but once you add your personal touch it will transform the space and make it feel like home. You can plan ahead to get an idea of what your room might look like: Accommodation Our top tips and go-to list for university packing will ensure you are prepared and ready for a stress-free move to your home away from home. Events Open days are a great way to learn more about your course, meet academics and chat to students. They also help you to get a feel for the place, so that you can decide whether life as a Nottingham student is right for you. Student experience As a member of the UK's prestigious Russell Group and the Universitas 21 global network of research-intensive universities, we deliver the highest standard of education, recognised worldwide. Help and support A helpful guide to take you through the steps to create a 'Find Your Nottingham hub' account. The My UoN account will help you save courses and resources to a personal portal that you may find useful throughout the application process. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}