{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/our-foundation-programmes.html",
    "content": [
        {
            "p": "What is a Foundation programme? A foundation programme is a preliminary course that prepares you for undergraduate study. It provides an alternative route to higher education if you're not eligible for direct entry to an undergraduate course. With a duration of one or two years, our foundation programmes welcome students who don't meet the standard entry requirements or don't have the right A levels for their chosen course. Additionally, we also work with Kaplan Pathways to offer international foundation programmes suited to those with international qualifications, non-standard qualifications, or those who need additional English language support. The University of Nottingham offers two different types of foundation routes, the first for UK and home students, while the second is addressed to international students (you can find this information a bit further down the page). Our programmes equip you with the skills needed to succeed in undergraduate study, and integrate you into university life, with access to our campuses, accommodation, teaching facilities and a huge range of sports and societies. There are four foundation pathways to choose from as an UK and home student, with each programme determining your future undergraduate course progression. This programme allows you to pursue your passion for arts and humanities at university, and help overcome previous lacks or barriers in your education. Here you can explore your interests in engineering and physical sciences and develop a well-rounded subject knowledge for your undergraduate degree. A one year programme that helps you develop key scientific and professional skills to help you prepare for an undergraduate degree in health sciences. This programme aims to strengthen your knowledge and broaden your scientific skill set to progress your studies towards a science-based undergraduate degree. To be eligible for this type of foundation pathway, you must be a UK student and qualify for home fee status. Each foundation course has minimum entry requirements for academic performance, with some pathways requiring A Levels (or equivalent) in specific subjects. This will vary depending on the foundation course you choose and your desired undergraduate degree. If you are interested in the Arts and Humanities foundation pathway, you must also meet specific eligibility criteria based on your personal background. All applications are submitted through UCAS, with entry requirements and other course details available on the respective course pages. The minimum pass mark for the foundation year is 40% or above in all modules, with some undergraduate courses requiring higher grades to progress. Once you meet our progression requirements, you will be eligible to apply for one of the undergraduate courses within your pathway. Some pathways will allow for automatic enrolment to the course of your choice, while others will require a new application. The University of Nottingham foundation qualifications are also accepted by many other UK universities. However, if you choose to continue your studies at another institution, you will need to apply for the course with a new application through UCAS. As a mature student, I hadn’t studied maths or science since my GCSEs. This put me at a disadvantage compared to other students commencing their engineering degrees, and I was quite nervous when I first embarked on this venture. However, the foundation year provided me with everything I needed and more, to make sure I had the ability and confidence to enter the first year. Kim Onjun Mechanical Engineering with a Foundation Year An international foundation programme is a preparatory course that helps students from overseas prepare for their undergraduate degrees in the UK. Usually lasting up to a year, it will help you qualify and prepare for entry to an undergraduate degree. You will study at the University of Nottingham International College, a specialist international study centre run by Kaplan Pathways, which is located next to the University Park Campus. You will also have access to the University of Nottingham campuses, libraries, and a vast range of sports clubs and societies. During the programme, you will focus on developing your English language skills, academic skills and subject knowledge. Once you pass your course at the required level, you'll be guaranteed a place on your chosen Nottingham degree. There are two foundation pathways to choose from as an international student, with each programme determining your future undergraduate course progression. This programme will help you improve your social sciences knowledge, and open the doors to a range of degrees in social sciences, business, arts and humanities. A programme that will broaden your knowledge and scientific skills set in order to progress towards an undergraduate degree in science and engineering. To enroll on this programme, you must be an international student who qualifies for overseas fees status for higher education in the UK. There are certain academic entry requirements indicated by good high school grades in relevant subjects, with your English language level determining the length of the foundation programme. All international foundation programmes are run by our experienced education partner, Kaplan Pathways at the University of Nottingham International College, with applications made directly through the Kaplan Pathways website. Faculty of Medicine and Health Sciences Bachelor of Science with Honours Qualification Bachelor of Science with Honours Entry requirements AAB Start date Sep 2025 UCAS code C100 Fees (UK) TBC Location Medical School Building and University Park Campus, Nottingham, UK Faculty of Arts Bachelor of Arts with Honours Qualification Bachelor of Arts with Honours Entry requirements ABB UCAS code Q800 Location University Park Campus, Nottingham, UK If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}