{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Chemical-and-Environmental-Engineering/Chemical-Engineering-with-Environmental-Engineering-MEng.aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/524/6/0058(3/28)MQA/FA8593 Chemical Engineers once qualified, work in a wide range of companies and fields. They produce a wide variety of products ranging from fuels and petrochemicals to inorganic bulk chemicals, food and beverage, household products such as soaps and detergents, pharmaceuticals, polymers and fine chemicals. Their job is to transform efficiently and safely raw materials into useful products with minimum environmental impact. Chemical Engineers with knowledge in environmental engineering also work in waste management, waste treatment, water treatment, agriculture, consulting and renewable energy industries. Chemical Engineering has been established at the University of Nottingham in 1961 and ranks as one of the UK’s top 5 chemical engineering department in The Guardian University Guide 2024, while QS and THE World University Rankings put us as top 15 chemical engineering department in the UK. The UON has a long history of collaboration with industry where a large percentage of our students go on to gain jobs with major companies worldwide. The same programmes are available in the UK and at the University of Nottingham Malaysia. Chemical engineering with environmental engineering is a branch of engineering which deals with both chemical production and the manufacture of products through chemical processes including the application of environmental engineering to ensure factors related to environmental sustainability are taken into consideration during design and manufacturing. This includes designing equipment, systems and processes for refining raw materials and for mixing, compounding and processing chemicals to make valuable products in a sustainable manner. Students will learn how to develop economical commercial processes by converting raw material into useful products using safe and clean production methods, including exposure in environmental and sustainability topics such as environmental assessment, waste management, air pollution, water treatment, contaminated land and water treatment engineering. The Department of Chemical and Environmental Engineering is known for the quality of its research along with being recognised for its world-class learning environment and international reputation for new knowledge generation. In the recent Guardian University Guide 2024, we are rated as a UK top 5 chemical engineering department, while QS and THE World University Rankings put us as top 15 chemical engineering department in the UK. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 79% average based on 6 subjects, including Advanced Functions, Calculus and Vectors and relevant science subjects. Consideration to be made based on relevant individual grades if specific subjects are required. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Engineering is a 1+4 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Engineering. Modules on the programme aim to improve language and study skills as well as enhance understanding of mathematics and the physical sciences. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway from thermal science or chemistry to electricity and magnetism. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Chemical Engineers apply their knowledge to investigate problems and design solutions in fields involving safety and sustainability. According to IChemE, these skills give opportunities in many areas and you can expect to take on job titles such as Process Design Engineer, Environmental Engineer, pollution control engineer, water resource engineer, wastewater treatment engineer, waste management engineer, hazardous materials specialist, Plant Process Engineer, Process Safety Engineer, Project Engineer, Consultant Product Engineer, Manufacturing Production Engineer, Research & Development Engineer, Project Manager, Attorney, Computer Applications & Technology Engineer, Technical Manager, Business Coordinator, Professor, Quality Control Engineer, Regulatory Affairs Engineer, Technical Services Engineer, Sales and Marketing Engineer. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}