{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/international-students-hub/university-of-nottingham-open-days-international-students.html",
    "content": [
        {
            "p": "Find out what international students can expect from the University of Nottingham open days, whether you join us online or in person. So, you’ve heard a bit about us, checked us out online, and now you are ready for a first date? (We are definitely interested!) The University of Nottingham open days are an opportunity for us to get to know each other and for you to get a feel for the experiences on offer. They are also a chance to learn more about your course, meet academics and chat with other students. If you can’t make it in person, don’t worry! Loads of international students use our online resources to explore the university. We'll give you a rundown of the in-person and virtual options so you'll know what to expect. We’ll cover: Food market at the Open Day Friday June 22 2022 by Simon Litherland If you can make it to Nottingham for one of our open days, you can take a campus tour and get a feeling for the area that might be your home for the next few years. One of our dedicated International Student Ambassador guides will look after you throughout the tour. In-person campus tours: Virtual tour Don’t worry if you can't make it on one of our campus tours. We have great virtual resources that will give you an idea of life on our campuses, including our different accommodation options. Virtual tour and resources If you can make it to one of our open days, we will be delighted to host you. We'll showcase the best of our university - from our world-class facilities and academics to our award-winning grounds. You'll also have the opportunity to meet some of our current students. What you can expect from an open day: Still curious? Follow one of our students on her TikTok video tour of a University of Nottingham open day. Meet us online If you can’t make it in person, you’ve done the virtual tour but still want to chat with someone from the university, we are here to help. Just fill in our booking form to arrange an online meeting, where a member of our International Student Recruitment team will answer your questions. They can talk with you about our courses, entry requirements, scholarships, campus facilities, support services and the student experience at Nottingham. Unibuddy If you want to pick the brains of our current students about a course, student life or the city, Unibuddy is a great way to connect. Sign up, and we'll put you in touch with a student studying a course you are interested in, or from your home country where possible. You will also be able to chat with our staff from different departments via Unibuddy, and you'll have access to blogs covering a variety of topics. Sign up today to start chatting with our students and staff. We hope this article has provided you with some great resources and an idea of what to expect from our open days, whether you attend in person or online. If you still need help, contact our international team directly at international-office@nottingham.ac.uk. Campus and facilities Welcome to the University of Nottingham. Each of our UK campuses has a unique character and provides access to world-leading facilities. The University of Nottingham, University Park, Nottingham, NG7 2RD Jubilee campus The University of Nottingham, Wollaton Rd, Lenton, Nottingham NG8 1BB Sutton Bonington campus The University of Nottingham, Sutton Bonington, Leicestershire, LE12 5RD, UK If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}