{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/engineering.html",
    "content": [
        {
            "p": "Discover what it's like to be a student in the Faculty of Engineering at the University of Nottingham. Get ready to shape the real world Our Faculty of Engineering includes six high-performing departments that work closely together to benefit you. Great minds don't think alike and this spirit of collaboration is essential to engineers, architects and designers. Here you get the space, support, skills and connections to revel in the real world. You'll design the places of tomorrow and create cutting-edge tools and technologies. Solve real world challenges, turn research into reality and help make a greener planet spin a little smoother. Find out more about our Faculty of Engineering courses and departments Find out more about our student experience and facilities with our articles below. Read all about Ify, one of our aerospace engineering students, as he describes his typical day and gives you a taste of what to expect at university. Civil Engineering Follow Feroz, as he attends his group design project seminar, meets with his tutor and attends a fundamental materials lecture. Product Design and Manufacture Follow Maian, a product design and manufacture student, as she takes you through her typical day to give you a taste of what to expect studying with us. Architecture Follow Joanna, as she shows you what studying at the University of Nottingham is like for an architecture student With our ALSIM AL250 the (virtual) sky's the limit The lowdown on our Environmental Education Centre and where you'll be working. Architectural Environment Engineering Read about our award-winning Creative Energy Homes Mechanical and manufacturing engineering Start building your future in our engineering labs Read about how our architecture students spend their free time Read about how our architectural environment engineering students spend their free time Read about how our aerospace engineering students spend their free time Chemical and Environmental Engineering Read about our chemical and environmental engineering society Faculty of Engineering Read all about Sophie, one of our graduates, and about her experience studying architecture at the University of Nottingham Read about Matt, a recent graduate, and about his experience studying architectural environment engineering at the University of Nottingham Read about Olyvia's experience studying Aerospace at the University of Nottingham Where will your chemical and environmental engineering degree take you?"
        }
    ],
    "pdf_files": []
}