{
    "url": "https://www.nottingham.edu.my/Study/Accommodation/Off-campus-accommodation.aspx",
    "content": [
        {
            "p": "These are privately owned properties comprising primarily of apartments, houses and individual rooms in houses available for rent. Some of these are within walking distance while others are not. Some are fully furnished while others are only partially furnished. Students are advised to liaise directly with the property owners or operators regarding off-campus accommodation. It is advisable to gather the correct information and clarify details before deciding. Note that you are likely to sign a one-year contract. Although the University may assist in initiating the contact, It is ultimately a contract between the student and the landlord/operator. The following are some options that you may consider: Taman Tasik Semenyih (TTS) is a housing estate located behind the university. Here, you will find terrace and bungalow houses, some of which are available for rent, either as an entire unit or rooms within the unit. Based on the road name, different parts of TTS are referred to as TTS1, TTS2, up to TTS7 (which is the furthest from the main road entrance). Houses in TTS5 are more popular as there is a linked bridge and gate into the University. There is a guard house stationed at the gate and it is monitored by CCTV cameras. UniVillage is located opposite the University's main entrance. Comprising 4 blocks, the rooms here are furnished and there are some food and retail outlets, gym (membership fees apply), besides an area for residents to study, rest and relax. UniVillage is located within a gated and guarded compound with CCTV monitoring. Tetris Apartments is located about 1.5 kilometres from the campus. It consist of three blocks of walk up flats within the Semenyih Lake Country Club. Residents are able to use the club's swimming pool and other facilities. Students are advised to liaise directly with the off-campus accommodation. Read now Off-campus accommodation is deemed a private arrangement between you, the student and the off-campus property operators. The university is under no obligation to either party on any matter whatsoever, and cannot be held liable in any way to any party. General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/LIST-OF-SERVICE-PROVIDERS-FOR-OFF-CAMPUS-ACCOMMODATION-03042024.pdf"
    ]
}