{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Computer-Science/Computer-Science-with-Artificial-IntelligenceBSc-Hons.aspx",
    "content": [
        {
            "p": "UNM/JPT-R2/481/6/0771(5/26)MQA/SWA0624 The University of Nottingham Malaysia’s Computer Science with Artificial Intelligence degree is designed to develop both your general understanding of Computer Science and more specialised skills and knowledge in Artificial Intelligence (AI). In addition to fundamental computer science modules, the programme covers topics on expert systems, the history and philosophy of artificial intelligence, machine learning, neural networks, and other intelligent systems. By studying this programme, you will learn how to develop new methodologies and novel computational techniques for the creation of human-like intelligence. Artificial Intelligence plays a critical role in solving real-world problems in the 21st century. The demand for computer scientists proficient in AI skills are increasing with the advancement of Industry 4.0. Glassdoor reported that eight of the top ten jobs for 2022 are Computer Science related. Finally, our degree programme provides graduates with a well-rounded education and cutting-edge skills to enter Computer Science careers with a focus on Artificial Intelligence. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. BBB, including Mathematics, excluding critical thinking and general studies. 30 points with 5, 5, 5 at Higher Level, including 5 points in mathematics at Higher Level. BBB, including Mathematics, excluding Pengajian Am. 2 As including Mathematics and grade B3 in 3 other academic subjects, excluding Bahasa Malaysia and Chinese language. ATAR 86 including Mathematics and other relevant subjects. 79% average based on 6 subjects with at least 70% in Advanced Functions and Calculus and Vectors. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. 4, 4, 4, including AP Calculus. Acceptance is at the discretion of the School but normally would require an overall GPA of 3.30 out of 4.0 and above in Diploma in Computer Science, Software Engineering, Information Technology, Information System, Science and Technology or other related disciplines. Must include at least grade B in mathematics modules and good grades in relevant subjects. Previous studies must meet the pre-requisite requirements of the programme. Acceptance is at the discretion of the School but normally would require an overall GPA of 3.30 out of 4.0 and above, including grade B in all mathematics modules. Previous studies must meet the prerequisite requirements to the programme. Successful completion of the Foundation in Science or Engineering programme. In addition to the entry requirements listed above, applicants must have a credit in additional mathematics or grade B in mathematics and at least a credit in a science subject at SPM/ GCSE/ IGCSE/ High School Diploma or equivalent. This requirement can be waived for applicants with the appropriate science background. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Science is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Science. This rigorous programme provides students with a strong academic background that will result in enhanced language, mathematics, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as chemistry, ecology, computer programming or psychology. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. While many Computer Science graduates do become programmers, others are employed in a wide variety of jobs. These include computer analysts, IT consultants and planners, network/systems designers and engineers, researchers, software designers and engineers, web designers, web developers, and producers as well as roles across advertising and marketing, business and financial analysis, accountancy, and investment/merchant banking and legal and quality assurance professions. Some of our graduates have gone on to work for traditional computer companies such as Adobe, Google, Hewlett-Packard, IBM, and Microsoft. Others have found jobs with employers such as Accenture, Experian, and Ocado. New computer science graduates frequently command some of the highest-paid entry-level positions compared to graduates in other disciplines. Examples of Artificial Intelligence related jobs obtained by alumni of the BSc in Computer Science with Artificial Intelligence include Data Scientist, Machine Learning Engineer, Machine Intelligence Engineer, AI Engineer, Data and Solutions Architect, Data Modeler, and RPA Developer. A Computer Science with Artificial Intelligence degree programme combines the study of computer science with the exploration of artificial intelligence. This course provides students with a strong foundation in computer science, programming, algorithms and data structures. Students will also develop and understanding of machine learning, natural language processing, robotics and other AI techniques. Graduates can pursue a wide range of careers in the tech industry. They can be AI and machine learning engineers, data analysts, software developers, computer scientists and research scientists. Some big tech companies in Malaysia that hire graduates with a Computer Science and Artificial Intelligence degree include Intel, IBM, Dell Technologies, HP and Huawei Technologies. Graduates with this degree are also needed in other industries, such as finance, healthcare, and logistics, all of which incorporate AI technologies into their operations. Students that want to pursue a postgraduate education in this field can go for our master’s degree or PhD in computer science. This programme typically takes three years, full-time, to complete. Graduates with this degree can expect to earn between RM5,000 MYR per month to RM17,200. However, salaries vary depending on the company, level, location and industry you’re in. Work experience and skills in specific areas of AI can also lead to higher salaries. UNM’s Computer Science and Artificial Intelligence BSc degree programme is ideal for students who are interested in the field of computer science and want to specialise in AI and Machine learning skills. This may be a suitable course for you if: The University of Nottingham Malaysia campus is equipped with state-of-the-art facilities, including computer labs, libraries, sports facilities, and student accommodation. UNM provides a range of support services to students. These include: including academic and learning support, counselling and mental health services, and career guidance. Yes, the University of Nottingham Malaysia offers a range of financial assistance options to both international and locals students. This includes over 8 different scholarships. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}