{
    "url": "https://www.nottingham.ac.uk/studywithus/international-applicants/country-info/countryinformation/belgium.aspx",
    "content": [
        {
            "p": "Unlock your potential at a world-leading university with a truly international student community. Applicants from Belgium are normally not required to complete a foundation course. We offer foundation courses for international students who are not qualified for direct entry to our undergraduate degree courses. These courses are available at the University of Nottingham International College, just next to University Park Campus, in partnership with Kaplan International Colleges. Find out more about the courses, entry requirements and progression options on Kaplan's website: Applications and enquiries for these courses are handled by Kaplan and the college. International foundation courses Full-time courses across our five faculties typically last for three to four years, although some degrees such as medicine and architecture have a longer duration. If you have taken Certificat d’Enseignement Secondaire Supérieur (CESS), Getuigschrift van Hoger Secundair Onderwijs (GHSO) or Abschlusszeugnis der Oberstufe des Sekundarunterrichts, we can typically accept the following grades: Students with the European Baccelaureate are asked for an average grade between 85% and 70% depending on how competitive the course is. A typical EB requirement for a course with a BBB A level entry requirement is an overall average grade of 75%. Our Undergraduate Prospectus lists entry requirements for A levels and International Baccalaureate students for each course. Students taking APs or SATs should refer to our entry requirements for the USA. We offer a wide range of postgraduate masters degree programmes across our five faculties. Full-time masters courses typically last for one year. A Bachelor degree, Licentiaat/Licencié or higher qualification from a recognised University will be considered for masters entry. Check course details in our Postgraduate Prospectus to see whether your chosen course requires the equivalent of an Upper Second Class (2:1) or Lower Second Class (2:2) degree. Our entry requirements for degrees from Belgian universities vary depending on the university where you have studied and the course you are applying for at Nottingham. The summary below is provided as guidance but requirements may vary for individual courses. Entry requirement Upper Second Class (2:1) Lower Second Class (2:2) Usually from 1-20 out of 100% Our PhD courses, available across a wide range of subject areas, typically include three years of full time research followed by an optional writing-up period of one year to complete your thesis. A masters and bachelors degree from a recognised university are usually required for PhD entry. Exceptional students may be considered for PhD entry without a masters qualification. See the masters section for guidance on the grades we typically require from Belgian universities. These will vary depending on the university where you have studied and the course you are applying for at Nottingham. You should identify possible supervisors at Nottingham before applying and prepare a research proposal to submit with your application. Europe Undergraduate Excellence Award Europe Postgraduate Excellence Award International Sporting Excellence Award Sports scholarship packages Find out more about tuition fees Graphic adapted from FreeVectorMaps.com Find out more about student life jelena.markovic@nottingham.ac.uk We regularly travel to countries around the world to meet with prospective students and their families, visit schools and to attend education fairs and other events Meet us overseas You are also very welcome to visit our campuses in Nottingham for an open day or an independent visit. Visit us in Nottingham Our official representatives in France can assist you with applying for our courses, visa processes and preparing to study with us. Contact us by email or telephone Connect with us on social media International Student Life blog"
        }
    ],
    "pdf_files": []
}