{
    "url": "https://www.nottingham.ac.uk/studentservices/servicedetails/graduation/winter-graduation/gown-and-hood-hire.aspx",
    "content": [
        {
            "p": "A comprehensive guide for graduation hoods and gowns Graduation is a significant milestone in your academic journey and is an opportunity for you to celebrate your successes with your family and friends. It's a time to put on your best outfit and take pride in your achievements. One of the most iconic parts of any graduation ceremony is, of course, the hood and gown – a symbolic tradition that signifies the end of this part of your Nottingham journey and the beginning of a new one. On this page, you'll find all the information you need about gown and hood hire and what to expect from the process. Cost of gowns | What to wear with your gowns | Our hood and gown guide The prices for hiring gowns vary depending on the type of gown you need. Check out the table below to see the prices for pre-order and on-the-day hire. A celebration of years of hard work and dedication, graduation is your time to shine. Many graduates want to dress up for the occasion, donning their best formal attire underneath their Nottingham gown but it’s also important to us that you feel comfortable too. Below is a quick guide as to what is appropriate and encouraged. The university's official supplier, Ede and Ravenscroft, can provide shorter gowns if you would prefer. Once you have ordered your gown, get in touch with Ede and Ravenscroft providing your name, student ID number, and student email address, and they will arrange for a shorter gown to be delivered to your home address at no additional cost. You can then choose whether to arrive in your gown, or you can bring your gown with you and the gowning team can assist you before your ceremony. A guide to our hoods and gowns Find your degree from the table below to see what colour your gown and hood will be. Bachelor of Architecture Ribbon: Orange Bachelor of Arts Ribbon: Cherry Red Bachelor of Divinity Ribbon: purple Bachelor of Education Ribbon: Lilac Bachelor of Engineering Ribbon: Light navy blue Bachelor of Laws Ribbon: maroon Bachelor of Medical Science Ribbon: gold Bachelor of Medicine and Bachelor of Surgery Bachelor of Pharmacy Ribbon: dove grey Bachelor of Science Ribbon: Royal Blue Bachelor of Veterinary Medical Sciences Ribbon: teal Bachelor of Veterinary Medicine and Bachelor of Veterinary Surgery Doctor of Applied Educational Psychology Ribbon: royal blue Doctor of Applied Social Science Ribbon: cherry red Doctor of Business Administration Ribbon: salmon pink Doctor of Clinical Psychology Doctor of Education Ribbon: lilac Doctor of Engineering Doctor of Health Sciences Ribbon: cream Doctor of Medicine Doctor of Musical Arts Ribbon: pink Doctor of Philosophy Ribbon: light blue to edge Doctor of Public Policy Doctor of Veterinary Medicine/Surgery European Doctorate Master in Engineering Ribbon: light navy blue Master in Mathematics Master in Science"
        }
    ],
    "pdf_files": []
}