{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/courses/UG/2025/Aerospace-Engineering-including-an-Industrial-Year-MEng-Hons-U7UAERSEY.html",
    "content": [
        {
            "p": "University Park Campus, Nottingham, UK Are you interested in the science behind flying? Maybe you are curious about aircraft design and manufacturing. Leading researchers in aviation teach our course to provide you with the skills and advanced knowledge needed to work in this exciting sector. Mandatory Year 1 Aerospace Design and Materials Aerospace Electronic Engineering and Computing Aerospace Statics and Dynamics Aircraft Design and Performance Fluid Mechanics and Aircraft Aerodynamics Integrating Project and Maths 1 The above is a sample of the typical modules we offer, but is not intended to be construed or relied on as a definitive list of what might be available in any given year. This content was last updated on Thursday 25 January 2024. Due to timetabling availability, there may be restrictions on some module combinations. Workload varies from week to week; in a typical week in years one and two you will have up to 24 contact hours. Combined with coursework and self-study, you may spend over 35 hours a week on your studies. In study years three and four you will typically have 12-16 contact hours alongside self-directed project work, which forms a significant part of the course. You will typically spend at least 35 hours a week on your studies. Studying for a degree at the University of Nottingham will provide you with the type of skills and experiences that will prove invaluable in any career, whichever direction you decide to take. Throughout your time with us, our Careers and Employability Service can work with you to improve your employability skills even further; assisting with job or course applications, searching for appropriate work experience placements and hosting events to bring you closer to a wide range of prospective employers. Have a look at our careers page for an overview of all the employability support and opportunities that we provide to current students. The University of Nottingham is consistently named as one of the most targeted universities by Britain’s leading graduate employers (Ranked in the top ten in The Graduate Market in 2013-2023, High Fliers Research). University Park Campus covers 300 acres, with green spaces, wildlife, period buildings and modern facilities. It is one of the UK's most beautiful and sustainable campuses, winning a national Green Flag award every year since 2003. In general, my placement gave me real world experience in my field of study and network opportunities within a global and well recognised company, as well as valuable and highly applicable skills that are not as easily found in a university environment. Alex Hyer talking about his placement at AIRBUS 67% say staff value students views and opinions about the course Data for Aerospace Engineering including an Industrial Year (Full time) at University of Nottingham, the For more official course information visit Discover Uni See course data Faculty of Engineering Entry requirements A*AA / AAAB UCAS code H40B Duration 5 years full-time Start date Sep 2025 Entry requirements AAB UCAS code H20A Duration 4 years full-time Entry requirements AAA UCAS code H20B UCAS code H61V If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}