{
    "url": "https://www.nottingham.ac.uk/studywithus/ugstudy/articles/explore-more-articles/central/i-have-firmly-accepted-my-offer.html",
    "content": [
        {
            "p": "You've firmly accepted your offer, that's great news. We'll guide you through what's next. On this page: We know that you will be busy with your studies. However, please make sure your contact details are up to date so we can reach you with key information. We recommend that you use your personal email address on your UCAS application. This is to ensure you don't miss any essential joining information from us over the summer. Find out how to change your email address with UCAS. If you have any questions about your application, contact UCAS. Check our tuition fee webpages for full details of our tuition fees, payment dates and policies. If you are unclear about your fee status please contact us. Our Financial Support team provides information and advice on all aspects of student finance to current and prospective students. The university offers a number of bursaries and scholarships which are worth investigating and applying for – you could end up with more support than you were expecting. Now that you have firmly accepted your offer, it's a good idea to start looking at your accommodation options. Applications for accommodation will open in spring 2025. When you apply, we will ask you to select at least three preferred accommodation options and you will need your UCAS ID. As part of your offer, you will be required to meet a certain level of written and spoken English. This is so you can get the most out of your course at Nottingham, which will be delivered in English. Find out more about our English language requirements and the English tests and qualifications we accept. Don't worry! Our Centre for English Language Education (CELE) offers pre-sessional courses to help you prepare and meet the required level in English before you start your undergraduate studies. Explore our pre-sessional English courses If you think you may require extra support during your time at Nottingham, please don't worry. We are committed to equality of opportunity for all students; whether you may have a specific learning difference or physical disability. Our disability and academic support services International applicants should first read all sections on the below link. More help with the application process Applying Now you've received and offer from the University of Nottingham, there's a few tips we think will help as your prepare for the next steps. Everything you need to know, from understanding your offer to accepting your place. If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}