{
    "url": "https://www.nottingham.edu.my/Study/Undergraduate-courses/Mechanical-Materials-and-Manufacturing-Engineering/Department-of-Mechanical-Materials-and-Manufacturing-Engineering.aspx",
    "content": [
        {
            "p": "The Department of Mechanical, Materials and Manufacturing Engineering is one of the leading departments of its kind in the world, and is ranked fourth in the UK in the latest Research Assessment Exercise (RAE) for the quality of its research. Our close industry links ensure that our teaching and research have both relevance and meaning, and our mechanical engineering courses offer the same high-quality education and excellent career opportunities as the UK. manufacture a prototype, evaluate its performance, undertake development work to improve it, and assess the financial viability and marketability of the product. All students will do an individual project in their final year. This is of an experimental, computational or analytical nature and provides a link between academic and professional work. You will be able to choose your individual project topic – most of which are based on real industrial problems. Graduates of the department have various career opportunities in fields such as aerospace, automotive, energy, manufacturing, research and development etc. Following are some career options for students with a mechanical engineering degree: Mechanical engineer Materials engineer Product designer Automotive engineer Quality control analyst Robotics specialist Aerospace industry analyst Biotechnology industry analyst Manufacturing industry analyst System quality control manager Plant and system operators Biomedical engineer Research scientist The department conducts research in various areas related to mechanical engineering, materials science, and manufacturing engineering. Some of the research areas include advanced materials and manufacturing, computational engineering, energy and environment, robotics and automation, and biomedical engineering. The department has various facilities for students, including research labs, computer labs, workshops, and a library. The department also has a dedicated team of technical staff to support students in their studies and research. Yes, the University of Nottingham Malaysia offers various scholarships and financial assistance options for students, including merit-based scholarships and need-based scholarships. The teaching and learning experience in the department is a combination of lectures, tutorials, laboratory work, and projects. Students are encouraged to engage in independent study and research to develop their critical thinking, problem-solving, and communication skills. The department also employs a range of practical teaching methods such as internships and industry visits. Yes, the department has collaborations with a range of industry partners in Malaysia and globally. These include research partnerships, student internships, and industrial consultancy projects. UNM provides a wide range of support services to postgraduate students, including academic and learning support, counselling and mental health services, and career guidance. Department of Mechanical, Materials and Manufacturing Engineering The University of Nottingham Malaysia Campus Jalan Broga, 43500 Semenyih, Selangor Darul Ehsan, Malaysia Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia University of Nottingham Malaysia DULN001(B) telephone: +6 03 8924 8000 fax: +6 03 8924 8005 course enquiries: +6 03 8924 8686 Monday - Saturday 9:00am - 5:30pm (Except on public holidays)"
        }
    ],
    "pdf_files": []
}