{
    "url": "https://www.nottingham.ac.uk/support-services/home/why-study-with-us/study-abroad.html",
    "content": [
        {
            "p": "The majority of University of Nottingham students have the opportunity to have an international experience during their university career. Nottingham has 200 university partners in 40 different countries spanning six different continents across four different exchange programmes. These include Inter-campus exchange, International exchange and International summer schools. Do you aspire to be a global graduate? Do you want to enhance your employability while travelling the world? Do you dream of having an international career? If yes, then studying or working abroad during your degree can help you on your way. Study abroad gives students an opportunity to apply to study or work in another country during their degreeThe duration of your study abroad experience could range from one week to one year. This will depend on the programme you apply for, and the course you are studying. “My decision to study abroad was without a doubt one of the best decisions I have ever made, and I am confident the skills, experiences and friendships I obtained in Malaysia will last a lifetime.” Emily, BSc International Management Discover your inner confidence as you settle into a new culture, make friends, step outside your comfort zone, connect and collaborate, and showcase your resilience. Studying abroad can help you: *2019 International Education Report: Gone International Mobility Works. Report on the 2017-18 graduating cohort. Universities UK International. Duration 1 year or 1 semester* *Dependent on your chosen degree About Who can apply? Students studying an eligible degree “You will never regret going, but you could regret not going. A year abroad is not just about studying in another university; travelling and settling in another country, it is an education in its own right.” Chloe Gibbons. LLB Law with South East Asian Law National University of Singapore The University of Nottingham was the first UK university to open a branch campus overseas with the opening of our Malaysia Campus in 2000, followed by our China Campus in Ningbo in 2004. We are proud to offer students diverse opportunities with our portfolio of The cost of studying abroad will depend on where and how long your exchange is. The cost of living and the exchange rate will differ from country to country. The cost of studying at different partner universities will also vary, as some may have some compulsory fees or health insurance. Common costs that students will need to budget for include flights, airport transfers, visa, vaccinations, insurance, accommodation and living costs. There are no tuition fees payable to the partner university, you will pay your fees to Nottingham as usual but at a reduced rate. Further information on study abroad finance can be found at study-abroad-finance Make an enquiry to ask any question about undergraduate or postgraduate courses at the University of Nottingham."
        }
    ],
    "pdf_files": []
}