{
    "url": "https://www.nottingham.ac.uk/support-services/home/placements-work-experience/placement-types.html",
    "content": [
        {
            "p": "A placement is a period of work experience which is an integrated and assessed part of a student's degree, so they're different to an internship, which is extra-curricular. Placements require students to apply their learning from the course in the workplace and apply learning from the workplace in the course. Did you know there are different types of placements? If not, we have a handy summary below to guide you through. The majority of undergraduate degree programmes offer students the opportunity to complete a Placement Year with an industry partner. Students can join the university on a degree programme where a placement is already featured or they can add in a placement Yyar once they have commenced studies. The central Careers and Employability Service and specialist Placement Teams in Academic Departments provide in-depth support to students to assist them in securing opportunities and making the most of the placement year experience. Over 500 students per year undertake a placement year with organisations across the UK and Internationally. There are a number of programmes to explore: Other Academic Departments that offer degree programmes with a Placement Year include (but are not limited to): Pharmaceutical Science, Chemistry, Maths, Cancer Science and Neuroscience. A wide range of degree programmes at the University of Nottingham offer placement opportunities that lead to a licence to practice. Examples include: Other areas where placements are a fully integrated element of the degree programme include: In the above examples, students will be supported by specialist teams across the University to access and undertake placements during their degree programme with a wide range of established partners and placement hosts. Students also have the opportunity to access a wide range of shorter-term placement, internship and work experience initiatives managed by the University whilst at Nottingham. These opportunities can form part of an accredited academic module, they can be optional and recognised by the University’s Nottingham Advantage Award or they can be an extra-curricular experience. Examples of Placements that can form part of an accredited academic module can be found in our Faculty of Social Science Placement Programme and our Faculty of Arts Placement Programme. Extra-curricular initiatives offer students the opportunity to build their work experience alongside their studies and during vacation periods. Schemes including the Nottingham Internship Scheme, the Researcher Academy Placements Programme, the Digital Marketing Academy and Nottingham Consultancy Challenge can connect students from all degree disciplines and any level of study with work experience during their time at Nottingham. These opportunities connect students from all degree disciplines and any level of study with work experience during their time at Nottingham. Head back to our Placement and Work Experience hub page, to explore more about placements and subject specific programmes available. I secured a placement with Proctor and Gamble, where I worked on improving their production equipment. The services provided by the Placement Team really helped, every time I applied for a role, I could have my CV checked to get the very most of each opportunity, I went to mock assessment centres and interviews that really helped in my preparation. MEng Product Design and Manufacture with Industrial Year. Jamila Hamzayeva Student of MEng Product Design and Manufacture with Industrial Year Widening participation Imagine and create your future. Join our programmes to take part in activities to inspire, support and inform your higher education experience. Don’t let your background determine your destination – write your own story. Nottingham and Nottinghamshire Here are the \"hidden gems\" students should know about when visiting Nottingham. Clearing Your guide to helping a student to navigate Clearing – as a parent, guardian, family member, teacher, school counsellor or education agent. Applying Take your first step into a world where the exceptional happens. Find out how to apply to study at the University of Nottingham. Make an enquiry to ask any question about undergraduate or postgraduate courses at the University of Nottingham."
        }
    ],
    "pdf_files": []
}