{
    "url": "https://www.nottingham.ac.uk/support-services/home/placements-work-experience/what-our-students-say.html",
    "content": [
        {
            "p": "A placement is time spent in a workplace, doing supervised work, during your studies or shortly after graduation. You might see placements advertised as ‘internships’, ‘work experience’, or ‘volunteering’, as different organisations use different terms. What’s most important is that you choose an opportunity that interests you, and will help you develop skills future employers value. A placement will help you to: As a result of my placement, I now feel secure and confident in my career plans. Completing a placement year has given me critical experiences and helped me to understand what steps I can take to be successful after University. Sarah Wooldridge Student of BSc Psychology with Placement Year. Everyone tells you that doing a placement will give you invaluable experience in industry. Whilst that is true your placement year can be so much more. I was expanding my research science then after work I was at the beach exploring. It was such a great lifestyle, and I came back with a much better idea of what I wanted as a graduate. Emily Tyack Student of BSc Environmental Biology with Industrial Year. The Summer Research Placement influenced my future studies; it introduced me to a new field and helped to build my academic interests. Yiyin Lyu Student of BA Hons English Language and Literature One of the benefits of the Nottingham Internship Scheme was developing commercial awareness, the opportunity to help make decisions, connect with people and learn about different areas within the business really helped. Jesica Dahal Student of BSc Hons Industrial Economics The Faculty of Social Science Placement has made me more confident in my abilities in the workplace. Megan Chance Student of BSc Economics Head back to our Placement and Work Experience hub page, to explore more about placements and subject specific programmes available. Placements Widening participation Imagine and create your future. Join our programmes to take part in activities to inspire, support and inform your higher education experience. Don’t let your background determine your destination – write your own story. Nottingham and Nottinghamshire Here are the \"hidden gems\" students should know about when visiting Nottingham. Clearing Your guide to helping a student to navigate Clearing – as a parent, guardian, family member, teacher, school counsellor or education agent. Browse our undergraduate prospectus and we'll help you find relevant study options, tailored information and advice as you apply to become a student at the University of Nottingham."
        }
    ],
    "pdf_files": []
}