{
    "url": "https://www.nottingham.edu.my/sustainability/index.aspx",
    "content": [
        {
            "p": "Championing sustainability for a greener future In Malaysia and across the UK and China campuses, the University of Nottingham Malaysia (UNM) is proud to be a research and knowledge exchange leader in the environment and sustainable development throughout the Asia Pacific region. We are committed to fostering a sustainable future through education, research, knowledge exchange, and community engagement. Through UNM’s Environmental Sustainability strategy, we aim to embed a culture of sustainability as a common and reinforcing thread within all our activities. This strategy aligns with the global Sustainable Development Goals (SDGs) and emphasises the role of higher education institutions in leading the way towards a more sustainable world. The University of Nottingham's research ranks among the world's best, ranking us within the top 100 for several individual Sustainable Development Goals (SDGs): Our three-pronged approach to environmental sustainability. This encompasses the range of waste streams generated through our operations, our consumption of electricity and water, as well as our campus greenhouse gas emissions. This draws on promoting our strengths in sustainability research, enhancing the connections between our research and our campus operations, and active sharing of sustainability related data and information with the campus community. This includes education for sustainable development within formal curricula, additional sustainability-related learning modules, and support for extra-curricular projects which promote environmental outcomes and provide opportunities for students to develop crucial skills. Explore how UNM is advancing sustainability through innovative projects, student-led initiatives, and integrating the Sustainable Development Goals into our campus and curriculum. UNM has quantified the greenhouse gas emissions from our campus, a major step in our sustainability efforts. With grid electricity consumption being a major contributor, we plan to expand on-campus solar power, enhance electricity monitoring, and encourage the campus community to adopt energy-saving behaviours. UNM's long-standing composting initiative turns food and green waste from our cafeteria and accommodation blocks into fertiliser for the campus, showcasing a circular economy in action. We're upgrading our technology to make the process more efficient and increase composting capacity. UNM students lead the way in environmental protection, supported by the Environmental Sustainability Initiative Fund. In 2023/24, the fund backed eight student projects aimed at reducing campus waste, promoting gardening, and doing research on composting and energy efficiency technologies. The university's water management project aims to reduce flooding risks and maintain water quality on campus and surrounding areas. It supports sustainability education and research, incorporates native trees to boost biodiversity, and fosters community engagement with local residents. Since 2023, UNM has integrated the Sustainable Development Goals (SDGs) into teaching through month-long SDGs Teach-In sessions during Sustainability Action Week. Our academics incorporate SDGs content into their modules, share their experiences, and earn certificates for participation. UNM’s teaching strategy enhances students' understanding of sustainability through both formal and informal curricula. A recent audit, funded by the University of Nottingham Malaysia Large Scale Teaching and Learning Grant, assessed how sustainability and SDG themes are integrated into programme and module outcomes in the Faculty of Arts and Social Sciences and the Faculty of Science and Engineering. The Environmental Sustainability Committee at UNM is responsible for developing, implementing, and monitoring environmental sustainability strategies within the university's Strategic Plan. The committee also plays a crucial role in promoting sustainable practices across the university. Our committee includes members from diverse backgrounds, including faculty, students, and staff, ensuring a holistic approach to sustainability across the university. The committee reports regularly to UNM's Management Board and coordinates with equivalent committees at the University of Nottingham's campuses in the UK and China. To learn more about potential initiative and explore our partnerships, please contact us at: Email: ESC@nottingham.edu.my General enquiries: +60 3 8924 8000 Monday - Friday 9:00am - 5:30pm (Except on public holidays) Programme enquiries: +60 3 8924 8686 Monday - Saturday 9:00am - 5:30pm Jalan Broga, 43500 Semenyih Selangor Darul Ehsan Malaysia"
        }
    ],
    "pdf_files": [
        "pdf_files/UNM-Campus-Map.pdf",
        "pdf_files/UNM-Campus-Map.pdf"
    ]
}