{
    "url": "https://www.nottingham.ac.uk/sustainable-development-goals/themes/learning-and-students.aspx",
    "content": [
        {
            "p": "Inspiring tomorrow’s champions for the goals Our teaching is informed by the SDGs. We inspire our students to be globally-engaged citizens, equipped with the skills and knowledge to make a difference. We work hard to help make such opportunities accessible to all. Our Ukrainian Scholars at Risk programme supports at-risk students from Ukraine who have been displaced due to the Russian invasion. Eligible students receive financial support, campus accommodation and academic and well-being support. The university offers finance advice and support to current and prospective students and administers a range of funding schemes such as bursaries, scholarships and support funds. The Lord Dearing Award Scheme has, since 1999, celebrated the world-class contribution made by university staff to creating a nurturing, creative and innovative learning environment. Nottingham Futures is a year-long module that focuses on sustainability. Students partner with organisations such as the city council, environmental groups and housing associations to explore the impact of research on people’s lives. Young people from the Midlands experienced a summer school to learn about technical roles in higher education and opportunities available to help them pick up skills, take the first steps to rewarding careers or explore paths to realising their potential. Nottingham Trent University and the University of Nottingham are inviting people from the local community to apply for paid, full-time and part-time PhD research projects that aim to improve the lives across our city and county. Sustainability (as defined by the UN’s Strategic Development Goals) is embedded in the curriculum across all our five faculties. Discover how this is being brought to life for our students. From the introductory modules students take to establish the foundations of knowledge in their degree programmes, to the capstone projects in their final year where they apply their research skills, sustainability is discussed and critically assessed to ensure we use the arts and humanities to face this challenge of the next century. For example, 1st year students within the Department of Philosophy examine the relationships humans have built with the wider environment within their module, “Philosophy and the Contemporary World”. Similarly, students within English and American and Canadian Studies are provided with survey modules that engage with the literature of the environmental movement from the 19th century to the present day. We also have specific modules that address areas for students to explore in the 2nd year of their programmes, allowing them to build their disciplinary knowledge of the issues of sustainability and prepare them for the opportunity to conduct their own research within dissertations and research projects in their final year. We can then speak of threads of sustainability throughout our degree programmes that ensure all Faculty of Arts students can place this issue as a central part of their degree. Ross Wilson, Director of Liberal Arts Creating a sustainable future will require an understanding of and engagement with human behaviour, culture, economics, politics and supply chains across different places and locations. Social sciences are therefore fundamental to achieving the SDGs. Within the Faculty of Social Sciences, sustainability is taught within particular modules, embedded across degree programmes, and encountered by students as part of practical immersive experiences. In autumn 2023/24 students in the School of Geography and the Nottingham University Business School (NUBS) will be participating in a new ‘eco-induction’, comprised of a series of events and interactive experiences to raise their awareness and engagement on sustainability. This will reach undergraduate, postgraduate, Master of Business Administration and postgraduate researcher students. Within NUBS, a core module on ‘Business Ethics and Sustainability’ is delivered in the third year of all undergraduate degrees, and the MBA programme includes a sustainability ‘golden thread’ that runs throughout modules such as ‘Sustainable Decisions and Organisations’. Additionally, action-learning is key to exposing students to real world challenges. For example, there is a business practice week at MBA levels where students work on a challenge set by a local charity and interact with social enterprises local organisations. The School of Geography runs the MSc Environmental Leadership and Management, which weaves together knowledge of complex 21st Century environmental challenges with activities to develop the skills, competencies and personal qualities to lead change for a sustainable future. In 2023 students worked with the Institute of Environmental Management and Assessment (IEMA) to undertake a ‘horizon scan’ of future environmental leadership challenges, which was presented at the Transformations 2023 sustainability conference. The capstone of the programme is a project that students design and implement with external environmental organisations, including The Environment Agency, WWF-UK, Atkins, Nottingham City Council, and Natural England. Finally, students from any school within the faculty can participate in the Social Sciences Placements Programme alongside their academic studies. These placements give students real-world experience working in sustainability and environment related Government Agencies, NGOs, trusts and pressure groups. The Faculty of Engineering is at the forefront of the battle to address the challenges of sustainable development, both through its research and by equipping future generations of engineering graduates with the knowledge and skills to deliver sustainable engineering solutions. How do we do this in our programmes? All have core modules in which students are introduced to the relevant engineering fundamentals, the key skills which equip students to make decisions on engineering processes, evaluate lifecycle impacts and select the most sustainable materials. Engineering design is at the heart of what we do, and our design projects allow students to develop and demonstrate their knowledge and skills in a real world context. Our staff are also active in researching sustainable solutions to big challenges from transport infrastructure to renewable energy, from advanced manufacturing to delivering clean water. Dr John S Owen, Associate Professor, Department of Civil Engineering The faculty encompasses the schools of Health Sciences, Life Sciences, Medicine and Veterinary Medicine and Science – and all have sustainability high on the agenda. Focusing on the SDG ‘Reduced Inequalities’, teaching has started to consider health inequalities, where certain groups are differentially affected by disease. For example, in the UK, black patients have a higher incidence of asthma, which may relate to health inequalities. We have also started to focus on how to make sustainable choices in lifestyle. One example of this is in the second year of the Medicine course, where students are invited to estimate their own annual carbon footprint (which is approximately 2 tons per person less than the UK average) and to produce a menu that has a lower carbon footprint than their standard menu. Interestingly, this resulted in many students switching from the meat diets to vegan and vegetarian options. Working in partnership with students is also crucial and helping to support climate anxiety in our students, given the climate crisis unfolding. Professor Michael D Randall, Associate Pro-Vice-Chancellor (Education and Student Experience), Faculty of Medicine and Health Sciences From chemistry to mathematics and even computer science, the role of sustainability in science is explored in many ways within teaching across the faculty. Natural Sciences students are encouraged to shape their study to meet personal interests, and can choose streams and modules that focus on sustainability and environmental topics. You may wonder how sustainability can be incorporated into the teaching of mathematics; modules taught include game theory, which examines voting systems and their links to inequality, responsible consumption and production, epidemic modelling and many others. Elsewhere in the faculty our pharmacy students are learning how to minimise climate impact as health professionals and the School of Chemistry has been developing an innovative approach to teaching since 2019, which directly incorporates UN Sustainable Development Goals, encouraging students to take a wider view of the positive and negative impacts of their chemistry and put their learning into context. Professor Katharine Reid, Associate Pro-Vice-Chancellor (Education and Student Experience), Faculty of Science"
        }
    ],
    "pdf_files": []
}