{
    "url": "https://www.nottingham.edu.my/thelibrary/Using/BookableRooms.aspx",
    "content": [
        {
            "p": "Several types of bookable rooms are available for use: a. Meeting Rooms in The Library * Devices for the LCD TV (remote control for LCD TV, keyboard, USB toggle and mouse) may be borrowed from the Customer Service Counter at Level B. Please note that there is no booking for these devices. The loan period for these devices is two hours, and no renewals are allowed. A fine of RM10 per hour, or part of, will be imposed for late return of the LCD TV devices. b. Meeting Rooms at Learning@The Core * Devices for the LCD TV (remote control for LCD TV, keyboard, USB toggle and mouse) at the Learning@The Core may be borrowed from the student adviser’s desk. Please note that there is no booking for these devices. The loan period for these devices is three hours, and no renewals are allowed. A fine of RM10 per hour, or part of, will be imposed for late return of the LCD TV devices. Postgraduate individual study rooms are meant for postgraduate students (PGs) only. PGs can make online bookings for a study room for up to three hours per session. The Multimedia room is located on Level D (3rd floor) at GD15. The maximum occupancy for this room is four (4) students at any one time. The room is equipped with six terminals: Use of terminals is strictly limited to library materials or items assigned by academic faculty. Students are allowed to book only one terminal in their name at any one session. An online booking for a terminal can be made for up to three hours per session. Entry into the multimedia room is via an access card which can be obtained at the Customer Services Counter. Please use the headphones provided to keep the noise level down. Before leaving the terminal you used, please ensure that it is clean and no personal belongings are left behind. If you are the last person to leave the multimedia room, please make sure that the lights are switched off and that the door is closed. No renewals are allowed for meeting-room bookings. Please see our contact page for telephone and email contact points."
        }
    ],
    "pdf_files": []
}