{
    "url": "https://www.nottingham.edu.my/thelibrary/FindingResources/GeneralGuide/index.aspx",
    "content": [
        {
            "p": "Single Sign-On (SSO) and How to search Single sign-on using University IT Account and basic search on NUsearch. Library Account The simplest way to access eBooks is through NUsearch. [ PDF guide ] Some eBooks may have restrictions on the number of simultaneous users. If you see an error message, please try again later. More eBook guides from different publishers can be found here. All students, staff and registered users with a valid University card are allowed to borrow material from the library. To check out the book, use the Self-Service machine. Your library loans will continue to auto-renew every day as normal unless they are requested by someone else. If auto renewal stops due to overdue or outstanding fines, please follow the guide on self-activation of auto renewal. [ PDF guide ] Explore NUsearch filter options to refine your search results. Databases are collections of primarily journal articles which covers different subject areas. NUsearch is our online discovery tool that provides access to variety of resources. You can search for databases by title or browse by subject area on NUsearch. More databases guides from different publishers can be found here. NUsearch is our online discovery tool that provides access to variety of resources. You can search for eJournals by title or browse by A-Z listing on NUsearch. You can search for journal article on a topic using NUsearch Search for ProQuest Ebook via NUsearch. [ PDF guide ] Some eBooks may have restrictions on the number of simultaneous users. If you see an error message, please try again later Use ‘Resource Recommender’ feature to following resources – databases, website, library information and guide. Prepare for upcoming exams with papers from previous years. [ PDF guide ] Eligible members who require books and other publications not held by the library may request for the interlibrary loans (ILL) service. [ PDF guide ] We are here to help and support. Get in touch by talk to us in-person or contact us via email, phone, social media or chat using MS Team. Search for VitalSource Bridge eBook via NUsearch. [ PDF guide]. All eBooks may have restrictions on the number of simultaneous users. If you see an unavailable message, please try again later. Meeting rooms are available in The Library and Learning@The Core for group discussion. They are required to booked in advance via NUSearch. [ PDF guide ] There is a dedicated individual study room provided for Postgraduates students at Level A. Online reservation at NUSearch is required to use this facility. The video below explains how to book an individual study room in the library. [ PDF guide ] Multimedia room is equipped with four multimedia-viewing terminals and one video-editing terminal. Use of terminals is strictly limited to library materials or items assigned by academic faculty. [ PDF guide ] You can easily pay the library fines at Customer Services Counter (cash) or pay online using our secure website. [ PDF guide ] All students and staffs who are eligible to loan can request for a Central Store item through NUsearch. [ PDF guide ] Place a request for a borrowed item from everywhere and anytime on NUsearch. [ PDF guide ] Request item(s) for KLTC Book Loan Delivery made easy via NUsearch. Eligible users are required to make a deposit before using the service [ PDF guide ] Search for DVD(s) collection on NUsearch and locate them at Level B. All users with a valid University card are allowed to borrow and access the Dissertations in the library. All users with a valid University card are allowed to borrow and access the Theses in the library. Library Induction NUsearch Online Reading Lists Databases eJournals BrowZine Past Exam Papers eTheses/ eDissertations Writing Effectively Please see our contact page for telephone and email contact points."
        }
    ],
    "pdf_files": [
        "pdf_files/NUsearch-Malaysia-Guide-Finding-eBooks.pdf",
        "pdf_files/NRenew-loan-items.pdf",
        "pdf_files/Ebook-Central-off-campus.pdf",
        "pdf_files/How-to-access-past-exam-papers-on-DSpace.pdf",
        "pdf_files/How-to-request-an-Inter-Library-Loan.pdf",
        "pdf_files/VitalSource-Bridge-off-campus.pdf",
        "pdf_files/How-to-Book-a-Meeting-Room.pdf",
        "pdf_files/How-to-book-PG-Study-Room.pdf",
        "pdf_files/How-to-book-the-facilities-inside-Multimedia-Room.pdf",
        "pdf_files/How-To-Pay-Fines-2017.pdf",
        "pdf_files/NRequest-central-store-item.pdf",
        "pdf_files/NReserving-loan-item.pdf",
        "pdf_files/How-to-pay-for-KLTC-BLD-Deposit.pdf",
        "pdf_files/KLTC-NBook-Loan-Delivery.pdf"
    ]
}