{
    "url": "https://www.nottingham.edu.my/thelibrary/Using/LaptopLoan.aspx",
    "content": [
        {
            "p": "Students can borrow laptops for part of the day. These laptops and its accessories (Power and VGA Adapters) can be borrowed from the Customer Services Counter or student adviser’s desk at Learning@The Core. The laptops are only for use in the library or Learning@The Core and cannot leave each respective building once borrowed. You must have a valid University ID card to borrow and use a laptop and their accessories (Power and VGA Adapters). For Library, the conditions for borrowing a laptop are covered in the Borrower’s Agreement for the Library Laptop Loan Service. For Learning@The Core, the conditions for borrowing a laptop are covered in a separate borrower’s agreement. You can only have one laptop checked out at one time and the loan is not transferable. At The Library A laptop can be borrowed up to three hours per session and can be renewed only once on the same day. At Learning@The Core Laptops and their accessories (Power and VGA Adapters) are available for borrowing from the student adviser’s desk at Learning@The Core up to three hours per session, starting from 10am, on weekdays and weekends. Designated laptops with relevant labels and numbering can only be used in the library and Learning@The Core. While, tablets can only be used in the Learning@The Core. Keep the laptop with you at all times as you are personally responsible if it is lost, stolen or damaged. The hard drive cannot be used for temporary or permanent storage of files. Security software reconfigures the laptop and tablet each time it’s rebooted erasing any files on the hard drive Laptop plug-in points are available at all floors of the library and discussion tables of Learning@The Core. Wireless access to the university network is available at the library and Learning@The Core. Please ask staff at the Customer Services Counter or student advisers at Learning@The Core for advice on using the laptop or contact IT Support Helpdesk at 03 8924 8199. Library laptops must be returned in person to the circulation desk and cannot be returned anywhere else. While, Learning@The Core laptops must be returned in person to the student adviser’s desk and cannot be returned anywhere else. Laptops and all their accessories must be returned on time. You must report any problems with the laptop to The Library staff or student advisers when returning it. Laptops are free to borrow, although there is RM10 fines per hour or part of an hour if returned late. Any damage to the laptops may incur reimbursements of up to RM1,000. At the Library Late returns of laptop set (laptop, power supply adaptor, mouse) will incur a RM10 fine per hour or part of an hour. Non-return will incur a fine of RM4,500 for the library laptop and RM300 for the power supply adaptor. Any damage to the library laptop may incur reimbursements of up to RM1,000. At the Learning@The Core Late returns of laptop, power supply adaptor or mouse will each incur a RM10 fine per hour or part of an hour. Non-return will incur a fine of RM4,500 for the Learning@The Core laptop, RM200 for the laptop power supply adaptor and RM50 for mouse. Any damage to the Learning@The Core laptop will incur reimbursements of up to RM1,000. Laptops may be renewed if there is no booking for the item. A renewal can only be done once in a day which means that the maximum number of hours a laptop can be checked out by a user is six hours per day. Library laptops must be returned to the Customer Services Counter, and Learning@the Core laptops must be returned to the student adviser’s desk before they can be checked out again. Please see our contact page for telephone and email contact points."
        }
    ],
    "pdf_files": [
        "pdf_files/Borrower-Agreement-for-the-Library-Laptop-Loan-Service.pdf",
        "pdf_files/Borrower-agreement-laptop-and-tablet.pdf"
    ]
}