{
    "url": "https://www.nottingham.edu.my/thelibrary/Using/Inter-LibraryLoan.aspx",
    "content": [
        {
            "p": "Eligible members who require books and other publications not held by the library may request for the interlibrary loans (ILL) service. We, however, cannot guarantee that it will be possible to borrow every item you need. This service is provided to all registered borrowers, except for external borrowers, in connection with their academic and teaching purposes. The service is available to the following registered members: RM5 each. * Any additional requests above the maximum number of requests are charged at RM15 each. Research postgraduates Use the Interlibrary Loans form in NUsearch. [Guide PDF ] Within NUsearch, click on your name in the top frame, and select \"My Requests\". The progress of your requests will be indicated in the status column. It is usually not possible to cancel a request after it is processed. However, if you contact ILL staff, they will advise you accordingly. If you make a mistake and you wish to cancel a request immediately after keying it in, within NUsearch click on your name in the top frame, select “My Requests”, click on “Cancel” button. You will receive an ILL notification email. Please check if your university email in the system is accurate. If the requested item in digital format, it will be delivered to your university email. On the other hand, if the requested item in printed format, you will need to collect it from the Customer Services Counter of the Library and you are required to sign a copyright-declaration form before the item can be released to you. Interlibrary loans item should be returned to the Customer Services Counter on or before the date given by ILL staff. Fines are charged for items which are returned late at the rate of RM1 per day. Please see our contact page for telephone and email contact points."
        }
    ],
    "pdf_files": [
        "pdf_files/How-to-request-an-Inter-Library-Loan.pdf"
    ]
}