{
    "url": "https://www.nottingham.edu.my/thelibrary/Using/LearningSpaces.aspx",
    "content": [
        {
            "p": "Learning spaces across the campus are opened to all students and staff. Learning@The Core is located on Level A, Block H and Learning@Vetro is on Levels B & C, Block F3. These learning spaces are currently opened from Mondays to Sundays, but closed on public holidays. For more details, please refer to our opening hours. These newly available spaces offer the opportunity to create a new, vibrant and cutting edge learning spaces, showcasing new services, innovative technologies and a variety of individual and group learning and study areas to support student preferences. Latest supportive technologies with full WiFi coverage, including PCs, AV (mobile and fixed smart screens, plasma/computer combinations) and a number of loanable laptops are made available. Print/copy/scan facilities are also provided. A help point at Student Adviser's desk is provided which will be staffed by a group of trained PG student advisers working on shift rotation to handle enquiries and provide academic peer support to users at Learning@The Core. Please be reminded that these learning spaces are university-wide facilities and are to be shared by all staff and students. We hope users will be considerate and observe the rules and regulations when using the facilities and equipment. Student advisers manning the Learning@The Core are empowered to enforce discipline on any student(s) found violating the regulations. IThe Library and Estates Office reserve the right to close the learning spaces if there is any abuse or mishandling of the facilities and equipment. The conditions for borrowing a laptop and tablet are covered in the Borrower’s Agreement for the Learning@The Core Laptop and Tablet Loan Service. For plasma smart-board/screen and LCD TV screen devices, their borrowing conditions are covered in a separate borrower’s agreement. A. At the Library Plasma smart-board/screen devices are available for borrowing from the library's Customer Services Counter from 8.30am on weekdays and 10.30am on weekends. A set of plasma smart-board device consist of a wireless mouse, keyboard, USB adaptor (toggle), smart pen, and remote control. In comparison, a set of plasma screen devices consist of all items available in a plasma-smart-board-device set, except lack of the smart pen. A valid University ID card is required to borrow a set of plasma smart-board device. You can only have one set of plasma smart-board/screen devices checked out at any one time, and the loan is not transferable. Plasma smart-board/screen devices can be borrowed within several two-hour slots for weekdays and weekends are as follows: B. At Learning@The Core Laptops, plasma smart-board and LCD TV screen devices are available for borrowing from the student adviser’s desk at Learning@The Core within several two-hour slots, starting from 10am, on weekdays and weekends. A set of plasma smart-board devices consist of a wireless mouse, keyboard, USB adaptor (toggle), smart pen, and remote control. In comparison, a set of LCD TV screen devices consist of additional set of Airpad, and all items available in a plasma-smart-board-device set, except for the smart pen. A valid University ID card is required to borrow a set of laptops, tablets, plasma smart-board or LCD TV screen devices. You can only have one set of plasma smart-board or LCD TV screen devices checked out at any one time, and the loan is not transferable. In addition, you can only borrow either a laptop or tablet at Learning@The Core, and the loan is also non transferable. Keep the plasma smart-board/screen or LCD TV screen devices with you at all times, as you are personally responsible if it is lost, stolen or damaged. Please ask staff at the circulation desk or student advisers at Learning@The Core for help, if you have trouble using any of the plasma smart-board and LCD TV screen devices. The plasma smart-board/screen devices must be returned in person to the Customer Services Counter. The devices cannot be returned anywhere else. B. At the Learning@The Core The laptops, tablets, plasma smart-board and LCD TV screen devices must be returned in person to the student adviser’s desk. The devices cannot be returned anywhere else. You will incur fines for late return of items. The current fine rates for late return of items are as follows: If your fines build up to RM20 or more, your library account will be blocked. You will not be able to borrow, renew, or reserve items until the fine is paid. Find out more about paying fines. To check the date and time your items are due back log on to your user account on NUsearch and click on \"My Library Card\". Non-return of a set of plasma smart-board/screen or LCD TV screen devices will incur a fine of RM600. Non-return of individual items of the plasma smart-board/screen or LCD TV screen devices will incur the following fines: a. wireless mouse : RM150 b. keyboard : RM150 c. USB adaptor : RM150 d. smart pen : RM250 Damage to a plasma smart-board or LCD TV screen device may incur replacement costs of up to RM250. Borrowing of a set of laptops, tablets, plasma smart-board/screen or LCD TV screen devices may be renewed if there is no booking for the set. A renewal can only be done once in a day, which means that the maximum number of hours the devices can be checked out by a user is six hours per day. Laptops, plasma smart-board/screen or LCD TV screen devices must be returned before they can be checked out again. Please see our contact page for telephone and email contact points."
        }
    ],
    "pdf_files": [
        "pdf_files/Borrower-agreement-laptop-and-tablet.pdf",
        "pdf_files/Borrower-agreement-smartboard-devices.pdf"
    ]
}