{
    "url": "https://www.nottingham.edu.my/thelibrary/FindingResources/ORIS.aspx",
    "content": [
        {
            "p": "The Library is proactive in promoting the use of the information sources and developing skill sets and knowledge in information searching among staff and students. A team of library staff is dedicated in delivering special programmes and information skills tutorials in an effort to enhance information literacy. Generally, library induction and orientation programmes are conducted for new students joining the university at all levels. Working in collaboration with the Schools, information skills sessions and tutorials are designed according to their needs, based on the level of the students and are mainly subject focused. The advanced sessions incorporate instructions in managing bibliographic citations and references and the use of EndNote and Mendeley. Available information skills sessions and tutorials can be viewed from the “Schedule of ORIS Tutorials” and are open for booking to the Schools. The Reference Desk is open on Mondays to Fridays from 11.00 a.m. to 5.00 p.m. We offer reference services and assistance to anyone who has need for a personalised service. An electronic service is also made available. Please send enquiries to: libraryservices@nottingham.edu.my Information skills enable the researcher to recognise the type of information they require and how to locate, evaluate and use the information effectively to support their mode of study or research. Information skills enable: The Reference & User Education unit of the library carries out a range of information skills training for both students and staff at the University: Tutorial session topics include: If you would like to request a session, please contact our staff by walk-in to Reference Desk, Level B of Library building. Telephone: 03-8924 8319 or email: libraryservices@nottingham.edu.my Types of ORIS tutorial sessions offered: Studying Effectively is a series of webpages from UK main campus that introduce students and staff to library services and the effective use of information and material. Content also includes advice on study skills. Please see our contact page for telephone and email contact points."
        }
    ],
    "pdf_files": [
        "pdf_files/ORIS-September-2020.pdf",
        "pdf_files/ORIS-September-2020.pdf"
    ]
}