{
    "url": "https://www.nottingham.edu.my/thelibrary/Induction-for-New-Students/index.aspx",
    "content": [
        {
            "p": "Welcome to the Library! After completing this session, you will become familiar with library services we offer to assist your online learning and to access library resources remotely. In addition, you will get a preview of library services and facilities you can use when everyone is back on campus. NUsearch is our online library discovery tool. Use it to search and access our extensive physical and electronic library collections. You'll find books, journals, articles, videos, theses, manuscripts, databases and much more. It's a gateway to quality and trusted resources. Learn more about how to access these eResources with NUsearch by following the guide [ PDF ] What is an eBook? An eBook is a book-length publication in digital form that you access online. Our Library offers access to thousands of eBooks on a variety of subjects. eBooks titles are available in NUsearch, and can be accessed wherever and whenever you need them by using your University IT account to login. Information and guides on how to access different ebooks platforms, how to use and download ebooks can be found here. Electronic resources or eResources are available in electronic/digital form and cover online databases, eJournals, eBooks, and websites. Access to all these eResources is made available to all our university registered students by logging in to NUsearch with their University IT account. The Library provides guides on how to access eResources from different publishers in helping library users to get the best materials for your study and research needs. You can refer to eResources Guides on how to access these online resources which were categorised by subject. Research and information searching can be improved if appropriate knowledge and skills are adopted throughout your academic year. Improving your search skills can help you to: The comprehensive guide for information searching can be viewed here. For more information about ORIS sessions or tutorial that offers, please refer to our ORIS page. Our friendly Reference & User Education staff are happy to conduct online library sessions via Microsoft Teams upon request. Any request for online sessions will be during office hours (9am-5pm, Monday to Friday). Contact libraryservices@nottingham.edu.my to make an appointment. Follow us on twitter Follow us on instagram Library Induction NUsearch Online Reading Lists Databases eJournals BrowZine Past Exam Papers eTheses/ eDissertations Writing Effectively Please see our contact page for telephone and email contact points."
        }
    ],
    "pdf_files": [
        "pdf_files/NUsearch-training-for-foundation-students-September-2024.pdf",
        "pdf_files/NUSearch-Guide.pdf",
        "pdf_files/ORIS-Induction-for-New-Students.pdf"
    ]
}