{
    "url": "https://www.nottingham.ac.uk/ugapplicants/international-applicants/international-applicants.aspx",
    "content": [
        {
            "p": "Thank you for applying. As an international student... Preparing for results day I am on my way We're fully aware that your time will be taken up with your studies. However, please make sure your contact details are up to date so that we can reach you with key information. You can do all this by logging into UCAS Hub. Information is updated over the application cycle to keep you updated of any developments as they happen. You need to meet a certain level of written and spoken English. This is so you can get the most out of your course at Nottingham, which will be delivered in English. You can meet our requirements by taking an English test such as IELTS, or studying a presessional English course with us. Find out more about our English language requirements and the English tests and qualifications we accept. Our Centre for English Language Education (CELE) offers presessional courses to help you prepare and meet the required level in English before you start your undergraduate studies. Our Financial Support team provides information and advice on all aspects of student finance to current and prospective students. The university offers a number of bursaries and scholarships which are worth investigating and applying for – you could end up with more support than you were expecting. Be clear on what tuition fees you will need to pay. If you are unclear about your fee status please contact us. The university offers a range of international Undergraduate Excellence Awards to help towards your tuition fees. There may also be international scholarships offered by some schools and departments. If you will need a student visa to enter the UK, you must be able to show that you have enough money or funding to cover your first year of tuition fees and least nine months of living expenses. You can meet the English condition on your offer by passing an English test such as IELTS at the required level, or studying a presessional English course with us. Accommodation options The student visa application process involves several important documents and preparations, including academic and financial evidence, plus a Confirmation of Acceptance for Studies (CAS) which is issued by the university when you have an unconditional offer. It's important to plan your preparations early and follow the visa rules closely, to avoid any delays or mistakes which could cause a visa refusal. Use our 10-step application guide to help you prepare and apply. In order to apply successfully for a student visa, you must provide financial evidence that you have enough money or funding to cover your first year of tuition fees and least nine months of living expenses. The most common reason for visa refusals is not having the correct financial evidence or the correct amount of funding. Find out about our international Undergraduate Excellence Awards – there may still be time to apply. Select one of our accommodation options and start your application. Accommodation fees will only need to be paid once you have had your visa application accepted. Apply for accommodation If you are not studying A levels or the International Baccalaureate Diploma, we will not receive your exam results automatically, so you must provide them or arrange for them to be sent to us. It is your responsibility to forward official confirmation of all results included in your conditional offer to the university. The deadline for providing us with all of the results is specified in your offer, which you can view in UCAS Hub. When we have received your results we will assess your qualifications and update your offer status. In some cases we may still be able to accept students who have narrowly missed the grades stated in your offer conditions, so please wait for us to assess your results. If your results do not qualify you for your chosen course(s) – or if you want to change your study plans – you may be able to apply for another course through Clearing. When you're getting ready to join us and making your final preparations for study, check our Welcome webpages for checklists of things to do before and after you arrive, plus extra guidance on travel, money, health services, late arrival and more."
        }
    ],
    "pdf_files": []
}