{
    "url": "https://www.nottingham.edu.my/ugstudy/course/foundation-in-arts-and-education",
    "content": [
        {
            "p": "UNM/JPT-R2/010/3/0393(3/26)MQA/SWA0134 The UNM Foundation in Arts and Education is aimed at both Malaysian and International students who would like a good foundation for Undergraduate study in the University's Faculty of Arts and Social Sciences. The course covers a combination of academic skills and content specific modules, providing an introductory grounding within the social sciences discipline. The course also prepares students for challenging work on critical thinking, academic literacy and communication skills that, in turn, develop resilient, self-confident students. Learning outcomes: Learning outcome All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. SPM/GCSE/IGCSE 5 Bs, excluding moral studies and religious studies. Consideration to be made based on relevant subjects. Canadian Ontario Grade 12 Secondary School Diploma (OSSD) 70% average based on 6 subjects (consideration to be made based on relevant subjects) Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University's requirements Applicants who are planning to progress to undergraduate programmes offered by Nottingham University Business School must have at least grade B in Mathematics at SPM/ GCSE/ IGCSE/ High School Diploma or equivalent. Applicants who have successfully completed 12 years of education (definitions will vary according to school system) and meet the entry requirements for the programme, may be eligible to apply for the 2-semester programme. Acceptance is at the discretion of the University. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we also consider applicants' personal statement, references and interview performance (if you have one) when making a decision. The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. This is a pre-university programme that prepares students for degree programmes in the arts, humanities and education. Example of courses that you can pursue with this foundation include: This programme is designed to provide students with all the necessary knowledge and skills to succeed at the undergraduate level. The minimum entry requirement for this programme is 5Bs in SPM, or equivalent. Students who intend to enter into Nottingham University Business School upon completion of their foundation year must have a minimum of grade B in their Mathematics. There are also English language requirements as all classes are taught in English. A main benefit of this course is that students will be equipped with a solid foundation of knowledge and skills to succeed in degree programmes pertaining to the arts, humanities and education. Students will also develop critical thinking, problem-solving, and communication skills, all of which are essential for success in any and every field of work. Graduates of this foundation course can pursue a variety of career opportunities, such as teaching, research, public service, and other professions in the arts and humanities sector. However, it is likely that you’ll have to start with an entry-level position without an undergraduate degree. Upon completion of this foundation course, students can pursue degree programmes in a variety of fields. At UNM, students can also choose to progress to courses offered by Yes, there are scholarships and financial aid for both Malaysian and international deserving students. This content was last updated on 16 October 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}