{
    "url": "https://www.nottingham.ac.uk/ugstudy/parents/support.aspx",
    "content": [
        {
            "p": "As a parent of a university student, you'll want to be certain that your child is happy, safe and well during their studies. Here are some of the sources of support available to Nottingham students and some of our policies you may need to be aware of. We offer a comprehensive range of support services for our students' welfare and wellbeing while studying with us. These include: Find out more: search our services for students All our students have a University of Nottingham IT account with an email address, Microsoft 365 services and access to a range of university systems, which can include online course materials and lecture recordings. We recommend all students have a suitable laptop for their university work as well as a smartphone or tablet – this second device is needed for multi-factor authentication, which is a security feature for accessing online services. WiFi internet access is available across all campuses, university buildings and accommodation sites. Our IT staff provide inductions, remote and in-person support for students' IT issues, plus a laptop repair service. Find out more about IT services and device recommendations in our IT induction pages. Nottingham is generally a safe and friendly place to live, study and socialise but – as with anywhere – students should take sensible precautions like keeping valuable items such as laptops and bicycles secured, and avoiding poorly lit areas if walking home alone at night. You can find more safety advice for students on the Complete University Guide website. There are security staff on campus at all times, and some public safety initiatives in the city centre, recognised in Nottingham's Purple Flag Award. It's important to avoid falling for financial scams, which sometimes target students, such as phishing emails. We provide guidance and support on IT security for our students. They should also watch out for unexpected phone calls from fraudsters pretending to be police or other authorities and demanding payment or personal details. See for example a scam targeting international students. We treat all students as mature and independent adults, and this means treating their information confidentially. We cannot discuss issues such as your child's university application, academic progress, finances or health with you without their consent. Find out more in our privacy policy. The university does not ordinarily communicate with students' parents or family members – although you may be contacted in very rare circumstances if you are nominated as an emergency contact. If your child will be less than 18 years old when they begin their course, you will need to sign a parental consent form when they apply. The university will not act in loco parentis (in the role of a parent) but we recognise that students under 18 may have additional support and welfare needs. Parents or guardians outside the UK must nominate somebody UK-based to act as guardian while your child is under 18. This may be a relative, family friend or an approved guardianship agency. Find out more in our under 18 guidance page, which includes the parental consent form, guardianship agencies and our safeguarding policy. See answers to some of the frequent questions friends and family ask about supporting the students they know. Our site makes use of cookies. See Cookies for details."
        }
    ],
    "pdf_files": []
}