{
    "url": "https://www.nottingham.edu.my/ugstudy/course/international-communication-studies-ba-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/321/6/0194(3/26)MQA/SWA0173 The School of Media, Languages and Cultures offers several three-year Honours degree programmes in International Communications Studies. These courses combine knowledge in the study of communications, journalism, media, film and cultural studies with foreign languages. Our degrees offer global perspectives or the various aspects of communication, media, and culture. Degrees offered in Malaysia are mirrored on those in the UK and China thus enabling mobility and the sharing of materials and resources between campuses. Optional modules in Film and Television Studies, English Languages and Literature along with Performing Arts provide further avenues for specialisation and additional career options. Students learn from native speakers and use the International Language Studio which offers flipped-classroom teaching and blended learning to improve the student experience when learning a foreign language. Our Digital Media Lab enhances media production opportunities for students doing module assignments and media production exercises including filmmaking, audio and podcasting; and colour grading for video. Media and communications underpin almost every facet of modern life, from the global economy to interpersonal relationships and our leisure time, to how we learn about the world we live in. With digitisation and convergence only accelerating this trend, there is an ever-increasing need to understand the implications of these developments and to gain the skills and knowledge necessary to participate in shaping global media and communication infrastructures. International Communications explores the complex world of communications, culture and media in their various forms including linguistic, multimodal and visual – from new technologies, politics and popular culture, to critical theory, high culture and news media. The degree will train you in the theories and realities of local and international media and communication, enabling you to develop the analytical, creative, practical and problem-solving skills needed to succeed in our globalised society. Students will learn and practise the four skills of listening, speaking, reading and writing together with basic grammatical structures. This will enable them to manipulate the language and participate effectively in everyday social situations. Learning outcomes: Learning outcomes: The module aims to introduce students to: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Arts and Education is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Arts and Social Sciences. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as politics, the world economy, media and education. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. An international communications degree is your passport to a variety of rewarding professions. Likely career fields include the audio-visual, digital and print media industries, marketing, production, public relations and research. Graduates with a passion for language can pursue interpreting, publishing and translation roles while others may continue their studies and pursue research and/or teaching degrees. Many of our graduates go overseas to work at universities in South Korea, Japan, China, and Europe. Some of our graduates have pursued postgraduate study at LSE, National University of Singapore, Mahidol University (Thailand), Oxford University and the University of Nottingham campuses in both China and the UK. UNM’s International Communication Studies BA (Hons) is an undergraduate programme that focuses on the study of communication in a global context. Students will have the opportunity to explore the theories, practices, and challenges of communication across various cultures, media platforms, and international settings. The entry requirement for this degree programme is a pre-university qualification. Students taking the A Level will need a minimum of BBC, while those who sit for STPM need a BBC+, excluding general studies. For students who have just completed their high school diploma, UNM’s Foundation in Arts and Education offers a direct path progression into this course. This programme covers a wide range of subjects related to international communication, such as intercultural communication, media and globalisation, digital communication, public relations, journalism, and advertising. Graduates of this programme can pursue various career paths in international media organisations, public relations agencies, advertising firms, multinational corporations, non-profit organisations, and government agencies. Job opportunities include international communications specialist, media consultant, public relations officer, digital content strategist, cross-cultural communicator, and more. Yes, there will be opportunities for international experience with our study abroad or exchange programmes. Students will be able to immerse themselves in different cultures, develop intercultural communication skills, and gain a global perspective on communication practices Yes, we provide internship opportunities for students to gain practical experience in this field of work. These internships can be with local or international organisations, media companies, advertising agencies, or other relevant institutions. Yes, UNM offers scholarships and financial aid for Malaysian and International students who meet the criteria This content was last updated on 09 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}