{
    "url": "https://www.nottingham.ac.uk/ugstudy/parents/nottingham.aspx",
    "content": [
        {
            "p": "We're delighted that your child is considering the University of Nottingham as a possible study destination. Here is some useful information and links to help inform their decision-making. We hope that you'll also have the opportunity to join us for an open day or meet us at other events or online. Find out more about your options below. The University of Nottingham is a member of the UK's prestigious Russell Group and the Universitas 21 global network. Beginning as a civic college in 1881, we have had university status since 1948, and have awarded over 300,000 University of Nottingham degrees since then. We're ranked 18th in the UK by both The Times Higher Education World University Rankings 2022 and the QS World University Rankings 2023. We're also ranked in the UK's top 30 universities by The Complete University Guide 2024 and The Times and The Sunday Times Good University Guide 2022. Find out more about our rankings and achievements. Individually, many of our courses and subject areas are ranked highly in subject rankings such as the QS World University Rankings by Subject. Some courses are accredited by relevant professional bodies to recognise them as meeting industry standards. Check individual course pages for details of subject rankings and accreditation. The university has a strong reputation for employability and career support. We're a world top 70 university or UK top 10 in the QS Graduate Employability Rankings 2022, and we're the second most targeted university by top employers, according to The Graduate Market in 2022 by High Fliers Research. Our Careers and Employability Service offers a range of careers guidance and resources, including paid internship and placement schemes for students to develop their career skills and gain professional experience during their studies. Some degree courses also include a year working in industry as a part of the course. Nottingham has a great reputation for sport with a strong performance in BUCS leagues, sports scholarships for top athletes and some of the UK's best university sport and fitness facilities. We were The Times Good University Guide's Sports University of the Year in 2019 and 2021. Our Students' Union is home to more than 200 student-run clubs and societies, covering sports, hobbies, interests, media, performing arts, politics, cultures, faiths and more. The university and the SU also offer a wide range of support and advice for students – find out more in our practical information for parents. There are opportunities to study abroad available for most undergraduate students, either as an essential component in some courses or as an optional exchange or study abroad programme. This may be for a full year or for a semester. It could be at one of our international campuses in China or Malaysia or at one of our many partner universities around the world. Our campuses are scenic and sustainable with innovative architecture, green spaces, student accommodation, and excellent facilities for study, sport and leisure. The campuses are connected by a free hopper bus for students and staff, and public buses and trams run to the city centre. You can explore the campuses online in our virtual tour, attend an open day or come for a visit to see them in person. Nottingham city is a very popular destination for students, ranked 9th in the UK and 53rd in the world in the QS Best Student Cities 2022 ranking. Our students find it has a very affordable cost of living, plenty to explore, and plenty of choices for shopping, food, nightlife, sport and entertainment. It's also a Purple Flag Award winning city, meaning it's nationally recognised as a safe, diverse and enjoyable city to spend time in. Our 2022 autumn open days will take place on: They will include a talk for parents and carers, as well as a range of other talks, campus tours and much more. Find out more and book your place If you can't attend an open day, you may wish to book a campus tour or attend a virtual event if there is one coming up. Find out more about your options for visiting us. For international students in other countries, you may have the opportunity to meet with our International Student Recruitment team at an event in your country or you can get in touch with our official overseas representatives. We also have a variety of of ways to connect with us online. You can: Our site makes use of cookies. See Cookies for details."
        }
    ],
    "pdf_files": []
}