{
    "url": "https://www.nottingham.edu.my/ugstudy/course/international-relations-with-spanish-ba-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/313/6/0019(10/24)MQA/SWA0155 The core curriculum offered by the School of Politics, History and International Relations (PHIR) is International Relations. The school's areas of strength in this field embrace global political economy, international security, multilateral institutions, international development, cross-national relations in the Asia-Pacific, China's foreign policy and regionalism in the European Union and Southeast Asia. What is more, the school offers course modules that look back at the historical record of regions and countries, estimating that a good predictor of what will happen next in the world is shaped in part by key occurrences and weighty trajectories. Course modules include 19th century Europe, modern Asia and the Malay world. In the first year, students take course modules that provide the basic concepts and frameworks that are needed for the further study of political science and history. In Year two, students focus more closely on specific country experiences and problematic areas whilst those who qualify may choose to study overseas with a variety of exchange partners. Students may also take courses offered by other schools in the faculty, for example in media and culture. In Year 3, the programme's final year, staff teach courses that feature their respective research specialisations, injecting personal experience and focus into study material. Throughout PHIR's three-year programme students are trained in research & writing skills along with both individual and team-based presentation skills. These things combined provide capacity for argument and debate, which is so vital in today's professional workplace. They learn to compose persuasive position papers, scholarly essays, and lengthier, insightful and substantive works. Throughout their studies PHIR's students learn about themselves, each other, their own social class and society along with the world with whose reward structures and serious challenges they must engage Starting in the 1980s, standard coursework in the discipline has centered on the globalisation of economic and political dealings, democratic transitions, steady development, and international peace-keeping. Since then we have been suddenly confronted by a world of economic de-coupling and bifurcation, democratic recession and outright reversals, intense superpower shifts in ascendancy and attendant rivalries, gross social disparities across countries and within societies, surging populism and finally, hyper-nationalism. These syndromes can be accelerated by social media activity and pandemics raising issues even further. Governments and businesses everywhere are in urgent need of a new generation of young scholars who are able to understand, communicate to others and help to resolve the severe challenges that the world now faces. PHIR's programme in International Relations is conducted in Malaysia, the center point of the Southeast Asian setting and therefore offering an excellent opportunity and incubator in which to begin one’s studies. By the end of the module you will: Learning outcomes: To provide a broad introduction to the history, politics, and economics of the European Union. Also, to introduce students to the study of the European Union from a political economy perspective. Students will learn and practise the four skills of listening, speaking, reading and writing together with basic grammatical structures. This will enable them to manipulate the language and participate effectively in everyday social situations. Learning outcomes: *Spanish only All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. Applicants for degree programmes with a language minor must have no prior knowledge of that language. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Arts and Education is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Arts and Social Sciences. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as politics, the world economy, media and education. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. New graduates from PHIR begin and develop their careers in multiple areas. Many start with placements in management development, often these are medium-sized companies where a broad-base of competencies that have been acquired during the course are unequalled. Through skills gained in research and report writing, presentations and team work, students can advance the development of the firms for which they now work, as well as their own experiential records. Others specialise along particular tracks of professional engagement that relate more closely to their training. These include international market research, political risk analysis, consultancy training, journalism, education, advocacy, cause-oriented or civil society activity. In all of these areas, PHIR's new graduates find that their special awareness of global dynamics enhances their attractiveness as they approach employers in government agencies, businesses, the professions, and non-governmental organizations aspiring to take their productive place in the world of work. New graduates drawn to advanced academic work tend to enrol in post-graduate programs, typically at Master's level in order to undertake further study and obtain advanced degrees. Many advance to postgraduate study with us, enrolling on our postgraduate taught International Relations or International Development Management programmes whilst others go onto further study at other leading universities around the world. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}