{
    "url": "https://www.nottingham.edu.my/ugstudy/course/international-business-management-bsc-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/345/6/0883(3/26)A10434 A Nottingham University Business School BSc in International Business Management focuses on international business strategy and globalisation. During the course you will be exposed to a range of general management subjects, such as accounting, business information technologies, economics, finance, and quantitative methods. Special emphasis is placed on business and management in an international context including cultural, legal and political conditions affecting business in a multinational context. Your individual interests and career aspirations are very important to us and by selecting from optional modules alongside your core subjects you will have greater input into the future path you wish to take. You can choose from subject areas within or outside the Business School that will broaden your skills and knowledge. Students on this programme frequently choose to take optional modules in international communications studies and international relations, complementing the business focus of the core curriculum. We also offer the opportunity to gain a global perspective by studying abroad at our campuses in the UK, China or at a partner institution. In this module you will gain an advanced understanding of the function of a wide range of markets for the production, exchange, and consumption of goods and services. We will examine how people perceive the choices available to them, and assess the associated risks, to make optimal decisions. We will also explore the nature of competition in dynamic markets, and the approaches that companies take to gain temporary and lasting advantage. Change is at the heart of our teaching. You will learn about innovation and the impact of disruptive technologies, such as digital platforms that create new markets, and how transformation occurs whilst protecting consumers and building market resilience to achieve lasting social good, and how greater environmental awareness is impacting and changing market behaviours. The purpose of this module is to develop an understanding of the contexts in which markets develop, and marketing and consumption are practiced, to enable students to develop a personal and critical perspective prior to studying the technical aspects of marketing management. Learning outcomes: This module will encourage students to: To introduce the context and essential techniques of accounting, including double-entry bookkeeping, and to consider the uses of accounting both internally to the business (such as assisting in management decision-making) and externally (in the preparation of financial statements). The module provides an initial appreciation of the main concepts, elements and techniques of operations management and of the current landscape operations managers have to work in. It offers practical insights through case examples and exercises. By the end of the module, you should be able to: To introduce students to the basic ideas and concepts of organisational behaviour. To develop key mathematical and statistical techniques and their application to problems and data. To develop an understanding of the key theories and concepts in the development of society and the nature of work. Learning outcome: Plus, Either Quantitative Methods 1a (compulsory for students without a Grade C in A-Level Mathematics or equivalent) or Professional and Academic Development (compulsory for all other students). All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 79% average based on 6 subjects with at least 70% in Mathematics of Data Management. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. In addition to the entry requirements listed above, applicants must have grade B in Mathematics at SPM/ GCSE/ IGCSE/ High School Diploma or equivalent. This requirement can be waived if applicants have obtained at least grade C in mathematics at a higher level. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Business and Management is a 1+3 year programme that results in direct progression to the undergraduate degrees related to business and management. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such business economics, management and quantitative methods. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. At Nottingham University Business School we actively seek to develop our students’ practical skills through a range of professional development programmes. We have developed industry links to enable students to network with top employers throughout your degree via a range of activities. Our graduates are highly sought after with 90% of them securing graduate level employment or further study opportunities within 6 months of graduation. Recent Business School graduates have also gone on to work at prestigious companies including BDO, Deloitte, EY, KPMG, PwC, CIMB, Citi, HSBC, Hong Leong Bank, Maybank, Public Bank RBC, RHB, Petronas, Accenture, Cisco, IBM, Intel, Nestle, P&G, Unilever.* *Graduate Destination Survey data for 2017-2019 graduates. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}