{
    "url": "https://www.nottingham.ac.uk/ugstudy/parents/accommodation.aspx",
    "content": [
        {
            "p": "Our guide to student accommodation and campus life for your child applying to Nottingham. The University of Nottingham offers an extensive selection of both catered and self-catered student accommodation options with over 10,000 rooms available in 32 different halls. We can guarantee a room in university-arranged accommodation for at least the first year of the course – or up to the full duration of the course for international students – as long as they apply before our guarantee deadline and responds to their accommodation offer promptly. See our accommodation terms and conditions page for full details of the guarantee. The halls of residence on University Park Campus and Jubilee Campus are offered as catered accommodation, meaning that 17 meals per week are included as part of the accommodation package. Morning and evening meals are served in the halls and students can take their lunch in various outlets on campus. All fees for catered halls include internet access, all utilities, personal contents insurance, access to a launderette, and bike storage facilities. There are numerous self-catered accommodation options too, mostly a short walk away from our campuses. In most cases they will share communal spaces with a few other students, including a kitchen in self-catered accommodation. Depending on the accommodation site and options chosen, they may share a bathroom or select to have an en-suite bathroom in their room. See our accommodation webpages for details of specific halls and sites. Accommodation options Many students going into their second and third year choose to rent or share houses, flats, or other private accommodation. There are several popular residential areas for students around our campuses in Nottingham, such as Dunkirk, Lenton, Radford and Beeston. See our guidance on private sector accommodation. The Students' Union also provides housing advice on many aspects of finding and renting private accommodation and can support you on a range of issues. As well as accommodation and teaching facilities, our campuses come with: Our campuses are a safe and secure environment with security staff available at all times. Many of our halls of residence and accommodation sites also have their own staff on site 24/7. Nottingham city centre has been awarded the Purple Flag Award every year since 2010, recognising it as a safe, diverse and enjoyable environment. The City Council, police, Nottingham Business Improvement District, the university and other organisations work on a variety of initiatives to keep the city safe and welcoming. See our support and wellbeing page for more guidance on student safety and welfare. Our site makes use of cookies. See Cookies for details."
        }
    ],
    "pdf_files": []
}