{
    "url": "https://www.nottingham.edu.my/ugstudy/course/mathematics-and-management-bsc-hons",
    "content": [
        {
            "p": "UNM/JPT-R/461/6/0010(4/27)MQA/SWA9674 The ability to reason quantitatively and logically lies at the heart of many management decisions. This course is designed to equip students with the skills needed to succeed in a wide range of business and management careers. This degree is designed for a comprehensive education in mathematics, probability and statistics integrated with the theory and practice of business management and entrepreneurship. No previous knowledge of management or business studies is assumed. Studying mathematics and management at the University of Nottingham Malaysia allows students to expand their mathematical knowledge while gaining sound business awareness. The course will help students to gain a wide range of problem-solving skills in order to become a sought-after graduate for logical thinking, statistical and strategic managerial positions. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. BBB, including Mathematics, excluding critical thinking and general studies. 79% average based on 6 subjects with at least 70% in Advanced Functions and Calculus and Vectors. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. Successful completion of the Foundation in Engineering or Science programme with a minimum of 50% in all mathematics modules. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we also consider applicants' personal statement, references and interview performance (if you have one) when making a decision. The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Engineering or Science is a pathway for students to pursue a BSc (Hons) in Mathematics and Management. Modules on the programme aim to improve language and study skills as well as enhance understanding of mathematics and the physical sciences. Successful completion of this programme with no failed modules and a minimum of 50% in all mathematics modules are required for progression to the BSc (Hons) Mathematics and Management. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. This programme is a joint honours degree offered in conjunction with the Nottingham University Business School (NUBS). It prepares students for careers in finance, commerce, mathematical and statistical modelling as well as education. Students may choose to undergo further specialist training to qualify as accountants, actuaries and teachers or work in areas such as insurance, research and development, administration or management. This applied mathematics course is an interdisciplinary undergraduate degree that combines the study of mathematics with essential management principles. It is designed to equip students with a strong foundation in both management theories and mathematical concepts, thus equipping them for careers that require a unique blend of analytical problem-solving skills and business acumen. Because this programme combines mathematics and management, students will gain a comprehensive skill set that is highly valuable in today’s competitive job market. Graduates of this programme will possess: UNM’s Mathematics and Management BSc (Hons) offers some flexibility for customisation. You can choose from a list of typical core modules that align with your interests and career aspirations. Yes, we realise the importance of practical experience and hence, offer opportunities for internships or industry experiences during this programme. Students will be able to apply their mathematical and management skills in real-world settings to gain valuable experience and build professional networks. Students will need a pre-university qualification such as A Level or STPM, and meet the criteria as stated above. For students who have just completed their secondary or high school education, UNM’s Foundation in Engineering or Foundation in Science offers a direct pathway to this course. Graduates with this degree have a versatile skill set and can pursue roles such as: Yes, UNM has a study abroad programme that provides its students with the opportunity to study in the UK or China to broaden their horizons. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}