{
    "url": "https://www.nottingham.edu.my/ugstudy/course/mechanical-engineering-meng-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/521/6/0125(3/28)MQA/FA4886 Mechanical Engineering MEng (Hons) is a course available under the The Department of Mechanical, Materials and Manufacturing Engineering. Courses in mechanical engineering are made up of lectures, laboratory classes, workshops and design classes, covering the core engineering science and design skills needed to give students a solid foundation. In the Department of Mechanical, Materials and Manufacturing Engineering, students will gain a sound theoretical grounding along with hands-on experience in our labs and workshops. In addition, they will conduct investigations and turn designs into reality through extensive hands-on learning using Computer-Aided Design (CAD) software, Computer-Aided Engineering (CAE) and design projects. Our Mechanical Engineering programme was the first established amongst foreign universities in Malaysia. Our teaching facilities are well established and we provide diversified teaching expertise throughout the course. Students on this course are able to access our well-equipped workshop facilities allowing individual yet extensive hands-on practice and the mastering of workshop skills (machining etc). Our programme is proudly awarded with a 6-year accreditation status presented by the Engineering Accreditation Council (EAC) Malaysia. This is the longest of any university in Malaysia. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 79% average based on 6 subjects, including Advanced Functions, Calculus and Vectors and relevant science subjects. Consideration to be made based on relevant individual grades if specific subjects are required. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. The Mechanical Engineering degree at UNM publicised a diverse entry route into 1st year of the programme, e.g. A level, IB diploma, STPM, UEC, SAM, Canadian Pre-U and etc. In addition, UNM offer a 3-semester foundation programme to student who completed SPM (equivalent to GCSE O-level) and a 2-semester foundation programme to student who completed STPM or A level but could not attain the published entry requirements to the engineering degree. Graduates from the foundation programme who meet the minimum MEng performance benchmark will join 1st year of engineering degree programme. A minimum entry requirements for A-level at UNM is BBB, including mathematics and physics, but excluding critical thinking and general studies. The grade B in A-level PUM (Percentage Uniform Mark) ranging from 70-79 mark, i.e. equivalent to grade A in the university grading system as appropriate minimum quality standard for entry requirements. Although the Mechanical Engineering programme at UNM practices a slightly lower minimum entry requirements for A-level than the UK, our record showed that local student who participated in the UK mobility scheme for one year of the programme have demonstrated academic performance at par to the UK cohorts. There should not be distinction in quality of the graduates since we follow the same progression and award classification rules as the UK. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Engineering is a 1+4 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Engineering. Modules on the programme aim to improve language and study skills as well as enhance understanding of mathematics and the physical sciences. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway from thermal science or chemistry to electricity and magnetism. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. The course covered a diversified area of Mechanical Engineering, and therefore the profession of Mechanical Engineering is deemed to be one of the most stable profession. Our graduates are employed in various industrial sectors including Aerospace, Automotive, Manufacturing, Power Generation, Bioengineering, Electrical and Electronic Systems, Renewable Energy, Nanotechnology, Oil and gas Industries and Environmental Protection. Some graduates have progressed to postgraduate levels and/or obtained PhD degree both locally and overseas with some alumni currently employed as postdoctoral researchers and academics at universities worldwide. Many of our graduates move into managerial positions and/or achieve Professional/Chartered Engineer status during their working career. Our Engineering courses give students the opportunity to study abroad for 12 months, either at our UK or China campus or at a University within the Universitas 21 group. A Mechanical Engineering MEng (Hons) is a four-year undergraduate degree programme that aims to teach design, development and maintenance of mechanical systems and devices. It includes a range of interesting topics, such as materials science, thermodynamics, fluid mechanics and robotics. Admission requirements for this degree programme varies depending on the university. However, at UNM, individuals who plan to enrol need a minimum of BBB, including mathematics and physics in their A Level or STPM. Students are also required to be proficient in the English language. For aspiring students who do not have a pre-university qualification, UNM offers a Foundation in Engineering that will open the pathway for you to pursue this degree. In UNM’s Mechanical Engineering MEng (Hons) programme, students will learn about the various aspects of this field, including mechanics, thermodynamics, material sciences, manufacturing and design. Students will also be required to undertake an individual project in Year 4. Graduates can work as mechanical engineers in various industries such as aerospace, automotive, energy and manufacturing. One can also choose to pursue postgraduate degrees in mechanical engineering-related fields, such as UNM’s Mechanical Engineering MSc or Engineering MPhil/PhD. UNM’s Mechanical Engineering MEng (Hons) programme is a four-year, full-time course. Yes. UNM offers financial aid and scholarships for deserving students. Yes, you will have the opportunity to explore your interests and specialise by taking the optional modules offered. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}