{
    "url": "https://www.nottingham.edu.my/ugstudy/course/foundation-in-engineering",
    "content": [
        {
            "p": "UNM/JPT-R2/010/3/0394(2/26)MQA/SWA0150 Our Foundation programme in Engineering will give you a broad understanding of the fundamentals of engineering and provide a solid grounding in mathematics, physical sciences and programming subjects. After completion of the programme, students successfully proceed onto our BEng or MEng undergraduate engineering degrees. During the course, you will have opportunities to interact with students and lecturers across the Faculty of Engineering to help you to make an informed decision on the branch of engineering you wish to pursue. As an engineering student, you will spend a significant amount of time performing lab work as well as participating in tutorials, written assignments and attending lectures. There is a strong emphasis on the teaching of mathematical and physical sciences along with introductions to computer language and programmes. Furthermore, the course will explore study and research techniques essential for undergraduate level programmes. This foundation course in Engineering is an ideal entry pathway for our degree programmes. It will provide you with the academic skills and confidence to further your education while offering an automatic and unconditional place on one of our undergraduate degree courses upon successful completion. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 2 Semester Entry 70% average based on 6 subjects, including Advanced Functions, Calculus and Vectors and relevant science subjects. Consideration to be made based on relevant individual grades if specific subjects are required. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. Applicants who have successfully completed 12 years of education (definitions will vary according to school system) and meet the entry requirements for the programme, may be eligible to apply for the two semester entry. Acceptance is at the discretion of the University. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we also consider applicants' personal statements, references and interview performance (if you have one) when making a decision. The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. The University of Nottingham’s engineering foundation course is a one-year preparatory programme designed to provide students with a solid foundation in the basic principles of engineering. It is a jump start for students who aspire to pursue undergraduate engineering degrees, such as civil engineering, chemical engineering, electrical and electronic engineering, or mechatronic engineering. An engineering foundation course, such as this, offered by UNM, provides a comprehensive introduction to key concepts and principles of engineering. Students will also have the opportunity to explore different engineering fields and, thus, make more informed decisions when choosing the type of engineering degree they want to pursue. As mentioned above, there will be a combination of core engineering subjects and optional modules to choose from. These courses are designed to lay the groundwork for advanced engineering studies and provide a solid understanding of scientific principles that will be needed to succeed in your undergraduate degree. Yes, this foundation course provides a direct pathway to the undergraduate engineering degree courses offered by the Faculty of Engineering of the University of Nottingham. Upon completion, individuals can continue to pursue their studies in specific engineering disciplines at the undergraduate level, such as: Yes, students will not only learn through lectures and tutorials but also through lab sessions, computer sessions and practical classes, which provide the opportunity to apply theoretical knowledge in practical settings. Yes, students can explore opportunities for further studies abroad. The University of Nottingham has campuses in the UK and China and also a study abroad programme in which you can study overseas for a few semesters. Yes, UNM offers scholarships and financial aid to deserving students. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}