{
    "url": "https://www.nottingham.ac.uk/ugstudy/applying/extenuating-circumstances.aspx",
    "content": [
        {
            "p": "We appreciate that personal circumstances can have an impact on academic performance at school or college. If you believe that your studies have been disrupted we ask that you complete our Extenuating Circumstances Form below to let us know. We will not consider any extenuating circumstances cases without a form submission. The form should be completed as soon as possible once you have submitted your UCAS application. We understand that issues can occur after you have applied and you may need to inform us later in the year. The form will ask you to specify your current offer status with us so that we can apply the most appropriate actions. The deadline for submission of any extenuating circumstance form is the 31 July, but please note that unsuccessful applications will not be reconsidered if a course is closed. Any form submitted after this time will not be considered. Forms should be submitted by the applicant, but can be submitted by a third party such as a parent or teacher if you have the applicant's permission to do so. You should also ensure that your extenuating circumstances are reported to the examination bodies so that they can make appropriate adjustments. If you are applying to any of our 5 or 6 year Medicine courses, and your extenuating circumstances are in reference to your achieved qualifications (for example GCSE's), please note that the deadline to submit this information is 30 November. We also allow information regarding extenuating circumstances for achieved grades to be submitted pre-application for these applicants only, so that potential applicants can make an informed choice on whether to apply. If you are interested in this option please ensure that you provide appropriate evidence on your form and allow sufficient time before the UCAS closing date of 15 October to receive a decision. This Extenuating Circumstances policy only applies to applications for undergraduate courses applied to via UCAS. It does not apply to postgraduate (including Graduate Entry Medicine), institutional partnership, or exchange courses. This policy and process applies to applicants to the University of Nottingham. If you are a current student who wishes to submit an extenuating circumstances claim for your studies with us, see our Student Services extenuating services circumstances information. Extenuating Circumstances Form All extenuating circumstances claims must be appropriately evidenced. The information provided on the school reference is often sufficient, or we recommend providing an additional letter of support from your school or college as part of your form. Medical related circumstances should be supported with a doctor's note – this does not need to be specifically addressed to the University of Nottingham, and can be a scan of an existing letter about your medical condition. You will be able to attach relevant documents to the extenuating circumstances form, or upload them directly to your NottinghamHub account. All documents will be handled in confidence and in line with GDPR. If we require further evidence, we will get in touch via email. Neither of these lists are exhaustive and circumstances will be considered on an individual basis. We may be able to consider the following as examples of extenuating circumstances providing they have occurred within the duration of study of the qualification needed to enter the University of Nottingham (e.g. Year 12 or 13 for A Level applicants)*: * This is the maximum timescale we will consider. Some less severe circumstances will only be considered if they occurred during the examination period. We will not consider the following as examples of extenuating circumstances: You may wish to report these types of circumstances to your examination bodies for them to consider for appropriate adjustments. If you let us know about your extenuating circumstances before you have received a decision on your application, we will consider these when reviewing your application. Any conditional offer you are made will be the standard one you are eligible for – we do not make lower conditional offers for applicants with extenuating circumstances. We will then consider your circumstances again, including any submitted post-decision, when we receive your examination results to see if any additional flexibility can be applied (if this is to be needed). We are unable to consider extenuating circumstances after the publication and initial consideration of your results, and we will not consider extenuating circumstances during the Clearing process. Applicants to the University of Nottingham do not have a right to appeal the final outcome of an admissions decision. This remains true for those who have an extenuating circumstance in relation to your current study. Our site makes use of cookies. See Cookies for details."
        }
    ],
    "pdf_files": []
}