{
    "url": "https://www.nottingham.edu.my/ugstudy/course/education-ba-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/145/6/0068(12/25)MQA/SWA0406 The Bachelor of Arts TESOL programme is designed to equip educators to teach and interact with students of all ages where English is not their first language. With the usage of theory and pedagogical content knowledge, this three-year programme provides a sound comprehension of English language components to ease teaching and interaction with students and children. Students will learn to recognise evidence-based teaching in a relevant learning context and commit to equality, diversity, and inclusion (EDI) practices. Furthermore, students will gain leadership qualities and practice ethics and professionalism. This program allows a person to grow in the field of education. Being an educator is a devotion, it allows the action of physical teaching opportunities along with personal growth and development. This program allows a person to learn about themselves and others, take pride in the fact that they help many people’s educational and professional journeys and encourage learning from many different cultures and backgrounds. This module explores essential skills necessary for teachers to manage effective learning and teaching environments to maximise learning. Emphasis will be placed on how teachers can create motivating learning environments, develop self-regulation in learners, prevent and address behaviours that impede learning, and enhance behaviours that maximise learning. This module also introduces students to effective strategies for planning and implementing instruction, building healthy and sustainable relationships with stakeholders as well as organising time and the classroom. Learning outcomes: The module aims to provide an introduction to the role of a teacher and the influences that affect teacher identity as well as the influence teachers have on the learner. It considers what it means to be a professional and the social and ethical responsibilities of being a teacher. The module also aims to introduce students to the skills of portraying a school. It is like painting a picture of a high quality school and considering the leadership, physical environment, social atmosphere, academic programme, and the holistic development of students. Finally, the module aims to inform ways of how the school as an institution impacts the society and how all factors surrounding the society influences the school. The module provides an introduction to understanding and identifying the issues around working with pupils with special educational needs within the school context. It considers the ways in which these special needs can act as barriers to learning and examines how we identify and diagnose special needs and how different countries and systems deal with special needs in developing educational policy. The module provides an introduction to understanding the role literacy plays in school and society. It considers the ways in which new developments about the teaching of literacy can transform lives. This module provides an introduction to the economic, legal, social, and cultural factors that influence the relationships of individuals with children and young people. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Arts and Education is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Arts and Social Sciences. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as politics, the world economy, media and education. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. With a BA or B.Ed. degree in Education, you can choose several career paths such as teacher, principal, school owner or ministerial education work. These programs however go beyond just working in schools or academic systems and many organisations now hire persons with educational backgrounds to serve on their teams for their valuable views on pedagogy. You may choose a career within media, a private company or an NGO that caters for the wellbeing of children or engages in planning children activities. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}