{
    "url": "https://www.nottingham.edu.my/ugstudy/course/psychology-and-cognitive-neuroscience-bsc-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/311/6/0079(4/26)MQA/SWA0180 Psychology is the scientific study of behaviour and mental processes in both humans and other species, and it focuses on individuals, groups, organisations and societies. Cognitive Neuroscience is concerned with the study of the brain and its mechanisms which determine those behaviours and mental processes. This programme is relatively more focused on ideas and research methods in Cognitive Neuroscience than the BSc Psychology programme, and it requires students to choose 40 credits of cognitive neuroscience related modules in their final year of the degree. However, both programmes are largely overlapping and aimed at giving you a good grounding in Psychology. Psychology has a broader application in the wider world with regard to individuals and societies alike, as well as clinical and non-clinical (typical) populations. Psychology ranges enormously, for example how does a child with barely any knowledge of the world grow into a communicating, skilled and knowledgeable adult? It looks to the latest societal trends, for example understanding the role of social media for individuals and society or looking at how vulnerable and/or clinical populations like autistic individuals function in the changing world. Psychology is a rigorous science and our students develop skills and confidence in analytical thinking, statistics and the evaluation of scientific evidence. Our students learn to comprehend, conduct and present scientific research along with learning how to be an effective communicator and proficient scientific writer. The University of Nottingham Malaysia’s Psychology and Cognitive Neuroscience degree appeals to students for a number of reasons: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 77% average based on 6 subjects (consideration to be made based on relevant subjects). Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. 4,4,3 in relevant subjects. Acceptance to the second year is on a case-by-case basis (and at the discretion of the School) but normally would require an overall GPA of 3.30 out of 4.0 and above, including good grades in relevant subjects. Previous studies must meet the prerequisite requirements to the programme. In addition to the entry requirements listed above, applicants must have grade B in mathematics and at least a credit in a science subject at SPM/ GCSE/ IGCSE/ High School Diploma or equivalent. This requirement can be waived if applicants have obtained similar or equivalent grades at a higher level. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Science is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Science. This rigorous programme provides students with a strong academic background that will result in enhanced language, mathematics, critical thinking and study skills. Students on this programme also choose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as chemistry, ecology, computer programming or psychology. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Many students initially choose our degree programmes to enter a career in Clinical psychology. However, by understanding the broader applications of psychology throughout their course, a range of careers in public and private sectors present opportunities. Graduates undergo careers as researchers or teachers at primary, secondary and tertiary establishments as well as special education institutions around the world. Many of our Alumni have secured scholarships for PhDs straight after graduating, and have become lecturers and researchers at reputed higher education institutions across the globe. Some Alumni have chosen careers in the clinical and counselling sectors, e.g. Clinical Psychologists. Many graduates from Nottingham take the corporate route with institutions such as Google or the BBC in a range of divisions such as media, human resources, data science, marketing and advertising. While some students join professional positions straight after their degree, others choose to pursue further education (e.g. MSc, PhD) before starting their professional career. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}