{
    "url": "https://www.nottingham.edu.my/ugstudy/course/pharmacy-bpharm-hons",
    "content": [
        {
            "p": "UNM/JPT-N/0916/6/0001(6/29)MQA/PA1183 Pharmacy education has undergone significant changes in the last few years. The COVID-19 pandemic has further highlighted the importance of pharmacy and pharmacology within the healthcare industry. It has become an essential component of the healthcare system, playing a vital in the delivery of safe and effective medication to patients. The BPharm (Hons) is a 4-year degree programme at our Malaysia campus, composed of modules contributing to a specific number of credits. The BPharm (Hons) programme takes integration across therapeutic themes or disease states via a series of “Drug, Medicine and Patient” (DMP) modules. For each topic, you will look at it from the angle of the drug, the medicine and the patient. This will be the emphasis in Year 1 to Year 3 together with a semester-long research project module to develop your research and data analysis skills. In Year 4, you will have extended placements in industrial and community pharmacy. Much of the teaching is case-based, providing real-life examples, bringing together the fundamental science and clinical use of medicines. You will gain patient interaction experience through placements in community and hospital pharmacies. You'll also take part in patient workshops. Our School of Pharmacy is ranked in the top 8 in the world for pharmacy and pharmacology (QS World University Rankings 2023). Through the course, our students become experts in drugs and medicines. This knowledge, tied with the development of effective communication skills to cultivate open relationships with patients, allows for a significant role in improving patient outcomes. Overall, Pharmacy is one of the most promising professions for the future. (Interview required) All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 80% average based on 6 subjects with Biology, Chemistry and Physics/Mathematics above 80%. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. In addition to the entry requirements listed above: We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Once the programme is fully accredited, students who have successfully completed their BPharm programme and their Provisionally Registered Pharmacist (PRP) training, can practice as pharmacists anywhere in Malaysia. Post registration, you could work as a pharmacist in the community (retail) or in a hospital. Several students also have the option of working in the pharmaceutical industry, for the research and development of new drugs and medicines. At UNM, our course features an integrated course that brings together the fundamentals of science and the clinical use of medicine. Students will learn pharmacology, medical sciences like cardiovascular and immunology, pharmaceutics, pharmacy practice, and clinical pharmacy. Students will also learn about the healthcare system and how to communicate with patients and other healthcare professionals. In addition to this, students will also be required to undertake a research project in their third year of study. Individuals who plan to enrol in this course at UNM will need a minimum of BBB in biology, chemistry and physics/mathematics in their A-Level or STPM. For students who have just completed their secondary education, UNM’s Foundation in Science is a direct pathway to this degree. Students are also expected to be proficient in English as all classes are taught in this language. Upon completing a Bachelor of Pharmacy, one can work as a pharmacist in various settings, including hospitals, clinics, pharmaceutical companies and community pharmacies. You can also choose to pursue postgraduate degrees in this field. The Bachelor of Pharmacy (Hons) degree at UNM typically takes four years to complete. Yes, the BPharm degree is recognised in Malaysia and is recognised by the Malaysia Pharmacy Board and the Malaysian Qualifications Agency. This depends on the university’s admission requirements. However, a strong foundation in science subjects such as biology and chemistry will help you to succeed in this programme. This depends on the university you’re enrolled in. At UNM, the tuition fee is RM53,000 per year for Malaysian students and RM60,000 per year for international students. In addition to the tuition fee, you may also want to budget for accommodation, travel and other living expenses. UNM also offers financial aid and scholarships. Our BPharm is a full-time course and as such there are no part-time options. The healthcare sector in Malaysia has experienced a strong growth in recent years. Job prospects for BPharm graduates are good, and there is high-demand for quality pharmacist in various healthcare and research sectors. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}