{
    "url": "https://www.nottingham.edu.my/ugstudy/course/international-communication-studies-with-english-language-and-literature-ba-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/321/6/0154(10/24) MQA/SWA0175 The English Language and Literature track of our International Communications Studies degree enables the student to add a literary emphasis to their study of global media. In addition to the key core media classes, those taking this track will also learn about linguistics, writing and literature. Additional courses on offer include Community Interpreting, Introduction to Translation, Modern British Fiction as well as reading Chinese and Japanese Literature. The growth of media technology is also ushering profound transformations in the publication industry and consequently the experience reading and writing itself. This program embeds the study of literature in the latest development of mass media industries to offer the student a more comprehensive and realistic appreciation of literature. Students will learn and practise the four skills of listening, speaking, reading and writing together with basic grammatical structures. This will enable them to manipulate the language and participate effectively in everyday social situations. Learning outcomes: Learning outcomes: This introductory module allows students to gain a broad and basic understanding of linguistics as an academic discipline. It is designed to equip students for further studies in the field of linguistics as a whole, and to develop individual specialisms in the future. Ideally, students should be well prepared to become more specialised in any of the areas covered, and take initial interests further. At the end of this module, students should be able to define the discipline, and the main pre-occupations of its sub-fields. Students will be expected to have developed an understanding of linguistic contrasts, from the phonological to the pragmatic level, and of the types of analyses open to students of those fields. This module introduces students to the core areas of linguistics, discourse, language acquisition, and pragmatics, focusing on several broad areas pertaining to linguistics and its methodological issues in phonetics, phonology, syntax, semantics, and pragmatics. This module introduces students to some of the core skills for literary studies, including skills in reading, writing, researching and presentation. The module addresses topics including close reading, constructing an argument, and handling critical material, as well as introducing students to key critical questions about literary genres, production and reception. These elements are linked to readings of specific literary texts, focused on poetry and prose selected from the 20th and 21st century literature. The module aims to introduce students to: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Arts and Education is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Arts and Social Sciences. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as politics, the world economy, media and education. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. An international communications degree is your passport to a variety of rewarding professions. Likely career fields include the audio-visual, digital and print media industries, marketing, production, public relations and research. Graduates with a passion for language can pursue interpreting, publishing and translation roles while others may continue their studies and pursue research and/or teaching degrees. Many of our graduates go overseas to work at universities in South Korea, Japan, China, and Europe. Some of our graduates have pursued postgraduate study at LSE, National University of Singapore, Mahidol University (Thailand), Oxford University and the University of Nottingham campuses in both China and the UK. This content was last updated on 09 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}