{
    "url": "https://www.nottingham.ac.uk/ugstudy/parents/finance.aspx",
    "content": [
        {
            "p": "Your guide to undergraduate funding options as the parent of a university applicant. Funding a degree course – and living costs while at university – is a concern for many students and their families, but there are plenty of options available, ranging from student loans to scholarships. Students who haven't lived away from home before may be managing their finances and living costs independently for the first time. As well as tuition fees and accommodation charges or rent, they will need to pay for food and drink, phone bills, travel, study materials, clothing, laundry, socialising, hobbies and leisure activities. It's a good idea for them to calculate their typical weekly and monthly budget, including any memberships, streaming services and hobbies they normally pay for. Think about anything else they may need to pay for while living independently – such as a TV licence if they will watch broadcast television. Also look into accommodation options, how often these are charged and what catering or utilities are included in the price – such as internet and energy costs. You can find out more about student budgeting and managing money in our Financial Support webpages. Student Finance England offers tuition fee loans and maintenance loans for eligible students living in England, with other student finance organisations offering loans for students from Wales, Scotland and Northern Ireland. In most cases students should apply for loans before beginning their course. We recommend reading up on student finance early, to find out how much your child could receive and understand the application process. Find out more in our student funding webpages and on the UK government website. Depending on your household income, your child may be eligible for a bursary from the University of Nottingham to help with their finances. There are also a range of competitive scholarships available from the university and our funding partners, plus sports scholarships for elite level athletes. Find out more about bursaries and scholarships. We offer a range of Undergraduate Excellence Awards for high-achieving international students from around the world, and a UK International Undergraduate Excellence Award for international students based in the UK. Find out more about international scholarships and funding Most international students will require a student visa for their studies in the UK. As part of the application process, they will need to show financial evidence that they have adequate funding for at least the first year of tuition fees and the first nine months of living expenses (according to the UK's strict visa regulations). This may include scholarships from the university or from an external sponsor, personal funds in the student's bank account, or money in your bank account as their parent or legal guardian. On arrival in the UK, international students should open a UK bank account as soon as they can, for managing their money during their studies, making payments to the university, and for receiving stipend payments if they have been awarded a scholarship with a stipend. International students are sometimes targeted by phone or email scams, so see our guidance on security. Many students work part-time in evening and weekends, or during vacation periods, to provide some extra spending money. It's important to remember that this mustn't interfere with their studies, and that this won't be a major source of funding – they won't be able to fund a degree course from part-time work alone. At Nottingham, Unitemps can help students find part-time and temporary jobs with local employers, as well as paid opportunities to work for the university such as helping at open days or other student ambassador roles. If your child will study in the UK as an international student, they should familiarise themselves with the rules on working in the UK for their visa as there are important restrictions on the hours they can work while studying. Our site makes use of cookies. See Cookies for details."
        }
    ],
    "pdf_files": []
}