{
    "url": "http://www.nottingham.ac.uk/ugstudy/introduction/applying/introduction.php",
    "content": [
        {
            "p": "Interested in undergraduate study at Nottingham? Here's our guide to submitting your application. Life is full of opportunities and studying at the University of Nottingham could be your biggest yet. The moment you apply you'll be taking a huge step towards unlocking your potential. It’s an exciting time but it can be daunting. We’re here to support you at every stage, guiding you through the application process step-by-step. Picking a degree is a unique challenge for everyone. For some, career aspirations or subject enjoyment can make the decision easier. For others, the choice is a little more difficult. However, it’s important to remember that whether you have a specific career in mind or not, more than a third of the UK's graduate jobs are open to graduates of any discipline. University of Nottingham graduates are consistently popular with employers, across all subjects. We can help you develop: Some degree courses – like medicine, physiotherapy, architecture, and pharmacy – should be chosen based on your career goals. These courses provide a significant part of the training needed for these professions. For all undergraduate courses at Nottingham, you apply online through UCAS. The UCAS website has lots of information and advice on the process. Once you’ve registered with UCAS you are ready to make your application. It’s important to ensure that all sections of the UCAS application form are completed and that all the information (including details of past and future qualifications) is correct. Failure to do so may result in delayed decisions or offers being rescinded. Your UCAS application will ask you for a campus code. You will only need to complete this if your course is available at more than one campus (nursing, for example). Top tip: Be aware of UCAS dates and deadlines. Dates are subject to change, and this may impact your application. UCAS deadlines for medicine and veterinary medicine courses are always earlier. Keep checking the UCAS website for the latest information. Your personal statement is your opportunity to stand out from the crowd. Use it to demonstrate your passion, enthusiasm and intellectual curiosity. At least 75% of your personal statement should be related to what you want to study, and why you want to study that subject. Be genuine and refer to topics you've already studied and your wider interests in the area. It's also worth reflecting on any reading that you’ve done on the subject or relevant work experience. The remaining 25% of your statement should cover any other achievements. This is where you show us that you’ve taken full advantage of the opportunities presented to you. Are you on a school sports team? Have you conducted any charity work? Do you have a part-time job? Include relevant examples that demonstrate you have the skills needed during your time at university. It’s time to boast about how brilliant you are. Your reference should be written by someone within your most recent educational institution. If you are studying on a one-year post-A level course (such as a Foundation Year), your reference should be completed by this institution rather than the school/college in which you took your A levels. If you have been out of education for some time, a reference from your work or relevant work experience may be acceptable. To find out more about references visit our Entry Requirements page. Now for the fun part. When you submit your application through UCAS, we automatically receive a copy. We’ll then send you an invitation and unique login details for our applicant and student portal, NottinghamHub, as soon as possible. Next, we will assess your application and either make a decision or invite you to an interview, depending on the course you are applying for. Any decision or updates will be communicated to you by UCAS. All invitations to interview will be sent via email, so make sure you check your junk/spam folders regularly. We look forward to receiving your application. Completing your UCAS application can be daunting, so who better to ask for advice than the people who read them all here at the University of Nottingham. From personal statements to accepting offers, Maryam gives you her ten top tips to help you write a great university application. Learn about the application process Clearing If you’re looking for more information, please head to our help and support hub, where you can find frequently asked questions or details of how to make an enquiry."
        }
    ],
    "pdf_files": []
}