{
    "url": "https://www.nottingham.edu.my/ugstudy/course/business-economics-and-finance-bsc-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/340/6/0629(3/26)MQA/SWA0080 A Nottingham University Business School BSc in Business Economics and Finance will allow you greater specialisation in finance together with the key elements of Business Economics. You will have the opportunity to study core business and economics modules whilst also taking additional modules related to finance. As you progress, you will gain an in-depth understanding of the core areas of economics and finance. Topics covered include, derivatives pricing, economics of regulation, public policy, and financial economics. Our students on the BEF course will also have the unique opportunity to use the NUBS Financial Trading Room and financial databases for their study. The programme will provide you with an excellent background for specialist quantitatively orientated careers in financial economics and research along with acquiring knowledge in accountancy, banking, finance and management. Your individual interests and career aspirations are very important to us and by selecting from optional modules alongside your core subjects you will have greater input into the future path you wish to take. You can choose from subject areas within or outside the Business School that will broaden your skills and knowledge. We also offer the opportunity to gain a global perspective by studying abroad at our campuses in the UK and/or China, or at a partner institution. To provide an introduction to the fundamental concepts of finance, including project appraisal, capital markets and the capital structure of firms. Learning outcomes: To provide participants with a solid understanding of the application and impact of computers and the Internet, especially in small businesses. To ensure a hands-on competence in the use of spreadsheets. To introduce the context and essential techniques of accounting, including double-entry bookkeeping, and to consider the uses of accounting both internally to the business (such as assisting in management decision-making) and externally (in the preparation of financial statements). To introduce students to key microeconomic tools and concepts in order to prepare them for Level 2 economic modules. It also aims to provide participants with an understanding of the nature and scope of macroeconomic policy and the economic theories upon which it is based. To develop an understanding of important microeconomic concepts. To introduce students to the basic ideas and concepts of organisational behaviour. To develop key mathematical and statistical techniques and their application to problems and data. To develop an understanding of the key theories and concepts in the development of society and the nature of work. Learning outcome: Plus, approved optional modules (must include Quantitative Methods 1a for students without a Grade C in A-Level Mathematics or equivalent). All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 79% average based on 6 subjects with at least 70% in Mathematics of Data Management. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. In addition to the entry requirements listed above, applicants must have grade B in Mathematics at SPM/ GCSE/ IGCSE/ High School Diploma or equivalent. This requirement can be waived if applicants have obtained at least grade C in mathematics at a higher level. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Business and Management is a 1+3 year programme that results in direct progression to the undergraduate degrees related to business and management. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such business economics, management and quantitative methods. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. At Nottingham University Business School we actively seek to develop our students’ practical skills through a range of professional development programmes. We have developed industry links to enable you to network with top employers throughout your degree via a range of activities. Our graduates are highly sought after with 90% of them securing graduate level employment or further study opportunities within 6 months of graduation. Recent Business School graduates have also gone on to work at prestigious companies including BDO, Deloitte, EY, KPMG, PwC, CIMB, Citi, HSBC, Hong Leong Bank, Maybank, Public Bank RBC, RHB, Petronas, Accenture, Cisco, IBM, Intel, Nestle, P&G, Unilever.* *Graduate Destination Survey data for 2017-2019 graduates. UNM offers several types of financial aid, including scholarships for deserving students. The Business Economics and Finance BSc (Hons) course uses a variety of teaching methods, including lectures, seminars, tutorials, and workshops. The course also includes group projects and case studies to provide students with practical experience. No, the Business Economics and Finance BSc (Hons) course is a full-time programme and cannot be studied part-time. The financial services industry is a highly competitive job market, both locally and internationally. Obtaining this degree can give you a competitive edge when seeking employment in the financial services industry. The degree provides you with a comprehensive understanding of financial concepts and principles, including financial analysis, financial planning, investment management, and corporate finance, which are highly valued by employers. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}