{
    "url": "https://www.nottingham.ac.uk/ugstudy/applying/contextual-offers.aspx",
    "content": [
        {
            "p": "We recognise the potential of talented students from all backgrounds. We recognise that not everyone has the same opportunities in life, and that social and economic background might have an impact on educational achievement. Our contextual offers allow students to show their potential to succeed at a world-class university. If you are a Home student and your academic performance doesn’t meet the standard requirements for your chosen course and you meet our entry requirements, you could benefit from a contextual offer or an enhanced contextual offer. We can make contextual offers to applicants with a wide range of qualification profiles, including applicants with A levels, IB, or BTECs. You can see general information on our entry requirements page, or visit course pages for specific details. A contextual offer is a reduced conditional offer to study at Nottingham. These offers are usually one grade lower than the entry requirements on our course pages, however this can vary for some courses. Contextual offers usually only apply to level 3 qualifications (e.g. A levels) and are not used to reduce requirements for level 2 qualifications (e.g. GCSEs). If our standard offer includes a specific subject grade, this will generally remain. For example, if the standard offer is AAB with an A in maths, the contextual offer would be ABB with an A in maths. There are no additional steps needed to receive a contextual offer, simply apply for an undergraduate course at the university through UCAS as usual. If your UCAS application shows that you meet the criteria, we will automatically consider you for a contextual offer. To qualify for a contextual offer, you must have Home-UK fee status and your current or most recent school cannot be an independent school. One of the following must also apply: Type in your home postcode – for example, NG7 2NR. Postcode eligibility is defined by national measures of participation in higher education, which are subject to change. The postcode checker looks up whether you are in IMD quintiles 1 or 2. The data within this postcode checker was last updated in August 2024. The university will only take into account postcodes that are identified as eligible at the time of making an offer to study one of our courses. Some courses include an interview or test as part of the entry requirements. You will need to pass this before we can make you a contextual offer. We make contextual offers for our five-year medicine courses – A100 and A10L. If you meet the requirements for a contextual applicant and are successful at interview, your offer will be the contextual offer of AAB including an A in either biology or chemistry, with the other no lower than a B. Our IB requirements would be 32 points in total including Biology and Chemistry achieved at Higher Level grade 6 and Higher Level grade 5 in any order. Alternatively, if you have achieved 6,6,5 in 3 Higher Level certificates, including Biology and Chemistry. Scores exclude the core component. If you do not meet the GCSE requirements of the five-year courses, you may find our Foundation Year course more suitable - A108. This course is only open to applicants who meet the contextual admissions criteria detailed above. Your offer will be made using our standard entry requirements for our Medicine with a Foundation Year course (BBC). There are no further grade reductions. Contextual offers will not be made for D190 Veterinary Medicine with a Gateway Year. We make contextual offers to several of our courses at ABB, which is two grades lower than standard requirements. The courses include: We make enhanced contextual offers to students that meet certain additional criteria, as listed below. These offers are usually two A level grades lower than the entry requirements on our course pages. If your UCAS application shows that you meet the criteria, we will automatically check this against verified records to assess your eligibility for an enhanced contextual offer. To qualify for an enhanced contextual offer, you must have Home-UK fee status. You must also meet one of the following: Received Free School Meals on any census day in the 6 years up to the end of key stage 4 (i.e. the year you were aged 15-16 years old) in England, Wales, or Northern Ireland. This is verified by education authorities and shared with us by UCAS. OR Enhanced contextual offers will not be made below the university’s minimum grade requirements: *The following foundation programmes will not offer below BBC: For Natural Sciences courses, the Faculty of Engineering and the School of Life Sciences, enhanced contextual offers will not be further reduced for students taking an EPQ. Pharmacy For 2025 entry, enhanced contextual offers for B230 and B236 will only be made to applicants that have completed one of the listed University of Nottingham outreach programmes. Applicants that are verified FSM recipients but have not completed one of the listed University of Nottingham outreach programmes will be eligible for a standard contextual offer, which is one grade lower than the entry requirements on our course pages. Veterinary Medicine For 2025 entry, enhanced contextual offers will only apply to D100 and D104. The standard entry requirements on our course page will apply for D190 Veterinary Medicine with a Gateway Year. Veterinary Medicine applicants applying for September 2025 who meet the following criteria will be offered the opportunity to interview regardless of their score on the situational judgement test. Applicants will need to: And meet one of the following: Medicine For 2025 entry, enhanced contextual offers will not be made for Medicine courses. Standard contextual offers will apply for A100 and A10L. If you believe that your studies have been disrupted by personal circumstances, please complete our extenuating circumstances form. Apply for an undergraduate course through UCAS. If your UCAS application shows that you meet the above criteria, we will automatically consider you for a contextual offer. Apply for an undergraduate course Our site makes use of cookies. See Cookies for details."
        }
    ],
    "pdf_files": []
}