{
    "url": "https://www.nottingham.edu.my/ugstudy/course/mechatronic-engineering-meng-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/523/6/0276(3/28)MQA/FA4899 There has been growing interest and a demand in industry for professional mechatronic engineers in recent years. The principal aim of the programme is to equip you to work at a professional level in mechatronic engineering related industries. You will develop practical knowledge and skills to examine and programme basic mechatronic integrated systems along with undertaking practical experiments. The latter will concentrate on instrumentation, measurement and control of hydraulic, pneumatic and electrical systems whilst students will also be introduced to practical concepts in robotics. Studying the MEng enables you to conduct a group project and develop mechatronic products. Our programmes enable you to specialise in a particular branch of the subject dependent upon your interests and talents. One of these branches, mechatronic engineering, is a professional discipline that encompasses electrical, electronic and mechanical engineering with intelligent embedded control. Mechatronic engineers explore and utilise new technologies in automation and robotics to allow tasks in hazardous environments or precise positioning to be accomplished for the benefits of health, safety, society and economy. A Nottingham degree has a high reputation within the electrical and electronic engineering industry, opening up a world of opportunity and prospects. Our programmes will equip you with a variety of skills that allow for adaptation and improvisation in the fast changing world of technology. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 79% average based on 6 subjects, including Advanced Functions, Calculus and Vectors and relevant science subjects. Consideration to be made based on relevant individual grades if specific subjects are required. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Engineering is a 1+4 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Engineering. Modules on the programme aim to improve language and study skills as well as enhance understanding of mathematics and the physical sciences. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway from thermal science or chemistry to electricity and magnetism. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Industrial training is compulsory if you pursue the MEng degree curriculum. You will be expected to participate in industrial training during the summer vacation following the second year of study, although participation in other years or multiple-participation is also allowed. All industrial training must last at least 12 consecutive weeks in the same company or institution. If you pursue the BEng degree you are not required to participate but will be strongly encouraged to do so. Industrial training also provides a great way to identify top career prospects. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}