{
    "url": "https://www.nottingham.edu.my/ugstudy/course/software-engineering-bsc-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/481/6/0745(5/26)MQA/SWA0231 The University of Nottingham Malaysia’s Software Engineering degree looks in detail at how to analyse and solve computer application problems by creating software solutions. This degree has common modules with our computer science degrees but is tailored to focus more on the design and implementation of large software systems, particularly those with interactive or multimedia components. It is built around four themes: the design and implementation of software systems, the use and development of networked and distributed systems, user interface principles and evaluation and testing. Students will gain specialised knowledge of the design, implementation, user interfaces and evaluation of software systems, and an understanding of the professional, legal, and ethical aspects of the discipline. Computers play a crucial role in solving real-world problems in the 21st century, increasing the demand for software engineers to develop the necessary software. To support this, Glassdoor reported that eight of the top ten jobs for 2022 are Computer Science related. This degree programme equips graduates with a comprehensive education and advanced skills to pursue careers in computer science. Students will learn about designing and implementing software systems, developing networked and distributed systems, and principles of user interface design and evaluation. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. BBB, including Mathematics, excluding critical thinking and general studies. 30 points with 5, 5, 5 at Higher Level, including 5 points in Mathematics at Higher Level. BBB, including Mathematics, excluding Pengajian Am. 2 As including Mathematics and grade B3 in 3 other academic subjects, excluding Bahasa Malaysia and Chinese language. ATAR 86 including mathematics and other relevant subjects. 79% average based on 6 subjects with at least 70% in Advanced Functions and Calculus and Vectors. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. 4, 4, 4, including AP Calculus. Acceptance is at the discretion of the School but normally would require an overall GPA of 3.30 out of 4.0 and above in Diploma in Computer Science, Software Engineering, Information Technology, Information System, Science and Technology or other related disciplines. Must include at least grade B in mathematics modules and good grades in relevant subjects. Previous studies must meet the pre-requisite requirements of the programme. Acceptance is at the discretion of the School but normally would require an overall GPA of 3.30 out of 4.0 and above, including grade B in all mathematics modules. Previous studies must meet the prerequisite requirements to the programme. Successful completion of the Foundation in Science or Engineering programme. In addition to the entry requirements listed above, applicants must have a credit in additional mathematics or grade B in mathematics and at least a credit in a science subject at SPM/ GCSE/ IGCSE/ High School Diploma or equivalent. This requirement can be waived for applicants with the appropriate science background. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Science is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Science. This rigorous programme provides students with a strong academic background that will result in enhanced language, mathematics, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as chemistry, ecology, computer programming or psychology. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. While many computer science graduates become programmers others are employed in a variety of jobs. These include computer analysts, IT consultants and planners, network/systems designers and engineers, researchers, software designers and engineers, web designers, web developers and producers. Roles across accountancy are also common along with investment/merchant banking, advertising, marketing, business, financial analysis and legal and quality assurance professions. Some Nottingham graduates have gone on to work for companies such as Adobe, Google, Hewlett-Packard, IBM and Microsoft. Others have found jobs with employers such as Accenture, Experian and Ocado. New computer science graduates frequently command some of the highest-paid entry-level positions compared to graduates in other disciplines. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}