{
    "url": "https://www.nottingham.edu.my/ugstudy/course/applied-psychology-and-management-bsc-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/345/6/0884(3/26)MQA/SWA0082 BSc Applied Psychology and Management is a joint honours degree offered in partnership between Institute of Work, Organisation and Wellbeing (IWOW) and the Nottingham University Business School Malaysia. This course is the first of its kind in Malaysia. It provides excellent training for a future career in psychology and/or business and will teach you to apply psychological theories and principles to real world settings. By combining applied psychology with core areas of management you will learn to interpret human behaviour, analyse social interactions and develop an evidence-based approach to problem solving. You will develop an inquisitive mind, superior social skills and a practical business orientation which will prepare you for a successful career in industry and beyond. Our Applied Psychology and Management degree offers additional value compared to a single-subject background due to the integration of psychological research in managing organisations. It will prepare you for an international career that requires a strong human element, examples include government agencies, industry, charities, consultancies and non-governmental organisations. Many of our alumni have also worked in many different companies as part of their talent management team, human resource management, business planning, training and development team, etc. To provide an integrative approach to psychology through the use of scientific method, enabling students to critically assess previous research and to design conduct, analyse, and report their own studies. This course is designed to equip students with appropriate procedures for describing data statistically and qualitatively. By the end of the module, students should be able to: Learning outcomes: In this module you will gain an advanced understanding of the function of a wide range of markets for the production, exchange, and consumption of goods and services. We will examine how people perceive the choices available to them, and assess the associated risks, to make optimal decisions. We will also explore the nature of competition in dynamic markets, and the approaches that companies take to gain temporary and lasting advantage. Change is at the heart of our teaching. You will learn about innovation and the impact of disruptive technologies, such as digital platforms that create new markets, and how transformation occurs whilst protecting consumers and building market resilience to achieve lasting social good, and how greater environmental awareness is impacting and changing market behaviours. This module will encourage students to: To introduce the context and essential techniques of accounting, including double-entry bookkeeping, and to consider the uses of accounting both internally to the business (such as assisting in management decision-making) and externally (in the preparation of financial statements). This module introduces students to the field of Applied Psychology. It is designed to enhance students’ knowledge and understanding of: At the end of the module, students are expected to develop an understanding of psychology of work, management and organizations, build awareness of various concepts in industrial/organisational psychology and their relative contribution to performance and productivity at work. The module aims to provide an introduction to individual differences and cognitive psychology. It examines research and theories in personality, intelligence, and human's mental processes. Students will be introduced to: All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 79% average based on 6 subjects with at least 70% in Mathematics of Data Management. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. In addition to the entry requirements listed above, applicants must have grade B in Mathematics at SPM/ GCSE/ IGCSE/ High School Diploma or equivalent. This requirement can be waived if applicants have obtained at least grade C in mathematics at a higher level. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Business and Management & Foundation in Science is a 1+3 year programme that results in direct progression to the undergraduate degrees related to business and management. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway. For example, students intending to pursue Applied Psychology and Management Studies will have the opportunity to take modules in applied psychology such as Person and Society and Groups and Interpersonal Dynamics. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. BSc Applied Psychology and Management psychologists (APM) are valued and respected within their various areas of expertise, particularly in the fields of advertising, career and organisational development, change management, counselling, human resources, marketing, occupational testing, training and selection; and recruitment. They often collaborate with other experts in business and their contribution is highly sought-after. This content was last updated on 17 October 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}