{
    "url": "https://www.nottingham.edu.my/ugstudy/course/pharmacy-mpharm-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/727/6/0066(9/26)MQA/FA7940 The Master of Pharmacy (MPharm) is a 4 year degree programme, with students studying the first two years at our Malaysia campus, before transferring to the UK campus for years three and four. Our School of Pharmacy is ranked in the top 8 in the world for pharmacy and pharmacology (QS World University Rankings 2023). Much of the teaching is case-based, providing real life examples bringing together the fundamental science and clinical use of medicines. We provide integrated teaching across therapeutic themes or disease states. For each topic, you will look at it from the angle of the drug, the medicine and the patient. You'll gain patient interaction experience through placements in community and hospital pharmacies. You'll also take part in patient workshops. You can practise patient consulting and dispensing in our simulated pharmacies. The final year has a module called Pharmacy Leadership and Management. You'll work in teams to run your own simulated pharmacy. The module looks at the commercial, clinical and ethical issues that being a pharmacist involves. The course is aimed at students who have a commitment to becoming a registered healthcare professional, with a strong background in both Chemistry and Biology. The school is top 4 in the UK and top 8 in the world for pharmacy and pharmacology (QS World University Rankings 2023). All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 81% average based on 6 subjects with Biology, Chemistry and Physics/Mathematics above 80%. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. In addition to the entry requirements listed above, Malaysian applicants with Matriculation/Foundation/Diploma must have 5 Bs (including Biology, Chemistry, Physics and either Mathematics or Additional Mathematics) for SPM/ GCSE/ IGCSE/ High School Diploma or equivalent. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we also consider applicants' personal statements, references and interview performance (if you have one) when making a decision. The only way for us to fully determine eligibility is through the submission of a completed application. Interview required. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Science enables direct progression to the undergraduate degrees offered within the Faculty of Science. This rigorous programme provides students with a strong academic background that will result in enhanced language, mathematics, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as chemistry, ecology, computer programming or psychology. For entry into the MPharm course, Foundation in Science students must fulfil the progression rules. Students should have an average pass mark of 65% in the Foundation in Science programme, with a minimum of 60% in all chemistry modules. Students must also fulfil the English language requirement for the MPharm course. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. To complete your training and qualify as a registered, practising pharmacist you will need to complete the new GPhC Foundation training programme. This replaces the pre-registration placement year and has been designed as a universal programme to evidence skills across five key areas of professional practice, communication and collaborative working, leadership and management, education and research. It brings pharmacists more in line with other healthcare professionals like medics and dentists. At the end of the year, you'll sit the General Pharmaceutical Council’s exam to become a qualified pharmacist. For the first time this also includes registration to become a Prescribing Pharmacist. Our progressive and responsive course and teaching will help prepare you for the next stages in your training and career. Targeted support is given by a highly experienced specialised team of academic and professional staff, many of whom are involved in shaping and advising the pharmacy profession at a national level. We also have the MPharm Pharmacy (with Integrated Pre registration Scheme) course. This is the same as the MPharm course but includes equivalent training to the Foundation year as part of the course, and hence directly supported by and managed by the University. You could work as a pharmacist in the community, at a GP surgery or in a hospital. On the course, you'll experience the different types of pharmacy work so you can see what you enjoy the most. If you are interested in the research and development of new drugs, you may consider industrial pharmacy. Industrial pharmacists work with scientists in other areas to discover safe and effective drugs. Your skills can be used in roles such as: The University of Nottingham’s MPharm degree is a full-time, 4 year programme. Although MPharm is sometimes considered a postgraduate degree, it is an undergraduate degree at UNM. The Pharmacy MPharm degree is suitable for students who have a strong foundation in Biology and Chemistry and want to become registered healthcare professionals. Students need a minimum of an ABB in biology, chemistry and physics/mathematics in their A Level or STPM, or its equivalent. You must also meet the English language proficiency requirements. If you’ve just completed secondary school or high school, UNM’s Foundation in Science offers direct progression to this degree if completed with an average mark of 65% with no failed modules and a minimum of 60% in Chemistry. Some typical core modules include Fundamentals of Pharmacy, Digestive System, Autoimmune and Allergy, Infections 1 and 2, Dermatology, Prescribing Competencies and Practice, and Advancing Therapies, Practice and Care 1 and 2. There is also a research project in Year 3 and throughout the course, professional competency and medicine pathway activities are to be completed. Graduates can pursue careers as pharmacists in hospitals, community pharmacies, and other healthcare settings. They can work in research and development, pharmaceutical manufacturing or in regulatory bodies. Moreover, they can also choose to pursue further education, for instance, in clinical pharmacy or pharmacy management. Yes, international students are welcome to apply for the Pharmacy MPharm degree at UNM. Do refer to the universities admission requirements for international students for more information. MPharm students will be assessed through a combination of coursework, exams, practical assessments, presentations and research projects. Yes, we may consider transferring credits from another institution towards our programme; however, it is subject to approval. For more details, contact our admissions office for more information on our transfer credit policy. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}