{
    "url": "https://www.nottingham.ac.uk/ugstudy/applying/ourpolicies.aspx",
    "content": [
        {
            "p": "We consider applicants solely on the basis of their merits, abilities and potential – regardless of gender, ethnic or national origin, age (subject to the University regulations on minimum age), disability, religion, sexual orientation or any other irrelevant distinction. For more details of how we assess applications, see the sections below. Your exam grades are very important to us. We use exam grades to prioritise applicants, but other things count as well. Admissions staff at the University of Nottingham look for the following information on the UCAS form: We recognise the potential of talented students from all backgrounds. We make contextual offers to students whose personal circumstances may have restricted achievement at school or college. These offers are usually one grade lower than the entry requirements on our course pages – find out if you're eligible. We appreciate that personal circumstances can have an impact on academic performance at school or college. If you believe that your studies have been disrupted please visit our Extenuating Circumstances page to read more about our policy and submit evidence to support your case. The University aims to create the conditions whereby students and staff are treated solely on the basis of their merits, abilities and potential, regardless of gender, race, colour, nationality, ethnic or national origin, age, socio-economic background, disability, religious or political beliefs, trade union membership, family circumstances, sexual orientation or other irrelevant distinction. If you will be under the age of 18 at the time when you begin your course, your parents or legal guardian must complete a consent form before your application is considered. If your parents or guardian live outside the UK, they must nominate a UK-based guardian. There are some agencies who can provide guardianship services. Find out more in our under 18 admissions guidance. As well as a reputation for academic excellence, the University of Nottingham has a history of sporting success. We are passionate about supporting promising athletes during their time at Nottingham and employ a flexible admissions approach to support promising athletes in their application. If you are an athlete of sports scholarship potential that competes at regional, national or international level in your sport or show strong evidence of future outstanding potential, we will consider this when assessing your academic potential. This is subject to confirmation from the University sports department. As a result, when we assess your application and you meet the requirements of the course, we may consider making you a reduced grade offer. This policy may vary depending on which course you have applied for – this is because different courses have different requirements and some courses may have course specific or professional certification requirements. For further details, contact us through our enquiry form. Admissions staff at the University of Nottingham assess many applications using only the information available on the UCAS form. Some courses use additional methods of assessment for all or some applicants. This may be for a range of reasons, including to: Additional assessment may include interviews or tests. Some courses may ask for examples of written work. Where courses use additional assessment, admissions staff send information to applicants, explaining the nature of the assessment, what admissions staff will be looking for and how applicants can prepare. The University of Nottingham’s Quality Manual includes more information about our admissions procedures. We expect applications to the University of Nottingham to be supported by a reference, written in English. For the majority of UCAS courses, one reference per application is sufficient and, where possible, should be an academic reference. A reference is not acceptable if it has been written by a partner, ex-partner, friend, or family member. UCAS provides helpful guidance on what to include in the content of a reference, including some example statements. We are happy to receive references written in the new format and will not require an ‘enhanced’ reference, but please ensure that your referee provides a brief supportive statement that is specific to you in Section 3 and does not leave this section blank (this can be in bullet point format). Applicants will not be advantaged or disadvantaged if their reference is more detailed than our recommendation. Please note our Extenuating Circumstances policy as this will affect how much we utilise section two of the reference. We appreciate that obtaining a reference may be difficult for some applicants. UCAS provides advice for applicants on how to obtain a suitable reference and we encourage all applicants to explore how to acquire a reference to fully support their application. However, if you are unable to find a suitable referee, we may be able to accept your application without one. Exceptions to this are for vocational or accredited courses, or if you are an International applicant. Applicants in these circumstances must provide a reference. Please get in touch with our Admissions team if you have any concerns about being able to provide a suitable reference or to discuss this further. Depending on the course someone has applied for, we often use predicted grades to review whether we can consider an application. If you are studying as a private candidate, we understand that it is not always possible to receive predicted grades from your exam centre. If you are studying with a tutor or private centre they may still be able to provide predicted grades for you – we encourage you to ask for these in the first instance to provide us with a complete picture of your academic suitability. If you are unable to provide predicted grades we may still be able to consider your application, but this is on a case-by-case basis. We may also need to ask you for further information to adequately assess your suitability of the course, so please do respond promptly to any further information requests. Our site makes use of cookies. See Cookies for details."
        }
    ],
    "pdf_files": []
}