{
    "url": "https://www.nottingham.edu.my/ugstudy/course/finance-management-and-business-analytics-bsc-hons",
    "content": [
        {
            "p": "UNM/JPT-N/343/6/0268(10/26)MQA/PSA15083 A BSc in Finance, Management and Business Analytics will prepare you to keep pace with the data-driven era of tomorrow and thrive in the rapidly changing world of work. You will develop an understanding of appropriate business analytics techniques to extract actionable insights from relevant data for making informed decisions to solve finance and management related issues in a data-driven era. During the course, you will be exposed to various productivity tools and software for data analytics. You will also have the opportunity to study statistical programming skills and implement applied predictive modelling and machine learning algorithms to develop Data Science solutions to business problems. The programme will cover topics such as exploratory data analytics, machine learning and predictive modelling for Finance and Management, model evaluation, data visualisation, presentation of data insights, ethics in data science, and data-driven business decision making. We also offer the opportunity to gain a global perspective by studying abroad at our campuses in the UK, China or at a partner institution. To introduce the context and essential techniques of accounting, including double-entry bookkeeping, and to consider the uses of accounting both internally to the business (such as assisting in management decision-making) and externally (in the preparation of financial statements). Learning outcomes: In this module you will gain an advanced understanding of the function of a wide range of markets for the production, exchange, and consumption of goods and services. We will examine how people perceive the choices available to them, and assess the associated risks, to make optimal decisions. We will also explore the nature of competition in dynamic markets, and the approaches that companies take to gain temporary and lasting advantage. Change is at the heart of our teaching. You will learn about innovation and the impact of disruptive technologies, such as digital platforms that create new markets, and how transformation occurs whilst protecting consumers and building market resilience to achieve lasting social good, and how greater environmental awareness is impacting and changing market behaviours. To provide participants with a solid understanding of the application and impact of computers and the Internet, especially in small businesses. To ensure a hands-on competence in the use of spreadsheets. The module provides an initial appreciation of the main concepts, elements and techniques of operations management and of the current landscape operations managers have to work in. It offers practical insights through case examples and exercises. By the end of the module, you should be able to: To provide an introduction to the fundamental concepts of finance, including project appraisal, capital markets and the capital structure of firms. To develop key mathematical and statistical techniques and their application to problems and data. Plus, approved optional modules (must include Quantitative Methods 1a for students without a Grade C in A-Level Mathematics or equivalent). All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 79% average based on 6 subjects with at least 70% in Mathematics of Data Management. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. In addition to the entry requirements listed above, applicants must have grade B in Mathematics at SPM/ GCSE/ IGCSE/ High School Diploma or equivalent. This requirement can be waived if applicants have obtained at least grade C in mathematics at a higher level. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Business and Management is a 1+3 year programme that results in direct progression to the undergraduate degrees related to business and management. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such business economics, management and quantitative methods. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Upon successful completion of the BSc in Finance, Management and Business Analytics, you will be well-positioned to continue your studies in advanced data analytics or prepare yourself for a fast-paced career in finance, management, and business analytics where you can make a significant and immediate impact. At Nottingham University Business School we actively seek to develop our students’ practical skills through a range of professional development programmes. We have developed industry links to enable you to network with top employers throughout your degree via a range of activities. Our graduates are highly sought after with 90% of them securing graduate level employment or further study opportunities within 6 months of graduation. Recent Business School graduates have also gone on to work at prestigious companies including BDO, Deloitte, EY, KPMG, PwC, CIMB, Citi, HSBC, Hong Leong Bank, Maybank, Public Bank RBC, RHB, Petronas, Accenture, Cisco, IBM, Intel, Nestle, P&G, Unilever.* *Graduate Destination Survey data for 2017-2019 graduates. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}