{
    "url": "https://www.nottingham.edu.my/ugstudy/course/finance-accounting-and-management-bsc-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/340/6/0514(9/24)A7513 A Nottingham University Business School BSc in Finance, Accounting and Management is among the most sought-after qualifications in the Business School as it is underpinned by a variety of other disciplines to run a corporation. Here, you will learn to utilise the theoretical and practical techniques of finance and accounting within an economic, organisational, and decision-making framework. You will also develop a critical understanding of the techniques and their contexts. Students on FAM will also use the NUBS Financial Trading Room and financial databases for their study. Your individual interests and career aspirations are very important to us and by selecting from optional modules alongside your core subjects you will have greater input into the future path you wish to take. On completing this Finance, Accounting and Management degree programme, you will also be well-positioned to continue your studies and undertake professional examinations in accounting should you wish. You have the option to follow your individual learning pathway and career aspirations by selecting from optional modules alongside your core subjects. You have the option to choose from subject areas within or outside the Business School allowing you to enhance and broaden your skills and knowledge. There are further opportunities to gain a global perspective by studying abroad at our campuses in the UK and/or China, or even at a partner institution. To provide an introduction to the fundamental concepts of finance, including project appraisal, capital markets and the capital structure of firms. Learning outcomes: This module introduces participants to the study of law in a business context. To provide participants with a solid understanding of the application and impact of computers and the Internet, especially in small businesses. To ensure a hands-on competence in the use of spreadsheets. The module aims to introduce participants to key economic tools, concepts, and their application and to provide participants with an understanding of the nature and scope of economic policy and the economic theories upon which it is based. The emphasis is on analytical tools. To introduce the context and essential techniques of accounting, including double-entry bookkeeping, and to consider the uses of accounting both internally to the business (such as assisting in management decision-making) and externally (in the preparation of financial statements). To introduce students to the basic ideas and concepts of organisational behaviour. The main aim of this module is to prepare students for studying at University, providing them with the necessary skills and knowledge to develop professional and academic skills and to improve their employability. To develop key mathematical and statistical techniques and their application to problems and data. Plus approved optional modules (must include Quantitative Methods 1A for those without grade C in A-level mathematics or equivalent). All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 79% average based on 6 subjects with at least 70% in Mathematics of Data Management. Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. In addition to the entry requirements listed above, applicants must have grade B in Mathematics at SPM/ GCSE/ IGCSE/ High School Diploma or equivalent. This requirement can be waived if applicants have obtained at least grade C in mathematics at a higher level. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Business and Management is a 1+3 year programme that results in direct progression to the undergraduate degrees related to business and management. This rigorous programme provides students with a strong academic background that will result in enhanced language, communication, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such business economics, management and quantitative methods. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. At Nottingham University Business School we actively seek to develop our student’s practical skills through a range of professional development programmes. We have developed industry links to enable you to network with top employers throughout your degree via a range of activities. Our graduates are highly sought after with 90% of them securing graduate level employment or further study opportunities within 6 months of graduation. Recent Business School graduates have also gone on to work at prestigious companies including BDO, Deloitte, EY, KPMG, PwC, CIMB, Citi, HSBC, Hong Leong Bank, Maybank, Public Bank RBC, RHB, Petronas, Accenture, Cisco, IBM, Intel, Nestle, P&G, Unilever.* *Graduate Destination Survey data for 2017-2019 graduates. A Finance, Accounting and Management BSc (Hons) is a bachelor’s degree programme that combines the study of these three areas. Students will develop a comprehensive understanding of financial theory, accounting practices and management principles, which will prepare them for success in various careers in the business world. Graduates of this course have the opportunity to work in accounting, banking, investment and management consulting. This degree is suitable for students who intend to pursue careers in the business world, particularly in the field of finance, accounting and management. Individuals who love working with numbers, have strong analytical skills, and are interested in understanding how businesses operate should consider this degree. Those who want to become an accountant, financial analyst, investment banker, management consultant, or start their own business will also benefit from this programme. Graduates with this degree have a wide range of career options and can pursue various roles in the business world, including but not limited to: Graduates may also choose to pursue further education such as a master’s degree or a PhD in Business and Management. UNM’s Finance, Accounting and Management BSc (Hons) takes 3 years (full-time) to complete. Yes, international students are welcome to enrol in the Finance, Accounting and Management BSc (Hons) at UNM. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}