{
    "url": "https://www.nottingham.edu.my/ugstudy/course/environmental-science-bsc-hons",
    "content": [
        {
            "p": "UNM/JPT-R2/422/6/0014(5/26)MQA/SWA0232 Environmental Science is a highly sought-after discipline that spans various subjects. Our programme offers a multidisciplinary and research-based approach that is beneficial in navigating the constantly changing environmental landscape. Students will develop an understanding of environmental processes and systems and gain skills in a range of ecological survey techniques through practical classes and field programmes. Fieldwork is central to the degree programme and as such we offer residential field courses to study terrestrial, marine and freshwater ecosystems in interesting tropical locations and rainforests of the world. Our programme is accredited by the Institute of Environmental Sciences (IES) and the Community for Environmental Disciplines in Higher Education (CEDHE). This accreditation reflects our commitment to ensuring that our students are well-prepared for professional practice in environmental and geographical sciences. All candidates are considered on an individual basis and we accept a broad range of qualifications. The entrance requirements below apply to 2024 entry. 77% average based on 6 subjects (consideration to be made based on relevant subjects). Canadian Secondary School Diplomas from other provinces are acceptable and to be assessed based on the University’s requirements. In addition to the entry requirements listed above, applicants must have at least a credit (normally grade C) in mathematics at SPM/GCSE/IGCSE/ High School Diploma or equivalent. This requirement can be waived if applicants have obtained similar or equivalent grade at a higher level. We strongly encourage all interested students to apply. Our students come to us with a diverse range of qualifications and we are also reviewing and accepting grades based on the minimum acceptable (and those who are holding grades with near misses). The only way for us to fully determine eligibility is through the submission of a completed application. Entry requirements in the prospectus and website may not always apply and individual offers may vary. The Foundation in Science is a 1+3 year programme that results in direct progression to the undergraduate degrees offered within the Faculty of Science. This rigorous programme provides students with a strong academic background that will result in enhanced language, mathematics, critical thinking and study skills. Students on this programme also chose from a range of elective modules that provide the opportunity to sample topics related to their chosen undergraduate pathway such as chemistry, ecology, computer programming or psychology. Our step-by-step guide contains everything you need to know about applying for undergraduate courses. Semenyih Campus is 48km from Kuala Lumpur International Airport and just 45 minutes’ drive from the famous city centre with its iconic Petronas Twin Towers. On arrival, you are immersed in the green jungle backdrop that Malaysia provides with wildlife, sunshine and campus lake. The campus is home to our business, education, science and engineering schools, which sit alongside a sports centre, library and student accommodation. The University has everything a modern day student could wish for with the added bonus of being located in central Asia allowing you to travel further afield in your free time. Public transport is plentiful with free shuttle services operating on some routes. Taxi/Grab services in Malaysia are very reasonable and used widely by the student community. Graduates will be equipped with both the skills and confidence to find employment across a range of career options: environmental consultancy, conservation and research agencies, local authorities, government agencies, universities and industry. Many graduates go on to undertake postgraduate research degrees in environmentally related areas. This content was last updated on 10 July 2024. Every effort has been made to ensure that this information is accurate, but changes are likely to occur between the date of publishing and course start date. It is therefore very important to check this website for any updates before you apply."
        }
    ],
    "pdf_files": []
}