{
    "url": "https://www.nottingham.ac.uk/ugstudy/offer-holder/offer-holders.aspx",
    "content": [
        {
            "p": "Experience your course at Nottingham and meet staff and students This is your chance to delve deeper into your chosen course and get a better feel for student life at Nottingham. Offer-holder events at Nottingham give you an exclusive opportunity to take part in interactive subject sessions, chat to current students, meet your potential future course mates and take tours of the specialist facilities you could be learning in. You can also visit accommodation to see where you might be living, tour our stunning campuses and explore the sports facilities we have to offer. And if you're interested, the vibrant city centre of Nottingham is only a 15 minute bus ride away from University Park Campus. Come and see for yourself why Nottingham is a top 20 UK university (QS World Rankings 2025). Spaces are limited to ensure the best possible experience for offer-holders, so book now to secure your spot! Book your offer-holder day If you have been offered a place to study at Nottingham, you can book below. To book your offer-holder event, you will need: If you don’t know these details yet, don’t worry, they’ll be sent to you in an email invite. This could be up to one week from when you get your offer, so please be patient! You can also find these details in your UCAS hub. You should receive a confirmation email within 24 hours of booking. Please check your junk/spam folder for this. If you still can’t find your booking confirmation, please get in touch with us. For joint honours degrees, or if you have more than one offer to study with us, you could cover both courses in one day by attending a morning (AM) and an afternoon (PM) session, as long as both subjects have availability on that day. The morning subject activity will take place between 10am and 12.15pm and the afternoon subject activity will take place between 1.15 and 3.30pm. You will need to book on to the event for each course separately. You will then receive confirmation emails for each booking. You should receive a confirmation email for each of the events you have booked within 24 hours of booking. Please check your junk/spam folder for this. If you still can’t find your booking confirmations, please get in touch with us."
        }
    ],
    "pdf_files": []
}