{
    "url": "https://www.nottingham.edu.my/University-of-Nottingham-Asia-Research-Institute-Malaysia/Past-Events.aspx",
    "content": [
        {
            "p": "12 January 2021 Post COVID: Position of Malaysia’s GBS Industry in Asia and Beyond (Watch the recording here) Speakers include Justin J Anthony, Executive Director of PIKOM, Nik Izuddin, Head of Investor Management at MDEC, Dato' Munirah Looi, Founder & CEO of Brandt International, Michael Warren, CEO of Consulting Board Asia, and Sugeeta Bhanoo, Head of Capabilities, APAC at BAE Systems Applied Intelligence. The panel is chaired by Dr. Mandy Sim and moderated by Dr. Vengadeshvaran Sarma of University of Nottingham Malaysia. The Global Business Services (GBS) industry is commonly referred to as the outsourcing and shared services industry. This industry is estimated to be worth more than USD 200 billion globally and more than USD 6 billion in Malaysia (Everest Group, 2020; Bernama, 2019). It has grown by more than 10% per annum in Malaysia for the past 5 years and currently employs more than 250,000 people in the country (OM, 2020). The panel discussion will focus on the GBS industries growth in Asia, in particular Malaysia and what this growth holds for future graduates post COVID. 8 February 2021. Tatmadaw’s Return in Myanmar: The Military Coup and Aftermath (Watch the recording here) Panel speakers include Ms Thin Lei Win, Journalist, Debbie Stothard, Coodinator and Founder of ALTSEAN-Burma, Gayathry Venkiteswaran, UNM-SMLC and Romain Caillaud, Risk and Reputation Management Consultant, moderated by Bridget Welsh, Honorary Research Associate, UoNARI-M). On Feb 1st, Myanmar’s ambitious Commander-in-Chief General Min Aung Hliang seized power, arresting political leaders and activists and returning Myanmar to the trauma of Tatmadaw military rule. Refusing to recognize the November 2020 election results and allow the government led by National League for Democracy’s Aung San Sui Kyi to govern despite her party’s overwhelming electoral victory, the Tatmadaw has formed its own government, charged senior NLD leaders and worked to consolidate itself in power in the face of a growing civil disobedience campaign. Join our panel experts for an update on what the prospects are for the people of Myanmar as we focus on the effects of the coup in areas like conflict, business and economy, media, democracy, and human rights. 8 April 2021 Space, Symbol and Identity: Children in the Post New Order Indonesian Cinema Igak Satrya Wibawa, Universitas Airlangga This presentation argues that although post-New Order Indonesian cinema, produced during Indonesia’s reform era (2000-2015), has favoured diversity in its representation of children to challenge the New Order’s mono-cultural ideological legacy and its homogenous version of national identity, child characters have continued to be placed within the main narrative in order to be used as symbols to project Indonesian national ideals. In the films of this period, the concept of space and symbols are used to deliver the narrative of identity. The children are depicted within diverse identities of culture, race, and ethnicity and through various social and political themes but their depiction continues to overlap with traditional discursive habits in regards to the family, the school and the nation. Therefore, while engaging with contemporary themes of Indonesian society, post-New Order Indonesian children’s films continue reflecting older ideological practices and ways of thinking, which have been historically associated with New Order nationalism. 24 July 2021 Death and Democracy: Covid-19 and Malaysian Politics (Watch the recording here) Seminar by Dr. Bridget Welsh, discussant Prof. Khoo Boo Teik With Emergency Rule, limited parliament sessions and weak legitimacy, Covid-19 is seen as undermining democracy in Malaysia. In this seminar Dr Welsh argues that there are also opposite trends. While acknowledging the contraction of democratic space and adoption of more authoritarian practices, Welsh argues that Covid-19 is leaving a profound impact on political norms and behaviour. Not only are more people politically engaged, new forms of mobilization and generational shifts are taking place. Covid-19 may in fact leave Malaysia stronger to address the serious inequalities and policy and governance challenges exposed by Covid-19. Comparative measures: Covid-19 in South Korea & Malaysia - 9 December 2020 The COVID-19 pandemic has put a renewed focus on the social, political and religious dimensions of public health. While a sound understanding and accurate monitoring of the SARS-CoV2 virus are critically important, the success and failure of governments in controlling the pandemic are also influenced by the shifting perceptions of different social groups, a rapidly evolving public discourse and political expediencies. The pandemic is as much a public health as a social challenge. Panopticon-like measures have been adopted by some governments to control and manage the pandemic: from tracking individual credit card usage and contact tracing apps to punitive fines for breaking curfews and not observing standard operating procedures.Within this context, South Korea’s TRUST (transparency; robust screening and quarantine; unique but universally applicable testing and strict control and treatment) strategy with its earlier experience of dealing with Covid-19 was held up as a model by the Malaysian government. Despite TRUST and other effective strategies of dealing with the COVID-19 outbreak, challenges remain as subsequent waves have hit Malaysia and South Korea. In this panel talk, Dr. Nurliana will present a comparative Malaysian-South Korean perspective, while Dr. Hong will explore the role of protestant religion in the development of the COVID-19 pandemic in South Korea. When Buddhist Monks Meet Muslim Shrines: Buddhism and Islam in Transregional Perspective - 1 December 2020 This panel features a conversation between Jack Chia and Sumit Mandal on their research into transregional connections and inter-cultural interactions among Buddhists and Muslims respectively in Southeast Asia. Chia draws on multilingual research conducted in Indonesia, Malaysia, Singapore, China, Hong Kong and Taiwan to challenge the conventional categories of “Chinese Buddhism” and “Southeast Asian Buddhism” by focusing on lesser-known Chinese Buddhist communities. He explores the reasons behind the migration of Buddhist monks from China to Southeast Asia and how they helped to create a “South China Sea Buddhism.” Mandal discusses Muslim shrines (keramat) in Southeast Asia as the built archives of little-known histories of intellectual and political leadership as well as inter-religious and inter-cultural interaction. He explores how these shrines serve as repositories of a histories of movement and connection across the Indian Ocean. Sabah State Election Primer: Borneo Goes to Polls - 10 September 2020 With elections called for 26th September, Sabahans will decide their state government in competitive polls. Over ten political parties, scores of independent candidates, and different varieties of political ‘frogs’ will square off in 73 different seats to win over the 1.12 million voters. At stake is not only the fate of the leadership of Sabah, but the first competitive election for the national government led by Muhyiddin Yassin. Three experts with on the ground field experience discuss the context, contests and contentious issues. Discussion centers on how Sabah is unique, and the need to rethink paradigms to understand the complex and different drivers shaping Borneo politics. Dr Gaik Cheng Khoo and Dr Bridget Welsh, who headline the discussions, sit down with experts from the institute’s interdisciplinary network and look at the broader effects of the pandemic on society, economy and governance. In the first discussion, titled Introduction, Dr Khoo and Dr Welsh give the audience a brief overview of COVID-19 and also what to expect in the upcoming series of discussions. Now with 11 discussions, the series has encompassed some of the most interesting and relevant matters such as Rohingya and COVID-19 in Malaysia, Business Transformations and COVID-19, the Selangor State COVID-19 Taskforce, Food Security and Orang Asli, COVID-19 and China’s Soft Power, Sarawak State COVID-19: Coordination and Technology, Lessons for COVID-19 from Malaysia’s Earlier Crises, Food Security and The Future, COVID-19 and The Environment, and Media and Media Freedom. The series aims to ask what the new normal, post COVID-19 will be like, and also what needs to be done now to better understand the multi-faceted impact of COVID-19. “The aftermath of the pandemic has been manifold and we hope to shed light on these issues and at the same time, address as many of them as possible,” said Dr Khoo. CEO and Provost of the University of Nottingham Malaysia, Professor Graham Kendall said: “We commend this initiative by Drs Khoo and Welsh. The COVID-19 Conversations are an excellent avenue to make the public aware of the many facets of COVID-19 but also the breadth of our capacity as a university.” You can catch all the discussions here. Alternative Archives in Muslim Asia As Asian empires and dynastic realms gave way to nation-states in the 19th and 20th centuries, millions of Muslims across India, China, and Southeast Asian polities like Thailand and the Philippines found themselves in the unfamiliar position of national minorities. In many cases, the hardening of national borders severed or muted their global Islamic connections. Postmodern Approaches in Curating and Managing Arts Festivals Festivals have always functioned as long-term investment for communities to build a sense of cohesiveness, attachment, lifestyle, values, active citizenship, well-being, and new directions for future. These special events also facilitate visitors to understand and appreciate the cultures of these communities. The growth of festivals in recent years have accelerated the process of ‘festivalisation’ in global cities, which could lead to the weakening function of festivals to celebrate and build communities. Malaysian Young Scholars Research Network meeting with Cornell University Southeast Asian Studies Program representative, Andrew Willford at Malaysia Design Archive A UoNARI-M initiative, twenty one scholars working on Malaysia and the region came together to discuss their aspirations for the future of Malaysian Studies and to promote research linkages and possible collaboration of establishing a Centre for Malaysian Studies between Cornell University (represented by Anthropology Professor, Andrew Willford) and scholars based in Malaysia. Spaces of Occupation Workshop “Spaces of Occupation” will be the third workshop held under the ERC-funded Cultures of Occupation in Twentieth Century Asia (COTCA) project at the University of Nottingham. The workshop will be held with the support of the Institute of Asia and Pacific Studies (IAPS) at the University of Nottingham, Malaysia as well as the Asia Research Institute (ARI) at the University of Nottingham. This workshop will bring together scholars from multiple disciplines working at the nexus of history, geography, and foreign occupation in Asia. “Occupation” is defined broadly to include studies of colonialism, imperialism, conflict, and war. Spring Semester 2019 The 2019 Food Series: The University of Nottingham Malaysia proudly presents 5 public events over six weeks exploring current and future food trends. Organised across three distinct themes (Foraging, Farming and Table), we will hear from a indigenous community activist, anthropologists, an ecologist, filmmaker, sociologist, chefs and urban gardening groups, a Jogjakarta-based food study group about how food is tied to identity, environment and sustainability. Event 1 - Food, Foraging and Forest: Changing identities in Asia (a panel session) This panel session includes four invited speakers who will examine the connection between forests and communities, with specific examples from the Orang Asli community. It will explore the connection between belief systems, food and forest among indigenous communities; and the effect of changing boundaries and land ownership on accessibility and communal sharing of resources. The changing relationships with forests will also be examined through the lens of public policies and market institutions that increasingly commodify resources such as wildlife, land and fruit trees. Event 2: Food, Foraging and Forest Study Tour Hosted by the Temuan community of Kampung Tohor, this study tour is limited to 25 guests who will experience the connection between the forest and food first-hand. The morning will see the local community guiding guests through their local lands on a foraging expedition. Bountiful harvests will then be prepared by the community and guests and served for lunch, following traditional Temuan recipes. Event 3: Development Ecology and Aquaculture (a film screening and moderated discussion) Screening of “ The Hills and the Sea” a film by Andrew Ng - Penang is about to experience an unprecedented shift of its urban facade with the approval of multiple large-scale development projects under the Penang Transport Master Plan. While such news of development promises a much-desired face-lift and reinforcement of Penang’s economic prowess, it does come with a price that may only be apparent in hindsight. Event 4: Urban Ecology and Food (a panel session) In this session, the discussion will move towards ecological niches in urban spaces and examine the anthropogenic influence on urban greening. Using specific examples from projects that the guest speakers have led throughout the region, the speakers will explore the diversity of plants that are used in their initiatives as well as their functionality and contribution within urban spaces. As part of the food series, this session will focus on the rapid development of urban farming and gardening initiatives as new means of enhancing food accessibility in urban spaces. Event 5: Forgotten Recipes and Ingredients: culinary consciousness and creativity (a Chef’s Table) The Chefs’ Table is the culmination of our Food Series that began with Foraging, Forests to Farm and finally to a discussion among chefs that will explore culinary creativity around the tropics. This roundtable examines similarities and differences in cuisines across Asia. Two locally based chefs will speak on their experiences using local ingredients that have influenced the development of local cuisines. Malaysia in Canada: Penang’s influence on Daphne Marlatt This talk examines writer Daphne Marlatt’s relationship to Malaysia alongside the under-examined socio-political resonances between Canada and Malaysia during the 1960s and 1970s. Marlatt is best known in the Canadian literary arts today as a celebrated feminist poet, novelist, playwright, and editor whose experimental poetry in particular has shaped Canadian poetics over the past four decades. A Romance of Industry: Mining, Migration, and the Company Town in British Burma, 1906-1935 This paper, adapted from my dissertation entitled A Burmese Wonderland: British World Mining and the Making of Colonial Burma, focuses on the Burma Corporation, a transnational mining company located in Burma’s Northern Shan States during the late colonial period. Interdisciplinary perspectives on China’s Belt and Road Initiative This roundtable discussion revolves around the topic on China’s engagement of third party stakeholders on the security of BRI routes: The case of institutionalised bilateral cooperation with the EU, “The politics of CPEC: the domestic impact of the China-Pakistan Economic Corridor on Pakistan” and “The environmental challenges for China’s Belt and Road Initiative”. Autumn Semester 2018 Transnational Asia symposium How is Malaysia helping Korean people find happiness? How is the political rise of China affecting the higher education landscape in ASEAN countries? Is the spread of mobile social media bringing Southeast Asians closer together? The Beginnings of Islamic Law: Late Antique Islamicate Legal Traditions Lena Salaymeh will speak about her recently published book. Scrutinising its historical contexts, the book proposes that Islamic law is a continuous intermingling of innovation and tradition. Political Footballs: Refugee Education in Countries of Transit and the Case-Study of Malaysia Refugees may receive parts of their education in their country of origin, one or more countries of transit, and their country of resettlement. Yet, research into their educational journeys has received insufficient attention in countries of resettlement. Late colonial and early postcolonial responses to Chinese media in Britain's ‘East Asian territories’ In this paper, I will examine late colonial and early postcolonial responses to mainland Chinese media (including films, periodicals and gramophone records) in colonial Southeast Asia, particularly in the period leading up to and immediately following Merdeka (Independence) in 1957 and the achievement of self-government in Singapore in 1959. Female religious authority and the public sphere in Malaysia David’s research focuses on the ways in which female religious authorities have become part of the public sphere in Malaysia. He is particularly interested in the question of non-verbal and non-textual communication. A Roundtable on Politics and the Media in Southeast Asia This roundtable will feature speakers with considerable experience in media research and practice in Southeast Asia. Racial States, Racialised Religion and the Question of Liberal Justice Are modern nation-states capable of overcoming the issues of race and religion? The framework of political liberalism, that is the rule of law based on the equality of citizenship without reference to race or religion, is often posited as the ideal nation-state formation. 9th Biennial Association of Southeast Asian Cinema Conference The conference includes academic papers, film screenings and panels featuring guest filmmakers around the region from Indonesia, Phillippines, Thailand, Singapore and Malaysia. Entrepreneurial Masculinity and the New Misogyny: The Production of New Masculinities and Femininities in Contemporary Chinese Literature Recent research on China has highlighted that progress for Chinese women has ground to a halt, particularly in the public sphere and work place. Several novels by contemporary Chinese authors mirror this phenomenon in their narratives, illustrating how unbridled laissez-faire economic development in China serves to reinforce patriarchal privilege and exploits women who seek to function in the new economic order. Work, Affect, Mobility: Refiguring the Human in the Tiger Factory and Ilo Ilo Focusing on Tiger Factory (Woo Mingjin 2010) and Ilo Ilo (Anthony Chen 2012), this talk attempts to map out and contextualise the terrain these films cover using the lens of work and affect. How do these films account for the human interaction and affect that is written out of the neo-liberal economic script of labour and labour migration will be discussed. Hiding the clouds with the palm of your hands: Engaging with the difficulty of reality in conflict-ridden Thailand's far south This talk touches on the lives and livelihoods of the mak pasar (mothers of the market) food vendors and their tireless efforts and sacrifices to support their families within tumultuous circumstances in Thailand’s far south. Singapore Governance: Reform Without Democratisation followed by a Roundtable Discussion The workshop will investigate the pressures on Singapore’s governance model, focusing on a number of themes/questions including: Myanmar Residents in Bukit Bintang: Cosmopolitanism in the Indian Ocean This paper discusses Myanmar residents in Bukit Bintang, an old neighbourhood of Kuala Lumpur – traditionally an entertainment district, and since colonial times a destination for foreign migrant workers. The discussion centres briefly on their itineraries out of various locations in Myanmar to Malaysia, in particular the Indo-Burmese borderlands, and then out of the country to diverse destinations; their presence as unskilled labourers; and their community life. The Boxer, the Cop and the Gangster: Portrayals of Thai Hard Masculinity in the Films of Kongkiat Khomsiri This paper presentation will draw attention to the divergence between the traditional model of Thai hegemonic masculinity and its current manifestations, and argue that Khomsiri’s strong men striving to reach the ideals of Thai masculine ideology are doomed to fail because the values this ideology represents are no longer upheld in contemporary, materialistically-oriented Thai society. Making Sense of Indonesian Failing Democracy This seminar argued that Demokrasi Pancasila, which was supposed to be a “middle path,” to Indonesian democracy, is neither liberal nor socialist and has failed to produce a new course of philosophy & politics. Instead, it has become a collection of meaningless efforts – an ideological concoction of communalism & socialism, and sometimes liberalism. Rethinking Memory in Encountering the Mass Violence of 1965 in Indonesia Although the human rights perspective has been the dominant way to comprehend and respond to the legacies of mass violence, this seminar argued that this perspective is compromised and is of limited value. This seminar provided an alternative viewpoint of a continuous primitive accumulation as understood through the lens of world systems theory. Tiger Mother, Asia & Western Education IAPS Talking Points explored the parenting style of Tiger Mother, Amy Chua followed by a discussion of the differences between Western and Asian education and how these differences contribute to schooling experience in UNMC. No Pain, No Gain – Cutting Subsidies is Necessary For Malaysia’s Future Prosperity Panel debate by: In association with the British High Commission, KL, this panel debate was the first in a series of highly topical panel debates focused on the impact of Malaysian government’s subsidy rationalisation policy in the economy. The BRICS in Southeast Asia This paper compared the influence of the BRICS in Southeast Asia, making use of the different forms of power: compulsory, institutional, structural & productive. Film Censorship in Malaysia This round table discussion addresses the status of film censorship in Malaysia and the Lena Hendry case. On the 3 July 2013, human rights activist Lena Hendry was arrested for organising a screening of the film No Fire Zone: The Killing Fields of Sri Lanka (2013) which was not vetted or approved by the Film Censorship Board of Malaysia. Ethnic Autonomy in Asia, A Road to Secession? This seminar surveyed the normative and practical arguments made for and against ethno-federalism and considered whether it is as dangerous as a strategy as it is perceived. Hallyuwood and the Politics of Visibility This seminar argued that the increased international visibility of South Korea – through “hallyu” – points toward an increasingly hybrid & porous model for recognising and consuming differences which goes beyond the usual boundaries that have defined the theoretical frameworks of Orientalism and Occidentalism. Spying on Asia - Does Intelligence Matter? IAPS Talking Points explored the role of intelligence in international relations and whether the spying revelations will hurt the position of the United States in Asia. Exploring the Relationship Between Borders, Work and Identity This seminar investigated the multiple border crossings of Sambas Malay women, who cross national, linguistic and socio-cultural borders as they move from Indonesia to East Malaysia and Brunei in pursuit of work. telephone: +603 8924 8000 fax: +603 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}