{
    "url": "https://www.nottingham.edu.my/University-of-Nottingham-Asia-Research-Institute-Malaysia/Eventsrecords/The-2019-Food-Series-Event-1-Forgotten-and-Future-Foods.aspx",
    "content": [
        {
            "p": "Details: Food, Foraging and Forest: Changing identities in Asia (a panel session) Panel: Khairunnisa (Bakudapan), Monika Swastyastu (Bakudapan) & Jenita Engi (UC INAI) Moderated by: Dr Gaik Cheng Khoo, UoNARI-M This panel session includes four invited speakers who will examine the connection between forests and communities, with specific examples from the Orang Asli community. It will explore the connection between belief systems, food and forest among indigenous communities; and the effect of changing boundaries and land ownership on accessibility and communal sharing of resources. The changing relationships with forests will also be examined through the lens of public policies and market institutions that increasingly commodify resources such as wildlife, land and fruit trees. Part A: Presentation by Bakudapan on edible weeds Bakudapan is a study group established in 2015 that has conducted projects on edible wild plants in Yogyakarta, Indonesia. The group explored edible wild plants in the city, raising awareness on edible wild plants in the cities and their identification in local markets. Their exploration also raised questions about accessibility and ownership on empty private lands. They have found edible wild plants to be an important catalyst in connecting people’s memories with traditional diets. In Indonesia, ‘foraging’ can be translated into meramban/ngramban (v) which means looking for young leaves to be eaten as vegetables or for cattle fodder, especially goat. Another meaning of ngramban is part of a hermit in kejawen (a Javanese belief) to get a vision/revelation/fortune by going alone into the forest and only eating plants from the surrounding. Ngramban also used to be a food security strategy to survive food scarcity, drought, or precarity. Alas, the massive development of the city now makes it impossible to continue the practice of ngramban. Therefore, Bakudapan uses ngramban as a method not only to look for young leaves, but also to examine social issues and grasp the social context. Ngramban has brought Bakudapan to understand people’s strategy in dealing with cities’ rapid growth, gentrification, land access and urbanization. Bakudapan also uses ngramban in a more metaphorical sense, in relation to the activity of foraging for knowledge. Part B: Panel session This panel session includes four invited speakers who will examine the connection between forests and communities, with specific examples from the Orang Asli community. It will explore the connection between belief systems, food and forest among indigenous communities; and the effect of changing boundaries and land ownership on accessibility and communal sharing of resources. The changing relationships with forests will also be examined through the lens of public policies and market institutions that increasingly commodify resources such as wildlife, land and fruit trees. telephone: +603 8924 8000 fax: +603 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}