{
    "url": "https://www.nottingham.ac.uk/universitycouncil/getinvolved/getinvolved.aspx",
    "content": [
        {
            "p": "There are many ways in which individuals can support the continued development of The University of Nottingham. Many high profile and successful individuals from our alumni community, the local community and global businesses decide that standing for a position on University Council is an excellent way to contribute. Membership enables them to: Universities tend not to be like any other business. Our business is knowledge, education and thought-leadership. We have objectives and methods of working that are unique from commercial businesses. This difference often appeals to new external members of Council and challenges them also to think in new ways and work in a new and exciting environment. At Nottingham we have a strong commitment to developing the finest students and world-class research. Our campuses span Europe and Asia, and our students and academics come from all over the world. By becoming a member of Council, you help to support a global community with one goal: knowledge. University Council strives to evolve with changing times and changing needs. Council aims to be diverse in its membership. Membership is encouraged amongst a range of high profile and influential individuals and communities. Details of any vacancies for external members of Council will be listed here. Staff and student representatives are elected to Council from other positions of responsibility within the University. Getting involved in University Council requires a personal commitment to devote time and effort to supporting the growth of The University of Nottingham. However, there are many other ways in which influential individuals also choose to support the University and impact on its development: Registrar's Office, Trent Building University of Nottingham, University Park Nottingham NG7 2RD telephone: +44 (0) 115 951 5761 fax: +44 (0) 115 951 5739 email: registrars@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}