{
    "url": "https://www.nottingham.edu.my/University-of-Nottingham-Asia-Research-Institute-Malaysia/Study/UoNARI-M-scholarship-holders.aspx",
    "content": [
        {
            "p": "Tan Chong Yew, Kevin is a PhD candidate in Politics with the School of Politics, History and International Relations in the Faculty of Arts and Social Sciences. He holds a BSocSc (Hons) degree from Universiti Sains Malaysia and a MSc from the School of Oriental and African Studies in London, UK. His research interests are democracy and democratisation, especially in divided societies, identity politics and the public sphere. In light of the current development in Malaysia's public sphere, Tan is trying to understand whether the country's fragmented civil societies can bridge the gap in terms of ethnicity and religion to emerge as an effective force for democratisation. He will also explore the meaning of democracy for ordinary Malaysians. Prior to this, he taught at a local private university on full-time basis and wrote for several newspapers. Ahmad Fuad Rahmat is a PhD candidate in Cultural Studies with the School of Modern Languages and Cultures. He is currently editor for ProjekDialog.com, a social media platform for intercultural outreach among Malaysian youths. He is also the co-host for Night School a weekly show on BFM radio that explores sociology and philosophy. He holds an M.A. in politics from University College Dublin and an M.A. in Social and Applied Philosophy from Marquette University. He is interested in the relationship between modernity, Malay identity and Islamisation. His research utilises a psychoanalytic framework to study the intersections of sexual repression and state-driven Islamisation, with particular focus on their manifestations in Malay popular culture. Tan Zi Hao is a postgraduate student taking up MA International Relations in the School of Politics, History and International Relations. He holds a BA (Hons) International Communications Studies from The University of Nottingham Malaysia Campus. As a disciplinary nomad, Tan works across different fields. He was formerly trained as a graphic designer in The One Academy. His early involvement in NGOs as a designer and campaign adviser later convinced him to dabble into the social sciences and humanities. His academic interest spans a diversity of topic including postcolonialism, Southeast Asian studies, sociology of the body, and visual culture in both vernacular and contemporary arts. Tan himself is a visual artist who has exhibited across Malaysia, Singapore, Taiwan and the United Kingdom. He is a writer and has lately contributed a chapter on the deliberate absenting of the body in Malaysian paintings since 1970s, published in Narratives in Malaysian Art: Reactions - New Critical Strategies. Petra is a PhD candidate in History at the University Nottingham, Malaysia. She holds a BA in English Literature from the University of Canterbury, New Zealand and a Masters of Human Rights and Democratisation from the University of Sydney, Australia. She spent her final semester on exchange with Universitas Gadjah Mada while serving her internship with the Indonesian Planned Parenthood Association (IPPA). Her PhD researches the contribution of forgotten communities in building the capital city of Malaysia. This examines the growth of Petaling Street and its inhabitants, as adults and children of all genders engaged in complex negotiations with the various authorities for survival. These day-to-day interactions shaped Kuala Lumpur as we know it today. She has taught at local private universities and has served as full-time staff and board member for various organisations in the areas of children and women’s rights. telephone: +603 8924 8000 fax: +603 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}