{
    "url": "https://www.nottingham.edu.my/University-of-Nottingham-Asia-Research-Institute-Malaysia/About/Fellowships.aspx",
    "content": [
        {
            "p": "The Asia Research Institute at the University of Nottingham Malaysia welcomes fellowship applications from scholars working on aspects of Asia that connect with the Institute’s theme of TransAsia as well as its members’ research interests. The theme of TransAsia broadly encompasses research in several fields that cover linkages, influences and networks across national and cultural borders within Asia or between Asia and beyond. Examples include issues of trust, security, soft power, food and identity in Asia or inter-Asia, media and gender, migration, as well as cosmopolitan networks. Applications outside of this theme are welcome, but intending applicants should contact the Institute’s Director, Associate Professor Gaik Cheng Khoo, prior to submission. There are two types of honorary affiliations: Visiting Research Fellowships for applicants from overseas institutions who would like to be affiliated with us while temporarily based in Malaysia; or Honorary Research Associates for independent scholars based in Malaysia. For the 2023-2024 academic year, UoNARI is inviting applications especially from scholars working in Southeast Asia who wish to use the writing fellowship to complete an article for journal publication. A small living allowance of up to RM4,000 is available upon application, but it is expected that applicants will already be at an academic institution or have institutional employment elsewhere. We welcome applications from scholars who have not yet published in English but who have made a recognised contribution to scholarship in a language of the person’s home country. Assistance with the English-language publication may be offered. For all affiliated positions, any resulting publications will acknowledge affiliation with UoNARI, Malaysia, be asked to present a seminar, and encouraged to attend the activities of UoNARI. Applications based on co-authorship with a Nottingham academic are also welcome. Please submit your applications by email to UoNARI@nottingham.edu.my. An application should consist of a two-paged research and publication proposal detailing your topic as well as the duration and dates of your visit and a CV. In addition, we require the name of two referees willing to comment on your scholarly work. If possible, indicate a University of Nottingham Malaysia faculty member you would like to collaborate with or serve as your mentor. Those holding honorary positions - successful fellows and research associates - will be given a University of Nottingham Malaysia email account, access to the online library resources and the use of the computer facilities in the Kuala Lumpur Teaching Centre (KLTC) on Jalan Conlay. In addition to the above, the writing fellow will be allocated a workspace in the Semenyih campus. Applications close on 15 December 2023 (for: 1 February - 31 August 2024 fellows). Only one writing fellow will be appointed in 2023-24 academic year. Decisions will be made by the UoNARI-M Board telephone: +603 8924 8000 fax: +603 8924 8001 email: enquiries@nottingham.edu.my"
        }
    ],
    "pdf_files": []
}