{
    "url": "https://www.nottingham.ac.uk/utilities/privacy/privacy-information-for-the-subjects-of-photography-and-videography.aspx",
    "content": [
        {
            "p": "Return to our central privacy information We collect personal information in the form of your appearance, voice and distinguishing features through recording video and photoshoots ('Image data'), and we may also ask to collect identifiable data to allow us to track you in our systems, such as your name and contact details. We use your video and/or photographs in our marketing materials related to the research, teaching and reputational promotion of the University of Nottingham. Photographs and video may be published online, in print, used in promotional materials at events or in advertising and broadcast. We may share personal information with partner organisations where they are using data for compatible purposes. We may use your personal details to personalise footage/photos we take of you but we'll only include this if you agree to it. Otherwise we will only use your details to identify you within our system to help us ensure your right to erasure. Image data may be retained in perpetuity as historical and archival records of the University of Nottingham. Where image data is determined to be not appropriate for these purposes, it will be securely destroyed. The University may share your personal data between colleagues and departments who legitimately need access to that information in order to carry out their normal duties to pursue our legitimate interest. The University may share your personal data between colleagues and departments who legitimately need access to that information in order to carry out their normal duties to pursue our legitimate interest. We may use third-party companies to collect and process data, including professional photographers, videographers, design agencies and printing and broadcast services. We may also share data with third parties where they use the data for purposes compatible with the purposes for which the information was originally collected, for example promotion. A full list of these third parties is available from External Relations upon request, and all third parties must sign a data agreement with us before being allowed to process data ensuring that they treat your data with care. Sometimes we may wish to pass on photographs and video to the press for wider publication in stories relating to the University of Nottingham and the Higher Education sector as a whole. We will share data with our campuses in China and Malaysia under the central data handling agreements. Our overseas campuses follow UK GDPR processes and operate on our instructions for the handling of data. We will share data with our campuses in China and Malaysia under the central data handling agreements. The University of Nottingham also works with suppliers and partners who may make use of Cloud and/or hosted technologies. We undertake data security due diligence on our partners, ensure that suitable contracts are in place and that these partners conform to appropriate accreditations. Wherever these transfers take place, the University will have an appropriate contract in place and there are strict rules regarding the confidentiality and security of your information in place to safeguard it. Under the GDPR we must establish a legal basis for processing your personal data and let you know what this is. It is in the University's legitimate interest to process your personal data for the above purposes. If you have any questions about photography, please contact the Photographic Team at br-photographic@nottingham.ac.uk or for videography please contact the Digital Team at digicomms@nottingham.ac.uk We will keep this privacy notice under regular review and we will place any updates on this web page."
        }
    ],
    "pdf_files": []
}