{
    "url": "https://www.nottingham.ac.uk/utilities/cookies.aspx",
    "content": [
        {
            "p": "Our Privacy and Cookies policy was last updated in November 2022. Our Privacy Policy is now on a separate page. A cookie is a simple text file that is stored on your computer or mobile device by a website's server and only that server will be able to retrieve or read the contents of that cookie. It allows a website to remember things like your preferences or what's in your shopping basket. This page has a brief explanation of each type of cookie we use. If you want more details on specific cooks, read our detailed cookie information page. These are cookies that are required for the operation of our website. They include, for example, cookies that enable you to log into secure areas of our website, use a shopping cart or make use of e-billing services. They allow us to recognise and count the number of visitors and to see how visitors move around our website when they are using it. This helps us to improve the way our website works, for example, by ensuring that users are finding what they are looking for easily. These are used to recognise you when you return to our website. This enables us to personalise our content for you, greet you by name and remember your preferences (for example, your choice of language or region). These cookies record your visit to our website, the pages you have visited and the links you have followed. We will use this information to make our website and any advertising arising out of it more relevant to your interests. We may also share this information with third parties for this purpose. Please check the 'Help' menu of your browser to learn about your cookie preferences, and how to remove cookies from your system. The website www.allaboutcookies.org will provide you with further information about cookies. You can block cookies by activating the setting on your browser that allows you to refuse the setting of all or some cookies. Please note that by disallowing cookies some functionality on the site may be restricted."
        }
    ],
    "pdf_files": []
}