{
    "url": "https://www.nottingham.edu.my/Utilities/Notis-Perlindungan-Data.aspx",
    "content": [
        {
            "p": "Akta Perlindungan Data Peribadi 2010, (\"Akta\") mengawal selia pemprosesan data peribadi di dalam transaksi komersil. Akta ini menghendaki Universiti Nottingham Kampus Malaysia (\"Universiti\") untuk memaklumkan kepada anda tentang data peribadi yang dikumpulkan daripada anda dan diproses oleh Universiti. Terma-terma yang terdapat di dalam Notis Perlindungan Data (“Notis”) ini seperti “data peribadi”, “pemprosesan”, “transaksi komersil”, dan “orang yang berkaitan” membawa makna yang sama sepertimana yang dinyatakan di dalam Akta. Untuk tujuan Notis ini, ungkapan seperti “kami” adalah merujuk kepada Universiti Nottingham Kampus Malaysia, manakala ungkapan “anda” adalah merujuk dan merangkumi pelajar, bakal pelajar, bekas pelajar, klien, pelanggan, bakal pelanggan, penjual, pembekal, pembekal perkhidmatan dan/atau orang yang berkaitan seperti ibu bapa/penjaga pelajar, bakal pelajar atau bekas pelajar kami, pengarah, kakitangan pelanggan korporat, penjual, pembekal, pembekal perkhidmatan dan wakil sah yang menerima perkhidmatan, mendapatkan perkhidmatan dari ataupun yang memberikan perkhidmatan kepada Universiti. Kami memproses data peribadi anda dan ia termasuk data peribadi orang yang berkaitan. Notis ini hendaklah terpakai kepada orang yang berkaitan dan anda memberi jaminan kepada Universiti yang anda mempunyai kuasa atau telah diberi kuasa untuk bertindak dan memberi kebenaran bagi pihak ketiga, dengan menyediakan data peribadi pihak ketiga ke Universiti untuk tujuan dan pendedahan seperti yang dinyatakan di dalam Notis ini dan anda berjanji untuk memberikan salinan Notis ini kepada pihak ketiga. Pemberian Notis ini hendaklah dianggap sebagai notis yang diberikan kepada dan kebenaran yang diperolehi daripada pihak ketiga. Data peribadi yang disediakan secara sukarela oleh anda, ibu bapa anda, penjaga, agen perekrutan, majikan anda, syarikat anda, penaja, di acara-acara yang dianjurkan atau disertai oleh Universiti dan/atau yang telah kami dapatkan dengan sendirinya dari lain-lain sumber-sumber yang sah (sekiranya ada dari depositiri awam, direktori perniagaan/direktori atas talian, agensi pelapor kredit, domain awam dan pihak ketiga yang telah diberi kuasa) di dalam borang-borang kami, perjanjian, laman web, dan/atau lain-lain dokumen yang sehubungan dengannya merangkumi maklumat mengenai nama anda, alamat (seperti alamat surat-menyurat dan alamat tetap), nombor telefon (seperti nombor telefon bimbit, rumah dan telefon pejabat), nombor faksimili, alamat e-mel, nombor kad pengenalan, nombor pasport, contoh tandatangan, umur, tarikh lahir, jantina, keturunan, kewarganegaraan, negara asal, nama syarikat, pekerjaan, gaji, jawatan kerja, nombor kad kredit, sejarah kredit, kepercayaan agama, keadaan kesihatan dan maklumat perubatan, maklumat sabitan jenayah, maklumat penaja, maklumat referi (seperti nama referi, jawatan kerja, alamat, nombor telefon dan alamat e-mel), keputusan peperiksaan terdahulu, transkrip akademik, kelayakan akademik, rekod akademik, butiran bank (seperti nama bank, alamat bank dan akaun bank), imej (termasuk gambar) dalam format audio dan/atau video, televisyen litar tertutup (\"CCTV\") dan keselamatan rakaman (secara kolektif \"Data Peribadi\"). Dengan memberikan Data Peribadi anda secara sukarela, anda memberi kebenaran untuk kami mengumpul, menggunakan dan memproses Data Peribadi anda. Anda dengan ini mengesahkan bahawa Data Peribadi yang diberikan oleh anda atau yang diperolehi daripada anda, ibu bapa anda, penjaga, agen perekrutan, majikan anda, syarikat anda dan penaja adalah mencukupi, tepat, lengkap dan tidak mengelirukan dan bahawa Data Peribadi tersebut adalah diperlukan oleh kami untuk memberikan perkhidmatan kami kepada anda dan untuk mewujudkan suatu transaksi komersil. Jika anda memilih untuk tidak memberikan Data Peribadi atau jika Data Peribadi tidak mencukupi, tidak tepat, tidak lengkap dan/atau mengelirukan, Universiti berkemungkinan tidak dapat memberikan perkhidmatan yang anda perlukan atau tahap perkhidmatan yang anda kehendaki. Kami akan memproses Data Peribadi yang berkaitan dengan transaksi komersil bagi mana-mana tujuan yang berikut: Di dalam memberikan perkhidmatan-perkhidmatan yang anda perlukan, anda dengan ini memberikan kebenaran dan kuasa kepada kami untuk mendedahkan Data Peribadi anda kepada pihak-pihak seperti yang berikut (di dalam dan/atau di luar Malaysia): Hak Akses dan/atau Membetulkan Data Peribadi Anda berhak untuk: Sekiranya anda ingin memohon untuk mengakses atau membuat pembetulan ke atas Data Peribadi anda atau menghadkan pemprosesan Data Peribadi anda, segala pertanyaan atau aduan boleh dikemukakan kepada: Anda dikehendaki membuat permohonan anda secara bertulis atas sebab-sebab keselamatan dan bagi tujuan pengesahan. Selaras dengan peruntukan Akta, kami akan mengenakan fi yang telah ditetapkan bagi kesemua permohonan untuk mengakses Data Peribadi yang dilakukan oleh anda. Sekiranya kami menolak permohonan anda untuk mengakses dan/atau membuat pembetulan ke atas Data Peribadi anda, kami akan memberitahu anda sebab-sebab penolakan permohonan tersebut. Kami akan memastikan agar Data Peribadi anda adalah tepat, lengkap dan merupakan maklumat yang terkini. Oleh itu, sekiranya terdapat sebarang perubahan pada Data Peribadi anda, anda hendaklah menghubungi kami secara terus kepada alamat seperti yang telah tertera di atas. Kami akan menyemak dan mengemaskini Notis ini dari semasa ke semasa, berdasarkan kepada perubahan yang dilakukan di dalam Akta. Versi Notis yang terkini akan disediakan kepada anda sekiranya anda membuat permintaan di alamat yang dinyatakan di atas atau ianya juga boleh didapati di www.nottingham.edu.my. Dengan menerima perkhidmatan, mendapatkan perkhidmatan dari ataupun memberikan perkhidmatan secara berterusan kepada Universiti, segala pengubahsuaian atau perubahan pada Notis ini merupakan penerimaan anda terhadap segala pengubahsuaian atau perubahan pada Notis ini. Sekiranya terdapat apa-apa ketidakselarasan di antara Notis versi Bahasa Inggeris dan juga versi Bahasa Malaysia, Notis versi Bahasa Inggeris hendaklah digunapakai dan didahulukan dari Notis versi Bahasa Malaysia."
        }
    ],
    "pdf_files": []
}