{
    "url": "https://www.nottingham.ac.uk/utilities/privacy/privacy.aspx",
    "content": [
        {
            "p": "The University of Nottingham, University Park, Nottingham, NG7 2RD (0115 951 5151), is committed to protecting your personal data and informing you of your rights in relation to that data. The University of Nottingham is registered as a Data Controller under the Data Protection Act 2018 (registration No. Z5654762). One of our responsibilities as a data controller is to be transparent in our processing of your personal data and to tell you about the different ways in which we collect and use your personal data. The University will process your personal data in accordance with the UK General Data Protection Regulation (UK GDPR, GDPR) and the Data Protection Act 2018 (DPA) and this privacy notice is issued in accordance with the GDPR Articles 13 and 14. We may update our Privacy Notices at any time. The current version of all of our Privacy Notices can be found below, and we encourage you to check back here regularly to review any changes. Read our privacy notices now The University has appointed a Data Protection Officer. Their postal address is: Data Protection Officer, B16, Lenton Hurst, University of Nottingham, University Park, Nottingham NG7 2RD They can be emailed at dpo@nottingham.ac.uk. We define personal data as information relating to a live, identifiable individual. It can also include \"special categories of data\", which is information about your racial or ethic origin, religious or other beliefs, physical or mental health, the processing of which is subject to strict requirements. Similarly information about criminal convictions and offences is also subject to strict requirements. \"Processing\" means any operation which we carry out using your personal data, for example obtaining, storing, transferring or deleting. We only process data for specified purposes and if it is justified in accordance with data protection law. Details of each processing purpose and its legal basis is given in each privacy notice listed below - please consult the one more relevant to your relationship to the University. Unless specific time periods are given in the relevant Privacy Notice, your data will be kept in line with the University's Records Retention Schedule. To determine the appropriate retention period for personal data, we consider the amount, nature and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal requirements. If you need more detailed advice on how long your data will be kept for, please contact the data protection team. You have the following rights in relation to your personal data processed by us: The University will ensure you have sufficient information to ensure that you're happy about how and why we're handling your personal data, and that you know how to enforce your rights. The University provides information in the form of privacy notices. You can read all of our privacy notices online. You have a right to see all the information the University holds about you. Where data is held electronically in a structured form, such as in a database, you have a right to receive that data in a common electronic format that allows you to supply that data to a third party - this is called \"data portability\". To make a request for your own information please see our Data Protection website. If we're holding data about you that is incorrect, you have the right to have it corrected. Please complete our Information Rights Form. You can ask that we delete your data and where this is appropriate we will take reasonable steps to do so. The right to erasure is a limited right, and we may not be able to agree to requests for erasure. If this occurs, we will explain why your request is not being actioned. If you think there's a problem with the accuracy of the data we hold about you, or we're using data about you unlawfully, you can request that any current processing is suspended until a resolution is agreed. You have a right to opt out of direct marketing. You have a right to object to how we use your data if we do so on the basis of \"legitimate interests\" or \"in the performance of a task in the public interest\" or \"exercise of official authority\" (a privacy notice will clearly state to you if this is the case). Unless we can show a compelling case why our use of data is justified, we have to stop using your data in the way that you've objected to. We endeavour to ensure that an opt out option is included in all electronic direct marketing. We may use a computer program, system or neural network to make decisions about you (for example, everyone that is on a particular course gets sent a particular letter) or to profile you. You have the right to ask for a human being to intervene on your behalf or to check a decision. If we are relying on your consent to process your data, you may withdraw your consent at any time. For more information on your rights, if you wish to exercise any right, for any queries you may have or if you wish to make a complaint, please contact our Data Protection Officer. You have a right to complain to the Information Commissioner's Office (ICO) about the way in which we process your personal data. You can make a complaint on the ICO's website. Please consult the privacy notice that best fits your relationship with the University. Students and applicants Staff, job applicants and others working at the University Visitors, correspondents and prospective applicants Visitors to our website Alumni, supporters and friends Subjects of photography & videography Clinical, medical and human physiology research participants Students and Applicants of the University of Nottingham Online (UoNO)"
        }
    ],
    "pdf_files": []
}