{
    "url": "https://www.nottingham.ac.uk/utilities/details-about-cookies-on-nottingham.ac.uk.aspx",
    "content": [
        {
            "p": "nottingham.ac.uk amp_cookie_test Description: These cookies are used by Amplitude for session tracking for analytics purposes. Lifespan: a year Secure: Http only: www.nottingham.ac.uk Description:These cookies are used by Amplitude for session tracking for analytics purposes. Lifespan:Session ASP.NET_SessionId Description:General purpose platform session cookie, used by sites written with Miscrosoft .NET based technologies. Usually used to maintain an anonymised user session by the server. u.nottingham.ac.uk __cf_bm Description:The __cf_bm cookie is a cookie necessary to support Cloudflare Bot Management, currently in private beta. As part of our bot management service, this cookie helps manage incoming traffic that matches criteria associated with bots. This is a CloudFoundry cookie Lifespan:a few seconds __cflb Description:This cookie is used by Cloudfare for load balancing. cb-enabled Description:This cookie is associated with a free script which shows a cookie alert notice on a website. It is used to record when the user has dismissed the notice to prevent it re-appearing on return visits. Lifespan:a year _tldtest_ Description:Amplitude ac.uk _hjDonePolls Description:This cookie is set once a visitor completes a poll using the Feedback Poll widget. __utma Description:This is one of the four main cookies set by the Google Analytics service which enables website owners to track visitor behaviour and measure site performance. This cookie lasts for 2 years by default and distinguishes between users and sessions. It it used to calculate new and returning visitor statistics. The cookie is updated every time data is sent to Google Analytics. The lifespan of the cookie can be customised by website owners. Lifespan:2 years _hjSession_66317 Description:A cookie that holds the current session data. This ensues that subsequent requests within the session window will be attributed to the same Hotjar session. _hjTLDTest Description:When the Hotjar script executes we try to determine the most generic cookie path we should use, instead of the page hostname. This is done so that cookies can be shared across subdomains (where applicable). To determine this, we try to store the _hjTLDTest cookie for different URL substring alternatives until it fails. After this check, the cookie is removed. _gclxxxx Description: Google conversion tracking cookie Lifespan:3 months _hjAbsoluteSessionInProgress Description:This cookie is used by HotJar to detect the first pageview session of a user. This is a True/False flag set by the cookie. _ga Description:This cookie name is associated with Google Universal Analytics - which is a significant update to Google's more commonly used analytics service. This cookie is used to distinguish unique users by assigning a randomly generated number as a client identifier. It is included in each page request in a site and used to calculate visitor, session and campaign data for the sites analytics reports. By default it is set to expire after 2 years, although this is customisable by website owners._ga _gat Description:This cookie name is associated with Google Universal Analytics, according to documentation it is used to throttle the request rate - limiting the collection of data on high traffic sites. It expires after 10 minutes._ga _gid Description:This cookie name is associated with Google Universal Analytics. This appears to be a new cookie and as of Spring 2017 no information is available from Google. It appears to store and update a unique value for each page visited._gid __utmt Description:This cookie is set by Google Analytics. According to their documentation it is used to throttle the request rate for the service - limiting the collection of data on high traffic sites. It expires after 10 minutes _hjSessionUser_66317 Description: Hotjar cookie that is set when a user first lands on a page with the Hotjar script. It is used to persist the Hotjar User ID, unique to that site on the browser. This ensures that behaviour in subsequent visits to the same site will be attributed to the same user ID. __utmc Description:This is one of the four main cookies set by the Google Analytics service which enables website owners to track visitor behaviour and measure site performance. It is not used in most sites but is set to enable interoperability with the older version of Google Analytics code known as Urchin. In this older versions this was used in combination with the __utmb cookie to identify new sessions/visits for returning visitors. When used by Google Analytics this is always a Session cookie which is destroyed when the user closes their browser. Where it is seen as a Persistent cookie it is therefore likely to be a different technology setting the cookie. _hjIncludedInSessionSample Description:This cookie is set to let Hotjar know whether that visitor is included in the data sampling defined by your site's daily session limit. __utmb Description:This is one of the four main cookies set by the Google Analytics service which enables website owners to track visitor behaviour and measure site performance. This cookie determines new sessions and visits and expires after 30 minutes. The cookie is updated every time data is sent to Google Analytics. Any activity by a user within the 30 minute life span will count as a single visit, even if the user leaves and then returns to the site. A return after 30 minutes will count as a new visit, but a returning visitor. _ga_NTJWP5TDWB Description:_ga _hjIncludedInPageviewSample Description:This cookie is set to let Hotjar know whether that visitor is included in the data sampling defined by your site's pageview limit. _hjFirstSeen Description:Identifies a new user's first session on a website, indicating whether or not Hotjar's seeing this user for the first time. __utmz Description:This is one of the four main cookies set by the Google Analytics service which enables website owners to track visitor behaviour measure of site performance. This cookie identifies the source of traffic to the site - so Google Analytics can tell site owners where visitors came from when arriving on the site. The cookie has a life span of 6 months and is updated every time data is sent to Google Analytics. Lifespan:6 months adobe.com ak_bmsc Description:This cookie is associated with Akamai and is used to differentiate between traffic from humans and bots. Survey-Started-05b57121b519ff086dd3d52a944a90ab27f7 Description:This domain is owned by UK company Dot Mailer and is used to deliver customer survey services and functionality. Survey-Started-8b3ada0e5adac4b15yajefc680c3c3984d87 Survey-Started-43681aa384c449f462ea263841e6fc078590 Survey-Started-fcec80b740d17eec650mbedce40be754246e _fbp Description:Used by Facebook to deliver a series of advertisement products such as real time bidding from third party advertisers amp_045277 Description:Supports Amplitude product analytics. youtube.com CONSENT Description:This cookie carries out information about how the end user uses the website and any advertising that the end user may have seen before visiting the said website. microsoft.com MS0 Description: demdex.net demdex Description:This cookie helps Adobe Audience Manger perform basic functions such as visitor identification, ID synchronization, segmentation, modeling, reporting, etc. bing.com MUID Description:This cookie is widely used my Microsoft as a unique user identifier. It can be set by embedded microsoft scripts. Widely believed to sync across many different Microsoft domains, allowing user tracking. linkedin.com AnalyticsSyncHistory Lifespan:a month google.com NID Description:This domain is owned by Google Inc. Although Google is primarily known as a search engine, the company provides a diverse range of products and services. Its main source of revenue however is advertising. Google tracks users extensively both through its own products and sites, and the numerous technologies embedded into many millions of websites around the world. It uses the data gathered from most of these services to profile the interests of web users and sell advertising space to organisations based on such interest profiles as well as aligning adverts to the content on the pages where its customer's adverts appear. adnxs.com anj Description:This cookie contains data denoting whether a cookie ID is synced with an AppNexus partner. YSC UserMatchHistory Description:This cookie is used to track visitors so that more relevant ads can be presented based on the visitor's preferences. adscale.de uu mathtag.com uuid Description:This cookie is used to optimize ad relevance by collecting visitor data from multiple websites – this exchange of visitor data is normally provided by a third-party data-center or ad-exchange. mt_mop sxp.smartclip.net psyn www.linkedin.com bscookie Description:Used by the social networking service, LinkedIn, for tracking the use of embedded services. dpm.demdex.net dpm Description:Adobe Audience Manager - data management platform uses this cookie to record information around synchronisation of IDs. mt_misc lang Description:There are many different types of cookies associated with this name, and a more detailed look at how it is used on a particular website is generally recommended. However, in most cases it will likely be used to store language preferences, potentially to serve up content in the stored language. MC1 ih.adscale.de tu bcookie Description:This is a Microsoft MSN 1st party cookie for sharing the content of the website via social media. krxd.net _kuid_ Description:This cookie carries out information about how the end user uses the website and any advertising that the end user may have seen before visiting the said website.Cookie used by NetworkAd.net for purpose of targeting. dspuuid uuid2 Description:This domain is owned by AppNexus Inc. The company provides a range of online advertising technology and services. crwdcntrl.net _cc_dc Description:This domain is owned by Lotame. The main business activity is: Data Management Platform - Targeting /Advertising Lifespan:9 months c.bing.com SRM_B Description:This is a Microsoft MSN 1st party cookie that ensures the proper functioning of this website. agkn.com ab Description:This cookie is generally provided by agkn.com and is used for advertising purposes. VISITOR_INFO1_LIVE Description:This cookie is set by Youtube to keep track of user preferences for Youtube videos embedded in sites;it can also determine whether the website visitor is using the new or old version of the Youtube interface. _cc_id ads.linkedin.com _cc_cc lidc li_gc u i.liadm.com _li_ss"
        }
    ],
    "pdf_files": []
}