{
    "url": "https://www.nottingham.ac.uk/utilities/privacy/privacy-information-for-website-visitors.aspx",
    "content": [
        {
            "p": "Return to our central privacy information This privacy policy explains how we use any personal information we collect about you when you use this website. We collect information about you when you visit our website for the first time, and when you interact with our pages. We also collect information when you voluntarily complete contact forms, provide feedback and submit queries. Website usage information is collected using cookies. We use your information collected from the website to personalise your repeat visits to our website, and to help us understand what works and what doesn't on our website. We'll use information you submit through our contact forms and other ways of giving feedback to help you with your specific issues. Under the UK GDPR we must establish a legal basis for processing your personal data and let you know what this is. It is in the University's legitimate interest to process your personal data for the outline above. This processing shouldn't impact on you negatively and is necessary for our website to function correctly. We use several different third-party services to process your data, which allow us to give you the best possible experience. If we do want to collect personally identifiable information through our website, we will be up front about this. We always make clear when we collect personal information and explain what we intend to do with it. We can't take responsibility for the behaviour of sites linked to or from our website. You should consult their individual privacy policies for more information. Cookies are text files placed on your computer to collect standard internet log information and visitor behaviour information. This information is used to track visitor use of the website and to compile statistical reports on website activity. For further information visit www.aboutcookies.org or www.allaboutcookies.org. You can set your browser not to accept cookies and the above websites tell you how to remove cookies from your browser. However, in a few cases some of our website features may not function as a result. Sometimes we'll embed content in our pages that we don't control or operate. This is common for social media sites such as Facebook and Twitter. When you interact with these elements, which are always marked clearly, you've not interacted with our website but instead the service embedded, and we can't guarantee what data is collected. Our website search is powered by Google. Search queries and results are logged anonymously to help us improve our website and search functionality. No user-specific data is collected by either us or any third party. We use a third-party service, Facebook Pixel, to collect data and track conversions from Facebook ads, as well as build targeted audiences for future advertising, and possible remarketing to Facebook users who have interacted with our website as a result of an advert. We use a third-party service, Google Analytics, to collect standard internet log information and details of visitor behaviour patterns. We do this to find out things such as the number of visitors to various parts of the site. This information is only processed in a way which does not identify anyone. We do not make, and do not allow Google to make, any attempt to find out the identities of those visiting our website. We use a third-party service, Hotjar, to record some specific user behaviour. That includes mouse movement, percentage dropout, and other such pieces of information. All this data is anonymised upon collection, and only processed in a way which does not identify anyone. We do not make, and do not allow Hotjar to make, any attempt to find out the identities of those visiting our website. We contract a third party, SMRS, to run digital campaigns, and as such they need access to certain data to work out if their campaigns are running correctly. They use Google's DoubleClick to collect data that is anonymised upon collection, and only processed in a way which does not identify anyone. We do not make, and do not allow SMRS or Google to make, any attempt to find out the identities of those visiting our website. Zengenti support and host our website and content management system. We'd only ever give them personal information if it was strictly necessary to fix specific faults or errors, and we ensure no data is kept or copied. We gather very limited and anonymised behavioural data about our website users to enable us to tailor content to different audiences, through a third-party tool Populo (owned and operated by Zengenti). We will not, and cannot, use this data to identify you. Personally identifiable data that's used at a top level for the maintenance and upkeep of the website is held in your browser in the form of cookies, which you have control over. You may delete them at any time. Data collected through contact forms, feedback and queries will be held for a variable amount of time depending on exactly what it's being used for, but it'll usually be in line with our retention policy. We'll always tell you at the point when this data is going to be collected if it's not. If you have any questions about the website please contact the Web Team. We will keep this privacy notice under regular review and we will place any updates on this web page."
        }
    ],
    "pdf_files": []
}