{
    "url": "https://www.nottingham.ac.uk/utilities/accessibility/park-campus-tour-video-descriptive-transcript.aspx",
    "content": [
        {
            "p": "We fly across the lake towards the University of Nottingham’s Trent Building. Its white stonework jumps out from among lush trees and is reflected in a few scattered clouds in a blue sky. Welcome to University Park Campus. We see two students walking together along a path, one talking and gesturing with her arms, her face animated and smiling. The other laughs at what she is saying. They walk out of view, the Trent Building once more our focus. (Student 1) When I walk around campus I feel eternally grateful that I have the opportunity to study at such a high-calibre university. We cut to a mosaic – boats on the lake, ducks calling and splashing, one of the students staring out at something across the water. Then the oars of the boat dipping into the tranquil water, glistening as they cut through it and the boat moves smoothly across the surface of the lake. Now we see rolling fields, sloping down towards trees. On the grass are groups of people, clearly enjoying the sun, playing games, relaxing. (Student 2) I really liked how open the space was compared to London. For a moment we see the bright colours of the Nottingham sign on a green hill, made up of brightly coloured photographs, forming a rainbow in letters. Behind them, sustainable housing projects nestle on the hill, a permanent exhibit of the work the University is doing to help the whole world. (Student 3) The feeling of being in that history and that culture was very warm and inviting. I felt at home straight away. We see a student cycling up a path towards halls, and two other people heading towards us on the other side of the frame. Then we move inside, looking down a spiral staircase as people make their way up and down, the white marble steps and shadows cutting our view into sharp slices, contained by smooth golden rails that curve around them. We have just little glimpses of the campus. Feet ascending stairs the old marble and new trainers a sharp contrast but not a jarring one; a brick wall, heavy with age and yet cared for and grand; the brief flurry of a coat as a student hurries to a class; willow branches sighing and rippling in the wind. A student approaches a window hung with blue velvet curtains and looks out at the campus, drinking it in. Two students run towards us in slow motion, laughing as they do, the sun haloing their hair. Then another pair sit on a bedspread in a dorm room, a salt crystal lamp offering soft illumination, laptops before them, engrossed in work. In a rush we see the Trent Building swoop past, and then we are in the air, slowly gliding past the clock tower as it chimes. (Student 1) That clock tower was absolutely stunning the first time I laid eyes on it because it’s so different from how you see it in photographs. (Student 4) There’s walking paths everywhere. Then paths overhung with trees, light dappling through them, and in sudden transition we are at a tram stop, the sign proclaiming University of Nottingham somehow shockingly new compared to the history we’ve seen just before it. (Student 2) You notice how friendly people are, even if they don’t know you they say “Oh hello, good morning” and you get used to, like, adopting that subculture as well. A man cycles past and behind we see a playground and beyond it the Nottingham Lakeside Arts Centre. A tram draws in as a group of students smile and talk. A coffee shop: three friends sip their drinks, and one talks as the others nod and listen. Behind them another customer arrives at the counter, and their brown coat is somehow even more starkly contrasted against the brown brickwork than any other colour would be, the smooth fabric a sharp distinction from the warm rough wall. One of the students drinks from her mug. The sky rushes above us, and then we are in it, looking down at the Millennium Gardens which spins beneath us. The sharp geometric shapes are somehow softened yet more distinct because they are made of grass, trees and water. (Student 5) Millennium Gardens is a beautiful place and you can just hear like rabbits and wildlife in the background and people are walking across. Two figures sit under a tree, whose leaves and branches shift in the wind, whispering sounds rising from the plants around us. (Student 6) You’re surrounded by people but you feel like you’re in your own space at the same time and you just feel at peace. Students sit on the grass, making notes for a class. Others play with a giant chess set, laughing and joking as they do. We see one person’s face very close, staring off into the distance, their eyes looking at something we can’t see, but a sense of calm and satisfaction clear on their face. And then we look up, to a tree, sunlight flaring through its leaves. (Student 2) When I think of the concept of a good time I think about Mooch. It has the capacity to bring you closer to your friends and give you memories that you don’t forget. The Portland Building is before us, the sign for the Students’ Union clear in the centre. Inside, two students laugh as they hold up a giant Instagram frame, and dance with oversized glasses on. Others stand and order food and drink, ready to enjoy a meal in Mooch bar with their friends. Outside another group is spending time together, relaxing with drinks and looking at one of their phones, reminiscing about a shared experience. (Student 5) When I came to an open day I realised that these were my people. These were people I want to be around. They were academic by they were sporty. They were bubbly and having fun. Yet at the same time they were focused on their academics. And that’s what I felt at the University of Nottingham. I felt at home. The glass and steel of George Green Library suddenly appears, the sunlight creating a perfect reflection of the buildings around and the blue sky, as people make their way up the steps leading to it. Inside the library we see a large open space filled with sunlight, then draw back to see a group of students studying together, discussing something intently. In the library we see a student reading, and at the same time we see what she is reading: a well-bound treatise on the history of music, the type heavy and rich on the page. We move to the sports centre, where someone lifts weights, while a hand reaches up to grasp a hold on a climbing wall. We see students eating, drinking, sitting together, enjoying social time, and then we move to a classroom with writing covering a board, a laboratory with a set of robotic arms moving hypnotically. We descend the stairs of one building and then emerge once more into the air, Portland Building drifting away from us. A bus sweeps past on one of the campus roads, and students walk to a hall of residence. Athletes celebrate together. A student plays a clarinet surrounded by the rest of the orchestra. A sports team holds a trophy aloft, cheering. People laugh as they dance. A woman feeds one of the geese laughing as it nibbles her hand. A student drops liquid nitrogen into a beaker causing the vivid pink liquid to froth. A group of students hug, holding each other and smiling at their friendship. (Student 4) It’s got everything that I could have possibly needed. And it’s given me some of the best memories that I will cherish for the rest of my life. As if in summary of everything else, we see the whole campus from the air, laid out before us, green grass and trees, stone buildings, winding paths, the lake shining in the sun. Experience University Park Campus."
        }
    ],
    "pdf_files": []
}