{
    "url": "https://www.nottingham.ac.uk/utilities/privacy/privacy-information-for-visitors-correspondents-and-prospective-applicants.aspx",
    "content": [
        {
            "p": "Return to our central privacy information This Privacy Notice applies to visitors to the University and people with whom the University communicates who are not either staff or current students, including prospective applicants such as enquirers, prospectus requesters, and other individuals who have expressed an interest in studying at the University of Nottingham or participating in the activities of the University in another way, such as on one of our outreach programmes. It applies to adults and children who visit the campus for one-off events such as community open days, and to those who visit for longer periods, such as to attend one of our outreach programmes or use certain facilities, such as the libraries or sports facilities. It explains how we will process your personal data. We hold a range of personal data about you, some of which you provide to us directly and some of which we receive from third parties such as agents or third-party companies. Sometimes this means we may process information related to children in your care. Examples of categories of personal data which we hold: We may also collect, store and use information about your health or religion should you require us to make reasonable adjustments for you during your time on the University’s premises or to make resources accessible to you. We process data to help support your current and future relationship with the University. We only process data for specified purposes and if it is justified in accordance with data protection law. The table below lists the various purposes for which we process personal data and the corresponding justification for it. Please note that anyone using non-UoN accounts to access Microsoft 365, your email address will become visible to anyone searchng for you within Microsoft Teams. We are unable to enable access to M365 without your data becoming searchable in this way. Wifi and Bluteooth information may be used to generate anonymised space usage statistics. For non-essential library users and MS Teams users, the legal basis for this processing is Legitimate Interest. Collecting impact statements and references from correspondents, supporters and collaborators to support applications by staff or students to internal and external awards or competitions, and where such evidence and the author's details may be passed to a third party for the purposes of administrating the award or competition and which may be published. Such processing is distinct from any similar processing undertaken for the purposes of the Research Excellence Framework (REF), however, material collected for these purposes may also be used for the purposes of the REF, for which a separate processing statement appears below. Collecting impact statements and references from correspondents, supporters and collaborators to support the Research Excellence Framework process, and where such evidence and the author's details will be passed to Research England for the purposes of assessment and which will be published in an identifiable form, unless confidentiality has been requested. Information relating to vehicles and individuals for the purposes of operating the University's visitor parking scheme, including enforcement B2B contacts for the purposes of working with the University in research or career-related capacity There may be other processing in addition to the above. This is done on the basis of our policies and we'll inform you at the time when the data is obtained or as soon as possible afterwards. We process information about your health to support applicants to access our summer schools We may process information on your ethnicity and racial background We may process information on your religion Sometimes we receive your data from third parties. The following table lists what information we may receive from them. On occasion we may need to share your data with internal and external third parties. The following table lists what information we may share with whom. The University of Nottingham also works with suppliers and partners who may make use of Cloud and/or hosted technologies. We undertake data security due diligence on our partners, ensure that suitable contracts are in place and that these partners conform to appropriate accreditations. Wherever these transfers take place, the University will have an appropriate contract in place and there are strict rules regarding the confidentiality and security of your information in place to safeguard it. Except where we have a legal or contractual obligation to keep data for a certain period of time, we'll keep to the University's retention schedules. Contact information for media contacts will be kept for a period of five years after collection. If you have any questions about this policy, please contact the data protection team. We will keep this privacy notice under regular review and we will place any updates on this web page."
        }
    ],
    "pdf_files": []
}