{
    "url": "https://www.nottingham.ac.uk/utilities/accessibility/jubilee-campus-tour-video-descriptive-transcript.aspx",
    "content": [
        {
            "p": "We see Jubilee Campus from the air, the gleaming buildings each with a distinct architectural style are interspersed with grass and trees. Welcome to Jubilee Campus. (Student 1) Jubilee Campus is a community. It’s vibrant. It’s a breath of fresh air. And there’s always something going on whether you’re meeting your friends in the gym for a game of basketball, or you’re going to Starbucks to study. We move down to watch two students walking across a bridge, and then we see flowers, the sweeping metalworks of the Ingenuity Centre. In the gym a group of students bounce a basketball, one of them shoots and the ball falls neatly through the hoop and you sense the celebration of the players. Outside we see a Starbucks coffeeshop, students enjoying drinks in the sun, and then we see one working in a notebook, the writing neat and ordered. (Student 2) It’s a very modern campus but with, like, a wildlife twist to it. It kind of has like a business and entrepreneurial feel to it. We see images of a building with red cladding in rectangular patterns, and then a mosaic of architecture and student life: two students drink coffee with water running behind them; someone walks through a glass stairwell almost a whisper through the translucent material; a man drinks from a mug with a smile, engaged in a conversation; a sculpture piercing the sky, with the sun blazoned behind it. Then we see the wildlife of the campus, swift images of ducklings preening and leaves shifting in the wind. In a large atrium filled with sofas, tables and lush plants, two students work on laptops together. (Student 1) The library is probably one of the most eye-catching buildings for me. We sweep through the sky across the campus, the buildings sliding below us, and then approach the library across the water. The widening cylinder of the building spread out above the water, nestled on its own island, the sunlight laying a shimmering path to it. (Student 2) You do just feel a sense of focus, like I can really get my work done here. Inside, we see students studying at tables, walking through the shelves, looking out across the water with headphones on. They are busy, but calm, a quiet industry in their actions. (Student 1) If you go to the top of the Ingenuity Centre, there’s actually a meditation room with floor to ceiling windows where you can just see the whole of the campus and how different it is to what people would usually think of what a university looks like. The sibling of the library, the Ingenuity Centre, rears up before us now, again cresting above the water but shining metal rather than natural wood. Inside we see the meditation room with windows showing the campus laid out before us, but as we move around other parts we also see people working and studying, a contrast to the silence of above. One after another we see each of the buildings on campus, each one different and surprising. The architecture of each one is personal to it, modern and innovative, but somehow blending seamlessly with the landscape. No two are the same. (Student 2) The sustainability aspect of Jubilee is something that’s very strong, like with the grass and the plants on top of the buildings. There’s really, like, thought behind these buildings. We settle on one building, with wood cladding, grass on its roof, and then focus on a student walking towards it for a moment. In a flash we are above it, seeing how the roof blends with the grass around it on one side, and shines with a huge bank of solar panels on the other. It almost looks like a sea cliff in the sharpness of the divide. (Student 1) Especially the lake that runs through Jubilee as well. Knowing that the University was so well-kept and looked after visually, it was just like a sign that academically the University was really promising. As we move along the walkway by the lake we see the islands spread out across it, and the pillars of the buildings on the shore merge with the stone of the causeway. Two students walk towards us along it talking, one carrying a bunch of flowers. At the same time we see it from above, the landscape green and lush, with shining metal and glass punctuating it throughout. Now the students are sat at a table outside, trees and blue sky dotted with white clouds behind them. The flowers are on the table, and so is a laptop, and they’re laughing together. (Student 1) A lot of students tend to sit outside in the summer. You can hear the fountain in the background, and the geese. We move suddenly to the fountain, great arcs of water jetting into the ask, drops of water slashing down around it into the lake. At the edges of our vision are reeds and flowers, and behind it the bank of sleek modern buildings at the side of the lake. Geese call as we shift inside to a student service centre. (Student 2) There’s definitely a feeling that you’re supported and that there are people you can turn to. We see students going about their lives, someone taking a leaflet from the wall to read, another person waving to someone going past on a bicycle. We swoop through a dining hall and see students serving themselves from a cafeteria where steaming food is heaped in trays on a counter. (Student 1) There’s a lot of familiar faces and it’s just really nice to know that you’re part of the community. To work in an environment that’s so bright and colourful and, you know, really interesting. In another building, plants softening the view through the large windows, two students sit with a member of staff explaining something to them, a rainbow lanyard around their neck a shock of colour in the scene. We pan up a blocky looking black and white stairwell, seemingly unsupported in the building, like an art installation. (Student 2) You’re able to feel welcomed by the campus and know that there’s the support there. A student walks into their hall of residence, and we see inside their room where they sit at the desk studying, comforting ornaments arranged on a shelf above them. Now we see someone sat outside by the coffee shop, their laptop open, other students in the background talking. We drift through the huge atrium of a building, people eating below, then past students feeding geese. A huge sculpture rises behind some students, and then we pan out across the campus, seeing the buildings sweep past. (Student 2) You do feel like there’s an opportunity on Jubilee Campus to really be creative, or just think differently. There’s something there for everyone. Experience Jubilee Campus."
        }
    ],
    "pdf_files": []
}