{
    "url": "https://www.nottingham.ac.uk/utilities/privacy/privacy-information-for-uono-students-and-applicants.aspx",
    "content": [
        {
            "p": "Return to our central privacy information This privacy notice applies to current and former students and applicants of the University of Nottingham Online (UoNO), a subsidary of the University of Nottingham. UoNO complies with University of Nottingham policies and procedures. It explains how we'll process your personal data. This notice does not form part of any student or applicant contract. We hold a range of personal data about you, some of which you provide to us directly and some of which we receive from third parties. Here are some examples of types of personal data we hold: In addition, if you come to study with UoNO, we'll start keeping data like: We also process contact and educational details after you stop being a student with us. When you're an applicant, we process your personal data for the purposes of assessing your eligibility to be offered a place on one of our courses and for identifying any support needs you may have. If you accept a place on a course and/or register as a student at UoNO, we process your personal data for the purposes of providing our academic programmes and related services, such as welfare support. In general, this applies to personal data you provides to us to process your application and, if enrolled, to monitor academic performance. Without that information, we wouldn't be able to provide you with your chosen academic programme and related support services. We pay attention to how you interact with us and may record this information. For example, whether you open or click on our emails, your interactions with UoNO-operated social media accounts, and what you visit on our websites and use this information to personalise future interactions. We only process data for specified purposes and if it is justified in accordance with data protection law. The table below lists examples of personal data we process and the justification for it. Monitor your use of our networks to protect the security and integrity of UoN's IT network and information and electronic communications systems. There may be other processing in addition to the above, for example, when you access our website which uses cookies. This is done on the basis of our other policies, and we will inform you about such processing at the time when the data is obtained or as soon as we can afterwards. Where the basis of processing your personal data is a contractual necessity and you don't provide us with the personal data needed, UoNO may not be able to process your application or provide you with the programme for which you have applied. Sometimes we receive your data from third parties. The following table lists what information we may receive from them. Sometimes we may need to share your data. The following table gives examples of this kind of data sharing. Application details, attendance and attainment records, contact information and account credential where required for single sign-in. UoNO has the following major partners with whom it shares personal data in order to deliver its services to you: As shown in the table above, we will share your data with your placement provider, who may be outside of the UK/EU/EEA, on the grounds that such transfer is necessary for performing our contract with you. UoNO also works with suppliers and partners who may make use of cloud and/or hosted technologies based outside of the EEA. We undertake data security due diligence on our partners, ensure that suitable contracts are in place and that these partners conform to appropriate accreditations. Wherever these transfers take place, UoNO or will have an appropriate contract in place and there are strict rules regarding the confidentiality and security of your information in place to safeguard it. Usually application-related personal data will be kept for around one year. Contractual information (for example details of performance and contact details) is retained for six years after you have completed or otherwise terminated your programme. Retention periods are usually linked to legal limitation (statute of limitation) periods. The University's records retention schedule is available online. If you have any questions about this policy, please contact the data protection team. We will keep this privacy notice under regular review and we will place any updates on this web page."
        }
    ],
    "pdf_files": []
}