{
    "url": "https://www.nottingham.ac.uk/utilities/privacy/privacy-information-for-staff-and-other-working-at-the-university.aspx",
    "content": [
        {
            "p": "Return to our central privacy information This privacy notice applies to current and former employees, workers, contractors, honorary position holders, volunteers and visiting lecturers. It explains how we'll process your personal data. This notice does not form part of any contract of employment or other contract to provide services. We hold a range of personal data about you, some of which you provide to us directly and some of which we receive from third parties. Here are some examples of types of personal data we hold: We may also collect, store and use the following \"special categories\" of more sensitive personal information: We process your personal data to help us to effectively administer the employment relationship between you and the University. We only process data for specified purposes and if it is justified in accordance with data protection law. The table below lists the various reasons why we process personal data and the justification for it. Some processing of your personal data is justified on the basis of contractual necessity. In general this applies to personal data you provide to us at when you first start working for us and throughout the duration of your employment with the University. It's to manage the employment relationship and to monitor performance Without this information we wouldn't be able to employ you and follow the law, assess your application, offer you work with the University or make reasonable adjustments. Some personal data is also required to fulfil our legal obligations (for example, immigration or HMRC) Professional accreditation demonstrates the organisation's commitment to meet high professional standards Data will generally be shared in aggregated and anonymised format, but where personally identifiable data is shared (pictures/pen portraits) these will be shared with your consent. Legitimate Interests & Statutory Obligation & Contract To monitor exposure of Estates staff to vibration from University-provided mechanical equipment. For staff living in University-managed accommodation, administering matters relating to that accommodation including fees, health and safety, catering, cleaning and maintenance and disciplinary procedures. To maintain the health of our entire campus population, by monitoring staff movements around campus to enable effective Test and Trace processes during global health events. To identify those affected through Health Screening and Self Reporting. The University is under a legal obligation to ensure health and safety of employees, students and visitors and those affected by its undertaking It is in the University’s legitimate interests (ensuring wellbeing and minimising risk to the public as well as the delivery and continuance of operations) It is the public interest. Compliance with relevant national Health & Safety legislation and any national legislation bought in in the event of a Global Health Emergency. Legitimate interest in ensuring that the University is a safe and healthy environment for all students, staff and visitors. Clinical Academic staff (where jointly employed by UoN and the NHS) data relating to staff management and accountability including but not limited to strategic planning, joint appraisal and joint job planning. Call contents and voice when making calls to helpdesk facilities. Content may be recorded for training and monitoring purposes. There may be other processing in addition to the above. This is done on the basis of our policies and we'll inform you at the time when the data is obtained or as soon as possible afterwards. Where the basis of processing your personal data is contractual necessity and you don't provide us with the personal data needed, the University may not be able to fulfil its employment contract with you (such as paying you) or we may be prevented from complying with our legal obligations (such as to ensure the health and safety of our workers). Processing is necessary in order to: Sometimes we receive your data from third parties. The following table lists what information we may receive from them. Sometimes we may need to share your data, including sensitive personal data. The following table gives examples of this kind of data sharing. As shown in the table above, we will share your data outside of the EU if you are assigned to work at UNNC and or UNMC during your employment, on the grounds that such data transfer is necessary for performing our contract with you. Data Transfers to Malaysia and China campuses are subject to data sharing agreements which contain the EU Model Clauses. The University of Nottingham also works with suppliers and partners who may make use of Cloud and/or hosted technologies. We undertake data security due diligence on our partners, ensure that suitable contracts are in place and that these partners conform to appropriate accreditations. Wherever these transfers take place, the University will have an appropriate contract in place and there are strict rules regarding the confidentiality and security of your information in place to safeguard it. The University will only keep your personal data for as long as necessary to fulfil the purposes for which we collected it. Details of retention periods for different aspects of your personal information are available in our Retention Schedule. To determine the appropriate retention period for personal data, we consider the amount, nature, and sensitivity of the personal data, the potential risk of harm from unauthorised use or disclosure of your personal data, the purposes for which we process your personal data and whether we can achieve those purposes through other means, and the applicable legal requirements. Usually employment-related personal data will be kept for approximately six years after the end of your employment. This retention period is linked to contract law dispute legislation. Personal data held in connection with health and safety may be retained indefinitely in view of the lifelong potential for Personal Injury (PI) claims to be submitted against the University. If you have any questions about this policy, please contact the data protection team. We will keep this privacy notice under regular review and we will place any updates on this web page."
        }
    ],
    "pdf_files": []
}