{
    "url": "https://www.nottingham.edu.my/Utilities/DataProtection.aspx",
    "content": [
        {
            "p": "The Personal Data Protection Act, 2010 (“Act”) regulates the processing of personal data in commercial transactions. The Act requires The University of Nottingham Malaysia Campus (“the University”) to inform you about personal data that is collected from you and processed by the University. The terms “personal data”, “processing”, “commercial transactions” and “relevant person” used in this Data Protection Notice (“Notice”) shall have the meaning prescribed in the Act. For the purposes of this Notice, the expression “we” or “us” shall refer to The University of Nottingham Malaysia Campus, whilst, the expression “you” or “your” shall refer and include the student, potential student, former student, client, customers, potential customers, vendors, suppliers, service providers and/or relevant person such as parent/guardian of our student, potential student or former student, directors, employees of corporate customers, vendors, suppliers, service providers and authorized representatives receiving, obtaining services from or providing services to the University. We process your personal data including personal data of any relevant person. This Notice shall apply to the relevant person and you warrant to the University that you have the authority or have been authorized to act and give consent on behalf of the third party, to the provision of personal data of the third party to the University for the purposes and disclosure as stated in this Notice and you undertake to extend a copy of this Notice to the third party. The provision of this Notice shall be deemed as notice given to and consent obtained from the third party. The personal data voluntarily provided by you, your parents, guardians, recruitment agents, your employer, your company, your sponsor, at events organized or participated by the University and/or obtained independently by us from other lawful sources (if any such as from public depositories, trade/online directories, credit reporting agencies, public domain and other authorized third parties) in our forms, agreements, website, and/or other similar documents may include information concerning your name, address (such as correspondence and permanent address), phone numbers (such as handphone, home and office phone numbers), facsimile numbers, email address, identity card number, passport number, specimen signature, age, date of birth, gender, race, nationality, country of permanent residence, company name, occupation, salary, job position, credit card number, credit history, religious belief, medical conditions and details, criminal conviction information, sponsoring body details, referee information (such as name of referee, job position, address, contact number and email address), previous examination results, transcripts, academic qualifications, academic records, bank details (such as name of bank, bank’s address and bank account number), images (including photographs) information in audio and/or video format, closed-circuit television (“CCTV”) and security recording (collectively “Personal Data”). By voluntarily providing us your Personal Data, you are giving consent for us to collect, use and process your Personal Data. You hereby confirm that the Personal Data given by you or obtained from you, your parents, guardians, recruitment agents, your employer, your company and sponsor is sufficient, accurate, complete and not misleading and that such Personal Data is necessary for us to provide our services to you and to establish a commercial transaction. If you choose not to provide such Personal Data or if such Personal Data is insufficient, inaccurate, incomplete and/or misleading, the University may not be able to provide you with the services you require or the required level of service. We will process Personal Data in connection with any commercial transactions for any of the following purposes: In the event we refuse to adhere to your request for access and/or correction to your Personal Data we will inform you of our reason for the refusal. We will ensure your Personal Data is accurate, complete and up-to-date. Therefore, we request that if there are changes to your Personal Data you should notify us directly at the contact details set out above. We may review and update this Notice from time to time to reflect changes in the Act. The latest version of the Notice will be made available upon your request at the above address or available at www.nottingham.edu.my. By continuing receiving, obtaining services from or providing services to the University following the modifications or changes to this Notice shall signify your acceptance to such modifications or changes."
        }
    ],
    "pdf_files": []
}