{
    "url": "https://www.nottingham.ac.uk/utilities/privacy/privacy-information-for-research-participants.aspx",
    "content": [
        {
            "p": "Return to our central privacy information We collect personal data under the terms of the University’s Royal Charter in our capacity as a teaching and research body to advance education and learning. Specific purposes for data collection on this occasion are clinical or medical (which means research into treating, diagnosing or alleviating the symptoms of disease) or physiology (which means understanding how the body works, whether in a healthy state or while unwell). The legal basis for processing your personal data on this occasion under Article 6(1e) of the UK General Data Protection Regulations \"processing is necessary for the performance of a task carried out in the public interest\". Where data is not collected directly from research participants, the University may obtain data from trusted partners such as NHS Digital (who provide the University with HES/Mortality data, for example). In addition to the legal basis for processing your personal data, the University must meet a further basis when processing any special category data, including: personal data revealing racial or ethnic origin, political opinions, religious or philosophical beliefs, or trade union membership, and the processing of genetic data, biometric data for the purpose of uniquely identifying a natural person, data concerning health or data concerning a natural person’s sex life or sexual orientation. The basis for processing your sensitive personal data on this occasion is Article 9(2j) \"processing is necessary for archiving purposes in the public interest, scientific or historical research purposes or statistical purposes\". The University may store your data for up to a period of no less than 7 years after the research project finishes and is published. The researchers who gathered or processed the data may also store the data indefinitely and reuse it in future research. You will not be identifiable in data used in this way. Measures to safeguard your identity in stored data include encryption, pseudonymisation and full anonymisation, whichever is applicable to the particular research study Extracts of your data about you may be disclosed in published works that are posted online for use by the scientific community. Your data may also be stored indefinitely on external data repositories (for example, the UK Data Archive) and be further processed for archiving purposes in the public interest, or for historical, scientific or statistical purposes. It may also move with the researcher who collected your data to another institution in the future. Medical research data may be imported into a system within a controlled environment that outputs anonymous descriptions of datasets for the purposes of discoverability for potential re-use within the University. Identifable data is never viewed by any persons; anyone wishing to use such datasets must then approach the owner of the data and seek permission from them in accordance with the original study's controls on data use. If data is transferred out of the European Union we will endeavour to only transfer to countries who are on the EU list of adequate countries or to apply adequate safeguards as stated above to protect your privacy. The University of Nottingham also works with suppliers and partners who may make use of Cloud and/or hosted technologies. We undertake data security due diligence on our partners, ensure that suitable contracts are in place and that these partners conform to appropriate accreditations. Wherever these transfers take place, the University will have an appropriate contract in place and there are strict rules regarding the confidentiality and security of your information in place to safeguard it. We will keep this privacy notice under regular review and we will place any updates on this web page. Where possible, the University distributes privacy notices relating to research projects to participants at the time of joining the project in electronic form or in physical form. Many areas of the University have dedicated webspace where they can display privacy notices for specific research projects. Where this is not possible, they may be found below. Television and Academic Achievement: Evidence from the Digital Television Transition in the UK"
        }
    ],
    "pdf_files": []
}