{
    "url": "https://www.nottingham.ac.uk/vet/about-us/awards-and-achievements.aspx",
    "content": [
        {
            "p": "We have a long tradition of winning awards. From student satisfaction, to excellence in teaching and learning, and staff awards. The National Student Survey (NSS) We have ranked top of the National Student Survey (NSS) for overall student satisfaction since our first graduating cohort in 2011. Association of Veterinary Students Survey Ranked first for several topics. These included career progression preparation, extra mural studies structure and student welfare. 89% of our research is classed as ‘world-leading’ (4*) or ‘internationally excellent’ (3*) in the Research Excellence Framework (REF) 2021 rankings, which is an increase on our position from REF 2014. RCVS Impact Award Professor Sarah Freeman has won a prestigious Impact Award from the RCVS. The award recognises vet professionals who go above and beyond in the cause of animal science, health and welfare. Robert Fraser Gordon Medal Professor Paul Barrow was awarded the prestigious Robert Fraser Gordon Medal for services to poultry science at a ceremony at the World’s Poultry Science Association (WPSA) UK 2019 Spring Meeting in Edinburgh on 10 April. 2019 Staff Oscars Julia Kydd, Assistant Professor in Applied Immunology won the 'Teaching: Most Innovative' award for her hard work and constant innovation. Find out more. Rising Star Award Dr Katie Burrell is a Rising Star for her work in human behaviour change for equine health and welfare. Find out more ASPIRE Award In 2016, we were awarded an ASPIRE award. We are the only veterinary school to hold this award worldwide. The award recognises excellence in student engagement. In particular, the way we work with students, engaging them fully in the academic community, extracurricular activities and community work. Athena Swan Award In 2023, we were awarded an Athena Swan Silver Award. telephone: +44 (0)115 951 6116 fax: +44 (0)115 951 6415 email: veterinary-enquiries@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}