{
    "url": "https://www.nottingham.ac.uk/vision/vision-driving-indonesias-electric-transport-revolution",
    "content": [
        {
            "p": "Sustainable Futures Indonesia’s ambition to be southeast Asia’s electric vehicle powerhouse is a cornerstone of its net zero commitment. The University of Nottingham, a key partner in growing the country’s EV infrastructure and skills base, is helping deliver this green transport revolution. The challenge The economic development of Indonesia is an extraordinary success story. The world’s fourth-most populous country is set to become the fourth-largest economy by mid-century, driven by 50 years of sustained growth. By 2045 – marking 100 years since its declaration of independence - Indonesia aims to recognised as an advanced economy. Integral to achieving this development goal is another ambitious national target - reaching net zero emissions by 2060. Yet Indonesia is still highly dependent on fossil fuels. CO2 emissions rose to meet the expanding energy demands of its economy and by 2021 Indonesia was the world’s ninth-largest greenhouse gas emitter.* To reach its net zero and sustainable development targets, Indonesia has identified pathways to securing a skills-rich, sustainable economy, including economic diversification and building partnerships to deliver knowledge, green technologies and innovation. The National Masterplan for Industry places the electrification of transport as a top priority in achieving these ambitions. However, Indonesia recognises it must build the electric vehicle (EV) regulatory framework, R&D capacity, infrastructure and skills base essential to this transition from fossil-fueled transport. *Source: International Energy Authority Our response The University of Nottingham, a global leader in net zero propulsion research and the translation of these technologies into real-world impact, is the UK’s leading institution for knowledge exchange with Indonesia. Our expertise and unrivalled access to policymakers at the top of government in Indonesia will support the archipelago’s mission to decarbonise its economy, particularly through the electrification of transport. The Faculty of Engineering has a strong track record of working with the Indonesian Ministry of Transport and our experts have helped develop policy and plans for Electric Vehicle (EV) infrastructure development across the country. Building on this success, and working with the Governor of West Java, the University of Nottingham is planning to opening a new Net Zero Translation Centre in Bandung, the capital of West Java. Working with the university, the centre will be a training hub, equipping industry with the skills to support the transition to a net zero economy. Our impact The Net Zero Translation Centre in Bandung will focus on electrification of the transportation sector, upskilling workers to support Indonesia’s nascent EV infrastructure and training SMEs, polytechnics and high school students to adapt the country’s millions of two-wheelers into e-bikes and e-scooters. Such training will be aligned with Ministry of Transport safety criteria for electrified two wheelers, which were created with input from the University of Nottingham. Criteria for four-wheelers are in the pipeline. A bridge for UK-Indonesia collaboration The university is also a key member of the UK-Indonesia Consortium for Interdisciplinary Sciences (UKICIS), which aims to build resilience against pandemic, climate change and natural disasters. UKICIS, which brings together the universities of Nottingham, Warwick and Coventry in the UK, with Institut Teknologi Bandung, Universitas Gadjah Mada, Institut Pertanian Bogor, and Universitas Indonesia, has been recognised by the UK government as a driver for research and innovation in the country. Hartyo Harkomoyo, Director of Communications at Indonesia’s Ministry of Foreign Affairs, said: “UKICIS is a testament for Indonesia and the UK’s strong commitment in addressing global challenges through interdisciplinary research collaboration.” UKICIS is the only consortium cited in the UK-Indonesia Partnership Roadmap 2022-2024, an agreement by then UK Foreign Secretary Liz Truss and her Indonesia counterparts to explore research and innovation between the two countries, with the delivery of sustainable infrastructure projects, low-carbon industry, electric vehicles and green technology identified as key targets. As a result, UKICIS helped unlock £3m in funding to support Indonesian universities to collaborate with their UK counterparts, including £500,000 for Institut Teknologi Bandung to create a prototype electric truck in collaboration with the Power Electronics and Machines Centre (PEMC) at Nottingham. Expertise spanning every aspect of transport electrification The PEMC group is the probably the largest group of such researchers in the world, with expertise spanning every aspect of transport electrification, from electric motor drives and propulsion systems, power electronics, batteries and converters to EV charging stations. The PEMC building also offers sector-leading electric propulsion testbed facilities for industry. Sharing such expertise and taking Nottingham’s EV innovations into the workshops of SMEs and onto the streets of Indonesia is likely to have a significant impact on the country’s drive towards decarbonization. Despite the current lack of EV infrastructure and an ability to make parts for electric propulsion or batteries, Indonesia stipulates that all locally made electric vehicles must progressively increase the proportion of domestically made EV components. It was at least 40% by 2023, rising to 60% by 2029, and at least 80% by 2030. Indonesian small and medium enterprises cannot carry the burden of R&D to answer this challenge. Research and innovation activities with overseas partners, such as the University of Nottingham, offer a solution. Research taking place in Indonesia that produces components made by overseas partners meets the criteria, for example, as do components that are assembled following guidelines in international partner’s research papers. The translation centre will meanwhile allow Indonesian SMEs to carry out cost-effective research and development on EV capabilities such as torque measurement systems, and thermal management for batteries. As the centre’s facilities and skills base develops, so will its potential to develop EC component prototypes for local industry and increase the pace and scale of innovation across the sector. Becoming an EV powerhouse Indonesia’s ambition is to become an EV powerhouse. This vision is underpinned by rich resources: Indonesia boasts the world's largest nickel reserves and is a leading producer of aluminum, copper and tin, all essential for EV lithium batteries. Currently, many of these minerals are exported, chiefly to China, for manufacture and return to Indonesia as lithium batteries. Downstreaming this process, so Indonesia has the ability to produce battery cells from it own natural resources, is a national priority, and an area where Nottingham and our partners in the UKICIS consortium, such the University of Warwick, can make a significant contribution through skills transfer. The impact of such partnerships and knowledge sharing as Indonesia transitions to a circular, knowledge-based economy is likely to be enormous. The country of 279 million people is ASEAN’s largest automative market and has set targets to have 13 million electric motorbikes and 2 million electric cars on its roads by 2030. Nottingham’s expertise in heavy transport electrification, sustainable water management and mineral processing will also support Indonesia’s mining industry, key to growing EV production, become more efficient and less damaging to the environment. Our unrivalled partnerships with policymakers and industry Dr Bagus Muljadi, of the University of Nottingham’s Faculty of Engineering, is the steering committee coordinator of the UK-Indonesia Consortium for Interdisciplinary Sciences. He said: “Skills transfer is high on Indonesia’s national agenda. While overseas companies are clamouring to invest in its domestic supply chains and EV factories, Indonesia recognises that the upskilling of its people, together with a robust regulatory framework, is essential to the delivery of an advanced and resilient economy. “The University of Nottingham’s unrivalled partnerships with policymakers and industry in Indonesia allows up to make a significant contribution at the highest strategic level, while the planned investment by West Java in the Net Zero Translation Centre, to train Indonesia’s engineers and innovators of tomorrow, is a tangible example of our partnership’s impact.” Dr Bagus Muljadi is an Assistant Professor of Chemical and Environmental Engineering Email: Bagus.Muljadi@nottingham.ac.uk Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}