{
    "url": "https://www.nottingham.ac.uk/vision/vision-sowing-hope-our-mission-to-end-hidden-hunger",
    "content": [
        {
            "p": "Sustainable Futures In sub-Saharan Africa and South Asia, millions suffer from hidden hunger. This is caused by micronutrient deficiencies due to over-farmed, depleted soils and restricted diets. The University of Nottingham is part of an international partnership, funded by the Bill and Melinda Gates Foundation, tackling this global challenge. We collected crop and soil samples from 2,000 farms in Malawi as part of the Gates-funded GeoNutrition project, to assess the potential effectiveness of biofortification, improving the micronutrient content of crops through conventional breeding and the adding of micronutrients to fertilisers. Our mission to end hidden hunger expanded with MAPS, which extends our international reach in addressing a critical issue that affects two billion worldwide by making freely available micronutrient modelling tools to help users in sub-Saharan Africa. In Malawi alone, more than a third of children are stunted, partly due to hidden hunger - deficiencies of zinc and other mineral nutrients in their diet. LUANAR’s Dr Max Lowole said: “We’ve long been aware of the connection between soil, crops and human health,” Dr Lowole said, “but this project is collecting data that will take the application of this knowledge to a new dimension. What we’re doing here in Malawi with our partners is exciting.” Dr Lowole and 30 scientists and technicians travelled in teams across the country to take crop and soil samples from almost 2,000 farms and small holdings. This mapping will equip policy makers in Malawi’s health and agriculture ministries with unrivalled data to inform responses to hidden hunger. Among those welcomed to Chitedze by the Government was Dr Allan Chilimba, a long-time collaborator with the University and a Nottingham alumnus, who singled out selenium deficiency in Malawi’s soil as a research target. Dr Wilkson Makumba, Director of DARS, within the Ministry of Agriculture, Irrigation, and Water Development, told the GeoNutrition team: “In Malawi, we are fighting for our food security. We are also fighting to improve the health of our nation. Your colleague and our brother Dr Allan Chilimba’s pioneering research at LUANAR and with the University of Nottingham helped to first identify the challenge of micronutrient deficiencies in Malawi and your work will help identify a solution.” For Martin Broadley, Professor of Plant Nutrition, support from the Malawi Government and funding from the Bill & Melinda Gates Foundation was testament to the diversity of GeoNutrition’s international network, and its commitment to strengthening capacity for world-class research within its partner countries. “We’re in this for the long haul,” said Professor Broadley.“ At Nottingham, we have globally recognised strengths across the agri-food-nutrition sphere but what makes this project special, and attractive to international donors like Gates, is the emphasis on sustainable external collaborations and a commitment to strengthening capacity with our partners.” He explained that the Malawi mapping was the first phase of an ambitious vision. As well as the University of Nottingham and LUANAR, GeoNutrition is working with Ethiopia’s Addis Ababa University and Government, the International Maize and Wheat Improvement Centre, the International Crops Research Institute for the Semi-Arid Tropics, the World Agroforestry Centre, and the UK’s London School of Hygiene and Tropical Medicine (LSHTM), Rothamsted Research and the British Geological Survey (BGS). Researchers from LSHTM, together with colleagues from the University and institutions in Malawi and Ethiopia, will move on to a study of human nutrition, exploring how different flours used by households affect biomarkers of health status. Another strand is looking at optimising fertiliser use in Ethiopia, whereas Nottingham’s Director of the Centre for Applied Bioethics, Dr Kate Millar, and her University of Malawi colleague, Professor Joseph Mfutso-Bengo, will study the ethical and socio-economic issues surrounding adding minerals to the food chain via fertilisers or enriched food. Particularly significant for capacity building is the sponsorship of PhDs in partner countries, including Gates Foundation’s investment in PhD studentships at Addis Ababa University in Ethiopia, LUANAR and the University of Malawi. Nottingham’s Future Food Beacon of Excellence is supporting further studentships in Malawi and Ethiopia, along with Rothamsted Research and other donors, including the Royal Society and the UK’s Department for International Development. Dr Patson Nalivata, Head of Crop and Soil Science at LUANAR, is leading the Malawi arm of the GeoNutrition project. He said: “This is exciting science and a noble activity. As part of the project we will create an additional four PhDs in Malawi and four in Ethiopia, which will strengthen our ties with Nottingham and secure ongoing international partnerships.” A flag-bearer for investment in Malawi’s research talent is Ivy Ligowe, the first PhD student registered in the Faculty of Agriculture at Lilongwe for over 20 years, and one of the experts who led the field sampling training at Chitedze. Ivy, a research scientist with 15 years’ experience at DARS, said of the training cohort: “They’re enthusiastic! There is a lot involved, many logistics, and travelling to isolated rural areas can be a challenge, while it’s also important that we are consistent with how we collect and handle the samples. But this is a good team, who recognise the value of their work.” Martin Broadley is impressed. “When I saw a map of Malawi entirely covered in dots representing the hundreds of sample sites, I thought ‘wow!’. “Our relationship with researchers in Malawi started with Allan Chilimba’s soil science research and his PhD studying selenium at Nottingham. “Years later, this national sampling project is being managed by Dr Nalivata and our colleagues at LUANAR, with some of the analysis of samples also taking place here in Malawi. It’s also exciting and gratifying that a new wave of talented doctoral students will be further increasing research capacity in Ethiopia and Malawi, and strengthening Nottingham’s partnerships in the region.” The GeoNutrition team went on to analyse the grain of more than 3000 cereal crop samples from farmers’ fields in Ethiopia and Malawi. The study, published in Nature, found that nutrient intake from crops is a form of ‘postcode lottery’, particularly affecting rural households who consume locally sourced food, including many smallholder farming communities where location may even be the largest influencing factor in determining the dietary intake of micronutrients. The co-lead authors of the paper are Dr Dawd Gashu, working in the Centre for Food Science and Nutrition at Addis Ababa University, and Dr Patson Nalivata, in the Department of Crop and Soil Science at Lilongwe University of Agriculture and Natural Resources (LUANAR) in Malawi. Dr Gashu said: “Nutritional surveillance work on the quality of staple cereals is an important part of wider public health policies to address micronutrient deficiencies and we hope that this type of work is now adopted in more countries”. Dr Nalivata added: “By learning more about how the nutritional quality of cereal grains is linked to soil types and landscapes, as we have in this study, we are now better able to advise farmers how to choose and cultivate more nutritious crops”. Micronutrients including vitamins and minerals are essential to health and their absence in diets leads to hidden hunger. The University’s Future Food Beacon of Excellence brings together cross-disciplinary expertise in agriculture, nutrition, socio-economics, geography, and ethics to inform approaches to this global challenge, which affects two billion people. In sub-Saharan Africa, micronutrient deficiencies are common in poor and rural areas, due to over-farmed, depleted soils and restricted diets. Zinc deficiency, which is present in more than half of the population, puts children at risk from infection and developmental problems. In Malawi, three-quarters of the population are selenium-deficient, which can lead to weakened immune systems and thyroid problems. The GeoNutrition project will deliver an unprecedented picture of the prevalence of nutrient-poor soils and crops in Malawi, where the staple maize is grown intensively on small-holdings. The rural communities most at risk from hidden hunger are hard to reach with supplementation and food fortification programmes. The Malawi Government and the GeoNutrition team are studying the potential effectiveness of biofortification, improving the micronutrient content of crops through conventional breeding and the adding of micronutrients to fertilisers. The knowledge gained in Malawi will inform geospatial mapping in Ethiopia and potential public health interventions across the region. Dr Diriba Kumssa led the training of the GeoNutrition sampling teams. Almost 2,000 preselected sampling sites covering the whole of Malawi’s croplands were split among eight teams of three researchers. Each team paired cereal crop and soil samples from farmers’ fields, covering around six sites a day over harvest time, which ended in early June 2018. Dr Kumssa (pictured at Chitedze Agricultural Research Station) covered sampling protocols, and how to record the sample metadata using Android-powered tablet devices via the KoboCollect app. The teams had to navigate Malawi’s challenging roads, some made virtually impassable through erosion and flooding, followed by on-site negotiations with landowners for permission to sample. Vehicle breakdowns, inaccessible sites and, worryingly, bouts of malaria were all challenges. All the malaria victims are recovering. A lively WhatsApp group has provided a forum for shared successes and lessons learned. Other obstacles included patchy access to WiFi networks for data recording and transmission, lengthy drives, rickety bridges… and a huge snake blocking one road (it was ‘longer than the road width’!). Dr Kumssa, a Research Fellow with the School of Biosciences, is studying the link between soil and plants with mineral nutrition in humans and livestock. His expertise in geographic information science and database management has informed approaches to the ambitious scope of the Malawi survey. He said: “I was delighted to be involved in the project and design of the training in collaboration with our partners. Our teams in Malawi are collecting unparalleled data that has the potential to significantly influence health and agriculture policy. This survey will also help to model approaches for mapping areas across the region most at risk from mineral micronutrient deficiencies.” Pioneering PhD student hoping to shape Malawi’s agriculture policy. Ivy Ligowe was the first person in more than 20 years to embark on a PhD in the Faculty of Agriculture at Lilongwe University of Agriculture and Natural Resources (LUANAR). She is studying conservation agriculture, looking at soil management and farming practices in Malawi, and she is also supporting the GeoNutrition field teams. The bioavailability of selenium in Malawi’s soils is a key component of her research. “When I started my PhD, I was aware that Allan Chilimba’s research had found that most Malawians are likely to have a poor intake of selenium in their diets,” said Ivy. “So, as part of my PhD, I’m looking at how soil types and farming practices influence the uptake of selenium by crops.” At Chitedze Agricultural Research Station – where Ivy is pictured flying a drone collecting crop data – she planted varieties of vegetables in different soil types, adding selenium as a liquid fertiliser. “I’m trying to see if biofortification will increase the uptake of selenium into the edible parts of crops. These results may influence government policy. If selenium can be added to fertiliser, there is no cost to the farmer, and it will improve nutrition.” As for the majority of people in Malawi, agriculture is the backdrop to Ivy’s life. Her father was a farmer and brother, Nickson, became a Senior Agricultural Officer. “My village is in north Malawi, Chitipa District. My family grew maize as our staple food, and what we could grow as an excess paid for our school fees. For those days, my father was a well-to-do farmer and had oxen-driven ploughs, but we all helped with the harvest, planting crops and applying fertiliser. Sometimes my parents would wake me at four in the morning. We’d go to the field, help with the work and at six get ready for school. “Even now, if I’m looking at soil types, I’ll look back to my earliest days on my family’s farm and understand the soil science behind the yields much better, and relate the constraints we faced to the soil chemistry of our fields.” Ivy Ligowe’s PhD is funded through the Royal Society-Department for International Development (DFID) Africa Capacity Building Initiative, in a consortium led in the UK by the University of Nottingham and the British Geological Survey, based in nearby Keyworth. Ivy is sponsored alongside fellow PhD students Grace Manzeke, registered at the University of Zimbabwe and Belinda Kaninga, registered at the University of Zambia. All of their home institutions now share strong links with the University of Nottingham, including professional support networks for technical and administrative staff, access to academic mentoring and access to world-class specialist analytical techniques that are not yet available in their home institutions. Professor Martin Broadley said the £1.2m investment, which included training for technical specialists and equipment, has strengthened research capacity at universities and research institutions in sub-Saharan Africa, where the global challenge of access to nutritious food for growing populations is acute. The Royal Society-DFID activities are also supporting other PhD studentships working in Malawi, with links to Nottingham. Felix Phiri, a human nutritionist working in collaboration with the Ministery of Health and the National Statistics Office to study selenium biomarkers in the country’s population. Elisa Mazuma is working with DARS on soil fertility and crop disease resistance. For Emmanuel Mbewe, the Chief Technician with the Soil Sciences Department at Lilongwe University of Agriculture and Natural Resources (LUANAR) the PhD network offers wider opportunities for sharing of expertise, professional networking, and building capacity. Emmanuel, a member of a GeoNutrition field team, will be analysing samples using a new instrument, funded by the Royal Society-DFID project, which offers LUANAR hugely increased abilities for measuring soil and plant mineral composition for the benefit of the agriculture and public health sectors. “Previously, soil scientists here at LUANAR and our partners might go to Chitedze or to the UK for wider spectrum analysis,” said Emmanuel. “Now they can come to us.” Emmanuel also joins network events that draw together the PhD cohort from Malawi, Zimbabwe and Zambia, and works closely with Ivy Ligowe on her study of Conservation Agriculture practices. He’s also spent time at BGS through a Commonwealth Professional Scholarship, learning world-class analysis and data management techniques. “It’s exciting to be involved in GeoNutrition and apply shared expertise here in Malawi,” he said. Professor Broadley added: “What’s really significant is the structure and network that is being created and its potential for legacy. These are all talented people and it will be fascinating to see how their work and networks develop over the coming years.” Dr Louise Ander, of the School of Biosciences, leads the MAPS project. Email: Louise.Ander1@nottingham.ac.uk Gashu D et al., 2021. The nutritional quality of cereals varies geospatially in Ethiopia and Malawi. Nature. Subscribe to receive updates about the unstoppable research happening at the University of Nottingham > Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}