{
    "url": "https://www.nottingham.ac.uk/vision/how-community-pharmacists-protecting-millions-across-globe",
    "content": [
        {
            "p": "Healthy Lives Each year more than three million people across the world will catch the flu. For most it is not a serious illness and they will make a full recovery, but for those who are already vulnerable or have underlying health conditions it can prove fatal. World Health Organisation (WHO) statistics show that, depending on how virulent the strain is, between 290,000 and 650,000 people die from it each year. Vaccination is the most effective form of defence against the disease, but the WHO target of 75% of over 65s receiving the jab is repeatedly missed, despite publicly-funded campaigns which ensure those in that age group, and others deemed vulnerable, can receive it free-of-charge. Professor Claire Anderson, professor of Social Pharmacy in the University of Nottingham’s School of Pharmacy, has been looking at the role community pharmacists can play in improving this picture. Her research has helped to make the vaccination more easily accessible for millions of people across not only the UK, but France and Australia too. She said: “Community pharmacies work at the frontline of healthcare in cities, towns and villages. They play an increasing role in improving public health and wellbeing, and vaccination is just one area where they can make a real difference. Our research has shown that taking vaccination services out into the community and away from a more traditional, medicalised environment, can have a huge impact on uptake.” In 2013, Professor Anderson worked with Boots UK Ltd to evaluate their private flu vaccination service and found that, despite being eligible for a free NHS vaccination, many patients were still opting to pay to have theirs at Boots, due to the convenience and their preference for having the jab in that environment as opposed to a GP's surgery. Further research with Boots’ customers in 2014/15 found that their vaccination services were regularly accessed by at-risk patients, and were particularly attractive to carers, frontline healthcare workers, and those of working age, who stated that it was easier for them to go to a pharmacy for vaccination. The findings of this research fed into the national commissioning of NHS flu vaccination delivery in community pharmacies in England, enabling the specific targeting of at-risk patients who may be unlikely to access the service at GPs surgeries, as well as those with long-term conditions who would frequently visit pharmacies to pick up their prescriptions anyway. So far in England over 8.3 million eligible patients have chosen to be vaccinated in a pharmacy, with the figure rising from 595,467 in 2015/16 to 1,721,705 in 2019/20. Over 79% of pharmacies now offer the service and, with the costs of delivering a vaccine in a pharmacy believed to be around £2 cheaper than through a GP, the scheme is estimated to have saved the NHS millions of pounds (around £3m in 2017/18 alone). Globally, Professor Anderson’s research has also been used to inform the delivery of similar community pharmacy vaccination programmes in Australia and France. In France the research fed into the development of national pharmacy influenza vaccination services, with almost 2 million patients vaccinated in pharmacies by the end of the second year of the programme alone. In Australia it informed a pilot project in Queensland in 2014 which allowed community pharmacists to vaccinate for the first time. This led to seven out of eight states offering the flu vaccine at pharmacies by 2019. Over 2 million people received a flu vaccine at a pharmacy in that year and the programme has now been extended to include MMR, diphtheria, whooping cough and tetanus. Professor Anderson’s work has been recognised on a global scale by the International Pharmaceutical Federation (FIP) - the global federation of more than 150 national associations representing over 4 million pharmacists and pharmaceutical scientists - whose Chief Executive Officer confirmed that it had contributed significantly to the publication of its Transforming Vaccination Globally report and set of global commitments and regional action plans. In 2020, the critical importance of community pharmacists in vaccination programmes was demonstrated like never before when the Covid-19 pandemic struck, with the work of Professor Anderson and colleagues having paved the way for the rapid vaccine roll-outs that ensued. Community pharmacists went on to play a leading role in delivering the Covid-19 vaccination, as well an increased flu vaccination programme, in a bid to prevent the NHS becoming overwhelmed during the winter. By January 2022 more than 22 million jabs and booster jabs had been delivered by community pharmacy-led Covid vaccination sites in England, while over 950,000 patients received the flu jab at a community pharmacy in September 2020, 2.5 times as many as the same period the previous year. In Australia, flu vaccination uptake increased by 5 million in 2020 compared to 2019, and France ordered 30% more flu vaccines in 2020 than the previous year. All three countries went on to deliver record numbers of flu vaccinations in 2020-21 and 2021-22, thanks partly to the research by Professor Anderson and her colleagues. Professor Anderson, who is president of the Royal Pharmaceutical Society, believes her long-term partnership with Boots has been crucial to the widespread dissemination of her research. She said: “My work with Tracey Thornley (Honorary Professor, School of Pharmacy) at Boots has been invaluable. We have worked on several important projects together. Working with a large international organisation like Boots who have influence on policy making and NHS contracting has enabled our research to be amplified.” Claire Anderson is professor of Social Pharmacy, Division of Pharmacy Policy and Practice, School of Pharmacy. BMC Health Services Research, Anderson C., Thornley T. “It's easier in pharmacy”: why some patients prefer to pay for flu jabs rather than use the National Health Service. International Journal of Clinical Pharmacy, Anderson C., Thornley T. Who uses pharmacy for flu vaccinations? Population profiling through a UK pharmacy chain Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}