{
    "url": "https://www.nottingham.ac.uk/vision/universitys-largest-ever-funding-award-for-uks-most-powerful-mri-scanner-1",
    "content": [
        {
            "p": "Healthy Lives The University of Nottingham has been awarded £29.1 million to establish the UK’s most powerful Magnetic Resonance Imaging (MRI) scanner as a national facility, subject to business case approval. This scanner will give researchers and doctors unprecedented insights into brain function and the mechanisms of human disease. The funding award, from UK Research and Innovation, is thought to be the largest ever single award received by the University. It is part of a 3-year £481 million injection of funding into the UK’s research and innovation infrastructure, to support ground-breaking research to address global challenges. The University of Nottingham will work with teams across the UK to establish the 11.7T Tesla MRI scanner as a national facility that will underpin the UK’s goal of retaining its position as a world leader in ultra-high field for brain imaging and spectroscopy. The new ultra-high field scanner will be sited in the Sir Peter Mansfield Imaging Centre at the University of Nottingham. Nobel Prize winner Sir Peter Mansfield developed MRI in Nottingham in the early 1970s, revolutionising healthcare across the world. The capabilities of this new scanner will underpin a broad range of clinical and neuroscience-focused research programmes in the UK. It will be more than 1000 times more powerful than the first scanners developed by the late Sir Peter and will help transform understanding of neurodegenerative diseases such as Alzheimer’s, Parkinson’s and Huntington’s and neurodevelopmental disorders including autism and schizophrenia. Ultra-high field (11.7T) MRI offers huge benefits in terms of improved sensitivity which will enable higher spatial resolution imaging, faster imaging, and greater sensitivity to physiological changes. The scanner will also provide a step change in the capabilities of magnetic resonance spectroscopy (MRS) to provide information about the biochemistry of the human body. The new insights into brain structure and function provided by the facility will be of immediate benefit to researchers in basic and clinical neuroscience. Previously inaccessible measures of metabolism and organ function in health and disease will be of value across the biomedical community, including the life science and healthcare industries and the NHS. Engineers, physicists and computer scientists will be engaged in the development of new ultra-high field technology. This bid to establish an ultra-high field scanning facility for the UK was spearheaded by researchers at the University of Nottingham but involved more than 90 researchers from 20 different organisations across the UK whose expertise spans multiple disciplines, and who will help to develop and exploit the new facility. The new 11.7T scanner will operate in an extension to the Sir Peter Mansfield Imaging Centre on University Park Campus, providing space for visiting researchers, as well as facilities for patients and participants in research studies. The 117T MRI scanner is expected to come into service in 2025 It will: UKRI’s Infrastructure Fund portfolio funding will power ground-breaking research across a spectrum of disciplines that will help to tackle a range of societal issues, from the impacts of climate change to adolescent mental health. The projects, located across the UK, will strengthen international capability, and transform expertise across the arts, physics, life and environmental science, social science, medicine and many more research areas. The University has also benefitted from £3.8m in funding from the UKRI’s Impact Acceleration Account (IAA), which supports critical early-stage translation of UK research to real impacts, transforming public services, creating new jobs, attracting private investment and forging new partnerships with business and charities. Funding will allow research teams at Nottingham to unlock the value of their work, including early-stage commercialisation of new technologies and advancing changes to public policy and services such as NHS clinical practice. UKRI Chief Executive Professor Dame Ottoline Leyser said: \"The UK is home to world-renowned facilities in a wide range of fields, which act as global hubs for research and innovation. We must ensure that we renew and upgrade that capability to keep pace with technological advances, empowering our researchers and innovators to go further faster. \"Today, we are investing £481 million across the UK that will ensure our talented people, teams and innovative businesses have access to the world-class infrastructure they need to unlock their full potential.\" Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}