{
    "url": "https://www.nottingham.ac.uk/vision/vision-food-engineers",
    "content": [
        {
            "p": "Sustainable Futures The University of Nottingham's impact on sustainable food engineering The University of Nottingham is at the forefront of food process engineering, playing a pivotal role in advancing the field both within the UK and internationally. As the only UK university offering an MSc accredited degree in Food Process Engineering, we are uniquely positioned to influence global food systems through innovative research and education. Our work focuses on addressing contemporary challenges in food production, sustainability and nutrition, making significant strides in shaping the future of the food industry. Pioneering research One of Nottingham’s standout contributions to food engineering is our innovative approach to sustainability in food production. One such initiative involves the recycling of potato skins to create prebiotics, as highlighted in a recent article on The Conversation. This research is not only reducing food waste but also contributing to gut health and environmental sustainability. The project, spearheaded by Associate Professor Eleanor Binner, is an excellent example of how Nottingham is pushing the boundaries of food process engineering. By converting what would typically be discarded as waste into a functional food ingredient, we’re demonstrating the potential of circular economy principles in the food industry. This work aligns with the broader goals of reducing the Agri-Food sector's carbon footprint and tackling the issue of food waste, which is crucial given that one-third of all edible food produced globally is wasted. Impact on industry and education Our Food Process Engineering MSc programme is designed to equip students with the skills and knowledge required to address these complex challenges. The course is not only the first accredited degree of its kind in the UK but is also globally recognised for its emphasis on both theoretical and practical aspects of food engineering. Students in the programme have the unique opportunity to work on real-world problems, collaborating with industry leaders to develop innovative solutions. For instance, the programme has established partnerships with major food companies like Nestlé, which recently made headlines for its transition to recyclable paper packaging for Quality Street products – a project one of our graduates worked on. This shift towards more sustainable packaging solutions is a direct result of the type of forward-thinking research and development that Nottingham fosters. By integrating such industry collaborations into our curriculum, we’re ensuring that our graduates are well-prepared to lead in the evolving landscape of food engineering. Addressing global challenges Along with over 50 food professional colleagues as part of the Nottingham Food System Institite, we are deeply engaged in addressing some of the most critical global challenges within the Agri-Food sector. With the sector being the second-largest emitter of greenhouse gases worldwide, responsible for nearly one third of all human-caused emissions, there is an urgent need for sustainable innovations in food production. Associate Professor Seamus Higgins, a prominent researcher at Nottingham, is at the forefront of tackling these issues. His work focuses on the complex relationship between modern food production, human health, and sustainability. Higgins is particularly interested in how contemporary food systems, shaped by industrialisation and globalisation, often clash with human biology, leading to significant public health concerns such as obesity and malnutrition. One of Higgins' key research areas involves examining the evolution of our food systems and how they have diverged from the nutritional needs of humans. As global eating habits have shifted towards processed and convenience foods, there has been a rise in health issues that challenge our traditional understanding of diet and wellness. Associate Professor Higgins’ work aims to bridge this gap by developing new approaches to food production that are more in harmony with human health and environmental sustainability. Through his research, Seamus Higgins is redefining the future of food engineering by developing sustainable food systems that align with human health needs. His work is part of a broader movement to transform food production and consumption, addressing both environmental and public health challenges. In his forthcoming book, Food & Us, published by the Royal Society of Chemistry, Higgins explores the profound impact of food on human history. His efforts underscore our commitment to leading the way in creating solutions for the critical issues of our time. The University of Nottingham is a leader in food process engineering, driving innovation that has a global impact. Through its pioneering research, industry partnerships, and world-class educational programs, we are shaping the future of food production. As the only institution in the UK offering an MSc accredited in Food Process Engineering, Nottingham is uniquely positioned to continue leading the charge towards a more sustainable and health-conscious food industry. Associate Professor Seamus Higginsworks leads the development and marketing of a new MSc programme in Food Process Engineering with expertise in the environmental impact of current food production, food waste and sustainability, innovation in the food manufacturing industry, and more. Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}