{
    "url": "https://www.nottingham.ac.uk/vision/healthy-lives/healthy-lives.aspx",
    "content": [
        {
            "p": "We’ve saved the NHS £2bn in recent years. At the birthplace of MRI, we are delivering new revolutions in healthcare, from better monitoring of unborn babies and easing the suffering of young burns victims, to advancing breakthrough drugs and unlocking the secrets of the brain. £29 million national scanning facility will help the UK lead the world in ultra-high field imaging to transform understanding of the brain and treatment of disease Researchers at the University of Nottingham have transformed awareness of childhood brain tumours A world-leading breakthrough in wireless foetal heart-monitoring will help save lives in delivery suites across the globe Meet Steve Morgan the driven innovator using technology to assess injuries in seconds Professor Wei Shen Lim’s contribution to studies on pneumonia vaccination and treatment for Covid-19 have a profound influence Meet Matt Brookes the driven innovator behind the world’s first “wearable” scanner Research carried out at the University of Nottingham has played a key role in the decision to give vaccines in community pharmacies, helping people across the world access vaccinations more easily and saving thousands of lives. A research project tracking hospital doctors at work is helping to improve patient care Meet Gary Mirams the analytical thinker transforming global drug-testing A new way to treat one of the world’s most common bacterial infections without the use of antibiotics. Professor Carol Coupland is developing risk prediction algorithms to help identify individuals at high risk from heart disease, diabetes and other diseases An online tool is helping GPs and pharmacists reduce the risk of prescription errors for millions of patients By impregnating devices used in brain operations and procedures with antibiotics, Roger Bayston has helped save lives and improve outcomes for countless patients Clinical trials led by University of Nottingham researchers have transformed treatment and care of patients, says Professor Kim Thomas Clinical trials are now testing a breakthrough: catheters with a ‘non-stick’ coating that prevents bacteria forming infectious, and even lethal, biofilm Prevention is better than cure. How an innovative new pathway is transforming lives The birthplace of magnetic resonance imaging is transforming healthcare through innovative studies of disease processes and responses to therapies. Professor Pip Logan’s research is helping care homes significantly reduce the number of times residents fall Professor John Robertson’s work on an early blood test for lung cancer and new drugs for breast cancer is impacting patients across the world. Dr Matt Loose is delivering world-leading insights into DNA using a palm-held sequencer with a power that belies its size. Luckily for evolutionary geneticist Dr Angus Davison, some of the snails he studies are only found in the remote mountains of a Pacific paradise... Dr Dante Kalise talks about how supercomputers are transforming the ability of policy-makers to predict complex challenges and make agile responses By sending tiny electric pulses to the wrist, a watch-like device is giving new hope to children and people around the world who live with the agony of unwanted and uncontrollable tics Genetic scientists play a vital role in tracking new virus variants such as Omicron. Professor Matt Loose explains The challenge clinging to every aspect of our lives How hydrogen sulfide plays a key role in protecting blood vessel function The ability to attach electron-dense labels such as gold to antibodies is opening new vistas in scientific research. Child and adolescent mental health in a post-lockdown world: a ticking time bomb? Can sharing personal accounts of recovery from mental health problems help others? Casting new light on Florence Nightingale’s life in the Midlands, Paul Crawford explores her pioneering approaches to wellbeing Health workers and their families have given researchers invaluable insights into protecting against the spread of the virus, says Professor Ana M Valdes We can be a competitive bunch, but as rapid advances against #Covid19 show, scientists are pulling together - and using Twitter to share the results Periodic table with a difference: marking 150 years and the only living person with an element named after him How 15 University of Nottingham research paper authors came together to deliver an interdisciplinary study of biomaterials Dengue fever is a leading cause of serious illness and death among children in some Asian and Latin American countries Microbiologist Dr David Turner began the year treating Covid-19 patients before playing a key role in the delivery of the Oxford AstraZeneca vaccine ‘Sodium MRI sensing’ is an advanced scanning technology with the potential to greatly improve diagnosis. Meet Ru Jia the analytical thinker who helped reveal the physical impact of stress during the pandemic New ways to tackle anaemia in bowel cancer sufferers. Senior technician Denise McLean finds time to inspire young people, raise the profile of women in science and celebrate the Caribbean community. Ground-breaking research to ensure drugs reach the sites of disease in the right dose at the right time At the George Green Institute for Electromagnetics Research spectroscopy is being used to find new ways of detecting illness at an early stage Envisioning a future where bulky pacemakers could be replaced with LED technology. Dr Aislinn Bergin and Dr Joanna Lockwood talk about how the University of Nottingham are working with partners to create spaces for children and young people's voices in mental health research How the SmartSalt project seeks to reduce salt levels in food 7.5 million UK employees have been furloughed, raising important questions about the impact on workers and their relationships with work Every year in the UK 200,000 people receive a diagnosis of dementia. Professor Justine Schneider is finding new ways to help them live well – through the arts. New research suggests medieval medicine may have been more effective than previously thought – and could even help save lives today Weang Kee Ho has no white coat and doesn’t own a stethoscope. But she does hold a doctorate in statistics and a passionate desire to fight breast cancer Cell Culture Technician Kerry Setchfield on using iron oxide magnetic nanoparticles to transport drugs to individual stem cells with pinpoint accuracy Geneticist Dr Sara Goodacre explains why the residents of the University of Nottingham’s SpiderLab are so intriguing An international history of Boots the Chemists promises to shed new light on a Nottingham company that has grown to be a global player"
        }
    ],
    "pdf_files": []
}