{
    "url": "https://www.nottingham.ac.uk/vision/vision-long-live-tomato",
    "content": [
        {
            "p": "Sustainable Futures In the battle for sustainable, healthy food to feed a hungry planet, the cultivated tomato – Solanum lycopersicum – has a vital role. A source of vitamins, minerals and health-promoting phytochemicals in our diet, it is found in a multitude of fresh and processed products, from salads to sandwiches, pizzas, soups, diced, tinned and used in many other ways.In the UK alone, the retail market value is around £740m. But some of the best-tasting varieties soften rapidly and can have a short shelf life. Breeders are working constantly to supply high-yielding, better-tasting, more nutritious and longer-lasting tomato varieties. And now, thanks to an international team of scientists including researchers at the University of Nottingham, they have a huge advantage. The team made history in 2012 when they sequenced the tomato genome. This discovery helps breeders to identify important tomato genes, including those controlling aspects of ripening such as fruit softening, and allows them to deliver new varieties. Professor Graham Seymour, from the School of Biosciences, spearheaded the UK contribution to the International Tomato Genome Sequencing Project with colleagues from Imperial College London and the James Hutton Institute. Modern varieties of tomato are often optimised for yield, a long post-harvest life and the robustness required to survive supply chains. But they may not taste as good. Professor Seymour’s lab used the genome sequence to discover the gene that controls much of tomato fruit softening. Now natural variation can be better explored to breed tomatoes that stay fresher for longer, while tasting as good. This is an important breakthrough. It’s the first time specific control over tomato softening has been achieved without unfavourable effects on ripening, and the benefits will span the fresh tomato supply chain, from tomatoes left on the vine for longer and harvest scheduling to longer post-harvest life, storage and transportation. For Professor Seymour, discovering the gene controlling fruit softening in tomatoes has been one of the highlights of a distinguished career. He said: “I started working in this area as a post-doc in the 1980s, when there were lots of other people in the world also interested in tomato shelf life. Groundbreaking work was being undertaken on tomato ripening by Professor Don Grierson and Dr Greg Tucker at Nottingham – but no one could solve the softening problem. People then lost some interest in this scientific question, it became ‘unfashionable’ I suppose. “But once I get started on something I find it difficult to walk away until I have the solution.” A long partnership with biotechnology company Syngenta has been a key part of his research, and in ensuring that it has lasting impact on a global scale. “It’s tremendously important to have that partnership and collaboration,” he said. “That has made the difference over the long term. Without Syngenta’s partnership, alongside Biotechnology and Biological Sciences Research Council (BBSRC) funding, our work would not have happened. They supported the international tomato genome initiative and my involvement in the fruit-softening projects. They helped in all sorts of ways.” Dr Charles Baxter of Syngenta said: \"Professor Seymour's discovery will provide new opportunities to enhance tomato shelf life while maintaining excellent flavour. This work is a direct result of our long-standing and fruitful partnership with the University of Nottingham, which has been sustained by Professor Seymour’s collaborative approach.” Graham Seymour is a Professor of Plant Biotechnology in the School of Biosciences. Graham studies the genetic traits of tomatoes as a model of fruit ripening. As a member of Future Food, one of the University's transdisciplinary Beacons of Excellence, Professor Seymour is helping to address the challenge of feeding a growing population in a changing world. Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}