{
    "url": "https://www.nottingham.ac.uk/vision/sustainable-futures/sustainable-futures.aspx",
    "content": [
        {
            "p": "We’ve helped our partners cut CO2 emissions by 16.3m tonnes a year in recent years. Across transport, food, energy and other industries, our technologies are securing a net-zero future. Our discoveries will help achieve the UNs goals for sustainable development. The University of Nottingham is at the forefront of food process engineering, playing a pivotal role in advancing the field both within the UK and internationally. Academics from University of Nottingham Malaysia have been working in partnership with WWF-Malaysia to implement a range of ecologically based flood management practices in the river Trusan. Converting wastes into value-added products A team of researchers have developed software to minimise CO2 emissions. Our partnership with Chile is helping to decarbonise one of the world’s largest mining industries. The University of Nottingham secured £12 million to establish the Centre for Doctoral Training (CDT) in Resilient Chemistry (Feedstock to Function). UNNC researchers are turning agricultural waste into advanced materials for use in healthcare A UNNC researcher is contributing to a major international assessment of biodiversity loss and its consequences UNNC researchers are finding new ways of reusing waste soil Indonesia’s ambition to be southeast Asia’s electric vehicle powerhouse is a cornerstone of its net zero commitment. The University of Nottingham, a key partner in growing the country’s EV infrastructure and skills base, is helping deliver this green transport revolution. What can knowledge of past human-environment interactions tell us about future sustainable development? Innovative research at UNNC is helping to tackle different types of air pollution A UNNC research team is working to create the smart, low-carbon cities of tomorrow. At the University of Nottingham, we address the complex challenges facing our planet and are committed to making an outstanding contribution to the United Nations Sustainable Development Goals (SDGs) Educational resources that target children’s sense of agency are key in supporting behavioural change. To combat climate change, we need to understand how to design and implement these into the curriculum most effectively argues Jonathan Halls. Vice-Chancellor Professor Shearer West reflects on COP27 and says to tackle the greatest challenge of our time we must accelerate the delivery of sustainable technologies and solutions. Researchers, including the School of Education’s Jenny Elliot, plus teachers, students and civic groups are developing an outdoor space on campus to share ideas and better connect communities with the environment. Women are often at the forefront of climate change impacts says Dr Bethany Jackson. Now is the time to fast track new technologies for low energy CO2 capture, says Professor Ed Lester Dr Emily O’Donnell explains how better protecting cities like Newcastle and Nottingham from flooding can also make them greener, healthier and more pleasant places to live As a university, we’re committed to reducing our carbon emissions and showing leadership, says Andy Nolan Meeting this complex challenge demands world-changing innovation, determination and leadership, says Professor Chris Gerada The early career researchers of today will be the climate leaders of tomorrow. We need to ensure our approach to research is aligned with a dramatically changing environment, says PhD student Max Gillingham. A call for improved and consistent communication and engagement between the government and the people over haze Remote-controlled robots capable of carrying out specialist repairs on aircraft could mean aerospace companies no longer need to fly engineers across the world. Asking future generations to foot the bill for our actions against climate change today is both moral and practical, argues Dr Matthew Rendall. The energy used by many buildings is costly to the environment and to our bills – but technological research is changing this, says Ke Qu. Lightweight materials are crucial in the construction of aircraft but can be tricky to recycle. New processes are needed if the aviation industry is to achieve its zero carbon aims. Increasing electrification of onboard systems will help flights of the future become cleaner, greener and safer, says Dr Sharmila Sumsurooah An innovation platform is being used to fight back against climate change and food insecurity in local communities. Harnessing the power of entrepreneurship offers communities most affected by climate change the opportunity to take action, says Professor Simon Mosey. Tackling climate change is about understanding behaviour as well as developing technology, says Stephen Meek. Dr Arabella Fraser and international research partners are investigating how non-conflict violence risks and climate change risks overlap in cities, and what this means for adaptation. Dr Chris Ives calls for the inclusion of religious perspectives in climate policy discussions Computer scientists play a huge role in reducing aviation’s carbon footprint. Battery-powered planes could drastically reduce the environmental cost of air travel, but finding the right technology is key. Advances in solar cell technologies and energy storage could harness the power of the sun in our everyday lives, says Dr James O’Shea Legal frameworks around human rights offer a means to incentivise changes in corporate behaviour to protect the climate, says Professor Robert McCorquodale If agriculture is to adapt to climate change and reduce its carbon footprint, farmers themselves have to be a core part of the solution, says Prof David Salt Research at the University of Nottingham is helping create a future aviation industry that is cleaner, greener and leaner, says Dr Hitendra Hirani. Further advances in ceramic coatings, which allow aero engines to operate under extreme temperatures, are set to significantly lower CO2 emissions from aviation. Professor Tanvir Hussain explains. A unique project at the Trent Basin Housing Development in Nottingham makes the future of fully-fledged community energy bubbles a promising reality, says Dr Eldar Naghiyev. Smoky cooking fires are bad for our health as well the planet, causing ten times as many deaths as malaria Research into the factories of the future could transform the aerospace supply chain making it cleaner and more cost-effective. Dr Sharmila Sumsurooah is helping net zero aviation take flight by bringing together international research to transform the industry. An unrivalled new test facility has placed Nottingham at the heart of the quest for electronically powered flight, says Professor Pat Wheeler. Interdisciplinary research is showing how conservation agriculture can mitigate the impact of climate change in Africa, says Murray Lark. Professor Arijit Mukherjee is showing governments how to integrate their green goals with effective trade policies Professor Nigel Minton is engineering bacteria to use carbon dioxide as the building block for key components in industry and transport. Hydrogen has the potential to be a much greener alternative to current aviation fuels, but finding a way to store it on planes requires complex research by materials scientists, chemists and engineers. To understand how agriculture can adapt to a warming world, we need to look to the past and plan for the future, say Profs Matt Jones and Malcolm Bennett Studying the structure and physiology of plants is key to preparing agriculture for a warmer world, says Dr Alexandra Burgess The Nottingham University Business School at the University of Nottingham Malaysia is supporting the country’s businesses to take practical steps towards sustainability, says Mohan V Avvari A successful transition to renewable energy sources means factoring in all the costs of shifting away from fossil fuels, says Dr Hafez Abdo. Establishing the value of alternative, sustainable sources of protein in animal feed is helping the UK dairy industry reduce its carbon footprint A revolutionary technology developed at the University of Nottingham challenges farming’s reliance on greenhouse gas-emitting synthetic fertilisers. A multidisciplinary buzz motivates aviation researcher Professor Carol Eastwick Professor Dame Jessica Corner on creating a world-leading cluster for net zero research and innovation Noticing nature in Glasgow will support wise climate change action, says Dr Nicole Porter Professor Dame Jessica Corner on what's next and the ongoing role of research in tackling the climate crisis Our passion for innovation and the sharing of knowledge can truly change lives, says Professor Dame Jessica Corner Dr Bethany Jackson lays out key policy recommendations for tackling the modern slavery - environmental degradation - climate change nexus. Research at the University of Nottingham is transforming the way breeders develop new varieties of tomato – improving shelf life while maintaining excellent taste The future of UK farming is under the spotlight more than ever. Professor Paul Wilson of the Rural Business Research Unit explains how experts are helping to navigate a shifting landscape Researchers are visiting 2,000 farms in Malawi, collecting soil and crop samples to helpfight a challenge to the health of millions across sub-Saharan Africa. Professor Sir Martyn Poliakoff has led the way in discovering processes to help secure a cleaner and more sustainable future. A chain of new health clubs is being rolled out across the UK – with the aim of keeping the nation’s sheep flocks fit and well. ‘Living deltas’ offer clues towards building a picture of environmental change over time A community project is leading the way for the UK’s renewable energy policy Green chemistry advances could reduce the lengthy process to create new drugs to just two steps Extending the mileage of low-carbon electric vehicles by significantly enhancing the performance of their engines Pete Licence underlines the importance of sustainability in a world getting back on its feet Technician Sanjeev Taak on how his work helps to keep low temperature research going for as long as possible Our dependence on fossil fuels must be tackled if we are to address global warming caused by climate change Sir Martyn Poliakoff’s refreshing approach to education has inspired many in the broader scientific community and beyond Illegal gold mining is destroying the Atrato river basin in Colombia. Dr Nick Mount is part of a multi-national team trying to reduce the impact of this environmental disaster Exploring the behaviour of CO2 to become a global technology leader in carbon capture and storage. Manufacturing complex, high-performance coatings, devices, and biomaterials to tackle real world problems. How wild plants adapt to tolerate salty soils is hugely important if we hope to continue to feed the world with a growing population. Water is a priceless resource, but its value after it is washed and flushed away may surprise you New biofuels with the potential to provide affordable clean energy, reduce poverty and help to tackle climate change. Reducing the environmental impact of aircraft is vital for the future of our planet. Research at the University is helping to bring the aerospace industry together to focus on the issue. Pushing the boundaries of additive manufacturing International expertise is vital to deliver the International Low Carbon City, a flagship environmental project in China"
        }
    ],
    "pdf_files": []
}