{
    "url": "https://www.nottingham.ac.uk/vision/vision-future-of-shipping",
    "content": [
        {
            "p": "Sustainable Futures The University of Nottingham is at the forefront of a global revolution – decarbonising the maritime industry. Shipping, while a critical artery of global trade, is a significant contributor to greenhouse gas emissions, accounting for roughly 3% of the global total. To combat climate change, the International Maritime Organisation (IMO) has set an ambitious goal: reduce shipping emissions by at least 50% by 2050 compared to 2008 levels, ultimately phasing them out entirely this century. The challenge and our response Achieving this objective is no easy feat. Traditional electrification, a common solution for smaller vehicles, is impractical for ships due to their immense energy demands and long-range voyages. Recognising this, the University of Nottingham, alongside partners like the Universities of Birmingham, Cardiff, and Brighton, is spearheading the MariNH3 programme, a collaborative effort with 23 industry partners, ranging from equipment suppliers to policymakers. This ground-breaking initiative, closely monitored by the Maritime and Coastguard Agency (MCA), tackles the potential of ammonia as a clean and sustainable fuel for maritime transportation. Why ammonia? Unlike fossil fuels, ammonia (NH3) doesn't emit carbon dioxide when burned. This makes it a promising alternative for powering ships. However, unlocking its full potential demands a multifaceted approach. The MariNH3 programme delves deep into the social acceptability of ammonia as a fuel, alongside the technical feasibility and legislative considerations. This comprehensive analysis ensures a smooth transition while addressing potential concerns. Scaling up innovation The success of the MariNH3 programme has propelled the University of Nottingham and the University of Brighton to secure additional funding of £3.5 million. This critical grant will be used to procure two large-scale marine engines, one for each institution. This significant investment allows researchers to move beyond smaller test engines and directly test ammonia on real-world maritime engines, accelerating the development and implementation of this clean fuel solution. Beyond MariNH3: leading a national hub Our commitment to clean maritime solutions extends beyond individual projects. We are a vital partner in the UK's national Clean Maritime Research Hub, a £7.4 million initiative funded by UK SHORE and EPSRC. This virtual hub aims to address various barriers to maritime decarbonisation across different technology stages. By fostering collaboration between industry, academia, and civic organisations, the hub will identify research challenges, build capacity in clean maritime technologies, and act as a knowledge exchange platform. This collaborative approach will accelerate the development and adoption of clean maritime solutions, ultimately driving the industry towards net zero. We stand at the helm of maritime decarbonisation. Through the MariNH3 programme and its involvement in the Clean Maritime Research Hub, we’re leading the charge in exploring and implementing innovative solutions like ammonia as a clean fuel. This commitment to a sustainable future for the maritime industry positions the University of Nottingham as a global leader in clean maritime research and development. These efforts, combined with the university's broader initiatives in decarbonising future transport, position the University of Nottingham as a global leader in clean maritime research and development. For more information, please visit the university’s Zero Carbon website. Jenny Baldwin works as a Programme Manager for the EPSRC-funded programme: MariNH3 - Decarbonised Clean Marine: Green Ammonia Thermal Propulsion, a five-year programme to develop new and disruptive engine technology that will significantly cut greenhouse gases and pollution emitted by diesel-powered marine vessels. Find out more at marinh3.ac.uk Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}