{
    "url": "https://www.nottingham.ac.uk/vision/vision-hungry-for-words",
    "content": [
        {
            "p": "Culture And Communication Eating disorders are often seen as a 'female illness’, predominantly affecting white teenage girls from more privileged backgrounds. This is a stereotype that Dr Heike Bartel, Principal Investigator on the Arts and Humanities Research Council (AHRC)-funded ‘Hungry for Words’ project, describes as “dangerous”. Eating disorders affect men and boys too, and they are estimated to represent between 10% and 25% of all cases in the UK. Eating disorders are serious and complex psychiatric disorders, and they can prove fatal – anorexia, for instance, has the highest mortality rate of all mental health conditions. The lack of focus on men suffering with eating disorders is therefore an increasingly serious health concern, and one that Dr Bartel has approached by bridging the arts and sciences. Dr Bartel is using personal narratives of eating disorders in men to improve care and support in health and education. It’s an approach that motivates her: “Shaping emerging disciplines such as Heath Humanities and Medical Humanities that connect arts and humanities with science and medicine to change the lives of real people is inspiring”, she said. Her research foregrounds narratives – in autobiographies, fictional texts and poetry – of eating disorders in men, aiming to bring these lived experiences into the centre of focus. She uses a comprehensive body of narratives in English and German, and they are all authored by those who have direct experience of eating disorders in men. These texts highlight the complexity of the topic by placing eating disorders in a much wider social and cultural context. Dr Bartel analyses these narratives and then translates her findings into creative tools which benefit health practitioners and those who work with and for young people, as well as people affected by eating disorders themselves. Alongside creative organisations Woven Ink and Simply Thrilled, with research partners such as Dr Una Foye (King’s College London), partner eating disorders charity First Steps ED, GPs, nurses and – importantly - experts by experience Bartel’s team has created tools that include a bank of video-poems, a short film which highlights how the creative arts can help men and boys with eating disorders open up about their condition and an animation, ‘Consider Eating Disorders in Men’, which features powerful testimonies of men living these experiences: The animation is to train GPs and other primary carers. The AHRC- and Wellcome-funded project – Hungry for Words – has identified GPs and practice nurses as a key focus area for the tools it is developing. Eating disorders in men are often not seen or diagnosed, so Dr Bartel has been working with a group of men who have personal experience of eating disorders to understand what made it so difficult when seeking help in a primary care setting for the first time, and what would make the process easier. The research has shaped the animation and the short film, and is currently helping GPs and practice nurses to reflect on their engagement with males who may be suffering from eating disorders. Hungry for Words has also been working with several secondary schools across the Midlands, where Dr Bartel’s research has been shaping their pastoral practice and responses to eating disorders, among other mental health issues. The training tool ‘Consider Eating Disorders in Men’ has received endorsement by the Royal College of Nursing and the Royal College of Psychiatrists and accreditation from the Royal College of General Practitioners, and is part of essential training programmes reaching wide audiences. Feedback has been very positive, with GPs highlighting how it raised their awareness of the issue. One GP noted: “This has given me important insights into a topic I didn't know much about. It will change my daily practice, making me more aware, confident and sensitive about eating disorders in men and boys”. All of this provides encouragement for the future, where Dr Bartel hopes the integration of narratives of lived experience can provide a way of improving mental healthcare, observing how “creating a bridge between science and the arts can help us all to learn and grow”. Dr Heike Bartel is a Professor of German Studies and Health Humanities. The AHRC and Wellcome-funded project – Hungry for Words – won the Research Project of the Year (Arts, Humanities and Social Sciences) in the Times Higher Education Awards in 2021 – the “Oscars” of higher education. Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}