{
    "url": "https://www.nottingham.ac.uk/vision/vision-closing-the-net-zero-skills-gap",
    "content": [
        {
            "p": "Sustainable Futures We need highly trained people to roll out net zero technologies across society and the economy. Universities for Nottingham, a strategic partnership between the University of Nottingham and Nottingham Tent University, is working with industry partners to secure the next generation of innovators who will help deliver a prosperous, sustainable future. The challenge: the UK needs skilled chemists, engineers and innovators who understand the challenges of sustainability and resilience Synthetic fuels, renewable polymers, next-generation battery materials and other innovations by experts in sustainable chemistry will help the UK decarbonize and hit net zero targets. But a highly skilled workforce is essential if such discoveries are to be rolled out by industry and without access to a production line delivering people with expertise and knowledge, businesses will lose their competitive edge, and industrial regions such as the East Midlands risk falling behind in the race to net zero. Our response: training the sustainable innovators of tomorrow Universities for Nottingham host a nationally significant portfolio of doctoral training centres, underlining our commitment to training the innovators of tomorrow who will help the UK tackle large-scale, complex challenges and secure a skills-rich, sustainable economy. Among these is the Centre for Doctoral Training (CDT) in Resilient Chemistry (Feedstock to Function), also known as the CDT-F2F, which is aligned to deliver graduates with exquisite skillsets that are bespoke to the delivery of innovation and excellence in molecular sciences. This key defining commonality will help drive the systemic decarbonization of chemicals manufacturing and underpin a drive towards net zero. CDT-F2F represents a consortium of educators spanning both universities within the city of Nottingham working together with over 20 strategic partners that represent all sectors of the chemicals enterprise. The CDT is core funded by the Engineering and Physical Sciences Research Council (EPSRC), reaffirming our city, and our universities, as a leader in training the next generation of chemists focused on sustainability. The CDT-F2F will: The CDT-F2F represents a pivotal step towards equipping the next generation of chemists with the knowledge and tools to drive sustainable change in the chemical sector. By fostering collaboration and innovation, we aim to empower these future leaders to play a critical role in achieving net zero in the East Midlands and beyond. Potential impact: a sustainable future for the East Midlands The CDT-F2F has the potential to create a significant and lasting impact: Professor Pete Licence, Director of the CDT, said: “The EPSRC CDT in Resilient Chemistry, which will train multidisciplinary scientists and engineers to deliver truly sustainable solutions to some of the chemicals industries biggest challenges, from Feedstock to Function. In partnership with research leaders from around the world we will attack some of society’s biggest challenges including synthetic fuels, renewable polymers and next generation battery materials to secure jobs, productivity, and growth.” Professor Julie Beth Zimmerman, Vice Provost of Planetary Solutions at Yale University said: “We are excited to join this transatlantic collaboration which will inspire the next generation of scientists and engineers to deliver resilient planetary solutions to the grand challenges of society. The application of Green Chemistry solutions will provide better routes to sustainable manufacturing while achieving our commitments towards net zero.” Pete Licence is a Professor of Chemistry and Director of the GlaxoSmithKline Carbon Neutral Laboratory for Sustainable Chemistry at the University of Nottingham. Email: peter.licence@nottingham.ac.uk Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}