{
    "url": "https://www.nottingham.ac.uk/vision/culture-communication/culture-and-communication.aspx",
    "content": [
        {
            "p": "We work with more than 50 cultural organisations globally, from Europe and Hollywood to China. Our partnerships with the UK’s creative and heritage industries inspire audiences and enrich lives. We connect communities through innovative technologies and empower organisations to deliver positive change. Professor Maiken Umbach is challenging the use of Nazi photographs in commemorating and teaching about the Holocaust A trio of Nottingham researchers are helping to challenge perceptions of the Greek city-state of Sparta, changing long-held beliefs about this ancient society. What next for the movie industry? A researcher is helping film-makers in Hollywood plan ahead. How the Hungry for Words project is raising awareness of eating disorders in men Art historian Dr Gabriele Neher and colleagues are on a mission to modernise museums, breathing life into the stories of their exhibits and exploring new ways to engage audiences. Our heritage lottery-funded project has helped the Theatre Royal to develop a new volunteer-led approach to researching its history The Periodic Table of Videos: sharing science with over 200 million viewers New wave modelling is helping roll out the next digital revolution From soundscapes of Bradford to compositions in caves, Dr James Mansell explains how he is working with museums to enrich visitors’ experiences Professor Andrew Fisher is pioneering the teaching of philosophy – from the primary school to post-doctoral level – and transforming the way thousands of children across the East Midlands are taught. Local businesses, charities and the NHS have all benefited from the work of academic Jonathan Tallant, who specialises in putting philosophical concepts to use in the real world A ground-breaking book by Professor John Milbank has sent ripples through the world of politics with its post-liberal approach to creating fairer societies of the future. Dr Roderick Dale’s fascination with the Vikings is shared by many: 9,000-plus people attended the record-breaking exhibition Danelaw Saga: Bringing Vikings Back to the East Midlands Online learning is not only deepening engagement with a worldwide community of participants: it enriches research. Dr Richard Gaunt’s work on the history of rebellion in Nottingham has been crucial in the transformation of one of the city’s major landmarks, attracting interest from across the world. University academics are helping the residents of a Norfolk village uncover the remnants of its Roman past in a unique community archaeology project. Will Bowden, Professor of Roman Archaeology, explains. The discovery of an ancient method of learning music is revolutionising the way children and adults are being taught across Europe. Professor Nicholas Baragwanath explains. Iron Age coins are revealing fascinating details about the East Midlands during this period How DH Lawrence’s life is promoting a greater appreciation of the literary and mining heritage of Eastwood among school pupils How studying the chemical composition of ancient glass objects reveals a hidden past Sir Martyn Poliakoff, periodic table, experimental Dr Rebecca Senior, a Henry Moore Foundation Postdoctoral Fellow, has created a series of resources to support institutions grappling with legacies of colonialism by engaging with recent debates over contested art in the UK. Dr Angus Davison on the Jeremy the snail phenomenon and life as a Media Fellow The Institute for Policy and Engagement’s listening posts around Highfields Park offers the public chance encounters with groundbreaking research and ideas from the university. Our response to the virus has given researchers the opportunity to reflect on what a renewed sense of community and shared purpose can achieve Bringing an iconic collection of dinosaur fossils from China to a Nottingham museum was a remarkable coup and forged new partnerships with the fastest-growing sector of its kind in the world Dr Peter Kirwan ponders what theatre will look like when the lights go back up Roger Highfield of the Science Museum Group on the elemental joy of songwriter Tom Lehrer’s witty classic."
        }
    ],
    "pdf_files": []
}