{
    "url": "https://www.nottingham.ac.uk/vision/a-quantum-leap-for-brain-imaging",
    "content": [
        {
            "p": "Healthy Lives A revolutionary scanner is attracting extraordinary worldwide interest from clinicians and scientists, who hope to use it to unlock the secrets of the human brain. The world’s first wearable magnetoencephalography (MEG) system promises unprecedented insights into myriad conditions, including severe neurological disease like epilepsy, neurodegenerative disorders such as Alzheimer’s disease, and mental health conditions such as schizophrenia. The phenomenal attention has seen the scanner move swiftly from the lab to commercialisation, via a University of Nottingham spinout Cerca Magnetics Limited, formed recently in partnership with UK company Magnetic Shields Limited (MSL) and in collaboration with US atomic devices company QuSpin. The spinout has a growing order book, attracting the attention of the world’s leading neuroscientific research centres. Professor Matt Brookes leads MEG research at the University’s Sir Peter Mansfield Imaging Centre, which is home to MRI - another University of Nottingham invention that transformed medical imaging and diagnostics. Professor Brookes said that the new MEG scanner “has huge potential, both as a neuroscientific tool – allowing scientists to better understand the brain – and for diagnostics and treatment planning, particularly in disorders such as epilepsy”. What particularly excites Nottingham’s MEG team is the unique potential to unlock the mysteries of the developing brain. The system is worn like a helmet and, unlike static and cumbersome conventional scanners, it adapts to head size and shape, and allows patients to move freely during a scan. This opens up the possibility of scanning children and people with movement disorders such as Parkinson’s disease. It takes away the fear of lying still and alone inside a big, claustrophobic, scanner. Also, since the scanner measures brain function (what the brain does, not what it looks like), it opens up new avenues in scientific experimentation, measuring in real time the dynamics of brain networks as they form and dissolve in support of cognition. The lightweight scanning helmet (whose development was aided by another University of Nottingham spinout, Added Scientific Limited) resembles a cycling helmet and can be scaled to fit babies, toddlers and adults. This will offer psychologists extraordinary insights into the neurodevelopmental trajectory, enabling us to look at the brain networks that form as infants learn to walk, or talk, and how those networks might break down in disease. Further collaborations have seen psychologists using the scanner to study the behaviour of elderly drivers, and Queen’s Medical Centre consultants studying brain injuries. Developing novel biomarkers for assessment of concussion in sport and the military is another application which has extremely exciting potential. A key partner is the Wellcome Centre for Human Neuroimaging at University College London. The UCL team, led by Professor Gareth Barnes, are long-standing collaborators with Nottingham. Back in 2016, the teams realised that a new generation of quantum sensors, which are lightweight and operate without cryogenic temperatures, could facilitate small-scale MEG technology, while increasing its sensitivity. Fast forward just five years and the first OPM-MEG clinical trials, funded by the Wolfson Institute, will be conducted later this year by Young Epilepsy, in collaboration with Great Ormond Street. Professor Richard Bowtell, Director of the Sir Peter Mansfield Imaging Centre and integrally involved in the research said: “It’s very exciting. We are making important connections with collaborators, clinicians and researchers around the world who recognise the potential of the scanner to uniquely assess brain function across the lifespan, and to offer insights into conditions which have previously been difficult to study using conventional MEG.” “Professor Brookes added: “The clinical trial could tell us much about the source of epileptic seizures in the brain, while providing data to help us further refine and validate the technology. “The many quotes supplied by Cerca Magnetics confirms tremendous global interest and is allowing us to maximise the impact of our research, taking technology out of the University of Nottingham and into research institutions across the globe. The Cerca system uses quantum sensors – optically pumped magnetometers (OPMs) – developed by US company QuSpin Inc, the world leader in atomic devices. Conventional MEG systems are static and cumbersome; this is necessary to accommodate the magnetic field detectors which have to be cryogenically cooled to -269 degrees Celsius. OPMs enable the same field detection without the need for cryogenic cooling, and so can be placed next to the scalp, making them far more sensitive to brain activity. The latest sensors are similar in size to a Lego brick, tri-axial (capable of measuring magnetic field in three orientations) and lightweight, which means they can be mounted in compact helmets. Control of interference from background magnetic field is critical to the development of the system. Nottingham researchers worked with established partner Magnetic Shields Limited (MSL) to develop smaller, cheaper and lighter shielding enclosures for the scanner, using a new “hybrid” shielding technology. With shielding in place, the participant can move freely during a scan. MSL became a partner in the spinout company Cerca Magnetics Ltd. Professor Brookes said: “The success we have had is entirely due to an extraordinary team of talented postdoctoral researchers and PhD students. They are the rock upon which this new generation of imaging technology has been built. Dr Elena Boto began work in this area in 2015 when, with a few equations and a computer simulation, she unlocked the potential of what might be possible. Subsequent work saw that potential become reality, with a Nature paper (Boto et al 2018) demonstrating the first wearable system. Elena’s work has since expanded this early prototype, providing whole head coverage, and demonstrating how OPM-MEG can be used to measure communication between brain regions; something of great significance in mental health conditions (Boto et al, NeuroImage, 2021). Elena is also Cerca Magnetics’ Chief Scientific Officer. Dr Niall Holmes’ doctorate was earned via his pioneering work in controlling background magnetic fields, at a level of one part in 250,000 of the Earth’s magnetic field – an “immense challenge” says Professor Brookes – that is absolutely critical to allow participants to move freely during a scan. (Holmes et al, NeuroImage, 2018) Dr Ryan Hill, a former University of Nottingham undergraduate, got his first taste of OPM-MEG during a summer internship following the third year of his degree. Since then, he has completed a Ph.D. where he was the first to scan infants using the wearable device (Hill et al Nature Communications, 2020). Ryan also pioneered the use of generic helmets, capable of fitting individual participants. Dr James Leggett, an experienced researcher, and hardware developer, has also worked on this technology since 2017, fabricating key instrumentation and generating the critical theoretical models that enable suppression of background magnetic interference. Professor Brookes was also keen to celebrate the role played by undergraduate students in the development of this system. “When undergraduates in the School of Physics and Astronomy reach their third and fourth years, they undertake research studies and a number have worked with OPM-MEG technology. It was undergraduates who made a key breakthrough related to sensor coverage when scanning infants. Similarly, it was via an undergraduate project that we first measured bioelectrical activity from muscles, and used the system to fabricate a brain computer interface [a device that allows an individual to communicate with a computer purely by thinking]. Many of the undergraduates involved have gone on to careers in medical physics, either in a research capacity or in the NHS.” In 2016, using internal funding to encourage interdisciplinary research into quantum technology, the Nottingham team purchased the world’s first miniaturised commercial OPM from the newly formed USA spin-out company QuSpin Inc. In 2017, a £1.6m Wellcome collaboration grant was used to build the initial prototype and prove its worth in neuroscience. In 2019 a £2.3m Engineering and Physical Sciences Research Council (EPSRC) grant helped develop the system and drive it towards commercialisation. A further £1.1m grant from EPSRC is supporting the Nottingham team’s work with Great Ormond Street Hospital, London, to further develop the system for infants. Matt Brookes OBE is a Professor of Physics in the School of Physics and Astronomy Richard Bowtell is a Professor of Physics and Director of the Sir Peter Mansfield Imaging Centre Neuro Image April 2021: Boto et al, Measuring functional connectivity with wearable MEG Nature Communications November 2019: Hill et al, A tool for functional brain imaging with lifespan compliance Neuro Image November 2018: Holmes et al, A bi-planar coil system for nulling background magnetic fields in scalp mounted magnetoencephalography Nature March 2018: Boto et al, Moving magnetoencephalography towards real-world applications with a wearable system Subscribe to receive updates about the unstoppable research happening at the University of Nottingham > Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}