{
    "url": "https://www.nottingham.ac.uk/vision/society-and-communities/society-and-communities.aspx",
    "content": [
        {
            "p": "Our discoveries inform policy affecting every UK citizen, from informing laws that safeguard children online, to tackling misogyny, improving road safety and protecting consumers. We help nurture young democracies, strengthen international justice and build fairer societies. Research at the University of Nottingham is finding ways of sustainably growing commercial elderflower in the UK New guidelines introduced in workplaces around the world as a result of Professor Amanda Griffiths’ research are changing the working lives of women. Making the internet a safer place by putting young people at the heart of policy Loretta Trickett and Louise Mullany talk about how Misogyny against women and girls is everyone’s responsibility Thousands of road deaths could be prevented by asking drivers to talk to themselves Professor John Gathergood was instrumental in the reform of consumer credit rules – saving borrowers more than £600 million in the process Professor Christopher Day’s work on successful school leadership has impacted thousands of school leaders, teachers and pupils around the world Flavour chemist Ian Fisk and his colleagues have helped transform processes at Piper’s Crisps, increasing customer satisfaction and enabling the brand to expand into new markets. Poor mental health and wellbeing at work is one of the leading causes of sickness absence, costing the global economy billions of pounds. Guidance for employers developed by Dr Aditya Jain and Professor Stavroula Leka is having a positive impact on tackling this challenge across the world. A study into the legacy of Haiti’s revolution two centuries ago is informing research helping to secure a more inclusive, diverse and equitable society in Britain. The notion of using social science for good drives the narrative of our work. When 21 Birmingham schools were investigated over fears about Islamic education it made national headlines. Professor John Holmwood’s work explores how the fallout from the case is continuing to shape debate. Paul Heywood’s research is shaping the agenda of the global fight against corruption. He explains how we can loosen its grip, while policymakers reflect on his contribution A landmark study of party politics in Europe is shaping constitutional reform in Georgia The ‘My Marriage, My Choice’ project looks at how people with learning disabilities are being forced into marriages they might not understand. The voices of the survivors of slavery have largely gone unheard in the creation of antislavery policies and programmes - The Survivor Alliance is redressing this The University of Nottingham has developed a new tool for zoos to help address one of their more elephantine challenges: welfare in captivity Facundo Albornoz’ research improved training of secondary school teachers in Argentina and is influencing the global debate on the best and most cost-effective approaches to improve education Inside the Rights Lab, more than 100 University of Nottingham academics have created the world’s leading research platform for ending slavery By assisting countries in the Western Balkans to reform their civil service and overcome cronyism and political patronage, Professor Jan-Hinrik Meyer-Sahling is helping states move towards integration with the European Union. How Che Guevara inspired a world-leading authority A landmark global study is informing policy and debate on life imprisonment Professor Doreen Boyd is using satellite imagery and her expertise in remote sensing to help end modern slavery Lockdown highlights the challenges of ensuring the rights of children are protected in the digital world. It’s been three years since Professor Louise Mullany and colleagues started working with Nottinghamshire Police as they became the first force in the world to classify misogyny as a hate crime. She reflects on the far-reaching impact. It is the biggest change in the UK political landscape for more than half a century. But what will be the true impact of Brexit on British business? The world is witnessing its fourth major antislavery movement, and there are good reasons to hope it will be the last. Dr Simon Roberts, a leading international expert on the free movement of people across the EU, explains why the role has never been more important. A border dispute that rumbled on for more than 150 years was finally resolved thanks to the expertise of river scientist Colin Thorne Innumeracy and illiteracy costs the global economy £120 billion. Innovative digital technology is being used by children in the UK and around the world to acquire these vital skills From Defoe to Zoom, storytelling evolves – but the urge to connect will always be with us, The ability to supply reliable business data in almost real-time limits the damage caused by uncertainty and is helping the UK plan for recovery On 18-19 July 2019, the University of Nottingham Human Rights Law Centre brought together Liberian stakeholders and international experts in Monrovia for a historic Legislative Conference on Accountability for Past Crimes in Liberia Professor Paul S Monks (Leicester University) shares his thoughts and reflections three months into assuming his role as Chief Scientific Adviser during an unprecedented time One of the questions you might have asked yourself in the last few months is: when is someone or something trustworthy, and how can I tell? Exploring the lives of marginalised families through digital networks Introducing a blog series on the University of Nottingham’s ongoing research contribution to the Covid-19 effort With billions spent on new contracts for PPE, the pandemic has put government procurement practice under intense scrutiny The pandemic is accelerating irreversible shifts already under way in the UK economy The pandemic has further exposed deep gender and class inequalities, say professors Tracey Warren and Clare Lyonette, and the government must act if we are to rebuild a fairer society Lockdown makes the exploitation of young people by drug dealers harder to detect. Dr Ben Brewster’s research is helping police and safeguarding agencies respond Cities and communities after the Covid-19 pandemic Policymakers must address the profoundly uneven impact of Covid-19 on communities, sectors and regions across the UK Universities have already moved to online lectures. Now’s the chance to really shake-up how we deliver education Overcoming barriers to post-conflict justice in Liberia, which has experienced two violent civil wars between 1989 and 2003 has been a key aspect of Professor Olympia Bekou’s work. Dr Helen McCabe's research explores the impact of Covid-19 on those vulnerable to, or already experiencing forced marriage Building back better social and health protection in the global garment industry after Covid-19 Research has given new insights into the robustness and resilience of school trusts in supporting their students, staff and communities during the pandemic Researchers at the University of Nottingham evaluate the risk of labour exploitation among migrant workers in the UK during the Covid-19 pandemic Researchers and NGOs are helping the displaced and marginalised to better protect themselves against the pandemic How Government fell short in its Covid-19 messaging for vulnerable young people – and how it can improve Dr Thomas Legendre imagines a post-Covid future in his coming book, Spring Fever The Knowledge Exchange Framework. An international study to inform government response to the pandemic and understand its societal impact. Stephen Meek looks at how the UK’s response to the pandemic highlights the complex relationship between science and politics Nottingham has some of the UK’s highest levels of household debt, but a new partnership, chaired by Shaun French, is helping to change that Hybrid war was recently the subject of the first ever overseas speech by a Director General of MI5. It has long fascinated Dr Andrew Mumford and his research has influenced UK and Nato policymakers. An international study of behaviour during the pandemic led by Dr Bahar Tunçgenç found people were far more likely to comply with the rules if their friends and family did Discover how adult education transformed Dr Sharon Clancy's life as well as her father's, a Derbyshire miner. The head of the Policy Profession of the UK Civil Service reflects on building mutual understanding with academics Black Studies encourages innovative ways of thinking about research, narratives and belonging, says Dr Hannah Robbins John Gathergood, Professor of Economics, argues that the Covid-19 crisis has most likely brought forward economic structural change not expected until the 2040s, while pushing the government finances into their worst state since the 1940s Governments seeking legitimacy for a post-virus future must avoid delaying elections and ensure voters can safely take part A recovering world can learn from the anti-slavery movement's innovations in supporting marginalised communities Introducing reflections and debate from our researchers on the challenges, as well as opportunities, of a post-Covid-19 world How technician Nicola De Vivo uses caesium to help steer away from the use of animal cells The ‘Iron Maiden’ compound is an especially energetic form of the metal that has been the backdrop to many hours slaving over a scanning probe microscope. Professor Simon McGrath explores the potential for education to adapt post Covid-19 Policy Impact and Public Engagement Awards Challenges and lessons from the 2020 US Election"
        }
    ],
    "pdf_files": []
}