{
    "url": "https://www.nottingham.ac.uk/vision/saving-young-lives-with-a-clearer-view-of-cancer-1",
    "content": [
        {
            "p": "Healthy Lives David Walker has dedicated his career to lessening the devastating impact of brain tumours in children. He helped set up the University of Nottingham’s Children’s Brain Tumour Research Centre (CBTRC) in 1997 and by 2008 had developed evidence-based guidelines adopted by the NHS for the diagnosis and treatment of what remains the second most common cancer in childhood. The Royal College of Paediatrics and Child Health (RCPCH) welcomed Professor Walker’s guidelines - but warned that, without publicity, too few practitioners would actually read them. In 2011, CBTRC and the Brain Tumour Charity responded by launching the national HeadSmart: Be Brain Tumour Aware campaign. “Raising awareness is a very powerful clinical tool,” Professor Walker said. “We realised that our guidelines, however professional and valuable, were only going to be used if they were accessible and people were aware of them. We worked with public relations strategists, created brain tumour symptom awareness cards, a website and decision support tools for healthcare professionals. We didn’t want to cause panic; we just wanted to make the public and the medical profession more fluent in spotting symptoms and to encourage them to take action.” HeadSmart achieved these aims, and more. Funding for brain tumour research increased; GPs, A&E doctors and other frontline health professionals are now better equipped to spot symptoms and take action, and by 2013 the time to diagnosis had halved to less than seven weeks.[i] In 2015, the UK government quoted HeadSmart in its Be Clear on Cancer campaign and new strategy promoting early diagnosis in all cancers. In 2018, it doubled funding for brain tumour research to £40m, with an additional £25m from Cancer Research UK, and in the same year the World Health Organisation pledged to raise childhood cancer survival rates worldwide to 60%, which would save one million children’s lives by 2030. David Walker graduated from the University of Nottingham Medical School in 1977 and retired as Professor of Paediatric Oncology in January 2021. Now an Emeritus Professor, he takes satisfaction in passing on the torch to a fellow alum of the Medical School. Dr Shaarna Shanmugavadivel, who first worked alongside Professor Walker as a junior doctor on Nottingham University Hospital’s oncology ward, joined the HeadSmart team in 2015 as a research fellow, funded by the campaign’s £100,000 NHS Innovation Prize. She updated Professor Walker’s diagnosis guidelines and in 2017 helped relaunch HeadSmart, following up with a successful pitch to Cancer Research UK – “why don’t we launch an awareness campaign for all cancers in children?”. And so, ChildCancerSmart was born. It is a collaboration between the University of Nottingham and the Children’s Cancer and Leukaemia Group (CCLG) and is developing high-quality guidance and assessment tools on all childhood cancers for doctors, parents and young people and further promoting early diagnosis. The National Institute of Health Research (NIHR) is meanwhile funding Dr Shanmugavadivel’s unprecedented study of child cancer diagnosis in the UK. She is working with Professor Walker, statistician Jo-Fen Liu, Dr Shalini Ojha and Professor Kavita Vedhara from the School of Medicine on the two-year study. “We are collecting data on every single child and young person who has a new diagnosis of cancer over the next two years. We want to know: how long the diagnosis took, where the diagnosis took place, how many healthcare professionals they saw before diagnosis, what investigations were carried out, and whether factors such as ethnicity, age or where you live make difference? “We will, for the first time, have a detailed national picture of childhood cancer diagnosis in the UK; how long it takes for our children with all cancers to be diagnosed and what factors may be associated with this.” In February 2022, the study led to new protocols being published in the BMJ [ii], outlining the methods used by the experts in the Childhood Cancer Diagnosis study, to better understand the current diagnosis pathway of childhood cancer referrals and diagnosis and will look to determine the exact reasons for these delays in diagnostic pathways. As a paediatrician working in A&E, Dr Shanmugavadivel knows the pressures frontline colleagues are under. “The symptoms can be non-specific, for example, vomiting or headaches. It’s tempting to think ‘well, actually that's not an emergency, go back to your GP’ when a child’s presents with symptoms that have been there for a while and do not need immediate treatment. Yet they have come to see us and we have the same duty of care to those patients as we do to the patient that arrives by helicopter and goes straight into a resus bay.” Meanwhile, HeadSmart’s impact is still growing.[iii] The latest available data, from 2015, shows that a child cancer patient receives a diagnosis within one week of first seeing a healthcare professional. Its success in raising awareness of childhood and teenage cancers has also inspired researchers and medical practitioners in Denmark, Sweden, France, Germany, Austria and Poland to adopt similar strategies, while in Jordan, the HeadSmart posters and cards have been adapted and translated into Arabic. Perhaps most significantly, the work of Professor Walker, Dr Shanmugavadivel, the CBTRC and their charity partners are keeping childhood cancer in the spotlight. With brain tumours killing more people under 25 than any other cancer and survivors facing shorter life expectancy and disabilities such as blindness, delays in diagnosis cast a terrible shadow. For David Walker, the case for better understanding and action on childhood cancers is incontestable: “For every dollar spent worldwide on earlier diagnosis and treatment of childhood cancers, $3 will be returned in terms of lives saved and survivors living productive lives with fewer disabilities.” Dr Shaarna Shanmugavadivel is an NIHR Doctoral Research Fellow. She is working towards a PhD in childhood cancer diagnosis and is a clinical ambassador for HeadSmart and the research lead for ChildCancerSmart. David Walker is now an Emeritus Professor with the School of Medicine. [i] A new clinical guideline from the Royal College of Paediatrics and Child Health with a national awareness campaign accelerates brain tumor diagnosis in UK children—‘HeadSmart: Be Brain Tumour Aware’. David Walker et al, Neuro-Oncology [ii] The Childhood Cancer Diagnosis (CCD) Study: a UK observational study to describe referral pathways and quantify diagnostic intervals in children and young people with cancer. Dhurgshaarna Shanmugavadivel et al, BMJ [iii] Accelerating diagnosis for childhood brain tumours: an analysis of the HeadSmart UK population data. Dhurgshaarna Shanmugavadivel et al, British Medical Journal Archives of Disease in Childhood Culture and communication Healthy lives Society and communities Sustainable futures"
        }
    ],
    "pdf_files": []
}