{
    "url": "https://www.nottingham.ac.uk/ways-to-change-the-world/community.aspx",
    "content": [
        {
            "p": "The University of Nottingham's design/build studio, established in 2009, addresses the need for responsible architecture and social impact through hands-on student involvement. In response to the challenges faced by rural communities, projects like the Monang PreSchool in South Africa enable students to design and construct real buildings over six weeks. This approach bridges the gap between theoretical learning and practical implementation, equipping future architects with the skills to meet community needs while fostering sustainable development. People in the BAME community worked with artist Andy Farr to share their experiences of mental health. With partners Nottingham Community and Voluntary Service, NHS Talking Therapies and the Indian Community Centre Association, the project explores the potential of art in non-medical therapeutic recovery. The cost-of-living crisis has increased food poverty in Nottingham and Nottinghamshire, and put more strain on ‘more than food’ services. Our research is helping local authorities better understand the role of community kitchens, social eating groups and school holiday clubs in addressing this challenge. Every year the university dedicates a week of activities and events for staff and students highlighting some of the environmental and social issues we face across our campuses and how we are taking action to resolve these issues. It’s important to promote discovery, curiosity and questioning around science at an early age. Science in the Park engages with the local community, inspiring future generations of scientists Makaton is used by children and adults with communication and learning difficulties and often healthcare professionals may only have a basic understanding. Ellie Sims has developed a document containing simple signs and symbols that can be used by anyone working in healthcare and has won a national competition, run by Positive Choices and the Makaton Charity and her resources will be rolled out across the country. Todd Landman and Ben Lucas, Managing Director of 3DI at the University of Nottingham, explore the global impact of digital advancements on human rights. They discuss inclusive financial technology, leveraging data for good, protecting freedom of thought in the digital age, and the need for ethical regulations. This research emphasizes the importance of balancing technological progress with human rights, ethics, and accountability to make a positive impact worldwide. Amid the surge of autonomous delivery systems, a critical challenge emerges: the unnoticed human efforts essential for these robots' seamless function in public spaces. However, by spotlighting the pivotal role of human-robot interaction, new research by the University of Nottinham not only addresses this challenge but also paves the way for effective policy and design interventions, ensuring the successful integration of autonomous delivery systems globally. Dr. Alan Chamberlain explores the intricate landscape of responsible innovation in global settings, addressing hurdles like varied perceptions of responsibility and concerns about potential consequences. His advocacy emphasizes inclusive dialogue, cultural awareness, and leveraging technology to amplify the voices of marginalized communities, ultimately striving for positive transformation and the advancement of responsible practices worldwide. Almost 18% of employment in the East Midlands is directly linked to the food chain. New investment will enable collaboration with businesses to develop alternative protein foods including cultivated meat, plant-based, and insect-based products. The University of Nottingham and Nottingham City Council have teamed up with creative research company, Hello Lamp Post, to introduce interactive, playful, talking street furniture that will explore attitudes to climate change and sustainability. The University of Nottingham has been awarded a prestigious Silver Engage Watermark by the National Co-ordinating Centre for Public Engagement (NCCPE). The watermark recognises the university’s commitment to involving the public in its work and the sharing of knowledge, teaching, and research. We are establishing an Observatory for Mathematical Education, which will generate data-driven research to support the national improvement of mathematics education, from the start of school to post-graduate level, with the potential to improve lives of people now and in future generations. Nottingham’s Trent Basin housing development is a model for community energy schemes. A partnership between scientists, developers, industry, the energy supply chain, city council and residents, it features hundreds of low-carbon homes and Europe’s largest community battery. For families struggling with the cost-of-living crisis, dietetics student Sophie Conant created simple recipes featuring ingredients commonly provided by foodbanks. The nutritious recipes have been designed to be cooked using just a kettle or microwave. The Rights Lab, the world's leading group of modern slavery experts, is dedicated to achieving UN Sustainable Development Goal 8.7: end slavery by 2030. Our research will be key to freeing 40 million people across the world. Our partnership with IntoUniversity is inspiring disadvantaged young people reach their potential. We have supported almost 17,000 pupils in Nottingham to do well at school and achieve, through mentorship and providing places to learn and explore. Increasing numbers of child refugees led to our experts setting up a multi-stakeholder group to help bring displaced young people back into education. The Hub for European Refugee Education informs policy, supports educators and builds hope by promoting integration and inclusion. Inhaling smoke from cooking on wood fires or stoves causes ten times as many deaths as malaria. Such smoke is also a leading source of CO2 emissions. Our Clean Cooking project in Malawi explores sustainable technologies to reduce this toll on people and the planet. The risk of flooding is becoming ever more serious, both in the UK and across the globe, and the challenge of protecting our homes and cities is becoming increasingly important. We work with communities to protect them against flood risk and make them greener, healthier places to live. Eating disorders are serious and complex psychiatric disorders, and they can prove fatal – anorexia has the highest mortality rate of all mental health conditions. Our research has created a bridge between science and the arts and humanities to help address this challenge. We help people, who may be struggling to express their fears, find a voice and feel listened to, while our findings inform the responses of healthcare practitioners. Our School of Mathematical Sciences and the East Midlands Education Trust have teamed up to encourage more students from under-represented backgrounds to study STEM subjects. The University of Nottingham Maths School is open to 16–19-year-olds and aims to increasing diversity and widen opportunity within the fields of science, technology, engineering, and mathematics. Our research has improved the lives of elephants held in captivity worldwide. Dr Lisa Yon of the School of Veterinary Medicine and Science was tasked by the UK government to work in partnership with UK zoos and safari parks to better understand how to improve the welfare of the elephants in their care. She led the development of a tool that lets zookeepers, mahouts, and other animal managers use an elephant’s behaviour to judge their welfare. Captive elephant facilities worldwide are starting to use this tool to monitor and improve their elephants’ welfare. In Kenya, we’re exploring how schools could serve as clean energy hubs, generating, storing and distributing sustainable power, while promoting education and awareness of sustainability and acting as a model of empowerment for low-income communities. Working with local charity Emmanuel House, the university provides an on-campus winter shelter for people affected by homelessness. Last winter, we provided almost 4000 nights’ protection for more than 100 people."
        }
    ],
    "pdf_files": []
}