{
    "url": "https://www.nottingham.ac.uk/ways-to-change-the-world/sustainability.aspx",
    "content": [
        {
            "p": "The University of Nottingham is at the forefront of sustainable food process engineering, leading global innovation through pioneering research and industry partnerships. As the only UK institution offering an accredited MSc in Food Process Engineering, Nottingham is transforming food systems by reducing waste, enhancing sustainability, and aligning production with human health needs. The University of Nottingham is spearheading maritime decarbonization through the five-year funded MariNH3 programme, exploring ammonia as a sustainable fuel. By leading major research initiatives and partnering in the UK's Clean Maritime Research Hub, Nottingham is driving the transition to a net-zero maritime industry. Scientists have discovered how to potentially design root systems to grow deeper. Not only will this help crops become more resilient by being able to better reach water and nutrients, it could develop ways to capture carbon deeper in soil. Tundra is particularly sensitive to climate change, and as the Artic warms these treeless regions release more carbon due to the increased metabolic activity of soil and plants. An international study is revealing the global impact of such ‘ecosystem respiration’. Floods have devastating consequences for millions of people around the world, with rural communities being particularly vulnerable. Finding ways of reducing flood risk and collaborating with communities to help them become more resilient is a critical challenge. Indonesia’s ambition to be southeast Asia’s electric vehicle powerhouse is a cornerstone of its net zero commitment. The University of Nottingham, a key partner in growing the country’s EV infrastructure and skills base, is helping deliver this green transport revolution. We need highly trained people to roll out net zero technologies across society and the economy. Universities for Nottingham, a strategic partnership between the University of Nottingham and Nottingham Tent University, is working with industry partners to secure the next generation of innovators who will help deliver a prosperous, sustainable future. The University of Nottingham is the only UK member of Chile’s Institute of Clean Technologies and is helping the South American country find innovative ways to minimize the environmental impact of its globally significant mining industry. Hidden hunger, a lack of essential micronutrients in diets, plagues millions in sub-Saharan Africa and south Asia. The University of Nottingham is part of an international partnership, funded by the Bill and Melinda Gates Foundation, tackling this global challenge. Research by Dr Tengwen Long demonstrates the far-reaching impact of the long, complex interaction between humans and the environment. China’s booming construction industry produces huge amounts of waste soil, as excavators clear earth for building foundations and infrastructure. Now researchers are finding ways to make dirt pay, while protecting the environment. Countless millions of tonnes of rice husks are discarded by farmers throughout Asia. Researchers at the University of Nottingham Ningbo China ask: what if these grains could be turned into a ‘wonder material’ and deliver new cancer treatments? Air pollution is a threat to all of us, both inside and outside the home. The University of Nottingham Ningbo China’s Natural Resources and Environment Research Group is helping to control many different kinds of airborne pollutants, taking on a serious environmental challenge. Climate change is the gravest threat to humanity’s long-term prosperity. To keep global warming to below 2 ⁰C, strategic planning methods for policymaking are essential. China’s first zero-carbon building, the Centre for Sustainable Energy Technologies, embodies how researchers at the University of Nottingham Ningbo China are using cross-disciplinary expertise to create spaces that are good for both people and the environment. Biodiversity is essential for human well-being but is increasingly threatened. Dr. Linjun Xie of the University of Nottingham Ningbo China addresses this through the IPBES, promoting urban nature-based solutions like green infrastructure. Her work influences policy and aims to mainstream these solutions globally, incorporating diverse perspectives for local adaptation. The University of Nottingham’s strategic global partnership with the University of Adelaide has deepened our commitment to work together to address the challenges in Global Food Systems, Intelligent Health and Sustainable Futures. Our Human Rights Law Centre engages with policymakers, international organisations and society and its research exploring challenges and influences legislation on such issues as forced migration and the rights of children. Soya is used in animal feed and is linked to deforestation in South America. By exploring the potential of sustainable sources of protein, we’re helping to transform the UK animal feed industry and lower dairy farming’s carbon hoofprint. The Living Deltas project is assessing the aquatic health of delta systems in southeast Asia. By tracking pollution across the Ganges-Brahmaputra, Mekong and Red River deltas, we can help policymakers conserve these vital ecosystems. University researchers are delivering a project that will inform the retrofit of Nottingham’s existing housing stock to improve energy efficiency and bring the city closer to its 2028 target for net zero emissions. We created the world’s first micro prospectus – the first edition alone saved 72 tonnes of paper, 18,000kg of CO2 and 54,000 litres of water in processing the paper, enough to keep every student at our university hydrated for more than six weeks. A collaboration between researchers, residents and the city council, plus housing developers, industry and the energy supply chain, is supporting a sustainable housing development, which is a model for community energy schemes and greener cities. We told ‘coming out’ stories at the University of Nottingham, with a series of videos giving students and staff the opportunity to share their experiences and celebrate our LGBTQIA+ community. We are a leading partner in Europe’s Clean Sky 2 aviation research programme, and with partners including Boeing, Airbus, Rolls-Royce and Leonardo our ambition is to make the East Midlands the world’s foremost location for low-carbon aerospace innovation. Modern slavery experts at Nottingham and partners including the Gangmasters and Labour Abuse Authority are working to promote ethical labour and end exploitation in the UK construction industry. Millions of people in sub-Saharan Africa lack access to reliable and affordable energy. An international partnership featuring researchers from the University of Nottingham hopes Nairobi’s community-based, green energy hubs will be a model to address this challenge. We work with partners in Nottingham and across the world to show that protecting communities against flood risk can also make them greener, healthier and more pleasant places to live. We support the STEM Belle programme, which empowers young women from schools in Nigeria, Ghana and Pakistan and seeks to remove the barriers they face in going on to education and training in science, technology, engineering and mathematics. We pioneer the teaching of philosophy in primary schools, transforming the way that children across the East Midlands are taught. Professor Andrew Fisher’s outreach work in primary schools has led to changes in educational culture and gives pupils a voice. Our strategic alliance with the Nottingham University Hospitals NHS Trust underlines our capacity to address healthcare challenges. By driving scientific discovery through to clinical application, we accelerate access to innovative drugs, devices and diagnostics. Researchers at University of Nottingham Business School are working with food sharing app OLIO, supermarkets and local authorities to measure food poverty in the UK by creating localised, predictive digital mapping of food insecurity. Working with local charity Emmanuel House, the university has renewed its commitment to provide an on-campus winter shelter for people affected by homelessness. Last winter, we provided almost 4000 nights’ protection for more than 100 people. The University of Nottingham's East Midlands Airport Green Futures Study addresses the global challenge of airport decarbonization by leveraging its expertise to analyze energy usage and stakeholder dynamics, developing pathways for adopting green technologies like electrification and hydrogen to achieve net-zero emissions. Researchers have developed a groundbreaking method to convert CO2 into methanol using sunlight and copper atoms. This breakthrough, achieved by an international team including scientists from the University of Nottingham, offers a promising solution for producing eco-friendly fuels and reducing greenhouse gas emissions. As we continue our journey to net zero photovoltaic (PV) production is expected to increase as a sustainable alternative. PV relies on the weather and batteries to ensure a consistent level of input and AI weather forecasting has a crucial role to play. Ningbo is the world’s busiest port, handling more cargo than any other, there are emissions from the diesel engines of thousands of cargo ships with an environmental price. New technology invented by scientists at the University of Nottingham Ningbo China would allow ships to switch to cleaner electric batteries as they manoeuvre in and around port. Manufacturing processes have a significant impact on the environment. OMNIFACTORY at the University of Nottingham has been set-up to develop the next generation of smart, highly efficient factories that will contribute to the net-zero agenda. Out-of-service planes are left to decay in ‘aircraft graveyards’ and the aviation industry’s carbon footprint extends much further than simply emissions from flight. Researchers at the University of Nottingham, Institute for Aerospace Technology are working on developing solutions. For students, the climate crisis is perhaps the most pressing issue of our time. By incorporating sustainability into teaching across the curriculum, and equipping undergraduates with the tools to critically assess this challenge, our alumni will go on to help deliver solutions. We are part of an international group of experts studying links between the global water cycle over the past 2,000 years and global temperatures. These unprecedented insights could tell us what to expect in a warmer future world. With this comprehensive view of the changes in streamflow and soil moisture, researchers are better equipped to investigate the causes and consequences of the changes in the freshwater cycle. Almost 18% of employment in the East Midlands is directly linked to the food chain. New investment will enable collaboration with businesses to develop alternative protein foods including cultivated meat, plant-based, and insect-based products. By partnering and sharing knowledge,, our researchers are helping Nottinghamshire firm Kingsmill Industries innovate and expand into new global markets with its pioneering electric vehicle supply equipment. Faculty of Engineering PhD student Diret Bitrus Tang'an triumphed in a global competition that challenges young researchers to communicate the significance of their work in just three minutes. Diret is addressing environmental challenges in the Niger Delta and his success underlines the power of research to cross borders and make an impact. The UK food industry operates a network of around 84,000 refrigeration units to transport perishable goods. The H2Cool project aims to decarbonise the UK's cold food chain by developing dual-use energy storage technology, capable of delivering hydrogen to a fuel cell and generating direct cooling for refrigeration. A Nottingham researcher has helped to create a growing global network of academics dedicated to securing net-zero aviation. The group focuses on innovative technologies for electrification of aircraft and collaborates with policymakers and industry to accelerate change. The University of Nottingham is leading the UKs largest trial to evaluate the viability of a material called biochar to store carbon from the atmosphere to counter the impact of climate change. In the largest research programme of its kind in the world, we have helped show how the battery life and efficiency of batteries in electric vehicles could be improved by optimising EV charging to the national grid. For families struggling with the cost-of-living crisis, dietetics student Sophie Conant created simple recipes featuring ingredients commonly provided by foodbanks. The nutritious recipes have been designed to be cooked using just a kettle or microwave. Inhaling smoke from cooking on wood fires or stoves causes ten times as many deaths as malaria. Such smoke is also a leading source of CO2 emissions. Our Clean Cooking project in Malawi explores sustainable technologies to reduce this toll on people and the planet. Turning tiny flaws in diamond into incredibly sensitive quantum devices will transform the way we sense the world, unlocking unprecedented advances in health, food and every aspect of our lives. Professor Melissa Mather is pioneering this revolution. Advanced ceramic coatings for aircraft are essential to achieving net zero aviation. They allow aero engines to operate more efficiently at extreme conditions, saving fuel and cutting CO2 emissions. Our research uses artificial intelligence and green chemistry to create advanced ceramic coatings for the next generation of air and space travel, with this complex innovation manufactured using fewer materials, at higher volumes and at a fraction of today’s costs. Meat production is one of the most significant contributors to greenhouse gases and according to a 2022 United Nations report a shift towards plant-based diets could have real impact on climate change. At the International Flavour Research Centre, our scientists are exploring plant-based meat alternative flavours, which will encourage people to eat less meat and make the food chain less damaging to our planet."
        }
    ],
    "pdf_files": []
}