{
    "url": "https://www.nottingham.ac.uk/ways-to-change-the-world/digital.aspx",
    "content": [
        {
            "p": "The University of Nottingham is spearheading maritime decarbonization through the five-year funded MariNH3 programme, exploring ammonia as a sustainable fuel. By leading major research initiatives and partnering in the UK's Clean Maritime Research Hub, Nottingham is driving the transition to a net-zero maritime industry. Researchers, including a team from the University of Nottingham, are developing 'digital twin' heart models to improve monitoring for pulmonary arterial hypertension (PAH) patients. The £8 million project will create real-time, personalized virtual hearts to better track disease progression and treatment responses, aiming to enhance and scale personalized cardiac care within the NHS. The University of Nottingham and Strategic Innovation Ltd have launched a 26-month Knowledge Transfer Partnership to revolutionize AI-assisted consumer insights for social good. This collaboration aims to enhance data capture and analysis in the food and FMCG sectors, leveraging advanced AI and NLP techniques to drive sustainable, data-driven decisions and promote informed, socially beneficial outcomes. University researchers teamed up with BlueSkeye AI to road test technology that detects when drivers are in danger of falling asleep at the wheel. The EU-validated tests at our driving simulation facilities will allow the drowsiness monitoring technology to be rolled out in Europe, making roads safer. Amid the surge of autonomous delivery systems, a critical challenge emerges: the unnoticed human efforts essential for these robots' seamless function in public spaces. However, by spotlighting the pivotal role of human-robot interaction, new research by the University of Nottinham not only addresses this challenge but also paves the way for effective policy and design interventions, ensuring the successful integration of autonomous delivery systems globally. Todd Landman and Ben Lucas, Managing Director of 3DI at the University of Nottingham, explore the global impact of digital advancements on human rights. They discuss inclusive financial technology, leveraging data for good, protecting freedom of thought in the digital age, and the need for ethical regulations. This research emphasizes the importance of balancing technological progress with human rights, ethics, and accountability to make a positive impact worldwide. People with cystic fibrosis are vulnerable to an infection that causes further lung damage. A quick, simple test developed by our experts is closer to being available for use at home, with the potential of protecting thousands of people worldwide. AI is having a transformative impact on every aspect of our lives, including education. Experts from Nottingham are working to ensure artificial intelligence is used safely and responsibly by teachers, trainers and students. Research by Nottingham University Business School stresses the importance of iodine awareness in transitioning to plant-based diets. The study highlights potential health risks related to deficiencies and emphasizes the need to check iodine levels in alternative milk products to make informed dietary choices. The University of Nottingham and Nottingham City Council have teamed up with creative research company, Hello Lamp Post, to introduce interactive, playful, talking street furniture that will explore attitudes to climate change and sustainability. There are significant barriers to music-making for disabled musicians, researchers have developed a musical robot that can help musicians with disabilities to improvise and access instruments in a way that hasn’t previously been possible. 3D printing allows biological pills to be delivered quickly and cheaply to individual patients, or assembles ‘living’ plasters to speed up healing. Our researchers are helping manufacturers and clinicians deliver a revolution in personalised healthcare. In the largest research programme of its kind in the world, we have helped show how the battery life and efficiency of batteries in electric vehicles could be improved by optimising EV charging to the national grid. A snake-like robot, developed by our engineers and used by industry to carry out remote-controlled repairs in tight, inaccessible places inside jet engines or nuclear plants, is now being developed for use in cancer surgery. How do pedestrians react to driverless cars? Our researchers explored the visual prompts that could help us help cross safely as more driverless cars take to the roads. We have researched tablet technology designed by onebillion and implemented by Imagine Worldwide that is helping to raise numeracy and literacy skills of disadvantaged children in the UK and globally. The risk of flooding is becoming ever more serious, both in the UK and across the globe, and the challenge of protecting our homes and cities is becoming increasingly important. We work with communities to protect them against flood risk and make them greener, healthier places to live. Inhaling smoke from cooking on wood fires or stoves causes ten times as many deaths as malaria. Such smoke is also a leading source of CO2 emissions. Our Clean Cooking project in Malawi explores sustainable technologies to reduce this toll on people and the planet. Turning tiny flaws in diamond into incredibly sensitive quantum devices will transform the way we sense the world, unlocking unprecedented advances in health, food and every aspect of our lives. Professor Melissa Mather is pioneering this revolution. Glioblastoma is an elusive and formidable form of brain cancer, with low survival rates. Our researchers have discovered that electrically charged gold nanoparticles trigger self-destruction of glioblastoma cells, while leaving healthy cells unscathed. This world-first ‘quantum therapeutic’ could be delivered to the tumour as a spray or injection during brain surgery. Advanced ceramic coatings for aircraft are essential to achieving net zero aviation. They allow aero engines to operate more efficiently at extreme conditions, saving fuel and cutting CO2 emissions. Our research uses artificial intelligence and green chemistry to create advanced ceramic coatings for the next generation of air and space travel, with this complex innovation manufactured using fewer materials, at higher volumes and at a fraction of today’s costs. Meat production is one of the most significant contributors to greenhouse gases and according to a 2022 United Nations report a shift towards plant-based diets could have real impact on climate change. At the International Flavour Research Centre, our scientists are exploring plant-based meat alternative flavours, which will encourage people to eat less meat and make the food chain less damaging to our planet. Scientists have discovered how to potentially design root systems to grow deeper. Not only will this help crops become more resilient by being able to better reach water and nutrients, it could develop ways to capture carbon deeper in soil. An MRI scan takes place every three seconds and countless millions of patients have benefited from Sir Peter’s Mansfield’s invention. Fifty years on, our innovations in medical imaging continue to revolutionise understanding of our brains and bodies."
        }
    ],
    "pdf_files": []
}