{
    "url": "https://www.nottingham.ac.uk/ways-to-change-the-world/global.aspx",
    "content": [
        {
            "p": "The University of Nottingham's design/build studio, established in 2009, addresses the need for responsible architecture and social impact through hands-on student involvement. In response to the challenges faced by rural communities, projects like the Monang PreSchool in South Africa enable students to design and construct real buildings over six weeks. This approach bridges the gap between theoretical learning and practical implementation, equipping future architects with the skills to meet community needs while fostering sustainable development. The University of Nottingham is spearheading maritime decarbonization through the five-year funded MariNH3 programme, exploring ammonia as a sustainable fuel. By leading major research initiatives and partnering in the UK's Clean Maritime Research Hub, Nottingham is driving the transition to a net-zero maritime industry. In Kenya, we’re exploring how schools could serve as clean energy hubs, generating, storing and distributing sustainable power, while promoting education and awareness of sustainability and acting as a model of empowerment for low-income communities. Tundra is particularly sensitive to climate change, and as the Artic warms these treeless regions release more carbon due to the increased metabolic activity of soil and plants. An international study is revealing the global impact of such ‘ecosystem respiration’. Researchers have developed a groundbreaking method to convert CO2 into methanol using sunlight and copper atoms. This breakthrough, achieved by an international team including scientists from the University of Nottingham, offers a promising solution for producing eco-friendly fuels and reducing greenhouse gas emissions. Dr. Alan Chamberlain explores the intricate landscape of responsible innovation in global settings, addressing hurdles like varied perceptions of responsibility and concerns about potential consequences. His advocacy emphasizes inclusive dialogue, cultural awareness, and leveraging technology to amplify the voices of marginalized communities, ultimately striving for positive transformation and the advancement of responsible practices worldwide. Soya is used in animal feed and is linked to deforestation in South America. By exploring the potential of sustainable sources of protein, we’re helping to transform the UK animal feed industry and lower dairy farming’s carbon hoofprint. With this comprehensive view of the changes in streamflow and soil moisture, researchers are better equipped to investigate the causes and consequences of the changes in the freshwater cycle. A global, interdisciplinary team led by the University of Nottingham, funded by Cancer Grand Challenges, aims to address cancer inequalities in populations of African descent by gathering data on genetics, environment, and social factors to develop tailored prevention and treatment strategies. The university has been awarded five centres for doctoral training, as part of £1 billion investment by the Engineering and Physical Sciences Research Council. We will train scores of the UK’s future innovators, who will work with industry to secure sustainable solutions to benefit society and the economy. We are part of an international group of experts studying links between the global water cycle over the past 2,000 years and global temperatures. These unprecedented insights could tell us what to expect in a warmer future world. By partnering and sharing knowledge,, our researchers are helping Nottinghamshire firm Kingsmill Industries innovate and expand into new global markets with its pioneering electric vehicle supply equipment. AI is having a transformative impact on every aspect of our lives, including education. Experts from Nottingham are working to ensure artificial intelligence is used safely and responsibly by teachers, trainers and students. Faculty of Engineering PhD student Diret Bitrus Tang'an triumphed in a global competition that challenges young researchers to communicate the significance of their work in just three minutes. Diret is addressing environmental challenges in the Niger Delta and his success underlines the power of research to cross borders and make an impact. AuthorAid is a free pioneering global network that provides support for researchers in low- and middle-income countries. Dr Rebecca Dewey has been working with the platform to network, co-design science experiments and share her expertise worldwide. A Nottingham researcher has helped to create a growing global network of academics dedicated to securing net-zero aviation. The group focuses on innovative technologies for electrification of aircraft and collaborates with policymakers and industry to accelerate change. We have researched tablet technology designed by onebillion and implemented by Imagine Worldwide that is helping to raise numeracy and literacy skills of disadvantaged children in the UK and globally. The Rights Lab, the world's leading group of modern slavery experts, is dedicated to achieving UN Sustainable Development Goal 8.7: end slavery by 2030. Our research will be key to freeing 40 million people across the world. Antibiotic resistance is a global challenge. FARMWATCH, a collaboration with our scientific and industry partners in China, uses machine learning to pinpoint disease in poultry farms, reducing antibiotic treatment and lowering the risk of antibiotic resistance spreading. Inhaling smoke from cooking on wood fires or stoves causes ten times as many deaths as malaria. Such smoke is also a leading source of CO2 emissions. Our Clean Cooking project in Malawi explores sustainable technologies to reduce this toll on people and the planet. Increasing numbers of child refugees led to our experts setting up a multi-stakeholder group to help bring displaced young people back into education. The Hub for European Refugee Education informs policy, supports educators and builds hope by promoting integration and inclusion. Our research has improved the lives of elephants held in captivity worldwide. Dr Lisa Yon of the School of Veterinary Medicine and Science was tasked by the UK government to work in partnership with UK zoos and safari parks to better understand how to improve the welfare of the elephants in their care. She led the development of a tool that lets zookeepers, mahouts, and other animal managers use an elephant’s behaviour to judge their welfare. Captive elephant facilities worldwide are starting to use this tool to monitor and improve their elephants’ welfare. Meat production is one of the most significant contributors to greenhouse gases and according to a 2022 United Nations report a shift towards plant-based diets could have real impact on climate change. At the International Flavour Research Centre, our scientists are exploring plant-based meat alternative flavours, which will encourage people to eat less meat and make the food chain less damaging to our planet."
        }
    ],
    "pdf_files": []
}