{
    "url": "https://www.nottingham.ac.uk/ways-to-change-the-world/index.aspx",
    "content": [
        {
            "p": "Our pioneering researchers deliver solutions to complex global challenges. Our people work with communities, locally and globally, to make a difference. Through our discoveries, teaching and all that we do, we’re committed to helping achieve the United Nations Sustainable Development Goals. As a leading university we’re proud to share 100 ways we’re changing the world. Over the coming year we will be sharing 100 ways we have made a difference to people’s lives and are helping to secure a fairer world. The University of Nottingham is at the forefront of sustainable food process engineering, leading global innovation through pioneering research and industry partnerships. As the only UK institution offering an accredited MSc in Food Process Engineering, Nottingham is transforming food systems by reducing waste, enhancing sustainability, and aligning production with human health needs. The University of Nottingham, the birthplace of MRI and with a longstanding heritage in MRI research, is set to advance brain and disease research with the development of the UK's most powerful MRI scanner. This initiative, supported by UKRI and involving collaboration with Tesla Engineering and Philips, highlights Nottingham's pivotal role in enhancing global biomedical imaging and healthcare outcomes. As we continue our journey to net zero photovoltaic (PV) production is expected to increase as a sustainable alternative. PV relies on the weather and batteries to ensure a consistent level of input and AI weather forecasting has a crucial role to play. The University of Nottingham is leading the UKs largest trial to evaluate the viability of a material called biochar to store carbon from the atmosphere to counter the impact of climate change. The University of Nottingham’s strategic global partnership with the University of Adelaide has deepened our commitment to work together to address the challenges in Global Food Systems, Intelligent Health and Sustainable Futures. Our Human Rights Law Centre engages with policymakers, international organisations and society and its research exploring challenges and influences legislation on such issues as forced migration and the rights of children. Soya is used in animal feed and is linked to deforestation in South America. By exploring the potential of sustainable sources of protein, we’re helping to transform the UK animal feed industry and lower dairy farming’s carbon hoofprint. At the University of Nottingham, we address the complex challenges facing our planet and are committed to making an outstanding contribution to the United Nations Sustainable Development Goals (SDGs). The SDGs are a call to action to secure a safer, fairer and more sustainable future. Discover how the the University of Nottingham is playing a leading role in tackling these global challenges. There are so many wonderful world changing projects taking place at the University of Nottingham, both past and present and we would like to hear your favourite world changing story. Your donations can help a talented individual unlock their potential at the University of Nottingham. The Cascade program funds innovative student-led projects around the globe."
        }
    ],
    "pdf_files": []
}