{
    "url": "https://www.nottingham.ac.uk/ways-to-change-the-world/health-and-wellbeing.aspx",
    "content": [
        {
            "p": "Researchers, including a team from the University of Nottingham, are developing 'digital twin' heart models to improve monitoring for pulmonary arterial hypertension (PAH) patients. The £8 million project will create real-time, personalized virtual hearts to better track disease progression and treatment responses, aiming to enhance and scale personalized cardiac care within the NHS. The University of Nottingham is at the forefront of sustainable food process engineering, leading global innovation through pioneering research and industry partnerships. As the only UK institution offering an accredited MSc in Food Process Engineering, Nottingham is transforming food systems by reducing waste, enhancing sustainability, and aligning production with human health needs. A hair-thin endoscopic probe could help doctors discover and treat cancer earlier. Its 3D imaging reveals if cells are soft, an early indicator of cancer, or have hardened to form tumours, enabling tests to be carried out at single cell level in the body for the first time. A heart disease calculator, developed using data from 16 million UK adults, can more accurately predict the risk of cardiovascular disease. QR4 identifies high-risk patients missed by current tools and by improving early detection has the potential to save countless lives. University researchers teamed up with BlueSkeye AI to road test technology that detects when drivers are in danger of falling asleep at the wheel. The EU-validated tests at our driving simulation facilities will allow the drowsiness monitoring technology to be rolled out in Europe, making roads safer. Around 3.5 million people in the UK alone live with a rare condition. Our Rare Disease Research Network brings together more than 50 academics, who work with the NHS to deliver innovative treatments that make a real difference to patients living with rare conditions. Experts at the University of Nottingham are joining forces with Stand Against MND and the MND Association, to carry out research to better understand motor neurone disease (MND) mechanisms – the biochemical processes that go wrong – in order to speed up the race to find new treatments. A global, interdisciplinary team led by the University of Nottingham, funded by Cancer Grand Challenges, aims to address cancer inequalities in populations of African descent by gathering data on genetics, environment, and social factors to develop tailored prevention and treatment strategies. People with cystic fibrosis are vulnerable to an infection that causes further lung damage. A quick, simple test developed by our experts is closer to being available for use at home, with the potential of protecting thousands of people worldwide. Endoscopic screening is an effective way of detecting gastrointestinal cancers. By developing an ultraminiature, high-resolution camera that is cost-effective and fits inside standard endoscopes, our researchers hope to deliver high-quality screening to many more patients. New anticancer agents are essential to reduce current treatment side effects. Researchers are working to develop a new targeted drug delivery system for a range of diseases to reduce side effects. Research by Nottingham University Business School stresses the importance of iodine awareness in transitioning to plant-based diets. The study highlights potential health risks related to deficiencies and emphasizes the need to check iodine levels in alternative milk products to make informed dietary choices. The University of Nottingham and NIHR Leicester Biomedical Research Centre have collaborated to identify individuals at higher risk of developing tuberculosis (TB). They used advanced imaging tools and an innovative bacteriophage-based assay called Actiphage. The research promises faster detection, targeted treatment, and improved disease control, offering hope for more effective global efforts to reduce TB transmission and improve public health outcomes. Scientists have made a breakthrough in understanding how predatory bacteria capture other bacteria. This discovery opens up new possibilities for combatting healthcare, environmental, and food-related challenges. It could lead to targeted antibiotics and solutions for bacterial issues, improving human health and environmental sustainability. We have developed the world’s first smart breathing tube for mechanically ventilated patients. Now human trials of the tubes, which use optical fibre sensors to adjust pressure on the windpipe and reduce risk of injury, could help transform monitoring of seriously ill and anesthetised patients. Tissue-on-chip technologies developed by biomedical engineers and medical researchers at Nottingham are key to an international drive to speed up drug development and replace animal testing. Researchers have been awarded funding to develop new drugs to help people with Diabetes to make their own insulin. Improving the survival of donor islet transplant could pave the way for a cure for type 1 diabetes. We developed the world’s first wearable brain scanner, which is set to transform understanding of neurological and psychiatric disorders such as autism, epilepsy and dementia. Professor Matt Brookes, who leads the team behind this revolutionary technology, was awarded an OBE in the 2024 New Year Honours. A wrist device has been developed and successfully trialled to control tics caused by Tourette's. The research team have won the STEM Research Project of the Year Times Higher Education (THE) Award for their life changing work. An MRI scan takes place every three seconds and countless millions of patients have benefited from Sir Peter’s Mansfield’s invention. Fifty years on, our innovations in medical imaging continue to revolutionise understanding of our brains and bodies. Eating disorders are serious and complex psychiatric disorders, and they can prove fatal – anorexia has the highest mortality rate of all mental health conditions. Our research has created a bridge between science and the arts and humanities to help address this challenge. We help people, who may be struggling to express their fears, find a voice and feel listened to, while our findings inform the responses of healthcare practitioners. Meat production is one of the most significant contributors to greenhouse gases and according to a 2022 United Nations report a shift towards plant-based diets could have real impact on climate change. At the International Flavour Research Centre, our scientists are exploring plant-based meat alternative flavours, which will encourage people to eat less meat and make the food chain less damaging to our planet. A lack of access to sanitary products due to financial constraints, is becoming a growing issue across low-income households in the UK. Project Period provides free sanitary products for students and staff across our campuses. Glioblastoma is an elusive and formidable form of brain cancer, with low survival rates. Our researchers have discovered that electrically charged gold nanoparticles trigger self-destruction of glioblastoma cells, while leaving healthy cells unscathed. This world-first ‘quantum therapeutic’ could be delivered to the tumour as a spray or injection during brain surgery. For families struggling with the cost-of-living crisis, dietetics student Sophie Conant created simple recipes featuring ingredients commonly provided by foodbanks. The nutritious recipes have been designed to be cooked using just a kettle or microwave. Antibiotic resistance is a global challenge. FARMWATCH, a collaboration with our scientific and industry partners in China, uses machine learning to pinpoint disease in poultry farms, reducing antibiotic treatment and lowering the risk of antibiotic resistance spreading. Inhaling smoke from cooking on wood fires or stoves causes ten times as many deaths as malaria. Such smoke is also a leading source of CO2 emissions. Our Clean Cooking project in Malawi explores sustainable technologies to reduce this toll on people and the planet. A snake-like robot, developed by our engineers and used by industry to carry out remote-controlled repairs in tight, inaccessible places inside jet engines or nuclear plants, is now being developed for use in cancer surgery. 3D printing allows biological pills to be delivered quickly and cheaply to individual patients, or assembles ‘living’ plasters to speed up healing. Our researchers are helping manufacturers and clinicians deliver a revolution in personalised healthcare. We’ve collaborated with water management company Angel Guard to introduce the world’s first anti-biofilm polymer. This revolutionary material inhibits bacterial biofilm formation in water systems, which has the potential to save thousands of lives by reducing infections."
        }
    ],
    "pdf_files": []
}