{
    "url": "https://www.nottingham.edu.my/Wellbeing/Induction-for-new-Students/Induction.aspx",
    "content": [
        {
            "p": "University Counselling services (UCS) is a free confidential service available to registered undergraduate and postgraduate students of the University. Personal Issues Academic Issues » Have a session with the counsellor » Explore issue and options available Relationship Issues (45 minutes to 1 hour) in resolving issue Some of the common issues explored in the sessions: • Stress • Anxiety or worries • Adjustment to university life Sessions are available on Monday-Friday, 9.30 am- 4.30 pm (1.00 pm - 2.00 pm Lunch Break) If you have an enquiry or woulld like to make an appointment for a session kindly email the counsellors: Raja Nadirah Raja.Nadirah@nottingham.edu.my Sophia Hanim Sophia.Hanim@nottingham.edu.my For more information on counselling services please click on the link: https://www.nottingham.edu.my/Wellbeing/Counselling/UniversityCounsellingService.aspx The Mental Health Advisory service is a free confidential service available to registered undergraduate and postgraduate students of the University. The Mental Health Advisory Service provides a range of services to help students experiencing mental health issues. These include assessments to understand the issues and level of support needed, one-to-one support and referral letters to internal and external support professionals. Email to request for » Have a session with Mental Health » Explore issues and options a session Advisor (30 minutes -1 hour) Some of the common issues explored in the sessions: • Depressions • Anxiety • Panic Disorder • Trauma Sessions are available on Monday-Friday, 9.30 am-4.30 pm (1 pm- 2pm lunch break) If you have an enquiry or would like to make an appointment for a session, kindly e-mail the mental health advisory. Vasu Krishnan Vasu.Krishnan@nottingham.edu.my Ying Boo Ee BooEe.Ying@nottingham.edu.my For more information on mental health advisory services please click on the link: https://www.nottingham.edu.my/Wellbeing/Mentalhealth/index.aspx We offer reasonable adjustments such as: • Adjustment to examination • Adjustment to coursework • Accessible accommodation • Accessible parking • Accessible facilities • Time-tabling • Disability liasion officer network in individual school Students who have: • Physical disability: hearing impairment, student's who using wheelchair and etc. • Mental health: Schizophrenia, Bipolar Disorder, Depression, Anxiety Disorder, Obsessive Compulsive Disorder or Impulse-control Disorder and etc. • Learning differences: ADHD, Asperger's syndrome, Dyslexia, Dyspraxia and etc. • Long term medical condition: Epilepsy, IBS, Diabetes and etc. A registered university student with a long term (12 months or more) disability and to be supported with a latest medical evidence. Refer to our Medical Evidence Policy for more information. https://www.nottingham.edu.my/Wellbeing/Disability/MedicalEvidencePolicy.aspx Contact us for more information: Disability@nottingham.edu.my telephone: +6 (03) 8924 8000 fax: +6 (03) 8924 8001"
        }
    ],
    "pdf_files": []
}