{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/case-studies/netacea-limited",
    "content": [
        {
            "p": "Advanex Europe Nottinghamshire-based Advanex Europe is the European headquarters of global precision engineering solutions experts Advanex Group. The company has operations in 23 countries and produces a range of components used in a variety of markets, including: compression springs, extension/tension springs, insert mouldings, insert collars, torsion wire forms, pressings, deep drawn metal tubes, KATO® CoilThread® inserts and medical precision springs. Part of the Advanex Group’s international growth plans involved the purchase of a Japanese company specialising in deep drawing, an advanced metal-forming process. Since its acquisition, a key focus for Advanex was to transfer deep drawn production from the Japanese company to Advanex Europe. However, Advanex Europe needed support to develop its own deep drawn expertise in the UK. Our Advanced Manufacturing Technology Group worked alongside Advanex Europe in a two-year Knowledge Transfer Partnership (KTP). The original aim of the KTP was to develop and embed a simulation/scientific-based approach to design for the tooling and manufacture of metal components in order to optimise flow and minimise defects. The project delivered a working Finite Element Analysis model of multi-stage deep drawing, giving an understanding of the effects of each material and tooling parameter on the deep drawing process, alongside existing practical experience from Japan. What we provided, that Advanex Europe did not have, was an in-depth understanding of the deep drawing process – with the support of the KTP they now have a great deal of understanding that allows Advanex Europe to take a customer drawing and design the required tooling to manufacture the part. Our KTP has enabled the successful transfer of deep drawn production to Europe and helped Advanex Europe develop its relationship with Japanese colleagues to support this technology. “We are now in a far stronger position to offer deep drawn products to key markets such as aerospace, automotive and medical,” said Advanex Europe Managing Director Ian Beardsmore. “We have ambitious plans for the next five years and developing deep drawn business is an integral part of our strategy.” However, an unexpected benefit to the company was the recruitment of KTP Associate, Subha Tamang, who has filled the knowledge and skills’ gap that would have been created by a senior technician retiring from Advanex Europe after 40 years’ service. “The collaboration enabled a really effective handover from our colleague to the KTP Associate and now R&D Engineer, saving us time and money,” added Mike Ribeaux, Product and Process Development Manager at Advanex Europe."
        }
    ],
    "pdf_files": []
}