{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/case-studies/pipers-crisps",
    "content": [
        {
            "p": "Pipers Crisps Flavour quality and stability is a key challenge for any successful food product. Pipers Crisps is an award-winning manufacturer of premium crisps based in Lincolnshire. They approached the University to find out more about the science behind their products and to help them enhance the flavour and to keep their crisps fresher for longer. The University has a broad range of expertise in food sciences. We collaborated with Pipers Crisps on two Knowledge Transfer Partnerships (KTP) - a part-funded programme that helps businesses to grow through innovation. KTPs enabled our experts to apply their knowledge to strategic challenges for Pipers Crisps. Led by Dr Deepa Agarwal, an expert in food structure, flavour and product development, and Professor Ian Fisk, an expert in food chemistry, our research team used the University’s sensory labs and food science facilities to understand the flavour profile and stability of Pipers Crisps products. We also delivered a detailed training and selection programme to help Pipers Crisps to establish an in-house team of specialist tasters who support product development and day-to-day quality control. With the help of advanced data analysis, we were able to optimise cooking times and temperatures to minimise waste and enhance shelf life without compromising taste. Our research led to production changes enabling Pipers Crisps to increase their products’ shelf life from 28 to 40 weeks, and to reduce oil wastage This opened new opportunities to export products to markets including South East Asia and the US. Deepa also helped Pipers Crisps to introduce two new flavours to their product range; Jalepeno and Dill and a vegetarian crisp, Wild Thyme and Rosemary. Pipers Crisps now employs 80 people and exports products around the world. The company has recently been acquired by PepsiCo. - - - Find out if a Knowledge Transfer Partnership could help your business. Contact our team at ktp@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}