{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/case-studies/gsk",
    "content": [
        {
            "p": "GSK Lung diseases are responsible for more than 700,000 hospital admissions and over six million inpatient bed-days in the UK each year at a significant cost to the NHS. Chronic obstructive pulmonary disease (COPD) is the name for a group of lung conditions that cause breathing difficulties affecting an estimated 1.2 million people in the UK. New medicines are essential to improve the quality of life for COPD sufferers. Genetics play an important role in determining who will develop COPD but we don’t yet understand why there is such variation in how severe the disease can be and why some people experience a more rapid worsening of symptoms than others. GSK is a science-led global healthcare company, leveraging genetic data to identify novel treatments for patients and to understand the potential for drugs in the early stages of clinical development. The University of Nottingham developed a strategic research collaboration with GSK and the University of Leicester. We combined large-scale computational analysis and laboratory experiments to understand the genetic and biological reasons for disease progression. Genetic data can be used to identify people based on their gene profile to suggest the medicine types for which they are most suitable. In addition, this research project uses the genetic profiles of COPD patients to identify novel treatments that target the underlying cause of disease. New drug development is a long process that can be improved when academics and industry work together. Our work is helping GSK to identify promising approaches for the development of new medicines, in addition to providing academic outputs and strengthening our history of collaboration with GSK. The collaboration will hopefully accelerate discovery and development of innovative treatments for COPD. Ultimately, this work will help doctors to diagnose earlier and prescribe more targeted treatments for patients, leading to better outcomes and saving the NHS money. - - - Interested in finding out more? Visit the website for our Nottingham Biomedical Research Centre."
        }
    ],
    "pdf_files": []
}