{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/spacefacilities.aspx",
    "content": [
        {
            "p": "This is the place where you can access world-class facilities, from smart manufacturing to sustainable chemistry. It's a place to call home – base your business here and immerse yourself in excellence and inspiration. UNIP is the place where innovation thrives. Based on the Jubilee Campus, UNIP provides co-location space for businesses and University of Nottingham spin-out companies who want to collaborate with the university on research projects, and utilise the talents of our students and graduates. Join the UNIP community We offer three remarkable campuses that cater to a diverse range of requirements. Whether you’re planning professional meetings, exhibitions, or looking for the ideal venue to host a conferences our venues provide limitless possibilities. Explore our campus venues Our research facilities are catalysts for innovation. We're committed to addressing the key challenges of our age through collaborative research and partnerships that brings together academics from across subject areas. If you're looking for ground-breaking research facilities, then you've come to the right place. From revolutionising the world of manufacturing, with OMNIFACTORY, a state-of-the-art concept factory, to translating zero carbon research into real-world solutions, our internationally leading experts are solving industrial challenges. Our research institutes, groups, centres, and clusters work closely with industry to turn world-class research into reality. Explore our Faculty of Engineering facilities We're working with industry to help supports the exploration, research and design of human-robot interaction, our Cobot Maker Space is a 99m² facility that offers ultramodern robots and equipment. With 15 research centres the Faculty of Science offer real solutions with business in mind. Explore our Faculty of Science facilities With a focus on making a real-life impact to patients and the public, we use advanced research facilities and associated expertise to underpin the cutting-edge research we do. We provide a range of services to veterinary professionals and businesses, from nutritional analysis to veterinary pathology services. Explore our Faculty of Medicine and Health Science facilities The Faculty of Social Sciences is comprised of seven major schools, each providing a range of services for business. Unlock your business potential at the Ingenuity Lab – access support, services and mentoring by experienced entrepreneurs and specialist consultants. Explore our Faculty of Social Sciences From virtual and immersive production studios and psycholinguistics labs to unique collections and historical archives, our research environments are a winning combination of personal support, facilities and collections enabling our researchers and partners to produce work of international impact. Explore our Faculty of Arts research environments"
        }
    ],
    "pdf_files": []
}