{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/develop-workforce/verified-by-uono.aspx",
    "content": [
        {
            "p": "Click on the questions below to learn more about verified by UoNO. What does 'verified by University of Nottingham Online' mean? Recipients of these digital credentials are encouraged to highlight their new skills by embedding their digital badges within their online profiles, CVs and social networks. Employers and other interested parties can check the credentials them by clicking through to view the learner’s certificate and transcript which can be freely accessed through our digital badging provider. To be 'verified by UoNO', our partners will have provided evidence to our subject experts and satisfied that: i. the scope and breadth of the learning product aligns with its stated aims and learning outcomes ii. the learning product’s activities provide suitable opportunities for learners to develop the knowledge, skills and behaviours required to achieve these outcomes iii. learners who have completed the learning can evidence that they have achieved the outcomes iv. the amount of time required to complete the learning appropriately reflects its scale and scope How is verification different to validation? The objective of verification is to provide a credible, low-friction mechanism for independent, expert-led confirmation of what a learner has learnt and the amount of time it is likely to have required to complete it. It is a way of enhancing the credibility and value of a learning product through confirmation, by a world-class university, that it can deliver for learners what is claimed. However, verification does not imply any equivalence with the credit-bearing learning provided by universities or attempt to equate the learning that has been verified with the requirements of any qualification framework, subject benchmark statement, or professional, statutory and regulatory body. Verification is distinct from validation and should not be confused with it. Validation is the formal process by which universities confer academic credit onto learning, and through which academic standards and the quality of the student experience are assured. It is regulated by the Office for Students. Validation requires formal evidencing of the alignment of learning with appropriate qualification frameworks, subject benchmark statements and the requirements of professional, statutory and regulatory bodies. Only validated learning can be awarded academic credit that can lead to a recognised qualification. What is the UoNO verification process and who is involved? The verification process has two parts: 1. A learning product review 2. A cohort outcomes confirmation The learning product review is completed by a recognised subject expert from the university. They work directly with the organisation to review each learning product’s aims, outcomes, content, resources and materials. In many cases they will also explore how the learner engages with these within the provider’s online learning platform. On completion of the review, the subject expert delivers a report recommending whether the learning product meets the criteria for verification. Where verification is recommended, a cohort outcomes confirmation is then completed. The subject expert will review a representative, anonymised sample of learner’s work across a cohort in order to confirm that there is evidence that they have achieved the product’s learning outcomes. On completion of the cohort outcomes confirmation, UoNO will request details of each learner in the cohort from the organisation and issue the digital credentials. How long does a digital credential last? Once issued, our digital credentials can be accessed through our digital badging provider. We do not time limit our digital credentials. For more information about working with University of Nottingham Online to gain verification of your learning product or information about the review process, please email us at UoN-Online@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}