{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/case-studies/browne-jacobson",
    "content": [
        {
            "p": "Browne Jacobson England has the lowest levels of literacy in the developed world (OECD 2016). And with literacy skills in the UK predicted to decrease over time, an increasing number of the adult population will struggle to read and understand insurance policy documents. Browne Jacobson, a national law firm with over 500 lawyers, felt that the quality and wording of policy drafts in the market could be significantly improved. Clearer policy wording is easier to enforce, easier to sell and less likely to lead to regulatory difficulties. Browne Jacobson worked with the University to find out what makes a policy document easier to understand, what impedes understanding and to share findings to improve practice across the industry. Our linguistic researchers based in the School of English have over 20 years' experience of collaborating with industry. Their research provides vital information on how the public use and interpret language depending on their levels of education, literacy, age, gender, ethnicity and social class. We devised a unique academic study to examine the readability of a cross-section of insurance policies from across the market. We used a number of methods including: The study by Professor Conklin, Dr Parente (School of English) and Dr Hyde (School of Law) showed that insurers’ wordings generally remain unintelligible to the vast majority (approximately 87%) of the UK adult population. All policies tested had sections that caused comprehension difficulties – with most only comprehensible by graduates. We identified practices that can systematically and significantly increase the overall readability and understanding of policy documents. The upshot of the improvements in readability is that the percentage of the UK adult population that could meaningfully understand the policy increased by some 75.6%, from 13.4% to 89%. That’s an extra 40.4 million people in the UK. The findings were presented to a roundtable of industry participants with a series of five key drafting principles identified to improve effectiveness of policy drafting across the market. Our collaboration has been shortlisted by the Insurance Times in the category of Legal Business Partner of the Year. - - - Interested in finding out more? Visit Linguistic Profiling for Professionals or email us at lipp@nottingham.ac.uk The percentage of the UK adult population that could meaningfully understand the policy increased by 75.6%."
        }
    ],
    "pdf_files": []
}