{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/degree-apprenticeships/news/university-of-nottingham-wins-degree-apprenticeship-provider-of-the-year-2024",
    "content": [
        {
            "p": "This is the first time the university has won Training Provider of the Year at the regional awards, aimed at celebrating the outstanding achievements of the apprenticeship community, demonstrating our commitment to providing impactful programmes which support the creation of a skilled workforce across England. We were awarded Training Provider of the Year because of our strong collaboration with partner employers, powerful testimonials from employers and apprentices alike and our clear examples of success, setting up local organisations for the future. We’re also pleased to announce that one of our L6 Data Science apprentices, Luca Smith from Experian, won the award for Technology and Digital Apprentice of the Year! It’s a combination of our collective efforts as the university, partner employers and apprentices that has contributed to our success. It’s been a phenomenal year for degree apprenticeships at the university and we’re not stopping yet! A few of our highlights include being the country's largest Electro-mechanical Engineering Degree Apprenticeship, our Data Scientist Degree Apprenticeship attracting more apprentices than any other provider in the East Midlands so far this year and we were the top pick for the Architect Degree Apprenticeship last year.* Not to mention, we were also rated ‘Good’ by Ofsted – it’s been a great year so far. *According to ILR data 2022-4. Hear from Lizzy Martin, Employer Engagement Manager, about how the award ceremony went: We also spoke to Dr Ria Symonds, Programme Director for the Data Science Degree Apprenticeship who said: It was an enjoyable night all round and we’re so glad to have had the opportunity to attend and collect our award in person. We had a wonderful time, and this is just the beginning – we’re looking forward to winning again next year! In the meantime, if you would like to find out more about our degree apprenticeships, get in touch with our team today. You can also watch us on Notts TV talking about our recent success."
        }
    ],
    "pdf_files": []
}