{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/services/aerospace-unlocking-potential.aspx",
    "content": [
        {
            "p": "Aerospace Unlocking Potential (Aerospace UP) is a £20M three-year project (2020 to 2022) which aims to support the aerospace supply chain in the Midlands by helping to unlock its innovation potential. The project is being delivered by the University of Nottingham and the Midlands Aerospace Alliance. Aerospace UP is supported by the European Regional Development Fund (ERDF), which helps businesses to access funding and expertise to improve their performance through innovation in all aspects of their enterprise. As a pan-Local Enterprise Partnership (LEP) project, Aerospace UP is available to SMEs in the following 8 Midlands LEP areas. There are many ways in which Aerospace UP can support SMEs, and once enrolled on the Programme, the Delivery Team will work with you to tailor a package of help based around your business needs. This package may include one or more of the following: Fully-funded support packages provided through the University’s Precision Manufacturing Centre, including: consultancy on design for manufacture, access to machines and technical staff, prototyping, metrology, toolmaking etc. It is not essential to have any particular project in mind at the beginning of your engagement with the Aerospace UP Delivery Team, but it may be useful to think beforehand about the areas where the Programme might be able to provide assistance. These might include: After checking your company is eligible to benefit from Aerospace UP, we will start your Aerospace UP journey with scoping meetings to help us better understand your business and its innovation challenges. The Delivery Team will then work closely with you to identify a package comprised of the different types of support available that is tailored to your needs. To find out more about the programme and eligibility, contact our team: AerospaceUP@nottingham.ac.uk"
        }
    ],
    "pdf_files": []
}