{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/services/continued-professional-development.aspx",
    "content": [
        {
            "p": "The world of work is evolving. And that means the skills needed to succeed in this new world are changing, too. Our continuing professional development, training and executive education will help you advance your knowledge and skills, develop your interests and deliver a deeper understanding of your subject. We offer a broad programme of MBAs, specialist training and bespoke courses, specifically designed to support you throughout your learning experience. Visit the relevant school links below to discover our range of opportunities and to book onto a course. Or contact cpd@nottingham.ac.uk to discuss how we can help you. We translate cutting-edge academic research into applied industry expertise. Visit the School of Biosciences Our Executive Education courses are for businesses, organisations, teams of individuals who want to do things differently. Visit the Business School Our programme provides an extensive range of professional development opportunities for educators. Visit the School of Education > The school provides training opportunities and masterclasses for health and social care professionals. Visit Healthcare CPD > Find your voice by enrolling in one of the language classes delivered by our Language Centre. Visit the Language Centre > We offer programmes in International Human Rights Law, and in Public Procurement Law and Policy. Visit the School of Law > Our Linguistic Profiling for Professionals team uses research in how language is used in real-life work environments to inform our training, courses and consultancy. Visit Linguistic Profiling for Professionals > Our School of Mathematical Sciences offers a distance learning MSc in Statistical Science. Visit the School of Mathematical Sciences Over the last 25 years, our professional, clinical and academic courses have gained an unrivalled national and international reputation. Visit the School of Medicine > Courses for qualified social workers and practice educators as well as customised courses for managers and leaders. Visit the School of Sociology and Social Policy Designed to develop theoretical and practical skills, our courses cover all levels, from the new graduate to the experienced practitioner. Visit the School of Veterinary Medicine and Science > If you have a specific development path you’d like your talent to follow, we can create a bespoke education programme designed around them. Contact our CPD team to discuss your requirements Email cpd@nottingham.ac.uk Tel +44 (0)115 7484352"
        }
    ],
    "pdf_files": []
}