{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/degree-apprenticeships/news/mathematics-and-educations-secondary-teacher-degree-apprenticeship-in-development",
    "content": [
        {
            "p": "The new degree apprenticeship being developed by the university will offer local education providers the opportunity to greatly increase their recruitment pool and attract a new group of talented individuals who will develop into dynamic, engaging secondary maths teachers. It will also present a new career pathway for those who don’t hold an undergraduate degree but would like to develop a deep understanding of mathematics alongside the specialist skills and knowledge required to be a maths teacher. The development of the university’s Mathematics and Education Secondary Teacher Degree Apprenticeship programme is being led by the same team that manage its Ofsted-rated 'Outstanding' ITE programme in its UK top 10 and globally recognised School of Education.* Professor Stefanie Sullivan, Deputy Head of the School of Education and Chair of Universities Council for the Education of Teachers (UCET) explains: 'The teacher degree apprenticeship is an innovative approach to addressing the gap in recruitment of people into maths teaching roles. Partnering schools will support apprentices to gain the knowledge, skills and behaviours of highly effective maths teachers through training at university and in school.' Schools partnering with the university on the funding pilot will receive financial incentives to support apprentice salary costs alongside being able to use the Apprenticeship Levy to cover the programme fees (eligibility criteria applies). Sam Woolley, Employer Engagement Manager in the University’s Institute of Professional and Work-based Learning states that: ‘Apprenticeships are a unique way of bringing high-quality talent into an organisation where impact is immediate. Schools partnering with us are making a long-term investment in their future workforce to tackle a real challenge in the sector. In general, we see this commitment from both parties result in high retention of apprentices upon completion of their programme. It also results in trainee teachers who develop into their roles within the culture of their organisation, becoming extremely effective in their place of work.’ The new apprenticeship standard (currently in review) is not expected to require potential apprentices to hold an undergraduate degree, instead supporting them to complete a degree as part of the programme as well as achieving qualified teacher status (QTS). This opens the doors to school leavers, as well as those who don’t hold a degree but are looking to reskill or upskill to pursue a career in education. Associate Professor Tom Wicks from the School of Mathematics who is developing the programme alongside the ITE team explains: Ruth Eccles, Head of Degree Apprenticeships at the University of Nottingham says: ‘The university is absolutely committed to developing apprenticeships that benefit not only the country’s businesses but our local community. Our apprenticeships are already supporting skills development in our region’s healthcare settings, so expanding that offer to support our local education establishments to address their skills gaps feels like natural progression.’ Both potential employers and apprentices are invited to register their interest in the university’s new Mathematics and Education Secondary Teacher Degree Apprenticeship. This will enable them to be kept up to date with the university’s development of the programme. * The School of Education is in the top 10 in the UK and top 50 worldwide in the QS World Rankings by Subject 2024."
        }
    ],
    "pdf_files": []
}