{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/case-studies/phenotypeca",
    "content": [
        {
            "p": "Phenotypeca Phenotypeca are revolutionising drug development, helping to produce life-saving medicines such as vaccines and therapies for cancer and infectious diseases. Based at Nottingham’s BioCity, the company develop advanced recombinant protein therapeutics, which are produced using innovative yeast strain engineering and genomics. In an industry where the use of data brings significant competitive advantage, Phenotypeca identified the need for in-house capabilities for big data analytics and machine learning (ML) to deliver the needed step-change to its operations and increase productivity. By introducing ML and identifying complex genomic traits to improve yeast strains, called quantitative trait loci (QTL), Phenotypeca projected they could enhance their commercial offering and secure new contracts and high-value intellectual property (IP) manufacturing licenses in a $200 billion global market. Knowledge Transfer Partnerships (KTPs) are a three-way collaboration between a UK-based business or charity, a research organisation, and a qualified graduate known as a KTP Associate, who has the capability to lead a strategic business project. The partnership paired Phenotypeca with data scientist and KTP Associate Yue Hu, guided by Markus Owen, Professor of Mathematical Biology at the University of Nottingham’s Centre for Mathematical Medicine and Biology. Supported by Professor of Computational Chemistry, Jonathan Hirst and Simon Preston, Professor of Statistics and Applied Mathematics. With experience in QTL analysis and statistics, Yue was embedded within the company to drive the project forward and bridge the gap between academia and the commercial challenges faced by Phenotypeca. Previously hampered by the complexity of analysing such a diverse range of data, the partnership has delivered a project that has helped Phenotypeca generate QTLs, IP, and data for predictive modelling and ML, while eliminating much of the complexity in diverse datasets through innovative new approaches. Building upon previous research at the company, the partnership delivered a highly successful project, providing high efficiency data gathering with continuous feedback to the experimenters to test the predictability of models. Yue soon grasped the many challenges and complexities of analysing such a diverse range of datasets, and in response to this, through close collaboration, helped develop pioneering new approaches aligned with Phenotypeca’s ambitious commercial strategy. The KTP has been transformative in informing the yeast strain development process; this has resulted in optimised strains with associated IP, which are the company’s main products. Yue’s expertise and team approach have led to the development of new practices that have become a cornerstone of Phenotypeca’s business strategy and which are sure to continue long after the project's completion. The expert knowledge and skills introduced into the company through the KTP have been further embedded, with many technical staff now trained, able to apply the methods, and aware of their power and potential for boosting Phenotypeca’s commercial prospects. The partnership has also helped future-proof the company by setting the foundations to realise the ultimate goal of ML predictability while capitalising on other capabilities that emerged during the KTP. Finally, Yue remains at Phenotypeca, having joined the team on a permanent basis leading on QTL analysis and ML projects."
        }
    ],
    "pdf_files": []
}