{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/degree-apprenticeships/frequently-asked-degree-apprenticeship-questions.aspx",
    "content": [
        {
            "p": "Here's a selection of things we hear asked by employers, answering some potential questions you may have All fees associated with an apprenticeship should be paid by the sponsoring employer, this includes travel and accommodation where necessary. Funding is available to help cover the cost of programme fees and you may be eligible for incentive payments to contribute to any additional costs. Find out more about apprenticeship funding. From August 2022, apprentices working full-time (over 30 hours a week) must spend the equivalent of a minimum of six hours a week undertaking off-the-job training - as detailed in the apprenticeship funding rules. As the degree apprenticeships at the University of Nottingham are level 6 and 7 (bachelors and masters level) the majority of programmes will require a commitment in excess of six hours. It is important for both the apprentice and their employer to be familiar with the off-the-job training requirements of their apprenticeship programme. The off-the-job training hours for each apprentice is calculated and shared with them and their employer during the onboarding process and outlined in their specific training plan. Read more in our off-the-job training guide As part of the application and enrolment process, we will carry out an individual needs assessment. This will enable us to determine existing levels of skills, knowledge and behaviours, and build a personal plan for each apprentice that will set out all the learning, tutorial support, and resources provided by the university. Something on your mind? We've collated some questions our apprentices sometimes have when considering a degree apprenticeship. Before applying for a degree apprenticeship you must: For more information please see our Guide to becoming a degree apprentice. The university does not act as a recruitment agency and does not match potential apprentices with employers. However, you view our partner employer apprenticeship vacancies on our website or search the Find an Apprenticeship service for apprenticeship vacancies in your area. No. Apprentices do not pay fees, these are covered by your employer. Apprentice’s wages are set by their employer. New vacancies will advertise the salary/wage associated with the role. Please speak to our Degree Apprenticeship Team who will be able to advise if your qualifications or experience will satisfy the entry requirements of the programme. How do I find time to undertake my studies on top of my work? As part of their commitment to the apprenticeship, your employer must give you access to at least 20% of your contracted hours to dedicate to your off-the-job learning. This protects this time within your working hours for study."
        }
    ],
    "pdf_files": []
}