{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/recruit-our-students-and-graduates.aspx",
    "content": [
        {
            "p": "Recruiting our students and graduates can bring fresh thinking and insights to your business. Our students and graduates are highly-sought after by some of the world’s top companies, innovative start-ups, and third-sector organisations. Whether you have one vacancy or 100, to be filled now or after graduation, advertise your roles for free through MyCareer – our online jobs board. Email recruiterservices@nottingham.ac.uk to find out more about MyCareer, our recruitment fairs, employer presentations and how best to promote your opportunities and enhance your workforce. If you’re looking for a graduate to work on a specific project, we offer three programmes that could be benefit your business: For more information, please contact our Recruiter Services team recruiterservices@nottingham.ac.uk For short-term projects, our students can bring a fresh perspective through work experience or an internship. Whether it’s a holiday placement or a year-long position, advertise work experience or internship roles for free on MyCareer – our online jobs board – or through our recruitment fairs. Email our Recruiter Services team recruiterservices@nottingham.ac.uk There are other ways you can tap into the knowledge and expertise of our students: Short term schemes Year-long schemes For more information on the above schemes, please contact our Recruiter Services team recruiterservices@nottingham.ac.uk If you’re looking to recruit students or graduates for part-time, temporary roles, get in touch with the Unitemps team – part of the Careers and Employability Service. With a huge database of student and graduate candidates actively looking for flexible-work opportunities, we can help you find the right person for the role. To recruit through Unitemps, please contact our team at recruit.unitemps@nottingham.ac.uk or call 0115 748 4189."
        }
    ],
    "pdf_files": []
}