{
    "url": "https://www.nottingham.ac.uk/workingwithbusiness/case-studies/smart-manufacturing-technology-ltd",
    "content": [
        {
            "p": "Smart Manufacturing Technology Ltd Smart Manufacturing Technology (SMT) is a global leader in mechanical transmission engineering services and software development. With over 20 years’ experience of delivering expert technical services for the automotive, industrial, aerospace, energy, and marine sectors, the Nottingham-based firm also provides next-generation software for the design, analysis and optimisation of transmissions. To support SMT’s ambition to become market leaders in transmission, electric machine and electrified powertrain innovation, the company was looking for support to expand its software portfolio by developing new functionality for the design and analysis of electric machines. Aiming for a complete solution for the design and analysis of electrified powertrains, with no such tool available on the open market, and with limited in-house knowledge of electric machines, SMT turned to the University of Nottingham’s Power Electronics, Machines and Control (PEMC) Research Group. Knowledge Transfer Partnerships (KTPs) are a three-way collaboration between a UK-based business or charity, a research organisation, and a qualified graduate known as a KTP Associate who has the capability to lead a strategic business project. This dynamic partnership saw SMT paired with research engineer and KTP Associate, Dr Nisarg Davé. He was guided by the academic expertise of UoN’s Zero Carbon Cluster lead, Professor Chris Gerada, Professor of Electric Machines at the PEMC, and Associate Pro-Vice-Chancellor for Industrial Strategy, Business Engagement and Impact, and Professor David Gerada, Professor of Electrical Engineering. Driving the project, Nisarg was embedded within the company to bridge the gap between academia and industry. Throughout the partnership, the team undertook a series of rigorous tests and validation exercises on electric machines and embedded the acquired knowledge into SMT’s software code capabilities. Advancements made during the KTP have supported the development of new, specialised software capabilities for designing and analysing electric machines, significantly enhancing SMT’s competitiveness. Committed to further embedding knowledge into the business, SMT has expanded its electric machines team to meet the growing demands of its services. Additionally, by collaborating with SMT, the university has gained extensive knowledge in gearbox technologies and the interactions between electrical machines and gearbox systems. Further enhancing the PEMC’s Research Group’s capabilities and complimenting the university’s Zero Carbon Cluster ambitions in electrification. \"In this KTP we melded the University of Nottingham’s expertise in electrical machines with SMT’s expertise in transmissions to help develop a unique software package suitable for the design and modelling of next-generation electrified powertrains for clean transport. By translating our research into real-world solutions, we are not only driving economic growth locally in the East Midlands but also making a tangible global impact on the future of sustainability in the journey towards decarbonisation of transport. The insights gained from this collaboration with SMT supported the development of a software platform which for the first time can co-design transmissions and electric motors whilst capturing the complex interactions between these two key components. These capabilities open up exciting avenues in achieving electrified powertrains optimised for specific targets such as power density, driveability, cost competitiveness or embedded carbon.\" Professor David Gerada Professor of Electrical Engineering, University of Nottingham Nisarg completed his PhD whilst working with SMT, applying his research into electric machines to the project. During the KTP, he authored and presented a paper on Alternate Current (AC) winding losses at the 2023 International Conference on Electrical Machines and Systems, which won the Best Paper Award. \"Through my two-year KTP experience, I not only supported developing a new business with the application of my technical expertise but also gained invaluable lessons in management and leadership through various training, courses and from SMT. The insights from colleagues at SMT and the University of Nottingham have been instrumental in advancing my research and development career.\" Dr Nisarg Davé Research Engineer, SMT Following the completion of the KTP, Nisarg remained with SMT as a Research Engineer working with the team to further develop SMT’s capabilities."
        }
    ],
    "pdf_files": []
}