{
    "url": "https://www.nottingham.ac.uk/z-oldsites/global/the-european-union/the-european-union.aspx",
    "content": [
        {
            "p": "The UK government has reached an agreement with the European Union on a future relationship which took effect from 1 January 2021. The University of Nottingham will remain a community devoted to global education, diversity and mobility. We will maintain and grow our global connections and partnerships for teaching, research and student exchanges, reaching from our campuses in the UK, China and Malaysia to many other countries across Europe and the world beyond. The following information provides a summary of the key points of the agreement as they apply to universities, together with links to more detailed briefing provided by Universities UK. The UK will participate in the Horizon Europe programme as an associated country, which means UK-based researchers will be able to participate in all parts of Horizon Europe, including There was also agreement on UK participation in the Euratom Research and Training programme for 2021-25, which covers the ITER fusion partnership, as well as the Copernicus Earth observation programme. Find out more about changes to the UK's involvement in Horizon Europe The UK government has decided not to seek participation in the new Erasmus+ programme after 2022 however, University of Nottingham students will still be able to access Erasmus+ grants during the 2020-21 academic year. The UK government has also launched the Turing Scheme, providing £100 million in funding for 35,000 students in universities, colleges and schools to go on placements abroad from September 2021. Further information on funding opportunities for current students will be advertised during the spring term 2021. Find out more about student mobility after brexit The UK and EU have agreed visa-free travel for tourist visits of up to 90 days within a 180-day period. However, there are additional actions which might be required if travelling to the EU for work or study, even for a short period of time. For instance, a visa, work permit or other documentation might be required. Further information can be found on gov.uk. Current students who are planning to travel to the European Union during the 2020-21 academic year for a study or work placement should refer to the gov.uk website for information on the requirements for individual countries. These new rules do not apply to travel to Ireland, and British and Irish citizens can continue to move freely between the UK and Ireland as part of the Common Travel Area arrangements. Find out more about the new immigration rules UK nationals with a European Health Insurance Card (EHIC) can continue to use them in the EU until they expire. However, these EHICs can no longer be used in Switzerland, Norway, Iceland or Liechtenstein. EHICs will be replaced by a free UK Global Health Insurance Card (GHIC). This card covers some medical care but is not a replacement for travel insurance. EU students who start a course in the UK during the 2020-21 academic year are eligible for UK home student fees and financial support, in the form of the tuition fee loan in England, Wales, and Northern Ireland. Nothing will change for them throughout their degree. EU students not covered by the Withdrawal Agreement who start a course in England, Northern Ireland, Scotland, and Wales during the 2021-22 academic year, and the following years, will no longer be eligible for home fee status and tuition fee loans. EU nationals with settled or pre-settled status under the EU Settlement Scheme, and who meet the relevant eligibility requirements in force at the time of course commencing, will have access to home fee status and student financial support in the 2021-22 academic year. For those subject to international fees, the amount will depend on the university and the type of degree and will vary between institutions. We advise EU students to reach out to the universities they are interested in with specific questions on international fee levels for the degree they have in mind. Find out more about fee implications Yang Fujia Building Jubilee Campus Nottingham, NG8 1BB Telephone: +44 (0) 115 748 4812 Make an enquiry"
        }
    ],
    "pdf_files": []
}